{"uuid": "368c4727-e71a-044a-9a94-782562fce2db", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-12T10:14:36", "title": {"en": "Biochemistry", "et": "Biokeemia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVBS01", "name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "email": "biokeemia@ut.ee", "phone": "+372 737 4310", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/biokeemia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}, "label": {"en": "24/25 S regular MV Eng", "et": "24/25 K PÕ MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS01", "structural_unit_name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 14, "practice": 8, "seminar": 18, "independent_work": 38, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Biochemistry in Faculty of Medicine is a subject, which introduces medical students to the classification and nomenclature of human body biomolecules, explains configuration, conformation and stereochemistry of metabolites and other biomolecules. General types of metabolic reactions of human body and their biomedical background are important parts of subject. Furthermore, structure and biomedical characteristics of structural and functional biomacromolecules as peptides, proteins, carbohydrates, lipids and nucleic acids are introduced. Last part of Biochemistry deals with mixed macromolecules and structure of cellular membrane. This Biochemistry is medicine-based subject, therefore all examples of human body biomolecules and reactions are chosen on the basis of human metabolism and today´s medical diagnostics.", "et": "Arstiteaduskonna biokeemia on õppeaine, mille vältel tutvutakse metaboliitide ja teiste inimorganismi biomolekulide klassifikatsiooni ja nomenklatuuriga, omandatakse antud ühendite konfiguratsiooni, konformatsiooni ning stereokeemia põhialused. Kursuse põhitähelepanu on pööratud inimese metabolismis toimuvatele põhireaktsioonidele ning nendes osalevatele heterofunktsionaalsetele ja heterotsüklilistele metaboliitidele. Samuti käsitletakse biomakromolekulide, nagu peptiidide, valkude, süsivesikute, lipiidide ja nukleiinhapete ülesehitust ning biokeemilis-meditsiinilisi omadusi. Antud õppeaine viimane osa käsitleb segamakromolekule ning raku välismembraani ehitust. Kursus on üles ehitatud meditsiinikeskselt, st. reaktsioonide ja metaboloomi moodustavate biomolekulide näited on valitud inimorganismist lähtuvalt, kusjuures põhitähelepanu on pööratud nende reaktsioonide mehhanismidele, millel baseerub tänapäevase meditsiini diagnostika ja ravi."}, "objectives": [{"en": "Biochemistry in Faculty of Medicine is a medicine-based subject, which introduces chemical structure of low molecular weight metabolites and polymeric biomolecules of human body, reactivity of their functional groups and major metabolic reactions. (Basically, subject is: General Principles of Medical Metabolomics). The aim of teaching of Biochemistry is to give general knowledge about human body bioactive molecules from the medical metabolomical viewpoint, which can be used as good basis in studies of medical biochemistry and other subjects following biochemistry (physiology, pharmacology, patophysiology, microbiology, clinical biochemistry etc.)", "et": "Arstiteaduskonna biokeemiakursus on meditsiinipõhine õppeaine tutvustamaks inimorganismi madalmolekulaarsete metaboliitide ja kõrgmolekulaarsete biomolekulide ehitust, nende funktsionaalsete rühmade reaktiivsust ja tähtsamaid inimorganismis toimuvaid reaktsioone. (Sisuliselt on õppeaine: Meditsiinilise metaboloomika alused) Antud õppeaine õpetamise eesmärgiks on varustada tudengid meditsiinilise metaboloomika põhise baasmaterjaliga inimorganismi bioaktiivsete molekulide kohta, mis annab tudengitele hea lähtekoha meditsiinilise biokeemia ning ka teiste järgnevate kursuste (füsioloogia, farmakoloogia, patofüsioloogia, mikrobioloogia, kliinilise biokeemia jne.) omandamisel."}], "learning_outcomes": [{"en": "The student who graduated the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- has an overview of basic concepts of organic chemistry and knows classification of human body biomolecules;", "et": "- tunneb inimorganismi ehitust ja talitlust nii tervikuna kui kõikidel tema organisatsioonitasemetel ning oskab asetada neid teadmisi kliinilisse konteksti (aine õpiväljundid vastavad õppekava mooduli \"Erialaained\" õpiväljundite punktile 1 a);"}, {"en": "- can name human body biomolecules by international (IUPAC) nomenclature;", "et": "- tunneb ja eristab inimorganismi biomolekulide põhilisi aineklasse ning oskab anda antud ühenditele nimetusi süstemaatilise nomenklatuuri (IUPAC) järgi;"}, {"en": "- knows basic concepts of structure and stereochemistry of human body biomolecules;", "et": "- teab ja oskab kasutada inimorganismi biomolekulide ülesehituse ja stereokeemia põhimõisteid;"}, {"en": "- knows basic reactions occurring in human body;", "et": "- teab ja oskab kirjutada põhilisi inimorganismis toimuvaid tüüpreaktsioone;"}, {"en": "- knows structure of biomolecules (important metabolites, peptides, proteins, saccharides, lipids, nucleic acids) and also their biofunctions and biomedical importance;", "et": "- tunneb biomolekulide (tähtsamate metaboliitide, peptiidide, valkude, sahhariidide, lipiidide ja nukleiinhapete) ülesehitust, teab nende biofunktsioone ja meditsiinilist tähtsust;"}, {"en": "- knows structure and biomedical importance of biomembranes;", "et": "- teab rakumembraani ülesehitust ning membraanide bioloogilist ja meditsiinilist tähtsust;"}, {"en": "- can orientate in basic terms of medical metabolomics and bioorganic chemistry, describe and discuss about structural features needed for certain biofunctionality of metabolites, high molecular weight biomolecules, and drugs.", "et": "- orienteerub meditsiinilise metaboloomika ja bioorgaanilise keemia põhimõistete valdkonnas, oskab tuua nendekohaseid näiteid ja kasutada neid teadmisi ravimite ja teiste bioaktiivsete molekulide funktsionaalsuse kirjeldamiseks."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "4 test-papers: Grades for tests from A-E :\nA -; The answer contains the facts asked for in the question. The answer is illustrated/equipped with suitable biochemical-medical practical examples and explanations of mechanisms corresponding to the question. The explanative part is logical and reflects a profound understanding of the matter by the student. The answer may contain some minor errors.\nB - The answer contains the facts asked for in the question. The answer is illustrated/equipped with suitable biochemical-medical practical examples and explanations of mechanisms corresponding to the question. The explanative part is logical and reflects a profound understanding of the matter by the student. The answer contains some errors and shortcomings, but not in general principles. The explanatory part is a must.\nC -; The facts asked for in the question are presented partially. The answer may contain a few principal mistakes and the explanatory-illustrative material may be presented poorly indicating that the general understanding of the matter by the student is superficial in places.\nD -; The facts asked for in the question are presented patially or with errors. The answer may contain some principal errors and the examples are not theme-linked, are missing or are in inconsistency with the biological logic. The anwer shows that the knowledge of the matter by the student is superficial.\nE -; The facts asked for in the question are presented with major mistakes and shortcomings."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "The preliminary examination protocol contains evaluations &#8222;passed\" or &#8222;not passed\". In the diary at the department also a numeric value for the preliminary examination is calculated by the same principle that is used for evaluating tests.\nThe knowledge of a student gets evaluated as &#8222;passed\" when the numeric evaluation corresponds to levels &#8222;A\" to &#8222;E\". If a student does not manage to pass the examination in two first attempts, the third (and last chance for pass) is done with at least one additional expert in the field beside the course principal present. In the latter case all council members may participate in evaluation whether the student' knowledge is sufficient for pass or not."}}], "grade_preconditions": {"et": "For preliminary exam all tests should have been made on positive grade. You will get preliminary exam automatically when test grades are all at least \"C\" and aggregate grade is at least \"B\".  It also assumes that there are not more than 2 missed seminars during the semester and no more than 1 test is retaken or done with a delay."}, "grade_evaluation": {"et": "The preliminary examination protocol contains evaluations \"passed\" or \"not passed\". In the diary at the department also a numeric value for the preliminary examination is calculated by the same principle that is used for evaluating tests.\nThe knowledge of a student gets evaluated as \"passed\" when the numeric evaluation corresponds to levels \"A\" to \"E\". For preliminary exam all tests should have been made on positive grade. You will get preliminary exam automatically when test grades are all at least \"C\" and aggregate grade is at least \"B\". (If test grades are 3x \"A\" and 1x \"D\", and aggregate grade is \"B\", you have to make preliminary exam!!!)"}, "debt_elimination": {"et": "Retake of tests is mandatory for missed or failed tests.  All debts of practical works and seminars have to be corrected by the end of regular schoolwork during the same semester. The principals of a retake of the preliminary exam are established by the Tartu University study regulations, presented in the official handbook of the medical faculty"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=2927", "is_moodle_connected": true, "learning_environments": [{"uuid": "18899ece-ac4b-4f91-9b97-20e3ea08204c", "type": "MOODLE", "code": "ARBK.01.029_ENG", "base_url": "undefined", "linked_to_groups": ["8bd79870-baf1-0bd7-0e94-f57d83c0c0c7", "3efff125-0db0-0581-6541-d5aeeeaf6f64"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1. U. Soomets, A. Rehema, R. Porosk, M. Zilmer. Biochemistry (Part I) Metabolites of human body: Structure, reactivity and biofunctions. Tartu, 2018. \n2. M. Zilmer, A. Rehema, K.Zilmer, U. Soomets, T. Kullisaar. Biochemistry (Part II) Biomolecules of human body: biochemical and clinical aspects. Tartu 2013.", "recommended_materials": "Textbook of Biochemistry: with clinical correlation / edited by Thomas M. Devlin. N.Y: Wiley, 2011."}, "participants": {"lecturers": [{"person_uuid": "4be4b85c-8f88-0065-4fd7-75796a0f04c5", "person_name": "Kalle Kilk", "structural_unit": {"code": "MVBS01MK", "name": {"en": "Chair of Medical Biochemistry", "et": "meditsiinilise biokeemia õppetool"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "MVBS01"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}, "12. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "427f6bc8-92f2-c3b5-10df-811ca0fb64ff", "person_name": "Rando Porosk", "structural_unit": {"code": "MVBS01", "name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "email": "biokeemia@ut.ee", "phone": "+372 737 4310", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/biokeemia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "12. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "58b4bbff-a27b-8815-3012-1e72777e6043", "person_name": "Egon Taalberg", "structural_unit": {"code": "MVBS01", "name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "email": "biokeemia@ut.ee", "phone": "+372 737 4310", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/biokeemia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "12. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}], "study_groups": [{"uuid": "8bd79870-baf1-0bd7-0e94-f57d83c0c0c7", "code": "11. rühm"}, {"uuid": "3efff125-0db0-0581-6541-d5aeeeaf6f64", "code": "12. rühm"}]}, "schedule": {"weeks": {"et": "24.-30.n. 2L, 25.-37.n. 2S/P n-s, 4 knt  A"}, "entries": [{"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Biochemistry and medicine. Stereochemistry and isomerism of compounds. Native conformation and biofunctions."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Alcohols, aldehydes, carboxylic acids and heterofunctional compounds as metabolites or coenzymes. Central biochemical reactions."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Amino acids and peptides of human body: structure, biofunctions and biomedical importance."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Mono-, oligo- and polysaccharides in human body: structure, biofunctions and biomedical importance."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Lipids, sterols and steroids in human body: structure, biofunctions and biomedical importance."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Nucleotides and nucleic acids in human body: structure, biofunctions and biomedical importance."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Mixed macromolecules in human body: structure, biofunctions and biomedical importance."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "24th week:  -Introduction. Safety at the lab. Nomenclature. Isomerism (medical importance). Analysis of configuration and conformation of biomolecules and drugs. Conjugation of organic compounds (1 h)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "- Build models of ethane and cyclohexane, their spatial structure (1 h)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "25th week:   -Problem-based analysis: Conjugation and aromatic nature of org. compounds (including drugs) as basis of stability and bioactivity of organic compounds. Models of benzene and chiral molecules. Important reactions in human body."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "26th week:   Heterofunctional and heterocyclic organic compounds in the cell (biomed. background).\n- Aromaticity"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "27th week:  -TP 1: Nomenclature, configuration, conformation, isomerism and aromaticity."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "28 th week:   -Amino acids and peptides of human body (structure, medical background). Essential amino acids. Model of peptide bond (0,5 h)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Study of properties of the polypeptides and identification of peptide bond (1,5 h)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "29th week:  -Proteins, their structural levels, biofunctions (0,5 h)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Training of pippeting. Control exercises of pipetting (1,5 h)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "30th week:  -Quantitative assay of proteins (Lowry method)."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "31st week:   -TP 2: Amino acids, peptides and proteins."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "32nd week:   -Carbohydrates in food, cells and body fluids (monosaccharides, disaccharides, starch, glycogen). Models of glucose and disaccharide. Heteropolysaccharides, glucosaminoglycans. Glucoproteins (1h)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Study of properties of the carbohydrates (1h)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "33rd week:  -Problem-based analysis: The structure and biofunctions of the lipids in human body. Soaps."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "34th week:  -Nucleotides. Nucleic acids: structure and biofunctions. ATP."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "35th week: -TP 3: Carbohydrates, lipids, nucleic acids."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "36th week: -E-learning: Bioelements, water, cell membrane, its structure and biofunctions. Glycoproteins. Videolectures"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "37th week: -TP 4: Bioelements, water, cell membrane, its structure and biofunctions. Glycoproteins."}}]}, "registration_info": {"audience": {}, "min_students": 12}, "parent_uuid": "0c4bc112-28e5-a9f1-ee51-9b941f1f7ab0", "parent_code": "ARBK.01.029", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}