{"uuid": "c09bc2ed-eeda-49d8-02cf-553f7e09b813", "code": "mv-2018-autumn-fulltime-c5", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Medical Biochemistry", "et": "Meditsiiniline biokeemia"}, "credits": 5, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVBS01", "name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "email": "biokeemia@ut.ee", "phone": "+372 737 4310", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/biokeemia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}, "label": {"en": "18/19 A regular MV", "et": "18/19 S PÕ MV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS01", "structural_unit_name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 24, "practice": 7, "seminar": 34, "colloquium": 0, "web_learning": 0, "independent_work": 65, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "This course provides students with basic knowlegde of contemporary Medical Biochemistry and develop biochemical-clinical thinking. The following problems are highlighted: a) basic biomolecules of human body (their structure an biofunctions); e) vitamins and hormones and human organism (including science-based analysis of medical preparations of vitamins); c) overview of metabolism of carbohydrates, lipids, amino acids, nucleic acids; d) biochemical background of detoxification of xenobiotics (including drugs); c) science-based analysis of role of human nutrients and principles of nutrition.", "et": "Ainekursus annab üliõpilastele baasteadmised kaasaegsest meditsiinilisest biokeemiast ja arendab biokeemilis-kliinilist mõtlemist. Käsitlemist leiavad järgmised teemad: a) inimorganismi baasbiomolekulid, nende struktuur ja biofunktsioonid; b) vitamiinid ja hormoonid ning inimorganism (sh vitamiinide meditsiiniliste preparaatide teaduspõhine analüüs); c) ülevaade süsivesikute, lipiidide, amino- ja nukleiinhapete metabolismist; d) ksenobiootikumide (sh ravimite) detoksikatsiooni biokeemiline taust; e) toitainete roll inimorganismis ja toitumispõhimõtete teaduspõhine analüüs."}, "objectives": [{"en": "Primary aims of this course: a) To give an updated discussion of the selected and in practical work relevant knowledge about human body biomolecules and the metabolic events, underlying the specific functions of cells of the human body and disorders. b) To give an updated and human body oriented biochemical basis of medicinal products containing of vitamins and/or minerals and cosmetics, food additives and analyse pharmaceutically important aspects of nutrition. c) To develop biochemical-pharmaceutical thinking and to create the basis for using the biochemical experience in the practice of the future and to guarantee the systemic acquiring of new scientific conceptions in the field of biochemistry.", "et": "Õppeaine peamisteks eesmärkideks on: a) Anda nüüdisaegsel tasemel ja praktilises töös olulisi teadmisi inimorganismi biomolekulidest ja metaboolsetest protsessidest, millel põhinevad inimorganismi rakkude spetsiifilised                           funktsioonid ja tegevuse häired. b) Anda nüüdisaegseid ja inimorganismile orienteeritud biokeemilisi baasteadmisi vitamiinide, mineraalide (sh nende meditsiiniliste preparaatide), toidulisandite ja lisaainete (E-ainete) kohta ning analüüsida toitumise farmatseutiliselt tähtsaid aspekte. c) Arendada üliõpilastel biokeemilis- farmatseutilist mõtlemist                           ja luua baas biokeemilise vilumuse kasutamiseks tulevases praktikas."}], "learning_outcomes": [{"en": "The student who graduated the course should mastered: a) the selected and in practical work relevant knowledge about human body biomolecules and the metabolic events, underlying the specific functions of cells of the human body and disorders; b) human body oriented selected and in practical work relevant knowledge and biochemical basis of preparation of vitamins, minerals and cosmetics, food additives and pharmaceutically important aspects of nutrition; c) principles of biochemical-pharmaceutical thinking for creating the basis for using the biochemical experience in the practice of the future and to guarantee the systemic acquiring  of  new scientific conceptions.", "et": "Kursuse läbinud üliõpilane: \r\n- on omandanud nüüdisaegsel tasemel ja praktilises töös olulised teadmised inimorganismi biomolekulidest ja metaboolsetest protsessidest, millel põhinevad inimorganismi rakkude spetsiifilised funktsioonid ja tegevuse häired;\r\n- oskab kasutada nüüdisaegseid ja inimorganismile orienteeritud biokeemilisi baasteadmisi vitamiinide, mineraalide (sh nende meditsiiniliste preparaatide), toidulisandite ja lisaainete (E-ainete) kohta;\r\n- on võimeline teaduspõhiselt analüüsima toitumise olulisi aspekte ning kasutama \r\nbiokeemilis- farmatseutilist lähenemist ja omandatud biokeemilise analüüsi vilumust praktikas."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "3 kontrolltööd: \r\nA &#8211; Vastus sisaldab küsimuses nõutud faktiteadmisi. Vastus on illustreeritud korrektsete teemakohaste biokeemilis-meditsiiniliste praktiliste näidetega ning selgitustega mehhanismide kohta. Selgitav arutlus on loogiline ja peegeldab üliõpilase sügavat arusaamist teemast. Vastuses võib esineda üksikuid pisivigu.\r\nB - Vastus sisaldab küsimuses nõutud faktiteadmisi. Vastus on illustreeritud korrektsete teemakohaste biokeemilis-meditsiiniliste praktiliste näidetega ning selgitustega mehhanismide kohta.  Selgitav arutlus on loogiline ja peegeldab üliõpilase sügavat arusaamist teemast. Vastuses esineb väikeseid vigu ja puudujääke, kuid mitte eksimusi üldistes põhimõtetes ja kesksete näidete puudumist.\r\nC - Küsimuses nõutud faktiteadmised on esitatud osaliselt. Vastuses võib  olla üksikuid põhi-mõttelisi eksimusi  ja näidetega illustratsioon on kesine, st et üliõpilase arusaamine teemast on kohati pinnapealne. \r\nD - Küsimuses nõutud faktiteadmised on esitatud osaliselt ja/või vigadega. Vastus võib sisaldada üksikuid põhimõttelisi vigu ja selged näited puuduvad, st üliõpilase arusaamine teemast on pinnapealne  (puuduvad näited, või on vastuolu loogikaga).\r\nE - Küsimuses nõutud faktiteadmised on esitatud puudulikult ja märkimisväärsete vigadega."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Suuline eksam:\r\nHindamiskriteeriumid samad, kui kontrolltööde juures märgitud."}}], "grade_preconditions": {"et": "Eksamile pääsemiseks peavad olema positiivsele hindele sooritatud kõik kontrolltööd ja testid ning  praktikumide/seminaride koondhinne peab olema vähemalt \"D\". Samuti peab olema sooritatud kohustusliku eeldusaine - ARBK.01.042 bioorgaaniline keemia - eksam."}, "grade_evaluation": {"et": "Suulise eksami küsimused on koostatud probleemanalüüsidena. Koondhinde  \"A\" korral tuleb eksamil läbi viia üks probleemanalüüs, \"B\" korral 2,  \"C\" korral 3 ja \"D\" korral 4 probleemanalüüsi. Kui semestri tegevus on olnud mistahes põhjusel tagasihoidlikum, tuleb seda lõpphinnangu andmiseks eksamil põhjalikumalt analüüsida. Inimorganismiga seotud ainetes ei saa teadmised olla mingil juhul alla vajaliku kvaliteedi."}, "debt_elimination": {"et": "Praktikumide ja seminaride võlgnevused tuleb likvideerida sama semestri regulaarse õppetöö lõpuks. Kontrolltööde järeletegemine on võimalik hiljemalt regulaarse õppetöö viimasel nädalal. Eksami järelsooritamise korra aluseks on TÜ õppekorralduseeskiri."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://biomedicum.ut.ee/arbk/oppetoo/proviisoriope", "is_moodle_connected": false, "mandatory_materials": "1.  M. Zilmer, A. Rehema, U. Soomets, K. Zilmer. Inimkeha põhilised biomolekulid (meditsiiniliselt tähtsamad ülesanded). Inimorganismi metabolism (biokemism ja kliinilised aspektid). Bio- ja siirdemeditsiini instituut, biokeemia osakond, Arstiteaduskond, Tartu Ülikool, 2015. 2. M. Zilmer, U. Kokassaar, A. Lill. Normaalne söömine, Tartu, 2015. AS BIT, ISBN 978-9985-2-2169-3."}, "participants": {"lecturers": [{"person_uuid": "1f0619c7-2805-367d-c66e-febd4c8c051f", "person_name": "Ceslava Kairane", "structural_unit": {"code": "MVBS01MK", "name": {"en": "Chair of Medical Biochemistry", "et": "meditsiinilise biokeemia õppetool"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "MVBS01"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "1. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}], "study_groups": [{"uuid": "ebdb41bd-3e68-ceb6-d610-490e8efca065", "code": "2. rühm"}, {"uuid": "84ce76b7-0dc1-1505-59cb-ed583f8c7179", "code": "1. rühm"}]}, "schedule": {"weeks": {"et": "9.n. 4 L; 10.-14.n. 4L, 6S/P; 15.n. 6S/P; 16.n. 5 S/P"}, "entries": [{"time": "2018-10-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ensüümid (biokatalüsaatorid)I. Nomenklatuur, klassifikatsioon. Nende roll diagnostikas ja ravis."}}, {"time": "2018-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ensüümid II. Molekulaarhaigused. Perspektiivsed ravimid/ravivõtted (antisense tehnoloogia jt)."}}, {"time": "2018-11-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Segamakromolekulid: ehitus, funktsioonid, farmatseutiliste preparaatide märklauad. Membraanid. Ainete (ka ravimite) transport läbi membraani."}}, {"time": "2018-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Vitamiinid ja vitamiinpreparaadid. Mitteteaduslik info ja nüüdisaegne teaduslik analüüs (I)."}}, {"time": "2018-11-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Vitamiinid ja vitamiinpreparaadid. Mitteteaduslik info ja nüüdisaegne teaduslik analüüs (II)."}}, {"time": "2018-11-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Hormoonid: nüüdisaegne klassifikatsioon ja nende toime biokeemiline taust. Hormoonid kui farmatseutilised preparaadid."}}, {"time": "2018-11-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Süsivesikud (SV) inimorganismis. SV metabolismi üldaspektid. SV metabolismi regulatsioon ja farmaatsiale suunatud kommentaarid."}}, {"time": "2018-11-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "SV metabolism. TKT - inimkeha keskne metaboolne rada. Bioloogiline oksüdatsioon ja oksüdatiivne fosforüülimine."}}, {"time": "2018-11-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lipiidid inimorganismis. Lipiidide metabolismi üldaspektid. Lipiidide metabolismi regulatsioon ja farmaatsiale suunatud kommentaarid."}}, {"time": "2018-11-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lämmastiku metabolism inimkehas. Aminohapped (AH) inimorganismis. AH metabolismi regulatsioon ja farmaatsiale suunatud kommentaarid. Puriinide ja pürimidiinide metabolism."}}, {"time": "2018-12-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Maksa metabolism: Ksenobiootikumide (s.h ravimite ja alkoholi) biotransformatsioon. Biooksüdatsiooni, tsütokroom P450 perekonna ja ravimite detoksikatsiooni biokeemiline taust. Heemi metabolism inimkehas. Raud kui heemi funktsionaalne alus ja farmaatsiale suunatud kommentaarid."}}, {"time": "2018-12-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Söömise biokeemia."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "10. n. Probleemanalüüs: Valkude klassifikatsioon ja biofunktsioonid: kollageen, elastiin, heemproteiinid ja vereplasma valgud."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "10. n.  Süsivesikud (SV) inimorganismis: klassifikatsioonid, isomeeria, biofunktsioonid. SV toidus, rakkudes ja kehavedelikes (mono- ja disahhariidid, glükogeen). SV derivaadid kui ravimpreparaadid"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "11. n. Lipiidid inimorganismis: klassifikatsioonid ja biofunktsioonid. Lipiidid toidus, rakkudes ja kehavedelikes. Lipiidid ja nende ehitusüksused. Lipiidide derivaadid kui ravimpreparaadid."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "11.n. Nukleiinhapped (NH) inimorganismis: struktuur ja biofunktsioonid. NH kasutamine praktikas (2 t)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Kolesterooli määramine (1 t)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "12. n. Test. Valgud, süsivesikud, lipiidid ja nukleiinhapped. \nProbleemanalüüs: Ensüümid inimorganismis: Ensüümide (valkude) eraldamise ja puhastamise üldised põhimõtted. Ravimid kui ensüümaktiivsuse regulaatorid. Ensüümide farmatseutilise kasutamise biokeemiline taust (2 t)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Ensüümide määramine - üldpõhimõtted ja konkreetse ensüümi aktiivsuse määramine (1 t)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "12. n. Probleemanalüüs: ensüümkatalüütilised reaktsioonid, ensüümaktiivsuse regulatsioon (1 t)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "- Konkreetse ensüümi aktiivsuse määramine (järg) (2 t)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "13. n. Knt 1. Ensüümid. \nVitamiinid. Sissejuhatus vitamiinide biokeemiasse. Hüpovitaminoosi, avitaminoosi ja hüpervitaminoosi biokeemiline taust. Konkreetsete vitamiinide toimemehhanismide biokeemiline taust."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "13. n. Probleemanalüüs: Vitamiinid ja mineraalained kui farmatseutilised preparaadid."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "14. n.  Knt. 2.  Vitamiinid inimorganismis ja vitamiinpreparaadid (1 t)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Vitamiin C kvantitatiivne määramine (2 t)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "14. n. Hormoonide biokeemia. Hormoonid kui farmatseutilised preparaadid (2 t)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Hormoonide määramise põhialused. Veresuhkru kvantitatiivne määramine (1 t)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "15. n. Knt. 3. Hormoonid. Hormonaalse regulatsiooni biokeemilised aspektid. \nSeedimise ja imendumise biokeemia. Seedimine ja imendumine: meditsiiniliste aspektide biokeemiline taust. Toidulisandid."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "15. n. SV metabolism inimorganismis. SV metabolismi põhiaspektid ja metabolismi häired (s.h ravimsõltuvus). Lipiidide metabolismi põhiaspektid ja metabolismi häired (s.h ravimsõltuvus). Aminohapete ja nukleotiidide metabolism inimorganismis. Biooksüdatsioon ja ravimid."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "16. n. Knt 4. SV, lipiidid, valgud, nukleotiidid: ainevahetus ja hormonaalne regulatsioon."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "16. n. Lõppseminar (2 t)."}}]}, "registration_info": {"audience": {}, "min_students": 18, "max_students": 36}, "parent_uuid": "7ff6b7f8-879c-d5b1-dd94-472f959413b1", "parent_code": "ARBK.01.043", "parent_credits": 5, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}