{"uuid": "81300026-b2a0-077e-f69f-9066d22877b0", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-23T11:56:14", "title": {"en": "Medical Biochemistry", "et": "Meditsiiniline biokeemia"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 6, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVBS01", "name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "email": "biokeemia@ut.ee", "phone": "+372 737 4310", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/biokeemia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}, "label": {"en": "24/25 S regular part 2 6 CP MV Eng", "et": "24/25 K PÕ 2. osa 6 EAP MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS01", "structural_unit_name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 24, "practice": 12, "seminar": 48, "independent_work": 72, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "564ff9eb-0e62-874f-3932-0b0db25acae7", "code": "ARAN.01.038", "title": {"en": "Anatomy", "et": "Anatoomia"}, "credits": 12, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "5d671478-f349-fdc0-aff5-de8f668e57c2", "code": "ARAN.02.005", "title": {"en": "Histology", "et": "Histoloogia"}, "credits": 8, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "0c4bc112-28e5-a9f1-ee51-9b941f1f7ab0", "code": "ARBK.01.029", "title": {"en": "Biochemistry", "et": "Biokeemia"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "97876184-2711-8639-4161-568512a69a7f", "code": "ARMP.01.029", "title": {"en": "Biology", "et": "Bioloogia"}, "credits": 10, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "fe2fc2f8-4397-cd3f-70a5-0647cdc79984", "code": "ARTH.02.056", "title": {"en": "History of Medicine", "et": "Meditsiiniajalugu"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Medical Biochemistry  is completely human organism-based topic  which uses contemporary new original specific textbooks. In particularly, the following problems are highlighted: -basic biomolecules of human body (disorders of structure and diseases); -clinically informative biochemical parameters of several fluids of human body; -assay of proteins and several clinical marker enzymes in fluids of human body; -biochemical background of the metabolic disorders in the case of carbohydrates, lipids, aminoacids, nucleic acids; -biochemical/molecular background of main diseases; -biochemistry of liver, kidney, muscles, brain; -biochemical background of detoxification of xenobiotics (including drugs); -contemporary biochemical-medical background of nutrition.", "et": "Meditsiiniline biokeemia on täielikult inimorganismi-põhine õppeaine, mis kasutab nüüdisaegseid selleks loodud originaalõpikuid. Erilist tähelepanu pööratakse järgmiste probleemide analüüsile: -inimorganismi põhibiomolekulid (häired nende struktuuris ja haigused); -biovedelike kliiniliselt informatiivsed biokeemilised markerid; -valgud ja biovedelike erinevad kliinilised markerensüümid;  -biomolekulide metabolismi häirete biokeemiline taust süsivesikute, lipiidide, aminohapete ja nukleiinhapete korral; -põhiliste haiguste patogeneesi biokeemilis-molekulaarne  taust; -molekulaarhaigused; -maksa, neerude, lihaste ja aju biokeemia; -ksenobiootikumide (sh ravimite) biotransformatsiooni ja detoksikatsiooni biokeemiline taust; -söömise nüüdisaegne teaduspõhine biokeemilis-meditsiiniline analüüs."}, "objectives": [{"en": "The aim of this human-organism targeted course is to provide students with basic knowledge of contemporary Medical Biochemistry and develop biochemical-clinical thinking, which are required: a) for understanding of molecular mechanism of human organism functioning and development of diseases; b) for systemic acquiring of new scientific conceptions needed for evidence based medicine; c) for using the Medical Biochemistry experience and knowledge in hospital practice.", "et": "Inimorganismi-põhise kursuse eesmärgiks on anda üliõpilastele baasteadmised nüüdisaegses meditsiinilises biokeemias ja arendada neil biokeemilis-meditsiinilist mõtlemist, mis on vajalik: a) inimorganismi funktsioneerimise ja haiguste tekke molekulaarmehhanismide mõistmiseks; b) uute teaduskontseptsioonide süstemaatiliseks omandamiseks, mis on vajalik tõenduspõhiseks meditsiiniks; c) meditsiinilise biokeemia kogemuse ja teadmiste kasutamiseks kliinilises praktikas."}], "learning_outcomes": [{"en": "Medical biochemistry is taught to medical students in accordance to the programme. The main objective of this course is to master analytical and systemic biochemical-medical way of thinking  with the help of problem-based assignments. This means that the students have to manage all the basic knowledge studied (not mechanically memorized!) throughout the course gradually integrate into logical analysis of both fundamental and clinical problems.\nThe student who graduated the course:\n- orientates in medical biochemical terminology, can describe human key-metabolites/key-complexes functions and relationships with development of disorders/diseases;\n - possesses systemic knowledge about medical (human organism) biochemistry, human body metabolism, main disorders of metabolism, biochemical-medical integration of  tissues and organs, human body metabolism-based nutrition;\n-  can analyze applying of biochemical-medical knowledge into every day practical work.", "et": "Meditsiiniline biokeemia on mõeldud vastavalt õppekavale arstiteaduse üliõpilastele. Inimorganismi-põhise kursuse põhiliseks eesmärgiks on arendada üliõpilastel analüütilist  ja süsteemset biokeemilis-meditsiinilist mõtlemist probleemipõhiste ülesannete lahendamise abil. See tähendab, et üliõpilased omandavad kursuse läbimisel kõik baasteadmised loogilise analüüsi (mitte mehaanilise päheõppimise!) käigus, mis järkjärgult integreerib nii fundamentaalseid kui kliinilisi probleeme. \nKursuse läbinud üliõpilane:\n- tunneb inimorganismi ehitust ja talitlust nii tervikuna kui kõikidel tema organisatsioonitasemetel ning oskab asetada neid teadmisi kliinilisse konteksti (aine õpiväljundid vastavad õppekava mooduli \"Erialaained\" õpiväljundite punktile 1 a);\n- orienteerub meditsiinilise biokeemia põhimõistete valdkonnas, oskab kirjeldada võtmemetaboliitide/võtmekomplekside  ülesandeid inimorganismis ja nendega seotud häireid/haigusi;  \n- omab süsteemseid ja süvendatud teadmisi meditsiinilisest (inimorganismi)  biokeemiast,  korrektseid süsteemseid  meditsiiniliselt olulisi  teadmisi inimorganismi ainevahetusest, ainevahetuse põhihäiretest, kudede ja organite biokeemilis-meditsiinilisest  integratsioonist, inimorganismi ainevahetuse-põhisest söömisest;\n- oskab analüüsida meditsiinilise biokeemia rakenduslikkust igapäevases arstipraktikas."}], "notes": {"et": "Due to the state of emergency the course continues as e-learning in Moodle."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "A &#8211; The answer contains the facts asked for in the question. The answer is illustrated/equipped with suitable biochemical-medical practical examples and explanations of mechanisms corresponding to the question. The explanative part is logical and reflects a profound understanding of the matter by the student. The answer may contain some minor errors.\nB - The answer contains the facts asked for in the question. The answer is illustrated/equipped with suitable biochemical-medical practical examples and explanations of mechanisms corresponding to the question. The explanative part is logical and reflects a profound understanding of the matter by the student. The answer contains some errors and shortcomings, but not in general principles. The explanatory part is a must.\nC &#8211; The facts asked for in the question are presented partially. The answer may contain a few principal mistakes and the explanatory-illustrative material may be presented poorly indicating that the general understanding of the matter by the student is superficial in places.\nD &#8211; The facts asked for in the question are presented patially or with errors. The answer may contain some principal errors and the examples are not theme-linked, are missing or are in inconsistency with the biological logic. The anwer shows that the knowledge of the matter by the student is superficial.\nE &#8211; The facts asked for in the question are presented with major mistakes and shortcomings."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "3 test-papers: Grades for tests from A-E"}}], "grade_preconditions": {"et": "To be allowed to the exam a student should have at least \"D\" for the preliminary exam and at least „D\" for the summary/total grade for the semester anticipating the exam.\nThe amount of the individual work hours is divided to two semesters."}, "grade_evaluation": {"et": "Formation of the final grade. The main questions of the oral exam are composed mostly as problem analyses. If the total grade (for the year) is \";A\", only one problem analysis is presented during the exam. If the total grade is 2B\", the student will have 1…2 main questions. If the total grade is \"C\", three main questions will be answered. If the student has a \"D\" for total grade, there are 4 main questions at the exam.\nThis system enables to get a more thorough picture of the students knowledge and skills. If the results during two semesters have been more modest, whatever the reason, the evaluation procedure has to be more thorough during the exam to give the final evaluation. The knowledge of the subjects concerning a human organism can in no way be below a certain limit.\nInimorganismiga seotud ainetes ei saa teadmised olla mingil juhul alla vajaliku kvaliteedi."}, "debt_elimination": {"et": "A retake of a test is possible during 2 weeks after the initial test, as a rule. All debts of practical works and seminars have to be corrected by the end of regular schoolwork during the same semester. The principals of a retake of the exam are established by the Tartu University study regulations, presented in the official handbook of the medical faculty"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee/", "is_moodle_connected": false, "mandatory_materials": "1. M. Zilmer, E. Karelson, T. Vihalemm, A. Rehema, K. Zilmer. Inimorganismi biomolekulid ja nende meditsiiniliselt olulisemad ülesanded. Inimorganismi metabolism, selle häired ja haigused. Biokeemia Instituut, Arstiteaduskond, Tartu Ülikool, 2010. and it`s translated version delivered directly to students by the department (handouts).", "recommended_materials": "1.Textbook of Biochemistry: with clinical correlation / edited by Thomas M. Devlin. N.Y: Wiley, 2011.\n2. http://themedicalbiochemistrypage.org/"}, "participants": {"lecturers": [{"person_uuid": "4be4b85c-8f88-0065-4fd7-75796a0f04c5", "person_name": "Kalle Kilk", "structural_unit": {"code": "MVBS01MK", "name": {"en": "Chair of Medical Biochemistry", "et": "meditsiinilise biokeemia õppetool"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "MVBS01"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "e1259814-6073-e389-b8e3-d93bdf7a7c10", "person_name": "Aune Rehema", "structural_unit": {"code": "MVBS01MK", "name": {"en": "Chair of Medical Biochemistry", "et": "meditsiinilise biokeemia õppetool"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "MVBS01"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "12. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "4802f01c-44ea-6b70-418a-81262232185a", "person_name": "Mihkel Zilmer", "structural_unit": {"code": "MVBS01MK", "name": {"en": "Chair of Medical Biochemistry", "et": "meditsiinilise biokeemia õppetool"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "MVBS01"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "5a56e29a-ba9d-2e9e-43c1-d687f5eddd4b", "person_name": "Ivi Annuk", "structural_unit": {"code": "MVBS01", "name": {"en": "Department of Biochemistry", "et": "biokeemia osakond"}, "email": "biokeemia@ut.ee", "phone": "+372 737 4310", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/biokeemia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}, "is_responsible": false, "is_teaching": true}], "study_groups": [{"uuid": "57a64cb2-99c9-270b-d8c6-00bddb53c944", "code": "11. rühm", "max_size": 20}, {"uuid": "52588bc6-3eeb-0718-6ff5-93cafe4cf412", "code": "12. rühm", "max_size": 20}]}, "schedule": {"weeks": {"et": "24.-35.n. 2L, 24.-38 n. 2 + 2 S/P n-s, 3 knt, E"}, "entries": [{"time": "2025-02-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "24th week:  Lipid metabolism: biochemical background of lipid use."}}, {"time": "2025-02-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "25th week: Synthesis of lipids. Clinical matters of PUFA-s."}}, {"time": "2025-02-24", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "26th week: Cholesterol. Ketone bodies."}}, {"time": "2025-03-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "27th week: Lipoproteins. Oxidative stress, OxLDL. Atherosclerosis."}}, {"time": "2025-03-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "28th week: Amino acids (AA) of human body. Pathways of AA metabolism."}}, {"time": "2025-03-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "29th week: Key-enzymes of AA metabolism as clinical markers."}}, {"time": "2025-03-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "30th week: AA metabolism: biochemical background of disorders/diseases."}}, {"time": "2025-03-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "31st week: Nucleic acids (NA) of human body. NA metabolism (pathways and key-metabolites). Key-enzymes of NA metabolism as clinical markers. Biochemical background of disorders/diseases."}}, {"time": "2025-04-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "32nd week: Heme and hemoglobin. Metabolism: key-metabolites and enzymes as clinical markers. Iron, transferrin and ferritin. Medico-biochemical background of iron metabolism."}}, {"time": "2025-04-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "33rd week: Structure-function relationship of organs. Integration and regulation of metabolism. Summarizing overview of metabolism. Postprandial metabolism. Interdigestive period and metabolism. Physiological stress and metabolism, starvation and metabolism. Digestion and adsorption. Digestion of nutrients. Main biochemical features of absorption."}}, {"time": "2025-04-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "34th week:  Nutrition. What are nutrients? Their requirements and biofunctions. Contemporary biochemical analysis and scientific comments about nutrition (2 h)."}}, {"time": "2025-04-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "35th week:  Nutrition. What are nutrients? Their requirements and biofunctions. Contemporary biochemical analysis and scientific comments about nutrition (2 h)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "24th week: -General principles of human metabolism. Catabolism and anabolism, metabolic energy. Metabolism of carbohydrates (CHO) in human body."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Glucose as the central CHO, main pathways of glucose metabolism. Biochemical-medical aspects of anaerobic glycolysis.Gluconeogenesis."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "25th week: -Aerobic metabolism of CHO (I). The TCA as the central metabolic pathway: biochemical-medical aspects."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Biological oxidation. Clinical aspects of the respiratory chain and oxidative phosphorylation.\n-Aerobic metabolism of CHO (II). Specific purposes of the pentose phosphate pathway. Fructose and its clinical problems."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "26th week: -Problem-based analysis: Blood sugar: methods for assay and biochemical background of regulation.\n-Assay of blood sugar. Glycogen. The role of glycogen in human body. Regulation of blood sugar."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "27th week: -Test-paper 1: Anaerobic and aerobic metabolism of CHO in human body."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Lipids and lipid-like biomolecules of human body. Problem-based analysis: The main pathways of lipid metabolism in human body. Organism-specific fatty acids and lipids: biochemical-medical back-ground. Oxidation of free fatty acids as the main producer of metabolic energy: energetic role of the beta oxidation and biochemical/medical aspects."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "28th week: -The other variants of fatty acid oxidation and medical problems. De novo synthesis of fatty acids. Synthesis of triglycerides."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Ketone bodies: importance and biochemical-medical problems. Peroxydation of lipids and oxidative stress. Eicosanoids as potent bioregulators."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "29th week:  -Metabolism of cholesterol. Cholesterol as the precursor for biosyntheses and biochemical-medical aspects of cholesterol metabolism."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "-Assay of triglycerides and cholesterol in blood serum."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Problem-based analysis: Transport of lipids in blood: metabolism of lipoproteins (farmotion, biofunctions)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "30th week: -The alterations of the lipoprotein`s spectrum, aterogenity.  Metabolic syndrome, clinical assessment of risks."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "-Test-paper 2: Metabolism of lipids in human body."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "31st week: -Metabolism of amino acids (AA) in human body. Transamination as the central process of AA metabolism and aminotransferases. Central position of glutamate in AA metabolism."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Polyfunctionality of AA (including medical aspects). Detoxication of ammonia. Synthesis of urea and clinical problems associated with it."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "32nd week: -Special pathways of individual AA-s. Assay of urea in blood serum."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Problem-based analysis: Metabolites of AA as clinical markers. Disorders of AA metabolism. Conversion of AA in the intestine: biochemical and medical aspects."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "33rd week: -Test-paper 3: Metabolism of AA in human body."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Purine and pyrimidine metabolism in human body."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "34th week:  -Assay of aminotransferases and alkaline phosphatase in blood serum."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Central role of liver: biochemical and medical aspects (iron and heme metabolism, detoxification of several metabolic products, biotransformation of xenobiotics)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "35th week:  -Tasks in Moodle. Integration and regulation of human metabolism: biochemical/medical aspects. Metabolism after normal meal, the metabolic links between organs (tissues)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Integration and regulation of human metabolism: biochemical/medical aspects. The metabolic links between organs (tissues) under physiological stress and high-grade long-term stress, in case of short-term fasting and long-term starvation."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "36th week: -Integration and regulation of human metabolism: summary of metabolism in different organs and tissues (brain, liver, muscule, adipose tissue, kidney etc.)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Biochemistry of urine."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "37th week: -Special biochemical testing of skills: analysis of urine and biochemical-medical conclusions on the basis of biochemical parameters."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Metabolomics and metabolic diseases."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "38th week:  -Biochemistry of nutrition, digestion and absorption. Problem-based analysis: nutrients and nutrition."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "-Problem-based analysis: Biochemistry of digestion and absorption. Nutrition disturbances/diseases."}}]}, "registration_info": {"audience": {}, "min_students": 12, "max_students": 40}, "parent_uuid": "0cb65e5e-f622-5ab6-b075-e61f05031e62", "parent_code": "ARBK.01.030", "parent_credits": 11, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}