{"uuid": "5a2169ad-3132-2917-6729-5bbbc450f536", "code": "ARFA.01.111", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Communication in Healthcare and Pharmacy", "et": "Suhtlemine tervishoius ja farmaatsias"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Being a good communicator requires certain skills such as active listening, questioning skills, conflict management and problem-solving skills etc. These are skills necessary for effective communication. For successful professional communication, it is necessary to know how the human psyche works during communication. It helps to regulate your own and others' emotions, communicate more effectively and prevent burnout. During the course, we focus on our own and the client's needs and self-reflection and learn how to effectively use counseling skills in our client work. During the course, students work both independently, in pairs and in groups. The practical part of the course is inextricably linked with the theoretical part. The practical part includes self-analysis, discussions, role plays and exercises.", "et": "Et olla hea suhtleja, on vaja omada teatud oskusi, nagu näiteks aktiivne kuulamine, küsitlemisoskused, konfliktilahendusoskused, enesekehtestamise oskused jne. Need on efektiivseks suhtlemiseks vajalikud oskused. Edukaks erialaseks suhtlemiseks on vaja teada, kuidas toimib inimese psüühika suhtlemise ajal. See aitab paremini reguleerida enda ja teiste emotsioone, efektiivsemalt suhelda ja läbipõlemist ennetada. Kursuse käigus keskendume nii enda kui kliendi vajadustele ja enesereflektsioonile ning õpime, kuidas efektiivselt kasutada nõustamisoskusi oma klienditöös. Kursuse jooksul töötavad üliõpilased nii iseseisvalt, paarides kui ka gruppides. Praktiline osa kursusest on teoreetilisega lahutamatult seotud. Praktiline osa sisaldab eneseanalüüsi, arutelusid, rollimänge ja harjutusi"}, "objectives": [{"en": "General principles of communication will be covered. In addition patient communication skills, empathy, problem solving and self-reflection of professionals will be taught.", "et": "Tutvustada suhtlemise põhialuseid, täiendada üliõpilaste suhtlemisoskust ja empaatiavõimet, tuues välja peamised aspektid patsientide nõustamisel, käitumise probleemsetes olukordades ning erialaspetsialisti eneserefleksiooni põhimõtted."}], "learning_outcomes": [{"en": "Student who has completed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- is aware about his/her strengths and weaknesses in communication,", "et": "- teadvustab, mis on tema tugevad ja nõrgad kohad seoses suhtlemisega,"}, {"en": "- understands what happens in the human psyche during communication and can be empathetic,", "et": "- mõistab, mis toimub inimese psüühikas suhtlemise ajal ning suudab olla empaatiline,"}, {"en": "- knows the principles of successful communication and is able to use them,", "et": "- teab eduka suhtlemise põhimõtteid ja oskab neid kasutada,"}, {"en": "- knows the principles of patient counseling.", "et": "- teab patsiendi nõustamise põhimõtteid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}