{"uuid": "eff0c617-25e1-f781-e86c-288f7c23d712", "code": "ARFA.01.113", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Pharmacognosy II", "et": "Farmakognoosia II"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "fc982cf7-eaa4-6ef3-6849-fe7c322b1221", "code": "ARFA.01.072", "title": {"en": "Pharmacognosy I", "et": "Farmakognoosia I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Pharmacognosy is a branch of pharmacy that investigates medicinal plants, herbs in form of dried or raw plant material or their parts, which are used as raw material in preparing pharmaceutical formulations or semimedicinal products; also products of first/basic reprocessing of plant or animal raw material, such as essential oils, fatty oils, resins, etc. and individual or groups of compounds from above mentioned raw material that are used in medicine. Classification and nomenclature of medicinal plants are discussed, as well as factors influencing content of active compounds, cultivation of medicinal plants and collecting herbs, drying, storing, and determining quality of herbs. Introduced are several active substances (hydrocarbons, phenols, phenol glycosides, essential oils and resins) in terms of their classification, physicochemical and biological properties, and more important herbs containing these active substances.", "et": "Farmakognoosia on farmaatsiaharu, mis uurib ravimtaimi, drooge kui kuivatatud või värskeid taimi või nende osi, mida kasutatakse toorainena ravimpreparaatide ja ravimisarnaste preparaatide valmistamiseks; samuti taimse või loomse tooraine esmasel ümbertöötamisel saadud produkte nagu eeterlikud õlid, rasvõlid, vaigud jms., ning nimetatud looduslikus toormes sisalduvaid meditsiiniliselt kasutatavaid koostisainete gruppe ja individuaalseid ühendeid. Käsitletakse ravimtaimede klassifikatsiooni ja nomenklatuuri, toimeainete sisaldust mõjustavaid faktoreid, ravimtaimede kultiveerimist ja droogide kogumist, droogide kuivatamist, säilitamist ja kvaliteedi kontrollimist. Vaatluse alla võetakse mitmesuguste toimeainete (süsivesinikud, fenoolid ja fenoolglükosiidid, eeterlikud õlid ja vaigud) klassifikatsioon, füsikokeemilised ja bioloogilised omadused ning neid aineid sisaldavad tähtsamad droogid."}, "objectives": [{"en": "The main aim of the course is to obtain knowledge about classification and nomenclature of medicinal plants, as well as several active substances, their chemical and biological properties.", "et": "Kursuse põhieesmärgiks on omandada teadmisi ravimtaimede klassifikatsioonist ja nomenklatuurist, samuti neis sisalduvatest toimeainetest, nende keemilistest ja bioloogilistest omadustest."}], "learning_outcomes": [{"en": "The student who graduated the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "a) has an overview about classification of herbs", "et": "a) orienteerub ravimtaimede klassifikatsioonis"}, {"en": "b) knows structures and general aspects of differents groups of biologically active substances", "et": "b) teab erinevate toimeainerühmade üldstruktuure ja üldisi omadusi"}, {"en": "c) knows main herbal drugs from differents groups of biologically active substances", "et": "c) tunneb erinevate toimeainerühmade peamisi drooge"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}