{"uuid": "69211009-832c-3979-dbe8-f9b5284732a1", "code": "ARFA.02.113", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Pharmaceutical Technology", "et": "Farmatseutiline tehnoloogia"}, "credits": 22, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 3, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "de3b2056-98b8-89c8-49d3-2f0bf3e62c7c", "code": "ARFA.02.103", "title": {"en": "Pharmaceutical Excipients", "et": "Farmatseutilised abiained"}, "credits": 5, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "a55febbf-d2bc-0beb-4153-c87ea1321fa0", "code": "ARFA.02.109", "title": {"en": "Pharmaceutical Chemistry I", "et": "Farmatseutiline keemia I"}, "credits": 9, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-07T10:28:20"}, {"required": true, "uuid": "bd8f2268-d9e5-d8b0-1207-d4059d70f9cc", "code": "ARMP.01.030", "title": {"en": "Genetics", "et": "Geneetika"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "All the main scientific and technological aspects of the design and manufacture of dosage forms.\nA practical study of preparation, efficacy and evaluation of extemporary pharmaceutical dosage forms.", "et": "Farmatseutiline tehnoloogia käsitleb ravimite  valmistamist ja nende kvaliteedi hindamist.\nKursus koosneb kolmest moodulist, mis toimuvad kolmel järjestikusel semestril. Kursuse üldiseks eesmärgiks on õppida tundma tehnoloogilisi protsesse ja võtteid, mida kasutatakse kaasaegsete ravimpreparaatide tootmisel. Kursuse teoreetilises osas pööratakse tähelepanu erinevate ravimvormide disainimisele, tööstusliku tootmise põhimõtetele, käsitletakse ravimvormide valmistamisprotsesse, üldiseid kvaliteedinõudeid ja omadusi, säilitamist, ravimite manustamisteid ning käitumist organismis. Kursuse praktilises osas õpitakse valmistama väikesemahulisi ravimpreparaate ex tempore või väikepartiidena ja neid ka analüüsima. \n I osa: Eesmärgiks on omandada ravimvormide disainimise üldpõhimõtted, raviainete peamised manustamisviisid, lahuste ja dispersioonide, pooltahkete ravimvormide ning geelide, transdermaalsete terapeutiliste süsteemide ja rektaalselt manustatavate ravimvormide disaini üldpõhimõtted ja kvaliteedinõuded. Praktiliselt omandatakse pulbrite, lahuste ja mitmesuguste dispergeeritud vedelravimite valmistamise oskused.\nII osa: Eesmärgiks on omandada aseptika üldpõhimõtted, parenteraalsete ravimvormide disainimise üldpõhimõtted ja kavaliteedinõuded, puhta ruumi mõiste ja sellele esitatavad nõuded, erinevatele ravimite pakkematerjalidele, konteineritele esitatavad nõuded. Omandatakse silma-, nina- ja kõrvaravimite ning inhaleeritavate ravimpreparaatide disainimise põhimõtted. Tutvutakse liposoomide, mikroosakeste jm kaasaegsete ravimkandursüsteemide disainimise põhimõtetega. Praktiliselt õpitakse valmistama pooltahkeid ning aseptiliselt valmistatavaid ja steriliseeritavaid ravimpreparaate.\nIII osa: Tahked ravimvormid. Tablettide ja tinktuuride tootmine väikepartiidena, nende kvaliteedi hindamine ja analüüs."}, "objectives": [{"en": "The aims of  the course are the following: ", "et": "Kursuse eesmärkideks on: "}, {"en": "- to learn the principles of dosage form classification and disain;", "et": "- õppida tundma ravimvormide klassifikatsiooni ja sellest tulenevaid tehnoloogilisi erisusi;"}, {"en": "- to learn and understand the scientific and technological aspects of the design and manufacture of dosage forms;", "et": "- mõista ja õppida tundma ravimvormide tööstusliku valmistamise teaduslikke ja tehnoloogilisi põhimõtteid;"}, {"en": "- to prepare and/or manufacture and analyze different pharmaceutical dosage forms (powders, solutions, colloidal solutions, suspensions, emulsions, ointments, creams, tablets, suppositories etc.) on a small (compounding - ex tempore) and intermediate (pilot-scale) scale.", "et": "- valmistada  erinevaid ravimpreparaate  retsepti järgi (ex tempore) ja väikepartiidena ning neid analüüsida (pulbrid, lahused, suspensioonid, emulsioonid, salvid, kreemid, tabletid, suposiidid, jt)"}], "learning_outcomes": [{"en": "A student need to:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- know the design and formulation of dosage forms;", "et": "- tunneb ja teab ravimpreparaatide disainimise põhimõtteid;"}, {"en": "- understand of the basic physico-chemical processes by manufacturing of dosage forms;", "et": "- mõistab ravimite valmistamisel toimuvate füsiko-keemiliste protsesside olemust;"}, {"en": "- know how the excipients and used technology of formulation are connected with quality of dosege form; ", "et": "- oskab seostada erinevate abiainete ja tehnoloogiliste võtete kasutamist saadava lõpp-produkti kvaliteediga;"}, {"en": "- understand how the dosage form affects the rate and extent of drug absorption into the body; ", "et": "- mõistab kuidas ravimvorm mõjutab raviaine manustamisjärgselt käitumist organismis;"}, {"en": "- can compound dosege forms (ex tempore and pilot-scale) in good quality;", "et": "- oskab valmistada erinevaid ravimpreparaate ex tempore ja väikepartiidena;"}, {"en": "- know the avoidance and elimination of microorganisms in dosage forms;", "et": "- teab, kuidas vältida või kõrvaldada ravimvormide mikrobioloogilist saastumist;"}, {"en": "- know product perfomance testing (quality testing, stability testing).", "et": "- teab ravimpreparaatide analüüsi põhimõtteid, säilitamis- ja kvaliteedinõudeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}