{"uuid": "d3e599cf-7345-9116-0c6d-815a7b6c9871", "code": "ARFA.02.036", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Conventional and Modified-Release Formulations", "et": "Ravimpreparaatide toimekestvuse modifitseerimine"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course provides an advanced-level approach to oral conventional and modified-release drug delivery technologies including oral mucosal drug delivery systems, oral sustained and controlled release delivery technologies, and colonic technologies. The course will also provide an insight into the regulatory issues and intellectual property rights in the field of modified-release drug delivery. The present course will be arranged as a book exam.", "et": "Lähtutakse käesoleva hetke Euroopa Farmakopöa ravimvormide klassifikatsioonist ning  selgitatakse toimekestvuse modifitseerimise põhimõttelisi võimalusi ja vajadusi. Kajastamist leiavad järgmised teemad: manustamiskoha füsioloogia, raviaine/abiainete füsikokeemilised omadused, raviaine vabanemise kiirus ja võimalused seda muuta, raviaine imendumiskiiruse reguleerimise võimalused, kasutatavad abiained ja nende funktsionaalsuse tõestamise võimalused, erilised tehnoloogilised võtted, ravimpreparaatide biofarmatseutilise kvaliteedi hindamine."}, "objectives": [{"en": "This course (book exam) aims to provide an advanced  level of knowledge on the formulation challenges and uses of oral mucosal, oral, and gastrointestinal tract drug delivery systems including related regulatory issues and intellectual property aspects.", "et": "Selgitada modifitseeritud toimekestvusega ravimpreparaatide disainimist, iseloomustada kasutatavaid abiaineid ja nende funktsionaalsuse kontrollimise võimalusi ning anda ülevaade modifitseeritust iseloomustavatest olulisematest biofarmatseutilistest karakteristikutest."}], "learning_outcomes": [{"en": "The student who has passed the course (book exam):", "et": "Üliõpilane, kes on läbinud kursuse (raamatueksam):"}, {"en": "-\tknows oral cavity as the specific site of drug delivery and the principles related to the development of drug delivery systems for the oral mucosal route ", "et": "-          Teab suus kasutatavate ravimkandursüsteemide (suu limaskesta kaudu imenduvate ravimkandursüsteemide) disainiks ja valmistamiseks vajalikke suu- ja limaskesta omadusi"}, {"en": "-\tknows the technologies and challenges related to the modified-release drug delivery systems designed for the oral route", "et": "-          Teab tehnoloogiaid ja väljakutseid, mis on seotud modifitseeritud vabanemisega suus kasutamiseks mõeldud ravimkandursüsteemidega"}, {"en": "-\tknows the novel approaches including e.g. microparticles, new tableting technologies and 3D printing in the development of modified-release drug delivery systems", "et": "-          Teab uudseid tehnoloogiaid/viise, nagu nt mikroosakesed, uusi tableteerimise ja 3 D printimise tehnoloogiaid modifitseeritud vabanemisega ravimkandursüsteemide valmistamiseks"}, {"en": "-\tknows the current regulatory aspects related to the marketing authorization of modified-release drug delivery systems ", "et": "-          Teab kehtivaid modifitseeritud vabanemisega ravimkandursüsteemide jaoks mõeldud regulatoorseid juhendeid ja seadusandlust ning müügiloa saamiseks vajalikke tingimusi"}, {"en": "-\tunderstand the added value of any developed modified-release drug delivery system (intellectual property aspects).", "et": "-          Mõistab väljatöötatud modifitseeritud vabanemisega ravimkandursüsteemide vajalikkust (intellektuaalse omandiga seotud aspektid)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}