{"uuid": "ff2d0587-3fb4-98aa-1e56-7e8e8d1faae8", "code": "ARFA.02.099", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Analytical Chemistry", "et": "Analüütiline keemia"}, "credits": 12, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "6b6f23af-b96b-6284-3763-c41ba1e06214", "code": "LOKT.00.004", "title": {"en": "General and Inorganic Chemistry", "et": "Üldine ja anorgaaniline keemia"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Pharmacy students are introduced to fundamentals of analytical chemistry starting with purity of substance, laboratory equipment, basic data analysis, properties of solvents, chemical equilibrium, dissociation and solubility. Sample of systematic qualitative analysis of cations based on formation of precipitates with acids and bases is presented. Methods \nof quantitative analysis based on titration and optical properties of substances are more thoroughly dealt with. Basics of electrochemical methods of end-point detection and voltammetry as well as methods based on separation like chromatography are also presented.", "et": "Tutvutakse raviainete analüüsiks vajalike analüütilise keemia alustega. Lühidalt käsitletakse uuritava aine samastamist ehk kvalitatiivset analüüsi, põhitähelepanu on pööratud kvantitatiivsele analüüsile - kaalanalüüs, mahtanalüüs (alkali-atsidimeetria, redoksmeetodid, kompleksomeetria, sadestusmeetodid), instrumentaalsed meetodid (optilised meetodid, elektrokeemilised meetodid, kromatograafia)."}, "objectives": [{"en": "The aim of this subject is to introduce the pharmacy students to the basics of qualitative and quantitative analysis.", "et": "Antud aine eesmärgiks on tutvustada farmaatsiaüliõpilastele kvalitatiivse ja kvantitatiivse analüüsi põhitõdesid."}], "learning_outcomes": [{"en": "The student that graduated the course:\n- is able to handle laboratory glassware and basic instruments like pH-meter and spectrophotometer\n- understands the basic chemical and physical theories the qualitative and quantitative analysis of medicines is based on\n- is self-reliantly able to choose the proper analytical methods and to carry out basic analytical procedures of analysis of medicines, using either chemical techniques (titrations) or instrumental methods (spectrophotometry, TLC)\n- is able to perform self-reliantly calculations necessary for experimental design and to statistically analyze experimental data to identify common patterns and trends", "et": "Kursuse läbinud üliõpilane:\n- oskab käsitseda analüüsiks kasutatavat laboratoorset klaasi ja lihtsamaid aparaate, nagu pH-meeter, spektrofotomeeter,\n- mõistab keemilisi protsesse, millel põhineb raviainete kvantitatiivne ja kvalitatiivne analüüs,\n- mõistab füüsikalisi protsesse, millel põhinevad kvalitatiivses ja kvantitatiivses analüüsis kasutatavad aparatuursed meetodid (elektrokeemilised ja spektrofotomeetrilised meetodid, kromatograafia),\n- oskab iseseisvalt valida sobivad analüüsimeetodid (tiitrimeetriad, aparatuursed meeodid) ja viia läbi analüüs (tiitrimine, UV-Vis spektrofotomeetria, kihtkromatograafia),\n- oskab sooritada iseseisvalt eksperimendi planeerimiseks vajalikke arvutusi ja statistiliselt töödelda saadud tulemusi"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}