{"uuid": "b646b853-95e2-7bcd-f893-6cd6b4c6f4a5", "code": "ARFA.02.122", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Physical Pharmacy", "et": "Füüsikaline farmaatsia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "de3b2056-98b8-89c8-49d3-2f0bf3e62c7c", "code": "ARFA.02.103", "title": {"en": "Pharmaceutical Excipients", "et": "Farmatseutilised abiained"}, "credits": 5, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "d1376f28-2401-ea5d-1a80-871b570a473a", "code": "ARFA.01.077", "title": {"en": "Pharmacognosy III", "et": "Farmakognoosia III"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "c6193e61-ba7a-08ea-a283-98211618f47b", "code": "ARFR.02.051", "title": {"en": "Pharmacology", "et": "Farmakoloogia"}, "credits": 11, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "7f0935a7-c3d2-2569-71c1-f8847927b775", "code": "ARPO.00.020", "title": {"en": "Primary Care Medicine", "et": "Esmatasandi meditsiin"}, "credits": 5, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The physicochemical properties of active pharmaceutical ingredients (APIs) and excipients affect both the production of dosage forms (formulation) and the performance of the finished product (biopharmaceutical quality). The present course focuses on teaching the physicochemical and solid state properties of APIs and excipients. Pharmaceutical powders and colloidal dispersions (including nano-formulations/nanopreparations and drug delivery systems, DDS) will be introduced and their most important physicochemical properties overviewed. The course introduces also various analytical techniques available for the characterisation of pharmaceutical materials (raw materials, APIs, excipients, powders, dispersions). Novel process-analytical technology (PAT) tools will be discussed for real time process monitoring and control during pharmaceutical manufacturing. The programme follows Martin`s system and classification of physical analysis methods described in EP and USP. The course consists of two parts, in the first part the solid state properties of APIs will be discussed, in the second part the dispersions (including nano-formulations/nanopreparation and DDSs) and their physicochemical properties will be overviewed. Analytical tools will be introduced together with each physicochemical property.", "et": "Ravimite biofarmatseutiline kvaliteet ja ravimvormi valmistamiseks vajalikud tehnoloogilised meetodid sõltuvad suurel määral raviainete ja abiainete füsikokeemilistest omadustest. Käesolev õppeaine käsitleb tahkete ainete ja dispersioonide (sh nanopreparaatide/ravimkandursüsteemide) füsikokeemilisi omadusi/parameetreid ning tutvustab erinevaid analüütilisi meetodeid, mis aitavad neid välja selgitada. Lähemalt räägitakse farmatseutiliste pulbrite ning kolloidsüsteemide füsikokeemilistest omadustest ja nende määramisest. Lisaks tutvustatakse uudseid protsessiaegse analüütilise tehnoloogia (PAT) meetodeid, mida on võimalik kasutada reaalajas protsesside jälgimiseks ning kontrollimiseks ravimpreparaatide tootmise ajal. Programm järgib Martin`i süsteemi ja EP ning USP füüsikaliste analüüsimeetodite klassifikatsiooni. Kursus koosneb tinglikult kahest osast. Kõigepealt selgitatakse tahke aine füsikokeemilisi omadusi, mis on olulised ravimpreparaatide valmistamisel. Teises osas uuritakse dispersioonide (sh nanopreparaatide ja ravimkandursüsteemide) füsikokeemilisi omadusi. Füsikokeemiliste omaduste määramiseks mõeldud analüütilised meetodid on toodud mõlema osa juures eraldi välja."}, "objectives": [{"en": "The aim of Physical Pharmacy course is to describe the physicochemical principles behind the design and development of dosage forms and introduce the analytical tools available for active pharmaceutical ingredient (API) and excipient characterisation. The information gathered during the course enables understanding the concepts behind pharmaceutical technology, biopharmaceutics and excipients courses. In addition, this knowledge package enables to analyse important physicochemical properties and their characterisation and explain the events in pharmacy by using basic physicochemical principles.", "et": "Füüsikalise farmaatsia kursuse eesmärk on selgitada proviisori eriala üliõpilastele ravimvormide disaini ja väljatöötamise füsikokeemilisi printsiipe, sealhulgas tutvustada ka raviainete ja abiainete füsikokeemiliste omaduste uurimiseks kasutatavaid analüütilisi meetodeid. Materjali omandamine on oluline mõistmaks ja ühendamaks omavahel farmatseutilise tehnoloogia, abiainete, ja biofarmaatsia kursustel saadud informatsiooni. Aine läbimisel oskab üliõpilane analüüsida ravi- ja abiainete olulisi füüsikalisi omadusi ja nende omaduste määramisvõimalusi ning seletada farmaatsias esinevaid nähtusi füüsikalise keemia seaduste ja printsiipide abil."}], "learning_outcomes": [{"en": "The student who graduated the course:\n- has a basic understanding of the physicochemical principles behind the design of dosage forms and that are important in drug delivery;\n- knows how to explain and give examples on the importance of physicochemical parameters in pharmacy (pharmaceutical technology, biopharmacy);\n- has an overview of the main analytical tools available for active pharmaceutical ingredient (API) and excipients characterisation; \n- has an overview of basic concepts behind each analytical method and an ability to integrate the knowledge;\n- is able to connect each physicochemical parameter with the specific analytical tool;\n- knows how to explain the basic principles and concepts of analytical methods used for physicochemical characterisation.\n- knows how to actively participate in group work, analyse the results and write reports\n- knows the main principles of writing an academic research work", "et": "Kursuse läbinud üliõpilane:\n- omab arusaama aine füsikokeemilistest omadustest, mida peab arvestama ravimpreparaatide disainil ja mis olulisel määral mõjutavad nende biofarmatseutilist kvaliteeti;\n- selgitab ja toob näiteid, miks need omadused on olulised farmaatsias (farmatseutilises tehnoloogias, biofarmaatsias);\n- teab enamlevinud raviainete ning abiainete uurimiseks kasutatavaid analüütilisi meetodeid;\n- ühendab ja selgitab, millist analüütilist meetodit ja millise omaduse uurimiseks või välja selgitamiseks saab kasutada;\n- selgitab, mis printsiibil mingi füsikokeemiline meetod põhineb;\n- oskab aktiivselt kaasa lüüa grupitöös, analüüsida töö tulemusi ja koostada raporteid\n- teab peamisi akadeemilise kirjatöö reegleid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}