{"uuid": "f4b7c07b-9b90-6174-77d9-fc109e591bd9", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T17:19:52", "title": {"en": "Physical Pharmacy", "et": "Füüsikaline farmaatsia"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "label": {"en": "25/26 A regular MV", "et": "25/26 S PÕ MV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 32, "practice": 18, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "de3b2056-98b8-89c8-49d3-2f0bf3e62c7c", "code": "ARFA.02.103", "title": {"en": "Pharmaceutical Excipients", "et": "Farmatseutilised abiained"}, "credits": 5, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "d1376f28-2401-ea5d-1a80-871b570a473a", "code": "ARFA.01.077", "title": {"en": "Pharmacognosy III", "et": "Farmakognoosia III"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "c6193e61-ba7a-08ea-a283-98211618f47b", "code": "ARFR.02.051", "title": {"en": "Pharmacology", "et": "Farmakoloogia"}, "credits": 11, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "7f0935a7-c3d2-2569-71c1-f8847927b775", "code": "ARPO.00.020", "title": {"en": "Primary Care Medicine", "et": "Esmatasandi meditsiin"}, "credits": 5, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The physicochemical properties of active pharmaceutical ingredients (APIs) and excipients affect both the production of dosage forms (formulation) and the performance of the finished product (biopharmaceutical quality). The present course focuses on teaching the physicochemical and solid state properties of APIs and excipients. Pharmaceutical powders and colloidal dispersions (including nano-formulations/nanopreparations and drug delivery systems, DDS) will be introduced and their most important physicochemical properties overviewed. The course introduces also various analytical techniques available for the characterisation of pharmaceutical materials (raw materials, APIs, excipients, powders, dispersions). Novel process-analytical technology (PAT) tools will be discussed for real time process monitoring and control during pharmaceutical manufacturing. The programme follows Martin`s system and classification of physical analysis methods described in EP and USP. The course consists of two parts, in the first part the solid state properties of APIs will be discussed, in the second part the dispersions (including nano-formulations/nanopreparation and DDSs) and their physicochemical properties will be overviewed. Analytical tools will be introduced together with each physicochemical property.", "et": "Ravimite biofarmatseutiline kvaliteet ja ravimvormi valmistamiseks vajalikud tehnoloogilised meetodid sõltuvad suurel määral raviainete ja abiainete füsikokeemilistest omadustest. Käesolev õppeaine käsitleb tahkete ainete ja dispersioonide (sh nanopreparaatide/ravimkandursüsteemide) füsikokeemilisi omadusi/parameetreid ning tutvustab erinevaid analüütilisi meetodeid, mis aitavad neid välja selgitada. Lähemalt räägitakse farmatseutiliste pulbrite ning kolloidsüsteemide füsikokeemilistest omadustest ja nende määramisest. Lisaks tutvustatakse uudseid protsessiaegse analüütilise tehnoloogia (PAT) meetodeid, mida on võimalik kasutada reaalajas protsesside jälgimiseks ning kontrollimiseks ravimpreparaatide tootmise ajal. Programm järgib Martin`i süsteemi ja EP ning USP füüsikaliste analüüsimeetodite klassifikatsiooni. Kursus koosneb tinglikult kahest osast. Kõigepealt selgitatakse tahke aine füsikokeemilisi omadusi, mis on olulised ravimpreparaatide valmistamisel. Teises osas uuritakse dispersioonide (sh nanopreparaatide ja ravimkandursüsteemide) füsikokeemilisi omadusi. Füsikokeemiliste omaduste määramiseks mõeldud analüütilised meetodid on toodud mõlema osa juures eraldi välja."}, "objectives": [{"en": "The aim of Physical Pharmacy course is to describe the physicochemical principles behind the design and development of dosage forms and introduce the analytical tools available for active pharmaceutical ingredient (API) and excipient characterisation. The information gathered during the course enables understanding the concepts behind pharmaceutical technology, biopharmaceutics and excipients courses. In addition, this knowledge package enables to analyse important physicochemical properties and their characterisation and explain the events in pharmacy by using basic physicochemical principles.", "et": "Füüsikalise farmaatsia kursuse eesmärk on selgitada proviisori eriala üliõpilastele ravimvormide disaini ja väljatöötamise füsikokeemilisi printsiipe, sealhulgas tutvustada ka raviainete ja abiainete füsikokeemiliste omaduste uurimiseks kasutatavaid analüütilisi meetodeid. Materjali omandamine on oluline mõistmaks ja ühendamaks omavahel farmatseutilise tehnoloogia, abiainete, ja biofarmaatsia kursustel saadud informatsiooni. Aine läbimisel oskab üliõpilane analüüsida ravi- ja abiainete olulisi füüsikalisi omadusi ja nende omaduste määramisvõimalusi ning seletada farmaatsias esinevaid nähtusi füüsikalise keemia seaduste ja printsiipide abil."}], "learning_outcomes": [{"en": "The student who graduated the course:\n- has a basic understanding of the physicochemical principles behind the design of dosage forms and that are important in drug delivery;\n- knows how to explain and give examples on the importance of physicochemical parameters in pharmacy (pharmaceutical technology, biopharmacy);\n- has an overview of the main analytical tools available for active pharmaceutical ingredient (API) and excipients characterisation; \n- has an overview of basic concepts behind each analytical method and an ability to integrate the knowledge;\n- is able to connect each physicochemical parameter with the specific analytical tool;\n- knows how to explain the basic principles and concepts of analytical methods used for physicochemical characterisation.\n- knows how to actively participate in group work, analyse the results and write reports\n- knows the main principles of writing an academic research work", "et": "Kursuse läbinud üliõpilane:\n- omab arusaama aine füsikokeemilistest omadustest, mida peab arvestama ravimpreparaatide disainil ja mis olulisel määral mõjutavad nende biofarmatseutilist kvaliteeti;\n- selgitab ja toob näiteid, miks need omadused on olulised farmaatsias (farmatseutilises tehnoloogias, biofarmaatsias);\n- teab enamlevinud raviainete ning abiainete uurimiseks kasutatavaid analüütilisi meetodeid;\n- ühendab ja selgitab, millist analüütilist meetodit ja millise omaduse uurimiseks või välja selgitamiseks saab kasutada;\n- selgitab, mis printsiibil mingi füsikokeemiline meetod põhineb;\n- oskab aktiivselt kaasa lüüa grupitöös, analüüsida töö tulemusi ja koostada raporteid\n- teab peamisi akadeemilise kirjatöö reegleid"}], "notes": {"et": "Kõikide üliõpilaste kohalolek seminaridel ja praktikumides on KOHUSTUSLIK!\n\nÕppeaine sisaldab loenguid (küsimuste esitamine, peegeldamine), seminare (esseede/referaartide retsenseerimine, ülesannete (k.a. probleemülesannete) lahendamine, suulise ettekande tegemine), Moodle keskkonnas kodutöid (praktikumiks ettevalmistus, arutelud foorumis, kontroll-ülesanded, testid) ja praktilist tööd laboris (grupitööd-arutelud, tahke aine vormide ja nende füsikokeemiliste omaduste uurimine erinevate spektroskoopiliste meetoditega (Raman, IR, NIR) ja termilisel (DSC) meetodil, raporti kirjutamine, ettekandmine) ning morfoloogilised omadused kasutades mikroskoopilisi ja difraktsiooni meetodeid (SEM, PCS). Õpitakse tundma raviaine tahkeid vorme, analüütilisi meetodeid ja analüüsima saadud tulemusi (spektreid, difraktogramme, DSC termogramme). Õppeaine lõpeb eksamiga. Praktikumides on vajalik kanda kitlit ja vahetusjalatseid. Lisaks on kursusel vaja sooritada positiivselt (vähemalt hindele \"E\") kaks kontrolltööd."}}, "grading": {"independent_work": {"et": "4 õ.-n. retsensiooni esitamise aeg (õppejõud annab tähtaja (kõik esitavad kirjalikult Moodli kaudu!!!)."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "*Kirjalik lõpphindamine (eksam); valikvastustega küsimused + seletavad küsimused.\n\nEksam: A - Vastused sisaldavad küsimuses nõutud faktiteadmisi. Vastused on illustreeritud korrektsete teemakohaste farmaatsias kasutatavate praktiliste näidetega ning selgitustega mehhanismide kohta. Selgitav arutlus on loogiline ja peegeldab üliõpilase sügavat arusaamist teemast. Vastuses võib esineda üksikuid pisivigu, kuid mitte sisulisi vigu.\nB - Vastused sisaldavad küsimuses nõutud faktiteadmisi. Vastused on illustreeritud korrektsete teemakohaste farmaatsias kasutatavate praktiliste näidetega ning selgitustega mehhanismide kohta. Selgitav arutlus on loogiline ja peegeldab üliõpilase sügavat arusaamist teemast. Vastustes esineb väikeseid vigu ja puudujääke, kuid mitte eksimusi üldistes põhimõtetes ega kesksete näidete puudumist.\nC - Küsimustes nõutud faktiteadmised on esitatud osaliselt. Vastustes võib olla üksikuid põhimõttelisi eksimusi ja näidetega illustratsioon on kesine, st et üliõpilase arusaamine teemast on kohati pinnapealne.\nD - Küsimustes nõutud faktiteadmised on esitatud osaliselt ja/või vigadega. Vastustes võib olla üksikuid põhimõttelisi vigu ja selged näited puuduvad, st üliõpilase arusaamine teemast on pinnapealne (puuduvad näited, või on vastuolu loogikaga).\nE - Küsimustes nõutud faktiteadmised on esitatud puudulikult ja märkimisväärsete vigadega."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "5 nädalal"}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "12 nädalal"}}], "grade_preconditions": {"et": "Üliõpilane on osalenud loengutel 75% ulatuses, on osalenud 100% kõigis seminarides ja praktikumides, kirjalik raport ja probleemülesanne on esitatud õigeaegselt ning ettekanded on suuliselt ette kantud oma seminarides.\nLõpliku tulemuse kujunemine - 100% eksami hinne.\nVõlgnevuse likvideerimise võimalused - praktikumide ja seminaride võlgnevused tuleb likvideerida sama semestri regulaarse õppetöö lõpuks. Eksami järelsooritamise korra aluseks on meditsiiniteaduste valdkonna teatmikus toodud TÜ õppekorralduseeskiri."}, "grade_evaluation": {"et": "100% eksami hinne.\n\nKirjalik lõpphindamine (eksam); Valikvastustega küsimused ja seletavad küsimused."}, "debt_elimination": {"et": "Praktikumide ja seminaride (Moodle kodutööde; retsensioon/suuline ettekanne, raport, kontrolltööd, ülesanded, probleemülesannete lahendused) võlgnevused tuleb likvideerida sama semestri regulaarse õppetöö lõpuks. Eksami järelsooritamise korra aluseks on meditsiiniteaduste valdkonna teatmikus toodud TÜ õppekorralduseeskiri."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://www.farmaatsia.ut.ee/et", "is_moodle_connected": false, "mandatory_materials": "Õppematerjalid:\nAultoni ravimiarendus: Ravimpreparaatide disain ja tootmine, 5. väljaanne, Tartu ülikooli kirjastus, 2022.", "recommended_materials": "Attwood, D., Florence, A.T. Physical Pharmacy. FAST track.- 2008.\nFlorence, Alexander T., Attwood, David, Psysicochemical Principles of Pharmacy. 4th ed./2006\nSinko, Patrick J. Martin's physical pharmacy and pharmaceutical sciences: physical chemical and biopharmaceutical principles in the pharmaceutical sciences.-5th ed./ 2006. Lippincott Williams & Wilkins.\nAulton, M.E. Pharmaceutics. The science of dosage form design. Churchill-Livingstone, 2002.\nMoynihan, H., Crean, A. The Physicochemical Basis of Pharmaceuticals, Oxford; New York: Oxford University Press, 2009, ISBN: 9780199232840\nNielloud, F. Pharmaceutical Emulsions and Suspensions. Serial: Drugs and the Pharmaceutical Sciences, Vol 105, Edited by Francoise Nielloud and Gilberte Marti-Mestres, New York; 2010, ISBN: 9780824703042.\nEuropean Pharmacopoeia, 10th, Edition, 2021 (on-line versioon Raamatukogu kaudu)\nUnites States Pharmacopoeia, USP 35 NF 30 2012\nBritish Pharmacopoeia, 2011.\nCarstensen, J.T., Pharmaceutical preformulation. CRC Press, 1998.\nBrittain, H. G. Polymorphism in Pharmaceutical Solids. Vol. 95, 1999.\nFlorence, A.T., Siepmann, J. Modern Pharmaceutics. 5th Edition. Vol. 1. Vol. 2. 2009.\nWang, B., Siahaan, T., Soltero, R.A. Drug Delivery, Principles and Applications. 2005.\nHilfiker, R. Polymorphism in Pharmaceutical Industry, 2006.\nBrittain, H. G. Polymorphism in Pharmaceutical Solids. Vol. 95, 1999.\nBernstein, Joel. Polymorphism in Molecular Crystals, Clarendon Press, 2002. \nAmorphous Food and Pharmaceutical Systems, Edited by Harry Levine, Cambridge : RS.C, 2002, ISBN: 0854048669.\nBrocchini, Stephen; Labarre, Denis. Biomedical and Pharmaceutical Polymers, 256 pages, London ; Chicago : Pharmaceutical Press, 2009, ISBN: 9780853697305.\nSiesler, H.W., et al., Near-infrared spectroscopy. Principles, instruments, applications, ed. H.W. Siesler, et al. 2002, Weinheim: WILEY-VCH Verlag GmbH.\nMcCreery, R.L., Raman spectroscopy for chemical analysis. Chemical Analysis: A series of monographs on analytical chemistry and its applications, ed. J.D. Winefordner. Vol. 157. 2000, New York: Wiley-Interscience, A John Wiley & Sons, Inc.\nCraig, Duncan Q., Reading, Mike. Thermal analysis of Pharmaceuticals, CRC Press, 2007.\nReactivity of Molecular Solids, Chichester /etc./ : WILEY, 1999, Edited by Elena Boldyreva and Vladimir Boldyrev."}, "participants": {"lecturers": [{"person_uuid": "af63bf29-b4e4-6576-7c02-cd082986baa6", "person_name": "Karin Kogermann", "structural_unit": {"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"1 rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "6e2e6079-8350-61b2-7759-5b62569c7119", "person_name": "Andres Lust", "structural_unit": {"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"1 rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "a60377b8-9828-4c08-e064-a9355032f19b", "person_name": "Kelli Randmäe", "structural_unit": {"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "c8cb8f5d-5a76-4ed0-09c2-21436d6516a8", "person_name": "Kairi Lorenz", "structural_unit": {"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}], "study_groups": [{"uuid": "3d0cf836-6d56-b8e8-f728-11b12c35baca", "code": "1 rühm", "max_size": 12}]}, "schedule": {"weeks": {"et": "1-16 n.; 32L,15P, 31S, 2KT => E"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. nädal\nSissejuhatus.\nProgrammi tutvustamine. Füüsikalise farmaatsia kursuse ülevaade. Meie nõuded ja tingimused. Kirjanduse tutvustamine. Sissejuhatus füüsikalisse farmaatsiasse.\t(K.K.)"}}, {"course_week": 2, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "2. nädal \nTahke aine. Kristalliline tahke aine, polümorfism, faasi muutused, termodünaamika. (K.K.)"}}, {"course_week": 3, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "3. nädal \nTahke aine. Amorfne tahke aine, faasi muutused, termodünaamika. (K.K.)\nSolvaadid/Hüdraadid, faasi muutused."}}, {"course_week": 4, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {"et": "4. nädal\nAnalüütilised meetodid. Spektroskoopiad: IR, NIR, Raman, pulseeritud teraherts, tuumamagnetresonants spektroskoopiad. (K.K.)"}}, {"course_week": 5, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {"et": "5. nädal\nReaalaja analüüs, protsessiaegne jälgimine, PITs, PAT, QbD. (K.K.)"}}, {"course_week": 6, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {}, "description": {"et": "6. nädal \nAnalüütilised meetodid röntgendifraktomeetria, termilised meetodid, mikroskoopia. (K.K.)"}}, {"course_week": 7, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "7. nädal \nTahke aine. Aineosakeste suurus ja kuju, poorsus, eripinna määramine, sõelanalüüs, piltanalüüs, elavhõbe porosimeetria. (K.K.)"}}, {"course_week": 8, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {}, "description": {"et": "8. nädal \nTahke aine. Aineosakeste suurus ja kuju, poorsus, eripinna määramine, sõelanalüüs, piltanalüüs, elavhõbe porosimeetria. (K.K.)"}}, {"course_week": 9, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {}, "description": {"et": "9. nädal \nTahke aine. Tahke aine voolamine ja selle määramine, tahke aine tihedused, tiheduste määramine. (K.K.)"}}, {"course_week": 10, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {}, "description": {"et": "10. nädal \nTahke aine. Tahke aine piirpinnad: vesi-tahke aine interaktsioonid, märgumine, adsorptsioon, hügroskoopsus, pinnaenergiad, kontaktnurga määramine, pindpinevuse määramine. (K.K.)"}}, {"course_week": 11, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {}, "description": {"et": "11. nädal \nKolloidid ja dispersioonid. Kolloidid, kolloidide klassifikatsioon ja omadused (kineetilised, optilised, elektrilised). (K.K.)"}}, {"course_week": 12, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 12, "topic": {}, "description": {"et": "12. nädal \nKolloidid ja dispersioonid. Reoloogia ja viskoossus, viskoossuse määramise meetodid, dispersioonid, pooltahke faas. (K.K.)"}}, {"course_week": 13, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 13, "topic": {}, "description": {"et": "13. nädal \nNanoosakesed, nanosüsteemid, ravimkandursüsteemid (saamine, omadused, analüüs). Farmatseutiline biotehnoloogia.  (K.K.)"}}, {"course_week": 14, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 14, "topic": {}, "description": {"et": "14. nädal \nKolloidid ja dispersioonid. Dispersioonide füüsikaline stabiilsus. (K.K.)"}}, {"course_week": 15, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 15, "topic": {}, "description": {"et": "15. nädal \nRaviaine stabiilsus (kineetika, stabiilsusuuringud). (K.K.)"}}, {"course_week": 16, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 16, "topic": {}, "description": {"et": "16. nädal \nRavimvormi ja ravimpreparaadi stabiilsus (kineetika, stabiilsusuuringud). (K.K.)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "1 nädal (3 t) (K.K.)\nSeminaride ja lühidalt praktikumi tutvustamine ja selleks ettevalmistamine. Raporti (teaduspublikatsiooni, essee, referaadi jt) kirjutamine, info otsimine (andmebaasid PubMed, SciFinderScholar, ScienceDirect jt.), viitamisprogrammid (EndNote, Refcode, Mendeley, ReadCube jt.), retsensiooni kirjutamine (teadusartiklite lugemine; analüüsimine; AI kasutamine sellise töö läbiviimiseks), esituseks ettevalmistamine (ülesehitus). Ülesannete lahendamisest, probleemipõhiste ülesannete tutvustamine/arutelu (lühidalt). \n\n2 nädal (3 t) Detailne ja näidetega probleemipõhiste ülesannete tutvustamine/arutelu.\nTeemade jagamine. Ülesandeid vastavalt üliõpilaste arvule (9). (K.K.)\n\n3 nädal Iseseisev töö: probleemülesande jaoks vajaliku teadusartikli lugemine, analüüsimine ja retsensiooni kirjutamine NB!!! \n(K.K., A.L.)\n\t\t\t\t\t\t\t\t\t\t\t\n4 nädal (3t). Ülesannete lahendamine (lahustuvus, lahustumiskiirus). Retsensiooni esitamine kirjalikult paberil juhendajale ja elektrooniliselt Moodle´is (A.L.)\n\n5 nädal (2 t)\nKONTROLLTÖÖ (Tahke aine)\t(K.K.)\t\n\n6 nädal (3 t) e-seminar\t\tE-õpe\nRaporti kirjutamise teooria, praktikumiks ettevalmistus-ülesanded. Erinevad analüütilised meetodid - raviaine erinevad tahke aine vormid, nende valmistamine, analüüsimine. Teised olulised analüüsimeetodid (viskosimeeter, mikroskoopia). Lisaks ettevalmistavad materjalid Moodle´is\t(K.K., A.L., K.R., K.L.)\n\n11 nädal (3 t)\t\nÜlesannete lahendamine (voolavus, osakese suurus, tihedus). (A.L.)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "12. nädal (3 t)\nEttekanded probleemülesannete lahendamisest, arutelu (3 üliõpilast) (K.K.)\n\n13. nädal (2 t)\nKONTROLLTÖÖ (Analüütilised meetodid) (K.K.)\n\n14. nädal (3 t)\nEttekanded probleemülesannete lahendamisest, arutelu (3 üliõpilast) (A.L.)\n\n15. nädal (3 t)\nEttekanded probleemülesannete lahendamisest, arutelu (3 üliõpilast) (K.K.)\n\n16. nädal (3 t)\nKokkuvõte probleemülesannetest (ravimvormi/ravimkandursüsteemi disain ja analüüs. Grupitöö-arutelu. Kursuse tagasiside. (K.K.)\n\n\nIseseisev töö Moodle´is (loenguküsimused; ülesannete ja probleemülesannete lahendamine, testide lahendamine, praktikumide ülesannete tegemine, artikli lugemine ja retsensiooni kirjutamine, ettekande tegemine probleemülesannete lahendamisest). "}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Praktikumid (3t) (A.Lust; K. Randmäe, K. Lorenz) I rühm:\n\nEsimene praktikum kolmas oktoobri nädal 7. õppenädalal (3t), 7-12 õppenädalal toimuvad praktikumid, kus tutvutakse tahke aine omaduste ja selle uurimiseks kasutatavate analüütiliste meetoditega ning andmete analüüsimisega. Lisaks tutvustatakse veel olulisi ravimarenduses kasutusel olevaid analüütilisi meetodeid (preformulatsiooni ja formulatsiooni faasi/kvaliteediuuringud).\n\n3 t /Praktikume 6 (Tahke aine vormid (polümorfid, hüdraadid, amorfne aine, soolad, kokristallid, koamorfne aine), analüütilised meetodid: DSC, NIR, Raman, IR, XRPD, SEM, mikroskoopia, PCS, viskosimeeter/reomeeter, kontaktnurga määramismeetod. Üliõpilased peavad olema ettevalmistunud praktikumideks (analüütilised meetodid ja uuritav raviaine; täpsed ülesannete juhendid Moodle´is). Arutatakse raviaine tahkete vormide üle ning analüüsitakse Raman, IR ja NIR spektromeetri, DSC-ga). Töötamine gruppides. Tulemuste analüüsimine, esitamine. Raporti kirjutamine.\n\n7 nädal\n1 praktikum (teadustöö laboris r.615)\nReaalne töö: tahke aine vormide valmistamine ja samastamismeetoditega tutvumine (Raman, NIR, IR, DSC, piltanalüüs, XRPD, SEM, jt.)\n\n8 nädal\n2 praktikum (teadustöö laboris r.615)\nTahke aine vormide samastamine (NIR, Raman, IR, DSC). Tulemuste analüüs. XRPD tulemuste uurimine, Mercury, CSD. Raman, NIR, IR, DSC. Joonistamine, võrdlemine, spektri analüüsimine (IR, NMR, Raman, NIR, teraherts).\n\n9 nädal\n3 praktikum (teadustöö laboris r.615)\nTulemuste analüüs. XRPD tulemuste uurimine, Mercury, CSD. Raman, NIR, DSC ja SEM. Joonistamine, võrdlemine, spektrite analüüsimine (lisaks Raman ja NIR spektrianalüüsile, röntgendifraktogrammid, IR spektrid ja nende analüüs). SIMCA programm, kvalitatiivne ja kvantitatiivne analüüs."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "10 nädal\n4 praktikum\nViskoossuse ja kontaktnurga määramine (viskosimeeter, reomeeter, kontaktnurga määramismeetod). Osakeste analüüs (suurus ja kuju). Mikroskoopia demonstratsioon. SEM analüüs tahke aine vormidel ja osakese suuruse analüüs Image J, CellProfiler. Tulemuste analüüs (teadustöö laboris 615).\n\n11 nädal\n5 praktikum (teadustöö laboris r.615)\nIseseisev raporti kirjutamine! (reaalselt praktikumi ei toimu).\n\n12 nädal\n6 praktikum (r.702)\nRaporti esitamine kirjalikult Moodle´is enne praktikumi. Suuline ettekanne (3 üliõpilase peale üks ettekanne).\nKokkuvõte praktikumist, grupitööst tulemuste analüüsimine."}}]}, "registration_info": {"audience": {"et": "Proviisoriõpe 4"}, "min_students": 1, "max_students": 12}, "parent_uuid": "b646b853-95e2-7bcd-f893-6cd6b4c6f4a5", "parent_code": "ARFA.02.122", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}