{"uuid": "a55d5819-032a-65dd-8bc8-5ea0f533a732", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-18T10:47:13", "title": {"en": "Pulmonary Medicine and Thoracic Surgery", "et": "Pulmonoloogia ja torakaalkirurgia"}, "credits": 4.5, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVCM04", "name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "phone": "+372 731 8990", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kopsukliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "label": {"en": "24/25 S regular MV Eng", "et": "24/25 K PÕ MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM04", "structural_unit_name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "hours": {"lecture": 18, "practice": 40, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 59, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "b6e7d758-137b-6a15-4f86-f4aaf121492a", "code": "ARFR.01.034", "title": {"en": "Pharmacology and Toxicology", "et": "Farmakoloogia ja toksikoloogia"}, "credits": 9, "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "08062000-550e-51cc-0072-7fdd19958710", "code": "ARMB.01.020", "title": {"en": "Medical Microbiology", "et": "Meditsiiniline mikrobioloogia"}, "credits": 9, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "62901d09-3d45-ffd9-06b8-8df341b867b7", "code": "AR00.00.016", "title": {"en": "Fundamentals of Diagnostics", "et": "Diagnostika alused"}, "credits": 17, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The major respiratory disorders and diseases of the chest, including diseases of the mediastinum, esophagus, and chest wall are discussed in details (epidemiology, etiology and pathogenesis, signs and symptoms, clinical course, diagnosis (including invasive diagnostics), differential diagnosis, treatment (including surgery), rehabilitation, prevention, common respiratory health care, and management of respiratory emergencies) along with methods of investigation, in respiratory medicine, pulmonary pathology, pathophysiology, immunology, and defense mechanisms of the lung. The attention paid on different pulmonary disorders vary - diseases of higher prevalence are discussed in more details (i.e. bronchial asthma, chronic obstructive pulmonary disease, lower respiratory tract infections and their complications, thoracic neoplasms, and diseases of the pleura), but relatively less prevalent respiratory diseases, where invasive diagnostic methods are often used, are also taught. The Course on Pulmonary Medicine and Thoracic Surgery accounts for a part of the Course on Internal Medicine taught in the University of Tartu.", "et": "Õpetatakse kompleksselt peamisi kopsude ja hingamiselundite haigusi, samuti keskseinandi, söögitoru ja rindkereseina kirurgilisi haigusi (käsitletakse epidemioloogiat ja patogeneesi, haigustunnuseid ja sümptomeid, haiguse kliinilist kulgu, diagnoosimist (sealhulgas invasiivse diagnostika meetodeid), ravi (sealhulgas kirurgilist ravi) rehabilitatsiooni, haiguste preventsiooni, üldisemat hingamiselundite haiguste ravikorraldust ning rindkeremeditsiinis esinevate ägedate haigusseisundite diagnostikat ja ravi). Käsitlemist leiavad pulmonoloogias ja torakaalkirurgias kasutatavad uurimismeetodid, kopsuhaiguste paomorfoloogia, patofüsioloogia, immunoloogia ja hingamiselundite kaitsemehhanismid. Erinevate hingamiselundite haiguste õpetamise maht on mõnevõrra erinev - suhteliselt detailsemalt on käsitletud sagedamini esinevaid haigusi (bronhiaalastma, krooniline obstruktiivne kopsuhaigus, alumiste hingamisteede infektsioonid ja viimaste tüsistused, rindkerepiirkonna kasvajad, kopsukelme haigused), kuid tundma õpetatakse ka suhteliselt harvem esinevaid haigusi, kus oluline koht on sageli invasiivsel diagnostikal. Pulmonoloogia ja torakaalkirurgia kursus moodustab käesoleval hetkel osa Tartu Ülikoolis õpetatavast sisehaiguste ainest."}, "objectives": [{"en": "The purpose of the subject is to provide the medical students with the essentials in the diagnosis and treatment of respiratory disorders and diseases of the chest (including invasive diagnostics and surgical treatment) that comprises both theoretical knowledge and skills needed to solve practical situations. Apart from the respiratory diseases, the subject aims at providing essentials in diagnosis and surgical treatment of diseases of the mediastinum, esophagus, and chest wall.", "et": "Aine eesmärk on õpetada arsti eriala üliõpilastele selgeks hingamiselundite ja rindkere haiguste, nende diagnoosimise ja ravi (sealhulgas invasiivse diagnostika ja kirurgilise ravi) põhialused, hõlmates nii teoreetilisi teadmisi kui praktilisi oskusi, mis võimaldavad lahendada praktikas esinevaid meditsiinilisi situatsioone. Kopsuhaiguste kõrval on eesmärgiks anda põhiteadmised keskseinandi, söögitoru ja rindkereseina kirurgiliste haiguste sümptomatoloogiast, diagnostikast ja raviprintsiipidest."}], "learning_outcomes": [{"en": "After passing the course, the students should be able to: ", "et": "Ainekursuse läbinud üliõpilane peaks: "}, {"en": "1) understand the principles of the nature and diagnosis of the diseases of the chest and respiratory system, as well as the basic methods of investigation used in chest medicine with an ability to interpret the results, ", "et": "1) olema omandanud nii teoreetilised kui praktilised põhiteadmised rindkere- ja hingamiselundite haiguste olemusest ja diagnostikast, samuti kasutatavatest uurimismeetoditest ja oskama tulemusi interpreteerida, "}, {"en": "2) understand the essentials of pulmonary epidemiology, pathology, pathophysiology, immunology, and defense mechanisms of the chest and respiratory system, ", "et": "2) tundma rindkere- ja hingamiselundite haiguste epidemioloogia, patoloogia, patofüsioloogia, immunoloogia ja hingamiselundite kaitsemehhanismide põhialuseid, "}, {"en": "3) autonomously investigate the pulmonary patient and suggest the preliminary diagnosis of major respiratory diseases including restrictive, obstructive, neoplasmatic, and infectious pulmonary diseases, as well as chest injury and diseases of the mediastinum, esophagus, and chest wall, ", "et": "3) oskama iseseisvalt uurida rindkere ja hingamiselundite haigusega patsienti ja suutma välja pakkuda esialgse diagnoosi olulisemate haiguste puhul (restriktiivsed, obstruktiivsed ja neoplasmaatilised kopsuhaigused, infektsioonid, rindkerepiirkonna vigastused ning keskseinandi, söögitoru ja rindkereseina), "}, {"en": "4) suggest further methods of investigations necessary to confirm the diagnosis in certain situations and interpret the respective results, ", "et": "4) oskama põhjendatult valida ja rakendada edasisi uurimismeetodeid, mis on vajalikud diagnoosi kinnitamiseks konkreetsetes situatsioonides ja interpreteerida vastavalt uuringute tulemusi, "}, {"en": "5) suggest and substantiate complex treatment options, including surgical treatment, in various respiratory diseases, ", "et": "5) oskama põhjendatult valida ja kompleksselt rakendada ravivõimalusi, sealhulgas tundma kirurgilise ravi põhimõtteid ja meetodeid erinevate rindkere- ja hingamiselundite haiguste korral, "}, {"en": "6) understand the principles of continuity of the respiratory care, pulmonary rehabilitation, and disease prevention, ", "et": "6) mõistma rindkere ja hingamiselundite haiguste ravi, järelravi, pulmonaalse rehabilitatsiooni ja haiguste ennetamise terviklikkust, "}, {"en": "7) know the principles of assessment of the patient and provide appropriate care in cases of respiratory emergencies and exacerbations of chronic respiratory disorders.", "et": "7) oskama hinnata patsiendi seisundit ja osutada vajalikku arstlikku abi vastavates situatsioonides (vigastused, ägedad seisundid rindkere ja hingamiselundite haiguste korral ja krooniliste hingamisteede haiguste ägenemisel."}], "notes": {"et": "Subject ARKS.01.024 Pulmonary medicine and thoracic surgery\nThe lectures planned will be replaced with video lectures. The rest of the academic teaching, i.e. the practical classes, will occur accordingly to the schedule published previously. The Moodle-based study materials will be renewed. The ordinary practical classes will be replaced by e-seminars on the Moodle-based BigBlueButton platform with mutual connections. The timing will be the same as previously scheduled for ordinary classes."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A successful completion of the whole cycle of the practical classes on the subject \"ARKS.01.024 Pulmonary medicine and thoracic surgery (4.5 ECT)\" is one of the ultimate presumptions for qualifying for the complex examination on internal medicine. The successful completion includes active participation in all practical classes during the cycle (100%) and successfully passed informal test. The grading for the informal test (performed usually at the end of the practical class cycle) is non-differentiating and is presented as either \"qualified\" or \"non-qualified\". The mark \"qualified\" corresponds to the lowest positive level in the following order (that is \"E\", according to which, the student has gained knowledge of at least 61% of the subject). A positively graded academic case report on one of the sub-subjects of internal medicine is also a prerequisite for qualifying for the examination on internal medicine. This academic case report may, but does not necessarily be, written on pulmonary medicine and thoracic surgery. \n\nA= 96-100%\nB= 91-95%\nC= 81-90 %\nD= 71-80%\nE= 61-70%\nF= 0-60%\n\nA: The student demonstrates excellent and detailed knowledge on the clinical manifestations, etiology, pathogenesis, diagnostics, differential diagnosis, management, and prevention of various pulmonary and chest. That, what the student has gained knowledge of, has been well systematized.\nB: The student show very good knowledge on the clinical manifestations, etiology, pathogenesis, diagnostics, differential diagnosis, management, and prevention of various pulmonary and chest. During the control of student's knowledge, no substantial inaccuracies are detected. \nC: The student show good knowledge on the clinical manifestations, etiology, pathogenesis, diagnostics, differential diagnosis, management, and prevention of various pulmonary and chest. During the control of student's knowledge, some mistakes are made. However, these mistakes are neither substantial nor principal in nature.\nD: The student is able to show knowledge on the clinical manifestations, etiology, pathogenesis, diagnostics, differential diagnosis, management, and prevention of various pulmonary and chest. During the control of student's knowledge, nevertheless, it becomes evident that there are inaccuracies and gaps in systematized knowledge of the subject.\nE: The student shows knowledge on the clinical manifestations of various pulmonary and chest diseases, as well as a general knowledge on the etiology, pathogenesis, diagnostics, differential diagnosis, management, and prevention of these diseases. However, during the control of student's knowledge, it becomes clearly evident that there are numerous gaps in systematized knowledge of the subject along with principal errors.\nF: During the control, it becomes apparent that student's knowledge on the clinical manifestations, etiology, pathogenesis, diagnostics, differential diagnosis, management, and prevention of various pulmonary and chest is insufficient."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "For a successful completion of the subject \"ARKS.01.024 Pulmonary medicine and thoracic surgery (4.5 ECT)\", it is necessary:\n\n1) Participation in the lectures\n2) Successful completion of the whole cycle of the practical classes on the subject. The successful completion includes active participation in all practical classes during the cycle (100%) and successfully passed informal test. The grading for the informal test (performed usually at the end of the practical class cycle) is non-differentiating and is presented as either \"qualified\" or \"non-qualified\". The mark \"qualified\" corresponds to the lowest positive level in the following order (that is \"E\", according to which, the student has gained knowledge of at least 61% of the subject). The test consists of varying number of questions (usually 1-7).\n3) A positively graded academic case report on one of the sub-subjects of internal medicine is also one of the prerequisites for qualifying for the examination on internal medicine. This academic case report may, but does not necessarily be, written on pulmonary medicine and thoracic surgery."}, "debt_elimination": {"et": "In case of unsuccessful performance during the practical class cycle or in case of failure to pass the informal test, the academic debts are to be settled by the student himself/herself in agreement with the lecturer. This should be done before that date, which has been announced for the specialty clinics for reporting the names of those, who qualified for the examination on internal medicine of the respective term."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "90ae690f-197d-9bca-b97e-a248745e8f9e", "person_name": "Bruno Sarana", "structural_unit": {"code": "MVCM", "name": {"en": "Institute of Clinical Medicine", "et": "kliinilise meditsiini instituut"}, "email": "kmi@ut.ee", "phone": "+372 737 5324", "webpage_url": "https://kliinilinemeditsiin.ut.ee", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"21. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "0b66da4a-ed36-98fc-b2af-b0f439ab3d29", "person_name": "Indrek Benno", "structural_unit": {"code": "MVCM04", "name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "phone": "+372 731 8990", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kopsukliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"20. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "19. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "68d277bc-cd32-2036-2194-0c0bad0ee1f9", "person_name": "Tanel Laisaar", "structural_unit": {"code": "MVCM04", "name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "phone": "+372 731 8990", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kopsukliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "86d07dd9-e216-3603-a89f-da8f788ec069", "person_name": "Manfrid Danilovitš", "structural_unit": {"code": "MVPT", "name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "email": "dph@ut.ee", "phone": "+372 737 4190", "webpage_url": "https://tervis.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "768138ee-3c39-7309-c3ef-8353e83fbd2f", "person_name": "Alan Altraja", "structural_unit": {"code": "MVCM04", "name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "phone": "+372 731 8990", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kopsukliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"20. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}, "19. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "f0ada8c5-4732-c481-e44c-2e96c33fb355", "person_name": "Lea Pehme", "structural_unit": {"code": "MVPT", "name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "email": "dph@ut.ee", "phone": "+372 737 4190", "webpage_url": "https://tervis.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "b37ebbc1-c50e-0762-a321-d9b3f431ef30", "person_name": "Kaija Tammekivi", "structural_unit": {"code": "MVCM", "name": {"en": "Institute of Clinical Medicine", "et": "kliinilise meditsiini instituut"}, "email": "kmi@ut.ee", "phone": "+372 737 5324", "webpage_url": "https://kliinilinemeditsiin.ut.ee", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"21. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "832662f3-4d1e-ea88-9c34-f738f5cc8864", "person_name": "Kaarel Kisant", "structural_unit": {"code": "MVPT", "name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "email": "dph@ut.ee", "phone": "+372 737 4190", "webpage_url": "https://tervis.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}], "study_groups": [{"uuid": "fc93283b-1d1a-d894-2a8a-298ced90aabd", "code": "19. rühm"}, {"uuid": "d226be77-6ed8-02f0-7d6e-0dab460b5944", "code": "20. rühm"}, {"uuid": "bd0d9087-f2b9-41fe-ca72-a6b3f23dff7b", "code": "21. rühm"}]}, "schedule": {"weeks": {"et": "korduv, 13 p"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. Chronic obstructive pulmonary disease (COPD) epidemiology, risk factors for developing the disease mechanisms, and differential diagnosis"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.  Pneumonias: classification, pathogenesis, diagnosis, differential diagnosis, etiology, and principles of management"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. Lung cancer"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. Pulmonary tuberculosis: epidemiology, contemporary measures of tuberculosis control. Tuberculosis and immunosuppression."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. Bronchial asthma: the nature of the disease, pathogenesis, risk factors, epidemiology, and diagnosis"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6.  Pleural diseases"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7.  Transmission of tuberculosis infection. Latent and active tuberculosis. Drug-resistant forms of tuberculosis, classification,  drug-sensitiive and multidrug-resistant tuberculosis. Organization ofthe maangement of tuberculosis."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. Sarcoidosis"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9. Idiopathic interstitial pneumonias"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "1. An introduction to the pulmonary patient. Major issues from patient's history. Signs and symptoms of the commonest respiratory diseases: cough, sputum/phlegm production, dyspnea, hunger for oxygen, cyanosis, wheeze, hemoptysis, stridor, snoring, daytime sleepiness, chest pain etc.: variants, coexistence, and interpretation. Hemoptysis and pulmonary hemorrhage, their management. Inspection, palpation, auscultation, percussion. Variants and significance of the findings. Demonstration of suitable pulmonary patients.\nLung function testing: spirometry, how to perform spirometry, the major spirometric indices, analysis of the results; major patterns of the ventilation defects on spirometry: obstruction and restriction. Measurement of the peak expiratory flow (PEF). Alternatively, these findings can be discussed during studying the respective diseases during further classes. Assessment of the bronchodilator response. Measurement of the diffusing capacity of the lung, airway challenge tests and exercise tests. Pulse oximetry and blood gas analyses. Principles of body pletysmogrtaphy.\nPrinciples of radiological investigations in pulmonary medicine, indications for various investigations and analysis of the results (chest X-ray, variants of and requirements for the computed tomography of the chest depending on the diagnosis to be confirmed; other methods of radiological investigation of the respiratory organs and chest). Practical analysis of the radiological findings associated with various particular respiratory diseases (alternatively, the findings can be discussed associated with the respective diseases during the forthcoming classes)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "2. Bronchial asthma. Information needed from patient's history for the initial diagnosis. Typical symptoms and signs characteristic of asthma. The diagnosis of different types and degrees of severity of asthma, the diagnostic criteria. The major phenotypes of asthma. Demonstration of patients with asthma (with spirometry and bronchodilator responsiveness data). \n  Management of bronchial asthma. Pharmacotherapy: classes of medicines to treat asthma, mechanisms of action, application of medicines in connection with the pathogenesis and phenotypes of asthma. Stepwise therapy in asthma. Individual management plan for the patient; the role of patient education. Inhalation technique. Assessment of asthma control.\n  Asthma exacerbations and acute severe asthma: assessment of severity, diagnosis, emergency care and further management according to the severity of the attack. Follow-up after asthma exacerbations. Causes and avoidance of asthma exacerbations. \n  Demonstration of patients with asthma (in the absence, demonstration of patients with the asthma and chronic obstructive pulmonary disease overlap syndrome (ACOS))."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "3. Chronic obstructive pulmonary disease (COPD). Classification of COPD into emphysema-type and small airway disease-type COPD. Exposure to the risk factors of COPD, information needed from patient's history for the initial diagnosis KOK, symptoms and characteristic signs of COPD, clinical manifestations and course of COPD. Early case-finding and the diagnosis of COPD, all necessary tests and investigations to conform the diagnosis; assessment and classification of severity of COPD. Comparison of asthma and COPD, asthma and COPD overlap syndrome (ACOS)\n  The complications of COPD (pulmonary hypertension, cor pulmonale etc.). Demonstration of patients with COPD (incl. posr-bronchodilator spirometry results, data from lung diffusing capacity measurement, data from blood gas analyses and exercise tolerance measurements). \n  The complex management of COPD, treatments of choice in different degrees and forms of severity. Pharmacotherapy of COPD; non-pharmacological therapies for COPD, Principles of pulmonary rehabilitation, smoking cessation-related issues, long-term domiciliary oxygen therapy (principles, indications, and contraindications). Counseling in smoking cessation.\n  Acute exacerbations of COPD: symptoms and signs, assessment of severity and the need for hospitalization; management of acute exacerbations of COPD, reasons and prevention of exacerbations."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "4. Diseases of the pleura. Short overview on the anatomy and physiology of the pleura. Causes and mechanisms of accumulation of the pleural fluid. Transsudation and exsudation. Pleural effusions: clinical symptoms and signs, thoracocentesis and choosing the analyses; differential diagnosis of the pleural effusions, interpretation of the results. The diagnostic work-up (the diagnostic algorithm) in pleural effusions. Drainage of the pleural cavity. Typical characteristics of the pleural fluids in different particular diseases and conditions able to precipitate pleural effusions. Management of various pleural effusions and pleural diseases, including pleurodesis. Causes of relapsing pleural effusion. \nPleural empyema and pyopneumothorax: causes, mechanisms, diagnosis, and non-surgical management.\nPneumothorax: causes and mechanisms (spontaneous, traumatic), assessment and interpretation of the size of the pneumothorax; tension pneumothorax: assessment, significance, and management. Clinical signs, symptoms, diagnosis, differential diagnosis, and non-surgical management of pneumothorax. \nDemonstration of patients with the respective pleural conditions and/or discussion of case studies."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "5. Lower respiratory tract infections (LRTI). Approach to pneumonias: clinical symptoms, signs, and course, initial diagnosis, confirmation of the diagnosis; ancillary methods for the diagnosis (microbiological diagnosis, contemporary (molecular) diagnostic methods etc.); severity assessment and patient risks, hospitalization criteria. Differential diagnosis. Specific features of \"atypical\" and nosocomial pneumonias. \nPrinciples of management of pneumonia in various (outpatient, hospital, ICU) settings. Principles of guiding of the treatment. Non-responding pneumonia: causes, diagnosis, and management; management of the diagnostic alternatives initially diagnosed as pneumonia.\nComplications of pneumonia: causes, diagnosis, and principles of non-surgical management. \nOther LRTI: acute tracheitis, acute bronchitis, chronic bronchitis; acute exacerbations of chronic bronchitis (AECB): clinical symptoms and signs, classification, diagnostic criteria, criteria for antimicrobial management).\nDemonstration of patients having pneumonia with or without complications, as well as patients with acute exacerbations of chronic bronchitis (AECB) or those with acute exacerbation of airway-type COPD: discussion on their clinical and radiological findings, as well as treatment.\nBronchiectasis (BE): nature and classification of BE. Typical history, clinical manifestation, diagnosis. and management of BE (exacerbations and chronic management)\nDemonstration of cases with (acute exacerbation of) BE: discussion on their clinical and radiological findings, as well as treatment."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "6. Pulmonary vascular diseases. \nPulmonary embolism (PE), classification of PE. Venous thrombembolism (VTE) and pulmonary thrombembolism (PE): risk factors, pathogenesis and pathophysiology of PE, clinical symptoms and signs, their significance. Classification of PE according to the risks to the patient. Assessment of the clinical probability of PE. Diagnosis of PE (incl. the diagnostic algorithms), special confirmative investigations, confirmation of the diagnosis. Management of PE: possibilities (treatment modalities), their application in practice. Prevention of VTE and PE.\nPulmonary hypertension (PH): the nature, classification, causes and mechanisms. Clinical symptoms and signs, methods of early detection of PH. The diagnostic algorithm. The diagnostic workup of pulmonary arterial hypertension (PAH), specialized diagnostic tests and investigations; management and prognosis of PAH. Assessment of risks and response to treatment in PAH. Demonstration of patients with pulmonary vascular diseases and/or discussion of case studies."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "7. Pulmonary neoplasms. Lung cancer: The clinical-pathological classification. Risk factors and typical history of patients with lung cancer. Clinical symptoms, signs, and patient complaints by localization and spread of the neoplasm. The whole diagnostic workup of lung cancer. Clinical and morphological diagnosis. The TNM classification and staging of lung cancer. \nDemonstration of patients with pulmonary neoplasms (lung cancer) and/or discussion of case studies.\nBronchoscopy: classification, indications, contraindications, and possibilities. Diagnostic and therapeutic bronchoscopies. Preparation of the patient for fiberoptic bronchoscopy. The visual finding, ancillary methods of investigation associated with bronchoscopy. Methods of therapeutic bronchoscopy, restitution of airway conductance/integrity (stenting, other methods of recanalization). Complications of bronchoscopy. \nParticipation in preparing the patient for fiberoptic bronchoscopy, attendance at bronchoscopy procedures (as an alternative, do it on the 1st practical class that is dedicated to the methods of investigation)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "8. 1) Sarcoidosis, 2) idiopathic pulmonary fibrosis (IPF) and other interstitial lung diseases (idiopathic interstitial pneumonias, hypersensitivity pneumonitis, pulmonary eosinophilia, vasculites involving the lungs, pulmonary manifestations of the major systemic connective tissue diseases, pulmonary consequences of the known exposures (pneumoconiosis, medicines/drugs, irradiation etc.)), 3) sleep-related breathing disorders (sleep apnea-hypopnea syndrome: classification, case finding. Obstructive sleep apnea-hypopnea syndrome (OSAS): causes, characteristic history, symptoms, and signs; diagnostic investigations, interpretation of the results, confirmation of the diagnosis, and management. \nDemonstration of patients with the respective diagnoses and/or discussions of the case studies (incl. analysis of the radiological findings, results of the lung function and/or sleep tests; when appropriate, also analysis of the results of bronchoscopic examination and/or pathological  investigation). \nAlternative: to discuss the topics 1, 2 and 3 during other practical classes, accordingly to the access to respective patients on the ward."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "9. Tuberculosis I.\nTransmission of tuberculosis infection. Latent tuberculosis infection (LTBI), its immunodiagnosis (Interferon-Gamma Release Assay, tuberculin skin test), prophylactic treatment of tuberculosis. Progression to active tuberculosis disease. Active pulmonary tuberculosis, its clinical forms. \nTB symptoms and clinical diagnosis of tuberculosis (radiology, opportunities of the contemporary laboratories of mycobacteriology). Different localizations of clinical tuberculosis. Pulmonary (PTB) and extra-pulmonary tuberculosis (EPTB).\nDemonstration of the patients and/or discussion of the case studies."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "10. Tuberculosis II.\n More common localizations of extra-pulmonary tuberculosis (EPTB), their symptoms and options for the diagnosis. \nDrug-resistant forms of tuberculosis: their classification and definitions (incl. multidrug-resistant and extensively drug-resistant tuberculosis). Treatment regimens for tuberculosis. \nTuberculosis and HIV-infection. Tuberculosis and anti-TNF-alpha treatment, tuberculosis and organ transplantation. \n\tDemonstration of the patients and/or discussion of the case studies."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "11.\tThoracic surgery 1. seminar\nSurgical anatomy of the chest. Evaluation of thoracic surgical patient - risk factors and symptomatology of thoracic surgical diseases, physical examination and radiological investigations used in thoracic surgery (chest x-raycomputed tomography, magnetic resonance imaging, positron-emission tomography, scintigraphy). Invasive diagnostics in thoracic surgery (transthoracic biopsy, surgical biopsy). Role of bronchoscopy in preoperative evaluation, in postoperative care and in follow-up of surgical patient.\nSurgical access to the thoracic cavity - thoracoscopy, mediastinoscopy, thoracotomy, sternotomy. Diagnostic operations - indications, how to choose a proper surgical method. Surgical access in elective and emergency surgery. Lung resections (wedge resection, segmentectomy, (bi)lobectomy, pneumonectomy, extended cancer resections). Peculiarity of anaesthesia in thoracic surgery. Analgesia methods - intercostal nerve blocade, epidural anaesthesia. \nSolitary pulmonary nodule - definition, possible etiologies, diagnostic methods, indications for follow-up. Discussion of case reports.\nMinimally invasive thoracic surgery - indications, contraindications. Diagnostic and therapeutic operations in lung, mediastinal and pleural diseases. Thoracic sympathectomy. Advantages of thoracoscopic surgery compared to open surgery."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "12.\tThoracic surgery 2. seminar\nLung cancer. Symptomatology, diagnostics, indications and methods of surgical treatment. Preoperative evaluation of lung cancer patient, operability (extent of the disease, fuctional diagnostics etc.). Basics of TNM classification. Patient survival according to the stage of the disease. Postoperative follow-up of lung cancer patient. How to diagnose recurrent disease. Multimodality therapy of lung cancer. Discussion of case reports.\nLung metastases - indications and limits of surgical treatment."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "13. Thoracic surgery 3. seminar\nThoracenthesis and pleural drainage - indications, contraindications, methods and complications. One, two and three bottle drainage, use of suction versus water seal. Digital pleural drainage systems.\nInvasive diagnostic methods of pleural diseases (indications for diagnostic thoracoscopy). Pleurodesis - indications, methods, results.\nPleural empyema - etiology, symptomatology, diagnostic criteria, choice of treatment method (pleural drainage, intrapleural fibrinolytic therapy, indications for thoracoscopy and thoracotomy, decortication, thoracoplasty, myoplasty, omentoplasty). Postoperative pleural empyema. Discussion of case reports.\nSurgical treatment of purulent lung diseases - lung abscess, bronchiectases (indications and methods of surgical therapy).\nTypes of pneumothorax. Causes, symptomatology and treatment (indications for surgical management) of spontaneous and iatrogenic pneumothorax. Discussion of case reports.\nSurgical diseases of the oesophagus. Oesophageal diverticula: indications and methods of surgical treatment. Oesophageal perforation - first symptoms, disease progression, diagnostics and treatment."}}]}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "03685b93-e5ec-9aba-092e-84c1e0904d3f", "parent_code": "ARKS.01.024", "parent_credits": 4.5, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}