{"uuid": "b7c4f1aa-0856-a887-17f8-2c98e6169754", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-11T14:30:06", "title": {"en": "Occupational Lung Diseases", "et": "Kutsekopsuhaigused"}, "credits": 2, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVCM04", "name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "phone": "+372 731 8990", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kopsukliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "label": {"en": "24/25 S regular MV", "et": "24/25 K PÕ MV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM04", "structural_unit_name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 12, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 40, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The curriculum of this subject involves major occupational lung diseases and diseases that develop as a result of exposure to workplace factors: their definitions, risk factors, diagnostic criteria, diagnostic work-up, confirmation of the diagnosis, principles of treatment, and methods of prevention together with related social and legal issues. Also, special traits related to occupational pulmonary diseases in comparison with ordinary respiratory medicine are discussed and the current knowledge in major pneumoconioses (pulmonary diseases related to exposure to asbestos, silica, talc, coal, and hard metal), occupational chronic obstructive pulmonary disease (COPD), occupational asthma, hypersensitivity pneumonitis, organic dust toxic syndrome, toxic lung injuries, and occupational neoplasms of the chest is provided.", "et": "Aine kava hõlmab tähtsamaid kutsekopsuhaigusi ja kutsetööga seotud tegurite toimel tekkinud kopsuhaigusi, nende definitsioone, riskitegureid, diagnostilisi kriteeriume, diagnostika käiku, diagnoosi kinnitamist, raviseisukohti, vältimise viise ning üldisemaid sotsiaal- ja õigusmeditsiinilisi aspekte. Detailselt aga kutsekopsuhaiguste käsitluse üldisi eripärasid muude kopsuhaigustega võrreldes, samuti olulisemaid pneumokonioose (asbesti-, ränitolmu-, talgi-, söe- ja raskmetallitolmustust, lisaks asbestist tingitud muid kopsuhaigusi), kroonilist obstruktiivset kopsuhaigust (KOK’i) kutsehaigusena, kutseastmat, hüpersensitiivsuspneumoniite, orgaanilise tolmu toksilist sündroomi, toksilisi kopsukahjustusi ja kutse-kopsukasvajaid."}, "objectives": [{"en": "The aim of the subject is to educate in major occupational lung diseases and diseases that develop as a result of exposure to workplace factors: definitions, risk factors, diagnostic criteria, diagnostic work-up, confirmation of the diagnosis, principles of treatment, and methods of prevention together with related social and legal issues. While a general aim is familiarizing the participants with special traits related to occupational pulmonary diseases in comparison with ordinary respiratory medicine, the particular aim is to provide the current knowledge in major pneumoconioses (pulmonary diseases related to exposure to asbestos, silica, talc, coal, and hard metal), occupational chronic obstructive pulmonary disease (COPD), occupational asthma, hypersensitivity pneumonitis, organic dust toxic syndrome, toxic lung injuries, and occupational neoplasms of the chest.", "et": "Kursuse eesmärk on õpetada tundma olulisemaid kutsetööst või kutsetööga seotud tegurite toimel  tekkinud kopsuhaigusi - nende definitsioone, riskitegureid, diagnostilisi kriteeriume, diagnostika käiku, diagnoosi kinnitamist, raviseisukohti, vältimise viise ning üldisemaid sotsiaal- ja õigusmeditsiinilisi aspekte. Üldisemaks eesmärgiks on tutvustada kutsekopsuhaiguste käsitluse eripärasid muude kopsuhaigustega võrreldes; konkreetseks eesmärgiks on tutvustada olulisemaid pneumokonioose (asbesti-, ränitolmu-, talgi-, söe- ja raskmetallitolmustust, lisaks asbestist tingitud muid kopsuhaigusi), kroonilist obstruktiivset kopsuhaigust (KOK’i) kutsehaigusena, kutseastmat, hüpersensitiivsuspneumoniite, orgaanilise tolmu toksilist sündroomi, toksilisi kopsukahjustusi ja kutse-kopsukasvajaid."}], "learning_outcomes": [{"en": "After passing the subject, the participants will be familiar with the major occupational lung diseases and diseases that develop as a result of exposure to workplace factors, with their definitions, risk factors, diagnostic criteria, diagnostic work-up, confirmation of the diagnosis, principles of treatment, and methods of prevention together with related social and legal issues. In particular, the participants will understand the special traits related to occupational pulmonary diseases in comparison with ordinary respiratory medicine, as well as will have the full updated knowledge on major pneumoconioses (pulmonary diseases related to exposure to asbestos, silica, talc, coal, and hard metal), occupational chronic obstructive pulmonary disease (COPD), occupational asthma, hypersensitivity pneumonitis, organic dust toxic syndrome, toxic lung injuries, and occupational neoplasms of the chest.", "et": "Õppeaine läbinu tunneb tähtsamaid kutsekopsuhaigusi ja kutsetööga seotud tegurite toimel tekkinud kopsuhaigusi, nende definitsioone, riskitegureid, diagnostilisi kriteeriume, diagnostika käiku, diagnoosi kinnitamist, raviseisukohti, vältimise viise ning üldisemaid sotsiaal- ja õigusmeditsiinilisi aspekte. Konkreetselt valdab õppeaine läbinu kutsekopsuhaiguste käsitluse eripärasid muude kopsuhaigustega võrreldes ning tunneb olulisemate pneumokoniooside (asbesti-, ränitolmu-, talgi-, söe- ja raskmetallitolmustuse koos asbestist tingitud muude kopsuhaiguste), kutsehaigusena esineva kroonilise obstruktiivse kopsuhaiguse (KOK’i), kutseastma, hüpersensitiivsuspneumoniitide, orgaanilise tolmu toksilise sündroomi, toksiliste kopsukahjustuste ja kutse-kopsukasvajate tervikkäsitlust."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "1. Kontrolltöö. Hinnatakse läbivõetud materjali omandamist. Kontrolltöö loetakse arvestatuks, kui on vähemalt 51 % õigeid vastuseid."}}], "grade_preconditions": {"et": "1) Osavõtt auditoorsest õppetööst vähemalt 90% ulatuses.\n2) Kõik nõuded peavad olema täidetud viimaseks loenguks."}, "grade_evaluation": {"et": "Kirjalik arvestus loetakse arvestatuks, kui vähemalt 51% küsimustest on õigesti vastatud."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga, enne vastava semestri lõppu."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "29c5a2b8-2288-474c-990f-d6292325ba72", "type": "MOODLE", "code": "ARKS.01.025", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "768138ee-3c39-7309-c3ef-8353e83fbd2f", "person_name": "Alan Altraja", "structural_unit": {"code": "MVCM04", "name": {"en": "Department of Pulmonology", "et": "kopsukliinik"}, "phone": "+372 731 8990", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kopsukliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "varieerub, selguvad semestri alguses"}, "entries": [{"time": "2025-02-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Pneumokonioosid I"}}, {"time": "2025-02-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Pneumokonioosid II Krooniline obstruktiivne kopsuhaigus kutsehaigusena"}}, {"time": "2025-02-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kutseastma"}}, {"time": "2025-02-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Toksilised kopsukahjustused"}}, {"time": "2025-02-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Hüpersensitiivsuspneumoniidid \n\nOrgaanilise tolmu toksiline sündroom. Rindkereelundite kasvajad kutsehaigusena"}}]}, "registration_info": {"audience": {"et": "AR 4, 5, 6 kursus"}, "min_students": 4, "max_students": 20}, "parent_uuid": "b0995a9c-7c68-bb46-0140-4e439bf613dd", "parent_code": "ARKS.01.025", "parent_credits": 2, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}