{"uuid": "f289b930-1843-3c7b-5de6-012cc078a156", "code": "ARLA.01.034", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-02T14:52:43", "title": {"en": "Fetal and Neonatal Physiology and Behaviour, Breastfeeding", "et": "Teadmisi rasedusest, perinataalmeditsiinist ja varasest lapseeast"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM06", "structural_unit_name": {"en": "Department of Pediatrics", "et": "lastekliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM06", "name": {"en": "Department of Pediatrics", "et": "lastekliinik"}, "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/lastekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course describes some aspects of family planning and pregnancy, delivery; fetal development in preparation for extrauterine life (e.q. development of fetal senses and learning abilities), neonatal behavior and development, fetal and neonatal diseases and prognosis; mother-infant bonding and attachment, breast milk composition, breastfeeding and councelling of parents.", "et": "Kursus käsitleb raseduseks valmistumist ja rasedust, sünnitust, loote ettevalmistust üsaväliseks eluks, vastsündinu oskusi, käitumist ja arendamist, aga ka probleeme; ema-lapse sidet, imetamist, rinnapiima koostist, suhtlemist lapsevanematega, nende nõustamist."}, "objectives": [{"en": "The aim is to provide the students, also as parents-in-future, with broader information about pregnancy and delivery; development of fetal and neonatal capabilities, behavior and care; how pregnancy and delivery influence neonatal health and behavior; why and how to promote breastfeeding; how to support mother-infant attachment and bonding.", "et": "Anda üliõpilastele kui tulevastele arstidele, aga ka tulevastele lapsevanematele lisateavet raseduse ja sünnituse; vastsündinu iseärasuste, hooldamise ning arendamise kohta. Selgitatakse, kuidas raseduse ja sünnituse kulg mõjutab loote ja vastsündinu tervist, käitumist ning ema ja lapse suhte arengut. Käsitletakse loomuliku toitmise aluseid: rinnapiima koostis ja kasulikkus, eduka imetamise alused, imetamise probleemid ja nõustamise põhitõed. Kursus laiendab üliõpilaste silmaringi laste- ja naistehaiguste õppekava-välise lisateabega."}], "learning_outcomes": [{"en": "The students will be able to understand human fetal and neonatal development, learn results of fetal, neonatal and childhood neurobiological research. They will be able to demonstrate knowledge of consequences of pregnancy and delivery to the fetal and neonatal behavior and health. They will know the benefits of breastfeeding and composition of breast milk to promote breastfeeding.", "et": "Üliõpilane saab algteadmised pereplaneerimisest, raseduse ja sünnituse kulust. Ta omandab algteadmised loote ja vastsündinu arengust ning seda häirivatest faktoritest. Ta saab informatsiooni loote ja vastsündinu meelte arengu uurimismeetoditest ja tulemustest. Ta õpib rinnapiima koostist ja kasulikkust, omandab imetamise nõustamise põhitõed. Üliõpilane on teadlik ema ja lapse omavahelise suhte arenemisest ja probleemidest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}