{"uuid": "a8449376-d314-c66b-c1b8-d21b80e1ac70", "code": "AROT.00.063", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Labour Law for Nursing Managers", "et": "Tööõiguse alused õendusjuhtidele"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The nature and scope of regulation of labour law, individual and collective employment relationships and other contracts for providing services under the law of obligations. Rights, duties and responsibilities of the parties. The procedure for entry into, amendment and termination of an employment contract. Legal regulation of working and rest time, vacations, remuneration, occupational health and safety. Labour disputes. Data protection in employment relationships. Terms and conditions of health insurance cover and adult education, equality of treatment and equality of rights at work.", "et": "Tööõiguse olemus ja rakendusala, individuaalsed ja kollektiivsed töösuhted ning teised võlaõigusliku teenuse osutamise lepingud. Poolte õigused, kohustused ja vastutus. Töölepingu sõlmimise, muutmise ja lõpetamise kord. Töö- ja puhkeaja, puhkuste, töötasu, tööohutuse ja -tervishoiu õiguslik reguleerimine. Töövaidlused. Andmekaitse töösuhetes. Ravikindlustuskaitse ja täiskasvanute koolituse tingimused, võrdne kohtlemine ja võrdõiguslikkus tööelus."}, "objectives": [{"en": "To develop knowledge of the regulation and practice of labour law, and skills for making legitimate decisions either as an employer or an employee. To give readiness to discuss on the scope of employment relationships.", "et": "Kujundada teadmised tööõiguse regulatsioonist ja praktikast ning oskused õiguspäraste otsuste tegemiseks töösuhetes nii tööandja kui ka töötajana. Kujundada valmidus arutleda töösuhete üle."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- orientate themselves in labour law and labour legislation, which are necessary for a nurse manager to organise their work;", "et": "- orienteerub tööõiguses ja tööõigusaktides, mis on vajalikud õendusjuhile töö korraldamiseks;"}, {"en": "- knows the problems which may arise when applying labour legislation and knows how to solve them;", "et": "- teab tööõigusaktide kohaldamisel tekkida võivaid probleeme ja nende lahendamise võimalusi;"}, {"en": "- is able to notice and analyse problems within the scope of labour law, and suggest solutions to prevent labour disputes from the perspective of either an employer or an employee;", "et": "- oskab märgata ja analüüsida tööõiguslikke probleeme ning pakkuda töövaidluste ennetamiseks lahendusi nii tööandja kui ka töötaja seisukohast;"}, {"en": "- is able to evaluate the legality, necessity and purpose of documents connected to employment relationships, from the perspective of either an employer or an employee; ", "et": "- oskab hinnata töösuhetega seotud dokumentide õiguspärasust, vajadust ja otstarbekust nii tööandja kui ka töötaja seisukohast; "}, {"en": "- is able to use the databases of legal acts and other relevant resources.", "et": "- oskab kasutada õigusaktide andmebaase ja muid asjakohaseid allikaid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}