{"uuid": "e3f71a8b-10a6-6ea3-fe62-f41143906095", "code": "AROT.00.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-02T15:18:48", "title": {"en": "Knowledge and Knowledge Development in Nursing Science", "et": "Teadmised, teave ja teabe arendamine õendusteaduses"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Core concepts, including the types of knowledge, related to the development of nursing science knowledge. The development of nursing science knowledge in the world. The impact of nursing science theories, models and methods on nursing practice. The nature, development stages and types of nursing science theory. Development strategies of a nursing science theory and evaluation criteria of a theory. Concept analysis as a knowledge development method, conducting and evaluating it critically.", "et": "Õendusteadusliku teabe arendamisega seotud põhimõisted, sh teadmiste tüübid. Õendusteadusliku teabe areng maailmas. Õendusteaduslike teooriate, mudelite ja meetodite mõju õenduspraktikale. Õendusteadusliku teooria olemus, arengustaadiumid ja tüübid. Õendusteadusliku teooria arendamise strateegiad ja teooria hindamise kriteeriumid. Mõisteanalüüs kui teabe arendamise meetod, selle koostamine ja kriitiline hindamine."}, "objectives": [{"en": "To deepen the understanding of the nature of nursing science, the development of knowledge in nursing science and the meaning of knowledge for nursing practice. To deepen the understanding of the concepts, theories, models and methods of nursing science. To develop readiness for the development of knowledge.", "et": "Süvendada arusaama õendusteaduse olemusest, õendusteadusliku teabe arendamisest ning teadmiste tähendusest õenduspraktikale. Süvendada arusaama õendusteaduse mõistetest, teooriatest, mudelitest ja meetoditest. Kujundada valmisolek teavet arendada."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- understands the nature, purpose and tasks of nursing science; the future of nursing science", "et": "- mõistab õendusteaduse olemust, eesmärke, ülesandeid ja tulevikusuundi"}, {"en": "- knows the types of knowledge in nursing science; ", "et": "- teab õenduses kasutatavaid teadmiste tüüpe;"}, {"en": "- knows the stages of nursing science theory and the types of nursing theory;", "et": "- teab õendusteooria arengustaadiumeid ja teooria tüüpe;"}, {"en": "- knows the strategies of theory development and the criteria for evaluating theories;", "et": "- mõistab teooria arendamise strateegiaid ja teooria hindamise kriteeriumeid;"}, {"en": "- is able to use and critically evaluate concept analysis as a knowledge development method.", "et": "- oskab teha ja kriitiliselt hinnata mõisteanalüüsi ning rakendada seda kui teabe arendamise strateegiat."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}