{"uuid": "87b6b5c8-bf06-c84f-9a9b-fd7a46f4737e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-23T20:00:06", "title": {"en": "Fundamentals of Personnel Management for Nursing Managers", "et": "Personalijuhtimise alused õendusjuhtidele"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "24/25 A block mode MV", "et": "24/25 S SÕ MV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 7, "colloquium": 0, "web_learning": 0, "independent_work": 51, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Concepts of personnel management and talent management; areas of personnel management and its relations to internal and external environments of an organisation; planning of human resources, hiring of employees; motivating and remunerating; staff development and career management; trends in personnel management.", "et": "Personalijuhtimise ja talendijuhtimise mõisted; personalijuhtimise valdkonnad ja seosed organisatsiooni sise- ja väliskeskkonnaga; inimressursi planeerimine, personali värbamine ja valik; motiveerimine ja tasustamine; töötajate arendamine ja karjäärijuhtimine; personalijuhtimise trendid."}, "objectives": [{"en": "To develop knowledge and an understanding of the principles of personnel management, and skills to apply them.", "et": "Kujundada teadmised ja arusaam personalijuhtimise põhimõtetest ning oskus neid rakendada."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows the nature of personnel management, talent management and career management and understands the importance of these in an organisation; ", "et": "- teab personalijuhtimise, talendijuhtimise ja karjäärijuhtimise olemust ning mõistab nende olulisust organisatsioonis; "}, {"en": "- knows the principles of personnel planning, hiring, evaluation, development and motivation of employees, and is able to apply them; ", "et": "- teab personaliplaneerimise, töötajate värbamise, hindamise, arendamise ja motiveerimise printsiipe ning oskab neid rakendada; "}, {"en": "- is able to analyse and ethically resolve cases related to personnel management, and use relevant sources of information;", "et": "- oskab analüüsida ja eetiliselt lahendada personalijuhtimisega seotud juhtumeid ning kasutada asjakohaseid infoallikaid;"}, {"en": "- is able to present his/her opinion in a reasoned manner, including in a digital environment.", "et": "- oskab oma arvamust argumenteeritult esitada, sh digitaalsetes keskkondades."}], "notes": {}}, "grading": {"independent_work": {"et": "Kirjutada essee ühel järgmistest teemadest: \nA. Personalijuhtimisalane probleem ja selle võimalik lahendus minu töökohal.\nB. Tervishoiuspetsialisti hea töö.\nC. Tervishoiuspetsialistide värbamise ja valiku eripära.\nD. Tööalane areng ja karjäär - kelle vastutus?\nTervishoiuspetsialisti võib asendada mõne teise erialaga - näiteks bioanalüütik, füsioterapeut, radioloogiatehnik, õde, ämmaemand jmt. Essee esitatakse Moolde'i kaudu ning esitamise tähtpäev on 11. november. Analüütilise ja arutleva essee pikkus on kuni 1300 sõna (ilma kasutatud kirjanduseta). Essee esitatakse pdf või word vormingus failina moodle kaudu; fail pealkirjastatakse järgmiselt: PJ autori eesnimini, autori perekonnanimi; essees näidatakse ära selle pikkus sõnades.\nEssee eesmärk on suunata osaleja analüüsima vähemalt ühte personalijuhtimisega seotud valdkonda, harjutada oma arvamuse argumenteeritud esitamist ning soodustada erialaste allikatega tutvumist ja nende kasutamist. Hinnatakse teema käsitlemise sügavust ja mitmekülgsust, autori vaatepunkti argumenteeritust ja isikupära, allikate kasutamise asjakohasust ja töö ülesehitust. Essee tulemus moodustab lõpphindest 40%, maksimaalselt on võimalik saada 40 punkti, kontrolltööle pääsemiseks peab saama vähemalt 20 punkti.\nParimate esseede autorid saavad õiguse teha seminaris esseepõhine ettekanne (kuni 10 minutit). Ettekande tegemises lepib õppejõud üliõpilasega kokku vähemalt viis päeva enne ettekande tegemist teises seminaris.\nLoengutes ja seminarides mitteosalemise korral tuleb iseseisvalt läbi töötada vastava loengu slaidid jm materjalid ning lahendada slaididel olevad ülesanded. Ülesannete lahendused võib (kuid ei pea) saata tagasiside saamiseks õppejõule. Õppejõud annab tagasisidet kas kirjalikult kui kokkuleppel üliõpilasega veebikohtumisel. Täpsemad õpijuhised on Moodle'is."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "ESSEE. Esitamise tähtpäev on 11. november. Essee esitatakse Moodle kaudu, vt essee teemad ja esitamine täpsemalt iseseisva töö juhend. Hinnatakse teema käsitlemise sügavust ja mitmekülgsust, autori vaatepunkti argumenteeritud esitust, kirjanduse kasutamist ja töö ülesehitust. Essee eest on võimalik saada maksimaalselt 40 punkti, st essee tulemus moodustab koondhindest 40%. Kontrolltöö tegemise õiguse saamiseks on vaja essee esitada vähemalt üks nädal enne kontrolltöö toimumist ning saada essee eest vähemalt 20 punkti.\nParimate esseede autorid saavad õiguse teha essee põhjal seminaris ettekanne (kuni 10 minutit). Ettekande tegemises lepib õppejõud üliõpilasega kokku hiljemalt viis päeva enne ettekannet e-posti teel. Rühmatagasiside esseede kohta antakse teises seminaris; individuaalne tagasiside esseede kohta esitatakse hiljemalt järgmisel päeval pärast 2. seminari Moodle'is. \nHindamine:\n40 punkti - sama mis 35 punkti ning lisaks on arutluskäik, kirjanduse kasutamine ja näited selgelt isikupärased, teema avamine uuenduslik, lähenemine loov;\n35 punkti - teadmised ja arusaamine teemast väga head; seisukoht selgelt esile toodud; arutluskäik loogiline ja sügav, kuid mõnevõrra ühekülgne või vähe originaalne; kirjanduse kasutamine mitmekülgne ja veenev, näited asjakohased; tekst sobivalt struktureeritud;\n30 punkti - teadmised ja arusaamine teemast head; seisukoht arusaadavalt esitatud; arutluskäik mõnevõrra vastuoluline või pinnapealne või ühekülgne; kirjandust kasutatud asjakohaselt, kuid ebapiisavalt; näidete kasutamine asjakohane, kuid ebapiisav; tekst liigendatud, kuid struktureeritus ei ole optimaalne: mõni teksti osa põhjendamatult pikk või lühike või vähe seostatud teiste osadega, lõikude järjestus ei toeta teema avamist;\n25 punkti - teadmised ja arusaamine teemast rahuldavad; üldjoontes seisukoht esitatud, arutlus loogiline, kuid pinnapealne ja ühekülgne; toodud näited ja kasutatud allikad ei ava teemat piisavalt; struktureeritus ei aita piisavalt kaasa teema avamisele - näiteks liiga pikad/lühikesed lõigud, struktuur ei toeta teema avamist, sissejuhatuses väide esitamata, kokkuvõte puudub või toob sisse uusi teemasid;\n20 punkti - teadmised ja arusaamine teemast on nõrgad, seisukoht esitamata; arutlus triviaalne ja vasturääkiv; toodud näited ja kasutatud kirjandus ei aita oluliselt kaasa teema avamisele; ülesehitus ei aita kaasa teema avamisele;\nalla 20 punkti - kirjutatud on teemast mööda, kaitstavat seisukohta ei ole esitatud, argumente ei ole, puudub selge mõte; sobivaid allikaid ei ole kasutatud, sobivaid näiteid ei ole toodud; tekst on struktureerimata."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "ETTEKANNE ja TOETAV OSALEMINE. Essee ja kontrolltöö annavad kokku 100% lõpphindest ehk kuni 100 punkti. Lisaks on võimalik lõpphinnet tõsta ühe astme võrra teiste õppimist toetava osalemisega loengutes ja seminaridel. \nTOETAVA OSALEMISE HINDAMINE - toetav osalemine tähendab ettekande tegemist seminaris või vähemalt viies loengus või seminaris teiste õppimise toetamist, st tähendab oma arvamuse või näite argumenteeritud esitamist ühe seminari või paarisloengu jooksul mitmel korral viisil, mis võiks aidata teistel osalejatel õpieesmärke saavutada. Toetava osalemise arvestust peab õppejõud ning toetava osalemise tulemused on näha Moodle'is järgmisel päeval pärast loengut või seminari. Essee alusel ettekande tegemise õiguse saavad parimate esseede autorid. Ettekande tegemises lepib õppejõud üliõpilasega kokku hiljemalt viis päeva enne ettekannet (st teist seminari) e-posti teel."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "KONTROLLTÖÖ toimub 20. detsembril Moodle'is. Kontrolltöö tegemise õiguse saamiseks tuleb hiljemalt üks nädal enne kontrolltööd esitada nõuetekohane essee (st essee eest peab saama vähemalt 20 punkti). Kontrolltöö eest on võimalik saada maksimaalselt 60 punkti. Positiivse lõpphinde saamiseks on vaja kontrolltöö eest saada vähemalt 31 punkti. Kontrolltööd hindan ja tagasiside esitan hiljemalt kolme tööpäeva jooksul Moodles.\nKontrolltöö eesmärk on hinnata aine õpiväljundite saavutamist ning anda osalejatele selle kohta tagasisidet. Kontrolltööd tehes võib kasutada kõiki digitaalseid ja paberkandjal infoallikaid, kuid ei tohi kasutada teiste inimeste (sh õpingukaaslaste) abi. Hinnatakse teadmiste süsteemsust ja sügavust; arusaamist PJ-st, selle valdkondadest ja valdkondadevahelistest seostest ning PJ mõjuritest; oskust kasutada omandatud teadmisi PJ-ga seotud probleemide analüüsimiseks ja lahendamiseks ning oskust oma seisukohti argumenteeritult ja selgelt esitada. Kontrolltöö koosneb kolmest osast: esimeses osas vastate valikvastustega küsimustele (maksimaalselt 24 punkti), teises osas toote ühe näite ja esitate ühe küsimuse (kokku maksimaalselt 18 punkti), kolmandas osas lahendate juhtumi (maksimaalselt 18 punkti). Kontrolltöö ülesehitusega tutvutakse teisel seminaril.\nPUNKTID\n60 punkti - sama, mis 49 - 54 punkti ning lisaks on näited, küsimused, lahedused ja põhjendused uuenduslikud ja loovad; \n49 - 54 punkti - teadmised, mõistete kasutamine ja arusaamine teemast väga head; seisukohad ja lahendused arusaadavalt esitatud; põhjendused loogilised, mitmekülgsed ja veenvad;\n43 - 48 punkti - teadmised, mõistete kasutamine ja arusaamine teemast enamasti head; seisukohad ja lahendused arusaadavalt esitatud; põhjendused mõnevõrra vastuolulised või pinnapealsed või ühekülgsed;\n37 - 42 punkti - teadmised, mõistete kasutamine ja arusaamine teemast enamasti rahuldavad; üldjoontes seisukohad ja probleemide lahendused esitatud, kuid argumenteeritus vastuoluline, pinnapealne või ühekülgne;\n31 - 36 punkti - teadmised on ebapiisavad, mõistete kasutamisel puudujäägid; puudub sügav arusaamine PJ olemusest, mõjuritest ja seostest; probleemide lahendused pinnapealsed, arvamused ei ole selgelt esitatud; lahendused ja arvamused ebapiisavalt põhjendatud;\nAlla 31 punkti -  teadmistes suured puudujäägid, mõistete kasutamisel põhimõttelised vead; puudub arusaam organisatsiooni välis- ja sisekeskkonna ning personalijuhtmise seostest; probleemide lahendused ja oma seisukohad puuduvad või on ebaeetilised."}}], "min_points_from_tests": 20, "grade_preconditions": {"et": "Nõuetekohase essee esitamine Moodle'is hiljemalt üks nädal enne kontrolltööd, korduskontrolltöö korral hiljemalt üks nädal enne korduskontrolltööd. Essee tulemus vähemalt 20 punkti ja kontrolltöö tulemus vähemalt 31 punkti."}, "grade_evaluation": {"et": "Lõpphinde kujunemine: kontrolltöö moodustab 60% (maksimaalselt 60 punkti) ja essee 40% (maksimaalselt 40 punkti) lõpphindest; kokku 100 punkti ehk 100% lõpphindest. Lisaks on võimalik lõpphinnet ühe astme võrra tõsta õppimist toetava osalemisega seminarides ja loengutel (vt täpsemalt ettekande hindamise juures). \nLõpphinde saamiseks summeeritakse essee (vähemalt 20 punkti) ja kontrolltöö (vähemalt 31 punkti) eest saadud punktid ning lõpphinne kujuneb järgmiselt:\nA 91 - 100  punkti\nB 81 - 90 punkti\nC 71 - 80 punkti\nD 61 - 70 punkti\nE 51 - 60 punkti\nF alla 51 punkti\nKui õppija on teinud seminaris ettekande või osalenud õppetöös viiel korral teiste õppimist toetavalt (vt täpsemalt toetava osalemise hindamine ettekande juures), tõstetakse õppija hinnet ühe astme võrra (va juhul, kui õppija tulemus essee ja kontrolltöö tulemuste summeerimisel on juba A).\nRühmatagasiside esseede kohta annan seminaris, individuaalse tagasiside esseede kohta esitan hiljemalt järgmisel päeval pärast 2. seminari Moodle'is. Kontrolltöö hindan ja tagasiside esitan hiljemalt kolme tööpäeva jooksul Moodle'is."}, "grade_conditions": {"A": {"et": "essee ja kontrolltöö eest kokku 91 - 100 punkti"}, "B": {"et": "essee ja kontrolltöö eest kokku 81 - 90 punkti"}, "C": {"et": "essee ja kontrolltöö eest kokku 71 - 80 punkti"}, "D": {"et": "essee ja kontrolltöö eest kokku 61 - 70 punkti"}, "E": {"et": "essee ja kontrolltöö eest kokku 51 - 60 punkti"}, "F": {"et": "essee ja kontrolltöö eest kokku alla 51 punkti"}}, "debt_elimination": {"et": "Nõuetekohase essee esitamine Moodle'is hiljemalt üks nädal enne kontrolltööd või korduskontrolltööd. Korduskontrolltöö võimalus vastavalt õppekorralduseeskirjale, kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Rühmatagasiside esseede kohta annan 2. seminaris, individuaalse tagasiside esseede kohta esitan hiljemalt järgmisel päeval pärast 2. seminari Moodle'is. Kontrolltöö hindan ja tagasiside esitan hiljemalt kolme tööpäeva jooksul Moodle'is."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "58447425-6f61-4958-84a3-b83a2d7ce83d", "type": "MOODLE", "code": "AROT.00.028_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Loenguslaidid Moodle'is"}, "type": {"code": "synopsis", "et": "Konspekt", "en": "Synopsis"}, "required": true}, {"name": {"et": "Personalijuhtimise või inimressursi juhtimise õpik osaleja valikul"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": true}, {"name": {"et": "Personalijuhtimisega seotud teaduspõhised allikad õppija valikul: artiklid, raamatud, tööturu jm asjakohased ülevaated, taskuhäälingud,"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}]}, "participants": {"lecturers": [{"person_uuid": "2ead2061-1498-52b0-be0d-a3341779707d", "person_name": "Mari Nõmm", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-22. nädal, toimub tsüklitena. Vt õppesessioonide nädalaid ja tunniplaani ka www.tervis.ut.ee"}, "entries": [{"course_week": 3, "time": "2024-09-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Personalijuhtimine ja talendijuhtimine - põhimõisted"}, "description": {"et": "Sissejuhatus ainesse, õpijuhised. PJ-ga seotud põhimõisted, PJ valdkonnad, PJ ja keskkonna seosed; talendijuhtimine."}}, {"course_week": 3, "time": "2024-09-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Personali planeerimine"}, "description": {"et": "Töötaja elukaar organisatsioonis; personali planeerimine ning tööjõu voolavus ja selle mõjutamine."}}, {"course_week": 5, "time": "2024-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "Personali värbamine, tööandjabränd"}, "description": {"et": "Personaliga kindlustamine: neli BBBB lähenemine, personali värbamise kavandamine ja värbamisalternatiivid, kandidaatideni jõudmine ja värbamisallikad.\n"}}, {"course_week": 5, "time": "2024-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"et": "Kandidaadite hindamine ja valik, sisseeleamise toetamine"}, "description": {"et": "Kandidaatide hindamise meetodid, kandidaatide kohtlemine, valiku tegemine; sisseelamisperiood; tööandjabränd ja selle kujundamine."}}, {"course_week": 9, "time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"et": "Töösoorituse juhtimine, paindlik töökorraldus (veebiloeng)"}, "description": {"et": "Töösoorituse, tulemuslikkuse, arengu eesmärgistamine; tulemuslikkusele suunatud organisatsioonikultuur; paindliku töökorralduse eripärad.\n"}}, {"course_week": 9, "time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {"et": "Töö korraldamine, töötajate hindamine ja tagasisidestamine (veebiloeng)"}, "description": {"et": "Töö korraldamise erinevad viisid, ametijuhendid töö korraldamise meetodina; töötajate hindamine ja tagasisidestamine."}}, {"course_week": 9, "time": "2024-10-31", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Õppimise reflekteerimine ja juhtumite lahendamine (veebiseminar 2 akad tundi)"}, "description": {"et": "Juhtumite teemad on PJ, planeerimine, värbamine, töösooritus"}}, {"course_week": 12, "time": "2024-11-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {"et": "Töömotivatsioon, töörahulolu, organisatsioonile pühendumine"}, "description": {"et": "Personali motiveerimine - mõiste, teooriad,  võimalused; seesmine ja väline motivatsioon; töörahulolu ja selle mõjutamine; organisatsioonilise pühendumise mõiste, liigid, mõjutamine.\n"}}, {"course_week": 12, "time": "2024-11-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {"et": "Tasustamine, palgasüsteemi kujundamine"}, "description": {"et": "Töötajate tasustamise eesmärk ja võimalused, palgapoliitika ja selle kujundamisega seotud põhiküsimused; motiveerimisraskused ja -trendid."}}, {"course_week": 12, "time": "2024-11-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "Õppimise reflekteerimine, ettekanded, kontrolltööks valmistumine (veebiseminar 4 akad tundi)"}, "description": {}}, {"course_week": 16, "time": "2024-12-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {"et": "Töötajate arendamine, koolitussüsteem (veebiloeng)"}, "description": {"et": " Personaliarenduse ja -koolituse mõisted ja võimalused; koolitussüsteem ja -protsess; personaliarenduse meetodid; õppiv organisatsioon.\n"}}, {"course_week": 16, "time": "2024-12-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {"et": "Kompetentsi- ja karjäärijuhtimine (veebiloeng)"}, "description": {"et": "Kompetentsijuhtimise ja karjäärijuhtimise mõisted, võimalused ja piirangud organisatsioonis; kompetentsijuhtimise seos organisatsiooni tervikliku arendamisega; karjäärijuhtimise eesmärgid töötaja, organisatsiooni ja ühiskonna vaates; personali arendamise suundumused."}}, {"course_week": 16, "time": "2024-12-20", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Kontrolltöö Moodles"}, "description": {"et": "Valikvastustega test, näitete esitamine, juhtumi lahendamine; e-kontrolltöö Moodle'is"}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 21}, "parent_uuid": "23ab3af6-ea90-106c-c3d1-76218c141186", "parent_code": "AROT.00.028", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}