{"uuid": "c58c686d-01cb-a96e-64f7-ddf45231305a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-02T12:28:30", "title": {"en": "Methods of Learning and Teaching in Nursing", "et": "Õppemeetodid õenduses"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "24/25 S block mode MV", "et": "24/25 K SÕ MV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 5, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 61, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Forms and methods of face-to-face and independent learning and teaching. Drawing up guidelines and learning and teaching materials; preparation and use of learning and teaching materials. Creation of digital learning materials and copyright protection requirements. Supporting independent learning. Organizing e-learning and digital learning environments. Supervising and giving feedback. The course develops learning and teaching skills such as self-management, collaboration, feedback, reading and writing an academic text, presentation, creativity and digital competences.", "et": "Auditoorse ja iseseisva õppetöö vormid ning meetodid. Juhendite ja õppematerjalide koostamine; Õppematerjalide ja -vahendite ning õpitegevuste ettevalmistamine. Digitaalsete õppematerjalide loomine ja autorikaitse nõuded. Iseseisva õppimise toetamine. E-õppe korraldamine ning digitaalsed õpikeskkonnad. Juhendamine ja tagasisidestamine. Ainekursus arendadab õppimise ja õpetamisega seotud oskusi, nagu enesejuhtimine, koostöö, tagasisidestamine, akadeemilise teksti lugemine ja kirjutamine, esinemine, loovus ning digipädevused."}, "objectives": [{"en": "To develop skills to select and apply methods of learning and teaching, pursuant to the teaching and learning environment and the specific nature of the basic studies and continuing education of nurses.", "et": "Kujundada oskus valida ja rakendada õppemeetodeid, lähtudes õpikeskkonnast ning õdede põhi- ja täiendusõppe eripärast."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- is able to prepare target audience aimed learning materials and guidelines for independent work; ", "et": "- oskab koostada sihtgrupile sobivaid õppematerjale ja iseseisva töö juhendeid; "}, {"en": "- is able to use diverse learning and teaching methods, techniques, and devices;", "et": "- oskab kasutada erinevaid õppemeetodeid, -tehnikaid ja -vahendeid; "}, {"en": "- is able to create an electronical learning environment;", "et": "- oskab luua elektroonilist õpikeskkonda;"}, {"en": "- appreciates and uses the principles and techniques of giving feedback; ", "et": "- väärtustab ja kasutab tagasiside andmise põhimõtteid ja tehnikaid; "}, {"en": "- is able to give, receive and analyse feedback.", "et": "- oskab anda, vastu võtta ja analüüsida tagasisidet."}], "notes": {"et": "Seminaridel osalemine on kohustuslik ning puudumine on aktsepteeritud vaid mõjuva põhjusega. Puudumise korral tuleb käsitletud teemad iseseisvalt läbi töötada ning vajadusel koostada õppejõu antud juhiste põhjal iseseisev töö, mis kokkuleppel õppejõuga esitatakse ühe nädala jooksul seminari toimumise päevast.\n\nKURSUSE TEEMADE LÄBIMISE JÄRJEKORD JA VORM VÕIB SÕLTUVALT KURSUSEL OSALEJATE ÕPIVAJADUSTEST MUUTUDA KA KURSUSE KÄIGUS!\n\nÕppejõu kontaktandmed:\n\nTaivi Mutso - taivi.mutso@ut.ee\nJanne Kommusaar - janne.kommusaar@ut.ee"}}, "grading": {"independent_work": {"et": "1. E-õpe Moodle keskkonnas (kohustusliku õppekirjanduse lugemine, õpiülesannete täitmine, aktiivne suhtlus veebifoorumites) ning seminarideks ettevalmistamine - 17 tundi.\n\n2. Kodutöö koostamine (õppematerjali/ -vahendi koostamine auditoorses õppetöös kasutamiseks) - 12 tundi.\n(Iseseiseiv kodutöö seisneb õppematerjali-/ vahendi koostamises õppejõu poolt etteantud või soovitatud teemal õppetunni läbiviimiseks; Kodutöö koostamiseks tuleb rakendada teemakohase teaduskirjanduse otsimise oskust, leidlikkust, loomingulisust ning oma varasemaid õpetamis- ja õppimisalaseid teadmisi ning kogemusi. Tööle peab olema lisatud kirjandusele toetuv selgitus, kuidas õppematerjal/-\nvahend töötab ehk kuidas see aitab kaasaegsel moel õppijal teadmisi või oskusi omandada.\n\n3. Praktilise ülesande koostamine paaris või rühmas ning selle tutvustamine seminaris (praktiline ülesanne seisneb elektroonilise õpikeskkonna loomises õe või ämmaemanda põhi- või tasemeõppe üliõpilastele ühe ainekursuse raames) - 32 tundi\nKursusel osalevad üliõpilased valivad ühe õe või ämmaemanda õppekava ainekrsuse, millele loovad veebipõhise õpikeskkonna Moodles. Valitav ainekursus jagadakse teemadeks, nii et 2-3 tudengit vastutavad ühe teema eest. Loodav õpikeskkond peab sisaldama infot õpetatava eesmärgi, sisu ja hindamismeetodite kohta ning iseseisvate tööde juhiseid. Elektroonilise õpikeskkonna loomisel arvestatakse sihtgrupi võimalike eelteadmiste ning oskustega.\n\nNB! Detailsed juhendid iseseivate tööde teostamiseks on kättesaadavad ainele registreerunud õppijatele Moodle keskkonnas asuvas kursuse juhendis."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "ÕPPEMATERJALI/ -VAHENDI KOOSTAMINE (mitteeristav hindamine - arvestatud/mittearvestatud).\nHindamiskriteeriumid:\n* Üliõpilane on koostanud õppematerjali/-vahendi auditoorses õppetöös kasutamiseks;\n* Õppematerjali/-vahendi koostamisel on lähtutud sihtgrupist, õppetöö eesmärkidest, ajalimiidist ja õpikeskkonnast;\n* Üliõpilane on läbi mõelnud ja kirjandusele toetudes selgitanud, kuidas õppematerjal töötab ehk kuidas see aitab kaasaegsel moel õppijal teadmisi või oskusi omandada;\n* Õppematerjali koostamisel on lähtutud autorikaitse nõutest;\n* Üliõpilane on seminaris demonstreerinud enda poolt koostatud õppematerjali/-vahendit ning põhjendanud selle eesmärgipärasust"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Rühma või paaristööna ELEKTROONILISE ÕPIKESKKONNA LOOMINE (mitteeristav hindamine - arvestatud/mittearvestatud). \nHindamiskriteeriumid:\n* Üliõpilane on loonud ühe õe või ämmaemanda õppekava ainekursuse jaoks elektroonilise õpikeskkonna ja tutvustanud seda seminaris\n* Elektrooniline õpikeskkond sisaldab infot valitud teema eesmärgi, õpiväljundite, sisu ning hindamismeetodite kohta\n* Elektrooniline õpikeskkond sisaldab juhiseid üliõpilasele isiklike eesmärkide püstitamiseks ning on illustreeritud konkreetsete näidetega teadmistest ja oskustest, mille õppijad võiksid teema läbimise lõpus saavutada.\n* Elektrooniline õpikeskkond sisaldab käsitletava teema iseseisvate tööde juhendeid (vähemalt 2).\n* Elektroonilise õpikeskkonna tekst on keeleliselt korrektne. Vormistus on visuaalselt meeldiv. \n* Elektroonilise õpikeskkonna koostamisel on võetud arvesse sihtgrupi võimalikke eelteadmisi ning oskusi."}}], "grade_preconditions": {"et": "Hindamisele pääsemise eelduseks on loengutes ja seminarides osalemine, kodutöö esitamine ja praktilise ülesande sooritamine etteantud tähtajaks.\nHindamisele pääsemise tingimuste mittetäitmist käsitletakse võlgnevustena."}, "grade_evaluation": {"et": "Õppeaine lõpeb arvestusega (arvestatud/mittearvestatud). Õppeaine saab arvestatud kui arvestuse saamise eeltingimused on täidetud ning kodutöö ja praktiline ülesanne vastavad hindamiskriteeriumitele."}, "debt_elimination": {"et": "* Kui esitatud kodutöö või praktiline ülesanne ei vasta ainekavas kirjeldatud hindamiskriteeriumitele, on üliõpilasel õigus oma tööd üks kord täiendada ja uuesti esitada (järelesitada). \n* Kui hindamisele pääsemise tingimused on ainekursuse viimaseks seminariks täitmata, siis on võlgnevusi võimalik likvideerida aasta möödumisel (osaledes kursusel koos noorema kursuse üliõpilastega)."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "ac4f9079-9175-4772-8092-2fa6269b72cf", "type": "MOODLE", "code": "AROT.00.069_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "*Adamsoo, R. Autoriõigustest e-õppes. Autoriõiguste järgimine e-kursuste ja digitaalsete õppematerjalide koostamisel. Tartu Ülikooli koduleht.\n* Autoriõiguse seadus. RT I, 04.01.2021, 20\n* Digitaalse õppematerjali loomise soovitused. Juhend digitaalse õppematerjali autorile. Hariduse Infotehnoloogia Sihtasutus.\n* Eesti elukestva õppe strateegia 2020\n* Fiock, H. (2020). Designing a Community of Inquiry in Online Courses. The International Review of Research in Open and Distributed Learning, 21(1), 135-153.\n* Hattie, J., Timperley, H. (2007). The Power of Feedback. Review of Educational Research, 77(1): 81-112. \n* Juhend kvaliteetse e-kursuse loomiseks. (2019). Hariduse Infotehnoloogia Sihtasutus.\n* Karm, M. (2013). Õppemeetodid kõrgkoolis. SA Archimedes, Tartu.\n* Kärtner, P. (2010). Üliõpilaste uurimistööde juhendamine ja tagasisidestamine. SA Archimedes, Tartu, lk 57-61.\n* Marandi, T., Pilt, L. (2020). E-õppija käsiraamat. Tartu Ülikool.\n* Moodle juhend õppejõule. Tartu Ülikool.\n* Pilli, E., Karm, M., Poom-Valickis,K., Pilt,L,. Marandi, T. Aktiivõppemeetodid e-õppes\n\n******************************************************************************************************************************\n* Loengumaterjalid. \n* Lisaks õppejõu poolt Moodle'i vastavale kursusele lisatud materjalid.\n* Iseseisvate tööde koostamise käigus kasutatud materjal.\n******************************************************************************************************************************", "recommended_materials": "* Bloomfield, J., Roberts, J., & While, A. (2010). The effect of computer-assisted learning versus conventional teaching methods on the acquisition and retention of handwashing theory and skills in pre-qualification nursing students: a randomised controlled trial. International journal of nursing studies, 47(3), 287-294.\n* Boyd, L., Lawson, C., MacLeod, W., & Harianto, S. (2019). The use of near peer teachers in the radiography program at Monash University. Radiography (London, England : 1995), 25(3), 190-193.\n* Christine Elizabeth Holbrey (2020) Kahoot! Using a game-based approach to blended learning to support effective learning environments and student engagement in traditional lecture theatres, Technology, Pedagogy and Education, 29:2, 191-202.\n* Dehghanzadeh, S., & Jafaraghaee, F. (2018). Comparing the effects of traditional lecture and flipped classroom on nursing students' critical thinking disposition: A quasi-experimental study. Nurse education today, 71, 151-156.\n* Holland, A., Smith, F., McCrossan, G., Adamson, E., Watt, S., & Penny, K. (2013). Online video in clinical skills education of oral medication administration for undergraduate student nurses: a mixed methods, prospective cohort study. Nurse education today, 33(6), 663-670.\n* Huang, X. L., Tsao, Y., Chung, H. C., & Creedy, D. K. (2021). Effects of a mobile phone application for graduate nurses to improve central venous catheter care: A randomized controlled trial. Journal of advanced nursing, 77(5), 2328-2339.\n* Jackson, D., Hickman, L. D., Power, T., Disler, R., Potgieter, I., Deek, H., & Davidson, P. M. (2014). Small group learning: Graduate health students' views of challenges and benefits. Contemporary nurse, 48(1), 117-128.\n* Oyler, D. R., & Romanelli, F. (2014). The fact of ignorance: revisiting the Socratic method as a tool for teaching critical thinking. American journal of pharmaceutical education, 78(7), 144.\n* Peck, S. D., Werner, J. L., & Raleigh, D. M. (2013). Improved class preparation and learning through immediate feedback in group testing for undergraduate nursing students. Nursing education perspectives, 34(6), 400-404. \n* Rankin, J., & Brown, V. (2016). Creative teaching method as a learning strategy for student midwives: A qualitative study. Nurse education today, 38, 93-100.\n* Roberts, S. G., Warda, M., Garbutt, S., & Curry, K. (2014). The use of high-fidelity simulation to teach cultural competence in the nursing curriculum. Journal of professional nursing : official journal of the American Association of Colleges of Nursing, 30(3), 259-265.\n* San Martín-Rodríguez, L., Escalada-Hernández, P., & Soto-Ruiz, N. (2020). A themed game to learn about nursing theories and models: A descriptive study. Nurse education in practice, 49, 102905.\n* Shiner, N., & Howard, M. L. (2019). The use of simulation and moulage in undergraduate diagnostic radiography education: A burns scenario. Radiography (London, England : 1995), 25(3), 194-201.\n* Sowan, A.K., Jenkins, L.S. (2013). Use of the Seven Principles of Effective Teaching to Design and Deliver an Interactive Hybrid Nursing Research Course. Nursing Education Perspectives, 34(5): 315-322. \n* Warren-Forward, H. M., & Kalthoff, O. (2018). Development and evaluation of a deep knowledge and skills based assignment: Using MRI safety as an example. Radiography (London, England : 1995), 24(4), 376-382.\n* Watson, K., Wright, A., Morris, N., McMeeken, J., Rivett, D., Blackstock, F., Jones, A., Haines, T., O'Connor, V., Watson, G., Peterson, R., & Jull, G. (2012). Can simulation replace part of clinical time? Two parallel randomised controlled trials. Medical education, 46(7), 657-667."}, "participants": {"lecturers": [{"person_uuid": "8d797a72-0871-f7d2-87d8-3a92bc5f1182", "person_name": "Taivi Mutso", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "e7de7d0d-e226-d9cc-1088-d72fff94cc34", "person_name": "Janne Kommusaar", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25.-38. õppenädal, toimub tsüklitena. Vt õppesessioonide nädalaid ja tunniplaani ka www.tervis.ut.ee"}, "entries": [{"time": "2025-02-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatus ainesse. Kursuse sisu ja iseseisvate tööde eesmärkide ning juhendite tutvustamine (2) - Taivi Mutso"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "e-loeng Õppemeetodid ja nende tõhustamise strateegiad õdede õppes ning täienduskoolituses - kaasaegne õpikäsitlus (1)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "e-loeng Õppematerjalide ja -vahendite ning õpitegevuste ettevalmistamine. Digitaalsete õppematerjalide loomine ja autorikaitse (1)"}}, {"time": "2025-03-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Iseseisvalt ettevalmistatud kodutöö esitlemine. Arutelu ja tagasiside. (4) - Taivi Mutso"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "e-loeng Täiskasvanud õppija kujundamine ennastjuhtivaks õppijaks, õppija juhendamine ja toetamine. Iseseisva töö juhendamine (1)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "e-loeng E-õppe korraldamine ning digitaalsed õpikeskkonnad (1)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "e-loeng Tagasiside andmine ja vastuvõtmine (1)"}}, {"time": "2025-05-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Praktilise ülesande esitamise seminar: arutelu, tagasiside andmine, refleksioon. Kursuse kokkuvõte. (6) - Taivi Mutso"}}]}, "registration_info": {"audience": {"et": "Õendusteaduse magistriõppe 2. aasta üliõpilased"}, "min_students": 10, "max_students": 21}, "parent_uuid": "92d588b5-81d8-95c8-ce3c-2ac71fe143f4", "parent_code": "AROT.00.069", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}