{"uuid": "23ab3af6-ea90-106c-c3d1-76218c141186", "code": "AROT.00.028", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-04T13:54:29", "title": {"en": "Fundamentals of Personnel Management for Nursing Managers", "et": "Personalijuhtimise alused õendusjuhtidele"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Concepts of personnel management and talent management; areas of personnel management and its relations to internal and external environments of an organisation; planning of human resources, hiring and choosing of employees; motivating and remunerating; staff development and career management; trends in personnel management.", "et": "Personalijuhtimise ja talendijuhtimise mõisted; personalijuhtimise valdkonnad ja seosed organisatsiooni sise- ja väliskeskkonnaga; inimressursi planeerimine, personali värbamine ja valik; motiveerimine ja tasustamine; töötajate arendamine ja karjäärijuhtimine; personalijuhtimise trendid."}, "objectives": [{"en": "To develop knowledge and an understanding of the principles of personnel management, and skills to apply them.", "et": "Kujundada teadmised ja arusaam personalijuhtimise põhimõtetest ning oskus neid rakendada."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows the nature of personnel management, talent management and career management and understands the importance of these in an organisation; ", "et": "- teab personalijuhtimise, talendijuhtimise ja karjäärijuhtimise olemust ning mõistab nende olulisust organisatsioonis; "}, {"en": "- knows the principles of personnel planning, hiring of employees, evaluation, development and motivation, and is able to apply them; ", "et": "- teab personaliplaneerimise, töötajate värbamise, hindamise, arendamise ja motiveerimise printsiipe ning oskab neid rakendada; "}, {"en": "- is able to analyse and ethically resolve cases related to personnel management, and use relevant sources of information;", "et": "- oskab analüüsida ja eetiliselt lahendada personalijuhtimisega seotud juhtumeid ning kasutada asjakohaseid infoallikaid;"}, {"en": "- is able to present his/her opinion in a reasoned manner, including in a digital environment.", "et": "- oskab oma arvamust argumenteeritult esitada, sh digitaalsetes keskkondades."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}