{"uuid": "827efd58-3163-5b21-60f9-0176ebd38b4e", "code": "ARPA.01.028", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Pathological Anatomy", "et": "Patoloogiline anatoomia"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS10", "structural_unit_name": {"en": "Department of Pathological Anatomy and Forensic Medicine", "et": "patoloogilise anatoomia ja kohtuarstiteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVBS10", "name": {"en": "Department of Pathological Anatomy and Forensic Medicine", "et": "patoloogilise anatoomia ja kohtuarstiteaduse osakond"}, "email": "patol@ut.ee", "phone": "+372 737 4300", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/patoloogilise-anatoomia-ja-kohtuarstiteaduse-osakond", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides theoretical and practical basis of knowledge about general pathological processes and organ-specific pathomorphological alterations, necessary for proceeding into the study of clinical disciplines. The course is divided into three topics: The tumors, General pathology (details the basic mechanisms of injury to cells and tissues, their reactions as well as the body's means of response and reparation) and Anatomical surgical pathology (teaches diagnosis of disease based on pathomorphological alterations in different organ systems).\nThe sources of theoretical knowledge are the textbooks and presentations, videolectures and self-assessment tests represented in the Moodle learning platform. For learning of microscopic alterations, the database of digital microscopy slides with tutorial videos is available in the Moodle, grouped according to the topics. The course will emphasize on oral pathology, including the changes in oral cavity in general diseases.\nIn seminars and practical classes, description of cases, their analysis and integrating into formulation of diagnostic hypothesis is practiced both orally and in group activities.\nParticipation in seminars and practical classes is mandatory. The students have to complete all tests, assessments and practical tasks by terms.", "et": "Kursus annab haiguslikest protsessidest ja haiguslikest muutustest teoreetilise ja praktilise teabe, mis on vajalik kõigi kliiniliste distsipliinide järgnevaks omandamiseks. Aine on jaotatud kolme teemablokki: Kasvajad, Üldpatoloogia (käsitleb rakkude ja kudede üldisi reaktsioone, mis on omased kõigile haigustele, samuti organismi vastusreaktsioone kahjustusele ja paranemisprotsesse) ja Eripatoloogia (käsitleb haiguste diagnoosimist elundkondade kaupa). Süvendatult õpitakse suuõõnehaigusi ja üldhaiguste puhul esinevaid muutusi suuõõnes.\nTeoreetilisi teadmisi õpitakse õpiku ning Moodle õppeinfosüsteemi baasil konspektide, videoloengute ja enesetestide abil. Mikroskoopiliste muutuste õppimine toimub digitaalsete histopreparaatide alusel, mis on kättesaadavad Moodle süsteemis koos õppevideotega teemade kaupa grupeeritud andmebaasidena. Praktikumides toimub iseseisvalt omandatud teabe kinnistamine ja seostamine haigusprotsessidega ning kliiniliste tähendustega.  Praktikumides ja seminarides harjutatakse suuliste vastuste ja grupitegevustena juhupõhiste patomorfoloogiliste muutuste kirjeldamist, analüüsi ja integreerimist diagnoosihüpoteeside püstitamisse.\nPraktikumides ja seminarides osalemine on kohustuslik. Üliõpilased peavad tähtajaks olema sooritanud kõik testid, arvestused ja praktilised ülesanded."}, "objectives": [{"en": "The goal of pathological anatomy course is to provide theoretical and practical knowledge about the causes (etiology), the mechanisms by which a causative agent leads to disease (pathogenesis) and the associated alterations of structure (pathomorphology); to develop skills of observation, interpretation, and integration needed to analyze human disease; to teach comprehensive medical reasoning skills so that the student would become able to understand the associations between the morphological changes and their etiopathogenetic mechanisms as well as clinical symptoms and consequences; to teach interpreting of morphological findings especially in oral cavity and its use in stomatological diagnostics.  The course provides knowledge in pathology for working as a dentist.", "et": "Patoloogilise anatoomia õppeaine eesmärgiks on anda teoreetilisi ja praktilisi teadmisi haiguste põhjustest (etioloogiast), nende toimel haiguse kujunemist (patogeneesist) ning haiguseprotsessis tekkivatest struktuurilistest (patomorfoloogilistest) muutustest organismais ja organites; õpetada haigustunnuste uurimist, tulemuste interpreteerimist ja haigusprotsessi mõistmist; kujundada seoselist arstlikku mõtlemist organismis haiguslike morfoloogiliste muutuste ning nende etiopatogeneesi ja kliiniliste tagajärgede vahel; arendada rõhutatult suuõõne patomorfoloogiliste muutuste interpretatsiooni ja selle kasutamist stomatoloogilises diagnostikas. Õppeaine annab hambaarstina töötamiseks vajalikud teadmised patoloogilisest anatoomiast."}], "learning_outcomes": [{"en": "The student who graduated the course getting at least the minimal grade: knows terms, definitions and names of most important diagnoses in pathological anatomy; is able to make associations between macroscopic or microscopic pathomorphological changes and their etiopathogenetic mechanisms as well as clinical symptoms and functional consequences to the organism; can distinguish pathomorphological changes of oral diseases and the most frequent general diseases from normal findings and evaluate them in the context of clinical classifications; can formulate logically the pathogenetic reasoning of the diseases; collaborates within the groups in order to solve clinical cases.", "et": "Õppeaine läbinu vähemalt miinimumhindele teab patoanatoomias kasutatavaid mõisteid, definitsioone ja olulisemaid diagnoose; oskab luua seoseid makro- ja mikroskoopiliste patomorfoloogiliste muutuste ja nende tekkemehhanismide ning kliiniliste sümptomite ja organismi talituslike tagajärgede vahel;  suudab eristada suuõõnehaigustele ja levinumatele üldhaigustele iseloomulikke patomorfoloogilisi muutusi normist ja hinnata neid kliinilise klassifikatsiooni kontekstis; formuleerib loogiliselt haiguste patogeneetilisi põhjendusi; teeb rühmas koostööd haigusjuhtude situatsioonülesannete lahendamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}