{"uuid": "8f2da46a-531f-b3d4-145d-affa69043516", "code": "ARRD.00.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-01T15:39:35", "title": {"en": "Practical Radiology", "et": "Praktiline radioloogia"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM11", "structural_unit_name": {"en": "Department of Radiology", "et": "radioloogiakliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM11", "name": {"en": "Department of Radiology", "et": "radioloogiakliinik"}, "email": "rad@ut.ee", "phone": "+372 731 9660", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/radioloogiakliinik", "address": "L. Puusepa 8 - G1.R 174\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8 - G1.R 174", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "3a8d6968-0cee-caef-f54f-b1b23145433b", "code": "MV00.00.039", "title": {"en": "Fundamentals of Diagnostics", "et": "Diagnostika alused"}, "credits": 16, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-01T15:12:20", "alternatives": [{"uuid": "62901d09-3d45-ffd9-06b8-8df341b867b7", "code": "AR00.00.016", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Diagnostics", "et": "Diagnostika alused"}, "credits": 17, "type": {"code": "complex", "et": "Kompleksaine", "en": "Complex course"}}]}]}, "overview": {"description": {"en": "The subject is introducing the practical work in the radiological department. The students follow the choice, planning, performance of the investigation, the reconstruction process and archiving of the images performed by radiology technicians and radiologists. \nThe student follows the radiologist on call consulting radiology technicians and planning and performing the radiological investigations in the emergency department.", "et": "Kursuse ajal tutvustatakse praktilist tegevust kaasaegses radioloogiaosakonnas. Vaadeldakse radioloogiliste uuringute valikut, planeerimist, teostamist , piltide rekonstrueerimist ja arhiveerimist radioloogiatehnikute ja radioloogide poolt. Jälgitakse valveradioloogi tööd, kes konsulteerib radioloogiatehnikut, osaleb uuringute planeerimisel ja läbiviimisel erakorralise meditsiini osakonnas"}, "objectives": [{"en": "1.\tThe aim of this subject is to obtain practical knowledge in radiology department: in x-ray, computed tomography, magnetic resonace tomography and ultrasonography aswell as in nucler medicine", "et": "1.\tKursuse eesmärk on tutvustada praktilist tegevust kaasaegses radioloogiaosakonnas: röntgenoloogilisi, kompuutertomograafilisi, magnetresonsntstomograafilisi ja ultraheliuuringuid ja uuringuid nukleaarmeditsiini osakonnas. "}, {"en": "2.\tThe aim of this subject is  to obtain the knowledge in planning, performing, reconstracting and archiving the investigations. ", "et": "2.\tKursuse eesmärk on anda ülevaade uuringute planeerimisest, läbiviimisest, rekonstrueerimisest  ja salvestamisest pildiarhiveerimissüsteemi. "}, {"en": "3.\tThe aim is to obtain knowledge in optimal planning of the radiological investigations based on radioprotection and patients situation in emegency department.", "et": "3.\tEesmärk on saada aru radioloogiliste uuringute optimaalse planeerimise vajalikkusest lähtuvalt kiirguskaitsest ja patsiendi seisundist erakorralise meditsiini osakonnas"}], "learning_outcomes": [{"en": "1.\tThe student understands what happens with the patients during the radiological investigations, how to prepare and perform the investigation and  to reconstract and archive the images. ", "et": "1.\t Üliõpilane saab aru, mis toimub patsiendiga erinevate radioloogiliste uuringute ajal, kuidas uuringuid ette valmistatakse, läbi viiakse, rekonstrueeritakse ja salvestatakse "}, {"en": "2.\t The student understands the role of radiology technician and radiologists in the radiology department.", "et": "2.\tÜliõpilane saab aru radioloogiatehniku ja radioloogi osast patsiendi käsitlemisel  radioloogiaosakonnas"}, {"en": "3.\tThe student understands the importance of the optimal planning of  investigations in different organ pathology dependant how most optimally and rapidly reach the diagnosis based on radioprotection, age and other risks.", "et": "3.\tÜliõpilane saab aru uuringu planeerimise vajalikkusest eri organpatoloogiate korral, optimaalset uuringu valikust sõltuvalt kiirguskaitsest, vanusest, teistest riskidest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}