{"uuid": "28bfe21d-0e4b-67a2-241f-d806ba9c479e", "code": "ARST.01.126", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Stomatognathic Physiology II", "et": "Mälumisfüsioloogia II"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVST", "structural_unit_name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVST", "name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "phone": "+372 731 9856", "webpage_url": "https://hambaarstiteadus.ut.ee", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "768cc64f-b679-936a-ec65-c32921672d6f", "code": "ARST.01.069", "title": {"en": "Oral and Maxillofacial Surgery I", "et": "Suu- ja näolõualuukirurgia I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "537ec97a-8cb7-e6d0-60fb-e978ab380c66", "code": "ARST.01.111", "title": {"en": "Oral and Dental Diseases I", "et": "Suu- ja hambahaigused I"}, "credits": 12, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "e58d34f4-ae73-05c3-e78a-e9e0664f7813", "code": "ARST.01.112", "title": {"en": "Prosthetic Dentistry I", "et": "Ortopeediline stomatoloogia I"}, "credits": 10, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The students should understand the basic significance of dentistry of the stomatognatic system.\nThe students should be familiar with the physiologic function and pathophysiologic mechanisms of the stomatognatic system.\nThe students should know and understand the relationship between the temporomandibular joints, the movements of the lower jaw and the teeth.\nThe students should be able to diagnose and treat temporomandibular TMD.", "et": "Üliõpilane saab aru mälumissüsteemi e. stomatognaatse süsteemi seotusest lokaalselt hammaskonnaga ja üldiselt kogu terve organismiga. Üliõpilane on tuttav mälumissüsteemi füsioloogiliste funktsioonidega ja patofüsioloogiliste mehhanismidega. Üliõpilane mõistab alalõualiigese omavahelist ühendust ja seotust kõrvalasetsevate struktuuridega, on võimeline diagnoosima ja ravima mälumissüsteemi häireid (alalõualiigese- ja lihaspatoloogiaid)."}, "objectives": [{"en": "The main aim of the course is to integrate different disciplines such as the anatomy, physiology, restaurative dentistry, prosthetic dentistry, orthodontics, oral and maxillofacial surgery and radiology into the multidisciplinary field of stomatognatic physiology.", "et": "Antud kursuse eesmärk on integreerida anatoomias, füsioloogias, suu- ja hambahaiguste erilas, ortopeedilises stomatoloogias, ortodontias, suu- ja näolõualuukirurgias ning radioloogias omandatud tedmised ja praktilised kogemused mälumisfüsioloogia eriala omandamiseks, kuna hästi funktsioneeriv mälumissüsteem on iga hambaravi lõppeesmärk."}], "learning_outcomes": [{"en": "Stomatognatic physiology is a basic discipline of dental science. A well-functioning stomatognatic system should be the goal of all dental treatment. The students should be familar with the functions of stomatognatic physiology and patopfysiological mechanisms. Students should understand the connections between temporomandibular joints and surroudings tissues. Students should be able to perform the TMJ clinical examination, to diagnose and suggest treatment.", "et": "Tudeng saab aru mälumissüsteemi e. stomatognaatse süsteemi seotusest lokaalselt hammaskonnaga ja üldiselt kogu terve organismiga.\nTudeng on tuttav mälumissüsteemi füsioloogiliste funktsioonidega ja patofüsioloogiliste mehhanismidega.\nTudeng mõistab alalõualiigeste omavahelist ühendust ja seotust kõrvalasetsevate struktuuridega.\nTudeng on võimeline teostama patsiendi mälumissüsteemi kliinilist eksamineerimist (hambumuse hindamine, röntgenogrammide interpreteerimine jne), diagnoosima ja esmatasandil ravima mälumissüsteemi häireid (alalõualiigese- ja lihaspatoloogiaid) ning vajadusel oskama patsienti edasi suunata teiste erialade (ortodont, näo-lõualuude kirurg jt) spetsialistide poole."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}