{"uuid": "b034b36f-98d6-596a-ff41-7ee8f700c4e2", "code": "ARST.01.131", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-23T09:00:53", "title": {"en": "Treatment of Orofacial Functional Disorders. Teamwork", "et": "Näo- ja lõualuude piirkonna funktsioonianomaaliad. Meeskonnatöö"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVST", "structural_unit_name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVST", "name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "phone": "+372 731 9856", "webpage_url": "https://hambaarstiteadus.ut.ee", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The main functions of the maxillofacial system are suction, deglutition, chewing, breathing, speech and mimics. If those functions do not work properly, then the growth of maxillofacial system will also be disturbed. The sooner we discover and treat the faulty function, the smaller amount of damage will linger.\nSince the earliest children are being brought to the orthodontist appointment at the age of 7 or 8, orthodontists get a chance to diagnose a function disorder too late. Most of the children visit an orthodontist for the first time at the age of 11-13. If you discover a proper function anomaly only at the teenage years, then treating this problem at this age is more difficult than when a child is 1-3 years old.\nTreatment of function disorders is a teamwork. It is good to notice a functional disorder as early as possible. Then we can help a child more efficiently. Most importantly, then we have a chance to prevent the generation of big health concerns that in the future may become costly and time-consuming for the family as well as the society.\nNumbers of patients with obstructive sleep apnea (OSA) are not followed up to secure normal breathing pattern post adenotonsillectomy (AT). Children with OSA end up in our clinic too late. The optimal window to first investigate the tendencies is a 2-3 year of life to look for signs of OSA. Currently, the average age is around 7-10 years, when we first see our patients in the clinic. Estonia has a well-running daycare centre system. About 90% children attend these centres. There are as well speech therapists in every daycare centre. Our long-time target is to teach the daycare centre personnel together with a local speech therapist to point out those children, who are continuous mouth breathers, to advice parents to seek help.", "et": "Näo- ja lõualuude süsteemi põhifunktsioonid on: imemine, neelamine, mälumine, hingamine, kõne ja miimika. Kui üks neist funktsioonidest on vigane, siis häirub näo- ja lõualuude süsteemi kasv. Mida varem avastame vigase funktsiooni ja selle korrigeerime, seda väiksemad püsivad kahjustused tekivad. Ortodontiline ravi ei anna tihti püsivat ja edukat tulemust, sest orofatsiaalsed müofunktsionaalsed puuded ja erinevad suutervist mõjutavad harjumused saavad tähelepanu liiga hilja või jäävad sootuks korrigeerimata. Kõige varem satuvad lapsed ortodondi juurde 7-8-aastaselt, kuid selleks ajaks võib hambumusanomaalia põhjustaja, nt keele vale asend puhkeolekus ja neelamisel, olla kestnud juba 6-7 aastat. Müofunktsionaalne ümberõpetamine ja harjumuste ümberkujundamine on aga äärmiselt raske ja pikk protsess, mis sõltuvalt patsiendi vanusest. Seetõttu tuleks müofunktsionaalsete puuetega ja juba tekkinud hambumusanomaaliatega lapsed leida üles võimalikult varajases eas. Üldtervise ja hambumusprobleeme on võimalik ennetada ja nende süvenemist ära hoida, ent seda kõrva-, nina- ja kurguarsti, ortodondi, logopeedi ja müofunktsionaalse terapeudi koostöös. Vajadus meeskonnatöö ja süsteemse sekkumise järele on suur, kuna ühe spetsialisti tööl pole erilist tulemust, kui teine spetsialist enda pädevuses olevat probleemi lahendama ei asu.\nSiia kategooriasse kuulub ka uneapnoe, mida käsitleme kursuse raames eraldi teemana, kuid samas on ta ainult \"suure pildi\" üks, aga väga oluline osa ja on erinevate spetsialistide poolt jäänud tähelepanuta. Kursuse jooksul harjutame haigusjuhtude lahendamist meeskonnatööna, sest antud probleem puudutab väga paljusid erialasid."}, "objectives": [{"en": "The course is giving an overview of orofacial normal functions and dysfunctions; about aetiology, prevention and treatment principles in a multidisciplinary team.", "et": "Kursus annab ülevaate näo- ja lõualuude piirkonna funktsioonianomaaliatest, funktsioonianomaaliate tekkepõhjustest, ennetamisest, ravi põhiprintsiipidest ja interdistsiplinaarsest meeskonnatööst."}], "learning_outcomes": [{"en": "Participants will:", "et": "Peale kursuse läbimist üliõpilane:"}, {"en": "- Be able to identify and recognise orofacial dysfunction", "et": "- tunneb ära näo- ja lõualuude piirkonna funktsioonianomaaliad;"}, {"en": "- Learn the role played by myofunctional therapy in treatment success", "et": "- mõistab näo- ja lõualuude piirkonna funktsioonianomaaliate ravi põhiprintsiipe;"}, {"en": "- Be able to evaluate need of treatment", "et": "- oskab hinnata ravivajadust;"}, {"en": "- Be able to understand work principles of multidisciplinary team", "et": "- saab aru interdistsiplinaarse meeskonnatöö funktsioneerimisest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}