{"uuid": "82fede37-3a5e-b8aa-7c9b-27c5f1fca9b4", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-14T10:36:36", "title": {"en": "Principles of Communication and Health Behaviour in Medicine", "et": "Suhtlemise ja tervisekäitumise alused"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT04", "name": {"en": "Department of Public Health", "et": "rahvatervishoiu õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "24/25 S regular MV Eng", "et": "24/25 K PÕ MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "MVPT04", "structural_unit_name": {"en": "Department of Public Health", "et": "rahvatervishoiu õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 21, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 71, "individual_work": 0, "internship": 4}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The core of the subject \"Communication and Health Behaviour\" is learning the basic communication skills and their application in patient consultations and promoting health behaviour. The context is based on the Calgary-Cambridge consultation model, enriched with communication techniques derived from motivational interviewing. Both approaches are evidence-based and widely implemented in the medical field.\n\nKnowledge and skills are acquired through reading, analyzing, practicing, and discussing study materials. The course is divided into independent learning and contact training, supported by Moodle. In Moodle, students can find study materials and instructions, take tests, and submit their independent work. Assessment and feedback are provided through Moodle, with formative feedback also given during practicals by both instructors and peers.\n\nThe learning materials include interactive study objects, recorded video lectures, links to and references for scientific literature, and tasks and self-assessment tests to reinforce the topics. The central teaching method is based on the flipped classroom approach, where students acquire the material beforehand and apply their knowledge in practicals through situational tasks. Practicals involve practicing consultation initiation, information gathering and sharing, maintaining structure and collaborative relationships with patients, and making shared treatment decisions/plans.\n\nThe course also addresses other topics that can influence patient communication and treatment adherence, such as attitudes and values, communication barriers, factors affecting decision-making, and their associations with conflicts and treatment errors. Additionally, the course covers factors influencing health behaviour more broadly and specifically addresses communication with vulnerable groups (e.g., children, adolescents).\n", "et": "Sisu lühikirjeldus\nSuhtlemise ja tervisekäitumise aluste aine keskmes on suhtlemise baasoskused ja nende rakendamise võimalused patsiendiga konsultatsiooni läbiviimisel ja tervisekäitumise edendamisel. Käsitletav kontekst lähtub Calgary-Cambridge konsultatsioonimudelist, mida sisustavad motiveerivast intervjueerimisest lähtuvad suhtlemisvõtted. Mõlemad lähenemised on tõenduspõhised ning leidnud meditsiinivaldkonnas laialdast rakendamist. \n\nAines omandatakse teadmised ja oskused õppematerjalidega tutvumise, analüüsimise, praktiseerimise ja arutelude kaudu. Aine jaguneb iseseisvaks õppeks ja kontaktõppeks ning sellel on Moodle tugi. Moodle keskkonnas paiknevad õppematerjalid ja õpijuhised ning seal saab sooritada teste ja sinna tuleb esitada oma iseseisvad tööd. Moodle vahendusel toimub hindamine ja iseseisvate tööde tagasisidestamine. Kujundavat tagasisidet saavad õppijad ka praktikumides nii õppejõult kui kaasõppijatelt.\n\nÕppematerjalideks on interaktiivsed õpiobjektid, mis sisaldavad videoloenguid, linke ja viiteid õppekirjandusele ning kinnistavaid ülesandeid ja enesekontrolli teste. Aine keskne õppemeetod lähtub ümberpööratud klassiruumist, kus teemekohane materjal omandatakse enne ja koha peal praktikumides rakendavad õppijad eelnevalt omandatud teadmisi praktikas situatsioonülesannete lahendamisel. Praktikumides harjutatakse nt konsultatsiooni alustamise, info kogumise ja jagamise põhimõtteid, kuidas hoida struktuuri ja koostöölisi suhteid patsiendiga, jagatud raviotsuste/plaanide tegemiseni välja. \n\nAines käsitletakse muid patsiendiga suhtlemise kulgu ja ravisoostumist mõjutada võivad teemasid: hoiakud ja väärtused, suhtlemistõkked, otsustusprotsessi mõjutavad tegurid ning nende seosed konfliktide tekkimise ja ravivigadega.  Lisaks käsitletakse aines laiemalt tervisekäitumist mõjutavaid tegureid ning kitsamalt erinevate haavatavate gruppidega (nt lapsed, noorukid).\n"}, "objectives": [{"en": "A student who has undergone a subject understands the physical, psychological, and social factors that may influence a person's behavior and is able to apply evidence-based communication techniques in standard situations when consulting the patient (including taking medical history).", "et": "Aine läbinud õppur saab aru inimese käitumist mõjutavatest füüsilistest, psüühilistest ja sotsiaalsetest tagamaadest (teguritest) ja oskab tüüpülesannetes rakendada tõenduspõhiseid suhtlemise võtteid patsiendiga konsultatsiooni läbi viimisel (sh anamneesi võtmisel)."}], "learning_outcomes": [{"en": "After passing the course students:", "et": "Õppeaine läbinud õppijad:"}, {"en": "(1) Are able to apply the Cambridge-Calgary model and motivational interviewing communication skills, considering both patient and physician perspectives to ensure comprehensive and person-centered healthcare. \n(2) Understand the essence of empathy and can explore patient ideas, concerns, and expectations (ICE), using the Ask-Offer-Ask model for effective information exchange and involving patients in the decision-making process.\n(3) Purposefully apply communication techniques in situational tasks and consultations, supporting patient autonomy and active participation.\n(4) Know the factors affecting access to healthcare and the impact of sociodemographic characteristics on health.\n(5) Understand the impact of attitudes and values on communication quality and can apply conflict resolution techniques in situational tasks.\n(6) Are able to provide constructive feedback and engage in self-reflection to continuously improve communication skills and professional development.", "et": "(1) Oskavad rakendada Cambridge-Calgary mudelit ja motiveerivast intervjueerimisest lähtuvaid suhtlemise põhioskusi, arvestades patsiendi ja arsti perspektiive tervikliku ja isikukeskse tervishoiuteenuse tagamisel.\n(2) Mõistavad empaatia olemust ning oskavad uurida patsiendi ideid, muresid ja ootusi (IMO) ning kasutada uuri-paku-uuri mudelit efektiivseks infovahetuseks ja patsientide kaasamiseks otsustusprotsessi. \n(3) Rakendavad eesmärgipäraselt suhtlemisvõtteid situatsioonülesannetes ja konsultatsioonil, toetades patsiendi autonoomiat ja aktiivset osalust.\n(4) Teavad tervishoiule ligipääsu mõjutavaid tegureid ja sotsiaaldemograafiliste tunnuste mõju tervisele.\n(5) Mõistavad hoiakute ja väärtuste mõju suhtlemise kvaliteedile ning oskavad rakendada konfliktide lahendamise võtteid situatsioonülesannetes. \n(6) Oskavad anda konstruktiivset tagasisidet ja tegeleda eneserefleksiooniga, et pidevalt parandada oma suhtlemisoskusi ja professionaalset arengut. "}], "notes": {}}, "grading": {"independent_work": {"en": "The achievement of learning outcomes is measured by the following independent tasks and learning activities\nOutcome (1) M1 and M2 tests and participation in practicals.\nOutcome (2) M1 and M2 tests and participation in practicals.\nOutcome (3) Assignment “Analysis of own conversation” and participation in practicals. \nOutcome (4) M4.1 and M4.2 tests and participation in seminars.\nOutcome (5) M3 test, group assignment “Conflict case analysis”, and participation in practicals.\nOutcome (6) Self-reflection I, II and participation in practicals.\n\nMore detailed study instructions are included in the Moodle.", "et": "Õpiväljundite saavutamist mõõdavad järgmised iseseisvad tööd ja õpitegevused:\nVäljund (1) M1 ja M2 testid ja osalemine praktikumides\nVäljund (2) M1 ja M2 testid ja osalemine praktikumides\nVäljund (3) Ülesanne \"Oma vestluse analüüs\" ja osalemine praktikumides\nVäljund (4) M4.1 ja M4.2 testid ja osalemine seminarides\nVäljund (5) M3 test, grupitöö ülesanne \"Konfliktjuhtumi analüüs\" ja osalemine praktikumides\nVäljund (6) Enesereflektsioon I, II ja osalemine praktikumides\n\nTäpsemad õpijuhised on lisatud Moodlesse."}, "grade_preconditions": {"en": "To receive an automatic final grade (regular assessment), all assignments must be submitted and graded as passed on time, and all practicums must be attended.\n\nThe prerequisite for taking the complex post-assessment (second resit) is the submission of all independent tasks before the examination.\"", "et": "Automaatse arvestuse (ehk korralise hinde) saamiseks peavad olema tähtaegselt esitatud ja arvestatud kõik ette nähtud iseseisvad tööd ning osaletud praktikumides.\n\nKompleksjärelearvestusele (2. kordushindamine) pääsemise eeltingimuseks on kõikide iseseisvate tööde tööde esitamine enne arvestuse toimumist."}, "grade_evaluation": {"en": "In regular assessment (automatic pass), the final grade is formed by the collection of all module-based assignments (tests and independent tasks). If the assignments are submitted on time, have received a positive grade, and there are no absences, the Moodle grading system automatically marks the course as passed.\n\nIn the first resit, which takes place a week after the deadline for the last assignment, the final grade is also formed by the collection of all assignments. The group supervisor will assess up to three assignments that were not submitted on time or did not meet the requirements, and up to two make-up tasks for absences. If the work meets the requirements, the course is graded as passed.\n\nThe second resit is at the end of the semester and is intended for those who had more than three overdue independent tasks or missed more than two practicals during the course. The complex post-assessment is a combined evaluation consisting of written and oral parts.", "et": "Korralisel hindamisel (automaatne arvestus) kujuneb lõpphinne kõikide moodulipõhiste arvestuslike tööde (testid ja iseseisvad tööd) kogumina: kui arvestuslikud tööd on tähtaegselt esitatud ja saanud positiivse hinde ning pole puudumisi, siis Moodle hindamistabel loeb automaatselt aine arvestatuks. \n\nEsimesel kordushindamisel kujuneb lõpphinne samuti kõikide arvestuslike tööde kogumina, kus nädala jooksul automaatsest arvestusest, hindab rühma juhendaja kuni kolme töö puhul korralisele hindamisele tähtaegselt esitamata jäänud või nõuetele mitte vastanud tööd ja kuni kahe puudumise korral tasandustööd ning nõuetele vastavate tööde puhul kannab sisse arvestused.\n\nTeine kordushindamine toimub semestri lõpus ja on mõeldud neile, kellel aine jooksul esines võlgnevusi rohkem kui kolme iseseiva töö puhul või on puudutud rohkem kui kahest praktikumist. Kompleksjärelarvestus on aineülene kombineeritud hindamine, mis koosneb kirjalikust ja suulisest osast."}, "grade_conditions": {"arvestatud": {"en": "Independent tasks are submitted and they meet the assignment requirements, and tests are completed on time.", "et": "Iseseisvad tööd on esitatud ja need vastavad ülesandepüstitusele ja testid on sooritatud tähtaegselt."}, "mittearvestatud": {"en": "Independent tasks do not meet the assignment requirements (threshold), and the test performance falls below the set threshold.", "et": "Iseseisvad tööd ei vasta ülesandepüstitusele (lävendile), testisooritus jääb allapoole seatud lävendit."}, "mitteilmunud": {"en": "Independent tasks have not been submitted on time.", "et": "Iseseivat tööd ei ole esitatud tähtaegselt."}}, "debt_elimination": {"en": "Debts can be cleared throughout the course and at the end of the course, one week after the deadline for the last independent task. Debts cleared during the course or in the last week will not be counted until the automatic assessment grades have been issued.", "et": "Võlgnevusi saab likvideerida kogu kursuse vältel ning kursuse lõpus nädal aega peale viimase iseseisva töö esitamise tähtaega. Kursuse väletel või viimasel nädalal likvideeritud võlgnevusi ei arvestata enne, kui on välja pandud automaatse arvestuse hinded."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {"en": "Students can see the results of regular (continuous) assessment throughout the entire study period in Moodle: all assignments submitted on time and meeting the requirements are graded as close to the submission deadline as possible (test results are available immediately, written assignments within one to two weeks). After the teacher grades the last assignment and if there are no outstanding tasks, the course is automatically marked as passed in Moodle.\n\nThe first resit is similar to regular assessment. Within a week of the automatic grade, any cleared outstanding tasks are also graded in addition to the already assessed performances\n\nThe second resit is a complex post-assessment and takes place at the end of the semester (the concrete dates are listed in Moodle and included in the timetable). The results of the second resit are transferred to students, usually at the end of the assessment.", "et": "Korralise (pidev)hindamise tulemusi näeb õppija kogu õppeperioodi vältel Moodlest: kõik tähtaegselt ja nõuetekohased sooritused saavad hinnatud võimalikult esitamise tähtaja lähedal (testitulemused selguvad kohe, kirjalike tööde puhul nädala kuni kahe jooksul) ning peale õppejõu poolt viimase töö hindamist, võlgnevuste puudumisel, toimub Moodle vahendusel aine automaatne arvestamine. \n\nEsimene kordushindamine on sarnane korralisele hindamisele. Nädala jooksul automaatsest arvestusest hinnatakse, lisaks juba hinnatud sooritustele, ära likvideeritud võlgnevused. \n\nTeine kordushindamine on kompleksjärelarvestus ning see toimub semestri lõpus (kuupäev on Moodles täpsustatud ja kantud ka tunniplaani), hindamistulemused teavitatakse reeglina arvestuse lõpus."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "5f221eca-01b4-4fbd-818c-6b80ccfa7219", "type": "MOODLE", "code": "ARTH.02.082", "base_url": "undefined", "linked_to_groups": ["48bab034-b416-7e6d-8094-f845e1b6a9a6", "de00d043-c18a-a4c9-4942-e071b1975ba3"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Study materials are available in  Moodle."}, "participants": {"lecturers": [{"person_uuid": "b7051e84-c4bf-0296-763c-1570b6b95c4c", "person_name": "Marje Oona", "structural_unit": {"code": "MVPT01", "name": {"en": "Department of Family Medicine", "et": "peremeditsiini õppetool"}, "email": "peremed@ut.ee", "phone": "+372 731 9211", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "12. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "76007893-dcb8-5635-1adf-3bbde508baa5", "person_name": "Anneli Rätsep", "structural_unit": {"code": "MVPT01", "name": {"en": "Department of Family Medicine", "et": "peremeditsiini õppetool"}, "email": "peremed@ut.ee", "phone": "+372 731 9211", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "51956955-6a9b-3bde-563c-411b644e430b", "person_name": "Inga Karton", "structural_unit": {"code": "MVPT01", "name": {"en": "Department of Family Medicine", "et": "peremeditsiini õppetool"}, "email": "peremed@ut.ee", "phone": "+372 731 9211", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "12. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "e9647c25-696d-5197-ea08-c81650f74681", "person_name": "Ave Kovaljov", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "12. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "2713530f-96c0-094a-b5fc-2367ed0cc78f", "person_name": "Tatjana Meister", "structural_unit": {"code": "MVPT01", "name": {"en": "Department of Family Medicine", "et": "peremeditsiini õppetool"}, "email": "peremed@ut.ee", "phone": "+372 731 9211", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"11. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "12. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}], "study_groups": [{"uuid": "48bab034-b416-7e6d-8094-f845e1b6a9a6", "code": "12. rühm"}, {"uuid": "de00d043-c18a-a4c9-4942-e071b1975ba3", "code": "11. rühm"}]}, "schedule": {"weeks": {"et": "24-37"}}, "registration_info": {"audience": {"et": "2nd year medical students"}, "min_students": 1}, "parent_uuid": "9acf46b5-2b5c-3e6d-e503-d66875a3e5c7", "parent_code": "ARTH.02.082", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}