{"uuid": "718b3f2f-ef04-2fe9-3af2-58fb82f6dd6c", "code": "FLAJ.03.191", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Main Pedagogical Traineeship", "et": "Ajaloo ja ühiskonnaõpetuse põhipraktika"}, "credits": 11, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ03", "structural_unit_name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVAJ03", "name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "phone": "+372 737 5650", "address": "Jakobi 2 - 220, 231\nEST", "street": "Jakobi 2 - 220, 231", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "782c5d3a-3507-761b-d9c7-abe045207e86", "code": "FLAJ.03.140", "title": {"en": "History and Civics Didactics", "et": "Ajaloo ja ühiskonnaõpetuse didaktika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "7120a013-d8b4-9ca7-cc29-7749659ff1a8", "code": "FLAJ.03.141", "title": {"en": "Principles of Civics Education", "et": "Ühiskonnaõpetuse korraldus koolis"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "This course is for supporting student's professional development by creating opportunities to integrate the studies in the university altogether with practical teacher's activities in an educational institution.\nTeaching practice take place during 10 weeks, when they should give 45 subject lessons: 35 in history (20 lessons in basic school and 15 lessons in gymnasium) and 10 lessons of civics (in basic school or in gymnasium).", "et": "Ainekursus toetab üliõpilase professionaalset arengut, luues võimalusi seostada ülikooliõpingud tervikuks praktilises õpetaja töös õppeasutuses. Praktika toimub 10 nädala jooksul, mil tuleb anda 45 ainetundi: 35 ajalootundi (20 põhikoolis ja 15 gümnaasiumis) ja 10 ühiskonnaõpetuse tundi (põhikoolis või gümnaasiumis)."}, "objectives": [{"en": "The course has three main goals that should be achieved based on the completed studies in the university and jointly with continuous pedagogical traineeship:", "et": "Õppeainel on kolm üldeesmärki, mis saavutatakse, tuginedes läbitud ülikooliõpingutele ja koos pideva pedagoogilise praktikaga:"}, {"en": "1)\tto support student's improvement to be a teacher by creating opportunities to integrate previously completed studies altogether with practical teacher's activities in an educational institution;", "et": "1)\ttoetada üliõpilase kujunemist õpetajaks, luues võimalused eelnevalt läbitud õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses;"}, {"en": "2)\tto create opportunities to explore the educational process as a whole and to teach during a complete educational period;", "et": "2)\tluua võimalused õppe- ja kasvatustöö kui terviku tundmaõppimiseks ja läbiviimiseks kompaktse õppeperioodi vältel;"}, {"en": "3)\tto enable to practice the knowledge and skills of the history and civics subject and didactics and to acquire proper experiences for teaching those subjects in basic school and gymnasium according to the National Curriculum.", "et": "3)\tpraktiseerida ajaloo ja ühiskonnaõpetuse aine ja didaktika alaseid teadmisi ja oskusi ja omandada kogemusi nende ainete õpetamiseks põhikoolis ja gümnaasiumis vastavalt riiklikule õppekavale."}], "learning_outcomes": [{"en": "1)\tis able to plan teaching process, to teach and to support learners taking into account learners' speciality, prior knowledge, needs (including special and educational needs) and interests;", "et": "1)\toskab kavandada, ette valmistada, läbi viia, analüüsida ja hinnata oma õppe- ja kasvatustöö alaseid tegevusi ajaloo ja ühiskonnaõpetuse õpetamisel;"}, {"en": "2)\tarranges teaching systematically, based on evidence and creatively taking into account national basic documents, speciality of the educational institution, level of education, and/or subject, the needs and interests of students;", "et": "2)\tkavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja/või õppeaine eripärast ning õppijate eelteadmistest, vajadustest ( sh erivajadustest) ja huvidest;"}, {"en": "3)\tintegrates successfully the knowledge, skills and attitudes acquired during the studies in the university.", "et": "3)\tintegreerib tulemuslikult ülikooliõpingutes omandatud teadmisi, oskusi ja hoiakuid;"}, {"en": "4)\tskills of social competence: correct communication between the pupils and colleagues, skills of the self-assertion, conflict prevention and solving in history and civics lesson, skills and willingness of co-operation etc.", "et": "4)\tomandab sotsiaalse pädevuse ja selleks vajalikud oskused: suhtlemisoskus õpilaste ja kolleegidega, korrektne eneseväljendusoskus, koostöövalmidus, konflikti ennetamise ja lahendamise oskus."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}