{"uuid": "ca3f2049-6e4f-e69d-9006-da4107a629d3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-17T19:50:06", "title": {"en": "Estonian History in the Middle Ages", "et": "Eesti keskaeg"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ03", "name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "phone": "+372 737 5650", "address": "Jakobi 2 - 220, 231\nEST", "street": "Jakobi 2 - 220, 231", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ03", "structural_unit_name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 9, "colloquium": 0, "web_learning": 0, "independent_work": 75, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course gives an overview of the main events and relations in medieval Livonia (including the territory of present-day Estonia) since the Christianization of the region (12th-13th AD) until ca 1520. The participants of the course are required to independently read additional scientific literature, actively participate in practical seminars, and hand in a written review of a relevant scientific monograph.", "et": "Õppeaines käsitletakse peamiseid sündmusi ja suhteid keskaegsel Liivimaal (sh tänapäeva Eesti alal) ristisõdade ajajärgust (12.-13. sajand) kuni ca 1520. aastani. Üliõpilaselt eeldatakse lisaks loengutes osalemisele ka täiendava relevantse teadus- ja õppekirjanduse iseseisvat lugemist, aktiivset osalemist aineseminarides ning arvustuse koostamist ühe kohase monograafia kohta."}, "objectives": [{"en": "The aim of the course is to deepen the basic knowledge of historical and cultural development of Estonia and its neighbours (medieval Livonia).", "et": "1. anda terviklik ülevaade ja teadmised keskaegse Liivimaa ajaloost, s.o Eesti ajaloo kui terviku mõistmiseks olulistest ajaloosündmustest, ühiskondlikest arengutest ja nende kaasaegsest kultuurilisest ja poliitilisest taustast;\n2. anda ülevaade keskaegse Liivimaa ajaloo uurimisest selle ühiskondlikus ja poliitiilises kontekstis;\n3. tutvustada ja õpetada keskaegse Liivimaa olulisimaid ajaloosündmuseid ning selgitada nende kaasaegset kultuurilist ja poliitilist tausta ning mõju;\n4. anda teadmised keskaegse Liivimaa sündmus- ja kultuurilugu enim mõjutanud isikutest;\n5. õpetada erialast oskussõnavara ning harjutada ja kinnistada selle aktiivset kasutamist kõnes ja kirjas;\n6. anda teadmised ja oskused iseseisvaks tööks erialase teaduskirjanduse ning keskaegsete tõlgitud ja publitseeritud allikatega;\n7. harjutada ja süvendada erialaste teadmiste ja oskussõnavara kasutamist suulises ja kirjalikus eneseväljenduses."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the students will have developed the skills to:", "et": " Õppeaine edukalt läbinud üliõpilane:"}, {"en": "1. outline chronologically and explain the main political, social and religious events of the history of medieval Livonia;", "et": "1. mõistab ja oskab selgitada keskaja kui ajastu rolli ja eripära Eesti ajaloolises arengus;"}, {"en": "2. understand and critically examine the causes and consequences of medieval political, religious, social and economic events, perceptions and practices in their historical context;", "et": "2. tunneb Eesti keskaja ajaloo uurimise põhijooni ja arenguid ning orienteerub vastavates ajalooteaduslikes diskussioonides;"}, {"en": "3. understand the terminology and concepts relevant to the study of the Middle Ages and employ them in scholarly practice;", "et": "3. teab keskaegse Liivimaa ajaloo olulisimaid ajaloosündmuseid ja ühiskondlikke arenguid ning oskab selgitada nende kaasaegset kultuurilist ja poliitilist tausta ja mõju;"}, {"en": "4. coherently construct persuasive arguments from the primary source material/secondary sources, and express them orally and articulate them in writing;", "et": "4. teab keskaegse Liivimaa sündmus- ja kultuurilugu enim mõjutanud isikuid ja oskab selgitada nende ajaloolist tähtsust;"}, {"en": "*", "et": "5. valdab erialast oskussõnavara ning oskab seda erialases töös korrektselt rakendada;"}, {"en": "*", "et": "6. on omandanud kogemuse iseseisvaks tööks nii tõlgitud ja publitseeritud keskaegsete allikate kui uuema sekundaarkirjandusega;"}, {"en": "*", "et": "7. on omandanud kogemuse kasutada erialaseid teadmiseid ja oskussõnavara seisukohtade põhistamisel ja argumenteeritult esitamisel kõnes ja kirjas."}], "notes": {}}, "grading": {"independent_work": {"et": "Eesti keskaja kui akadeemilises kontekstis ja auditoorses vormis õpetatava ainekursuse oluliseks õpiväljundiks on nii üldiste kui ainespetsiifiliste allikakriitiliste oskuste arendamine ja süvendamine. Õppekorralduslikult on see kavandatud kombinatsioonina kontakttundidest ja iseseisvast tööst allikate ja sekundaarkirjandusega. \n\n1. Üliõpilaselt eeldatakse aktiivset osalemist kõikides aineseminarides. Vastavad kontakttunnid on korraldatud rühmaviisiliste aruteludena. Seminarides analüüsitakse mõningaid loengutes käsitletud teemasid relevantsete allikate kontekstis, rõhuasetusega loengutest ja erialakirjandusest omandatud teadmiste süvendamisel, avardamisel ja kinnistamisel. Seminariarvestuse saamiseks on nõutav materjalide läbi töötamine viisil, mis võimaldab osaleda kohustuslike õppematerjalide pinnalt peetavas seminaridiskussioonis, sealhulgas on nõutav suutlikkus vastata kõikidele iseseisvat kodust ettevalmistust eeldavatele küsimustele. Puudumise/ette valmistamata seminaris osalemise korral tuleb võlgnevus heastada kirjaliku tööga. Võlgnevuste heastamise tähtaeg: 20. mai 2025. \n\n2. Üliõpilasel on kohustuslik kirjutada arvustus ühe Eesti keskaja üld- või üksikküsimusi käsitleva teadusliku teose kohta. Retsensiooni kirjutamisel peab lähtuma vastavast juhendist ja rakendama kontakttundidest ja erialakirjandusest omandatud teadmisi. Teoste valik ja täpsemad nõuded retsensiooni koostamiseks on leitavad õpikeskkonnast moodle.ut.ee. Kirjaliku töö esitamise tähtaeg on 23. aprill 2025. \n"}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Seminarides osalemine\n- Suulisele lõpphindamisele (eksamile) pääsemise eeldus.\n- Hindamine: mitteeristav.\n- Arvestuse saamise eelduseks on aktiivne osavõtt kõikidest aineseminaridest (s.o: relevantsete allikate ning õppe- ja teaduskirjanduse lugemine, iseseisev ettevalmistus aruteludes osalemiseks, osavõtt seminariaruteludest ja grupitöödest) või kõikide puudumiste tähtaegne heastamine nõuetekohaste kirjalike töödega. \n- Võlgnevuste heastamise tähtaeg: 20. mai 2025. \n"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Arvestuslik kodune kirjalik töö \n- Eksamile pääsemise eeldus.\n- Tähtaeg: 23. aprill 2025. \n- Hindamine: mitteeristav.\n- Arvestuse saamiseks peab töö olema esitatud tähtaegselt  ja vastama nii sisult kui vormistuselt õppeaines kirjalikule tööle kehtivatele nõuetele. "}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Lõpphindamisele pääsemise tingimusteks on arvestuslike ülesannete õigeaegne ja nõuetekohane täitmine. \n- Hindamine: eristav (A, B, C, D, E, F, mi).  "}}], "grade_preconditions": {"et": "1. Aktiivne osalemine kõikides aineseminarides.\n2. Nõuetekohase kirjaliku koduse töö tähtaegne esitamine. \n\nHaridusliku erivajadusega üliõpilasel on õigus taotleda üldistest tingimustest ja tähtaegadest erandeid (kohandusi). Vastavas küsimuses tuleb üliõpilasel iseseisevalt pöörduda õppeosakonna nõustaja poole, kes koostab soovitatud kohanduste loetelu ja edastab selle õppejõule. Selleks, et individuaalseid kohandusi oleks võimalik teha alates õppeaine algusest, peab vastav teave jõudma õppejõuni võimalikult varakult, s.o semestri alguses."}, "grade_evaluation": {"et": "Üliõpilasel, kes on täitnud kõik lõpphindamisele pääsemise tingimused, kujuneb hinne suulise eksami sooritamise tulemusel."}, "grade_conditions": {"A": {"et": "Üliõpilane valdab kõiki õppeaines käsitletud teemasid ammendavalt. Ta mõistab ja oskab selgitada keskaja kui ajastu rolli ja eripära Eesti ajaloolises arengus. Üliõpilane tunneb Eesti keskaja käsitlemise põhilisi suundumusi ja koolkondi ning oskab selgitada nende ideoloogilist ja poliitilist konteksti. Ta teab õppeaines käsitletud ajaloosündmuseid ja ajaloolisi isikuid ning oskab neid suhestada nende kaasaja ühiskondlike, religioossete, kultuuriliste ja poliitiliste arengutega. Üliõpilane tunneb keskaegse Liivimaa ajaloolis-poliitilist geograafiat, sealhulgas oskab kaardil näidata härruseid, linnu ja olulisi linnuseid. Vastustest ilmneb oskus luua seoseid Liivimaa keskaja eri alaperioodide, härruste ja teemavaldkondade lõikes. Üliõpilane tunneb ja oskab korrektselt kasutada erialast oskussõnavara. Vastused on antud keeleliselt korrektses vormis."}, "B": {"et": "Üliõpilane valdab kõiki õppeaines käsitletud teemasid. Ta mõistab ja oskab selgitada keskaja kui ajastu rolli ja eripära Eesti ajaloolises arengus. Üliõpilane tunneb Eesti keskaja käsitlemise põhilisi suundumusi ja koolkondi ning oskab selgitada nende ideoloogilist ja poliitilist konteksti. Ta teab õppeaines käsitletud ajaloosündmuseid ja ajaloolisi isikuid ning oskab neid suhestada nende kaasaja ühiskondlike, religioossete, kultuuriliste ja poliitiliste arengutega, kuid vastustes esineb üksikuid väheolulisi ebatäpsuseid. Üliõpilane tunneb keskaegse Liivimaa ajaloolis-poliitilist geograafiat, sealhulgas oskab kaardil näidata härruseid, linnu ja olulisi linnuseid. Vastustest ilmneb oskus luua seoseid Liivimaa keskaja eri alaperioodide, härruste ja teemavaldkondade lõikes. Üliõpilane tunneb ja oskab korrektselt kasutada erialast oskussõnavara. Vastused on antud keeleliselt korrektses vormis."}, "C": {"et": "Üliõpilane valdab kõikide õppeaines käsitletud teemade peamist faktoloogiat (ajaloosündmused, ajaloolised isikud, ühiskondlikud arengud), kuid ei oska alati selgitada nende kaasaegset konteksti või mõju. Ta mõistab ja oskab selgitada keskaja kui ajastu rolli ja eripära Eesti ajaloolises arengus. Üliõpilane tunneb keskaegse Liivimaa ajaloolis-poliitilist geograafiat, sealhulgas oskab kaardil näidata härruseid, mõningaid linnu ja linnuseid. Vastustes esineb puudujääke seoste loomisel ja konteksti avamisel Liivimaa keskaja eri alaperioodide, härruste ja teemavaldkondade lõikes. Esineb üksikuid vigu erialase oskussõnavara kasutamises. Vastused on antud keeleliselt korrektses vormis."}, "D": {"et": "Üliõpilane valdab vaid mõningate õppeaines käsitletud teemade peamist faktoloogiat (ajaloosündmused, ajaloolised isikud, ühiskondlikud arengud). Tal puuduvad piisavad teadmised mitmetest õppeaines käsitletud teemadest: üksikud teemad on omandatud ammendavalt, kuid teadmised mitmetest teemavaldkondadest on ebapiisavad. Üliõpilane tunneb keskaegse Liivimaa ajaloolis-poliitilist geograafiat, sealhulgas oskab kaardil näidata härruseid, mõningaid linnu ja linnuseid. Vastustes esineb puudujääke seoste loomisel ja konteksti avamisel Liivimaa keskaja eri alaperioodide, härruste ja teemavaldkondade lõikes. Esineb üksikuid vigu erialase oskussõnavara kasutamises. Vastused on antud keeleliselt korrektses vormis."}, "E": {"et": "Üliõpilane valdab vaid mõningate õppeaines käsitletud teemade peamist faktoloogiat (ajaloosündmused, ajaloolised isikud, ühiskondlikud arengud). Vastustes esineb puudujääke seoste loomisel ja konteksti avamisel Liivimaa keskaja eri alaperioodide, härruste ja teemavaldkondade lõikes. Üliõpilane tunneb keskaegse Liivimaa ajaloolis-poliitilist geograafiat, sealhulgas oskab kaardil näidata härruseid, mõningaid linnu ja linnuseid. Esineb vigu erialase oskussõnavara kasutamises. Vastused on antud keeleliselt korrektses vormis, kuid võib esineda üksikuid vigu akadeemilise sõnakasutuse osas."}, "F": {"et": "1) Üliõpilane ei ole täitnud kõiki kirjalikule lõpphindamisele pääsemise tingimusi. 2) Üliõpilane on õppeaines toime pannud akadeemilise petturluse. 3) Üliõpilane ei valda õppeaines käsitletud peamist faktoloogiat. Vastustest ilmneb, et ta ei oska seostada omavahel faktilist teavet Liivimaa keskaja eri alaperioodide, härruste ja teemavaldkondade lõikes, teadmiste esitus on fragmenteeritud või deskriptiivne. Üliõpilane tunneb keskaegse Liivimaa ajaloolis-poliitilist geograafiat puudulikult, sealhulgas eksib kaardil härruste või oluliste linnade ja linnuste näitamisel. Üliõpilane ei valda erialast oskussõnavara. "}, "mi": {"et": "Üliõpilane on täitnud kõik suulisele lõpphindamisele pääsemise tingimused, kuid jätnud hindamisele ilmumata."}}, "debt_elimination": {"et": "1) Seminaridest puudumisel on võimalik võlgnevused heastada kirjalike töödega. Vastavad teemad ja nõuded on leitavad õpikeskkonnast Moodle. Seminarivõlgnevuste heastamise tähtaeg on 20. mai 2025. \n2) Individuaalsed erandid õppeaines kehtivatest tähtaegadest ja tingimustest on võimalikud eelneval kokkuleppel ja tõendatud põhjuse olemasolul.\n3) Kõik võlgnevused peavad olema heastatud hiljemalt kolm tööpäeva enne üliõpilase valitud korralise hindamise toimumist. Võlgnevuste heastamine alles kordushindamiseks ei ole võimalik.\n4) Üliõpilasel, kes on nõuetekohaselt täitnud kõik korralisele lõpphindamisele pääsemise tingimused, kuid jätnud eksamile ilmumata, on õigus sooritada kordushindamine üldises korras.\n5) Üliõpilasel, kes sooritas korralise eksami negatiivsele tulemusele, on õigus sooritada kordushindamine üldises korras."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Vahetult pärast eksami sooritamist. Seejuures saab üliõpilane individuaalset tagasisidet nii eksamivastuste kui kirjaliku koduse töö kohta. "}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "39567f34-2dbd-4ecf-b4e6-f0644cb10803", "type": "MOODLE", "code": "FLAJ.03.171", "base_url": "undefined", "linked_to_groups": ["c59a9c7c-6ceb-53e4-7d51-7ea93335dcf1", "d0d81f1d-d8cb-3469-93dd-88468326ae54", "fb17c510-9198-507e-ba5e-f037e74ed467"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Kättesaadavad õppeaine E-keskkonnas (moodle.ut.ee).", "recommended_materials": "Lisakirjandust vt. ainekavast ja õppematerjalide hulgast.", "library_package": "https://www.ester.ee/search*est/r?search=flaj.03.171"}, "participants": {"lecturers": [{"person_uuid": "7f8e6878-342b-ce30-e9ea-5a2c6082adf3", "person_name": "Anti Selart", "structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "cb02e745-44f7-f9e6-17de-833664e720eb", "person_name": "Kerli Kraus", "structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}, "3. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}, "1. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "c59a9c7c-6ceb-53e4-7d51-7ea93335dcf1", "code": "1. rühm", "max_size": 25}, {"uuid": "fb17c510-9198-507e-ba5e-f037e74ed467", "code": "3. rühm", "max_size": 25}, {"uuid": "d0d81f1d-d8cb-3469-93dd-88468326ae54", "code": "2. rühm", "max_size": 25}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 24, "time": "2025-02-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Sissejuhatus. Historiograafia I"}, "description": {}}, {"course_week": 25, "time": "2025-02-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Historiograafia II"}, "description": {}}, {"course_week": 27, "time": "2025-03-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Allikad I "}, "description": {}}, {"course_week": 27, "time": "2025-03-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Historiograafia: Muistne vabadusvõitlus või Liivimaa ristisõda?"}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 27, "time": "2025-03-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Historiograafia: Muistne vabadusvõitlus või Liivimaa ristisõda?"}, "study_group_codes": ["3. rühm"]}, {"course_week": 28, "time": "2025-03-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Allikad II "}, "description": {}}, {"course_week": 28, "time": "2025-03-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Haridus ja keeled keskaegsel Liivimaal"}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 28, "time": "2025-03-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Haridus ja keeled keskaegsel Liivimaal"}, "study_group_codes": ["3. rühm"]}, {"course_week": 29, "time": "2025-03-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Keskaegse Liivimaa kujunemine 12.-13. sajandil"}, "description": {}}, {"course_week": 30, "time": "2025-03-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Keskaegse Liivimaa territoriaalne ja ühiskondlik korraldus "}, "description": {}}, {"course_week": 31, "time": "2025-03-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Võitlus esivõimu pärast 14.-15. sajandil "}, "description": {}}, {"course_week": 32, "time": "2025-04-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Sotsiaalajalugu: \"saks\" ja \"mittesaks\""}, "description": {}}, {"course_week": 32, "time": "2025-04-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Maahärrad ja nende konfliktid esivõimu pärast 14. sajandil "}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 32, "time": "2025-04-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Maahärrad ja nende konfliktid esivõimu pärast 14. sajandil "}, "study_group_codes": ["3. rühm"]}, {"course_week": 33, "time": "2025-04-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Linnad, majandus ja Hansa "}, "description": {}}, {"course_week": 34, "time": "2025-04-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Mõisad ja maamajandus "}, "description": {}}, {"course_week": 34, "time": "2025-04-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Linn ja linnaõigus "}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 34, "time": "2025-04-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Linn ja linnaõigus "}, "study_group_codes": ["3. rühm"]}, {"course_week": 35, "time": "2025-04-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Liivimaa hiliskeskaegses Euroopas"}, "description": {}}, {"course_week": 35, "time": "2025-04-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Talurahva õiguslik olukord ja koormised"}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 35, "time": "2025-04-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Talurahva õiguslik olukord ja koormised "}, "study_group_codes": ["3. rühm"]}, {"course_week": 36, "time": "2025-05-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Võimusuhted 16. sajandil "}, "description": {}}, {"course_week": 37, "time": "2025-05-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Kirikulugu I: kihelkonnad, kloostrid, konvendid "}, "description": {}}, {"course_week": 37, "time": "2025-05-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Argielu ja kultuurivormid"}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 37, "time": "2025-05-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Argielu ja kultuurivormid"}, "study_group_codes": ["3. rühm"]}, {"course_week": 38, "time": "2025-05-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Kirikulugu II: vernakulaarreligioon "}, "description": {}}, {"course_week": 39, "time": "2025-05-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Kokkuvõtlik loeng "}, "description": {}}]}, "registration_info": {"audience": {"et": "Eesti ja üldajaloo, arhiivinduse ja uusima aja suunamoodul"}, "min_students": 5, "max_students": 75}, "parent_uuid": "7781ecdd-0f75-6a0b-1587-22401d557f73", "parent_code": "FLAJ.03.171", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}