{"uuid": "190e21f6-61cb-744b-52b3-83c51d5ef3f0", "code": "FLAJ.03.180", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian History 1550-1710", "et": "Eesti varauusaja ajalugu 1550-1710"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ03", "structural_unit_name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ03", "name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "phone": "+372 737 5650", "address": "Jakobi 2 - 220, 231\nEST", "street": "Jakobi 2 - 220, 231", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course gives a systematic overview of the Estonian history from 1550 until 1710. The course focuses on the connections of the Estonian history with that of neighbouring countries and Europe. It will touch upon such issues as the term of early modern age, historiography, Russian-Livonian war (1558-1561) and the wars between other countries over Old-Livonia until 1629/1635, ruling countries and the policy of different foreign rulers here, thereby special attention is paid to the administrative, enfeoffment and colonization policy, court system, economic development, cultural changes, etc. under Swedish rulers.", "et": "Kursus annab süstemaatilise ülevaate Eesti ajaloost 1550. aastast kuni 1710. Tähelepanu pööratakse Eesti ala sidemetele naabermaade ja ülejäänud Euroopaga. Kursusel avatakse Eesti varauusaja mõiste, tutvustatakse historiograafiat, Vene-Liivimaa sõda (1558-1561) ja sellele järgnenud sõdasid Vana-Liivimaa pärandi pärast kuni 1629./1635. aastani. Järgnevalt võetakse vaatluse alla Eesti ala valitsenud erinevad riigid, eriti põhjalikult valgustatakse Rootsi võimuperioodi maa ajaloos, seda läbi administratsiooni ja halduspoliitika, võimude lääni- ja asunduspoliitika, õiguskorralduse, maal ja linnas toimunud majanduslike arengute jms. Samuti peatutakse Eesti 16.-17. saj. vaimuelul ja kultuurilistel arengutel."}, "objectives": [{"en": "The student acquieres an overview about  the main fields of Estonian history in 1550-1710.", "et": "Üliõpilane omandab süstemaatilise ülevaate Eesti ajaloo põhivaldkondadest ajavahemikus 1550-1710."}], "learning_outcomes": [{"en": "The student acquires systematic and comprehensive knowledge about the Estonian history in 1550-1710 in the context of the histories of neighbouring and other European countries.", "et": "Üliõpilane saab naabermaade ja laiemalt Euroopa kontekstis süstemaatilisi ja mitmekülgseid teadmisi Eesti ajaloost aastatel 1550-1710."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}