{"uuid": "3c196012-d9e3-834c-0c7d-de00af1acae6", "code": "FLAJ.02.166", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Archives Management", "et": "Arhiivikorraldus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ02", "structural_unit_name": {"en": "Department of Archival Studies", "et": "arhiivinduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ02", "name": {"en": "Department of Archival Studies", "et": "arhiivinduse osakond"}, "address": "Jakobi 2 - 222\nEST", "street": "Jakobi 2 - 222", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course focuses on the goals and tasks of archives as well as directions of archivy both on national and international level. The first overview of the basic methods of archival management will be given regarding the main functions of the archives, also discussing a change of archives's nature within information society.\n\nThe course deals with archives management traditionion and recent trends in Estonia, comparing the situation on an international level. Also the role distribution and synergy between all the memory institutions is handled. All the archives acts of Estonia (1935, 1998, 2011) are analysed thoroughly as well as the developments caused by the shift to digital information. In detail the requirements of (personal) data protection are discussed in the course.", "et": "Kursuse käigus avatakse arhiivi eesmärgid ja ülesanded ühiskonnas. Tutvutakse nii rahvusvahelise kui kodumaise arhiivinduse suundadega. Arhiivi funktsioonide käsitlemise kaudu luuakse esmane ettekujutus arhiivihalduse põhimeetoditest, samuti arutletakse arhiivi olemuse muutumise üle infoühiskonnas.\n\nKäsitletakse arhiivinduse korraldust Eestis ja võrdlevalt rahvusvahelisel tasandil, arhiivi ja teiste mäluasutuste rollijaotust ja sünergiat digiajastul. Süvendatult analüüsitakse Eesti kolme arhiiviseadust (1935, 1998, 2011), samuti digitaalsest infovahetusest johtuvaid arenguid ning (isiku)andmete kaitse korraldust arhiivitöös."}, "objectives": [{"en": "The course aims to provide basic knowledge of the archival principles and methods, as well as to support obtaining basic skills on archival management.", "et": "Aine eesmärk on kujundada alusteadmised arhiivihaldusest, anda edasi teadmised arhiivinduse põhiprintsiipidest ja -meetoditest ning toetada praktiliste oskuste omandamist edaspidi."}], "learning_outcomes": [{"en": "Upon completion of the course the student is expected to have basic knowledge on archival management. \nAfter successful passing the student:\n-\twill know the main principles of Estonian archives management past and present\n-\twill know the reasons and features of organisational changes accomplished by legal acts\n-\twill be able to understand how the role of archives has been changing in digital era\n-\twill have a good comprehension about the arrangement the main functions of any archives: acquisition, preservation and access", "et": "Õppeaine läbinud üliõpilane:\n1)\ttunneb arhiivinduse põhimõisteid ja -printsiipe, saab aru valdkondlikest õigusaktidest\n2)\tteab rahvusvahelise arhiivinduse põhiküsimusi kaasajal, samuti kutse-eetika põhimõtteid\n3)\ttunneb arhiivikorraldust Eestis, sh selle arengulugu 20.-21. sajandil\n4)\ttunneb arhivaalide kogumise-hindamise, korrastamise-kirjeldamise ja säilitamise üldisi põhimõtteid\n5)\torienteerub arhiiviainesele juurdepääsu ja juurdepääsu piiramise temaatikas\n6)\tmõistab infoühiskonna, sh digitaalarhiivinduse väljakutseid\n7)\tevib ettekujutust veebipõhistest arhiiviteenustest ja sotsiaalmeedia võimalustest arhiivihalduses"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}