{"uuid": "782c5d3a-3507-761b-d9c7-abe045207e86", "code": "FLAJ.03.140", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History and Civics Didactics", "et": "Ajaloo ja ühiskonnaõpetuse didaktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ03", "structural_unit_name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ03", "name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "phone": "+372 737 5650", "address": "Jakobi 2 - 220, 231\nEST", "street": "Jakobi 2 - 220, 231", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of the didactics of history and civics and its historiography and gives the practical skills for its implementation in lesson according to the National Curriculum and the recommendation of PISA.", "et": "Ülevaade ajaloo ja ühiskonnaõpetuse didaktikast, praktilised oskused selle rakendamiseks tunnis vastavalt riiklikule õppekavale ja PISA uuringutest tulenevatele soovitustele."}, "objectives": [{"en": "The first objective of the course is to give the competence of subject didactics for compiling and giving the lessons of history and civics in lower and upper secondary school; The second objective is to develop with the practical examples and tasks the necessary social and methodological abilities for the teaching of those subjects.", "et": "Õppeainel on kolm üldeesmärki, mille saavutamine on kavandatud koos pedagoogika alusmooduli ja pedagoogilise praktikaga, need on kujundada:\n1)\tpädevus põhikooli ja gümnaasiumi ajaloo- ja ühiskonnaõpetuse tunni eesmärgistamiseks;\n2)\toskused vajalike metoodiliste materjalide ja metoodika valikuks;\n3)\tmetoodilised ja sotsiaalsed oskused nende ainete õpetamiseks ainespetsiifikast lähtudes."}], "learning_outcomes": [{"en": "1) Competence of National Curriculum (knowledge and skills necessary for compiling a curriculum) and the literature of history and civics didactics; ", "et": "1)\tomandab pädevuse tunda ja osata kasutada riiklikku õppekava ja muud vajalikku seadusandlust ning ajaloo ja ühiskonnaõpetuse alast metoodilist kirjandust;"}, {"en": "2) Competence of the methods of the development for historical thinking: skills in classifying, interpretation historical sources; methodological skills of teaching the cultural, political and economic history; the analyze of history and civics textbooks and their using in lesson;", "et": "2)\tomandab pädevuse tunda ja osata kasutada ajaloolise mõtlemise meetodeid: allikate liigitamise, analüüsi, tõlgendamise oskused; majandus-, kultuuri- ja poliitikateemade käsitlemise oskused; õpikute analüüsi ja õpetöös kasutamise oskused; "}, {"en": "3) Competence of oral and written communication (conversation, interview, discussion, plays, essays, presentations);", "et": "3)\tomandab ajaloolise ja ühiskondliku otsustusvõime mõistmise ning kujundamise oskused: otsustusprotsessi analüüs ja vastava argumentatsiooni võrdlus, seoste leidmine majanduse, poliitika ja kultuuri vahel, sündmuste ja arengute analüüs ja reflekteeritult hindamine;"}, {"en": "4) Competence of co-operation: partnership, group work, project;", "et": "4)\tomandab ühiskondliku tegevusvõime kujundamise  oskused: seisukohtade argumenteeritud suuline ja kirjalik esitamine, kultuuriliste ja sotsiaalsete erinevuste arvestamine, erinevate perspektiivide mõistmine, tolerants ja avatus;"}, {"en": "5) Competence of the planning, compiling and realizing of history and civics lesson; ", "et": "5)\tomandab pädevuse tunda ja kasutada õppetöös koostöövorme: töö klassiga, partneriga, rühmatöö, projektitöö;"}, {"en": "6) Competence of the self-assertion and conflict-solving in history and civics lesson.", "et": "6)\tomandab pädevuse ajaloo ja ühiskonnaõpetuse tundi planeerida, tunnikonspekti koostada ja tundi läbi viia, arvestades ka hariduslikke erivajadusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}