{"uuid": "dc157ba2-0c33-46dc-ec03-4e04c4d98071", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-21T10:07:57", "title": {"en": "Artefacts and Time: Preservation of Cultural Heritage", "et": "Artefaktid ja aeg: kultuuripärandi säilitamine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ02", "name": {"en": "Department of Archival Studies", "et": "arhiivinduse osakond"}, "address": "Jakobi 2 - 222\nEST", "street": "Jakobi 2 - 222", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ02", "structural_unit_name": {"en": "Department of Archival Studies", "et": "arhiivinduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 30, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course attach great importance to the objects of cultural heritage - museum objects, art objects, ethnographical objects. During the course the processes of ageing of this objects and the human and natural factors influencing the ageing is tackled. The preservation institutions, legislation, planning, management and evaluation problems are discussed.", "et": "Kursus asetab põhirõhu kultuuripärandi hulka kuuluvatele artefktidele - museaalidele, kunstiteostele, etnograafilistele objektidele, käsitledes nende säilivust ja seda mõjutavaid loodus- ja inimkeskkonna tegureid. Muuhulgas käsitletakse säilitamisega tegelevaid institutsioone, seadusandlust, erinevate infokandjate säilitamise planeerimist, korraldamist ja hindamist teabeorganisatsioonis."}, "objectives": [{"en": "The course gives an overview of the principles of the preservation of cultural heritage objects and the management of preservation in memory institutions.", "et": "Anda ülevaade kultuuripärandi hulka kuuluvate objektide säilitamise põhimõtetest ja säilitamise korraldamisest teabeasutustes."}], "learning_outcomes": [{"en": "Be able to demonstrate a knowledge of the materials and properties of museum objects\nBe able to analyze the influence of the environmental factors to the preservation of museum objects\nBe able to demonstrate a knowledge of storage principles of museum objects\nBe able to retrieve relevant information and analyze the quality of information\nBe able to compile the preservation plan of memory institution\nBe able to demonstrate the respect towards cultural heritage", "et": "Kursuse läbinud üliõpilane:\n-teab, millised on peamised artefaktide valmistamiseks kasutatud materjalid ja milliste omadustega need on;\n-oskab hinnata põhiste väliskeskkonna tegurite mõju artefaktide säilivusele;\n-omab ülevaadet artefaktide hoiustamise põhimõtetest ja peamistest säilitusstrateegiatest;\n-on tuttav peamiste säilitusalase info allikatega (trükised, ajakirjad, tehnilised standardid, õigusaktid, säilitusalased veebilehed);\n-on võimeline koostama teabeasutuse säilituskava;\n-väärtustab kultuuripärandit."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Lõputöö hindamiskriteeriumid\nHinne\tSisu\nE\tÜlevaade säilitatavatest materjalidest ja objektidest: Puudulik või puudub täielikult.\nSäilitamise prioriteedid ja strateegiad: Puuduvad selged prioriteedid ja strateegiad.\nKeskkonnatingimuste haldamise kava: Ei ole esitatud või on äärmiselt puudulik.\nOhuplaneering: Puudub või on väga väheselgitav.\nObjektidega seotud tegevused: Ei ole esitatud või on ebapiisavad ja valed.\nD\tÜlevaade säilitatavatest materjalidest ja objektidest: Väheselgitav ja osaliselt puudulik. Materjalide jaotus puudub. Säilitamise prioriteedid ja strateegiad: Prioriteedid on segased ja strateegiad puudulikud. Pikemaajaline visioon puudub. Keskkonnatingimuste haldamise kava: Põhielemendid puuduvad (nt temperatuur ja niiskus). Lahendused on mittetäielikud või puuduvad. Ohuplaneering: Piiratud riskihinnang ja puudulik ohuplaan. Paljusid olulisi riske ei ole käsitletud. Objektidega seotud tegevused: Meetodite kirjeldus on puudulik ja ebaselge.\nC\tÜlevaade säilitatavatest materjalidest ja objektidest: Esitatud on põhikomponendid, kuid kategooriad on liiga üldised ja väheselgitavad. Konkreetsete materjalide näited puuduvad. Säilitamise prioriteedid ja strateegiad: Prioriteedid on liiga üldised ja strateegiad vähe praktilised. Arutelu pikaajalise visiooni üle puudub. Keskkonnatingimuste haldamise kava: Sisaldab ainult põhitaset, puuduvad täpsed tehnilised näitajad. Seire ja reguleerimise meetodid pole selged. Ohuplaneering: Hõlmab ainult põhiriske, kuid mitmed olulised aspektid (nt kahjuritõrje või digitaalsed ohud) on alahinnatud. Objektidega seotud tegevused: Loetletud on osa meetoditest, kuid juhised on pinnapealsed ja mittetäielikud.\nB\tÜlevaade säilitatavatest materjalidest ja objektidest: Täielik ülevaade, kuid mõned kategooriad võiksid olla täpsemalt kirjeldatud. Materjalide tähtsus ja näited on kirjeldatud, kuid detailidest on puudus. Säilitamise prioriteedid ja strateegiad: Prioriteedid on loogilised ja enamik strateegiaid on elluviidavad. Pikemaajaline visiooni võiks olla põhjalikum. Keskkonnatingimuste haldamise kava: Sisaldab põhikomponente, kuid mõned detailid (nt tehnilised lahendused) on puudulikud. Seiremeetodid võiksid olla täpsemalt sõnastatud. Ohuplaneering: Sisaldab olulisi ohtusid ja meetmeid, kuid kava pole kõiki riske piisavalt põhjalikult käsitlenud. Ohuplaan on olemas, kuid vähem detailselt esitatud. Objektidega seotud tegevused: Enamik meetodeid on kirjeldatud, kuid tehnilised nõuded võiksid olla selgemad.\nA\tÜlevaade säilitatavatest materjalidest ja objektidest: Täielik, selgelt sõnastatud ülevaade kõigist materjalidest, sealhulgas nende ajalooline ja kultuuriline tähtsus. Esitatud on erinevat tüüpi objektide selged kategooriad ja nende säilitustingimused.\n\nSäilitamise prioriteedid ja strateegiad: Prioriteedid on loogilised ja põhjendatud, võttes arvesse nii objekti seisundit kui ka ajaloolist väärtust. Strateegiad on realistlikud ja detailsed, sisaldavad pikaajalist visiooni ja praktilisi lahendusi.\n\nKeskkonnatingimuste haldamise kava: Kava on tehniliselt põhjalik, sisaldades konkreetseid parameetreid (nt temperatuur, niiskus, valgus). On selgelt kirjeldatud, kuidas tingimusi jälgitakse ja reguleeritakse.\n\nOhuplaneering: Sisaldab täielikku riskihinnangut ja konkreetseid meetmeid erinevate ohtude ennetamiseks (nt tulekahju, vesi, kahjurid). On olemas üksikasjalik kriisiplaan koos töötajate rollide ja vastutusega.\n\nObjektidega seotud tegevused: Loetletud on kõik vajalikud meetodid (nt ümbristamine, hoiustamine, digitaliseerimine) koos nende tehniliste nõuetega.\n\n"}}], "grade_preconditions": {"et": "nelja kodutöö esitamine"}, "grade_evaluation": {"et": "Kodutööd peavad olema esitatud, lõputöö hindamine.Kõik tööd peavad olema esitatud positiivse lõpphinde saamiseks.\nTööd loetakse arvestatuks kui need vastavad minimaalsetele kriteeriumidele: vastavad ülesande püstitusele. \n•\tNB! Jätame õiguse otsustada madalama hinde kasuks kui lõputöö hinne on kahevahel juhul kui kodutööd hilinevad. \n"}, "debt_elimination": {"et": "kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "84fb2c80-adf1-4454-8ee5-fd66bebccd2e", "type": "MOODLE", "code": "FLAJ.02.059", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Kurmo Konsa. Artefaktide säilitamine. \nÕppematerjalid ÕISis."}, "participants": {"lecturers": [{"person_uuid": "fdc0ae55-62c6-816e-78df-738e92f31fe0", "person_name": "Kurmo Konsa", "structural_unit": {"code": "HVAJ02", "name": {"en": "Department of Archival Studies", "et": "arhiivinduse osakond"}, "address": "Jakobi 2 - 222\nEST", "street": "Jakobi 2 - 222", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 50}, "parent_uuid": "8b95e75f-aecf-b5a2-da34-f95a50439570", "parent_code": "FLAJ.02.059", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}