{"uuid": "e884442b-e3e5-29ba-ffd8-220c9ce19d16", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-13T17:26:17", "title": {"en": "Estonian Phonetics and Phonology", "et": "Eesti foneetika ja fonoloogia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVEE01", "name": {"en": "Department of Estonian", "et": "eesti keele osakond"}, "phone": "+372 737 5224", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE01", "structural_unit_name": {"en": "Department of Estonian", "et": "eesti keele osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 4, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course the articulation features and the articulation of Estonian speech sounds is taught, as well as their acoustics, speech prosody, and the phonological system of Estonian. Students (except students of Special Eduacation) get also to know and to use the Finno-Ugric phonetic transcription.", "et": "Kursusel õpitakse tundma eesti keele häälikute artikulatoorseid tunnuseid ja häälikute moodustamist, nende akustikat, kõneprosoodiat, eesti keele fonoloogilist süsteemi. Õpitakse tundma ja kasutama soome-ugri foneetilist transkriptsiooni (v.a eripedagoogika üliõpilased)."}, "objectives": [{"en": "The aim of the course is to get an overview of main terms and problems of Estonian phonetics and phonology, and also of main theoretical viewpoints and research methods.", "et": "Kursuse eesmärk on tutvuda eesti keele häälikusüsteemiga, õppida tundma sellega seotud põhimõisteid, probleeme, põhilisi teoreetilisi seisukohti ja uurimismeetodeid."}], "learning_outcomes": [{"en": "Student knows the Estonian sound system and can give examples of different pronunciation features. Student knows what are the main problems and theoretical viewpoints related to the Estonian phonetics and phonology. Student can describe articulation of sounds and recognize sounds according to the description and classify them according to some articulatory feature. Student can syllabify, identify foot boundaries and word's quantity. Student has elementary knowledge about analyzing speech acoustically (except students of block mode study). Student (except students of Special Eduacation) knows the main rules of the Finno-Ugric phonetic transcription and can use it to transcribe Estonian.", "et": "Üliõpilane teab, milline on eesti keele häälikusüsteem ning oskab tuua näiteid erinevate hääldusjoonte kohta. Üliõpilane teab, mis on põhilised eesti foneetika ja fonoloogiaga seotud probleemid ja olulisemad teoreetilised seisukohad. Ta oskab kirjeldada eesti keele häälikute moodustamist ning tunneb häälikuid kirjelduse järgi ära, oskab häälikuid foneetiliste tunnuste alusel rühmitada. Ta oskab kõnet liigendada (silbitada, määrata silbiliike ja jagada kõne taktideks), oskab määrata välteid. Ta omab algteadmisi kõne akustilisest analüüsimisest (v.a sessioonõppe üliõpilane). Üliõpilane (v.a eripedagoogika üliõpilane) tunneb soome-ugri foneetilise transkriptsiooni põhimõtteid ja oskab eesti keelt transkribeerida."}], "notes": {}}, "grading": {"independent_work": {"et": "Kursuse jooksul tehakse harjutusi sellest harjutustikust (Pire Teras 2019. Eesti foneetika ja fonoloogia harjutusi. Tartu.) ja harjutavaid teste Moodle'i keskkonnas."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Hindamismeetodid: kirjalik eksam, mis sisaldab 1) käsitletud teemadega seotud küsimusi (testivormis valik- ja lühivastustega küsimused) ja 2) praktilisi harjutusi: häälikute artikulatoorsed tunnused, foneeme eristavad tunnused, silbitamine, silbiliikide, välte-, kõnetaktipiiride määramine. Teooriaosal ja praktilisel osal on hindamisel võrdne kaal. Positiivse hinde saamiseks peavad mõlemad osad olema tehtud positiivsele hindele.\n\nHindamiskriteeriumid\nA - üliõpilane tuleb kõigi ülesannetega silmapaistvalt hästi toime, saavutatud on silmapaistev tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste kasutamine\nB - üliõpilane tuleb kõigi ülesannetega väga hästi toime, seda iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine; üksikuid puudusi on spetsiifilisemates ja detailsemates teadmistes; praktilises ülesannetes on üksikuid mittepõhimõttelisi eksimusi\nC - üliõpilane tuleb kõigi ülesannetega toime heal tasemel, seda iseloomustab teadmiste ja oskuste eesmägistatud kasutamine. Spetsiifilistemas ja detailsemates teadmistes ja oskustes avaldub ebakindlus ja ebatäpsus, esineb vigu praktilistes ülesannetes\nD - teadmised on piisavad, seda iseloomustab oskus kasutada teadmisi tüüpolukordades; erandlikes olukordades ja praktilistes ülesannetes avalduvad puudujäägid ja ebakindlus\nE - üliõpilane tuleb toime napilt, minimaalsel lubataval tasemel; teadmisi ja oskusi kasutatakse tüüpolukordades piiratud viisil, praktiliste ülesannete lahendamisel avalduvad märgatavad puudujäägid ning ebakindlus - puudusi või vigu alla poolte juhtude\nF - üliõpilane on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel; õppija ei tule praktiliste ülesannetega toime või jätab osa neist tegemata"}}], "grade_preconditions": {"et": "Üliõpilane on osalenud kursusel aktiivselt, täitnud lugemisülesanded, teinud Moodle'is ja harjutustikust kursuse käigus teha jäänud praktilised harjutused, täitnud õpipäevikut."}, "grade_evaluation": {"et": "20 punkti jooksvad tööd (harjutavad testid, lugemistestid, õpipäevik) Moodle'is üle lävendi (7,1 või arvestatud). Eksamitöö (80 punkti) koosneb kahest hindamisel võrdse osakaaluga osast (teooriaosa puudutavatest küsimustest ja praktilistest harjutustest). Positiivse koondhinde saamiseks peavad olema mõlemad osad sooritatud positiivsele hindele."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "4cd817fc-6736-41c2-b22f-e880421e1029", "type": "MOODLE", "code": "FLEE.09.017_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Asu, Eva Liina, Pärtel Lippus, Karl Pajusalu, Pire Teras 2016. Eesti keele hääldus. Tartu: Tartu Ülikooli Kirjastus. (Internetis: http://dspace.ut.ee/bitstream/handle/10062/57960/EKV2_haaldus.pdf?sequence=1&isAllowed=y) \nTeras, Pire. 2019. Eesti foneetika ja fonoloogia harjutusi. Tartu: Tartu Ülikooli eesti keele osakond.\nEek, Arvo 2008. Eesti keele foneetika I. Tallinn: TTÜ Küberneetika Instituut.\nHint, Mati 1998. Häälikutest sõnadeni. Eesti keele häälikusüsteem üldkeeleteaduslikul taustal. Teine ümbertöötatud trükk. Tallinn.\nWiik, Kalevi 1991. Foneetika alused. Tartu.\nSalveste, Nele 2012. Ikka need välted - no mida neist arvata? - Oma Keel 1, 19-35.", "recommended_materials": "Ariste, Paul (mitu eri trükki).  Eesti keele foneetika I-II. Tartu.\nHint, Mati 2004. Eesti keele foneetika ja morfoloogia. Avita.\nKarlsson, Fred 2002. Üldkeeleteadus. Tallinn: Eesti Keele Sihtasutus. (Foneetika- ja fonoloogiapeatükk)"}, "participants": {"lecturers": [{"person_uuid": "a9ba4c8f-7da1-8352-dac7-32fa1bbb561f", "person_name": "Pire Teras", "structural_unit": {"code": "HVEE01", "name": {"en": "Department of Estonian", "et": "eesti keele osakond"}, "phone": "+372 737 5224", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2, 4, 7, 10,12,15"}, "entries": [{"time": "2024-09-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatus foneetikasse ja fonoloogiasse, põhimõisted"}}, {"time": "2024-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Pikemad kõneüksused: silp, silbi ehitus, kõnetakt ehk jalg. Prosoodianähtused: rõhk (sõnarõhk, lauserõhk)"}}, {"time": "2024-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Prosoodianähtused: kvantiteet (kestus, välde, vältehääldus), kõnemeloodia (sõnatoon, intonatsioon)"}}, {"time": "2024-10-19", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Praktilised harjutused: silbiliigid, kõnetaktid, välted"}}, {"time": "2024-10-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Eesti vokaalisüsteem ja vokaalide artikulatoorsed tunnused, fonotaktika (vokaalide kombineerumine: monoftongid ja diftongid)"}}, {"time": "2024-11-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Eesti konsonandisüsteem ja konsonantide artikulatoorsed tunnused"}}, {"time": "2024-11-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Konsonantide fonotaktika (konsonantide kombineerumine: geminaatkonsonandid ja konsonantühendid)"}}, {"time": "2024-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Häälduse varieerumine ja koartikulatsiooninähtused (assimilatsioon, dissimilatsioon, siirdehäälikud)"}}, {"time": "2024-12-13", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Praktilised harjutused: eesti keele vokaalide ja konsonantide artikulatoorsed tunnused, palatalisatsioon, häälduse varieerumise põhjused"}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 55}, "parent_uuid": "f62722de-d3fd-34fc-9f8a-261fcd1a1366", "parent_code": "FLEE.09.017", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}