{"uuid": "232542aa-23c5-296e-bbfb-d7541e869f0f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-19T16:52:12", "title": {"en": "Doctoral Thesis", "et": "Doktoritöö"}, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "5", "et": "5. osa", "en": "part 5"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A regular part 5 HV", "et": "24/25 S PÕ 5. osa HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE", "structural_unit_name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "A PhD dissertation is an independently conducted piece of research which presents an original and reasoned solution to a specific research problem, the results of which have been adequately disseminated internationally in the field. A PhD dissertation must contain:\n1.1.1 an overview of the state of the art in the field of research and the position of the research problem therein ;\n1.1.2 a description of the research task;\n1.1.3 the hypotheses proposed;\n1.1.4 a description of the methodology;\n1.1.5 an account of the process and outcomes of the research;\n1.1.6 a summary;\n1.1.7 a list of references;\n1.1.8 a comprehensive summary in Estonian covering the contents of each part of the dissertation, if the dissertation is written in a language other than Estonian, and a comprehensive summary in a language other than Estonian covering the contents of each part of the dissertation, if the dissertation is written in Estonian.", "et": "Doktoritöö on iseseisev uurimistöö, milles on esitatud konkreetse teadusliku probleemi\nargumenteeritud originaalne lahendus ja mille tulemusi on rahvusvahelises erialakirjanduses\npiisavalt avalikustatud. Väitekiri peab sisaldama:\n1.1.1 ülevaadet uurimisvaldkonna hetkeseisust ja uurimisprobleemi kohast selles;\n1.1.2 uurimisülesande püstitust;\n1.1.3 kaitsmisele esitatavaid väiteid;\n1.1.4 metoodika kirjeldust;\n1.1.5 uurimisülesande lahendamise käiku ja tõestust;\n1.1.6 kokkuvõtet;\n1.1.7 kasutatud kirjanduse loetelu;\n1.1.8 ammendavat eestikeelset kokkuvõtet töö eri osade sisu kohta, kui väitekiri on\nkirjutatud võõrkeeles, ning ammendavat võõrkeelset kokkuvõtet töö kõigi osade sisu kohta,\nkui väitekiri on kirjutatud eesti keeles."}, "objectives": [{"en": "The aim of doctoral thesis is to apply the acquired skills to write an independent research paper that involves new scientific information and presents a substantiated original solution to essential problems in a specific research area.", "et": "Doktoritöö eesmärgiks on rakendades omandatud erialapädevusi luua iseseisev, uut teaduslikku informatsiooni sisaldav uurimus, milles on esitatud eriala oluliste teadusprobleemide argumenteeritud originaalne lahendus."}], "learning_outcomes": [{"en": "Doctoral students have acquired the skills and techniques of conducting independent research; are able to pose research problems important to their field and offer well-argued and original solutions to them; have the command of relevant methods of data collection and analysis; have advanced analytical and critical skills; have the skill of writing research articles suitable for publication in international peer-reviewed journals.", "et": "Doktorant on omandanud iseseisva teadusliku uurimistöö oskused ja meetodid, oskab püstitada oma teaduserialal olulisi uurimisprobleeme ja pakkuda neile argumenteeritud originaalseid lahendusi, valdab erialase andmekogumise ja -analüüsi metoodikat, omab kõrgtasemel teadusliku analüüsi ja kriitika võimet, tal on oskus kirjutada rahvusvahelisel tasemel teaduspublikatsioone."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Uurimistöö kaitmisel otsustab komisjon, kas töö väärib doktorikraadi või mitte."}}], "grade_preconditions": {"et": "Doktoriõpingute lõpetamine eeldab doktoritöö kirjutamist ja selle kaitsmist. Nõudmised doktoritööle on esitatud Tartu ülikooli akadeemiliste kraadide põhimääruses. Doktoritöö on iseseisev uurimistöö, milles on esitatud konkreetse teadusliku probleemi argumenteeritud originaalne lahendus ja mille tulemusi on rahvusvahelises erialakirjanduses piisavalt avalikustatud.\nDoktoriväitekiri on avaldatud ülikooli väitekirjade seerias ning võib olla vormistatud järgmiselt:\n1) kokkuvõtva ülevaateartiklina, mis vastab käesoleva juhendi punktis 1 toodud\nnõuetele, koos väitekirja teemal varem avaldatud teaduspublikatsioonidega, millest vähemalt\nkolm on avaldatud Tartu Ülikooli doktorikraadi andmise korra punktides 16.1 ja 16.2 nimetatud\nväljaannetes. Kui publikatsioonil on mitu autorit, tuleb ära näidata kraaditaotleja konkreetne\npanus selle valmimisse;\n2) monograafiana, mis vastab käesoleva juhendi punktis 1 toodud nõuetele ja mida\non rahvusvahelisel tasemel eelretsenseerinud vähemalt kaks sõltumatut vastava eriala\ntunnustatud teadlast ning millega seotud teemal on varem avaldatud vähemalt üks\nteaduspublikatsioon Tartu Ülikooli doktorikraadi andmise korra punktides 16.1 ja 16.2\nnimetatud väljaannetes;\n3) kokkuvõtva ülevaateartiklina, mis vastab käesoleva juhendi punktis 1 toodud\nnõuetele, koos Tartu Ülikooli doktorikraadi andmise korra punktis 16.3 nimetatud\nmonograafiaga."}, "grade_evaluation": {"et": "Doktoritööd hinnatakse järgmiste kriteeriumide seisukohalt.\n1 Teemavalik, uurimisprobleem, ülesande piirang ja uurimisküsimused: teema\npeab olema informatsiooniväärtuselt oluline.\n2 Varasemate uurimistulemuste arvestamine: uurimus peab olema otstarbekas jätk\nvarasemale diskursusele või uus teemakäsitlus. Varasemaid uurimusi tuleb niisiis arvesse\nvõtta, aga neid ei tule sellistena korrata.\n3 Mõistete selgus, definitsioonid ja teema teoreetiline valdamine: lugeja jaoks peab\nolema selge, millega uurimuses tegeldakse.\n4 Kasutatud meetodid: uurija peab esitlema oma meetodeid ja põhjendama nende\nkasutust.\n5 Materjal: materjal peab olema teema seisukohast kvalitatiivselt relevantne ja\nkvantitatiivselt küllaldane.\n6 Tulemuste esitlus ja järeldused: tulemuste ja järelduste tähtsust teaduse arengu\nseisukohalt ei tule ülehinnata, aga ka mitte alahinnata. Analüüs peab olema loogiline ja\narvestama erinevaid vaatepunkte. Lisaväärtuseks võib pidada huvitavaid tulevaste uuringute\nvõimalusi ja uurimuse ühiskondlikku tähtsust.\n7 Vormiline külg: esitus peab olema loogilise struktuuriga ja keeleliselt selge.\nMõte ei tohi jääda infotulva alla.\n8 Kriitiline suhtumine: uurija peab olema kriitiline varasemate uurimuste,\nteooriate, meetodite, materjali, allikate ja oma töö teadusliku väärtuse suhtes.\n\nVäitekirja hinnatakse kahes etapis, eelretsenseerimine on esimene ja kaitsmine teine\netapp. Instituudi nõukogu määrab väitekirjale (vähemalt) kaks eelretsensenti. Eelretsensent peab\npõhjendatud kirjalikus arvamuses selgelt esitama seisukoha, kas väitekirja võib saata kaitsmisele."}, "debt_elimination": {"et": "Retsensendi eitava arvamuse korral võib instituudi nõukogu pärast seda, kui väitekirja käsikirja on tehtud parandused eelretsensioonis esiletoodud seikade osas või muid muudatusi ja on arvesse võetud väitekirja juhendaja seisukoht töö suhtes, paluda arvamust negatiivse retsensiooni andjalt või uut eelretsensiooni uuelt eelretsensendilt."}, "assessment_scale": {"code": "defence", "et": "Kaitsmine", "en": "defence"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "8ef12fd8-aadc-e818-62c8-12ff58e67b43", "person_name": "Liina Lindström", "structural_unit": {"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Ainepunkte doktoritöö valmimise eest antakse individuaalselt atesteerimisel."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "755c7f56-2284-3320-be69-f522493e2422", "parent_code": "FLEE.00.024", "parent_credits": 180, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}