{"uuid": "0c59523b-14a8-7a18-6219-3d3971fb88cb", "code": "FLFI.05.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "From Nietzsche to Postmodernism and Present Day", "et": "Friedrich Nietzschest postmodernismi ja tänapäeva"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course consists of seminars. We will read fragments from the works of F. Nietzsche, A. Camus, J.-P. Sartre, M. Heidegger, S. Freud, C. Jung, M. Foucault, J. Derrida, J. Peterson and P. Sloterdijk and analyze them in their philosophical and historical contexts. Topics and concepts that will be discussed and investigated include: death of god, the Dionysian, nihilism, existential rebellion, individual responsibility, deconstruction, death of man and author, differential philosophy of language and eventually critique of postmodernism and identity politics.", "et": "Õppeaine on seminari vormis. Kursusel loetakse katkendeid F. Nietzsche, A. Camus, J-P. Sartre'i, Martin Heideggeri, Sigmund Freudi, Carl Jungi, Michel Foucault, Jacques Derrida, Jordan Petersoni ning Peter Sloterdijki teostest ning analüüsitakse neid nende filosoofilis-ajaloolises kontekstis. Eelnimetatud autorite mõtlemisega seoses tulevad vaatluse alla teemad nagu jumala surm, dionüüsilisus, nihilism, eksistentsialistlik mäss, individuaalne vastutus, dekonstruktsioon, inimese ja autori surm, diferentsiaalne keelefilosoofia ning lõpuks postmodernismi ning identiteedipoliitika kriitika. See on siiski ainult väike loetelu vaadeldavatest teemadest."}, "objectives": [{"en": "The impact of F. Nietzsche's philosophy on the 20th and 21st century has been rather extraordinary. In the first half of the 20th Century, this impact revealed itself mainly in existential philosophy (A. Camus, J.-P. Sartre, M. Heidegger etc.) and psychoanalysis (S. Freud, C. Jung etc.), in the second half of the Century above all in poststructuralism and postmodernism (M. Foucault, J. Derrida, G. Deleuze). In the 21st century, he is often being referred to in relation to the concept of post-truth. But also J. Peterson, the present-day critic of poststructuralism and postmodernism, has claimed to have been greatly influences by Nietzsche's philosophy. One of the guiding questions of the course is how it is possible that one thinker can influence so diverse ways of thinking. The aim of the course is to throw light on some of the important schools of thought in the 20th and 21st century that have been influenced by Nietzsche thinking, to explain the historical background of these schools and explain their emergence. This should enable students to have a better understanding of the present.", "et": "Friedrich Nietzsche filosoofia mõju 20. ja 21. sajandile on olnud üsna erakordne. 20. sajandi esimesel poolel avaldus see eelkõige eksistentsifilosoofias (A. Camus, J.-P. Sartre, M. Heidegger etc.) ja psühhoanalüüsis (S. Freud, C. Jung etc.), sajandi teisel poolel aga poststrukturalismis ja postmodernismis (M. Foucault, J. Derrida, G. Deleuze). 21. sajandil viidatakse Nietzschele sageli seoses tõejärgsusega, tema mõjule oma mõtlemises on aga osutanud ka J. Peterson, poststrukturalismi ja postmodernismi suur kriitik. Kursusel uuritakse, kuidas on see võimalik, et üks mõtleja võis mõjutada sedavõrd erinevaid mõtlemiskoolkondi. Kursuse eesmärgiks on valgustada mõningaid olulisi, Nietzsche filosoofiast mõjutatud 20. ja 21. sajandi filosoofiaid, mõtteviise ning nende taustu ja selgitada, miks ja kuidas need mõtteviisid tekkisid. See võimaldab tudengitele meie kaasaja parema mõistmise."}], "learning_outcomes": [{"en": "Student who has passed the course has a good grasp of F. Nietzsche's philosophy and understands its impact on the 20th and 21st century. At the same time, the student understands the main arguments and historical context of existentialism, poststructuralism as well as some of the more recent schools of thought. In the end, the student will acquire a better understanding of the present culture and society.", "et": "Aine läbinud üliõpilane orienteerub F. Nietzsche filosoofias ja mõistab selle mõju 20. ja 21. sajandile. Ühtlasi mõistab ta nii eksistentsifilosoofia, poststrukturalismi kui ka paari kaasaegsema mõtteviisi olulisimaid argumente ja ajaloolist konteksti. Lõppkokkuvõttes omandab tudeng 20. ja 21. sajandi mõtlemise, ühiskonna ja kultuuri parema mõistmise."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}