{"uuid": "683a85e8-59fb-34af-acb5-08359d743bee", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-27T11:49:46", "title": {"en": "Limits of the International Order: State and Sovereignty in History and the Contemporary World", "et": "Rahvusvahelise korra piirid: riik ja suveräänsus ajaloos ja tänapäeval"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV Eng", "et": "25/26 K PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 2, "practice": 0, "seminar": 24, "independent_work": 130, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course focuses on the ideas of sovereignty and the state in a historical context by reading central texts in the history of political thought from early modern to contemporary times. In addition to developing the skills relevant for understanding, interpreting, and reflecting on texts, seminars focus on state power, law, rights, violence, and biopolitics with respect to contemporary examples of the state of emergency, public health, terrorism, and war in totalitarian and democratic states.", "et": "Õppeaine käsitleb suveräänsuse ja riigiga seonduvaid ideid nende ajaloolises kontekstis, toetudes poliitilise mõtte ajaloo kesksetele tekstidele varauusajast tänapäevani. Kursus arendab filosoofiliste tekstide lugemise ja tõlgendamise oskust, keskendudes riigivõimu, õiguse, õiguste, vägivalla ja biopoliitikaga seotud küsimustele ja sidudes need tänapäeva väljakutsete ja probleemidega nagu hädaolukord, rahvatervis, terrorism, sõda jm nii totalitaarsetes kui demokraatlikes riikides."}, "objectives": [{"en": "Õppeaine aitab aru saada praegusest rahvusvahelisest korrast ja selle piiridest (poliitilise legitiimsuse kõdunemine, sõda ja terrorism, küberturvalisus, rahvusvaheliste organisatsioonide halvatus jne) riigivõimu aluse ja piiride uurimise kaudu globaliseerunud maailmas. Keskendutakse suveräänsuse mõistele. Kursus jälgib suveräänsuse filosoofilisi ja ajaloolisi algupärasid, tõlgendusi ja muutumisi ning kasutab neid prismana, mille kaudu mõista tänapäeva rahvusvahelise korra ees seisvaid probleeme.", "et": "This course improves understanding of the current international order and its limits (the erosion of political legitimacy, war and terrorism, cybersecurity, the paralysis of international organizations, etc.) through a study of the ground and limits of state power in a globalized world. This study is centered on the concept of sovereignty. The course traces the philosophical and historical origins, interpretations, and permutations of the concept, and uses these as a lens to understand the problems facing the international order today."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the student: ", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "* understands the historical origins and the philosophical foundations of the concepts 'state' and 'sovereignty,' and grasps the multifaceted meanings of sovereignty in contemporary political philosophy;", "et": "* teab mõistete \"riik\" ja \"suveräänsus\" ajaloolist päritolu ja filosoofilisi aluseid ning hoomab suveräänsuse mitmetahulisi tähendusi tänapäeva poliitilises filosoofias;"}, {"en": "* can link the concept of sovereignty to current debates on issues related to political legitimacy and international order.", "et": "* oskab siduda suveräänsuse kontseptsiooni aktuaalsete aruteludega poliitilise legitiimsuse ja rahvusvahelise korra küsimustes."}, {"en": "More specifically, the student:", "et": "Täpsemalt üliõpilane: "}, {"en": "* Has obtained a systematic understanding of the ideas of sovereignty and the state in the history of political thought;", "et": "* on omandanud süstemaatilise arusaama suveräänsuse ja riigi ideedest poliitilise mõtte ajaloos;"}, {"en": "* Has acquired knowledge of the most important political philosophers and key texts in the debates about state and sovereignty;", "et": "* on omandanud teadmisi olulisematest poliitikafilosoofidest ja võtmetekstidest riigi- ja suveräänsusvaidlustes;"}, {"en": "* Has acquired the capacity to see the broad way in which the fundamental assumptions about the nature of sovereignty are framing contemporary debates on legitimacy and international order;", "et": "* on omandanud võime näha laialdast viisi, kuidas põhimõttelised eeldused suveräänsuse olemuse kohta raamivad kaasaegseid arutelusid legitiimsuse ja rahvusvahelise korra üle;"}, {"en": "* Has acquired the capacity to debate the causes of and potential solutions to political and international crises through the prism of the conceptualizations of sovereignty and state power;", "et": "* on omandanud suutlikkuse arutleda poliitiliste ja rahvusvaheliste kriiside põhjuste ja võimalike lahenduste üle suveräänsuse ja riigivõimu mõistete prisma kaudu;"}, {"en": "* Has acquired the ability to analyze texts belonging to the history of political thought, taking into account their historical context; ", "et": "* on omandanud oskuse analüüsida poliitilise mõtte ajalukku kuuluvaid tekste, arvestades nende ajaloolist konteksti;"}, {"en": "* Has improved the ability of critical thinking and the capacity to express ideas clearly in writing and oral discussions;", "et": "* on parandanud oma kriitilise mõtlemise võimet ja oskust väljendada mõtteid selgelt kirjalikult ja suulistes aruteludes;"}, {"en": "* Has applied critical thinking about sovereignty to real-world challenges in contemporary politics.", "et": "* on rakendanud kriitilist mõtlemist suveräänsusest tänapäeva poliitika tegelikele väljakutsetele."}], "notes": {"et": "Prerequisite courses:\n* For Philosophy in Practice MA students--the Start Module courses. \n* MA and PhD students from topically related curricula (e.g., politics, law, history) should speak to the course lecturer about the possibility of participation.\n* Recommended BA in philosophy, politics, or history."}}, "grading": {"independent_work": {"et": "* Reading and reflecting on the required material for each class.\n* Weekly seminar assignments posted to Moodle.\n* Two written tests in class. \n* Final essay applying arguments of sovereignty and the limits of the international order to historical contexts and its relevance today."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "* In addition to regular attendance and active participation in seminar discussions, before each seminar, students are required to post two questions related to the seminar's text and respond to two questions posed by their peers. The assignment demonstrates the ability to read a text critically and respond to questions about the argument posted to Moodle.\n(Non-differentiated assessment: 20%)."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "* Two in-class written tests with essay questions demonstrating the ability to write about the central ideas of authors discussed in class in a brief amount of time.\n(differentiated assessment: 20% each, total 40%)"}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "* Final essay about debates on sovereignty with citations and quotations from the readings.\n(differentiated assessment: 40%)\nTo get a positive grade for the course, all components of the final grade (attendance/participation + Moodle assignments, tests, and final essay) must be completed and deemed sufficient by the instructors."}}], "grade_preconditions": {"et": "No more than two classes can be missed. If a student misses a seminar, the instructor will give the student a writing assignment on a seminar text. \nTo get a positive grade for the course, all components of the final grade (attendance/participation + Moodle assignments, tests, and final essay) must be completed and deemed sufficient by the instructors."}, "grade_evaluation": {"et": "* Final essay about debates on sovereignty with citations and quotations from the readings (differentiated assessment: 40%)\n* Two in-class written tests with essay questions demonstrating the ability to write about central ideas of authors discussed in class in a brief amount of time (differentiated assessment: 20% each, total 40%) \n* In addition to regular attendance and active participation in seminar discussions, before each seminar, students are required to post two questions related to the seminar's text and respond to two questions posed by their peers. The assignment demonstrates the ability to read a text critically and respond to questions about the argument posted to Moodle (Non-differentiated assessment: 20%).\nNB! To get a positive grade for the course, all components of the final grade (attendance/participation + Moodle assignments, tests, and final essay) must be completed and deemed sufficient by the instructors."}, "debt_elimination": {"et": "In agreement with instructors."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Bodin, The Six Books of the Commonwealth\nHobbes, Leviathan\nLocke, Two Treatises of Government (The Second Treatise) \nRousseau, On the Social Contract \nHannah Arendt, The Origins of Totalitarianism \nMichel Foucault, Foucault Reader\nCarl Schmitt, Political Theology\nCarl Schmitt, The Concept of the Political", "recommended_materials": "Giorgio Agamben, Homo Sacer, (Stanford: Stanford University Press, 1995)\nJudith Butler, Frames of War, (London: Verso, 2010)\nRichard Tuck, The Sleeping Sovereign (Cambridge: Cambridge University Press 2016)\nKalmo, Skinner, eds., Sovereignty in Fragments (Cambridge: Cambridge University Press 2010)"}, "participants": {"lecturers": [{"person_uuid": "e25b7dca-d412-d948-c19b-32ff872c463a", "person_name": "Pärtel Piirimäe", "structural_unit": {"code": "HVFI01MO", "name": {"en": "Chair of Intellectual History", "et": "mõtteloo õppetool"}, "level": 4, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "4b6a00ae-35fd-a00e-d38e-0e2f8035d628", "person_name": "Siobhan Ann Kattago", "structural_unit": {"code": "HVFI01PF", "name": {"en": "Chair of Practical Philosophy", "et": "praktilise filosoofia õppetool"}, "phone": "+372 737 5317", "address": "r 326, 328\nEST", "street": "r 326, 328", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. Introductory meeting"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "2. Seminar: Bodin \nJean Bodin, The Six Books of the Commonwealth [1576], bk I, ch. 8, in: Bodin, On Sovereignty, ed. Julian Franklin (Cambridge: Cambridge University Press), 1-45\nRichard Tuck, The Sleeping Sovereign (Cambridge: Cambridge University Press 2016), Ch. 1.   \n\n3. Seminar: Hobbes\nThomas Hobbes, Leviathan [1651], Introduction, chs 6, 13-16, in Hobbes, Leviathan, ed. R. Tuck (Cambridge: Cambridge University Press)\nRichard Tuck, The Sleeping Sovereign, Ch. 2.  \n\n4. Seminar: Hobbes\nHobbes, Leviathan, chs. 17-21, 26, 29-31, Conclusion\n\n5. Seminar: Locke\nJohn Locke, The Second Treatise of Government, §1-21, 25-51, 95-99, 123-131, 134, 142, 149-156, 211-212, 220-227, 240-243, in Locke, Two Treatises of Government, ed. P. Laslett (Cambridge: Cambridge University Press)     \n\n6. Seminar: Rousseau\nJean Jacques Rousseau, The Social Contract, bk I-IV, in Rousseau, The Social Contract and Other Later Political Writings, ed. V. Gourevitch (Cambridge: Cambridge University Press)\nRichard Tuck, The Sleeping Sovereign, Ch. 3."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "7. Mid-term exam"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "8. Seminar: Schmitt\nCarl Schmitt, Political Theology, (Chicago: University of Chicago Press, 1985), ch 1-3. \n\n9. Seminar: Schmitt\nCarl Schmitt: The Concept of the Political, (Chicago, University of Chicago Press, 1996), 19-79. \n\n10. Seminar: Arendt\nHannah Arendt: On Totalitarianism, (New York: HBJ, 1973), ch 9  \n\n11. Seminar: Arendt\nHannah Arendt: On Totalitarianism, (New York: HBJ, 1973), ch 12 \n\n12. Seminar. Foucault\nMichel Foucault: \"The Body of the Condemned, Docile Bodies and the Panopticon\", Foucault Reader, (New York: Pantheon, 1984), 170-213 ."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "13. Final exam"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "14. Final discussion: Sovereignty as organized hypocrisy?\nLarry Krasner, \"The durability of organized hypocrisy,\" in Kalmo, Skinner, Sovereignty in Fragments (Cambridge 2010), 96-113."}}]}, "registration_info": {"audience": {"et": "MA students (Philosophy in Practice), visiting students, MA and PhD students from other fields of study (politics, law, history, etc.) with permission by instructor."}, "min_students": 6, "max_students": 20}, "parent_uuid": "f83bc2d0-f11f-6836-4b67-c47181dc3bf5", "parent_code": "FLFI.05.043", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}