{"uuid": "9de46e01-9974-afa2-2dd0-780f34e1d8af", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T15:10:17", "title": {"en": "The Philosophy of Existence", "et": "Eksistentsifilosoofia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV Eng", "et": "25/26 K PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 2, "practice": 0, "seminar": 18, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "de", "et": "saksa keel", "en": "German"}, {"code": "fr", "et": "prantsuse keel", "en": "French"}], "description": {"en": "In the course of reading major texts of the philosophy of existence, the following topics will be focused on: (1) The cultural and philosophical context the philosophy of existence grows out of; (2) The fundamental philosophical problems and questions pertaining to the philosophy of existence; (3) The place of the philosophy of existence in the wider context of modern philosophy.", "et": "Eksistentsifilosoofia alustekstide lugemise käigus keskendutakse kursusel järgnevatele teemadele: (1) filosoofilis-kultuuriline kontekst, millest eksistentsifilosoofia välja kasvas; (2) eksistentsifilosoofia fundamentaalsed filosoofilised probleemid ja küsimusepüstitused; (3) eksistentsifilosoofia koht kaasaegse filosoofia laiemas kontekstis."}, "objectives": [{"en": "The aim of the course is to provide students with knowledge of the main texts (above all by S. Kierkegaard, F. Dostoyevsky, F. Nietzsche, M. Heidegger, A. Camus, J.P. Sartre etc.), concepts and ideas of the philosophy of existence (which includes existentialism).", "et": "Kursuse eesmärgiks on tutvustada üliõpilastele eksistentsifilosoofia peamisi tekste (eelkõige vaatleme kursusel S. Kierkegaardi, F. Dostojevski, F. Nietzsche, M. Heideggeri, A. Camus', J.P. Sartre'i tekste) mõisteid ja mõttekäike."}], "learning_outcomes": [{"en": "Student who has passed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- Understands the intellectual background the philosophy of existence grows out of;", "et": "-\ttunneb filosoofilis-kultuurilist konteksti, millest eksistentsifilosoofia välja kasvas,"}, {"en": "- Has knowledge of the main texts and key concepts of the philosophy of existence;", "et": "-\ton tuttav eksistentsifilosoofia alustekstide ja võtmemõistetega,"}, {"en": "- Is able to discuss fundamental problems the philosophy of existence poses; ", "et": "-\tsuudab arutleda peamiste probleemide üle, mille eksistentsifilosoofia tõstatab,"}, {"en": "- Can situate the philosophy of existence in the wider context of modern philosophy.", "et": "-\toskab eksistentsifilosoofiat kaasaegse filosoofia laiemasse konteksti paigutada."}], "notes": {"et": "English is necessary for participation. French and German are recommended."}}, "grading": {"independent_work": {"et": "Reading seminar texts.\nWriting an essay."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Hinnatakse kokkuvõtvalt essee-referaate, nende kohta suuliselt küsimustele vastamist, avaramalt õppeaine põhiprobleemide ja -mõistete tundmist. Hindamiskriteeriumid: teemakäsitluse terviklikkus, põhjalikkus, loovus, loogilisus, ajaloolisus.\n\nDetailsed hindamiskriteeriumid:\nA - essee-referaat sisaldab refereeritavate tekstide kesksete probleemide ning nende argumenteeritud lahenduste rekonstruktsiooni; toob välja eeldused, millele probleemipüstitused toetuvad; põhimõisteid on piisavalt selgitatud ja neid kasutatakse korrektselt, argumente esitatakse analüütiliselt ja neile antakse kriitiline hinnang; tekstianalüüs hõlmab tekste tervikuna, on piisavalt üksikasjalik ning selle põhiväited on viidetega kinnitatud. Suulisel eksamil tõendub kirjaliku töö autorsus ning suurepärane arusaamine referaadi sisust, võimelisus seda täiendavalt suuliselt selgitada ja edasi arendada, vajadusel oma eksitusi loovalt klaarides.\nB - essee-referaat sisaldab refereeritavate tekstide kesksete probleemide ning nende argumenteeritud lahenduste rekonstruktsiooni; toob välja eeldused, millele probleemipüstitused toetuvad; põhimõisteid on piisavalt selgitatud ja neid kasutatakse korrektselt, argumente esitatakse analüütiliselt ja neile antakse kriitiline hinnang; tekstianalüüs hõlmab tekste tervikuna, on piisavalt üksikasjalik ja selle põhiväited on viidetega kinnitatud. Kuid esineb üksikuid puudujääke mõne eespool osutatud kriteeriumi osas. Suulisel eksamil tõendub kirjaliku töö autorsus ning väga hea arusaamine referaadi sisust, võimelisus seda täiendavalt suuliselt selgitada, vajadusel oma eksitusi klaarides.\nC - essee-referaat sisaldab küll refereeritavate tekstide kesksete probleemide ning nende argumenteeritud lahenduste rekonstruktsiooni, kuid eeldusi, millele probleemipüstitused toetuvad on käsitletud pealiskaudselt; põhimõisteid on küll selgitatud ja neid kasutatakse korrektselt, kuid argumentide esituses jääb puudu analüütilisusest ja neid pole kriitiliselt hinnatud; tekstianalüüs hõlmab tekste üldjoontes, kuid sel jääb puudu üksikasjalikkusest ning mõned selle põhiväited on viidetega kinnitamata. Suulisel eksamil tõendub kirjaliku töö autorsus ning arusaamine referaadi sisust. Esineb puudusi selle täiendaval suulisel selgitamisel.\nD - essee-referaat rekonstrueerib refereeritavate tekstide keskseid probleeme ning nende argumenteeritud lahendusi vaid üldjoontes, kuid eeldusi, millele probleemipüstitused toetuvad pole käsitletud; põhimõisteid on selgitatud vaid üldjoontes ja nende kasutamises esineb ebakorrektsusi, puudub argumentide analüüs ja nende kriitiline hindamine; tekstianalüüs on lünklik ja viidetega ebapiisavalt kinnitatud, ehkki üldjoontes paikapidav. Suulisel eksamil tõendub kirjaliku töö autorsus ning mõnesugune arusaamine referaadi sisust. Suudab anda täiendavaid selgitusi vaid ositi.\nE - essee-referaat rekonstrueerib refereeritavate tekstide keskseid probleeme ning nende argumenteeritud lahendusi vaid pealiskaudselt; eeldusi, millele probleemipüstitused toetuvad pole käsitletud; põhimõisteid on ebapiisavalt selgitatud ja nende kasutamises esineb vasturääkivusi, argumentide struktuur jääb ebaselgeks ja puudub nende kriitiline hindamine; tekstianalüüs on pealiskaudne ja viidetega halvasti kinnitatud. Suulisel eksamil tõendub kirjaliku töö autorsus. Referaadi sisu suulisel selgitamisel ilmneb suuri raskusi.\nF - essee-referaat on teemast mööda kirjutatud või on refereeritavate tekstide probleemipüstitused jäänud avamata, väited argumenteerimata, esitus ebasidusaks, lünklikuks ja vasturääkivaks, tekstikäsitlus pealiskaudseks ja lünklikuks. Suuliselt ei suuda referaadi sisu asjakohaselt selgitada."}}], "grade_preconditions": {"et": "75% attendance in the seminars and submission of an essay (ca 10 pages). \nOral examination."}, "grade_evaluation": {"et": "Examination mark results from the essay and oral discussion about the latter."}, "debt_elimination": {"et": "According to the rules formulated in the Study Regulations."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "S. Kierkegaard, Fear and Trembling\nF. Nietzsche, Beyond Good and Evil\nF. Dostoyevsky, Notes from the Underground\nM. Heidegger, Being and Time \nJ.P. Sartre, Existentialism is Humanism\nA. Camus, The Myth of Sisyphus", "recommended_materials": "TBA"}, "participants": {"lecturers": [{"person_uuid": "cc6d5152-2c86-8046-c5ee-d4ebc53fbf01", "person_name": "Jaanus Sooväli", "structural_unit": {"code": "HVFI01MO", "name": {"en": "Chair of Intellectual History", "et": "mõtteloo õppetool"}, "level": 4, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "27-38"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introductory lecture (held in the seminar room)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Weekly seminars, held in the seminar room."}}]}, "registration_info": {"audience": {"et": "Everybody interested in the topic, especially BA and MA students in philosophy, international students."}, "min_students": 5}, "parent_uuid": "afd03be0-c334-cca3-491b-69ff28c4dfe8", "parent_code": "FLFI.01.105", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}