{"uuid": "cc5bde90-1871-e23b-3c21-bf5665a03529", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-03T09:33:37", "title": {"en": "Ethics and the Other: Children, the Elderly, Animals, Environment", "et": "Eetika ja \"teine\": lapsed, eakad, loomad, keskkond"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV Eng", "et": "25/26 K PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 22, "independent_work": 114, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Philosophical ethics has mostly focused on what is right and wrong in relationships between human adults and has taken this as the starting point for thinking about relationships with other kinds of moral agents and patients. This course takes a different focus since it addresses ethical questions involved in our relationship with moral agents and patients whose life stage (young, elderly), remoteness (very distant future generations), or different biological nature (non-human animals, the environment) raises special issues at the level of both individual and societal action.", "et": "Filosoofiline eetika on enamasti keskendunud sellele, mis on õige ja vale täiskasvanud inimeste vahelistes suhetes ning võtnud sellised suhted lähtepunktiks, mõtlemaks inimese suhetest muude moraalsete agentide ja subjektidega. See kursus võtab erineva fookuse, kuna see käsitleb eetilisi küsimusi, mis on seotud meie suhetega moraalsete agentide ja subjektidega, kelle eluetapp (noored, eakad), kaugus (väga kauged tulevased põlvkonnad) või meist erinev bioloogiline olemus (mitteinimloomad, keskkond) toob välja  erilisi probleeme nii individuaalse kui ka ühiskondliku tegevuse tasandil."}, "objectives": [{"en": "This course teaches students the conceptual and normative tools of contemporary ethics and how they can be used to address both perennial and contemporary normative questions that we need to answer to address challenges concerning the treatment of children, the elderly, non-human animals, and the environment. The course builds on the training students received in the Start Module in intelligent and critical reading of philosophical texts and further fosters students' capacity for reasoned engagement with such ethical issues in written and oral communication. The course lays the foundation for students to conduct further research on these topics, whether in philosophy or nearby disciplines, as well as to identify the non-academic institutions (in the public or private sectors) that address the challenges that are the topic of this course and, if possible, find opportunities for collaboration and professional involvement within said institutions whether during the studies (as part of their practice placement) or after graduation.", "et": "Aine käsitleb kaasaegse eetika kontseptuaalseid ja normatiivseid vahendeid ning seda, kuidas neid saab kasutada nii igikestvate kui ka kaasaegsete normatiivsete küsimuste lahendamiseks, millele meil tuleb vastata, et tulla toime väljakutsetega, mis on seotud laste, eakate, mitteinimestest loomade ja keskkonna kohtlemisega. Toetutakse teadmistele, mis üliõpilased said stardimooduli raames filosoofiliste tekstide intelligentseks ja kriitiliseks lugemiseks, ning edendatakse osalejate võimet tegeleda selliste eetiliste küsimustega nii kirjalikus kui ka suulises suhtluses. Kursus loob aluse, et arendada edasi uurimistööd nendel teemadel, olgu siis filosoofias või lähedastes distsipliinides, samuti tuvastada akadeemiaväliseid institutsioone (avalikus või erasektoris), mis käsitlevad kursuse teemaks olevaid väljakutseid ja leida võimaluse korral võimalusi koostööks ja professionaalseks kaasamiseks nendes asutustes kas õpingute ajal (praktikal viibides) või pärast lõpetamist."}], "learning_outcomes": [{"en": "By the end of the course, students:", "et": "Kursuse läbinud üliõpilased on:"}, {"en": "* have mastered the tools offered by contemporary ethics to address urgent ethical questions of today's world,", "et": "* omandanud kaasaegse eetika pakutavad vahendid, et lahendada tänase maailma pakilisi eetilisi küsimusi,"}, {"en": "* have practiced reading and written and oral communication skills to conduct reasoned debate,", "et": "* harjutanud lugemise ning kirjaliku ja suulise suhtluse oskusi, et pidada põhjendatud väitlust,"}, {"en": "* can transfer these skills over to both research and non-academic contexts.", "et": "* võimelised neid oskusi kasutama nii uurimistöös kui väljaspool ülikooli."}], "notes": {"et": "In order to participate, Philosophy in Practice MA students must have completed the Start Module courses. \n\nStudents from other MA and PhD curricula are welcome if they have completed 12 ECTS of philosophy courses, or if they come from non-philosophy curricula directly relevant to the course."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "The learning outcomes (LO) of the course are: \n1. Mastering the tools offered by contemporary ethics to address urgent ethical questions of today's world.\n2. Practicing reading and written and oral communication skills to conduct reasoned debate.\n3. Being able to transfer these skills over to both research and non-academic contexts.\nEach assessment method is designed to check achievement of one or more of the learning outcomes. \n\nWeekly text comprehension tasks (either as homework or in-class as a post-seminar comprehension check) (30% of final grade) \n-- LO1 (comprehension is a prerequisite to this outcome) and LO2 (as regards reading and, in part, writing skills)"}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Engagement in seminars as part of small group discussion and then relating to the whole group (20% of final grade)\n-- primarily LO2 (as regards oral communication skills)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Production of a text for non-academic audience (20% of final grade)\n-- LO3 (skills transfer to non-academic contexts)"}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Academic essay (30% of final grade)\n-- all three LOs."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "* Weekly text comprehension tasks (either as homework or in-class as a post-seminar comprehension check) (30% of final grade).\n* Engagement in seminars as part of small group discussions and then relating to the whole group (20% of final grade).\n* Production of a text for non-academic audience (20% of final grade).\n* Academic essay (30% of final grade)."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Lecture materials prepared by the teacher, academic articles, book excerpts, and journalistic (non-academic) materials.", "recommended_materials": "Gheaus, Anca; Calder, Gideon & de Wispelaere, Jurgen (eds.) (2018). The Routledge Handbook of the Philosophy of Childhood and Children. Routledge.\nBidadanure, J. (2021). Justice Across Ages: Treating Young and Old as Equals. Oxford University Press. \nPalmer, Clare (2010). Animal Ethics in Context. Columbia University Press. \nKorsgaard, Christine Marion (2018). Fellow Creatures: Our Obligations to the Other Animals. Oxford University Press. \nNagaoka, Shigeo (1996). Which Beings Deserve Ethical Consideration? From the Sentience Criterion to the Life Criterion. Utilitas 8 (2):191-204."}, "participants": {"lecturers": [{"person_uuid": "cc6d5152-2c86-8046-c5ee-d4ebc53fbf01", "person_name": "Jaanus Sooväli", "structural_unit": {"code": "HVFI01MO", "name": {"en": "Chair of Intellectual History", "et": "mõtteloo õppetool"}, "level": 4, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "1cb0f1ea-baed-c018-9ef1-64a85c0a7a04", "person_name": "Francesco Orsi", "structural_unit": {"code": "HVFI01PF", "name": {"en": "Chair of Practical Philosophy", "et": "praktilise filosoofia õppetool"}, "phone": "+372 737 5317", "address": "r 326, 328\nEST", "street": "r 326, 328", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Every topic includes one lecture and one seminar on the lecture's topic within the same week, except for the Course Recap, which happens only once. So, in total, the course will last 11 weeks.\n\nTopics:\n1. Moral philosophy, moral agents, moral patients (Orsi) \n2. The Other and the wholly Other (Sooväli) \n3. Childhood: values and obligations. Are children morally special? (Orsi) \n4. The ethics of parenting (Orsi)\n5. Getting old: new values? (Orsi) \n6. Aging populations and collective responsibilities (Orsi) \n7. The animal other: pets, farm animals, city dwellers, the wild (Orsi)\n8. The animal other: moral theories to the test (utilitarianism, Kantianism (e.g. Korsgaard), contractualism, virtue) (Orsi)\n9. Beyond sentience: is there any value out there? (Orsi) \n10. Beyond sentience: whose environment? (Orsi) \n11. Course recap"}}]}, "registration_info": {"audience": {"et": "MA Philosophy in Practice students, all MA and PhD students. BA level visiting students can register only upon personal agreement with the lecturer."}}, "parent_uuid": "123d7316-3e9d-1505-1289-f90963ad94ad", "parent_code": "FLFI.02.190", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}