{"uuid": "946dd077-10ea-6ea7-3466-b063d65f74cd", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-27T10:19:25", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 20, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 20, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 S regular part 2 20 CP HV Eng", "et": "24/25 K PÕ 2. osa 20 EAP HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 480, "individual_work": 30, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Planning and writing the MA thesis and defending it on a public defense.", "et": "Magistritöö kirjutamine ning avalik kaitsmine filosoofia erialal."}, "objectives": [{"en": "The objective of writing the thesis is to conduct independent research towards the solution of a significant problem in philosophy using appropriate methods and sources.", "et": "Anda lahendus filosoofia valdkonnas olulisele uurimisülesandele, kasutades selleks asjakohaseid allikaid ja meetodeid."}], "learning_outcomes": [{"en": "Via writing the MA thesis the student ", "et": "Magistritöö kirjutamise ning kaitsmise kaudu üliõpilane:"}, {"en": "1) learns how to formulate a research problem (independently or with the help of a supervisor) and to find the adequate methods for solving it;", "et": "- omandab oskuse iseseisvalt või koostöös juhendajaga formuleerida uurimisülesanne ning leida selle lahendamiseks sobivad meetodid;"}, {"en": "2) obtains knowledge about how to find and select relevant literature;", "et": "- omandab oskuse valida asjakohased allikad;"}, {"en": "3) suggests a justified solution to the problem;", "et": "- pakub ülesandele põhjendatud lahenduse;"}, {"en": "4) writes a thesis conforming to the requirements;", "et": "- kirjutab nõuetekohase magistritöö;"}, {"en": "5) obtains the skills of presenting the results and defending his or her views in academic debate.", "et": "- omandab oskuse töö tulemusi kaitsmisel esitada ja kaitsta akadeemilises väitluses."}], "notes": {}}, "grading": {"independent_work": {"et": "Guidelines for MA thesis are published on institute's web-site at \nhttp://www.flfi.ut.ee/en/department-philosophy/documents-and-forms"}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "MA theses will be defended publicly in front of an MA thesis committee and the event is also open to all those interested. \nThe grading criteria for the MA thesis are published on institute's website at http://www.flfi.ut.ee/en/department-philosophy/documents-and-forms\n\nA: The thesis obviously meets all the requirements to a high standard: both for Doing Philosophy and Communication. The work either constitutes a competitive writing sample for a PhD application or obviously constitutes a straightforward basis on which such a writing sample may be based.\nB: The thesis meets each and every one of the requirements (for both Doing Philosophy and for Communication), throughout the thesis. But not to a high standard: I.e. this would be an adequate writing sample (or basis for a writing sample) submitted in application to a PhD programme but it's not clear it would distinguish the student from competitors for the programme they were applying to.\nC: Shows that the student meets most of the requirements at Doing Philosophy and Communication in most parts of their thesis. But there are deficiencies in one or the other or both areas in parts of the thesis. For instance, there is argumentation in defence of a thesis, but there are clear fallacies in the reasoning, which make the argumentation obviously uncompelling. Or there is sign-posting, but some parts of the thesis are still unclear in their point and/or content. (NB: these \"for instance\"s are just examples of what might characterize a work deserving of a C.) Crucially--to get a C instead of a D or E--there are other, significant parts of the thesis where such deficiencies are more or less entirely absent and in these places the student's competence in Doing Philosophy and Communication are clearly demonstrated. This is not an excellent work. But it definitely does demonstrate competence in most of the requirements at Doing Philosophy and Communication in most parts of the thesis.\nD: Deficiencies in Doing Philosophy and Communication are not restricted to proper sub-parts of the thesis: these deficiencies run more or less throughout the thesis.  But despite this, it's still clear that the student has some grasp of the literature they are addressing. However: either (a) the thesis is entirely, or almost entirely, descriptive (it doesn't Do Philosophy) or (b) their thesis isn't descriptive, but the attempt to Do Philosophy is highly rudimentary--perhaps there's a general impression of what the student was trying to do. But it's not properly worked out in any detail that would permit the position put forward to be properly evaluated.\nE: The bare minimum for passing at MA level. In the written thesis, the student Does Philosophy badly and they Communicate badly by the criteria presented above: where this includes having failed to demonstrate, in the written text, any grasp of the literature they are addressing. What saves the student from failing is that significant and convincing evidence is found, in the defence, of an ability to Do Philosophy and to Communicate. But in the thesis itself, this evidence is not clearly discernible.\nF: Various conditions might warrant a fail:\n* The student's thesis is comprehensible but the student just does not understand what they're doing. Even when under questioning in the defence, the student shows a level of understanding below the level expected at MA level.\n* The written thesis is incomprehensible and the defence didn't allow the examiners to see evidence of skills in either Doing Philosophy or Communication.\n* Plagiarism."}}], "grade_preconditions": {"et": "During fall semester an MA thesis prospectus needs to be submitted and accepted.\nThe MA thesis itself has to be submitted in May, by the deadline in fixed annually."}, "grade_evaluation": {"et": "An MA thesis will be defended publicly in front of an MA thesis committee and the event is also open to all those interested. The thesis will be given a differentiated grading (maximum 100 points) according to the University of Tartu guidelines:\nA (higher or equal to) 91 points, B (higher or equal to) 81 points, C (higher or equal to) 71 points, D (higher or equal to) 61 points, E(higher or equal to) 51 points, F (higher or equal to) 50 points.\nSee more at http://www.flfi.ut.ee/en/department-philosophy/documents-and-forms"}, "debt_elimination": {"et": "By individual arrangement with supervisor(s) and the committee."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Individually assigned by supervisors.\nGeneral guidelines concerning MA theses in Philosophy are available at the Institute's website: https://filsem.ut.ee/en/content/guidelines-and-documents-department-philosophy", "recommended_materials": "Individually assigned by supervisors."}, "participants": {"lecturers": [{"person_uuid": "1cb0f1ea-baed-c018-9ef1-64a85c0a7a04", "person_name": "Francesco Orsi", "structural_unit": {"code": "HVFI01PF", "name": {"en": "Chair of Practical Philosophy", "et": "praktilise filosoofia õppetool"}, "phone": "+372 737 5317", "address": "r 326, 328\nEST", "street": "r 326, 328", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-37"}, "entries": [{"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Final version of the MA thesis (approved by the supervisor) has to be submitted and accepted by the deadline in early May. \nThe defenses take place from May 27 to June 10."}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Final version of the MA thesis (approved by the supervisor) has to be submitted and accepted by August 5. \nThe defenses take place during the last week of August."}}]}, "registration_info": {"audience": {"et": "Philosophy MA 2"}, "min_students": 1}, "parent_uuid": "e6c10100-e5e1-c0db-c970-afa4f1b339f3", "parent_code": "FLFI.00.071", "parent_credits": 30, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}