{"uuid": "7fd7994a-4833-d6cd-6c8e-602a4320239a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-02T12:43:16", "title": {"en": "Graduation Thesis", "et": "Bakalaureusetöö"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 136, "individual_work": 10, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Independent research and thesis writing under the supervision of a supervisor. As result, a BA thesis will be completed and publicly defended.", "et": "Juhendaja juhendamisel toimuv iseseisev uurimistöö, mille tulemusel valmib bakalaureusetöö, mida kaitstakse avalikul kaitsmisel."}, "objectives": [{"en": "The aim is to enhance knowledge and skills necessary for independent research. The course consists of writing and defending a BA graduation thesis.", "et": "Eesmärgiks on arendada iseseisva uurimistöö oskusi. Kursus seisneb bakalaureusetöö koostamises ja avalikus kaitsmises."}], "learning_outcomes": [{"en": "Having successfully written and defended her bachelor's thesis, the student:", "et": "Nõuetekohase filosoofia bakalaureusetöö koostanud ja edukalt kaitsnud üliõpilane:"}, {"en": "* has necessary theoretical and methodological knowledge for solving a philosophical problem,", "et": "* on omandanud filosoofilise probleemi lahendamiseks vajalikud teoreetilised ja metodoloogilised teadmised,"}, {"en": "* is able to conduct (and to formulate the results of) an independent research project at the BA level,", "et": "* oskab BA tasemel uurimistööd läbi viia ning korrektselt vormistada,"}, {"en": "* is able to present and defend her thesis at public defense,", "et": "* on suuteline oma uurimistöö tulemusi avalikul kaitsmisel edasi andma ning kaitsma,"}, {"en": "* is competent to continue her studies at master's level.", "et": "* on valmis jätkama õpinguid magistritasemel."}], "notes": {}}, "grading": {"independent_work": {"et": "Määratakse individuaalselt vastavalt uurimisteemale.\nWill be assigned individually according to the research topic."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Töö üldised nõuded\nBakalaureusetöö puhul hinnatakse selle sisu, vormi ja kaitsmist.\nSisu\nTöö teema tuleks valida selline, et see võimaldaks väljendada üliõpilase oskust püstitada uurimisküsimust, kasutada allikaid ning suhestuda varasemate akadeemiliste kirjutistega. Töö teema peab olema piiritletud piisavalt kitsalt, et seda oleks võimalik läbi uurida bakalaureusetöö raames. Allikaid tuleb valida ja kasutada teemakohaselt.\nTöö keskne küsimus ning põhitees peavad olema piiritletud ja olulisemate terminite tähendus selgitatud. Argumentatsioon töö põhiteesi kaitseks peab olema selge ja kooskõlaline. Autori arutluskäik peab olema hästi jälgitav, kohaselt liigendatud ning teeviidastatud.\nVorm\nTöö peab vastama filosoofia osakonnas kehtivatele vormistus- ja struktuurinõuetele (https://filsem.ut.ee/et/sisu/dokumendid-ja-korrad). Töö peab olema kirjutatud akadeemilises stiilis ning grammatiliselt korrektselt.\nKaitsmine\nTöö kaitsmise eesmärgiks on tõendada, et üliõpilane on suuteline oma uurimistöös esitatud väiteid avalikult esitama ning kaitsma. Õnnestunud kaitsmine tähendab, et tudeng valdab uurimisteemat: ta esitab oma töö põhiseisukohad selgelt, arusaadavalt ja struktureeritult; annab põhjalikud ja sisulised vastused küsimustele. Kaitsja peab kinni pidama ajalimiidist ning akadeemilise esinemise heast tavast. Kaitsmise protseduurist saab lugeda eraldi juhendist (https://filsem.ut.ee/et/sisu/dokumendid-ja-korrad)."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Järgnevalt on kirjeldatud igale hindele vastavaid bakalaureusetöid:\nA  \nTeema valik ja piiritlemine on suurepärane: teema on piiritletud nii, et seda on võimalik süvitsi ja üksikasjalikult uurida bakalaureusetöö mahu raames; töö põhiküsimus ja põhitees on sõnastatud ja motiveeritud selgelt ja ühemõtteliselt. Argumentatsioon töö põhiteesi kaitseks on suurepärane: selge ja jälgitav, hästi liigendatud ning teeviidastatud, kooskõlaline ja veenev, soovitavalt loominguline. Kasutatud kirjanduse valik ja maht on asjakohane. Töö on kirjutatud heas akadeemilises stiilis, on keeleliselt korrektne ning sisaldab kõiki tarvilikke viiteid. Kaitsmine näitab, et üliõpilane valdab uurimisteemat suurepäraselt.\nB \nTeema valik ja piiritlemine on väga hea: teema on piiritletud piisavalt kitsalt, et seda on võimalik uurida bakalaureusetöö mahu raames, kuigi mõne aspekti käsitlemine võiks olla üksikasjalikum. Töö põhiküsimus ja põhitees on sõnastatud ja motiveeritud piisavalt selgelt. Argumentatsioon töö põhiteesi kaitseks on väga hea: selge ja jälgitav, piisavalt liigendatud ning teeviidastatud, kooskõlaline ja põhiteesi toetav. Kasutatud kirjanduse valik ja maht on asjakohane. Töö on kirjutatud akadeemilises stiilis, on keeleliselt korrektne ning sisaldab kõiki tarvilikke viiteid. Kaitsmine näitab, et üliõpilane valdab uurimisteemat väga hästi.\nC  \nTeema valik ja piiritlemine on hea: teema on piiritletud piisavalt kitsalt, et seda on võimalik uurida bakalaureusetöö mahu raames, kuigi mõned olulised aspektid ei leia piisavalt käsitlust. Töö põhiküsimuse ja põhiteesi sõnastuses ja motiveerimises võib esineda ebaselgust, mis ei raskenda oluliselt töö mõistmist. Argumentatsioon töö põhiteesi kaitseks on hea: enamjaolt selge, jälgitav, piisavalt liigendatud ja teeviidastatud, kooskõlaline ning põhiteesi toetav, ent kõigis mainitud aspektides võib esineda vajakajäämisi. Kasutatud kirjanduse valikus ja mahus võib esineda üksikuid vajakajäämisi. Töö on kirjutatud piisavalt heas akadeemilises stiilis, on enamjaolt keeleliselt korrektne ning sisaldab tarvilikke viiteid. Kaitsmine näitab, et üliõpilane valdab uurimisteemat hästi."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "D \nTeema valik ja piiritlemine on rahuldav: teema on piiritletud, ent on bakalaureusetöö mahtu arvestades liiga lai või liiga kitsas. Töö põhiküsimuse ja põhiteesi sõnastuses või motiveerimises esineb ebatäpsusi, mis raskendavad töö mõistmist. Argumentatsioon töö põhiteesi kaitseks on rahuldav: selgete ja jälgitavate kohtade kõrval leidub ebaselgeid, ebakooskõlalisi või raskesti jälgitavaid kohti. Pole alati ilmne, kuidas arutluskäik toetab põhiteesi; vajakajäämisi esineb ka liigenduses ja teeviidastuses. Kasutatud kirjanduse valikus ja mahus võib esineda vajakajäämisi. Esineb vajakajäämisi stiilis ning keelelisi vigu. Kohati on probleeme viidetega. Kaitsmine näitab, et üliõpilane valdab uurimisteemat rahuldavalt.\nE\nTeema valik ja piiritlemine on kasin: teema on piiritletud kas liiga laialt või kitsalt (bakalaureusetöö mahtu arvestades). Töö põhiküsimuse ja põhiteesi sõnastuses või motivatsioonis esineb ebatäpsusi, mis teevad töö jälgimise ja mõistmise väga raskeks. Argumentatsioon töö põhiteesi kaitseks on kasin: tihti ebaselge, raskesti jälgitav, esineb ebakooskõlasid ning tõsiseid vajakajäämisi liigenduses ja teeviidastuses. Kirjanduse kasutus ei ole tihti asjakohane või piisav. Esineb palju vajakajäämisi stiilis ning keelelisi vigu. Tihti on probleeme viidetega. Kaitsmine näitab, et üliõpilane valdab uurimisteemat kasinalt. \nF \nTeema valik ja piiritlemine on puudulik: teema piiritlemine ei vasta bakalaureusetöö mahule; töö põhiküsimuse ja põhiteesi sõnastus ei võimalda nende mõistmist. Argumentatsioon töö põhiteesi kaitseks on puudulik: ebaselge, ebakooskõlaline ja ebaveenev. Autori arutluskäiku pole võimalik kohati või üldse jälgida. Kirjanduse kasutus ei ole asjakohane. Esineb tõsiseid probleeme stiili ning viitamisega. Kaitsmine näitab, et üliõpilane ei valda uurimisteemat."}}], "grade_preconditions": {"et": "Õppekava läbimine täies mahus, nõuetekohase ning juhendaja poolt kaitsmisele lubatud bakalaureusetöö õigeaegne esitamine.\nVt kirjalike tööde juhend filosoofias, kaitsmise ja eelkaitsmise reeglid, lõputööde ajakava: https://filsem.ut.ee/et/sisu/dokumendid-ja-korrad"}, "grade_evaluation": {"et": "Hindamine toimub avalikul kaitsmisel kaitsmiskomisjoni poolt vastavalt TÜ filosoofia osakonna bakalaureusetööde hindamisjuhendile."}, "debt_elimination": {"et": "Bakalaureusetöö parandatud versiooni on võimalik kaitsta järgmisel semestril. Vajalike paranduste suhtes pidage nõus oma juhendajaga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Määratakse individuaalselt vastavalt uurimisteemale.\nWill be assigned individually according to the research topic.\nLõputööde nõuded ja juhendid (\"Kirjalikud tööd filosoofias\", BA töö kavandi juhend, BA tööde hindamisjuhend, litsentsi vorm, bakalaureusetöö valmimise ajakava) on kättesaadavad instituudi kodulehel aadressil: https://filsem.ut.ee/et/sisu/dokumendid-ja-korrad", "recommended_materials": "Määratakse individuaalselt vastavalt uurimisteemale.\nWill be assigned individually according to the research topic."}, "participants": {"lecturers": [{"person_uuid": "efa57bea-fed9-6851-fe93-a4be2b963365", "person_name": "Uku Tooming", "structural_unit": {"code": "HVFI01TE", "name": {"en": "Chair of Theoretical Philosophy", "et": "teoreetilise filosoofia õppetool"}, "phone": "+372 737 6619", "address": "r 319-321\nEST", "street": "r 319-321", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Regulaarsed kohtumised juhendajaga, individuaaltöö / Meetings with supervisor(s), individual work"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Eelkaitsmine / Pre-defense\nTöö parandamine / Revisions"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Avalik kaitsmine / Public defense"}}]}, "registration_info": {"audience": {"et": "Üliõpilane on läbinud alus- ja suunamoodulid, erialamoodulid ning valik- ja vabaained."}, "min_students": 1}, "parent_uuid": "91bfdbf7-1af5-5cee-bf92-56b1b150f188", "parent_code": "FLFI.00.073", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}