{"uuid": "56db639c-cbde-8974-9f9d-577011324d3c", "code": "hv-2018-autumn-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Main Topics in Ethics", "et": "Eetika peateemad"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 6, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course introduces the students to the main theories in normative ethics. First, we introduce theories of the good life: hedonism, desire-satisfaction, objective list theories. Second, we introduce theories of what is specifically morally good or bad, right or wrong: utilitarianism, Kantian ethics, pluralism, virtue ethics. The course is based on regular homework, meetings in seminars, and a final essay.", "et": "Kursus annab ülevaate eetika põhiprobleemidest ja -mõistetest: Mis on eetika ja moraal? Eetika etümoloogia. Millega tegelevad teoreetiline ja praktiline eetika ning kutse-eetika? Mille poolest erinevad normatiivsed süsteemid moraal, õigus, religioon? Mis vahe on kirjeldaval ja väärtustaval lausungil? Kuidas langetatakse moraaliotsustusi? Kas väärtused on subjektiivsed või objektiivsed? Kust on pärit meie moraalinormid? Kas moraalinormid on universaalsed või kultuurirelatiivsed? Missugused moraalsed kohustused on meil teiste inimeste ees? Mis motiveerib inimesi moraalselt toimima? Kas omahuvi ja moraal sobivad kokku? Kuidas on seotud väärtused ja normid ning väärtused ja õnn?"}, "objectives": [{"en": "The course aims to:", "et": "Aine üldeesmärgid on:"}, {"en": "1) provide an overview of the main problems, concepts and theories in ethics,", "et": "1) Anda ülevaade eetika põhiprobleemidest, -mõistetest ja teooriatest."}, {"en": "2) introduce the students to classical and modern text of ethics,", "et": "2) Tutvustada üliõpilastele klassikalisi ja kaasaegseid eetikaalaseid tekste."}, {"en": "3) develop the students' ability to argue, analyze and discuss, both in written and oral form,", "et": "3) Arendada üliõpilaste argumenteerimis-, analüüsi- ja arutlusoskust, nii kirjalikult kui suuliselt."}, {"en": "4) support personal values clarification", "et": "4) Toetada isiklikku väärtusselitust."}], "learning_outcomes": [{"en": "By the end of the course the students understand the meaning of the central concepts in ethics, can use those concepts, have an overview of the main moral theories, can characterize them and know their strengths and weaknesses as well as subdivisions. They also know some central ethical text and can, on a general level, follow the logical structure and details of argumentation. They are able to discuss and analyze ethical texts and arguments on a basic level and are able to take a justified position on practical ethical questions.", "et": "Kursuse lõpuks saab üliõpilane aru olulisemate eetikamõistete tähendusest ning oskab neid mõisteid kasutada, omab ülevaadet peamistest moraaliteooriatest, oskab neid iseloomustada, tunneb nende tugevaid ja nõrku külgi ning eristab nende alamvoolusid. Tunneb mõningaid olulisi eetikatekste ja suudab esmatasandil jälgida argumentatsiooni loogilist struktuuri ja üksikasju. Suudab algtasandil kriitiliselt arutleda eetikatekstide ja -argumentide üle. On võimeline võtma põhjendatud seisukohti praktilistes eetilistes küsimustes."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "TESTID (25% lõpphindest)\nKogu kursuse jooksul tuleb õpikeskkonnas Moodle sooritada valikvastustega teste, mis vastavad L. P. Pojmani õpiku \"Eetika: õiget ja väära avastamas\" peatükkidele. Testid koosnevad 5-10 valikvastustega küsimusest. Kursusel on kokku 60 küsimust, iga õige testivastus annab 1 punkti.\nKui test viibib ilma mõjuva põhjuseta, siis iga hilinetud päeva eest arvestatakse maha 1 testipunkt, kuid mitte rohkem, kui selle ülesande eest on võimalik saada. S.t 10-punktise testiga hilinemisel on võimalik kaotada kuni 10 punkti. NB! Testi sooritamine on vajalik tingimus eksamile pääsemiseks ka siis, kui selle eest enam pole võimalik punkte saada.\nLisaks on võimalik teenida nn lohutuspunkte (valede vastuste piires) enne testi sooritamist foorumis esitatud asjakohaste küsimuste eest. Täpsem juhtnöör Moodle's vastavate vahendite juures.\nEt testid moodustavad lõpphindest 25%, siis enne lõpphindamist arvutatakse kõik testipunktid ümber 25 punkti skaalale."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "SEMINARIOSALUS (25% lõpphindest)\n25 punkti - on näha, et tekst on mõtestatult läbi loetud; tudeng panustab oma sõnavõttudega aktiivselt seminari, sõnavõtud on asjakohased, rikastavad diskussiooni ning aitavad seda edasi viia.\n20 punkti - on näha, et tekst on korralikult läbi loetud; tudeng panustab aktiivselt diskussiooni.\n15 punkti - on näha, et tekst on läbi loetud; tudeng panustab diskussiooni tagasihoidlikult, aga oskab küsimustele adekvaatselt vastata.\n10 punkti - on näha, et teksti on loetud, aga tudengi sõnavõtud ei ole alati teemakohased ega haagi üldise diskussiooniga.\n5 punkti - on näha, et tekstiga on tutvutud; aga tudengi sõnavõtud jäävad napiks ning pole enamasti teemakohased.\n0 punkti - pole näha, kas teksti on loetud, sest tudeng ei võta sõna.\nSeminaris osalemine on põhiosas kohustuslik, lubatud puudumiste arv on kaks. Juhul, kui puudumisi on rohkem kui kaks, on puudumine lubatud vaid arstitõendi alusel või muul väga mõjuval põhjusel (nt esindusvõistlusel viibimine, traagiline sündmus). Iga mõjuva põhjuseta puudumise korral läheb 25-st seminaripunktist automaatselt 2,5 punkti maha. NB! Kõik puudumised, olenemata põhjusest, on vaja kompenseerida 1,5-2 lk pikkuse kodutööga, kus esitatakse vastused seminaritekstiga kaasas käinud toetavatele küsimustele."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "KIRJALIK EKSAM (25% lõpphindest)\nEksamitöös on valik- ja lühivastustega küsimused ning üks arutlusülesanne. Lühivastuste puhul hinnatakse vastuse õigsust vastavalt kursuse vältel käsitletud materjalile ja ammendavust. Arutlusküsimuse puhul hinnatakse oskust eetikaküsimusi süstemaatiliselt ja analüütiliselt käsitleda, kursuse käigus läbi võetud teoreetiliste lähenemiste tundmist, omalt poolt esitatud poolt- ja vastuargumentide kaalukust, võimet käsitletud lähenemisi kokkuvõtlikult hinnata ning nende vahel põhjendatult valida. Eksamitöö eest on võimalik kokku saada 50 punkti, mis mõjutab koondhinnet 50% ulatuses."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "ESSEE (25% lõpphindest)\nEssee hindamisel lähtutakse 5 kriteeriumist:\n1)\tprobleemiseade, ideed ja väited;\n2)\tteema filosoofiline mõistmine;\n3)\targumentatsioon, loogiline korrektsus;\n4)\tallikate kasutamine;\n5)\tvormistus ja struktuur, loetavus.\nIga kriteeriumi eest on võimalik saada 5 punkti. Alljärgnevalt on kirjeldatud maksimum-nõuded, puudujääkide korral saadakse vastava kriteeriumi eest punkte vähem kui 5.\n\nProbleemiseade, ideed ja väited\nKirjutis keskendub ühele tabavalt valitud probleemküsimusele, mis on seotud kursusel käsitletava problemaatikaga, kuulub filosoofiasse ja ei ole triviaalne. Probleemi tuum on selgelt avatud, selgitatud on konteksti. Essee käsitleb vaid ühte keskset probleemi, mida uuritakse põhjalikult ja mitmetahuliselt. Essee autori peamine väide on selgelt ja üheselt välja toodud. Essee ei sisalda teemasse mittepuutuvat ainest. Essee sisaldab selle kirjutanud üliõpilase enda mõtteid, see ei piirdu vaid teiste autorite poolt öeldu ümberjutustamisega.\n\nTeema filosoofiline mõistmine\nKirjutisest peegeldub, et autor oskab kursusel õpitud teooriate ning vaadete seas hästi orienteeruda ning oma isiklikke väiteid kursusel õpituga suhestada. Argumentatsioonis on põhirõhk filosoofilises mõttes kandvamatel eeldustel (väärtusväidetel), mitte üksnes vaidlusel empiiriliste faktide üle. Kasutatakse filosoofiliselt täpset sõnavara. \n\nArgumentatsioon, loogiline korrektsus\nEssees on kesksel kohal autori enda mõtted, arvamus või hinnang ning seda argumenteeritakse ehk põhjendatakse, kasutades selleks ka teiste autorite tekste. Argumentatsioon on loogiliselt sidus ega sisalda vasturääkivusi. Selgitatud on olulised eeldused, millele argumentatsioon toetub. Väited on arusaadavalt ja optimaalselt sõnastatud. Terminid on üheselt mõistetavad. Olulisemaid termineid selgitatakse. Väiteid põhjendatakse, argumentatsioon on veenev.\n\nAllikate kasutamine\nProbleemi üle arutlemisel demonstreeritakse kursusel käsitletud materjali ning mõistestiku tundmist. Kasutatakse essees käsitletava konkreetse probleemi seisukohalt olulisi allikaid. Allikad on valitud asjatundlikult, kasutatakse akadeemilisi väljaandeid. Mitteakadeemilisi väljaandeid (nt seaduste tekstid, arvamusartiklid ajalehtedes, Wikipedia vms) kasutatakse üksnes probleemile osutamiseks, selle näitlikustamiseks või kirjeldamiseks. Teiste autorite mõtted on optimaalselt ümber öeldud ja korrektselt viidatud, tsitaate kasutatakse vaid põhjendatud vajadusel. Essee autori mõtted on selgelt eristatavad teiste autorite omadest.\n\nVormistus ja struktuur, loetavus\nTöö on keeleliselt korrektne. Sõnastus on ladus, sidus, optimaalne, täpne, stiililt ühtlane. Laused ja terminid on üheselt mõistetavad. Töö sisaldab sissejuhatust, teemaarendust ja kokkuvõtet ning kasutatud kirjanduse loetelu. Sissejuhatus sõnastab probleemi ja/või autori peamise väite ning annab selge ja ülevaatliku pildi töö kavast. Kokkuvõte annab ülevaate töö tulemustest. Kokkuvõte ei sisalda uusi väiteid, kuid võib ära nimetada mõne teema seisukohast olulise edasist uurimist nõudva küsimuse. Sissejuhatus ja kokkuvõte moodustavad kumbki umbes 1/10 töö kogumahust. Teemaarendus on järk-järguline, selgelt struktureeritud ning järjekindel, mitte laialivalguv ega hektiline. Viited on korrektsed, kasutatakse ühtset viitamissüsteemi. Pealkiri on kooskõlas töö sisuga. Teksti osa on 2000-2500 sõna pikk (ilma kasutatud allikate loeteluta), Times New Roman 12 (või mõni teine samaväärselt loetav font), reavahe 1,5, kasutatud lõigutaanet või täiendavat lõiguvahet (6 pt), tekst on rööpjoonestatud. Töö on varustatud leheküljenumbrite ja päisega (tööpealkiri ja autori nimi).\n\n\nKoondhinne määratakse järgmiselt:\nA 91-100%\nB 81-90%\nC 71-80%\nD 61-70%\nE 51-60%\nF ...-50%"}}], "grade_preconditions": {"et": "1) Kõik Moodle'i testid peavad olema tehtud ning kõigi testide peale kokku peavad vähemalt 50% vastustest olema õiged (s.t. 60-st testipunktist peab olema kogutud vähemalt 30).\n2) Tudeng peab olema osalenud kõigil seminaridel või kompenseerinud seminaripuudumise(d) kirjalike töödega. Täpsemalt on iga puudumise korral vaja esitada 1,5-2 lk pikkune kodutöö, kus esitatakse vastused seminaritekstiga kaasas käinud toetavatele küsimustele.\nNB! Kõik võlgnevused peavad olema likvideeritud hiljemalt 3 päeva enne valitud eksamiaega."}, "grade_evaluation": {"et": "25% Moodle'i testid\n25% seminariosalus\n25% kirjalik eksam\n25% essee"}, "debt_elimination": {"et": "Moodle'i testidega hilinemise puhul tuleb pöörduda kirja teel õppejõu poole, et test uuesti avataks, ning kokku leppida uus aeg, milleks testi ära teete.\nSeminarist puudumise korral tuleb käsitletud teksti kohta esitada seminarijuhendajale kirjalik 1,5-2 lk pikkune kodutöö, kus esitatakse vastused seminaritekstiga kaasas käinud toetavatele küsimustele."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=1543", "is_moodle_connected": false, "mandatory_materials": "Seminaritekstid.\nLouis P. Pojman \"Eetika\"", "recommended_materials": "L. Pojman (toim.) \"The moral life: an introductory reader in ethics and literature\"\nL. Pojman (toim.) \"Ethical theory: classical and contemporary readings\"\nP. Singer (toim.) \"A companion to ethics\"\nP. Singer (toim.) \"Applied ethics\"\nR. Shafer-Landau (toim.) \"The Ethical Life\"\nRachels, J. \"The Elements of Moral Philosophy\"\nTännsjö, T. \"Understanding Ethics\"\nEetikakoodeksite käsiraamat, Koostajad T. Aavik, K. Keerus, K. Lõuk, A. Nõmper, A. Pevkur, L. Saarniit, K. Simm, M. Sutrop, M. Tõnissaar, A. Vaher, I. Volt. Tartu Ülikooli eetikakeskus, Eesti Keele Sihtasutus. 2007.\n\nEetikaveebi materjalid: www.eetika.ee"}, "participants": {"lecturers": [{"person_uuid": "6d77a57d-f113-085e-af08-a92cbe230f4c", "person_name": "Margit Sutrop", "structural_unit": {"code": "HVHV", "name": {"en": "Dean's Office, Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkonna dekanaat"}, "email": "hv.dekanaat@ut.ee", "phone": "+372 737 5341", "webpage_url": "https://humanitaarteadused.ut.ee", "address": "Jakobi 2, r 116-121\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, r 116-121", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "774dd075-f08d-5ee2-da91-31087a2ea1d2", "person_name": "Heidy Meriste", "structural_unit": {"code": "HVFI05", "name": {"en": "Centre for Ethics", "et": "Tartu Ülikooli eetikakeskus"}, "phone": "+372 737 5427", "webpage_url": "https://eetikakeskus.ut.ee", "address": "Jakobi 2, III korrus, ruumid 327, 329-333\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 327, 329-333", "zip": "51005", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-15"}, "entries": [{"time": "2018-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. loeng. Õppejõud: Margit Sutrop"}}, {"time": "2018-09-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "1. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "2. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2. loeng. Õppejõud: Margit Sutrop"}}, {"time": "2018-10-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "3. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-10-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "4. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. loeng. Õppejõud: Margit Sutrop"}}, {"time": "2018-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "5. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-11-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "6. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "7. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "8. seminar. Õppejõud: Heidy Meriste"}}, {"time": "2018-12-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "9. seminar. Õppejõud: Heidy Meriste"}}]}, "registration_info": {"audience": {"et": "filosoofia BA, filosoofia kõrvalerialana, huvilised"}, "min_students": 10}, "parent_uuid": "066f0590-9df2-ee41-f141-7dbc97f21474", "parent_code": "FLFI.02.148", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}