{"uuid": "17fe9c56-0171-8a49-3a73-8453532b920c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-03T09:42:48", "title": {"en": "Legal Rules in the Wild: Philosophy of Language and Law", "et": "Keelefilosoofia ja õigus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV", "et": "25/26 K PÕ HV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 52, "independent_work": 104, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course explores how the interpretation of language in official documents like laws and company policies can vary depending on who's reading them and the context in which they're read. For instance, a law might be interpreted differently by civil servants and police officers; a company rule might be understood differently by members of the finance department and the marketing team. Whether a regulatory document is understood in the way its writers intended and whether different sets of users of the document understand it in the same way depends on much more than the document itself. This course explores the role played by the contexts of the use of regulatory documents in shaping whether they are interpreted as intended and what changes one would have to make to those contexts to improve the interpretation of such documents.", "et": "Õppeaine käigus uurime, kuidas õigusaktide, juhiste, lepingute ja muude dokumentide tõlgendamine võib varieeruda sõltuvalt sellest, kes sellega on seotud ja millises kontekstis seda tehakse. Nii nagu ametnikud ja politseinikud võivad erinevalt tõlgendada sama õigusakti, võivad ettevõtte raamatupidajad ja turundusmeeskond mõista erinevalt ka ettevõtte sees kehtivaid juhiseid. See, kuivõrd õigusnorme mõistetakse vastavalt seadusandja tahtele, ja kuivõrd juhiseid mõistetakse sarnaselt erinevates kasutajagruppides, sõltub enamast kui ainult vastuvõetud tekstist. Selles õppeaines uurime, milline on normide tõlgendamisel nende kasutuskontekstide roll ja milliseid muudatusi oleks nendes kontekstides võimalik teha selleks, et tagada normide tõlgendamisel järjepidevus ja vastavus seadusandja tahtele."}, "objectives": [{"en": "Norms (contained in laws, guidelines, contracts, etc.) are (often) created to guide behaviour in a way that solves coordination problems or achieves valued societal outcomes. Once written, a large part of the life of the norms takes place outside the courts, for example, when organizations implement them within themselves. This course aims to teach methods, theory, and findings from the philosophy of language and experimental jurisprudence that can be used to understand better the interpretation, strategic use, and context of such rules.", "et": "Normid (õigusaktides, lepingutes, juhistes ja mujal) on tihti loodud selleks, et koordineerida inimeste käitumist või saavutada teatud eesmärke. Kord kirja pandud, elavad normid edasi oma elu ning mitte kõiki nende tõlgendamisega seotud küsimusi ei lahenda kohtud: teatud normid võivad rakenduda näiteks üksnes mõne organisatsiooni sees. Selle aine eesmärk on luua kaasaegse keelefilosoofia ja eksperimentaalse õigusfilosoofia pinnalt teadmiste ja meetodite pagas, mis võimaldab paremini mõista normide tõlgendamise, strateegilise rakendamise ja kontekstitundlikkuse hindamisega seotud praktikaid."}], "learning_outcomes": [{"en": "By completing the course, students will have: ", "et": "Õppeaine läbinud üliõpilasel on: "}, {"en": "1. Knowledge of theories in analytical jurisprudence and areas of experimental jurisprudence that are relevant to the interpretation of legal norms, and the experience of defending a position amongst these theories in both spontaneous discussion (debate) and argumentative text (essay). ", "et": "1. Teadmised analüütilise õigusfilosoofia peamistest teooriatest ja eksperimentaalse õigusfilosoofia harudest, mida saab rakendada normide tõlgendamisel; samuti oma õigusfilosoofilise seisukoha kaitsmise kogemus nii spontaanse arutelu (debati) käigus kui argumenteerivas tekstis (essees)."}, {"en": "2. The ability to provide an analysis of how various sources of norms interact with the contexts in which they're applied, and how to make the rules, etc., better serve their purpose either by changing the rules or by changing the context of their use.", "et": "2. Oskus analüüsida, kuidas õigus- ja muude normide allikad suhestuvad kontekstiga, milles neid rakendatakse, ja kuidas neid allikaid või konteksti saaks kohandada, et täita paremini allika eesmärki."}, {"en": "3. Overview of places where such analyses can be provided and used to make improvements.", "et": "3. Ülevaade praktika- ja töökohtadest, kus omandatud keele- ja õigusfilosoofilised teadmised ning meetodid võiksid aidata praktikaid parandada."}], "notes": {"et": "Prerequisite courses:\n* Philosophy MA students must have completed the Start module courses of the Philosophy MA before they can take this course. \n* Students from other MA curricula must have completed 12 ECTS in Philosophy or Law before taking this course.\n\nThe course is meant for MA students from Philosophy and MA students from the following programmes:  \n\nLaw School \n- Law (Õigusteadus) (Regular study) \n- Information Technology Law (Infotehnoloogiaõigus) (Regular study)  \n\nSkytte Institute of Political Studies \n- Politics and Governance in the Digital Age (Poliitika ja valitsemine digiajastul) (Regular study) \n- International Relations and Regional Studies (Rahvusvahelised suhted ja regiooni uuringud) (Regular study) \n- European Studies (Euroopa õpingud) (Block mode study) \n\nSchool of Economics and Business Administration \n- Innovation and Technology Management (Innovatsiooni ja tehnoloogia juhtimine) (Regular study) \n- Strategic Management (Strateegiline juhtimine) (Block mode study) \n- Contemporary Economy (Kaasaegne majandus) (Block mode study)  \n\nInstitute of Social Sciences joint curriculum \n- Change Management in Society (Muutuste juhtimine ühiskonnas) (Block mode study)"}}, "grading": {"independent_work": {"et": "x"}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "LO1 - Debate: Assessment (weeks 2.2, 3.2, 4.2, 5.2).\nWorth 33% of final grade: students engage in team debates on 4 interconnected topics. Team members have to agree that everyone contributed substantially to their team's defence, and the defences must clearly meet the following criteria as judged by the lecturers. These will be ranked on a scale out of 3: 1 = inadequate, 2 = adequate, 3 = excellent. All team members receive the same grade (assessment is team-based). \n\n* Content Knowledge: teams have to show they accurately recall core arguments and literature the debate is based on.\n* Argument Structure and Clarity: teams must show they can present arguments in favour of their position in the debate.\n* Use of Evidence: empirical claims have to be backed up by evidence.\n* Adaptability and Responsiveness: the teams adapt to the dynamics of the debate. Are they responsive to new information or perspectives introduced during the debate? Can they adjust their strategy based on the flow of the debate? \n* Teamwork and Collaboration: it should be clear from the team's actions in the debate that each member contributed to the team's defence.\n* Presentation Skills: the team members' contributions should be clear and professional during the debate."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "LO1 - Essay: Assessment (weeks 6.2-72). Worth 33% of final grade. \nStudents individually write a paper through Thi Nguyen's \"workshop sequence\" (weeks 6.2-7.2). The papers will be graded based on the following criteria:\n10% - Paper structure and formatting are consistent, and formal requirements are satisfied\n15% - Key concepts are well-defined and used correctly within the paper  \n25% - relevant course literature is addressed, reconstruction of the argument is adequate  \n30% - Original argument is provided, it is based on clearly stated premises (and/or assumptions), premises support the conclusion  \n10% - Signposting (explain what you do in each paragraph, help your reader to navigate through the paper) \n10% - Overall impression (the paper is a holistic work, parts are well connected)"}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "LO2 - Assessment (weeks 10.2-13.2). Worth 33% of final grade.\nBased on both a written report and the presentation, student analyses of their assigned case-study will be assessed based on the following criteria. Each criterion will be assessed on a scale between 1 (inadequate), 2 (adequate), and 3 (excellent).\n\n* The analysis clearly specifies the gap between the purpose of the law and what's actually happening in the context of its application.\n* The analysis considers a range of explanations of the discrepancy between purpose and reality.\n* The analysis develops a method for deciding which of the explanations is the most plausible.\n* The analysis includes a plan of action for improving the fit between purpose and reality. For each explanation--plans of action that can be implemented once the method results are known.\n* The team shows an ability to respond to objections raised in the presentation but which are not considered in the report."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "LO3 - Assessment (homework assignment at the end of course). Worth 1% of final grade.\nThe case studies the students work on in weeks 11.1-13.2 will include organizations where the students could take up practice placements. Students will be made aware of this and tested on their awareness."}}], "grade_preconditions": {"et": "x"}, "grade_evaluation": {"et": "1. Debates: total possible grade = 4 (debates) * 6 (criteria) * 3 (points maximum per criterion) = 72 (33% of final grade).\n2. Workshopped essay: score out of 100 (33% of final grade).\n3. Final Project: score out 5 (criteria) * 3 (points maximum per criterion) = 15 (33% of final grade).\n4. Possible practice placement (1% of final grade).\n\nGrade boundaries: \nA = 90-100%\nB = 80-89%\nC = 70-79%\nD = 60-69%\nE = 50-59%\nF = less than 50%"}, "debt_elimination": {"et": "There is no possibility of re-taking assignments."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "These will be provided on the Moodle site for the course. But see the texts listed under Timetable.", "recommended_materials": "We will make use of current news and podcasts, and videos by us."}, "participants": {"lecturers": [{"person_uuid": "f63f44a3-ab67-351f-d3a6-63d98430e098", "person_name": "Alexander Stewart Davies", "structural_unit": {"code": "HVFI01TE", "name": {"en": "Chair of Theoretical Philosophy", "et": "teoreetilise filosoofia õppetool"}, "phone": "+372 737 6619", "address": "r 319-321\nEST", "street": "r 319-321", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "4c8a9741-bd5f-ef60-b5bc-4bb17266c8dd", "person_name": "Helen Eenmaa", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-39"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Two meetings per week: X.1, X.2. \n\nWeek 1.1: Problem setting - illustrating the concept of the life of law outside the courts and the command theory of law. \n[Excerpts from Shapiro, S. (2013) What is Law (and Why Should We Care)?; Crazy Little Thing Called \"Law\"; Austin's Sanction Theory. In: Legality. Harvard University Press.] \n\nWeek 2.1: Seminar: Pictures of the law 1: Command theory versus Hart.\n[Excerpts from chapters 5 & 6 of Hart, H. L. A. (2012). The Concept of Law (3rd edition). Oxford University Press.]\n\nWeek 2.2: Team-Debate: Pictures of the law 1: Command theory versus Hart.\n\nWeek 3.1: Seminar: Pictures of the law 2: Hart versus Fuller. \n[Fuller, Lon L. \"Positivism and Fidelity to Law: A Reply to Professor Hart.\" Harvard Law Review, vol. 71, no. 4, 1958, pp. 630-72. JSTOR, https://doi.org/10.2307/1338226.] \n\nWeek 3.2: Team-Debate: Pictures of the law 2: Hart versus Fuller. \n\nWeek 4.1: Seminar: Experimental Jurisprudence 1: Testing the Hart/Fuller debate.\n[Struchiner, N., Hannikainen, I. R., & Almeida, G. da F. C. F. de. (2020). An experimental guide to vehicles in the park. Judgment and Decision Making, 15(3), 312-329. https://doi.org/10.1\n\nWeek 4.2: Team-Debate: Experimental Jurisprudence 1: continued (testing the Hart/Fuller debate). \n\nWeek 5.1: Seminar: Experimental Jurisprudence 2 - 'ordinary meaning'.\n[Tobia, K., Slocum, B. G., & Nourse, V. (2022). Ordinary Meaning and Ordinary People (SSRN Scholarly Paper 4034992). https://doi.org/10.2139/ssrn.4034992]  \n\nWeek 5.2: Team-debate: Experimental Jurisprudence 2 - 'ordinary meaning'.\n\nWeek 6.2: Writing Individual papers: Workshop sequence: pitching."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Week 7.1: Writing Individual papers: Workshop sequence: exchange of short drafts. \n\nWeek 7.2: Writing Individual papers: Workshop sequence: write and submit paper (no meeting). \n\nWeek 8.1: Seminar: Philosophy of Language: semantic underdetermination and the experimental jurisprudence literature. [excerpts from a variety of texts on the nature of semantic underdetermination]  \n\nWeek 8.2: Team analyses: reviewing the Experimental Jurisprudence literature through two different paradigms of conventional meaning. \n\nWeek 9.1: Policy-implementation literature: street-level bureaucrats.\n[excerpts from Lipsky, M. (2010). Street-Level Bureaucracy: Dilemmas of the Individual in Public Service, 30th Anniversary Expanded Edition (30th Anniversary, Expanded ed. edition). Russell Sage Foundation.]\n\nWeek 9.2: Team analyses: Policy-implementation literature: street-level bureaucrats: are street-level bureaucrats constructing the law?\n\nWeek 10.1:  Policy-implementation literature: case study--redesigning organizations to change how they construct the law.\n[Excerpts from a variety of texts in this literature] \n\nWeek 10.2: Team analysis: drawing connections to the experimental jurisprudence literature \n\nWeek 11.1: Meta-contexts Project: teams are given case studies and a chance to discuss initial impressions of the task. \n\nWeek 11.2, 12.1, 12.2\n\nWeek 13.1, 13.2: Presentations of analyses and dissection by other teams as audience."}}]}, "registration_info": {"audience": {"et": "Philosophy MA students, MA and PhD students, visiting students at all levels"}, "min_students": 3, "max_students": 20}, "parent_uuid": "8599c97d-22cd-4aac-632b-1600f8e017de", "parent_code": "FLFI.04.103", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}