{"uuid": "84bce485-f61a-6c16-d8b8-37a036ea69a0", "code": "FLFI.05.041", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "The Philosophical Origins of Estonian Nationalism", "et": "Eesti rahvusluse filosoofilised lätted"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The aim of the course is to explore the philosophical context and origins of Estonian nationalism. The course addresses three themes: 1) the European classics; 2) the \"significant others\" in the region; 3) the classics of Estonian nationalism.", "et": "Kursuse eesmärgiks on uurida eesti rahvusluse filosoofilist konteksti ja kujunemislugu. Loengukursus käsitleb 1) Eesti jaoks tähenduslikke Euroopa rahvusluse klassikuid; 2) eesti rahvusluse \"tähenduslikke teisi\" regioonis; 3) eesti rahvusluse klassikuid."}, "objectives": [{"en": "- To provide basic knowledge of the philosophical context and \"significant others\" of Estonian nationalism.", "et": "- Anda ülevaade Eesti rahvusluse filosoofilistest allikatest ning \"tähenduslikest teistest\"."}, {"en": "- To analyse the most important representatives of Estonian nationalism against the broader background of European nationalism on the one hand, and various \"significant others\" in the region, on the other.", "et": "- Analüüsida Eesti rahvusluse silmapaistvamaid esindajaid seostatuna filosoofiliste eeskujude ning erinevate regionaalsete \"tähenduslike teistega\"."}, {"en": "- To teach students to view the philosophy of nationalism as based on certain key concepts of moral and political philosophy.", "et": "- Õpetada tudengeid nägema rahvusluse filosoofiat laiemate moraali- ja poliitikateoreetiliste küsimustega seondatult."}, {"en": "- To teach students to analyse the thinkers in terms of their usage of concepts, argumentation and political aims.", "et": "- Õpetada tudengeid analüüsima mõtlejate mõistekasutust, argumentatsiooni ning poliitilisi eesmärke."}], "learning_outcomes": [{"en": "The student who has completed the course successfully:", "et": "Õppeaine edukalt sooritanud üliõpilane:"}, {"en": "1) has basic knowledge of the main philosophical inspirations as well as of various \"signifcant others\" of Estonian nationalism and is able to analyse the Estonian nationalist authors as developing their ideas within wider philosophical as well as political debates,", "et": "1) omab alusteadmisi Eesti rahvusluse filosoofilistest allikatest ja \"tähenduslikest teistest\" ning mõistab Eesti rahvusluse klassikute ideid asetatuna laiemasse filosoofilisse ning ühiskondlik-poliitilisse diskussiooni,"}, {"en": "2) is able to analyse and understand the key moral and political issues related to nationalism (incl. Estonian nationalism),", "et": "2) suudab näha rahvuslust, sh Eesti rahvuslust seostatuna moraali- ja poliitikateooria fundamentaalsete probleemidega,"}, {"en": "3) is able to reconstruct: a) the historical authors' usage of concepts, b) their argumentation, as well as c) to relate the former to the political context in which they are advancing their ideas.", "et": "3) oskab (a) analüüsida mõistete kasutust rahvusluse tüvitekstides, (b) rekonstrueerida nende argumentatsiooni ning (c) seostada seda poliitilise kontekstiga."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}