{"uuid": "0fba44ce-8f2f-5d54-d77d-192072a3b51f", "code": "hv-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-01-22T12:17:58", "title": {"en": "Practice I", "et": "Praktika I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 34, "individual_work": 4, "internship": 40}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Practice is a work-related learning experience that follows university regulations and is guided by a tutor.\n\nAll activities should be agreed prior with the practice coordinator Jaana Eigi-Watkin (jaana.eigi-watkin@ut.ee).\nBefore practice the student must compile a goal driven practice plan. After practice the student must submit a report which includes self-reflection\nNB! Finding a practice base is the responsibility of the student and is part of the practice (how to find a job).\n\nThis course is meant for BA students.", "et": "Praktika on õpiväljundite saavutamise sihipärane tegevus, mille eesmärk on rakendada õpitud teadmisi ja oskusi õppeasutuse määratud vormis ning juhendaja juhendamisel töökeskkonnas (võib toimuda ka õppekeskkonnas, kui õppijal on praktika käigus tavapärasest erinev roll).\n\nKõik tegevused tuleks eelnevalt kooskõlastada praktika koordinaatori Jaana Eigi-Watkiniga (jaana.eigi-watkin@ut.ee).\nEnne praktikale asumist  tuleb koostada eesmärgistatud praktikaplaan. Pärast praktika lõppu enesereflektsiooniga praktikaaruanne.\nNB! Praktikakoha leidmine on tudengi ülesanne ning see on osa praktikast (oskus leida endale töökohta).\n\nAine on mõeldud BA tudengitele."}, "objectives": [{"en": "Goals of the practice course is to provide students with work experience. To learn and develop transferable skills, such as time management, team work, project management and communication skills, as well as develop attitudes necessary for working. To practice implementing knowledge acquired during studies in a working environment and develop proficiency. To develop the skills to critically analyse the content of studies through the experience of internship.", "et": "Praktika eesmärk on anda üliõpilastele praktilist töökogemust. Arendada nende ülekantavad oskusi (sh projektijuhtimine, ajaplaneerimine, enesejuhtimine jne). Harjutada erinevates õppeainetes õpitu rakendamist töökeskkonnas ja arendada vastavaid vilumusi. Arendada oskust õpitut praktikakogemuse põhjal analüüsida ja kriitiliselt hinnata."}, {"en": "The exact nature of the practice seminar will be individually agreed by student and supervisor, depending on the background, interests and career path of the student. The practice has to fall into one of the following three categories:", "et": "Praktika täpne sisu lepitakse kokku individuaalselt ning sõltub üliõpilase taustast, huvidest ja karjääriplaneerimisest, praktika tegevus peab langema ühte allpool kirjeldatud kategooriasse:"}, {"en": "1) Practical training in entrepreneurship. The student will go, on the basis of a practice contract, outside the University to some organisation. They will be assigned a practice supervisor. They will perform the work tasks assigned to them by their place of practice.", "et": "1) Ettevõtluspraktika. Tudeng läheb praktikalepingu alusel praktikale mõne organisatsiooni juurde ülikoolist välja. Talle määratakse praktikakoha poolt juhendaja. Ta sooritab praktikakohas talle ettenähtud tööülesanded."}, {"en": "2) Project based practice. The sudent will participate in the work of a team within a specific project from beginning to the end. The project must be either a response/solution to a specific need or request by an organisation outside the University. Or a response/solution to a specific need or a request by a sub-unit of the University.", "et": "2) Projektipõhine praktika. Tudeng osaleb ühe konkreetse projekti meeskonna töös projekti algusest lõpuni. Projekti lähteülesandeks on kas ülikooliväline tellimus mõne organisatsiooni poolt. Või ülikooli sisene tellimus mõne allüksuse poolt."}, {"en": "3) Teaching assistant. The student will assist a member of the faculty with a course or research (incl. organizing academic events).", "et": "3) Õppeassistendi praktika. Tudeng assisteerib õppejõudu ühe konkreetse õppeaine läbiviimise või teadustöö tegemise juures (sh akadeemiliste ürituste korraldamine)."}], "learning_outcomes": [{"en": "After completing the practice, the student is able to:", "et": "Praktika sooritanud üliõpilane:"}, {"en": "- creatively apply  disciplinary knowledge  and -skills within a working environment;", "et": "- oskab erialateadmisi ja -oskusi töökeskkonnas loovalt rakendada;"}, {"en": "- analyse the practice experience critically (via self-analysis) and integrate the theoretical knowledge with the practice;", "et": "- analüüsib oma praktilist tegevust enesekohaselt ja -kriitiliselt (eneseanalüüs), püüdes selle käigus lõimida praktikat teoreetiliste teadmistega;"}, {"en": "- develop transferable skills in a working environment (such as teamwork, time management, project management, etc);", "et": "- on arendanud ülekantavaid oskusi töökeskkonnas (näiteks meeskonnatöö, ajaplaneerimine, projektijuhtimine jt);"}, {"en": "- provide feedback about the internship to the tutor and other students.", "et": "- annab praktika kohta tagasisidet juhendajale ja kaastudengitele."}, {"en": "- has reflected on their experience and knows their strengths and weaknesses in relation to a practical work environment", "et": "- on reflekteerinud oma kogemuse üle ning tunneb oma tugevusi ja nõrkusi seoses praktilise töökesskonnaga"}], "notes": {"et": "Palun pöörduge semestri 1-2 nädalal praktikakoordinaator Mats Volbergi poole (mats.volberg@ut.ee), et kokku leppida praktika koht, aeg jt detailid ning vajadusel koostada ja sõlmida  praktikaleping."}}, "grading": {"independent_work": {"et": "Praktika; konkreetsed ülesanded ja nende sooritamise koht lepitakse kokku praktikakoordinaatori ja -juhendajaga."}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Praktikaaruanne ja kollokvium.\nArvestuse saamiseks on tarvis täita praktikajuhendis kirjeldatud nõuded."}}], "grade_preconditions": {"et": "Kokkuleppel juhendajaga."}, "grade_evaluation": {"et": "Kokkuleppel juhendajaga."}, "debt_elimination": {"et": "Kokkuleppel juhendajaga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Kokkuleppel juhendajaga.", "recommended_materials": "Kokkuleppel juhendajaga."}, "participants": {"lecturers": [{"person_uuid": "8c59ae58-a136-1095-7541-908143a707b2", "person_name": "Mats Volberg", "structural_unit": {"code": "HVFI01PF", "name": {"en": "Chair of Practical Philosophy", "et": "praktilise filosoofia õppetool"}, "phone": "+372 737 5317", "address": "r 326, 328\nEST", "street": "r 326, 328", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "3-13"}, "entries": [{"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Palun pöörduge semestri 1-2 nädalal praktikakoordinaator Mats Volbergi poole (mats.volberg@ut.ee), et kokku leppida praktika koht, aeg jt detailid ning vajadusel koostada ja sõlmida praktikaleping."}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {"et": "Praktika töökohal või ülikooli juures vastavalt individuaalselt kokkulepitud ajakavale."}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Praktikakollokvium semestri lõpus, aeg lepitakse kokku semestri jooksul."}}]}, "registration_info": {"audience": {"et": "filosoofia BA kohustuslik aine (alates 2014 sisseastunud) ja valikaine (varem sisseastunud)"}, "min_students": 1}, "parent_uuid": "14c1bd63-53ea-1bdc-2c1f-817082ccc0a3", "parent_code": "FLFI.00.100", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}