{"uuid": "68f65df5-07d2-4ae4-b1d7-b37b37ec5c1c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T16:04:26", "title": {"en": "Key Texts in Estonian Thought", "et": "Eesti mõtteloo tüvitekstid"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 A regular HV", "et": "25/26 S PÕ HV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course consists in independent reading and the discussion of texts in seminars. All students are expected to make 2-3 oral presentations in seminars, to contribute regularly to discussions, and to write an essay on a selected topic in Estonian intellectual history at the end of the course.", "et": "Kursus koosneb tekstide iseseisvast lugemisest ning nende arutamisest seminarides. Kursuse sooritamiseks peetakse seminarides 2-3 ettekannet ja osaletakse aktiivselt diskussioonides. Kursuse lõpuks kirjutatakse temaatiline lühiessee Eesti mõtteloost."}, "objectives": [{"en": "1) To study a particular tradition or central problem in Estonian intellectual history in its local, as well as regional, European and global contexts, on the basis of textual sources", "et": "1) Anda ülevaade Eesti mõtteloo mõnest valitud põhisuundumusest või kesksest probleemist nii selle lähemas kohalikus kui ka kaugemas, euroopalikus ja üleilmses kontekstis eriilmsete kirjalike allikate põhjal. "}, {"en": "2) To learn to analyse the ideas of Estonian authors in their historical, contemporary and future-oriented dimensions", "et": "2) Õppida analüüsima Eesti mõtlejate ideid nii nende ajaloolises, tänapäevases kui ka tulevikulises mõõtmes."}, {"en": "3) To learn to interpret the ideas and sources from different disciplines and spheres of life as contributing to the Estonian intellectual history and to the construction of self-identities in Estonia.", "et": "3) Õppida tõlgendama erilaadilisi erinevatelt teadmis- ja tegevusaladelt pärinevaid mõttekäike ja mõtteallikaid Eesti mõttelugu loovana -- Eesti enesemõtestamist võimaldavana."}], "learning_outcomes": [{"en": "After successfully passing the course, the students have:", "et": "Kursuse läbinud üliõpilane on omandanud:"}, {"en": "1) acquired knowledge of some central traditions or problems in Estonian intellectual history, ", "et": "1) teadmised ühest või mitmest Eesti mõtteloo põhisuundumusest või põhiküsimusest,"}, {"en": "2) acquired the ability to understand and analyse the ideas of Estonian authors in local and international contexts, on the basis of the book series \"Eesti mõttelugu\" and other relevant textual sources.", "et": "2) oskuse mõista ja analüüsida Eesti mõtlejate ideid nii kohalikus kui rahvusvahelises kontekstis nii 'Eesti mõtteloo' sarja raamatute kui ka teiste relevantsete allikate põhjal,"}, {"en": "3) acquired the understanding of historical trajectories and possibilities of constructing the self-identities in Estonia.", "et": "3) arusaamise Eesti enesemõtestamise mõtteloolistest võimalustest ja viisidest."}], "notes": {"et": "Sügissemestril 2025/2026 on kursuse kitsamaks teemaks \"Filosoofilisi debatte ja ideoloogilisi vastasseise Nõukogude Eestis\".\nSeminarid keskenduvad filosoofilistele debattidele ja ideoloogilistele vastasseisudele Nõukogude Eestis. Käsitlemisele tuleb stalinistlik keele- ja luulekriitika (Aira Kaal, Max Laosson, Alfred Koort, Nigol Andresen, Paul Viiding, Johannes Semper), selle lätted marksismis-leninismis ning järelmid poliitiliste repressioonide näol. Stalini-järgsest perioodist tuleb vaatlusele eksistentsialismi- ja võõrandumisdebatt 1960. aastate lõpul, selle vastukajad kirjanduskriitikas, akadeemilises filosoofias ning parteilises kultuuri- ja teaduspoliitikas (Rem Blum, Mihhail Makarov, Eduard Päll, Arvo  Valton, Mati Unt, Vaino Vahing,  Jaak Kangilaski, Nigol Andresen). Kõnealused debatid on seni leidnud käsitlemist peamiselt kirjanduslooliselt. Käesolevate seminaride taotluseks on  neile läheneda pigem filosoofiliselt, tõlgendades marksismi-leninismi (Marx, Lenin, Stalin) kui ka eksistensialismi ja fenomenoloogia (Sartre, Camus, Heidegger) kontekstis. Ühtlasi on eesmärgiks uurida filosoofia ja ideoloogia kokkukõlamise, filosoofia ideoloogilise instrumentaliseerimise ja repressiivse koostoimimise viise, ent ka sellele vastuhakkamist nõukogude ühiskonnas."}}, "grading": {"independent_work": {"et": "Igaks seminariks tuleb läbi lugeda 1-2 teksti vastavalt kursuse kavale ning esitada ettekanne 3-4 seminaris. Ettekande pidaja koostab 1 lk pikkuse käsilehe teesidega, mis jagatakse enne seminari teistele osalejatele."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Hindamine toimub järgmiste kriteeriumide alusel: õigeaegne esitamine, teaduslikule tööle omane ülesehitus (sissejuhatus, põhitekst, kokkuvõte), allikate ja kirjanduse kasutamise oskus (sh viiteaparaadi kasutamine), teksti loogiline ülesehitus, analüüsioskus, sisuline adekvaatsus, korrektne kirjakeel ja vormistus."}}], "grade_preconditions": {"et": "Osalemine vähemalt 11 seminaris; kokkulepitud ettekannete esitamine; kirjaliku eksamitöö (essee) esitamine. \n\nEssee (pikkusega 6-8 lk, 12000-15000 tähemärki) teema kokku leppida õppejõuga. Esitamise tähtaeg 10. jaanuar."}, "grade_evaluation": {"et": "Kursuse lõpphindest moodustavad seminarides osalemine ja ettekanded 50% ja essee 50%."}, "debt_elimination": {"et": "Seminariettekande ärajäämisel (nt haiguse tõttu) anda õppejõule asjaoludest teada, misjärel lepitakse kokku esinemine mõnes teises seminaris.\nEssee hilinemisel õppejõule teada anda; uue tähtaja puhul võetakse hindest 1 pall maha.\nKorduseksam"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "f2b0f0da-f9a0-ff3b-77f5-5ee90a29b7bc", "person_name": "Eduard Parhomenko", "structural_unit": {"code": "HVFI01MO", "name": {"en": "Chair of Intellectual History", "et": "mõtteloo õppetool"}, "level": 4, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-16"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "seminaride temaatiline ajakava tuleb semestri alguseks"}}]}, "registration_info": {"audience": {"et": "Mõtteloo kõrvaleriala, filosoofia valikaine, kõik huvilised"}}, "parent_uuid": "434be895-b336-67f9-a5ca-b30c28dbd25a", "parent_code": "FLFI.05.025", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}