{"uuid": "fdd008ff-8a5c-4faf-fc68-d865ab1d6d3d", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-27T12:17:31", "title": {"en": "Philosophy as a Way of Life: Stoicism Meets Buddhism", "et": "Filosoofia kui elulaad: stoitsism kohtub budismiga"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV Eng", "et": "25/26 K PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 28, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will examine the central tenets of Stoic and Buddhist philosophy and ethics. It includes both theoretical and practical components: we will try out some spiritual practices aimed at supporting the understanding and application of the corresponding ethical attitudes, thereby contributing to living a good and meaningful life.", "et": "Kursus käsitleb stoikute ja budistliku filosoofia ja eetika aluspõhimõtteid. Kursusel on nii teoreetiline kui ka praktiline osa: me katsetame mõningaid vaimseid praktikaid, mille sihiks on toetada vastavate eetiliste hoiakute mõistmist ja ellurakendamist ning aidata kaasa hea ja mõtestatud elu elamisele."}, "objectives": [{"en": "The main goals of this course are: ", "et": "Selle kursuse eesmärgid on:"}, {"en": "* to familiarize students with some of the key concepts and principles of Stoic and Buddhist philosophies;", "et": "* tutvustada stoikute ja budistliku filosoofia põhimõisteid ja aluspõhimõtteid;"}, {"en": "* to demonstrate the relevance of Stoic and Buddhist philosophies in today's world;", "et": "* näidata stoikute ja budistliku filosoofia relevantsust tänapäeva maailmas;"}, {"en": "* to facilitate practical application of Stoic and Buddhist philosophies in students' life, allowing them to apply the discussed ideas to their own life and engage in practices that have a positive effect on their life;", "et": "* toetada stoikute ja budistliku filosoofia ellurakendamist, võimaldades õppijatel kursusel tutvustatud ideid oma elus katsetada ja osaleda praktikates, mille sihiks on õppija elu positiivselt mõjutada; "}, {"en": "* to practice comparison of Westerns and Eastern philosophies by way of cultivating a comparative and critical approach to Stoic and Buddhist philosophy.", "et": "* harjutada lääne ja ida filosoofiate võrdlevat analüüsimist, arendades võrdlevat ja kriitilist lähenemist stoikute ja budistlikule filosoofiale."}], "learning_outcomes": [{"en": "After having successfully completed the course, the student will: ", "et": "Kursuse läbinud üliõpilane:"}, {"en": "* have delved into some of the key concepts, philosophical principles and practices of both Stoicism and Buddhism, and be able to articulate these clearly;", "et": "* on süvitsi uurinud mõningaid stoikute ja budistliku filosoofia võtmemõisteid, alusprintsiipe ning praktikaid ja suudab neid selgelt sõnastada;"}, {"en": "* have applied some insights from Stoic and Buddhist philosophies to their daily lives, and are able to use them as tools for personal growth and self-reflection; ", "et": "* on rakendanud mõningaid stoikute ja budistliku filosoofia tarkusi oma igapäevaelus ning suudab vastavaid harjutusi kasutada isikliku arengu ja eneserefleksiooni tööriistadena;"}, {"en": "* have critically compared the philosophies of Stoicism and Buddhism, identifying both convergences and divergences in their approaches to key concepts such as happiness, suffering, the nature of the self etc; ", "et": "* on võimeline kriitiliselt analüüsima ja võrdlema stoikute ja budistlikku filosoofiat, tuvastades nii ühisjooni kui ka erinevusi nende lähenemiste võtmekontseptsioonides (nt seoses arusaamadega õnnest, kannatusest, \"mina\" olemusest jne); "}, {"en": "* through discussions, writings, and presentations, students will have refined their abilities of communication and argumentations skills;", "et": "* on täiustanud oma suhtlemis- ja argumenteerimisoskusi arutelude ja kirjalike tööde käigus; "}, {"en": "* be able to identify internship possibilities related to the skills obtained in the course.", "et": "* on võimeline tuvastama praktikavõimalusi seoses kursusel omandatud oskustega."}], "notes": {"et": "This course takes as its starting point the insight that philosophy is not (or should not be) merely a theoretical discourse but a way of life that aims to make one's life better. The course has both a theoretical and a practical component: we will learn about different conceptions of a meaningful life and try out some of the practises or exercises that were taken to contribute to living a meaningful life.\n\nIn the first half of the course, we will examine the ethical views of Stoics. Stoic ethics is not just a set of beliefs, but a way of life - it aims to make our lives better and achieve tranquility of mind. To achieve this aim, one has to not only understand and accept the basic tenets of Stoic ethics, but also engage in \"spiritual exercises\" to strengthen and internalize one's intellectual understanding and acceptance. \n \nIn the second part of the course, we will explore some core  tenets of Buddhist thought. More than a collection of ideas, Buddhism is a practical path toward liberating oneself and others from suffering where philosophical understanding, ethical conduct and mind training mutually inform and reinforce one another. \n\nWe will end the course by comparatively analyzing the similarities and differences between Stoic and Buddhist philosophies."}}, "grading": {"independent_work": {"et": "* Reading the assigned materials before the class. \n* Writing 4 short papers (app. 3 pages each)\n* Contributions to Moodle in the case of theoretical components, and entries to the reflection journal in the case of the practical components."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Regular attendance and participation in classroom discussions - prerequisite for passing the course, no more than 2 classes can be missed."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "4 short papers (app. 3 pages) - 20% of the final grade each"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Moodle contributions/reflection journal entries - 20% of the final grade"}}], "grade_preconditions": {"et": "* Regular attendance and participation in classroom discussions (prerequisite for passing the course, no more than 2 classes can be missed).\n* four short papers\n* 2 peer-review sessions\n* Moodle contributions and reflection journal entries"}, "grade_evaluation": {"et": "Requirements include: \n* Regular attendance and participation in classroom discussions - a prerequisite for passing the course; no more than 2 classes can be missed. \n* four short papers (app. 3 pages) - 20% each\n* Moodle contributions/reflection journal entries - 20%"}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "INTRODUCTION: \nStruhl, K.J. 2010. No (More) Philosophy Without Cross-Cultural Philosophy. Philosophy Compass, 5: 287-295.\n\nSTOICISM:\nLucius Annaeus Seneca, Letters on Ethics: To Lucilius.  Translated with an Introduction and Commentary by Margaret Graver and A.A. Long. Chicago and London: The University of Chicago Press, 2017. \nEpictetus, How to be Free: An Ancient Guide to the Stoic Life, translated and with an Introduction by A. A. Long (Princeton University Press). \nJohn Sellars, The Pocket Stoic (The University of Chicago Press). \n\nBUDDHISM:\nPrimary literature\nDhammapada\nMetta Sutta\nMaha-satipatthana-sutta\n...\nSecondary literature\nGarfield, J. L. (2022). Buddhist Ethics: A Philosophical Exploration. Oxford University Press.\nSiderits, M. (2022). Buddha's Teachings as Philosophy. Hackett Publishing.", "recommended_materials": "Secondary literature: \n\nGarfield, Jay L. 2015. Engaging Buddhism: Why It Matters to Philosophy. Oxford University Press. \nGethin, R. (1998). The Foundations of Buddhism. Oxford University Press. \nGunaratana, B. H. (2017). Loving-Kindness in Plain English: The Practice of Metta.Wisdom Publications.\n\nAll reading materials will be available on the course Moodle site."}, "participants": {"lecturers": [{"person_uuid": "9658bb62-ca41-ec1f-275f-8949a267c42c", "person_name": "Riin Sirkel", "structural_unit": {"code": "HVFI01AJ", "name": {"en": "Chair of History of Philosophy", "et": "filosoofia ajaloo õppetool"}, "address": "r 324-325\nEST", "street": "r 324-325", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "3934918f-1c52-daf2-bcc7-ca1340fc21be", "person_name": "Vivian Puusepp", "structural_unit": {"code": "HVFI01TE", "name": {"en": "Chair of Theoretical Philosophy", "et": "teoreetilise filosoofia õppetool"}, "phone": "+372 737 6619", "address": "r 319-321\nEST", "street": "r 319-321", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-39"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Introduction\nStoicism, theory\nStoicism, theory\nStoicism, theory (1st writing assignment)\nStoicism, practice\nStoicism, practice\nStoicism, practice (2nd writing assignment)\nBuddhism, theory\nBuddhism, theory\nBuddhism, theory (3rd writing assignment)\nBuddhism, practice\nBuddhism, practice\nBuddhism, practice (4th writing assignment)\nComparative analysis."}}]}, "registration_info": {"audience": {"et": "Philosophy in Practice MA. Graduate students from other fields of study (including visiting graduate students). Recommended prerequisites: any philosophy course, any course on Buddhism."}, "min_students": 4, "max_students": 20}, "parent_uuid": "639539c4-0d5d-d964-9e08-001a4331c435", "parent_code": "FLFI.01.126", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}