{"uuid": "639539c4-0d5d-d964-9e08-001a4331c435", "code": "FLFI.01.126", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-14T12:24:04", "title": {"en": "Philosophy as a Way of Life: Stoicism Meets Buddhism", "et": "Filosoofia kui elulaad: stoitsism kohtub budismiga"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will examine the central tenets of Stoic and Buddhist philosophy and ethics. It includes both theoretical and practical components: we will try out some spiritual practices aimed at supporting the understanding and application of the corresponding ethical attitudes, thereby contributing to living a good and meaningful life.", "et": "Kursus käsitleb stoikute ja budistliku filosoofia ja eetika aluspõhimõtteid. Kursusel on nii teoreetiline kui ka praktiline osa: me katsetame mõningaid vaimseid praktikaid, mille sihiks on toetada vastavate eetiliste hoiakute mõistmist ja ellurakendamist ning aidata kaasa hea ja mõtestatud elu elamisele."}, "objectives": [{"en": "The main goals of this course are: ", "et": "Selle kursuse eesmärgid on:"}, {"en": "* to familiarize students with some of the key concepts and principles of Stoic and Buddhist philosophies;", "et": "* tutvustada stoikute ja budistliku filosoofia põhimõisteid ja aluspõhimõtteid;"}, {"en": "* to demonstrate the relevance of Stoic and Buddhist philosophies in today's world;", "et": "* näidata stoikute ja budistliku filosoofia relevantsust tänapäeva maailmas;"}, {"en": "* to facilitate practical application of Stoic and Buddhist philosophies in students' life, allowing them to apply the discussed ideas to their own life and engage in practices that have a positive effect on their life;", "et": "* toetada stoikute ja budistliku filosoofia ellurakendamist, võimaldades õppijatel kursusel tutvustatud ideid oma elus katsetada ja osaleda praktikates, mille sihiks on õppija elu positiivselt mõjutada; "}, {"en": "* to practice comparison of Westerns and Eastern philosophies by way of cultivating a comparative and critical approach to Stoic and Buddhist philosophy.", "et": "* harjutada lääne ja ida filosoofiate võrdlevat analüüsimist, arendades võrdlevat ja kriitilist lähenemist stoikute ja budistlikule filosoofiale."}], "learning_outcomes": [{"en": "After having successfully completed the course, the student will: ", "et": "Kursuse läbinud üliõpilane:"}, {"en": "* have delved into some of the key concepts, philosophical principles and practices of both Stoicism and Buddhism, and be able to articulate these clearly;", "et": "* on süvitsi uurinud mõningaid stoikute ja budistliku filosoofia võtmemõisteid, alusprintsiipe ning praktikaid ja suudab neid selgelt sõnastada;"}, {"en": "* have applied some insights from Stoic and Buddhist philosophies to their daily lives, and are able to use them as tools for personal growth and self-reflection; ", "et": "* on rakendanud mõningaid stoikute ja budistliku filosoofia tarkusi oma igapäevaelus ning suudab vastavaid harjutusi kasutada isikliku arengu ja eneserefleksiooni tööriistadena;"}, {"en": "* have critically compared the philosophies of Stoicism and Buddhism, identifying both convergences and divergences in their approaches to key concepts such as happiness, suffering, the nature of the self etc; ", "et": "* on võimeline kriitiliselt analüüsima ja võrdlema stoikute ja budistlikku filosoofiat, tuvastades nii ühisjooni kui ka erinevusi nende lähenemiste võtmekontseptsioonides (nt seoses arusaamadega õnnest, kannatusest, \"mina\" olemusest jne); "}, {"en": "* through discussions, writings, and presentations, students will have refined their abilities of communication and argumentations skills;", "et": "* on täiustanud oma suhtlemis- ja argumenteerimisoskusi arutelude ja kirjalike tööde käigus; "}, {"en": "* be able to identify internship possibilities related to the skills obtained in the course.", "et": "* on võimeline tuvastama praktikavõimalusi seoses kursusel omandatud oskustega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}