{"uuid": "87de3f3d-37b9-7a90-99ac-e6b5da4460c9", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-07T14:16:31", "title": {"en": "The Quest for Being: Navigating Nihilism with Heidegger", "et": "Olemist otsimas: Martin Heidegger ja nihilism"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 S regular HV Eng", "et": "24/25 K PÕ HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "We will read five essays of Heidegger's later writings, spending two classes on each essay. These essays have been selected because they all deal with the rediscovery of meaning within the context of nihilism and modernity. In these essays, Heidegger challenges some of our most basic assumptions concerning our human experience and where we stand in the world today.", "et": "Kursuse käigus loetakse viit Martin Heideggeri hilisesse loominguperioodi kuuluvat esseed, pühendades igale neist kaks seminarikohtumist. Konkreetsed tekstid on valitud lähtudes sellest, et neis kõigis tegeletakse tähenduse taasavastamisega nihilismi ja modernsuse kontekstis. Vaadeldavates esseedes esitab Heidegger väljakutse mõnedele kõige olulisematele aluseeldustele, mis puudutavad inimkogemust ja inimese rolli tänapäeva maailmas."}, "objectives": [{"en": "The aim is to familiarise students with key concepts of Heidegger's later thought. Through the course, participants will become acquainted with certain core ideas throughout Heidegger's philosophy with the aim of cultivating their own thinking in relationship to their own life/existence and scholarly/academic interests. ", "et": "Kursuse eesmärk on tutvustada üliõpilastele Martin Heideggeri hilisema perioodi filosoofia võtmekontseptsioone. Kursuse jooksul tutvutakse Heideggeri filosoofiat läbivate ideedega, mille mõju võiks osalejad ergutada sügavamalt järele mõtlema oma elu/olemise ja teaduslike/akadeemiliste huvide üle. "}, {"en": "As his later thought is generally considered more accessible than his magnum opus \"Being & Time,\" studying the later Heidegger can also serve as a primer for studying his earlier work, including \"Being & Time.\"", "et": "Kuna Heideggeri hilisemaid kirjutisi võib pidada ligipääsetavamaks kui  tema peateost \"Olemine ja aeg\", annab hilise Heideggeri lugemine hea aluse lähenemiseks tema varasematele töödele sh teosele \"Olemine ja aeg\"."}], "learning_outcomes": [{"en": "By the end of the course, students will:", "et": "Kursuse edukalt läbinud üliõpilased on:"}, {"en": "* have learned to engage critically with various core concepts of Heideggerian philosophy,", "et": "* õppinud tundma ja kriitiliselt hindama mitmeid Martin Heideggeri filosoofia põhikontseptsioone,"}, {"en": "* have a basis for approaching other of Heidegger's works,", "et": "* omandanud muudele Heideggeri teostele lähenemiseks vajalikud teadmised,"}, {"en": "* have gained valuable insights into the history of philosophy.", "et": "* saanud väärtuslikke lisateadmisi filosoofia ajaloost."}], "notes": {"et": "* Description of Content\nWe will read five essays of Heidegger's later writings, spending two classes on each essay. These essays have been selected because they all deal with the rediscovery of meaning within the context of nihilism and modernity. In these essays, Heidegger challenges some of our most basic assumptions concerning our human experience and where we stand in the world today. \n\nThese essays deal with: \n*\tthe history of Western philosophy\n*\tthe nature of truth\n*\tnihilism\n*\tmetaphysics\n*\tmeaning-making\n*\tdestiny\n*\tmodern crises\n*\ttechnology\n*\tpoetry contrasted with logic and science\n*\tthe role of philosophy\n\n* Class Structure\nDuring each seminar, we will begin with questions students may have and then proceed to review the homework questions (in pairs and as a group). The remainder of the seminar will be devoted to reading passages of the text aloud and interpreting/discussing them. With two classes per essay, we can proceed at a speed that will facilitate increased depth of discussion and comprehension of the materials."}}, "grading": {"independent_work": {"et": "Preparing for the seminars.\nAssignments: Students will write 300-500 words in answer to 2-3 questions per week on Moodle related to the reading and the themes discussed in class. For the first seminar dealing with a specific essay, the questions will be oriented towards facilitating an understanding of the core concepts. Questions for the second seminar of that essay will focus on students relating themes in the essay to the supplemental reading materials. The aim with all of the questions is to engage students with the material in a way that requires them to show that they have done the reading and thought about its core contents but that also facilitates them applying the ideas to some area of life or thought that is important and personal to them."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Attendance (40%)\n40% attendance: not missing more than one class. \n\nClass participation (20%)\n20% class participation: students are expected to ask questions and make comments in class, to participate in group discussion and one on one discussion, and to be prepared to respond to questions by the instructor concerning the subject matter of the course and to read passages aloud from the texts which also means coming to class with the reading materials at hand. Students should refrain from using their cellphones during the seminar, but computers will be permitted to take notes and read pdf files of the texts (but for these purposes only)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "The assignments (40%) -- demonstrate that the student has read and engaged with the material on more than a superficial level.\n40% written assignments submitted on Moodle: not missing more than one assignment and demonstrating that one has familiarised oneself with the relevant subject matter of the essays (to be determined by the questions of each assignment).\n\nStudents will write 300-500 words in answer to 2-3 weekly questions on Moodle related to the reading and the themes discussed in class. \nFor the first seminar dealing with a specific essay, the questions will be oriented towards facilitating an understanding of the core concepts. \nQuestions for the second seminar of that essay will focus on students relating themes in the essay to the supplemental reading materials. \nThe aim with all of the questions is to engage students with the material in a way that requires them to show that they have done the reading and thought about its core contents, but that also facilitates them applying the ideas to some area of life or thought that is important and personal to them."}}], "grade_preconditions": {"et": "Students can miss at most two classes, two assignments, or one class and one assignment (thus, they cannot miss two classes AND two assignments). If two classes are missed OR if two assignments are missed OR if one class and one assignment are missed, the student will need to write a one-page reflection on a topic to be determined, in order to pass. If a student misses more than two classes/assignments/a mixture of both, barring a medical emergency, getting credit for the course will not be possible."}, "grade_evaluation": {"et": "Students will be graded via attendance (40%), class participation (20%), and demonstrating that they have read and engaged with the material on more than a superficial level via the assignments (40%)."}, "debt_elimination": {"et": "Students can miss at most two classes, two assignments, or one class and one assignment (thus, they cannot miss two classes AND two assignments). If they miss a third class or a third assignment, they will have to write a one-page reflection on the material to be agreed upon by the instructor and the student."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "b11aa6a2-1ed5-4516-83f0-5869f3c982b7", "type": "MOODLE", "code": "FLFI.01.128_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "The five essays:\n\n1. On the Essence of Truth -- What is truth? What makes truth true? \"Essence\" usually brings to mind something enduring, permanent, ultimate -- as does \"truth.\" This essay explores such questions and their relationship to the very roots of our existence.\n\n2. The Thing -- What is a thing? Are things merely objects? What is the difference between entities and things? As Heidegger asks, what, ultimately, can we say about the thinghood of a thing? The essays present a striking image of the interconnectedness present in the human experience and the nature of existence.\n\n3. Building, Dwelling, Thinking -- A traditional saying runs: \"Home is where the heart is.\" When we think of dwelling, we think of home and the life we have built. But we also dwell upon various matters through thinking. Heidegger explores the link between these three dimensions of the human experience in the context of the postwar landscape, where homelessness, empty dwellings, and empty thoughts are on the rise.\n\n4. The Question Concerning Technology -- What is the essence of modern technology? How does modern technology differ from simpler forms of technology, say, in the case of a hydroelectric plant versus a windmill? What of the Greek origin of the word techne? Here, Heidegger beckons us to join him in contemplating our destiny in relation to these questions and more.\n\n5. Conversation Between a Young Man and an Old Man -- In the bleak environment of a prisoners of war camp, a young man finds healing from out of the mysterious vastness of the forest that borders the camp and proceeds to share his insights with an older man. Their dialogue quickly becomes a quest for Being -- a navigation of nihilism\n\nThese essays will be supplemented with selections from the Cambridge Heidegger Lexicon where relevant and from other sources (i.e., Nietzsche, Aristotle, Plato, etc.-- but only short pieces or summaries of relevant concepts).", "recommended_materials": "See Moodle."}, "participants": {"lecturers": [{"person_uuid": "d908b069-8096-aa21-afb4-4f22250a3b98", "person_name": "Karin Kustassoo", "structural_unit": {"code": "HVFI01MO", "name": {"en": "Chair of Intellectual History", "et": "mõtteloo õppetool"}, "level": 4, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": false}, {"person_uuid": "849efafb-9522-adc3-0c61-5fa7a885b25b", "person_name": "Lars Carmine Panaro", "structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-36"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar 1: Introduction to Heidegger: Man and Philosophy\nSeminar 2: On the Essence of Truth (in Basic Writings)\nSeminar 3: On the Essence of Truth (in Basic Writings)\nSeminar 4: The Thing (in Poetry, Language, Thought)\nSeminar 5: The Thing (in Poetry, Language, Thought)\nSeminar 6: Building, Dwelling, Thinking (in Poetry, Language, Thought)\nSeminar 7: Building, Dwelling, Thinking (in Poetry, Language, Thought)\nSeminar 8: The Question Concerning Technology (in The Question Concerning Technology and Other Essays)\nSeminar 9: The Question Concerning Technology (in The Question Concerning Technology and Other Essays)\nSeminar 10: Evening Conversation: In a Prisoner of War Camp in Russia, between a Younger and an Older Man (in Country Path Conversations)\nSeminar 11: Evening Conversation: In a Prisoner of War Camp in Russia, between a Younger and an Older Man (in Country Path Conversations)\nSeminar 12: Looking Back and Looking Ahead"}}]}, "registration_info": {"audience": {"et": "All students from all fields, BA students preferably from 2nd and 3rd year. Familiarity with existentialism would be helpful."}, "min_students": 3, "max_students": 15}, "parent_uuid": "ab845c1a-4e57-92c5-f3e9-094c40a91c3e", "parent_code": "FLFI.01.128", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}