{"uuid": "89caef9d-9f1b-ca88-169c-85000215cd8c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-15T12:29:19", "title": {"en": "Scandinavian History and Culture", "et": "Skandinaavia maade ajalugu ja kultuur"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course presents a survey of Scandinavian history from the point of view of main societal, political, economic, cultural, religious and ideological processes taking place in Sweden, Norway and Denmark from pre-historic times till the end of the 20th century. The events in all three countries will be approached from a unified platform, bringing out the similarities as well as differences between the Scandinavian countries. Comparative parallels will also be drawn to the history of other European countries (including in the context of the Baltic Sea Area).", "et": "1. Sissejuhatus. Kursuse eesmärk. Kursusega seotud kirjandus.\n2. (Viikingiaeg): Üldiseloomustus. Viikingite retked. Ristiusustamine. Taani, Norra ja Rootsi kuningriikide teke.\n3. (Kõrgkeskaeg): Ühiskondlikud arengujooned. Kirik ja kuningavõim. Sisesõjad. Keskaegse ühiskonna seadused ja tavad.\n4. (Hiliskeskaeg): Must surm. Agraarkriis. Kalmari uniooni tõus ja langus. Kontrolltöö.\n5. (Varauusaeg): Reformatsioon Skandinaavia maades. Sõjad 16-18. sajandil. Rootsi suurriigi ajastu.\n6. (Varauusaeg): Taani-Norra ja Rootsi kuningriigid valgustusajastul. Usuküsimused varauusaegses ühiskonnas. Absolutism. Kontrolltöö.\n7. (19. sajand): Sõjad 19. sajandi alguses. Rootsi-Soome ja Taani-Norra suhted. 1809. ja 1814. aasta tähendus Skandinaavia ajaloos.\n8. (19. sajand): Skandinaavia maad 19. sajandil. Poliitilised parteid, areng demokraatia suunas, industrialiseerumine ja moderniseerumine. Rahvusromantism Põhjamaades.\n9. (20. sajand): Skandinaavia maad sajandivahetusel. Sisepoliitilised ja sotsiaalsed olud. Moderniseerumine ja rahvuslik identiteet.\n10. (20. sajand): Skandinaavia maad Esimese maailmasõja ajal ja sõdadevahelisel ajal.\n11. (20. sajand): Skandinaavia maad Teise maailmasõja ajal. Kontrolltöö.\n12. (20. sajand): Poliitilised ja sotsiaalsed arengud pärast Teist maailmasõda. Heaoluideoloogia ja sotsiaaldemokraatia. \"Põhjamaine mudel\"."}, "objectives": [{"en": "The course gives and overview of Norwegian, Swedish and Danish history and cultural history from the pre-historic times until the end of the 20th century. Both the connections between the three countries as well as the most important events and developments in each country separately will be considered. The focus is on most important societal, political and cultural processes. The history of the three Scandinavian countries will be reviewed together, concentrating on commonalities between them, while also pointing out important differences. At the same time, the status and role of the Scandinavian countries from an European point of view (including in the context of the Baltic Sea Region) will be explained.", "et": "Ülevaatekursus tutvustab Norra, Rootsi ja Taani ajalugu ja kultuurilugu vanimast ajast kuni 20. sajandi teise pooleni, keskendudes nimetatud maade omavaheliste sidemete kui ka iga maa tähtsamate sündmuste ja arengute kirjeldamisele. Tähelepanu all on peamised ühiskondlikud, poliitilised ja kultuurilised protsessid. Kolme Skandinaavia maa ajalugu vaadeldakse koos ning keskendutakse nende ühisjoontele, kuid samas tuuakse välja ka olulisi erinevusi ja eripärasid. Ühtlasi selgitatakse Skandinaavia maade positsiooni ja rolli Euroopa ajaloo vaatenurgast (sh Läänemere regiooni kontekstis)."}], "learning_outcomes": [{"en": "After the completion of the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- understands the main features of the historical and cultural-historical development in Denmark, Norway and Sweden;", "et": "- tunneb Norra, Rootsi ja Taani ajaloo ja kultuuriajaloo põhilisi arengujooni käsitletaval perioodil;"}, {"en": "- summarizes and critically comments upon the course literature, and, proceeding from that, the main problems connected to the study of history of these periods;", "et": "- refereerib ja kommenteerib kriitiliselt kursuse kohustuslikku kirjandust ning lähtuvalt sellest peamisi probleeme, mis on seotud vastavate perioodide ajaloo uurimisega;"}, {"en": "- presents the studied materials in the form of group work, compares these to each other and brings out commonalities and points of difference;", "et": "- tutvustab grupitöö vormis läbitöötatud materjale, võrdleb neid üksteisega ning toob välja ühisosi ja erinevusi;"}, {"en": "- is able to analyse the connections and differences between cultural traditions in different Scandinavian countries, and sees their importance for getting an insight into modern society and mentality;", "et": "- oskab näha ning tõlgendada seoseid ja erinevusi erinevate Skandinaavia maade kultuuritraditsioonide vahel ning nende olulisust tänapäevase ühiskonna ja mentaliteedi seisukohast;"}, {"en": "- compares and analyzes the connections and differences in the history of the three Scandinavian countries.", "et": "- võrdleb ja analüüsib seoseid ja erinevusi kolme Skandinaavia maa ajaloos."}], "notes": {"et": "Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}}, "grading": {"independent_work": {"et": "Kohustuslikud ülesanded:\n1) Individuaalne töö: ettekanne valitud teemal 16.-18. sajandi ainetel. Teemad ja juhised tehakse teatavaks pärast 1. kontrolltööd.\n2) Grupitöö: ettekanne kõigi gruppide jaoks ühisel teemal ja arutelu ühisel seminaril 19.-20. sajandi ainetel. Teema ja juhised tehakse teatavaks pärast 2. kontrolltööd.\n3) Teha positiivsele tulemusele kõik mittehindelised testid \"Kordamisküsimused\"."}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Eksamihinne kujuneb kolme kontrolltöö hinnete põhjal. \nA = 91-100% õigeid vastuseid.\nB = 81- 89% õigeid vastuseid.\nC = 71-79% õigeid vastuseid.\nD = 61-69% õigeid vastuseid.\nE = 51-59% õigeid vastuseid.\nF = 0-50% õigeid vastuseid."}}], "grade_preconditions": {"et": "Eksamihinde saamise eelduseks on, et kõik kontrolltööd on kirjutatud positiivsele hindele ja kõik kohustuslikud ülesanded (kordamistestid, ettekanne, grupitöö) on tehtud."}, "grade_evaluation": {"et": "Eksamihinne kujuneb kontrolltööde hinnete põhjal."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub individuaalsel kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Ühe nädala jooksul pärast hindelise ülesande täitmist."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "bfa80170-e08f-4661-aded-30234f5b6cdb", "type": "MOODLE", "code": "FLGR.06.155", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Moodle'i raamatud ja audiovisuaalsed materjalid.", "recommended_materials": "Sulev Valdmaa, Põhjamaade ajalugu. Valikaine õpik gümnaasiumile (Avita, 1998)\nHarald Gustafsson, Nordens historia: En europeisk region under 1200 år (Lund: Studentlitteratur, 2007)\nKnut Helle jt., The Cambridge History of Scandinavia: Volume 1: Prehistory to 1520 (Cambridge\nUniversity Press, 2003)\nByron J. Nordstrom, Scandinavia since 1500 (University of Minnesota Press, 2000)\nT. K. Derry, A History of Scandinavia: Norway, Sweden, Denmark, Finland and Iceland (University of Minnesota Press, 2000)"}, "participants": {"lecturers": [{"person_uuid": "5abecf28-8fb1-033e-b2ea-7a1f4a9b371c", "person_name": "Maiu Elken", "structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 30}, "parent_uuid": "f4604193-4730-a2d0-adba-ce36cd9a54b5", "parent_code": "FLGR.06.155", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}