{"uuid": "ae71336d-2523-98c8-2b3c-fb4e78c43480", "code": "hv-2018-autumn-fulltime-p1-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Theory of Spanish III", "es": "Lexicología del español", "et": "Hispaania keele teooria III"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "18/19 A regular part 1 3 CP HV", "et": "18/19 S PÕ 1. osa 3 EAP HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "es", "et": "hispaania keel", "en": "Spanish"}], "description": {"en": "The course deals with Spanish lexicology and to a lesser extend with semantics and lexicography.\nThe second part of the course is focused on the syntax of the Spanish language. It includes a theoretical overview of the main syntactic categories and functions  as well as exercises in syntactic analysis.", "es": "Este curso abarcará aspectos teóricos de la lexicología (y en menor medida semántica y lexicografía) y aspectos prácticos útiles para los hablantes de español como L2.\nLa segunda parte trata de la sintaxis del espanol, el curso incluye tanto un panorama teorico de las categorias y funciones sintacticas como ejercicios del analisis sintactico de oraciones.", "et": "Kursus koosneb kahest osaainest: hispaania keele leksikoloogiast ja süntaksist. Leksikoloogia annab ülevaate hispaania keele sõnavara käsitlusest. \nSüntaksi kursusel tutvutakse lauseõpetuse teooriaga ja analüüsitakse erinevat tüüpi liht- ja liitlauseid."}, "objectives": [{"en": "The purpose of the course is to introduce the students to the lexicology of the Spanish language, and to a lesser extend to lexicography and semantics. The course will deal with practical issues as well as more practical ones. The practical part will be specially interesting for L2 speakers of Spanish.", "es": "El objetivo de este curso es familiarizar al alumno con la lexicología del español, y en menor medida con la lexicografía y la semántica. Se abordaran tanto cuestiones teóricas de lexicología general, como cuestiones prácticas útiles para hablantes de español como L2.", "et": "Kursuse eesmärgiks on tutvuda leksikoloogia aluste ja põhimõistetega, puudutades ka leksikograafiat ja semantikat. Kursus koosneb teoreetilisest ja praktilisest osast. "}, {"en": "The purpose of the second part of the course is to provide the students with knowledge of the main syntactic categories and functions in Spanish, and skills for applying theoretical knowledge in the syntactic analysis of sentences in Spanish.", "es": "El objetivo de la segunda parte del curso es dar a conocer las principales categorias y funciones sintacticas del espanol y adquirir habilidad en la aplicacion de los conocimientos teoricos  para el analisis sintactico de oraciones en espanol.", "et": "Kursuse teise osa eesmärk on anda teadmised hispaania keele süntaksi põhikategooriatest ja süntaktilistest funktsioonidest ning anda oskused, kuidas teoreetilisi teadmisi rakendada liht- ja liitlausete süntaktiliseks analüüsiks."}], "learning_outcomes": [{"en": "After passing the course the students:", "es": "Al final del curso, el estudiante,", "et": "Ainekursuse läbinud üliõpilane:"}, {"en": "1) are aquainted with the basic concepts of lexicology and different aspects of Spanish vocabulary;", "es": "--Tendrá una visión de conjunto de la lexicología y el léxico del español ", "et": "1) tunneb leksikoloogia põhimõisteid ja hispaania sõnavara erinevaid aspekte;"}, {"en": "2) are acquainted with the very basics of semantics and lexicography;", "es": "--Estará familiarizado con los conceptos básicos de la semántica y la lexicogarfía", "et": "2) on tutvunud semantika ja leksikograafia alustega;"}, {"en": "3) have knowledge of the main syntactic categories and functions in Spanish and are able to apply this knowledge in the syntactic analysis.", "es": "--Conoce las principales categorias y funciones sintacticas del espanol y es capaz de aplicar los conocimientos teoricos para realizar un analisis sintactico de oraciones simples y compuestas.", "et": "3) tunneb peamisi hispaania keele süntaktilisi kategooriaid ja süntaktilisi funktsioone ning oskab rakendada teoreetilisi teadmisi liht- ja liitlausete süntaktiliseks analüüsiks."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "due_date": "2018-12-04", "description": {"et": "El título de  la redacción final es \"La riqueza del léxico, una bendición y un dolor de cabeza.\" \nEn este escrito: \n\n*se demuestra que se conoce cómo se forma y se organiza el léxico de una lengua\n      *se usan los términos adecuados que se han empleado en las clases\n      *se traen ejemplos acertados sobre los fenómenos mencionados\n      *se analizan ambos aspectos nombrados en el título (lo positivo y lo complicado)\n\n*los contenidos se organizan de una manera lógica que toma en consideración al lector\n      *se empieza por una introducción que postula las ideas principales tratadas\n      *en el contenido, se definen los términos específicos usados cuando aparecen por primera vez. Ideas diferentes se tratan en párrafos separados, usando elementos de cohesión textual.\n      *en la presentación de ideas, se va desde lo más general hasta lo más específico, se traen ejemplos, se sintetizan los aspectos diferentes mencionados.\n      *se termina con una conclusión que resume lo anterior y destaca lo más importante, especialmente las conclusiones a las que ha llegado la autora con la discusión anterior. No se introducen ideas nuevas en la conclusión.\n\n*El lenguaje empleado es apto para un registro académico. En otras palabras, se evita el uso de palabras demasiado generales (p.ej., hacer, tener, cosa) o coloquiales (p.ej., \"un montón de algo\"), se comprueba la adecuacia del vocabulario al contexto concreto necesario, se evitan las repeticiones. Los errores gramaticales no impiden la comprensión, los errores ortográficos son suficientemente escasos para no llamar la atención y no aludir a la negligencia."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "due_date": "2018-12-18", "description": {"et": "En la segunda versión, hay que tomar en cuenta los comentarios recibidos para mejorar la primera versión. Además, tener presente lo mismo que en la versión anterior."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2018-12-11", "description": {"et": "Entre las dos versiones de la redacción final, cada participante lee los escritos de dos compañeras y les proporciona crítica constructiva, dando comentarios que les ayudarían a mejorar sus redacciones. Hay que tener en cuenta los criterios presentados para los textos."}}], "grade_preconditions": {"et": "Osalemine vähemalt 75% praktikumidest ja jooksvate tööde õigeaegne esitamine."}, "grade_evaluation": {"et": "Hinne kujuneb kontrolltööde või muude jooksvate tööde hinnete ja kursuse lõpus sooritatud eksamite koondhindena."}, "debt_elimination": {"et": "Vastavalt ÕKE-le."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "recommended_materials": "Leksikoloogia:\n1. De Miguel, E. (2008). Panorama de Lexicología. Barcelona: Ariel. \n2. Alvar, M. Introducción a la lingüística española. Ariel, Barcelona 2000\n3. Gómez Torrego, L. El léxico en el español actual: uso y norma. Arco Libros, Madrid 1998"}, "participants": {"lecturers": [{"person_uuid": "b8049028-e668-ca0c-ab5d-0c9c0674083d", "person_name": "Mari Kruse", "structural_unit": {"code": "HVLC", "name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "email": "keeled@ut.ee", "webpage_url": "https://maailmakeeled.ut.ee", "address": "Lossi 3\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 3", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2018-09-04", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "La lingüística y sus subciencias: Lexicología, lexicografía, semántica y otros. Conceptos preliminares.\nEl concepto de palabra. Notas semánticas sobre el léxico. \nElementos constitutivos del léxico español: sustrato, estrato, superestrato, adstrato. La variación lingüística. \nNeología y pérdida léxica y semántica.  \nRelaciones lexicales: sinonimia, homonimia, paronimia etc. \nProcedimientos de multiplicación léxica: Derivación, composición, parasíntesis y reducción fónica. \nDiferentes tipos de composición y derivación\nCorpus lingüísticos y cuantificación del léxico.\nLa clasificación del léxico y la lexicografía. Los diccionarios."}}]}, "registration_info": {"audience": {"et": "Hispaania keele ja kirjanduse bakalaureuseõppe üliõpilased (erialamoodul)"}, "min_students": 3, "max_students": 20}, "parent_uuid": "32cda2f4-a184-8e64-7907-d914640efd5b", "parent_code": "FLGR.03.260", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}