{"uuid": "bc2a00cf-b327-3e4b-1f1d-20366f03caff", "code": "FLGR.03.149", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical French I", "et": "Prantsuse keele praktikum I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Working on text material in French (literature, media, vulgarization); exercises to train the vocabulary, the pronunciation, phonetic transcription etc.  Descriptive materials to improve clear knowledge of pronunciation and text mechanisms. Analysis of text content and structure, text types, language registers and other linguistic means in their connection with the aim of the text.", "et": "Töö prantsuskeelse tekstimaterjaliga (ajakirjandus, ilukirjandus, aimeteksid); harjutused sõnavara, sõnaraamatute, häälduse, foneetilise  transkribeerimise jms kohta.  Kirjeldav materjal teadlikkuse tõstmiseks hääldusest ja tekstimehhanismidest. Tekstide sisu ja struktuuri analüüs, tekstitüübid, keeleregistrite jm keeleliste vahendite seos teksti eesmärgiga."}, "objectives": [{"en": "Correction of the principles and practics of the pronunciation of French; training understanding and analyzing of diverse oral and written texts in French", "et": "Prantsuse keele hääldusprintsiipide ja praktika täpsustamine; prantsuskeelsest suulisest ja kirjalikust tekstist arusaamise ning erinevate tekstide analüüsimise harjutamine"}], "learning_outcomes": [{"en": "The student successfully attended the course ", "et": "Õppeaine edukalt läbinud üliõpilane: "}, {"en": "- has an overview of problems related to the French pronunciation and oral communication ;", "et": "- on teadlik suulise väljendusega seotud probleemidest prantsuskeelsel suhtlemisel"}, {"en": "- is able to note different mechanisms in texts which can be used to describe the text type, lexical links, language registers, etc;", "et": "- oskab tähelepanu pöörata tekstides esinevatele mehhanismidele, mille abil saab kirjeldada teksti tüüpi, selles esinevad leksikaalseid seoseid, keeleregistreid jne"}, {"en": "- has a primary knowledge of analyzing texts' thematic and structure", "et": "- omab algteadmisi sellest, kuidas analüüsida teksti temaatikat ja struktuuri"}, {"en": "- has knowledge to use French language specific diacritic signs and the IPA symbols for phonetic transcription of French", "et": "- oskab kasutada prantsuse keele spetsiifilisi diakriitilisi märke ja foneetiliseks transkriptsiooniks IPA erisümboleid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}