{"uuid": "fdffd50c-3d1b-3517-aaef-c0ea70fa85e0", "code": "FLGR.01.138", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of English-Speaking Countries", "et": "Inglise keelt kõnelevate maade ajalugu"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is an introduction to the main events and persons who have shaped British history, their historical importance and the role they have played in determining the course of British history from prehistoric times to the present. The course is richly illustrated with pictorial material.", "et": "Kursuse jooksul käsitletakse briti ajaloo kujunemisel määravaks osutunud sündmusi ja isikuid ülevaatlikul viisil, tuues välja nende ajaloolise tähtsuse ja rolli, mida nad mängisid sündmuste arengus alates eelajaloost kuni tänapäevani. Kursust illustreerib rikkalik pildimaterjal."}, "objectives": [{"en": "The aim of the course is to give an overview of the history of Britain and the colonies and dominions of the British Empire to the extent necessary for following British cultural history and providing a basis for studying English literature and the history of the English language within the framework of the BA and MA programmes at the English Department. The course and all the materials are in English.", "et": "Kursuse eesmärgiks on anda ülevaade Suurbritannia ja Briti impeeriumi erinevate kolooniate ja hilisemate dominioonide ajaloost ulatuses, mis võimaldaks üliõpilastel orienteeruda inglise keelt kõnelevate maade kultuuriloos ja oleks baasiks nii inglise kirjanduse kui ka inglise keele ajaloo omandamisel inglise filoloogia bakalaureuse ja magistratuuri õppekavade raames. Kursust loetakse  ja kursuse materjalid on inglise keeles."}], "learning_outcomes": [{"en": "By the end of the course the student should have a grasp of the main events and key players in British history, be able to place them in the proper historical context and have an overview of the mutual historical and cultural ties between the English-speaking countries.", "et": "Kursuse lõpuks on peaks üliõpilane olema võimeline orienteeruma briti ajaloo tähtsündmustes ja -isikutes, suutma panna nad ajaloolisesse konteksti ja omama ülevaadet inglise keelt kõnelevate maade omavahelistest ajaloolistest ja kultuurilistest seostest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}