{"uuid": "ba41d3b6-d832-00a5-cd16-90a2f04d1c69", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-06T08:28:00", "title": {"en": "Bachelor's Thesis or Bachelor's Exam", "et": "Bakalaureusetöö või bakalaureuseeksam"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC05", "structural_unit_name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 146, "individual_work": 10, "internship": 0}, "prerequisites": [{"required": false, "uuid": "66ecc51c-aa60-e55b-e450-4ede62e699e1", "code": "FLGR.05.300", "title": {"en": "Bachelor's Seminar and Practical Training", "et": "Bakalaureuseseminar ja praktika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "ru", "et": "vene keel", "en": "Russian"}], "other_languages": [{"code": "pl", "et": "poola keel", "en": "Polish"}, {"code": "cs", "et": "tšehhi keel", "en": "Czech"}], "description": {"en": "BA thesis is the first independent research that resolves a feasible task for the third-year student on Russian language, literature, or culture, the results of which will be determined at a public defence. Firstly, the student chooses the field of study interesting and suitable for him or her between linguistics; then the student chooses, with the help of the supervisor, a specific scientific task and the appropriate methods; then generates work structure. The drafts of BA thesis chapters will be discussed with the supervisor who directs the student's work.\nBA exam is a recapitulation of the material in Russian language, literature and Slavic studies which were studied during three years. The questions for the exam are available in the SIS.", "et": "Bakalaureusetöö on esimene iseseisev uurimus, milles lahendatakse üliõpilasele jõukohane teaduslik ülesanne keeleteaduslikul või kirjandus-/ kultuuriteaduslikul teemal ja mis lõpeb töö avaliku kaitsmisega. Esmalt valib üliõpilane teda huvitava uurimisprobleemi, siis valib juhendaja toel konkreetse teadusülesande ning selle lahendamise meetodid, arendab välja töö struktuuri. Peatükkide kavandit arutatakse samuti juhendajaga, kes suunab üliõpilase tööd.  \nBakalaureuseeksam on kokkuvõte kolme aasta vältel omandatud materjalist vene keele, vene kirjanduse ja slaavi filoloogia alal. Üliõpilane valmistub eksamiks lähtudes  juhendis ära toodud küsimuste nimekirjast, mis on toodud ÕISis."}, "objectives": [{"en": "The completing a BA thesis gives students the opportunity to:", "et": "Bakalaureusetöö kirjutamine annab üliõpilastele võimaluse:"}, {"en": "- choose field of study interesting and suitable for him or her between linguistics, literary criticism or cultural studies; ", "et": "-\tvalida enda jaoks huvitava ja meelepärase uurimisproblemaatika kas keele- või kirjandusteaduse alal;"}, {"en": "- develop the ability to independently pose a topical research question, to gather and interpret information, to complete their practical skills in creating a scientific text;", "et": "- arendada oskust iseseisvalt sõnastada aktuaalset uurimisküsimust, koguda informatsiooni ning seda tõlgendada, täiendada praktilisi oskusi teadusteksti loomisel;"}, {"en": "- deepen the knowledge about the main research methods and about the different possibilities of analysis in the chosen field of study", "et": "- süvendada teadmisi valitud uurimisvaldkonnas esinevatest analüüsivõimalustest ja põhilistest meetoditest;"}, {"en": "Preparing to pass a Bachelor exam, the student recapitulates on a deeper level his or her knowledge in Russian language, Russian literature and Slavic studies; develops the abilities to express him- or herself.", "et": "Bakalaureuse eksamiks ette valmistades kordab üliõpilane süvendatult kolme aasta vältel omandatud erialaseid teadmisi, täiendab oma eneseväljendamise võimeid ja oskusi."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "A student who has defended a BA thesis successfully:\n- has the main practical skills and a grasp of the theoretical principles to follow in academic research;\n- is able to orient oneself in the methodological principles of compiling a scientific text;\n- can independently raise a research question, carry out analyses and interpret the results;\n- is able to gain information needed in his or her research using appropriate methods and tools.\nA student who has passed a BA exam successfully has recapitulated his or her knowledge in Russian language, Russian literature and Slavic studies on a deeper level; has developed the abilities to express him- or herself.", "et": "Bakalaureusetööd edukalt kaitsnud üliõpilane:\n- teab peamisi praktilisi võtteid ning teoreetilisi põhimõtteid koostamaks akadeemilist uurimistööd;\n- suudab orienteeruda teadusteksti koostamise metoodilistes põhimõtetes;\n- suudab iseseisvalt püstitada uurimisküsimuse, teostada analüüsi ning tõlgendada tulemusi;\n- oskab hankida uurimistööks vajamineva informatsiooni kohaseid meetodeid ja vahendeid kasutades.\nBakalaureuseeksami edukalt sooritanud üliõpilane:\n-\ton värskendanud kolme aasta vältel omandatud erialaseid teadmisi;\n-\toskab kokkuvõtlikult ja veenvalt vastata talle esitatud küsimustele;\n-\ttunneb erialast terminoloogiat ja teaduskeelt."}], "notes": {"et": "Praktiline info üliõpilasele leidub slavistika osakonna lehel https://maailmakeeled.ut.ee/et/slavistika/oppimine \nLõputööde kirjutamise-kaitsmise nõuded, lihtlitsentsi vormi lõputöö elektrooniliseks avaldamiseks ja BA eksami küsimused leitakse Moodle'is.\n\n"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "BAKALAUREUSEEKSAM tehakse  kolme aasta vältel omandatud materjali põhjal vene keele, vene kirjanduse ja slaavi filoloogia alal. Üliõpilane saab igast etteantud valdkonnast ühe küsimuse ja vastab nendele kirjalikult. Komisjon hindab igat osa eraldi ja paneb koondhinde.\nVäljavõte õppekorralduseeskirjast:\n93. Eristava hindamise puhul eristatakse õppijate õpiväljundite saavutatuse taset järgmise skaala alusel:\n93.1. hinne A ehk \"suurepärane\" - silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine;\n93.2. hinne B ehk \"väga hea\" - õpiväljundite saavutamine väga heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused;\n93.3. hinne C ehk \"hea\" - õpiväljundite saavutamine heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes avaldub ebakindlus ja ebatäpsus;\n93.4. hinne D ehk \"rahuldav\" - õpiväljundite saavutamine piisaval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus;\n93.5. hinne E ehk \"kasin\" - olulisemate õpiväljundite saavutamine minimaalselt lubataval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisil, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus;\n93.6. hinne F ehk \"puudulik\" - õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Bakalaureusetööd hindab kaitsmiskomisjon, kuulates ära üliõpilase sissejuhatava sõnavõtu, retsensendi arvamuse, akadeemilise diskussiooni, juhendaja arvamuse. \nKoondhinne pannakse välja järgmiste kriteeriumite alusel:\n- uurimuse eesmärgipüstitust, käsitletava allikmaterjali ja kasutatud teaduskirjanduse vastavust uuritavale teemale;\n- kasutavate uurimismeetodite sobivust käsitletavale materjalile, nende rakendamise järjekindlust;\n- teoreetiliste viidete ja ülevaadete kooskõla praktilise analüüsiga;\n- töös esitatud andmete täpsust ja järjekindlust;\n- töö ülesehitust, erinevate osade tasakaalu;\n- töö tulemuste sõnastamist ja nende vastavust eelnevalt püstitatud eesmärkidele;\n- töö vormistust, keelelist korrektsust ning terminoloogilist täpsust;\n- töö suulist kaitsmist: töö tutvustuse ülesehitust ja esitlust, vastamist retsensendi küsimustele.\n- tööprotsessi läbipaistvust, andmekäitluse ja tehnoloogiliste abivahendite kasutamise eetiliste põhimõtetega arvestamist, tähtaegadest kinnipidamist. \n"}}], "grade_preconditions": {"et": "Õppekava täitmine täies mahus ning lõputöö esitamine."}, "grade_evaluation": {"et": "Kaitsmine:\n1. Vastavalt kehtivale TÜ õppekorralduseeskirjale lõpeb bakalaureusetöö kirjutamine avaliku kaitsmisega.\n2. Juhendaja lubab töö kaitsmisele.\n3. Kaitsmine toimub avaliku diskussioonina retsensendi ja bakalaureusekraadi taotleja vahel.\n4. Peale kaitsmist otsustavad kaitsmisnõukogu ja retsensent, millist hinnet bakalaureusetöö väärib. Juhendaja arvamus võetakse arvesse."}, "grade_conditions": {"A": {"et": "Teema keskendub eriala selgelt defineeritud aspektile, probleemipüstitus on täpne ning näitab selget mõistmist eriala probleemistikust. Tööprotsess on olnud hästi organiseeritud ja läbipaistev. Töö on eeskujulikult struktureeritud, selles ei esine loogilisi vasturääkivusi, arutlus on selge ning läbipaistev ning kasutatud erialaseid mõisteid on piisavalt selgitatud. Kokkuvõttes annab töö tunnistust sellest, et selle autor mõistab enda poolt käsitletud probleemi ning valdab töö läbiviimiseks vajalikke oskusi. Töö on kirjutatud suurepärases akadeemilises stiilis, on keeleliselt korrektne ning sisaldab kõiki tarvilikke viiteid. Kasutatud allikad on asjakohased ning usaldusväärsed, nende käsitlus näitab uurimistraditsiooni tundmist. Vormistus vastab kõigile nõuetele. Üliõpilane vastab kaitsmisel retsensendi ja komisjoni küsimustele põhjalikult ning ladusalt demonstreerides uurimisteema ja akadeemilise vene keele valdamist."}, "B": {"et": "Töö võib olla suurepärane mõnest aspektist, kuid teistes aspektides võib esineda puudusi. Üldiselt on tööl \"A\" puhul nimetatud omadused, kuid viidetes esineb väikeseid vajakajäämisi või puudujääke teksti stiilis. Ühtegi puudust ei saa pidada oluliseks.\nTeema keskendub eriala selgelt defineeritud aspektile, probleemipüstitus on täpne ning näitab üldist mõistmist eriala probleemistikust. Tööprotsess on olnud hästi organiseeritud ja läbipaistev. Töö on hästi struktureeritud, selles ei esine loogilisi vasturääkivusi, arutlus on selge ning kasutatud erialaseid mõisteid on piisavalt selgitatud. Töö on kirjutatud heas akadeemilises stiilis, on keeleliselt korrektne ning sisaldab kõiki tarvilikke viiteid. Kasutatud allikad on asjakohased ning usaldusväärsed, nende käsitlus näitab uurimistraditsiooni tundmist. Vormistus vastab kõigile nõuetele. \nÜliõpilane vastab kaitsmisel retsensendi ja komisjoni küsimustele täpselt ning ladusalt demonstreerides uurimisteema ja akadeemilise vene keele valdamist."}, "C": {"et": "Töö ja selle suuline kaitsmine on heal tasemel, kuid mõnda aspekti oleks saanud täiustada. \nTeema keskendub eriala konkreetsele aspektile. Probleemipüstitus on loogiline, kuid pinnapealne, uurimismeetodid sobivad. Tööprotsess on olnud piisavalt organiseeritud ning läbipaistev. Töö on hästi struktureeritud ning väljendab autori arusaamist selle teemast. Kirjandusallikaid on piisavalt, kuid valik on kohati juhuslik. Viidetes võib esineda puudusi ning stiili vigu, kuid need vajakajäämised pole põhimõttelised. Töö vastab vormistusnõuetele, kuid vormistuses võib esineda väiksemaid vigu. Üliõpilane vastab kaitsmisel ammendavalt enamusele retsensendi ja komisjoni küsimustest; spontaanses diskussioonis võib esineda eksimusi ning keelevigu. "}, "D": {"et": "Teema on laialivalguv ja üldsõnaline. Probleemipüstitus on üldsõnaline, esineb mitmeid puudujääke argumentatsioonis ja teaduskirjanduse kasutamises. Tööprotsess on olnud üldiselt läbipaistev. Töö struktuur ei ole optimaalne. Kirjandusallikaid on napilt ja allikate valik on juhuslik. Üliõpilase panus töösse on ebaselge. Viidetes esineb vajakajäämisi ning tekstis läbivalt keelelisi vigu. Üliõpilane vastab kaitsmisel ammendavalt üksnes lihtsamatele retsensendi ja komisjoni küsimustele, spontaanses diskussioonis ei suuda leida sobivaid argumente ning akadeemilises vene keeles esineb läbivalt vigu."}, "E": {"et": "Töö ja selle kaitsmine on minimaalselt lubataval tasemel. Teema sõnastus on ebamäärane ja probleem püstitamata. Kirjandusallikaid on napilt, nende valik on juhuslik ning teemaga seosed küsitavad. Uurimismeetodid on probleemi lahendamiseks küsitavad. Tööprotsess ei ole olnud läbipaistev. Töö struktuur ei ole läbimõeldud ega optimaalne. Töös kasutatud vene keeles esineb läbivalt vigu; vormistus ei järgi viitamisjuhendit. Üliõpilane ei suuda kaitsmisel vastata paljudele retsensendi ja komisjoni küsimustele, akadeemilist vene keelt oskab vähe ning spontaanses diskussioonis seda ei kasuta."}, "F": {"et": "Töö on selgesti puudulik, sisaldab akadeemilist petturlust või loomevargust. Teema ja probleemipüstitus on ebaselged. Autori arusaamises oma teemast esinevad tõsised puudujäägid mis ilmnevad kas töö tekstis või akadeemilise diskussiooni käigus.\nKasutatud on vaid üksikuid kirjandusallikaid või on suurem osa kirjandusallikaid osakonna nõuetele mittevastavad või pole töö teemaga otseselt seotud. Uurimismeetodid on probleemi lahendamiseks sobimatud. Tööprotsessis puudus läbipaistvus. \nTöös kasutatud vene keeles esineb läbivalt vigu, mis teevad tekstist arusaamise keeruliseks; vormistus ei järgi juhendit. Kaitsmisel üliõpilane ei suuda vastata enamusele retsensendi ja komisjoni küsimustele. "}, "mi": {"et": "Töö jäi esitamata "}}, "debt_elimination": {"et": "Vastavalt ÕKEs sätestatud korrale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Lõputöö kaitsmise päeval, vahetult pärast kaitsmiste lõppu."}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": true, "learning_environments": [{"uuid": "df7ccc76-865c-4634-ae33-c1b6ba4ea02b", "type": "MOODLE", "code": "FLGR.05.057", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "3b829e32-a6ec-a511-e270-bd53ff915a87", "person_name": "Elizaveta Sosnovtseva", "structural_unit": {"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "586ef12c-eb84-3eed-47f6-b1fcc7a608ee", "person_name": "Roman Leibov", "structural_unit": {"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "20e7b0bd-f522-5cd2-9895-cdad94d6e13b", "person_name": "Tatjana Stepaništševa", "structural_unit": {"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "0b04e312-2242-34a7-5ad6-040fa9d25309", "person_name": "Anastasiia Ryko", "structural_unit": {"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 1, "time": "2025-05-30", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {}, "description": {"et": "Bakalaureusetööde esitamine. Töö tuleb esitada PDF-failina aadressile viivika.voodla@ut.ee. Paberile trükitud tööd pole vaja esitada.\nPS. \nKoos tööga saata ka BA töö pealkirjad korrektses vene, eesti ja inglise keeles."}}, {"course_week": 1, "time": "2025-06-06", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {}, "description": {"et": "BA-tööde kaitsmine"}}]}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "37183ed0-6142-b86f-e441-afbe9a690bbc", "parent_code": "FLGR.05.057", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}