{"uuid": "1152020a-cdf0-5d89-a89a-46113a889d00", "code": "hv-2017-spring-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T16:27:19", "title": {"en": "Bachelor's Seminar and Bachelor's Thesis", "et": "Bakalaureuseseminar ja bakalaureusetöö"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2017", "et": "2017/2018", "en": "2017/2018"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "17/18 S regular HV", "et": "17/18 K PÕ HV"}}, "general": {"year": {"code": "2017", "et": "2017/2018", "en": "2017/2018"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 144, "individual_work": 8, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "As a result of the bachelor's seminar, an independent research project in English linguistics, English-language literature or culture is written, with the main focus on some narrow and topical issue. The course is meant to support the student throughout the writing process. Theoretical and methodological principles of writing a bachelor's thesis are addressed as well as the tradition of writing academic texts in English. The student learns some practical tips for maximising the efficiency of the writing process and for succeeding in defending the thesis. The seminars are mostly dedicated to analysing and providing feedback on various chapters of students' BA theses.", "et": "Bakalaureuseseminari tulemusena valmib iseseisev uurimus inglise keele, ingliskeelse kirjanduse või maiskonnaloo mõnest kitsamast, uurimist väärivast aspektist. Aine toetab töö kirjutamise protsessi. Käsitletakse bakalaureusetöö kirjutamise teoreetilisi ja metoodilisi aluseid ning ingliskeelsete akadeemiliste tekstide kirjutamise tavasid; antakse praktilisi näpunäited kirjutamisprotsessi edendamiseks ning töö edukaks kaitsmiseks. Olulise osa seminarist moodustab üliõpilaste bakalaureusetöö peatükkide analüüsimine ja tagasisidestamine."}, "objectives": [{"en": "Independent study of a specific research topic from the field of linguistics, literature or culture together with the acquaitance with and the application of academic writing.", "et": "Iseseisva uurimuse kirjutamine inglise keele, ingliskeelse kirjanduse või maiskonnaloo mõnest kitsamast, uurimist väärivast aspektist koos ingliskeelse akadeemilise kirjutamise probleemidega tutvumisega ja sobivate võtete rakendamisega."}, {"en": "Bachelor's seminar gives a student an opportunity ", "et": "Bakalaureuseseminar annab üliõpilastele võimaluse:"}, {"en": "- to familiarise themselves with the research methods in the fields of linguistics, literature and culture that are applied in English-speaking communities;", "et": "- õppida tundma keele, kirjanduse või kultuuri uurimise põhilisi meetodeid ingliskeelses kultuuriruumis;"}, {"en": "- deepen one's knowledge in the selected field of research;", "et": "- süvendada teadmisi valitud uurimisvaldkonnast;"}, {"en": "- develop the ability to formulate a relevant research question and independently collect and interpret information;", "et": "- arendada oskust iseseisvalt sõnastada aktuaalset uurimisküsimust, koguda informatsiooni ning seda tõlgendada;"}, {"en": "- further develop one's practical skills in creating an academic text in English.", "et": "- täiendada praktilisi oskusi ingliskeelse teadusteksti loomisel."}], "learning_outcomes": [{"en": "The student who has successfully completed the course", "et": "Kursuse edukalt läbinud üliõpilane"}, {"en": "- is familiar with the major theoretical principles and practical tips for writing an academic research paper in English;", "et": "- valdab ingliskeelse akadeemilise uurimistöö koostamise peamisi teoreetilisi põhimõtteid ja praktilisi võtteid,"}, {"en": "- is able to find suitable sources for one's research project and determine their credibility;", "et": "- oskab leida uurimistööks sobivaid allikmaterjale ja nende usaldusväärsust hinnata,"}, {"en": "- in cooperation with the supervisor is able to formulate a research question, select a suitable methodology, conduct research as well as analyse and interpret the results;", "et": "- suudab koostöös juhendajaga püstitada uurimisküsimuse, valida sobiva metoodika, viia läbi uurimuse ning analüüsida ja tõlgendada tulemusi,"}, {"en": "- is able to write a well-argued academic text following the principles of Anglo-American writing.", "et": "- suudab luua argumenteeritud akadeemilist teksti lähtudes ingliskeelse akadeemilise kirjutamise tavadest."}], "notes": {"et": "Bakalaureusetöö on uurimuslik töö, mis käsitleb ühte uurimist väärivat erialast probleemi, kasutades vastava teemaga seotud teaduskirjandust. Töö keskendub inglise keele, inglise keeles kirjutatud kirjanduse või inglise keelt kõnelevate maade kultuuri mingile konkreetsele fokusseeritud aspektile ning see kirjutatakse ühe anglistika osakonna õppejõu juhendamisel. Bakalaureusetöö kirjutatakse inglise keeles.  See peab sisaldama konkreetset probleemipüsitust, iseseisvat analüüsi ja sünteesi. Töö järgib ingliskeelse akadeemilise kirjutamise tavasid ja on kirjutatud korrektses inglise keeles. Bakalaureusetöö (6 EAP) põhiteksti maht on orienteeruvalt 25-30 standardlehekülge (1800 tähemärki). Bakalaureusetöö inglise keele kasutus on üks hindamisele kuuluvaid töö aspekte."}}, "grading": {"independent_work": {"et": "Kokkuleppel konkreetse üliõpilase juhendajaga"}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Bakalaureusetöö esimese osa esitamine juhendajale. Hinnatakse peatüki sisu (nt konkreetne probleemipüstitus, alateemade sobivus, loogiline järjestus, käsitlemise põhjalikkus) ja vormi (nt korrektne viitamise süsteem, nõuetekohane vormistus jne), kasutatud allikate sobivust ning nende kriitilist analüüsi."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Bakalaureusetöö teise osa esitamine juhendajale. Hinnatakse peatüki sisu (nt konkreetne probleemipüstitus, alateemade sobivus, loogiline järjestus, analüüsi põhjalikkus, selgete järelduste olemasolu) ja vormi (nt nõuetekohane vormistus, akadeemiline keelekasutus jne)."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Bakalaureusetöö esitamine kaitsmiskomisjonile eellugemiseks. Hinnatakse töö vastavust anglistika osakonna bakalaureusetööde nõuetele (vt õppematerjalide kausta)."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Bakalaureusetöö kaitsmine. Lähtutakse bakalaureusetöö hindamise ja kaitsmise korrast.\n\"A\": Teema keskendub eriala selgelt defineeritud aspektile. Probleemipüstitus on loogiline, meetod sobiv. Kirjandusallikad on piisavad. Näha on üliõpilase individuaalne panus. Uurimistulemused esitatud korrektselt ja sidusalt. Töö on kirjutatud idiomaatilises ja korrektses inglise keeles ning vastab vormistusnõuetele. Üliõpilane vastab kaitsmisel retsensendi ja komisjoni küsimustele põhjalikult ning demonstreerib uurimisteema ja suulise akadeemilise inglise keele valdamist. \n\"B\": Teema keskendub eriala selgelt defineeritud aspektile. Probleemipüstitus on konkreetne, meetod sobiv. Kirjandusallikad on piisavad. Töö on kirjutatud korrektses inglise keeles, kuigi esineb üksikuid vigu. Vastab  vormistusnõuetele, kuid vormistuses võib esineda väiksemaid vigu. Üliõpilane vastab kaitsmisel ammendavalt retsensendi ja komisjoni küsimustele ning demonstreerib oma orienteerumist uurimisteemas ja suulise akadeemilise inglise keele valdamist. \n\"C\": Teema keskendub eriala konkreetsele aspektile. Probleemipüstitus on loogiline, kuid pinnapealne, meetod sobiv. Kirjandusallikaid on piisavalt. Töö on kirjutatud korrektses inglise keeles, kuigi esineb keele- ja vormistusvigu. Üliõpilane vastab kaitsmisel enamusele retsensendi ja komisjoni küsimustele. Üliõpilane esineb korrektses akadeemilises inglise keeles, kuid spontaanses diskussioonis tekib keelevigu.\n\"D\": Teema on laialivalguv ja üldsõnaline. Probleemipüstitus on üldsõnaline. Kirjandusallikaid napilt ja allikate valik on juhuslik. Üliõpilase panus töösse ebaselge. Töös kasutatud inglise keeles ja vormistuses esineb läbivalt vigu. Üliõpilane vastab kaitsmisel ammendavalt üksnes lihtsamatele retsensendi ja komisjoni küsimustele ning teeb suulises akadeemilises inglise keeles läbivalt vigu.\n\"E\": Teema sõnastus on ebamäärane. Kirjandusallikaid napilt, nende seotus tööga küsitav. Uurimismeetodid on probleemi lahendamiseks küsitavad. Töös kasutatud inglise keeles esineb läbivalt vigu; vormistus ei järgi viitamisjuhendit. Üliõpilane ei suuda kaitsmisel vastata paljudele retsensendi ja komisjoni küsimustele. Üliõpilase suuline inglise keel on vigane.\n\"F\": Teema ja probleemipüstitus on ebaselged. Kasutatud on vaid üksikuid kirjandusallikaid või on suurem osa kirjandusallikaid osakonna nõuetele mittevastavad või pole töö teemaga otseselt seotud. Uurimismeetodid on probleemi lahendamiseks sobimatud. Töö sisaldab loomevargust ja üliõpilase enda panus puudub. Töös kasutatud inglise keeles esineb läbivalt vigu, mis teevad tekstist arusaamise keeruliseks; vormistus ei järgi viitamisjuhendit. Üliõpilane ei suuda kaitsmisel vastata enamusele retsensendi ja komisjoni küsimustele. Üliõpilase suuline inglise keel on vigane."}}], "grade_preconditions": {"et": "Bakalaureusetöö kaitsmisele lubamise eeldus on kõigi ülejäänud õppeainete läbimine."}, "grade_evaluation": {"et": "Bakalaureusetööd hinnatakse avalikul kaitsmisel. Avalik kaitsmine toimub inglise keeles. Lõpliku hinde bakalaureusetööle annab kaitsmiskomisjon, kes võtab arvesse retsensendi hindeettepanekut, kaitsmiskomisjoni hinnangut lõputööle ja kaitsmisele ning juhendaja arvamust."}, "debt_elimination": {"et": "Bakalaureusetöö korduskaitsmine saab toimuda kõige varem järgmisel semestril."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Anglistika osakonna bakalaureusetööde nõuded, BA theses, Style Sheet (vt õppematerjalide alt)", "recommended_materials": "Kokkuleppel konkreetse üliõpilase juhendajaga"}, "participants": {"lecturers": [{"person_uuid": "e3fc77e8-c967-740d-2bda-638624785845", "person_name": "Katiliina Gielen", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "8d3a3c6f-f72e-2d16-ec64-bcfbbfcf1645", "person_name": "Natalja Zagura", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-41"}, "entries": [{"time": "2017-09-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Teemalaat"}}, {"time": "2017-11-30", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Ideede esitamine"}}, {"time": "2018-05-08", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Bakalaureusetöö esitamine retsensendile kaitsmisele esitamise loa saamiseks"}}, {"time": "2018-05-22", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Bakalaureusetöö esitamine"}}, {"time": "2018-05-29", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Bakalaureusetöö kaitsmine"}}, {"time": "2018-05-30", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Bakalaureusetöö kaitsmine"}}]}, "registration_info": {"audience": {"et": "Bakalaureusetööd kirjutavad üliõpilased, kes astusid sisse inglise keele ja kirjanduse erialale enne 2008/2009 õ-a või alates 2015/2016 õ-a"}}, "parent_uuid": "3f5adf83-b312-b10c-f45d-07d56b335213", "parent_code": "FLGR.01.268", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}