{"uuid": "dd90b271-ef95-aa5a-0752-e18baa975b77", "code": "hv-2025-autumn-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-12T10:19:15", "title": {"en": "Seminar on Speciality", "et": "Erialaseminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "25/26 A regular HV", "et": "25/26 S PÕ HV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 30, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "es", "et": "hispaania keel", "en": "Spanish"}], "description": {"en": "Requirements for the contents and formulation of an investigation work; developing reading and writing skills in academic Spanish language; working with source materials.", "et": "Teadustööle esitatavad sisulised ja formaalsed nõuded, akadeemilise hispaania keele oskuse arendamine, töö allikatega."}, "objectives": [{"en": "The purpose of the course is to acquire methodological basis for independent investigation in Spanish language, literature or culture. The second objective is to help students specify the topic and approach for their bachelor's project. ", "et": "Anda metodoloogilised alused iseseisvaks uurimistööks hispaania keelt, kirjandust või kultuuri puudutaval teemal.\nAidata konkretiseerida bakalaureusetöö teemat ja fookust. "}], "learning_outcomes": [{"en": "After passing the course the students:", "et": "Ainekursuse läbinud üliõpilane:"}, {"en": "1)\tanalyse the content structure of academic texts: \n- in a text that is new to them, identify the research objectives, arguments of the theoretical part and methods applied for investigation\n- formulate their opinions on whether the argumentation is presented convincingly and if a suitable method is chosen \n- evaluate whether conclusions drawn stem from the argumentation presented in the theoretical and practical part of said text. ", "et": "1) analüüsib akadeemiliste tekstide sisulist ülesehitust: \n- leiab võõrast tekstist uurimistöö eesmärgid, teooriaosa argumentatsiooni ja rakendatud meetodid. \n- sõnastab oma arvamuse argumentatsiooni veenvuse ja meetodi sobivuse kohta. \n- hindab järelduste tõsiseltvõetavust teoreetilises ja praktilise osas esitatud mõttekäikudest lähtuvalt.\n"}, {"en": "2) in the tasks they complete, utilise Spanish language appropriate for academic contexts: \nchoose fitting synonyms, avoid repetitions and generic words. The sentences formulated are not overly simple nor complex. Authoritative dictionaries and corpora are used to check appropriateness.", "et": "2) kasutab esitatavates ülesannetes akadeemilisse konteksti sobivat hispaania keelt: valib adekvaatseid sünonüüme, väldib sõnakordusi ja liiga üldist sõnakasutust. Koostatud laused on liigendatud, aga mitte liialt keerukad. Kontrollib keelelist sobivust tunnustatud sõnaraamatute ja korpuste abiga. "}, {"en": "3) structure presented tasks according to instructions.", "et": "3) struktureerib esitatavate ülesannete tekstid vastavalt juhendile. "}, {"en": "4) use in-text and final references to indicate the source of any ideas and information that are not their own, using APA norms. ", "et": "4) viitab kogu kasutatud allikmaterjalile tekstisiseselt ja bibliograafias, lähtudes APA normidest. "}, {"en": "5) determine a field of linguistics or literature that interests them and formulate a research-worthy question. Put together a preliminary plan for their final paper, including appropriate bibliographical references. Present their plan to the group.", "et": "5) piiritleb end huvitava filoloogilise teemavaldkonna ja sõnastab uurimist vääriva probleemi. Koostab lõputöö kavandi, kaasates asjakohaseid bibliograafilisi allikaid. Esitleb kavandit kaaslastele. "}], "notes": {"et": "Head tudengid!\nKursuse alguseks on tungivalt soovitatav välja mõelda bakalaureusetöö teema ja ligikaudne uurimisküsimus. Kui ei ole plaanis samal õppeaastal tööd kirjutada, on targem kursust võtta hiljem. \nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nIt is highly recommendable to join the course with an approximate idea of what you want to write your paper on. If you do not plan to write your final project (or other extensive scientific text) during the present academic year, you will benefit more from the course at a later time. \nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}}, "grading": {"independent_work": {"et": "Valmistada ette suulised ettekanded:\n1) Ühe lõputöö kriitiline analüüs (sept-okt);\n2) Enda lõputöö teema, bibliograafia, võimalike probleemide jne tutvustus (okt-nov) \n*\nKirjalik töö: vähemalt nelja akadeemilise teksti (teadusartiklit) kokku võttev analüüs (lühikokkuvõte sisust, argumentatsiooni veenvus ja sobivus soovitud lähenemise toetamise seisukohast)."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Ühe lõputöö analüüs:\nA-üliõpilane oskab tööd kriitiliselt hinnata, eristada olulisemaid aspekte vähemolulisest, oskab välja pakkuda võimalikke lahendusi ilmnenud puudujääkidele, oskab hinnata keelelist stiili.\nB-üliõpilane oskab anda analüüsitavale tööle üldiselt adekvaatse hinnangu, eristada olulisemaid aspekte vähemolulisest, hinnata üldiselt ka keelelise stiili asjakohasust.\nC-üliõpilane oskab anda analüüsitavale tööle üldiselt adekvaatse hinnangu, tuua välja olulisemad probleemid ja tugevad küljed, oskab eristada olulist pisiasjadest; oskab välja tuua stiilivigu.\nD-üliõpilane oskab analüüsitavas töös välja tuua häid külgi ja probleeme; oskab näha suuremaid stiilivigu.\nE-üliõpilane oskab analüüsitavas töös välja tuua ilmseid häid külgi ja puudujääke."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Enda lõputöö tutvustus:\nA-üliõpilane oskab hinnata teema sobivust, võimalikke tekkivaid probleeme ja leida neile lahendusi, oskab leida sobivat kirjandust ja seda kriitiliselt hinnata, oskab püstitada töö põhiküsimuse või eesmärgi ja on põhjalikult planeerinud viisi selle saavutamiseks.\nB- üliõpilane oskab valida sobiva teema, osates hinnata võimalikke probleeme seoses teema valikuga, oskab kriitiliselt hinnata kirjandust, oskab püstitada tööle sobiva eesmärgi ja pakkuda välja võimalusi selleni jõudmiseks.\nC-üliõpilane oskab valida sobiva teema, oskab kriitiliselt hinnata kirjandust, oskab püstitada töö põhieesmärgi ja hinnata võimalusi selle saavutamiseks.\nD-üliõpilane oskab välja tuua teema ja kirjanduse valikuga seotud probleeme ja sõnastada töö põhiküsimuse või -eesmärgi.\nE-üliõpilasel on ettekujutus võimalikest teemadest ja kasutatavast kirjandusest, samuti teema täpsemast piiritlemisest."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Teadusartiklite kokkuvõte:\nA- Valitud artiklid on sisuliselt asjassepuutuvad ja nende usaldusväärsust on kriitiliselt hinnatud. Viidete vormistus on korrektne. Üliõpilane toob välja artiklite põhiteesi ja argumentatsiooni ning analüüsib nende sobivust oma tulevase lõputöö teemaosas kasutamiseks. Kirjatöö on asjakohaselt üles ehitatud: sellel on sissejuhatus, teemaarendus ja kokkuvõte. Kasutatud on sobivat keelelist stiili, korrektset vormistust. Töö on esitatud õigeaegselt. \nE- Valitud artiklite seos tulevase lõputöö teemaga on meelevaldne või raskesti hoomatav, aga kirjatükis siiski põhjendatakse seda ja/või selgitatakse, millel valik tugines. Mõne artikli päritolu on raske kontrollida ja nende usaldusväärsuses on kahtlusi, viidetes esineb ebatäpsusi. Üliõpilane on leidnud tekstidest peamised teesid, nende sisuline olulisus jääb veenvalt põhjendamata ja erinevate artiklite argumente ei seostata üksteise ega valitud läbiva teemaga. Kirjatöö ülesehituses ja vormistuses on olulisi puudujääke. Keelekasutus on kõnekeelne või vigane, kasutatud sõnavara sobivust ei ole kontrollitud, esineb sõnakordusi. Töö on esitatud õigeaegselt või kokkuleppel õppejõuga väikese hilinemisega. \nF- Valitud artikleid ei ole piisaval hulgal (väh. 4), need ei pärine usaldusväärsetest allikatest, seost valitud teemaga ei ole selgitatud. Ei ole leitud artiklite peamisi mõtteid ega nende asjakohasust põhjendatud, viited on ebakorrektsed või puuduvad. Töö ülesehitus, vormistus ja/või keelekasutus ei vasta akadeemilise teksti nõuetele. Töö on esitatud suure hilinemisega ja hilinemise osas puudub kokkulepe õppejõuga. \n"}}], "grade_preconditions": {"et": "Osavõtt seminaridest (vähemalt 75%)\n2 suulist ettekannet (ühe lõputöö kriitiline analüüs ja enda lõputöö tutvustus) seminarides vastavalt kursuse algul kokku lepitud tähtaegadele.\nKirjaliku töö esitamine (ühe akadeemilise teksti analüüs) 16. jaanuariks 2023."}, "grade_evaluation": {"et": "Seminaris esitatavad ettekanded, kodutööde esitamine ning kirjalik teadusartiklite kokkuvõte."}, "debt_elimination": {"et": "Vastavalt ÕKE-le."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "b8049028-e668-ca0c-ab5d-0c9c0674083d", "person_name": "Mari Kruse", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Introducción. "}, "description": {"et": "Introducción..\nTipos de texto: texto expositivo. Argumentación."}}, {"course_week": 2, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "Temas y planteamientos"}, "description": {"et": "Temas y planteamientos.\nSemanas 2-4: \nMétodos de investigación. Estructura de artículos científicos."}}, {"course_week": 5, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"et": "Semana 5: \nPresentaciones: análisis de artículos científicos"}, "description": {"et": "Semana 5:\nPresentaciones: análisis de artículos científicos"}}, {"course_week": 6, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "El lenguaje académico. Objetividad y subjetividad. "}, "description": {"et": "El lenguaje académico. Objetividad y subjetividad."}}, {"course_week": 7, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"et": "Integridad científica, principios éticos. "}, "description": {"et": "Integridad científica, principios éticos."}}, {"course_week": 8, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {"et": "Organización del proceso de trabajo. \nConectores como elementos de cohesión. "}, "description": {"et": "Organización del proceso de trabajo.\nConectores como elementos de cohesión."}}, {"course_week": 9, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"et": "Parafraseo. Puntuación."}, "description": {"et": "Parafraseo. Puntuación."}}, {"course_week": 10, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 8, "topic": {"et": "Sinónimos académicos"}, "description": {"et": "Sinónimos académicos.\nClase en el aula de informática"}}, {"course_week": 11, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 9, "topic": {"et": "Boot camp"}, "description": {"et": "Boot camp.\nPrepararemos las presentaciones de proyecto TFG y buscaremos fuentes bibliográficas útiles."}}, {"course_week": 12, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 10, "topic": {"et": "Presentaciones sobre proyectos de TFG"}, "description": {"et": "Presentaciones sobre proyectos de TFG.\nSemanas 12-14"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "ca148b47-7c2d-ac5b-835b-45bdf398bf42", "parent_code": "FLGR.03.205", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}