{"uuid": "89676797-f817-b5d4-6bae-4ed137045264", "code": "hv-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Seminar on Speciality", "et": "Erialaseminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "es", "et": "hispaania keel", "en": "Spanish"}], "description": {"en": "Requirements for the contents and formulation of an investigation work; developing reading and writing skills in academic Spanish language.", "et": "Teadustööle esitatavad sisulised ja formaalsed nõuded, akadeemilise hispaania keele oskuse arendamine."}, "objectives": [{"en": "The purpose of the course is to acquire methodological basis for independent investigation in Spanish language, literature or culture.", "et": "Anda metodoloogilised alused iseseisvaks uurimistööks hispaania keelt, kirjandust või kultuuri puudutaval teemal."}], "learning_outcomes": [{"en": "After passing the course the students:", "et": "Ainekursuse läbinud üliõpilane:"}, {"en": "1)\tare acquainted with the requirements for the contents and formulation of an investigation work;", "et": "1) on tuttav uurimistööle esitatavate sisuliste, formaalsete ja keeleliste nõuetega;"}, {"en": "2)\tknow the specific linguistic characteristics of the academic Spanish language and are able to use them adequately.", "et": "2) tunneb akadeemilises kontekstis kasutatava hispaania keele eripärasid ja oskab end žanrinõuetele vastavalt kirjalikult väljendada."}], "notes": {}}, "grading": {"independent_work": {"et": "Valmistada ette suulised ettekanded:\n1) Ühe lõputöö kriitiline analüüs, tähtaeg lepitakse kokku õppejõuga kursuse alguses (2. okt - 23. okt): \n2) Enda lõputöö teema, bibliograafia, võimalike probleemide jne tutvustus (30. okt või 6. nov)\nKirjalik töö: ühe akadeemilise teksti (teadusartikkel) analüüs (lühikokkuvõte sisust, ülesehituse analüüs, keeleline analüüs, tekstistrateegiate analüüs). Esitada eelistatult  väljatrükitult."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Teadusartikli kirjalik analüüs:\nA- üliõpilane oskab välja tuua artikli põhiteesi ja argumentatsiooni; oskab kirjeldada artikli sisulist mõttearendust, ülesehitust, tekstitüüpi ja tekstistrateegiaid ning neid kriitiliselt hinnata; oskab välja tuua keelelist stiili ja hinnata seda akadeemilise kirjutamise eripärade kontekstis. Analüüs on asjakohaselt ülesehitatud ja kasutatud on sobivat keelelist stiili.\nB- üliõpilane oskab välja tuua artikli põhiteesi ja esitatud argumendid; oskab kirjeldada sisulist ülesehitust, tekstitüüpi ja kasutatud tekstistrateegiaid; oskab välja tuua akadeemilisele tekstile omaseid stilistilisi aspekte. Analüüs on asjakohaselt ülesehitatud ja kasutatud on sobivat keelelist stiili.\nC-üliõpilane oskab välja tuua põhiteesi ja esitatud argumendid; oskab kirjeldada artikli ülesehitust ja tekstitüüpi, oskab analüüsida keelelist stiili. Analüüs on asjakohaselt ülesehitatud.\nD-üliõpilane oskab välja tuua põhiteesi ja esitatud argumendi, oskab kirjeldada teksti ülesehitust ja tekstitüüpi, oskab välja tuua olulisemaid keelelise stiili aspekte.\nE-üliõpilane on mõistnud artikli põhisisu, oskab kirjeldada teksti ülesehitust, oskab välja tuua keelelisi näiteid akadeemilise stiili kohta."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Enda lõputöö tutvustus:\nA-üliõpilane oskab hinnata teema sobivust, võimalikke tekkivaid probleema ja leida neile lahendusi, oskab leida sobivat kirjandust ja seda kriitiliselt hinnata, oskab püstitada töö põhiküsimuse või eesmärgi ja on põhjalikult planeerinud viisi selle saavutamiseks.\nB- üliõpilane oskab valida sobiva teema, osates hinnata võimalikke probleeme seoses teema valikuga, oskab kriitiliselt hinnata kirjandust, oskab püstitada tööle sobiva eesmärgi ja pakkuda välja võimalusi selleni jõudmiseks.\nC-üliõpilane oskab valida sobiva teema, oskab kriitiliselt hinnata kirjandust, oskab püstitada töö põhieesmärgi ja hinnata võimalusi selle saavutamiseks.\nD-üliõpilane oskab välja tuua teema ja kirjanduse valikuga seotud probleeme ja sõnastada töö põhiküsimuse või -eesmärgi.\nE-üliõpilasel on ettekujutus võimalikest teemadest ja kasutatavast kirjandusest, samuti teema täpsemast piiritlemisest."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Ühe lõputöö analüüs:\nA-üliõpilane oskab tööd kriitiliselt hinnata, eristada olulisemaid aspekte vähemolulisest, oskab välja pakkuda võimalikke lahendusi ilmnenud puudujääkidele, oskab hinnata keelelist stiili.\nB-üliõpilane oskab anda analüüsitavale tööle üldiselt adekvaatse hinnangu, eristada olulisemaid aspekte vähemolulisest, hinnata üldiselt ka keelelise stiili asjakohasust.\nC-üliõpilane oskab anda analüüsitavale tööle üldiselt adekvaatse hinnangu, tuua välja olulisemad probleemid ja tugevad küljed, oskab eristada olulist pisiasjadest; oskab välja tuua stiilivigu.\nD-üliõpilane oskab analüüsitavas töös välja tuua häid külgi ja probleeme; oskab näha suuremaid stiilivigu.\nE-üliõpilane oskab analüüsitavas töös välja tuua ilmseid häid külgi ja puudujääke."}}], "grade_preconditions": {"et": "Osavõtt seminaridest (vähemalt 75%)\n2 suulist ettekannet (ühe lõputöö kriitiline analüüs ja enda lõputöö tutvustus) seminarides vastavalt tähtaegadele.\nKirjaliku töö esitamine (ühe akadeemilise teksti analüüs) 21. jaanuariks 2019. Esitada eelistatult väljatrükitult."}, "grade_evaluation": {"et": "Võetakse arvesse aktiivset osalemist seminaris ja kodutööde sooritamist, seminaris esitatavaid ettekandeid ning kirjalikku teadusartikli analüüsi. Teadusartikli analüüs annab 50% lõpphindest."}, "debt_elimination": {"et": "Vastavalt ÕKE-le."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "recommended_materials": "1. Eco, Umberto, Cómo se hace una tesis. Barcelona, Gedisa Editorial, 2006\n2. Sanchez Lobato, Jesús (coord.), Saber escribir. Madrid, Aguilar, 2006\n3. Montolio, Estrella (coord.), Manual práctico de escritura académica. Vol. I-III. Barcelona, Editorial Ariel, S.A, 2003\n4. Cervera Rodríguez, A. jt. Saber escribir. Madrid, Santillana Ediciones, 2006\n5. Walker, Melissa, Cómo escribir trabajos de investigación. Barcelona, Gedisa, 2005"}, "participants": {"lecturers": [{"person_uuid": "7e1ff5fc-8ffb-3d25-444b-b0af3d2c4a04", "person_name": "Triin Lõbus", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2018-09-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatus. Tekstitüübid. Akadeemilise kirjutamise eripärad."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "1.-6. Tekstitüübid. Akadeemiline kirjutamine: stiil, teksti sidusus; subjektiivsus ja objektiivsus akadeemilises tekstis.\n7.-12.  Tööde kriitiline analüüsimine. Uurimistöö teema ja uurimismeetodi valimine; enda teema ja meetodi tutvustamine .\n13.-15. Vormistuslikud nõuded bakalaureusetööle; töö ülesehitus; tsiteerimine, viitamine, bibliograafia, allikate kasutamine, plagiaat. Kirjavahemärkide kasutamine hispaania keeles."}}]}, "registration_info": {"audience": {"et": "Hispaania filoloogia 3. kursus (erialamoodul)"}, "min_students": 5, "max_students": 20}, "parent_uuid": "ca148b47-7c2d-ac5b-835b-45bdf398bf42", "parent_code": "FLGR.03.205", "parent_credits": 3, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}