{"uuid": "a51c8de6-a22f-454b-7d49-5c314076419a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-06T15:15:31", "title": {"en": "Seminar in Post-Classical Literature", "et": "Klassikajärgse kirjanduse seminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC02", "structural_unit_name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 6, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "An overview of Greek novels. Reading, translating and analyzing the style in chapters from the novels by Achilles Tatius, Heliodorus, Chariton, Xenophon of Ephesus and Longus. The different elements of narrative and the interaction between the author and the reader are observed.\nThe novel of Apuleius \"The golden ass or Metamorphoses\" will be analyzed. Main aspects in the work with the text are as follows: the connection between main narrative and the interpolated tales, representation of characters. The analysis of the action in narrative is concentrated especially on the initial and final parts of the chapters. The analysis of style includes various literary figures: euphony, metaphors, repetitions, types of lexis (neologisms, archaisms), word order etc. An excerpt from Petronius's \"Satyricon\" will be read for comparison.", "et": "Ülevaade kreeka romaani anrist. Katkendite lugemine, tõlkimine ja stilistiline analüüsimine Achilleus Tatiose, Heliodorose, Xenophoni Ephesosest, Longose ja Charitoni romaanides. Analüüsitakse stiili ja kompositsioonitehnikat, narratiivi erinevaid osiseid, autori ja lugeja suhet.\n        Analüüsitakse Apuleiuse romaani Kuldne eesel ehk Metamorfoosid. Jälgitakse raamjutustuse ja sissepõimitud lugude vahelist seost, tegelaskujusid ja nende iseloomustamiseks kasutatavaid kirjanduslikke võtteid. Tegevuse dünaamika vaatlemisel keskendutakse eriti peatükke alustavatele ja lõpetavatele tekstilõikudele, Stiili analüüsitakse kõlakujundite, metafooride, korduste, leksika kasutamise (neologismid, arhaismid), sõnajärje jm. aspektidest. Näitena vaadeldakse ka katkendit Petroniuse romaanist."}, "objectives": [{"en": "To goal is to observe stilistic and lexical characteristics of the post-classical Latin and Greek prose, especially novels, to compare it to the archaic and classical texts. The structure and the components of the Latin and Greek narrative is analyzed. To practice the translation of Greek and Latin prose, regarding the style of each author.", "et": "Süveneda klassikajärgse proosa, eelkõige romaanianri stilistilistesse ja leksikaalsetesse iseärasustesse, võrreldaseda arhailise ja klassikalise aja keelekasutusega. Jälgida kreeka ja ladina narratiivi struktuuri ja selle komponente. Praktiseerida proosatekstide tõlkimist kreeka ja ladina keelest, arvestades iga autori stiili eripära."}], "learning_outcomes": [{"en": "At the end of the course students", "et": "Kursuse lõpuks üliõpilane: "}, {"en": "have an overview of the extant ancient Greek and Latin novels;", "et": "omab ülevaadet viiest terviklikult ning mõnedest fragmentaarselt säilinud kreeka romaanist, ladina romaanidest; "}, {"en": "analyze and discern the compositional techniques and style of various authors.", "et": "oskab analüüsida ja tuua välja erinevused romaaniautorite kompositsioonitehnikas ja stiilis; "}, {"en": "apprehend the use of the stsilistic devices and rhetorical figures, discern them as elements, which shape the narrative and depiction of characters; ", "et": "analüüsib tekstis kasutatud stilistilisi võtteid ja retoorilisi väljendusvahendeid, näeb neid teost kujundavate elementidega ja seostab karakterite kujutamisega;"}, {"en": "have an overview of the principles, which shape the narrative, the interaction between the author and the reader; analyze the form and structure of authors way of representing of the action in narrative.", "et": "omab ülevaadet põhimõtetest, mis kujundavad narratiivi, autori-lugeja vahelist suhtlemist narratiivi käigus, analüüsib, milliseid vormilisi ja sisulisi elemente kasutab autor tegevuse esitamiseks. "}, {"en": "apply the skills of translating Greek and Latin prose texts, the knowledge aquired in the course and their own creative skills on translating an excerpt from an ancient author.", "et": "rakendab kreeka- ja ladinakeelsete teksti tõlkimise oskusi ning kursusel omandatud pädevusi loominguiselt tekstikatkendi tõlkimisel."}], "notes": {"et": "Epidemioloogilisest seisukorrast lähtuvalt toimuvad loengud-praktikumid veebruaris-märtsis veebi vahendusel, edaspidi vastavalt olukorrale. Täpsem info jõuab teieni Moode'i teadete foorumi kaudu.\n4. aprillil seminari ei toimu, õppereis."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Eksami hinne saadakse kirjaliku kodutöö eest, milles üliõpilane tõlgib vabal valikul ja õppejõu soovitusel katkendi ühest kreeka või ladina romaanist, analüüsib põhjalikumalt autori stiili ja keelekasutust, tunneb ära loengutes vaadeldud retoorilisi elemente teoses, tutvustab autori eripära võrreldes teiste romaaniautoritega. Kreeka keele mitteoskajad teevad kodutöö inglise, saksa või eestikeelsete tõlgete põhjal, võrreldes teose stiili ja kompositsioonitehnikat teiste loengus käsitletud teostega. Töö tagastatakse hiljem koos kommentaaridega üliõpilasele, üliõpilase nõusolekul lisatakse see õppematerjalide kausta, et ka teised kursusel osalenud saaksid oma märkusi ja ettepanekuid edastada. Lõpuseminaris arutletakse ühiselt tõlgete üle, reflekteeritakse tõlkimise erinevate aspektide ja selle käigus tekkinud probleemide üle."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Igaks seminariks tuleks ette valmistada vähemalt 1 lk tekstikatkest, mida seminaris loeme. Aeg-ajalt tuleb vormistada u 1 lõigu pikkuse teksti tõlge kirjalikult, et erinevaid tõlkeid seminarides võrrelda ja koos arutada."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Üliõpiane valib ühe artikli kreeka või ladina romaani(de) kohta end huvitaval teemal ning tutvustab seda lühidalt (5-10 min) kaasüliõpilastele."}}], "grade_preconditions": {"et": "Praktikumides loetava teksti ettevalmistamine, kodutööde sooritamine kokkulepitud tähtaegadeks."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb kirjaliku kodutöö alusel, milles üliõpilane tõlgib ja analüüsib üht romaanikatkendit, toob välja autori stilistilised ja keelelised eripärad ning võrdleb teda loengus käsitletu põhjal ka teiste romaaniautoritega.\nArvestatakse ka üliõpilase ettevalmistatust praktikumideks ning nendes osalemise aktiivsust."}, "grade_conditions": {"A": {"et": "Üliõpilane on:\n*esitanud tähtajaks kirjaliku tõlke ja analüüsi autori stiilist võrreldes teiste loetud autoritega; tõlge on keeleliselt ja sisuliselt korrektne, stiili võrdlev-analüüsiv osa on tehtud asjatundlikult ja arusaadavalt; \n*esitanud seminaris selge ülevaate loetud artiklist/peatükist ja suutnud sellest välja tuua kõige olulisemad mõtted;\n*praktikumideks ette valmistunud ja osaleb neis aktiivselt."}, "B": {"et": "Üliõpilane on:\n*esitanud tähtajaks kirjaliku tõlke ja analüüsi autori stiilist võrreldes teiste loetud autoritega; tõlge on keeleliselt ja sisuliselt korrektne, stiili võrdlev-analüüsiv osa on tehtud asjatundlikult ja arusaadavalt, ent esineb mõningaid väiksemaid vigu; \n*esitanud seminaris selge ülevaate loetud artiklist/peatükist ja suutnud sellest välja tuua kõige olulisemad mõtted;\n*praktikumideks enamasti ette valmistunud ja osaleb neis aktiivselt."}, "C": {"et": "Üliõpilane on:\n*esitanud tähtajaks kirjaliku tõlke ja analüüsi autori stiilist võrreldes teiste loetud autoritega; tõlge on keeleliselt ja sisuliselt korrektne, stiili võrdlev-analüüsiv osa on tehtud asjatundlikult ja arusaadavalt, ent tõlkes ja analüüsiosas on puudujääke; \n*esitanud seminaris ülevaate loetud artiklist/peatükist ent mõni olulisem aspekt sellest jääb käsitlemata;\n*praktikumideks enamasti valmistunud ja osaleb neis aktiivselt."}, "D": {"et": "Üliõpilane on:\n*esitanud tähtajaks kirjaliku tõlke ja analüüsi autori stiilist võrreldes teiste loetud autoritega; tõlkes esineb keelelisi ja/või sisulisi vigu, stiili võrdlev-analüüsiv osa jääb pealiskaudseks;\n*esitanud seminaris ülevaate loetud artiklist/peatükist ent see ei ole hästi arusaadav ja jääb väga pealiskaudseks;\n*ei ole alati praktikumideks ette valmistunud, ent osaleb neis aktiivselt."}, "E": {"et": "Üliõpilane on:\n*esitanud hilinemisega kirjaliku tõlke ja analüüsi autori stiilist võrreldes teiste loetud autoritega; tõlkes esineb ohtralt keelelisi ja/või sisulisi vigu, stiili võrdlev-analüüsiv osa jääb äärmiselt pealiskaudseks;\n*esitanud seminaris ülevaate loetud artiklist/peatükist ent ei suuda välja tuua selgelt ja arusaadavalt selle olulisemaid punkte;\n*ei ole praktikumideks ette valmistunud, ei osale neis aktiivselt."}, "F": {"et": "Üliõpilane ei ole esitanud lõpphindamiseks kohustuslikku kodutööd."}, "mi": {"et": "Üliõpilane ei ole seminaridel osalenud ega esitanud lõpphindamiseks kohustuslikku kodutööd."}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "9fb7d07b-af3b-47fe-989e-4a72f98fb84d", "type": "MOODLE", "code": "FLGR.02.074", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Tekstijagamid ja materjalid Moodle'is.", "recommended_materials": "Vanakreeka kirjanduse antoloogia. \nLongus, \"Daphnis ja Chloe\",Tallinn, 1972 (2. tr. 2007).\nApuleius, \"Metamorfoosid ehk Kuldne eesel\", Tallinn, 1994."}, "participants": {"lecturers": [{"person_uuid": "667a0843-811d-b78a-0068-146520628e8d", "person_name": "Kadri Novikov", "structural_unit": {"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. nädal - sissejuhatav loeng romaanianri kujunemisest antiikajal ning olulisematest romaaniautoritest ning teostest."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "2.-11. nädal - katkendid erinevatest vanakreeka romaanidest (Charitoni \"Chaireas ja Kallirhoe\", Xenophoni \"Ephesiaka\", Longose \"Daphnis ja Chloe\", Achilleus Tatiose \"Leukippe ja Kleiotphon\", Heliodorose \"Aithiopika\"). Erinevate autorite kirjutamise ja sündmuste esitamise stiili võrdlus.\nPraktikumid sisaldavad enamasti ka teoreetilist osa, milles vaadeldakse narratiivile üldomaseid jooni, narratiivi tempo kujunemist, autori ja lugeja suhet teostes, tutvustakse karakterite kujutamise põhimõtteid, romaanides kasutatavaid stilistilisi ja retoorilisi võtteid. Neid teemasid jälgitakse ja analüüsitakse tekstikatkendeid lugedes ning romaanide ülesehitust käsitledes. Otsitakse vanakreeka ja ladina romaanide võimalikke mõjusid hilisemale kirjandusele."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "12.-15. nädal - ladinakeelne romaan: Petroniuse \"Satyricon\" ja Apuleiuse \"Metamorfoosid e Kuldne eesel.\" Tekstikatkete lugemine Petroniuse ja Apuleiuse romaanist. Jälgitakse ning analüüsitakse Apuleiuse sõnamoodustust, lauseehitust, autori ja lugeja suhet teoses, narratiivi üldist ülesehitust."}}]}, "registration_info": {"audience": {"et": "Klassikalise filoloogia magistriõpe"}, "min_students": 2, "max_students": 14}, "parent_uuid": "e476e964-38c8-4c14-a437-1dad93c9baa8", "parent_code": "FLGR.02.074", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}