{"uuid": "721598ae-e190-be9b-a72c-6563cd05f91a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-06T14:07:11", "title": {"en": "Thematic Seminar in American Literature and Culture", "et": "Ameerika kirjanduse ja kultuuri teemaseminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "25/26 A block mode HV", "et": "25/26 S SÕ HV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course focuses on different topics every year (the specific list of topics, authors and text can be fond in the course syllabus, available on Moodle and SIS). In autumn 2016 the focus of the course is individualism, a core value of American culture, and its representation in 19th and 20th century literary texts. Literary texts are placed in a socio-historical context in order to discuss different responses to the tension between the individual and society. Students will read original literary works and trace the major cultural themes in them.", "et": "Kursus keskendub aastati muutuvatele teemadele. Sügisel 2016 on fookuses individualism kui ameerika kultuuri keskne väärtus ning selle kujutamine 19. ja 20.saj.kirjandustekstides. Tekstid asetatakse ajastu ühiskondlikku-ajaloolisse konteksti ning vaadeldakse erinevaid kirjanduslikke vastukajasid indiviidi ja kollektiivi vahel valitsevatele pingetele. Üliõpilased loevad originaalkeeles kirjandustekste ja analüüsivad neis esinevaid kultuurilisi ja kirjanduslikke teemasid."}, "objectives": [{"en": "The course focuses in topics related to American literature and culture that vary by semester. The course places literary texts into their socio-cultural context and traces the dynamics of themes central to American culture (e.g., individualism, nature, gender, race, etc.). Students will read original literary texts and place them in their cultural context and that of changing critical reception.", "et": "Kursus keskendub semestriti erinevatele ameerika kirjanduse ja kultuuriga seotud teemadele. Kursus asetab kirjandustekstid nende sotsio-kultuurilisse konteksti ning tutvustab ameerika kultuurile kesksete teemade (nt individualism,loodus, sugu, rass, jne.) väljendusi. Tudengid loevad originaalkeelseid kirjandustekste ning asetavad neid oma ajastu kultuuri ja muutuva retseptsiooni konteksti."}], "learning_outcomes": [{"en": "Students who have completed the course can analyse American literature in its socio-historical context (e.g. frontier, industrialisation, urbanisation, slavery, suffrage struggle, class tensions). They can trace themes central to American culture in literary texts and discuss their changes over time. Students are able to apply different methods of literary analysis (including close reading and theories acquired in their classes of literary theory). Students will also improve their spoken English, skill of collecting and analysing data and academic writing in English.", "et": "Kursuse läbinud üliõpilased oskavad analüüsida ameerika kirjandust selle kultuurilises ja ajaloolis-ühiskondlikus kontekstis (nt seoses mõistetega nagu rajamaa, industrialiseerimine, linnastumine, orjandus, naiste õigused, klassipinged, jne.). Nad suudavad tekstides tuvastada ameerika kultuurile keskseid teemasid ning analüüsida nende muutusi ajas. Üliõpilased suudavad rakendada erinevaid kirjanduse analüüsimise võtteid (sh lähilugemine ja kirjandusteooria ainetes omandatud teoreetilised vaatenurgad). Üliõpilased parendavad oma suulise inglise keele, andmete kogumise ja analüüsimise ja ingliskeelse akadeemilise kirjutamise oskusi."}], "notes": {}}, "grading": {"independent_work": {"et": "Tekstide lugemine ja analüüs, osalemine Moodle diskussioonides, lähilugemise esitamine ."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Diskussioonikomponent koosneb kahest osast: seminarides aktiivne osalemine ja osalemine Moodle foorumites. Üliõpilased postitavad vähemalt ühe diskussioonikommentaari Moodle keskkonnas. Kõrgeimad punktid saavad tudengid, kes osalevad diskussioonides aktiivselt, kuid samas teiste suhtes hoolivalt ning näitavad tekstide tõlgendamise oskust."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Üliõpilased kirjutavad lähilugemise ühe kursuse 1. poole jooksul loetud autori teksti kohta. Analüüsitakse ühte lõiku või stroofi ning kirjeldatakse kõiki selles kasutatavaid stilistilisi väljendusvahendeid. Fookuses on teksti stilistiline külg ning selle detailne analüüs näitamaks autori poolt kasutatud kirjanduslikke võtteid ja nende mõju. Töö ei vaja mingeid sekundaarviiteid. Täpsemad juhised on kättesaadavad Moodle keskkonnas. Kõrgeimad punktid saavad tudengid, kelle töö kombineerib detailset tekstikirjendust ja kasutatud väljendusvahendite mõju analüüsi. Punkte alandab kirjenduse pealiskaudsus ja kommentaari puudumine. Plagieeritud tööd saavad automaatselt 0 punkti. Chat-GPT ja teiste tehisaru rakenduste kasutamine pole lubatud."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Essee arendab ühte kursuse jooksul puudutatud teemat (nt indiviidi ja ühiskonna suhe või looduse ja tsivilisatsiooni pinge) mingi kursuse jooksul käsitletud autori teoses (see ei tohi olla sama tekst, mida üliõpilane analüüsis lähilugemisharjutuses). Essee (5-6 lk) fookuses peab olema üks kirjanduslik tekst, aga kasutama peab ka vähemalt ühte sekundaarallikat, eelistatavalt kas kirjanduskriitkat, -ajalugu või -teooriat puudutavat teksti. Essee peab kasutama tekstinäiteid uuritavast kirjandustekstist. Täpsemad juhised on kättesaadavad Moodle keskkonnas. Kõrgeimad punktid saavad üliõpilased, kelle analüüs näitab head orienteerumist ameerika romantismis ja selle dominantsetes teemades ning sellega paralleelselt täpset ja samas loovat kirjandustekstide analüüsimise ja sekundaarkirjanduse inkorporeerimise oskust. Punkte vähendab essee liigne referatiivsus ja kirjandusteksti pealiskaudne analüüs. Plagieeritud tööd saavad automaatselt 0 punkti. Chat-GPT ja teiste tehisaru rakenduste kasutamine pole lubatud."}}], "min_points_from_tests": 40, "grade_preconditions": {"et": "Osalemine loengutes/seminarides, semestri jooksul nõutavate jooksvate ülesannete (Moodle diskussioonid) ja lähilugemise esitamine."}, "grade_evaluation": {"et": "Osalemine diskussioonides 20%, lähilugemine 30%, essee  50%."}, "debt_elimination": {"et": "ÕKE kohaselt"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Mark Twain, The Adventures of Huckleberry Finn\nF. Scott Fitzgerald, The Great Gatsby\nLühemad Moodle kaudu kättesaadavaks tehtud tekstid (vt kursusetutvustust igas tunnis käsitletavate autorite ja teoste nimedega)", "recommended_materials": "Norton Anthology of American Literature, vol. 1 & 2 või mõni muu ameerika kirjanduse antoloogia"}, "participants": {"lecturers": [{"person_uuid": "7c940156-1b65-df4f-a452-da4549ded130", "person_name": "Raili Marling", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "5d13f1bf-bae6-224d-0477-9fc8a0ebd36a", "person_name": "Ave Palm", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Introduction. American Dream and its problems. Discussion of the Autobiography of Benjamin Franklin"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Individualism and resistance to authority. Read H. D. Thoreau, Civil Disobedience"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Individualism and resistance. Read Herman Melville, Bartleby the Scrivener!"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Read Frederick extracts from Frederick Douglass and Charlotte Perkins Gilman's The Yellow Wallpaper. Moodle post on how their experiences differ from those of the writers read earlier"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Close reading deadline"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Individual voices in American poetry: Walt Whitman, Langston Hughes, HD"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Listen to the introductory lecture on F. Scott Fitzgerald and The Great Gatsby. Read The Great Gatsby."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar on The Great Gatsby."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Essay ideas due Moodle"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Final essay due on Moodle."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "29830532-0a18-61dc-0f28-a11c68e3abc3", "parent_code": "FLGR.01.194", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}