{"uuid": "113f2647-e593-fcad-f605-083f19599145", "code": "FLGR.06.177", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Didactics of the Swedish Language", "et": "Rootsi keele didaktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Module topics: Different skills: listening, writing, conversation, reading and studying new vocabulary. \nTheoretical topics: studying types, strategies, language acquisition theories, different language teaching theories, explicit vs implicit learning/studying, taskbased learning and grammar, testing and assessment systems.\nTechnical aids: HotPotatoes, Lexin, web-based series, blogs etc.", "et": "Moodulite teemad: Osaoskused - kuulamine, kirjutamine, rääkimine, lugemine, sõnade õppimine.\nTeoreetilised teemad: õpitüübid, õpistrateegiad, keeleomandamisteooriad, keeleõppe meetodid, eksplitsiitne vs implitsiitne õppimine, ülesandepõhine keeleõpe ja grammatika, testimis- ja hindamissüsteemid.\nTehnilised vahendid: HotPotatoes, Lexin, veebipõhised koomiksid, blogid jne."}, "objectives": [{"en": "To prepare teachers of Swedish for work with Swedish materials, applying language didactical theory to teaching Swedish, to inspire future teachers of Swedish for work.", "et": "Rootsi keele õpetajate ettevalmistamine tööks rootsi keele õpetamise materjalidega, teoreetiliste keeledidaktiliste teemade rakendamine rootsi keele õpetamises, tulevaste õpetajate inspireerimine ainealaselt."}], "learning_outcomes": [{"en": "The student who has passed the course has thorough knowledge about language acquisition in general and new knowledge about newer language teaching theories and methods. The student knows what kind of teaching materials in Swedish can be found as books or on web.", "et": "Kursuse läbinud õppija on saanud teadmisi keeleõppest üldisemalt ning omandanud uusi teadmisi uuematest keeleõpetamise teooriatest ja meetoditest. Ta teab, millised rootsi keele õpetamise materjalid on olemas õpikutena ning veebis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}