{"uuid": "549cd3db-5226-0372-02bb-856570857466", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-28T16:12:53", "title": {"en": "Danish Composition and Conversation", "et": "Taani keele väljendusõpetus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "da", "et": "taani keel", "en": "Danish"}], "other_languages": [{"code": "da", "et": "taani keel", "en": "Danish"}], "description": {"en": "The course is intended for second year students majoring in Scandinavian languages and cultures. Danish proficiency at level B1 as described in the Common European Framework of Reference is a prerequisite for participating. The course develops the students' oral and written expression in both formal and informal settings. Oral expression is practised with exercises ranging from simpler conversations to more complex communication situations (video advertisement, presentations, debates, discussions etc.). In addition to developing overall linguistic expression, such speaking tasks help strengthen communicative skills, as well as train correct pronunciation. An overview of the principles of practical rhetorics is given, and the students' confidence and debating skills are trained. Written expression is developed mainly by writing different assignments independently. The written assignments are intervowen with various texts read and tasks done on the course. The students learn to compose different standard texts necessary for formal communication. In addition, academic writing skills are developed by writing essays and other papers on field-related topics, and basic knowledge about the linguistic and stylistic demands for various text genres are given.", "et": "Kursus on mõeldud teise aasta tudengitele, kes õpivad Skandinaavia keelte ja kultuuride erialal. Kursusel osalemise eeltingimusteks on taani keele teadmised Euroopa Nõukogu keeleoskustasemel B1. Kursus tegeleb taani keele suulise ja kirjaliku väljendusoskuse arendamisega ametlikes ja mitteametlikes suhtluskontekstides. Suuline väljendusõpetus koosneb harjutustest, mis ulatuvad lihtsamatest vestlustest keerukamate kommunikatsiooni-situatsioonideni (reklaamvideo, ettekanded, debatid, arutelud jms). Lisaks üldise väljenduslaadi arendamisele aitavad suulised harjutused kaasa kommunikatiivsete oskuste süvendamisele taani keeles ning treenivad korrektset hääldust. Teoreetilise poole pealt antakse ülevaade praktilise retoorika olulisematest põhimõtetest ning treenitakse üliõpilaste esinemisjulgust ja argumenteerimisoskust. Kirjalik väljendusõpetus keskendub iseseisvate kirjalike tööde kirjutamisele, mis seostuvad erinevate etteantud tekstide ja ülesannetega. Õpitakse koostama mitmesuguseid standardseid tekste, mida võib vaja minna ametlikus asjaajamises. Täiendavalt süvendatakse akadeemilise kirjutamise oskust erialastel teemadel (referaadid, esseed jms) ning antakse põhiteadmisi mitmesuguste tekstižanride keeleliste ja stilistilise nõudmiste kohta."}, "objectives": [{"en": "The aim of the course is to develop the students' oral and written expression in different communication contexts. Oral expression is practised by giving different kinds of oral presentations, as well as by practical conversation in Danish. All presentations are analysed both linguistically and stylistically. By that, students also practise listening comprehension and get an introduction to the principles of practical rhetorics. Written expression is practised by composing different kinds of texts, including academic and field-related texts, thereby developing overall writing skills. In addition, the students' knowledge of Danish grammar and lexical nuances expands, as all written works are corrected and commented on linguistically.", "et": "Kursuse eesmärgiks on arendada edasi üliõpilaste väljendusoskust taani keeles nii kõnes kui ka kirjas erinevates suhtluskontekstides. Suuline väljendusõpetus loob võimaluse harjutada erinevaid suulisi etteasteid ning praktilist taani keeles kõnelemist, kuna kõiki etteasteid analüüsitakse nii keelelt kui ka stiililt. Ühtlasi harjutatakse taani keelest arusaamist ning antakse sissejuhatus praktilise retoorika põhimõtetesse. Kirjalik väljendusõpetus pakub võimalust arendada üldist kirjutamisoskust ning erinevat tüüpi tekstide koostamisoskust (sh akadeemilised ja erialased tekstid). Samuti süvendatakse teadmisi taani keele grammatikast ja sõnastusnüanssidest, kuna kõiki kirjalikke töid parandatakse ja kommenteeritakse ka keeleliselt."}], "learning_outcomes": [{"en": "After completing the course, the student: ", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- holds conversations on different topics in Danish and feels confident speaking publicly in Danish; ", "et": "-peab taanikeelseid vestlusi erinevatel teemadel ning tunneb ennast taani keeles esinedes kindlalt;"}, {"en": "- finds, evaluates and analyses relevant information for creating written, oral and multimedia texts; ", "et": "- leiab, hindab ja analüüsib asjakohast infot kirjalike, suuliste ja multimeediatekstide koostamiseks;"}, {"en": "- presents and analyses various issues orally, both individually and as groupwork; ", "et": "- esitleb ja analüüsib erinevaid teemasid suulise ettekande vormis nii individuaalselt kui rühmatööna;"}, {"en": "- argues for their opinions in conversation and debate, applying basic techiques of rhetorics; ", "et": "- vestleb ja debateerib argumenteeritult, rakendades põhilisi retoorikavõtteid;"}, {"en": "- has an overview of different types of texts in Danish (including various formal and field-related texts) and composes them; ", "et": "- omab ülevaadet erinevatest kirjalikest tekstitüüpidest (sh mitmesugused ametlikud ja erialased tekstid) taani keeles ning koostab neid;"}, {"en": "- writes analytical academic texts in Danish, making appropriate linguistic and stylistic choices.", "et": "- kirjutab taani keeles akadeemilisel tasemel analüütilisi tekste ja teeb sealjuures korrektseid keelelisi ja stilistilisi valikuid."}], "notes": {}}, "grading": {"independent_work": {"et": "Erinevate teemadega seotud suuliste ettekannete ettevalmistamine ning kirjalike tööde koostamine (vt kursuse programmis toodud teemad). Täpsemad juhised antakse tudengitele kursuse alguses."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "De studerende vil for at bestå kurset skulle være til stede 80 % af tiden, aflevere et antal skriftlige opgaver i løbet af semesteret samt bestå en afsluttende skriftlig eksamen samt en mundtlig eksamen eller præsentation.\n\nDen studerende vil blive givet en karakter fra A-F"}}], "grade_preconditions": {"et": "Eksamile pääsemise eelduseks on aktiivne osalemine õppetöös, suuliste ettekannete ja  praktiliste kirjalike harjutuste õigeaegne sooritamine. Täpsemates tingimustes ning ülesannete laadis lepitakse kokku kursuse alguses."}, "grade_evaluation": {"et": "Lõplik eksamitulemus kujuneb jooksvalt kokkulepitud praktiliste suuliste ja kirjalike harjutuste hinnete keskmisest. Hinnatakse üldist väljenduslaadi, argumenteerimis- ja analüüsioskust ning keelelist taset."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "23fafee4-ee87-4eb5-b5e9-0426270e3d15", "type": "MOODLE", "code": "FLGR.06.038", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Kursuse käigus jagatakse tudengitele erinevaid autentseid tekste mitmesugustel teemadel seoses suuliste ja kirjalike ülesannetega. \nAnette Nielsen og Lene Trolle Schütter Skriveøvelser - til dansk\nHåndbog i Nudansk.\nLotte Reinicker: Den gode opgave\nLise Lynge og Ida Westh: Grundbog i skriftlig dansk\nKirsten Rask: Stilistik\nHenrik Galberg Jacobsen og Peder Skyum-Nielsen: Dansk sprog - en grundbog"}, "participants": {"lecturers": [{"person_uuid": "ccf4e899-2bd1-dfd8-c7af-57e1eff1e9ad", "person_name": "Minna Salmistu", "structural_unit": {"code": "HVLC", "name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "email": "keeled@ut.ee", "webpage_url": "https://maailmakeeled.ut.ee", "address": "Lossi 3\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 3", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "dde2baac-5f0f-00d0-2b49-1a162249025e", "person_name": "Mie Mortensen", "structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": false}]}, "schedule": {"weeks": {"et": "24-39"}}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 20}, "parent_uuid": "cdefd154-01b1-ee7a-cbf0-e2344f8ec534", "parent_code": "FLGR.06.038", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}