{"uuid": "aeefc30f-cf15-a66e-e4ea-c49803219c20", "code": "hv-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Seminar in Discourse Analysis", "et": "Diskursuseanalüüsi seminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 10, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course introduces the notion of discourse and its interdisciplinary application in different subfields of English Studies: linguistics, literature, culture studies and ELT. The course introduces argumentation techniques and discourses used in English-language texts as well as methods suitable for analyzing them. The course will cover both spoken and written texts in different subfields of English Studies, analyzing argumentation techniques, structural principles and cultural-ideological discourses used in the texts. The analysis of texts supports the development of students' skills of oral and written expression in English, but also critical reading and analysis skills necessary in conducting their own independent research.", "et": "Kursus tutvustab diskursuse mõiste ja selle rakendamisvõimalusi erinevates anglistika alavaldkondades (keele- ja kirjandusteaduses, kultuuriuuringutes, keeleõppes).\nKursus tutvustab ingliskeelsetes tekstides kasutatavaid argumentatioonivõtteid ja diskursusi ning tekstide ja diskursuste analüüsiks sobivaid meetodeid. Vaadeldakse nii suulisi kui kirjalikke tekste, analüüsides neis kasutatavaid argumentatsioonivõtteid, struktuurilist ülesehitust, kultuurilis-ideoloogilisi diskursusi. Tekstide analüüs toetab üliõpilaste ingliskeelse suulise ja kirjaliku väljenduse oskuse arengut, aga ka iseseisvaks uurimistööks vajalike kriitilise lugemise ja analüüsi oskust."}, "objectives": [{"en": "The course introduces the concept of discourse and the range of its applications in different subfields of English Studies (linguistics, literature, culture studies, language teaching). The course introduces argumentation techniques and discourses used in English-language texts as well as methods suitable for analyzing them. The course will cover both spoken and written texts in different subfields of English Studies. Students will read and analyze different text types, including academic research articles, honing their skills of critical reading necessary for their own independent research.", "et": "Kursuse eesmärgiks on tutvustada diskursuse mõistet ja selle rakendusvõimalusi erinevates anglistika valdkondades (keele- ja kirjandusteaduses, kultuuriuuringutes, keeleõppes). Kursus tutvustab ingliskeelsetes tekstides kasutatavaid argumentatsioonivõtteid ja diskursusi ning tekstide ja diskursuste analüüsiks sobivaid meetodeid. Vaadeldakse nii suulisi kui kirjalikke tekste anglistika erinevates alavaldkondades. Loetakse ja analüüstakse erinevaid tekstitüüpe, sh akadeemilisi tekste, mille kaudu üliõpilased harjutavad oma uurimistöödes vajalikku kriitilise lugemise oskust."}], "learning_outcomes": [{"en": "Students get an overview of the interdisciplinary possibilities of discourse analysis and are able to use its methods in their own research. After completing the course, students can recognize discourses prevalent in English-speaking cultures and can compare them to the Estonian ones. They acquire methods suitable for analyzing different English-language text types and the ability to apply them also in their own work. They also learn to critically analyze the uses of discourse analysis in scholarly literature. Students develop the skill of critical reading and text analysis, ability to work with English-language academic texts, skill of academic writing.", "et": "Kursuse tulemusena  omandavad üliõpilased ülevaate diskursusanalüüsi interdistsiplinaarsetest võimalustes ning oskavad selle põhimeetodeid oma uurimustöös rakendada. Nad tunnevad  ära ingliskeelsetes kultuurides käibivaid diskursusi ning oskavad neid Eesti omadega võrrelda. Nad omandavad erinevate ingliskeelsete tekstitüüpide analüüsiks sobivaid võtteid ja õpivad ka kriitiliselt analüüsima diskursusanalüüsi kasutust teaduskirjanduses. Üliõpilased arendavad kriitilise lugemise ja tekstide lähianalüüsioskust, oskust töötada ingliskeelsete tekstidega ning akadeemilise kirjaliku eneseväljenduse oskust."}], "notes": {}}, "grading": {"independent_work": {"et": "1. iseseisev praktiline tekstianalüüs\n2. lõpuessee, milles analüüsitakse diskursuse mõiste rakendust mingis teadusartiklis.\nTäpsemad juhised on kättesaadavad ÕISis  õppematerjalide kaustas.\n1.independent practical text analysis\n2. final essay that analyzes the application of the concept of discourse in one research article. \nMore specific instructions can be found in the study materials folder on the SIS."}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Üliõpilased saavad 20% hindest seminariosaluse eest. Hinnatakse oskust arutleda loetud materjali üle, tõmmata paralleele loetu ning oma uurimistöö või praktika vahele.  Kõrgeimad hinded saavad üliõpilased, kes on seminarides aktiivsed, esitavad asjakohaseid ja loovat mõtlemist näitavaid kommentaare ning toetavad teiste üliõpilaste osalemist diskussioonis. Punkte vähendab passiivsus või ka hoolimatus teiste arvamuste suhtes. Punkte ei saa tudengid, kes puuduvad seminaridest ilma mõjuva põhjuseta enam kui kolm korda.\nStudents get 20% of their grade for seminar participation. Students are assessed on their ability to discuss the material read, draw parallels between the reading and their own research or practical training. Highest scores are given to students who are active in seminars, make relevant comments that show creative thinking and that support the discussion of other students. Passivity in classroom or disregard for the opinions of others reduce points. Students who miss more than three seminars without a valid reason do not get participation points."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2018-10-31", "description": {"et": "Üliõpilased viivad läbi praktilise tekstianalüüsi (2-3 lk) enda poolt valitud teksti baasil kodueksami vormis, kasutades kursuse jooksul tutvustatud meetodeid ja termineid. Õpetajakoolituse üliõpilased analüüsivad mingit õpikut või muud õppematerjali. Maksimaalsed punktid saavad üliõpilased, kes suudavad teksti analüüsiks valida sobiva meetodi ning seda korrektselt ja järjekindlalt teksti analüüsis kasutada. Mitte-süstemaatiline lähenemine või terminoloogilised vead, samuti puudulik eneseväljendusoskus vähendavad punkte. Negatiivse hinde saavad üliõpilased, kelle töö sisaldab plagiaati.\nStudents write a practical text analysis (2-3 pp.) of a text of their own choice, using one of the methods and relevant terminology introduced during the first half of the course. Teacher training students are encouraged to analyze a textbook or some other teaching aid. Full score is given to students who can choose a method suitable for analyzing the text at hand and are able to use it correctly and systematically. Lack of a systematic approach, mistakes in terminology or academic writing reduce the score. Students whose papers contain plagiarism will receive a negative grade."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "due_date": "2019-01-07", "description": {"et": "Üliõpilased kirjutavad analüütilise essee (1500-1800 sõna) diskursusanalüüsi puudutava teadusartikli teemal. Üliõpilased valivad oma huviala mingile aspektile pühendatud diskursusanalüüsi rakendava essee ning analüüsivad seda kriitiliselt. Essee peaks andma kokkuvõtte valitud artiklist (mitte rohkem kui 1/3 essee mahust!), kuid selle põhiosa peaks olema pühendatud teksti süvaanalüüsile. Maksimaalsed puntid saab essee, mille keskmeks on artiklis pakutud diskursuse definitsioon, uurimistöös kasutatav metoodika ja selle sobivus püstitatud küsimuste lahendamiseks ning mis analüüsib argumenteeritud nende aspektide kasutust antud artiklis ning kommenteerib  diskursusanalüüsi kasulikkust antud ainevaldkonna uurimiseks. Essee ei  refereeri ainult teiste uurijate tööd, vaid  väljendab samuti essee autori vaatenurka teemale, mida peavad toetama konkreetsete näidetega illustreeritud väited.Väited peavad olema argumentidega toestatud; pelgalt emotsionaalsed või subjektiivsele kogemusele toetuvad tekstid ei ole vastuvõetavad. Puhtalt referatiivsed tööd saavad madalama hinde. Plagieeritud tööd saavad 0 punkti ja üliõpilane saab negatiivse hinde.\nStudents write an analytical essay (1500-1800 words) on a research article that uses discourse analysis. Students choose a research article in area of their research interests that  uses discourse analysis as a method and critically analyze the application of the method. The essay summarizes the article but the summary should not exceed 1/3 of the essay. The majority of the text should be dedicated to the in-depth analysis of the methods used in the article. Full points are given to students whose essays focus on the definition of discourse in the article, the methodology used, its appropriateness for the solving of the questions at hand and that analyzes the use of all of these features in the article. The essay should not merely report what the author wrote, but show the students' analytical opinion about how the success of the article's methodological approach. The students' arguments need to be supported by facts; mere personal opinions are unacceptable. Papers that only report the source receive a lower grade. Papers containing plagiarism will automatically receive a negative grade."}}], "min_points_from_tests": 50, "grade_preconditions": {"et": "Osalemine seminarides, praktilise tekstianalüüsi õigeaegne sooritamine ja lõpuessee kirjutamine.\nSemiar participation,writing a practical text analysis and an analytical essay for the set deadline."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb 3 komponendist:\n1. osalus seminarides (20%)\n2.praktiline tekstianalüüs (30%)\n3. analüütiline essee (50%)\nThe final result will be made of 3 components:\n1. seminar participation (20%)\n2. practical text analysis (30%)\n3. Analytical essay (50%)"}, "debt_elimination": {"et": "Mõjuvate põhjuste puhul on võimalik paluda kirjalikele tööde esitamiseks lisaaega. Hilinemisega esitatud tööd võivad saada madalama hinde.\nIn the case of vaid reasons, students may ask for an extension. Papers presented after the deadline will receive reduced scores if prior permission for an extension has not been sought."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://kontakt.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Kursuse jooksul ÕISi kaudu kättesaadavaks tehtud artiklid.\nArticles made available through the SIS during the course (see syllabus for details)", "recommended_materials": "Brown, Gillian and George Yule. 1983. Discourse Analysis. Cambridge: Cambridge UP.\nSchiffrin, Deborah, Deborah Tannen and Heidi E. Hamilton (eds). 2003. The Handbook of Discourse Analysis. Malden and Oxford: Blackwell Publishing. \nVan Dijk, Teun A. (ed). 1997. Discourse Studies. A Multidisciplinary Introduction. Vols. I-II. London and Thousand Oaks: Sage."}, "participants": {"lecturers": [{"person_uuid": "7c940156-1b65-df4f-a452-da4549ded130", "person_name": "Raili Marling", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2018-09-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Introduction. Text and discourse"}}, {"time": "2018-09-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Language forms and functions. Discourse structure"}}, {"time": "2018-09-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Discourse participants"}}, {"time": "2018-09-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Discourse and the world. Power."}}, {"time": "2018-10-03", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Prior discourses"}}, {"time": "2018-10-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Traditional text analysis ."}}, {"time": "2018-10-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Conversation analysis"}}, {"time": "2018-10-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Critical discourse analysis"}}, {"time": "2018-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Multimodal discourse analysis. Deadline of practical analysis"}}, {"time": "2018-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Cognitive discourse analysis"}}, {"time": "2018-11-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Digital methods in discourse analysis"}}, {"time": "2018-11-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Discourse analysis in language teaching"}}, {"time": "2018-11-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Article discussion: language and culture"}}, {"time": "2018-12-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Article discussion: literature and translation"}}, {"time": "2018-12-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Article discussion: language teaching"}}, {"time": "2018-12-19", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Deadline for the submission of the article abstracts for the final essay"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "cb25628f-3d9d-eeb1-d68c-21e683eea510", "parent_code": "FLGR.01.181", "parent_credits": 3, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}