{"uuid": "b57de9ad-fdcc-81d9-c286-ffb44f4d99c5", "code": "FLGR.03.151", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical French III", "et": "Prantsuse keele praktikum III"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Fictional texts or texts from the humanities are translated from French into Estonian and vice-versa. Texts are analysed from lexical, stilistic and pragmatic point of view in order to take these aspects into account during the translation process. The translations are discussed together with the students, paying special attention to different possibilities in the translations.", "et": "Tõlgitakse prantsuse keelest eesti keelde ja vastupidi ilukirjanduslikke või humanitaarteaduste valdkonna tekste. Analüüsitakse tekste leksikaalsest, stilistilisest ja pragmaatilisest seisukohast eesmärgiga arvestada neid aspekte tekstide tõlkimise juures. Tõlkeid kommenteeritakse ühiselt, pöörates tähelepanu erinevatele tõlkevõimalustele."}, "objectives": [{"en": "To give basic knowledge about translation from French into Estonian/ from Estonian into French", "et": "Anda algteadmised kirjaliku tõlke alal prantsuse keelest eesti keelde/ eesti keelest prantsuse keelde."}], "learning_outcomes": [{"en": "The student who has attended the course:", "et": "Õppeaine edukalt läbinu:"}, {"en": "1) is able to translate with a dictionary easier texts from French into Estonian (fictional, humanities);", "et": "1) on võimeline sõnaraamatut kasutades rahuldavalt tõlkima prantsuse keelest eesti keelde lihtsamat ilukirjanduslikku või humanitaarteaduste valdkonna teksti;"}, {"en": "2) is able to translate with a dictionary easier texts from Estonian into French;", "et": "2) on võimeline sõnaraamatut kasutades rahuldavalt tõlkima eesti keelest prantsuse keelde lihtsamat teksti;"}, {"en": "3) is able to use dictionaries and other relevant sources of information.", "et": "3) oskab kasutada tõlkimisel vajalikke sõnastikke ja muid infoallikaid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}