{"uuid": "3db0235a-12cd-f398-442c-9c6e53513e1e", "code": "hv-2017-autumn-fulltime-p6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Doctoral Thesis", "et": "Doktoritöö"}, "credit_type": "ECTS", "target": {"year": {"code": "2017", "et": "2017/2018", "en": "2017/2018"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "6", "et": "6. osa", "en": "part 6"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC", "name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "email": "keeled@ut.ee", "webpage_url": "https://maailmakeeled.ut.ee", "address": "Lossi 3\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 3", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "17/18 A regular part 6 HV", "et": "17/18 S PÕ 6. osa HV"}}, "general": {"year": {"code": "2017", "et": "2017/2018", "en": "2017/2018"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC", "structural_unit_name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 120, "individual_work": 6, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "fr", "et": "prantsuse keel", "en": "French"}, {"code": "en", "et": "inglise keel", "en": "English"}, {"code": "es", "et": "hispaania keel", "en": "Spanish"}, {"code": "da", "et": "taani keel", "en": "Danish"}], "description": {"en": "Independent work with literature in the speciality, collecting and analysing data, formulating a research question, choosing methods appropriate for solving it, analysis of results, and formulating the results in accordance with the requirements set at the University of Tartu. The PhD dissertation may be written in two formats: monograph (the student has to write at least one peer-reviewed research article to be allowed to the defense) and an article dissertation where previously published research articles are introduced by a comprehensive introductory article (the student has to write at least three peer-reviewed research articles to be allowed to the defense. The dissertation is assessed in two stages: pre-review and public defence. The pre-reviewers present their clearly argued opinion that states whether the dissertation is to be allowed to the public defense or that it needs additional work. By approving a dissertation for defense, the council confirms that the dissertation meets the requirements set and that it deserves a PhD degree in the case of a successful defence. The defence, however, may still result in a failure if unexpected grave problems are detected either in the dissertation or in the oral defence of the PhD candidate. The opponent for the final defence presents their written review that assesses the quality of the paper. The PhD candidate responds to the questions in a public debate with the opponent and responds to possible additional questions from the members of the council and other people present. In the case of a successful defence the dissertation is considered defended. If the work is discovered to contain plagiarism, the dissertation will have to be assessed by experts and no decision will be made. If unexpected grave problems not discovered in the pre-review come to light in the dissertation or the defence, the dissertation will be considered undefended.", "et": "Iseseisev töö erialase kirjandusega, materjali kogumine ja analüüs, uurimisküsimuse püstitamine, selle lahendamiseks sobiva metoodika valik, analüüsi läbiviimine, töö käigu kirjeldus ja tulemuste vormistamine doktoritöö nõudmistele vastavalt. Doktoritöö võib olla vormistatud kahes vormis: monograafia (mille kaitsmisele lubamine eeldab vähemalt ühe eelretsenseeritud teadusartikli avaldamist) ning kokkuvõttev ülevaateartikkel koos väitekirja teemal varem avaldatud teaduspublikatsioonidega (mille kaitsmisele lubamine eeldab vähemalt kolme eelretsenseeritava artikli avaldamist). Väitekirja hinnatakse kahes etapis: eelretsenseerimine ja avalik kaitsmine. Eelretsensent/eelretsensendid esitab/esitavad  põhjendatud kirjaliku arvamuse, mis soovitab kas väitekirja võib saata kaitsmisele või vajab see lisatööd. Väitekirja kaitsmisele lubamise otsusega kinnitab nõukogu, et väitekiri vastab nõuetele ning doktorikraadi taotleja väärib eduka kaitsmise korral doktorikraadi. Kaitsmine võib sellegipoolest luhtuda erakordsel juhul, kui ilmnevad tõsised probleemid väitekirja sisus või vormis või doktorikraadi taotleja suulises esituses. Oponent esitab kirjaliku retsensiooni, milles hindab töö kvaliteeti. Kaitsja vastab küsimustele suulises debatis oponendiga/oponentidega ning vastab nõukogu liikmete ja teiste kohalviibijate küsimustele. Arvestades oponentide hinnanguid väitekirjale, hindab nõukogu kinnisel arutelul doktorikraadi taotleja ettekannet ja suutlikkust kaitsta diskussioonis oma väitekirja põhiseisukohti. Eduka kaitsmise korral loeb nõukogu töö kaitstuks. Kui töös avastatakse loomevargust või tekib akadeemilise petturluse kahtlus, siis saadetakse töö ekspertiisi. Kui retsensioonis või kaitsmise käigus ilmneb erakorralisi probleeme, mis eelkaitsmise käigus ei tõusetunud, loeb nõukogu töö mittekaitstuks."}, "objectives": [{"en": "The aim of the PhD thesis is the preparation of an independent research paper that presents a substantiated original solution to an essential problem in a specific research area. The student formulates the research question, describes methods appropriate for solving the question, gathers relevant data, describes he course of solving the problem and the results. The PhD dissertation may be written in two formats: monograph (the student has to write at least one peer-reviewed research article to be allowed to the defense) and an article dissertation where previously published research articles are introduced by a comprehensive introductory article (the student has to write at least three peer-reviewed research articles to be allowed to the defense.", "et": "Doktoritöö eesmärgiks on iseseiseva uurimuse valmimine, milles on esitatud konkreetse teadusvaldkonna olulise probleemi argumenteeritud originaalne lahendus. Üliõpilane sõnastab uurimisülesande, esitab selle lahendamiseks sobiva metoodika kirjelduse, kogub ülesandele vastava andmestiku ja kirjeldab uurimisülesande lahendamise käiku ja tulemusi. Doktoritöö võib olla vormistatud kahes vormis: monograafia (mille kaitsmisele lubamine eeldab vähemalt ühe eelretsenseeritud teadusartikli avaldamist) ning kokkuvõttev ülevaateartikkel koos väitekirja teemal varem avaldatud teaduspublikatsioonidega (mille kaitsmisele lubamine eeldab vähemalt kolme eelretsenseeritava artikli avaldamist)."}], "learning_outcomes": [{"en": "Doctoral candidates acquire the skills and techniques of conducting research in their speciality; are able to pose research problems important to their field and offer well-argued and original solutions to them; have the command of methods of data collection and analysis appropriate to the discipline; have advanced analytical and critical skills; have full command of writing academic texts in a foreign language; have the skill of writing research articles suitable for publication in international peer-reviewed journals.", "et": "Doktorant omandab erialase teadusliku uurimistöö läbiviimise oskused ja tehnikad; oskab püstitada oma konkreetses teadusvaldkonnas olulist uurimisprobleemi  ja pakkuma sellele argumenteeritud originaalse lahenduse; valdab teadusvaldkonnale vastavat andmete kogumise ja analüüsi metoodikat; omab kõrgtasemel analüüsi- ja kriitikavõimet; oskab kirjutada võõrkeelseid teadustekste; omab oskust kirjutada rahvusvahelisel tasemel teaduslikke artikleid."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Atesteerimisaruanne"}}], "grade_preconditions": {}, "grade_evaluation": {"et": "Doktorandi teadustöö toimub individuaalplaani alusel, mis on koostatud koostöös juhendajaga.\nKontrollivorm: Atesteerimine igal õppeaastal."}, "debt_elimination": {"et": "Hiljemalt uue semestri alguseks."}, "assessment_scale": {"code": "defence", "et": "Kaitsmine", "en": "defence"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "1d259814-7cb6-a847-56a7-6c0735005299", "person_name": "Tanel Lepsoo", "structural_unit": {"code": "HVLC", "name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "email": "keeled@ut.ee", "webpage_url": "https://maailmakeeled.ut.ee", "address": "Lossi 3\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 3", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-24"}}, "registration_info": {"audience": {}}, "parent_uuid": "ed09a19f-25d2-304a-e4bf-ec45bf41d795", "parent_code": "FLGR.00.039", "parent_credits": 180, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}