{"uuid": "0a090c64-1708-f96b-e347-b043b49dd4de", "code": "FLGR.03.141", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Academic Expression in French", "et": "Prantsuse keele akadeemiline väljendusoskus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is a training of oral and written expression in scientific French. The training of oral speech involves linguistic and literary topics. The course includes also practical training: the students are required to hand in a certain number of written papers, resumes, reports, essays, articles on their specialty, which are analyzed and commented on by the lecturer, with particular attention on style aspects. \nThe first semester will be focused on resumes, reports and summary notes for written expression and on scientific talks in public for oral expression. The second semester will be focused on writing essays on different topics and arguing on the same topics in oral debates.", "et": "Kursusel treenitakse prantsuse keele akadeemilist väljendusoskust. Suulise kõne arendamisel käsitletakse keele- ja kirjandusteaduslikke teemasid. Kursus sisaldab ka praktilist treeningut: üliõpilased esitavad iseseisvaid kirjalikke töid, esseid ja artikleid oma eriala kohta, mida õppejõud analüüsib ja kommenteerib, pöörates erilist tähelepanu stilistilistele aspektidele. Esimesel semestril keskendutakse resümeedele, referaatidele, kokkuvõtetele ja suulistele ettekannetele. Teisel semestril kirjutatakse esseid erinevatel teemadel ja väideldakse suuliselt samadel teemadel."}, "objectives": [{"en": "To develop the usage of written and oral French and to prepare to academic intervention at conferences.", "et": "Arendada prantsuse keele suulist ja kirjalikku väljendusoskust ning treenida esinemisoskust akadeemilises kontekstis."}], "learning_outcomes": [{"en": "The student:", "et": "Aine edukalt läbinud üliõpilane:"}, {"en": "1) can present clear, smoothly-flowing descriptions of complex subjects integrating sub-themes, developing particular points and rounding off with an appropriate conclusion;", "et": "1) on võimeline koostama selgeid ja soravaid ettekandeid keerulistel teemadel, arendades üksikuid alapunkte ja esitades loogilise kokkuvõtte;"}, {"en": "2) can present an argument in a style appropriate to the context and with an effective logical structure which helps the recipient to notice and remember significant points;", "et": "2) suudab esitada kohases stiilis ja loogilise struktuuriga arutluskäigu, mis võimaldab kuulajal tähele panna ja meelde jätta olulisemad punktid;"}, {"en": "3) is able to formulate ideas and opinions with precision and relate his contribution skillfully to those of other speakers.", "et": "3)  on suuteline täpselt formuleerima oma mõtteid ja arvamusi ning siduma oma mõtteid teiste esinejate ettekannetega;"}, {"en": "4) can express himself in clear, well-structured text, expressing points of view about complex subjects;", "et": "4) oskab koostada selge, hästi struktureeritud teksti, väljendades oma vaateid erinevatel keerulistel teemadel;"}, {"en": "5) can write clear, smoothly-flowing text in an appropriate style, complex reports, articles and papers which present a case with an effective logical structure which helps the recipient to notice and remember significant points.", "et": "5) suudab kirjutada selgeid, ladusaid kohase stiiliga tekste, ettekandeid, artikleid ja uurimusi, mille loogiline struktuur võimaldab lugejal tähele panna ja meelde jätta olulisemad punktid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}