{"uuid": "c40fe077-3d21-4294-4640-79ff1fbd7d95", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-30T09:43:36", "title": {"en": "Latin American Cultural History", "et": "Ladina-Ameerika kultuurilugu"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV Eng", "et": "24/25 K PÕ HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 44, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "es", "et": "hispaania keel", "en": "Spanish"}], "description": {"en": "The course is about the different aspects of the cultural history of Latin American countries, for example: Latin America as a point of confluence of different cultures; stereotypes about Spanish conquista;      \r\nLatin American cultural heritage; literature, music, film, media; Latin American social structure and historical background; military dictatorships in Latin America; cultural, social and political influence of U.S.A. in Latin America; immigartion and emigration; political changes at the beginning of the 21th century.", "et": "Kursus käsitleb erinevaid aspekte Ladina-Ameerika kultuuriloost ja sotsiaal-poliitilisest olukorrast, peatudes sealhulgas järgmistel teemadel: Ladina-Ameerika kui erinevate kultuuride kokkupuutepunkt; stereotüübid hispaanlaste vallutusest; Ladina-Ameerika kultuuripärand; kirjandus,  muusika, filmikunst, meedia; Ladina-Ameerika sotsiaalne struktuur ja selle ajalooline taust; sõjaväelised diktatuurid Ladina-Ameerikas; Ameerika Ühendriikide kultuurilised, sotsiaalsed ja poliitilised mõjud Ladina-Ameerikas; immigratsioon ja emigratsioon; poliitilised muutused 21. sajandi alguses."}, "objectives": [{"en": "The course gives an overview of Latin America’s cultural diversity and richness studying the most significant cultural phenomena of the past and present. Also attention will be paid to the socio-political situation of Latin American countries and to the factors of its social and political evolution. \r", "et": "Kursus annab sissejuhatava ülevaate Ladina-Ameerika kultuurilisest mitmekesisusest ja rikkusest, lähtudes selle kõige silmapaistvamatest avaldustest nii minevikus kui ka tänapäeval. Samuti pööratakse tähelepanu Ladina-Ameerika riikide sotsiaal-poliitilisele olukorrale ja selle ajaloolise arengu ja kujunemise teguritele.\r"}, {"en": "Also an overview of the materials available on the internet will be given.", "et": "Samuti antakse ülevaade internetis leiduvatest materjalidest antud teemade kohta."}], "learning_outcomes": [{"en": "After taking this course the student will be able to see the cultural diversity of the Latin American countries, has  knowledge of the socio-political situation and their historical factors condition the develepement of those countries.", "et": "Kursuse läbinud üliõpilane oskab näha Ladina-Ameerika maade kultuurilist mitmekesisust, tunneb nende maade sotsiaal-poliitilist olukorda ja peamisi ajaloolisi kujunemistegureid.\r\nÜliõpilane teab ja oskab kasutada erinevaid internetis leiduvaid informatsiooniallikaid Ladina-Ameerika kohta."}], "notes": {}}, "grading": {"independent_work": {"et": "Referaat õppejõuga kokku lepitud teemal (Hispanoameerika ühiskonnast, kultuurist, ajaloost).\nKodulugemine: Eduardo Galeano \"Venas abiertas de América Latina\""}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Cada participante debe realizar un mapa conceptual sobre las civilizaciones precolombinas. Los mapas conceptuales se elaboran en grupos en el seminario acordado."}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Después de terminar el resumen sobre la conquista de territorios americanos, se organiza una discusión basada en  artículos proporcionados. Se espera de los participantes la participación activa en dicho seminario."}}, {"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Cada participante debe elegir un tema al principio del curso y realizar una investigación breve. Más tarde, se la presentará en clase oralmente.\nUna buena investigación:  \n*\tContenido: presenta una visión exhaustiva del asunto o tiene un enfoque personal justificado. La exposición es bien estructurada: en la introducción se plantea un objetivo realista, en el cuerpo se desarrollan unas ideas relacionadas con el mismo y en orden lógico, y en la conclusión se resumen los contenidos y no se presentan informaciones nuevas. \n*\tBibliografía: utiliza una variedad de fuentes fidedignas, no sólo enciclopedias electrónicas. No copia sino parafrasea las ideas de otras personas con referencias correctas. \n*\tExposición: utiliza un lenguaje adecuado a un registro académico. Es correcta gramaticalmente o contiene errores de gramática que no impiden la comprensión. Su habla y línea de pensamiento son fáciles de seguir y lógicas, apoyadas por materiales adicionales. \n*\tPuntualidad: manda la versión electrónica a tiempo y presenta su exposición en el momento acordado."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "En el seminario de lectura se discute el libro \"Venas abiertas de América Latina\". Los participantes vienen al seminario con un resumen de las ideas más importantes del libro, los cuales se debaten en clase. Para ser evaluado positivamente, los participantes deben mostrar que conocen el libro en cuestión y tienen una opinión fundamentada sobre la misma."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "El curso termina con un ensayo escrito a la hora de examen en clase. \nUn buen ensayo:  \n*\tVocabulario y gramática, estructuración: utiliza un lenguaje correcto y adecuado a un registro académico. Los errores gramaticales o los defectos léxicos no impiden la comprensión de las ideas y pueden calificarse como erratas. La línea de pensamiento es fácil de seguir y lógica, apoyada por hechos correctos. \n*\tContenido: tiene unas ideas centrales fundamentadas que se presentan en la introducción, se desarrollan en el cuerpo del ensayo y se resumen en la conclusión. La información presentada es relevante y concuerda con el tema, igual que está relacionada entre sí."}}], "grade_preconditions": {"et": "Participación obligatoria en un 60% de las clases. Realización de una investigación y su presentación en clase. Participación en el seminario de lectura y en el seminario en que se elabora el mapa conceptual sobre temas históricos. \nOsavõtt loengutest-seminaridest kohustuslik 60% ulatuses. Kokkulepitud teemal tehtud referaadi põhjal tuleb seminaris teha ettekanne. Samuti on kohustuslik osaleda seminaris, kus arutatakse kohustuslikku raamatut (\"Las venas abiertas de América Latina\")."}, "grade_evaluation": {"et": "Referaat + ettekanne 35% \nMõistekaart 10% \nEssee 35% \nOsalemine 10% \nKohalkäimine 10%"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "12986ce5-0beb-48f6-a376-ecc73e515fed", "type": "MOODLE", "code": "FLGR.03.262", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "- Galeano, Eduardo. Las venas abiertas de América Latina. Siglo XXI, Madrid, 2003.", "recommended_materials": "-Todorov, Tzvetan. Ameerika vallutamine: teise probleem. Tõlk. Mirjam Lepikult. Varrak, Tallinn, 2001.\n[-Restall, Matthew. Los siete mitos de la conquista española. Paidós, Barcelona, 2004.\n- Báez, Fernando. El saqueo cultural de América Latina. Debate, Barcelona, 2009.]"}, "participants": {"lecturers": [{"person_uuid": "b8049028-e668-ca0c-ab5d-0c9c0674083d", "person_name": "Mari Kruse", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introducción."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "América Latina como un área de encuentro para culturas diversas (las culturas indígenas precolombinas, las africanas y europeas."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Tópicos sobre la conquista hispana."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Patrimonio cultural de Hispanoamérica."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Presentaciones: Cultura hispanoamericana. Literatura, música, cinematografía y otras artes."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Estructuración social de Hispanoamérica y su trasfondo histórico."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Situación sociopolítica. Presentaciones: \nDictaduras militares en Hispanoamérica. \nInfluencias culturales, sociales y políticas de los EEUU sobre Hispanoamérica. \nInmigración y emigración. \nLos medios (periódicos, televisión) en Hispanoamérica."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Cambios políticos al umbral del siglo XXI."}}]}, "registration_info": {"audience": {"et": "Romanistika suunamoodul, kõik soovijad - ainet loetakse hispaania keeles."}, "min_students": 3, "max_students": 20}, "parent_uuid": "dd06d318-89e9-1bf6-f5fd-cb37b1885b7e", "parent_code": "FLGR.03.262", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}