{"uuid": "6f5fa054-d2a3-ecc3-2c8d-a58e3a4130cc", "code": "FLGR.03.154", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Theory of French III", "et": "Prantsuse keele teooria III"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The first half of the course is dedicated to the issues of linguistic study of French language, different tools of syntactic and semantic analysis will be introduced.\nThe second part of the course is related to the study of the French vocabulary. The course introduces the basic notions in the field of lexicology and also the basic elements of the history of lexicology and lexicography. The course gives the students an overview of the organization and the logic of vocabulary and introduces the main tools for the analysis of vocabulary.", "et": "Kursuse esimene osa käsitleb prantsuse keele lingvistilisi uurimismeetodeid, keskendudes süntaksi probleemidele.\nKursuse teises pooles käsitletakse prantsuse keele sõnavara uurimise probleeme. Tutvustatakse leksikoloogia põhimõisteid, samuti leksikoloogia ja leksikograafia kui teadusharude ajaloolist arengut. Antakse ülevaade keele sõnavara struktureerimise põhimõtetest ja tutvustatakse sõnavara uurimise meetodeid."}, "objectives": [{"en": "To give an overview of the main tools of French linguistic analysis. To provide with linguistic and methodological basis for individual research on a subject related to the French language.", "et": "Anda ülevaade prantsuse keele analüüsivahenditest.\nAnda keelelised ja metodoloogilised alused iseseisvaks uurimistööks prantsuse keelt puudutaval teemal."}], "learning_outcomes": [{"en": "The student:", "et": "Õppeaine edukalt läbinud üliõpilane"}, {"en": "1) can identify different linguistic elements in a French language corpus and to classify them according to their function; ", "et": "1) oskab identifitseerida erinevaid keeleelemente prantsuskeelses korpuses ja neid klassifitseerida nende funktsioonist lähtuvalt;"}, {"en": "2) has the knowledge of French linguistic terminology and can use it correctly in linguistic analysis;   ", "et": "2) tunneb prantsuskeelset lingvistilist terminoloogiat ja oskab seda konkreetses analüüsis kasutada;"}, {"en": "3) has an overview of the main historical periods and of recent developments of French linguistics.", "et": "3) omab ülevaadet prantsuskeelse keeleteaduse põhilistest etappidest ja uuematest arengutendentsidest"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}