{"uuid": "2365499e-b74d-fb11-ed75-f95cab2ba506", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-14T09:59:20", "title": {"en": "Swedish Language History", "et": "Rootsi keeleajalugu"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 A regular HV", "et": "24/25 S PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "se", "et": "rootsi keel", "en": "Swedish"}], "description": {"en": "The course gives an overview of the hisorical development of Swedish in different periods. The relationship between spoken and written language is explained. The main focus of the course is the change of tha language system from 16th century onwards, as well as the processes of stabilising and standardising written language. Both changes within the language and influences (loan words) from other languages are discussed. In describing present day Swedish, an overview of regulating Swedish, as well as the most significant language political principles is given. During the seminars, students will study texts from different periods and try to use them to analyse and explain language change (phonological, morphological, syntactic, lexical changes). The tradition of personal names in different periods in also introduced.", "et": "Kursuse käigus antakse ülevaade rootsi keele ajaloolisest arengust erinevatel perioodidel. Selgitatakse suulise keele ja kirjakeele vahekorda erinevatel perioodidel. Kursuse põhitemaatika keskendub iseäranis keelesüsteemi muutumisele alates 16. sajandist ning kirjakeele stabiliseerumise ja standardiseerumise protsessidele. Selgitatakse keelesiseseid muudatusi ning vaadeldakse mõjutusi (laensõnu) teistest keeltest. Moodsa rootsi keele kirjeldamisel antakse ülevaade olulisematest keelepoliitilistest põhimõtetest ning keele normeerimisest. Seminarides tutvutakse erinevatest perioodidest pärinevate tekstidega ja püütakse nende põhjal analüüsida ja selgitada keelelisi muudatusi (fonoloogilised, morfoloogilised, süntaktilised, leksikaalsed muudatused). Samuti tutvustatakse erinevate perioodide isikunimede traditsiooni."}, "objectives": [{"en": "The aim of the course is to give essential knowledge about the history of the Swedish language, looking at different stages in the development of the language in historical change and characterising the language of each stage. By analysing texts from different periods, the students learn to know the main features of Swedish, as well as its ties to its sister languages. In addition, the course lays out the relation between spoken and written language, their social and cultural conditions for development, thus creating a basis for understanding the linguistic situation in present day Sweden.", "et": "Kursuse eesmärgiks on anda põhiteadmised rootsi keele ajaloost, vaadeldes rootsi keele erinevaid arenguetappe nende ajaloolises muutumises ning iseloomustades keelesüsteemi kindlates arengujärkudes. Analüüsides eri perioodide tekstimaterjali, õpitakse tundma rootsi keele peamiseid tunnusjooni ning seoseid lähemate sugulaskeeltega. Kursus selgitab samuti suulise keele ja kirjakeele vahekorda, nende sotsiaalseid ja kultuurilisi arengutingimusi ning loob sel moel eelduse Rootsi tänapäevase keeleolukorra mõistmiseks."}], "learning_outcomes": [{"en": "After completing the course, the student: ", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- names the different stages in the development of Swedish;", "et": "- nimetab rootsi keele erinevaid arenguetappe;"}, {"en": " - connects Swedish to its sister languages in a historical perspective;", "et": "- seostab ajalooliseses perspektiivis rootsi keelt selle sugulaskeeltega;"}, {"en": " - analyses simpler language historical texts and uses them to characterise the stage of language development at hand;", "et": "- analüüsib lihtsamaid keeleajaloolisi tekste ning iseloomustab nende põhjal keele konkreetseid arengustaadiume;"}, {"en": " - understands the historical background of the language situation in present-day Sweden; ", "et": "- saab aru Rootsi tänapäevase keelesituatsiooni ajaloolisest tagapõhjast;"}, {"en": "- explains the ties between language and society.", "et": "- selgitab keele ja ühiskonna sotsiokultuurilisi seoseid."}], "notes": {"et": "Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}}, "grading": {"independent_work": {"et": "Iseseisvalt tuleb läbi lugeda kohustusliku kirjanduse hulgas toodud materjalide loengus viidatud peatükid, sooritada kirjalikke harjutusi ning valmistada etteantud teemal üks suuline ettekanne."}, "grade_preconditions": {"et": "Eksamile pääsemise eelduseks on:\n1) osavõtt 95% seminaridest ja praktikumidest; praktikumide jaoks kodutöö (sh. materjalide tutvustamine) ettevalmistamine ja ettekaandmine \n2)  3 miniettekande ( 1. \"mini-energiser\" kuni 3 min, 2. keeleajaloo teemaline ettekanne ( katab kursuse kohustuslikku/soovitavat materjali) 3-5 min; kodulugemine keeleajaloo teemadel - huvitava täiendava allika/materjali tutvustamine cirka 4-5 min)\n3) positiivsele hindele ( A-C) sooritatud lõputöö/ eksam."}, "grade_evaluation": {"et": "Eksam koosneb kahest osaeksamist, mis mõlemad moodustavad 50 % eksami koguhindest. Eksami käigus testitakse teoreetilisi alusteadmisi (keeleajaloolise terminoloogia, rootsi keele peamiste arengustaadiumite tundmine) ning oskust etteantud teksti analüüsida (tuua välja peamised ortograafilised, morfoloogilised, süntaktilised, leksikaalsed tunnusjooned, paigutada tekst õigesse ajaperioodi). Eksam on ilma abivahenditeta."}, "debt_elimination": {"et": "Seminaridest ja praktikumidest põhjusega puudumise korral tuleb ülesanded õppejõule esitada kirjalikult ja sooritada testid väljaspool loenguaega."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Pettersson Gertrud. 1996. Svenska språket genom sjuhundra år. Lund.\nBergmam Gösta. 1968 (1984, 1991 m.m.). Kortfattad svensk språkhistoria. Stockholm.\nElias Wessen. Fornsvenska texter.\nElias Wessen. Svensk språkhistoria. Ljudlära och ordböjningslära.\nElias Wessen. Svensk språkhistoria. Ordbildningslära.", "recommended_materials": "Svenskan i tusen år. Glimtar ur svenska språkets utveckling. 2010. Red. Lena Moberg och Margareta Westman\nArv och lån i svenskan. Sju uppsatser om ordförrådet i kulturströmmarnas perspektiv. 1994. Utgivna av Svenska Akademien\nFalk Cecilia, Lars-Gunnar Delsing. 2005. Studier i svensk språkhistoria. Lund.\nLagman Svante, Stig- Örjan Ohlsson, Viivika Voodla. (toim). 2002. Svenska språkets historia i Östersjöområdet. Nordistica Tartuensia  No. 7.\nBandle, Oskar (toim). 2002. The Nordic Languages. An International Handbook of the History of the North Germanic Languages. Volume 1. Berlin / New York. \nBarðdal, Jóhanna, Nils Jörgensen, Gorm Larsen, Bente Martinussen. 1997. Nordiska. Våra språk förr och nu. Lund. \nKönig, Ekkehard, Johan van der Auwera. 1994. The Germanic Languages. London."}, "participants": {"lecturers": [{"person_uuid": "45edf2d2-9de6-3a33-2b14-422ae5a1ec47", "person_name": "Kristina Mullamaa", "structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 30}, "parent_uuid": "e2b922f4-624f-25e7-a0a3-71d00c2bf629", "parent_code": "FLGR.06.034", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}