{"uuid": "2c00729b-a052-3724-1da1-2a6eea006c68", "code": "hv-2024-spring-fulltime-p2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-05T13:05:49", "title": {"en": "Theory of French III", "et": "Prantsuse keele teooria III"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular part 2 3 CP HV", "et": "24/25 K PÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "fr", "et": "prantsuse keel", "en": "French"}], "description": {"en": "The first half of the course is dedicated to the issues of linguistic study of French language, different tools of syntactic and semantic analysis will be introduced.\nThe second part of the course is related to the study of the French vocabulary. The course introduces the basic notions in the field of lexicology and also the basic elements of the history of lexicology and lexicography. The course gives the students an overview of the organization and the logic of vocabulary and introduces the main tools for the analysis of vocabulary.", "et": "Kursuse esimene osa käsitleb prantsuse keele lingvistilisi uurimismeetodeid, keskendudes süntaksi probleemidele.\nKursuse teises pooles käsitletakse prantsuse keele sõnavara uurimise probleeme. Tutvustatakse leksikoloogia põhimõisteid, samuti leksikoloogia ja leksikograafia kui teadusharude ajaloolist arengut. Antakse ülevaade keele sõnavara struktureerimise põhimõtetest ja tutvustatakse sõnavara uurimise meetodeid."}, "objectives": [{"en": "To give an overview of the main tools of French linguistic analysis. To provide with linguistic and methodological basis for individual research on a subject related to the French language.", "et": "Anda ülevaade prantsuse keele analüüsivahenditest.\nAnda keelelised ja metodoloogilised alused iseseisvaks uurimistööks prantsuse keelt puudutaval teemal."}], "learning_outcomes": [{"en": "The student:", "et": "Õppeaine edukalt läbinud üliõpilane"}, {"en": "1) can identify different linguistic elements in a French language corpus and to classify them according to their function; ", "et": "1) oskab identifitseerida erinevaid keeleelemente prantsuskeelses korpuses ja neid klassifitseerida nende funktsioonist lähtuvalt;"}, {"en": "2) has the knowledge of French linguistic terminology and can use it correctly in linguistic analysis;   ", "et": "2) tunneb prantsuskeelset lingvistilist terminoloogiat ja oskab seda konkreetses analüüsis kasutada;"}, {"en": "3) has an overview of the main historical periods and of recent developments of French linguistics.", "et": "3) omab ülevaadet prantsuskeelse keeleteaduse põhilistest etappidest ja uuematest arengutendentsidest"}], "notes": {}}, "grading": {"independent_work": {"et": "1) seminarides käsitletavate materjalide lugemine\n2) praktiline uurimistöö seminarides käsitletud teemadel"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teema: sõnade koostis ja uute sõnade moodustamine\nKriteeriumid:\n- sõnade analüüs (vastavalt juhendile ÕISis)\n- mõistete kasutamine ja keeleline korrektsus \n- töö ülesehitus ja arutluskäik\nA: kõik juhendis nõutud analüüsipunktid on  põhjalikult ja korrektselt lahti seletatud; mõistete ja keele kasutus eeskujulik; põhjalik, hästi jälgitav ja originaalne arutluskäik, tekst on sidus ja loogiliselt struktureeritud, üksikuid juhuslikke eksimusi võib esineda mõnes hinnatavas aspektis.\nB: analüüsipunktid on korrektselt lahti seletatud, üksikuid vigu võib esineda erandlike juhtumite korral; mõistete ja keele kasutuses võib esineda üksikuid juhuslikke eksimusi; põhjalik ja hästi jälgitav arutluskäik, tekst on üldiselt sidus ja loogiliselt struktureeritud, kuid üksikud asspektid vähem lahti seletatud.\nC: analüüsipunktidele on üldjuhul õigesti vastatud, kuid kohati pealiskaudselt ja erandlike juhtumite puhul ilmneb puudujääke; mõisteid on üldiselt õigesti kasutatud, tuleb ette eksimusi vähemlevinud terminite kasutuses; korralik ja hästi jälgitav iseseisev analüüs, kuid osa küsimusi pole piisavalt lahti seletatud. \nD: kõikidele juhendis nõutud punktidele on vastatud, kuid sõnamoodustuse analüüsis leidub vigu; mõistete kasutamisel esineb häirivaid eksimusi; arutluskäik on kohati raskesti jälgitav.\nE: juhendis nõutud punktidele on vastatud, kuid sõnamoodustuse analüüsis leidub olulisi vigu; mõisteid on korduvalt valesti kasutatud ja töö keeleliselt sageli raskesti mõistetav; analüüs on seoste puudumise tõttu raskesti jälgitav.\nF: sõnade analüüs puudulik; vigane ja juhuslik mõistete kasutus; puudub iseseisev analüüs"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teema: sõnade semantilised seosed\nKriteeriumid:\n- sõnade semantiliste seoste analüüs (vastavalt juhendile ÕISis)\n- mõistete kasutamine ja keeleline korrektsus\n-  töö ülesehitus ja arutluskäik\nA: kõik juhendis nõutud analüüsipunktid on  põhjalikult ja korrektselt lahti seletatud; mõisteid on kasutatud õigesti, keelekasutus on eeskujulik; põhjalik, hästi jälgitav ja originaalne arutluskäik, tekst on sidus ja loogiliselt struktureeritud, üksikuid juhuslikke eksimusi võib esineda mõnes hinnatavas aspektis.\nB: analüüsipunktid on korrektselt lahti seletatud, üksikuid vigu võib esineda erandlike juhtumite korral; mõistete kasutamisel võib esineda üksikuid eksimusi, keelekasutus üldiselt korrektne; põhjalik ja hästi jälgitav arutluskäik, tekst on üldiselt sidus ja loogiliselt struktureeritud, kuid üksikud asspektid vähem lahti seletatud.\nC: analüüsipunktidele on üldjuhul õigesti vastatud, kuid kohati pealiskaudselt ja erandlike juhtumite puhul ilmneb puudujääke; mõisteid on üldiselt kasutatud õigesti, kuid esineb ebatäpsusi vähemlevinud terminite kasutuses, kohati esineb väheolulisi keelevigu; korralik ja hästi jälgitav iseseisev analüüs, kuid osa küsimusi pole piisavalt lahti seletatud. \nD: kõikidele juhendis nõutud analüüsipunktidele on vastatud, kuid sõnade semantiliste seoste analüüsis leidub vigu; mõistete kasutamine kohati ebaselge, esineb keelevigu, mis võivad häirida arusaamist; arutluskäik on kohati raskesti jälgitav.\nE: juhendis nõutud analüüsipunktidele on vastatud, kuid sõnade semantiliste seoste analüüsis leidub olulisi vigu; mõistete kasutamine sageli ebaselge, esineb korduvaid keelevigu, mis häirivad arusaamist; analüüs on seoste puudumise tõttu raskesti jälgitav.\nF: sõnade semantiliste seoste analüüs puudulik; mõistete kasutus vigane ja puudlik, rohked keelevead häirivad arusaamist; puudub iseseisev analüüs."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teema: sõnad sõnaraamatutes\nKriteeriumid:\n- lähteülesande täitmine (juhendi järgi ÕISis)\n- mõistete kasutamine ja keeleline korrektsus\n-  töö ülesehitus ja arutluskäik\nA: kõik juhendis nõutud analüüsipunktid on  põhjalikult ja korrektselt lahti seletatud; mõisteid on kasutatud õigesti, keelekasutus eeskujulik; põhjalik, hästi jälgitav ja originaalne arutluskäik, tekst on sidus ja loogiliselt struktureeritud, üksikuid juhuslikke eksimusi võib esineda mõnes hinnatavas aspektis.\nB: analüüsipunktid on korrektselt lahti seletatud, üksikuid vigu võib esineda erandlike juhtumite korral; mõistete kasutamisel võib esineda üksikuid eksimusi, keelekasutus üldiselt korrektne; põhjalik ja hästi jälgitav arutluskäik, tekst on üldiselt sidus ja loogiliselt struktureeritud, kuid üksikud aspektid vähem lahti seletatud.\nC: analüüsipunktidele on üldjuhul õigesti vastatud, kuid kohati pealiskaudselt ja erandlike juhtumite puhul ilmneb puudujääke; mõisteid on üldiselt kasutatud õigesti, kuid esineb ebatäpsusi vähemlevinud terminite kasutuses, kohati esineb väheolulisi keelevigu; korralik ja hästi jälgitav iseseisev analüüs, kuid osa küsimusi pole piisavalt lahti seletatud. \nD: kõikidele juhendis nõutud analüüsipunktidele on vastatud, kuid sõnaraamatu artiklite analüüsis leidub vigu; mõistete kasutamine kohati ebaselge, esineb keelevigu, mis võivad häirida arusaamist; arutluskäik on kohati raskesti jälgitav.\nE: juhendis nõutud analüüsipunktidele on vastatud, kuid osa juhendis nõutud tingimusi täitmata ja olulised vead sõnaraamatu artiklite analüüsis; mõistete kasutamine sageli ebaselge, esineb korduvaid keelevigu, mis häirivad arusaamist; analüüs on seoste puudumise tõttu raskesti jälgitav ja iseseisev panus küsitav.\nF: sõnaraamatu  artiklite analüüs puudulik; mõistete kasutus vigane ja puudlik, rohked keelevead häirivad arusaamist; puudub iseseisev analüüs."}}], "grade_preconditions": {"et": "Iseseisvate tööde esitamine, osavõtt vähemalt 2/3 seminaridest."}, "grade_evaluation": {"et": "Eksami koondhinne kujuneb iseseisva uurimistöö ja eksamitesti kombinatsioonis."}, "debt_elimination": {"et": "Iseseisvate tööde esitamine."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "8397c76d-3798-49a5-b75a-29f4dad3b26f", "type": "MOODLE", "code": "FLGR.03.154_2", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Gardes-Tamine, J. La Grammaire 1 /Phonologie, morphologie, lexicologie, Armand Colin Editeur, Paris, 1990"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": true}, {"name": {"et": "Pruvost, J. Les dictionnaires de la langue française : une histoire et une dynamique"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": true}, {"name": {"et": "GAUDIN, F., GUESPIN, L. Initiation à la lexicologie française. De la néologie aux dictionnaires, Editions Duculot, Bruxelles, 2000"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Picoche, J. Didactique du vocabulaire français, Editions Nathan, Paris, 1993"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Picoche, Jacqueline Précis de lexicologie française, série « Linguistique », Editions Nathan, Paris 1992"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Pruvost, J. Dictionnaires et nouvelles technologies, puf coll. écritures électroniques, Paris, 2000"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "REY, Alain La lexicologie. Lectures, Klincksieck, Paris, 1970"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Tréville, M-C., Duquette, L. Enseigner le vocabulaire en classe de langue, Hachette, 1996"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Béjoint, H., Thoiron, P. Les dictionnaires bilingues, Editions Duculot coll. Champs linguistiques, Paris, 1996"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Collinot, A., Mazière, F. Un prêt à parler: le dictionnaire, puf, Paris, 1997"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Depecker, L. L'invention de la langue Le choix des mots nouveaux, Larousse Armand Colin, Paris, 2001"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Révues: Mots, Lexiques, Cahiers de lexicologie, Banque des mots"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "0262d05b-a5a6-8738-fcc6-d088a412f0a0", "person_name": "Marge Käsper", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}, "entries": [{"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus leksika ja leksikoloogilisse uurimise arengutesse."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "(1) LEKSIKOGRAAFIA - Leksikograafia mõiste ja sõnaraamatute tüpoloogiad  \nSõnaraamatute makro- ja mikrostruktuur (artikli ülesehitus, definitsioonide tüübid, näidete tüübid)\nSõna esituse ja analüüsi arengud prantsuse leksikograafias\nDes dictionnaires anciens;  Exemples de discours."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "(2) MORFOLOOGIA - funktsionaalne vormianalüüs: sõna vorm, koostis ja muutused (leksikaalne morfoloogia) \nMorfoloogia, morfeem, allomorf. Liited. Sõna segmenteerimine morfeemideks. Morfeemide tüübid. Muutelõppude ja liidete toimemehhanismid. Pantsuse keele morfoloogia eripärad. Prantsuse keele nimisõna ja tegusõna morfoloogia.\nSõnatuletus, neologismid, laenud. Fraseoloogia ja leksikaliseerumine"}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "(3) LEKSIKAALNE SEMANTIKA - Sõnade omavahelised suhted ja kasutus\nSemantilised väljad, seemianalüüs. Sünonüümid, antonüümid, hüponüümia, hüperonüümia; \nPolüseemia/homonüümia ; Paradigmaatilised ja süntagmaatilised seosed; assotsiatiivsed, mõistelised väljad\nSõnavara analüüs keelekorpustes."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "6f5fa054-d2a3-ecc3-2c8d-a58e3a4130cc", "parent_code": "FLGR.03.154", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}