{"uuid": "453e9d76-3238-65a8-f4e2-e447bac29299", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-05T10:58:47", "title": {"en": "Spanish Literature", "et": "Hispaania kirjandus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 44, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course gives an overview of the main periods of Spanish literature and the principal authors. Main authors of Spanish literature are introduced, above all departing from translations of Spanish literature in Estonian.\nReception of Spanish literature in Estonia; Medieval literature, the Renaissance and the \"Golden Age\", 18th- and 19th-century literature; 20th-century literature (1898 generation, 1927 generation, etc.).", "et": "Kursusel antakse lühiülevaade hispaania kirjanduse ajaloo peaetappidest ning tutvutakse eeskätt tõlgitud kirjanduse põhjal hispaania kirjandusloo põhiautoritega.\nHispaania kirjanduse retseptsioon Eestis; keskaja kirjandus; renessanss ja \"kuldajastu\", XVIII ja XIX sajandi kirjandus; XX sajandi kirjandus (1898.a. põlvkond, 1927.a. põlvkond jm)"}, "objectives": [{"en": "The aim of the course is to provide the students basic knowledge about the major phenomen of Spanish Literature.", "et": "Õppeaine eesmärgiks on anda ülevaade hispaania kirjanduse ajaloo peaetappidest ja -nähtustest"}], "learning_outcomes": [{"en": "1)\tStudents taking the course will have knowledge about all major phenomena of Spanish literary history, its authors and works and their aesthetic-philosophic and ideological context from the Middle Ages till the end of the 20th century.", "et": "1)\tÕppeaine läbinud üliõpilane omab teadmisi kõigist hispaania kirjandusloo tähtsaimatest nähtustest, autoritest ja teostest ning nende seostest ajastu esteetilis-filosoofilise ja ideoloogilise kontekstiga alates keskajast kuni XX sajandi lõpuni.  "}, {"en": "2)\tA student has read at least 5 important literary Works (in Estonian translation) and is able to associate them with literary, historic and cultural context. ", "et": "2)\tÜliõpilane on lugenud vähemalt 5 olulisemat kirjandusteost (eestikeelseis tõlkeis) ning oskab neid seostada kirjandusliku ja ajaloolis-kultuurilise kontekstiga."}, {"en": "3)\tA student presents a review-essay (10 pages) about the the obligatory reading material of older Spanish literature and makes a presentation about a work of modern Spanish literature.", "et": "3)\tÜliõpilane esitab essee-referaadi (10 lk) vanema ja lähimineviku hispaania kirjandusest ja teeb ettekande tänapäeva hispaania kirjanduse teose põhjal."}], "notes": {}}, "grading": {"independent_work": {"et": "Semestri jooksul on üliõpilastele Moodle'is kättesaadavad õppejõu poolt salvestatud videoloengud ja nende abil on vajalik sooritada 4 testi (testid on kohustuslikud, aga mitte hindelised). Semestri lõpuks esitab iga kursusest osavõtja essee-referaadi (u 10 lk), mis käsitleb kohustusliku kirjanduse osas olevaid teoseid ja kolme teost osaliselt kohustusliku kirjanduse nimekirjast. Lisaks teeb üliõpilane ettekande vastavas nimekirjas olevatest 20. ja 21. sajandi hispaania kirjanduse teostest. Ettekanded toimuvad maikuu jooksul ja osavõtt nendest on kohustuslik."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Vajalik sooritada 4 testi (testid on kohustuslikud, aga mitte hindelised)."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Hinnatakse üliõpilase põhjalikku tutvumist teose teksti ja taustaga, lisamaterjali otsimise oskust, loovat lähenemist, oma vaatepunkti tutvustamist, esitluse köitvat ülesehitust."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Hinnatakse üliõpilase põhjalikku tutvumist teose teksti ja taustaga, lisamaterjali otsimise oskust, loovat lähenemist, kirjaliku töö koostamise ja sõnastamise oskust."}}], "grade_preconditions": {"et": "Hinde saamiseks peavad olema tehtud testid Moodle'is, esitatud essee-referaat ja ettekanne."}, "grade_evaluation": {"et": "Essee-referaat annab 60% hindest ja ettekanne 40%."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "949e1bdf-1b33-421c-8a9f-697633fbc91a", "type": "MOODLE", "code": "FLGR.03.198", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "KOHUSTUSLIK (ESSEE-REFERAAT, 30 % HINDEST):\nDon Quijote. I-II. Miguel de Cervantes Saavedra. Aita Kurfeldt. Eesti Raamat 1955; 1987-88; 2007.\nTormese Lazarillo elukäik. Eesti Raamat 1983. tõlkinud Jüri Talvet.\n\nOSALISELT KOHUSTUSLIK (VALIDA 3 TEOST, ESSEE-REFERAAT, 30% HINDEST):\nNäitlikud novellid . Miguel de Cervantes Saavedra, tõlkinud Lauri Pilter, Eva Kolli ja Aita Kurfeldt, värsid tõlkinud Jüri Talvet ja Lauri Pilter. Tartu: Tartu Ülikooli Kirjastus, 2016\nCelestina. Fernando de Rojas. Tõlkinud Jüri Talvet. Tartu Ülikooli kirjastus, 2023.\nKaneelist torn. García Lorca, Federico, Tln.: ER 1966; uus, parandatud ja täiendatud väljaanne: Mu kätes on tuli, Tln: Vagabund 1997.\nTaru. Camilo José Cela, tõlkija Inna Kustavus, Eesti Raamat 1987.\nPlatero ja mina. Juan Ramón Jiménez. Asta Põldmäe, Eesti Raamat 1989.\nElu on unenägu. Pedro Calderón de la Barca. Jüri Talvet, Kunst 1999.\nKüpressil on kitsas vari. Miguel Delibes. Inna Kustavus, Eesti Raamat 1991.\nKäsioraakel ja arutluse kunst. Baltasar Gracián, Jüri Talvet, Eesti Raamat 1993.\nValik luulet. Francisco de Quevedo. Jüri Talvet, 1987.\nSevilla pilkaja ja kivist külaline. Tirso de Molina. Jüri Talvet, Tartu, 2006.\nSüdame ajalugu. Aleixandre, Vicente.Ain Kaalep ja Jüri Talvet, 1978.\nUdu. Miguel de Unamuno, Ruth Lias, Tartu: TÜK, 2009.\nTürann Banderas. Ramón María del Valle-Inclán. Aita Kurfeldt, 1968.\nKeskaja hispaania luule / Poesía medieval española. Tartu: TÜ 1998. koostanud Jüri Talvet.\nKrahv Lucanor. Juan Manuel. tõlkinud ja saatesõna kirjutanud Lauri Pilter, Tartu Ülikooli Kirjastus, 2019 \nSonaadid. Ramón María del Valle-Inclán. Ruth Lias, Tallinn, Eesti Raamat, 2002.\n\nETTEKANNE (VALIDA 1, 40% HINDEST)\n1. Dublinesk Enrique Vila-Matas, tõlkinud Triin Lõbus, järelsõna Ruth Sepp Toledo Kirjastus, 2014  \n2. Pariisile ei tule iial lõppu  Enrique Vila-Matas. tõlkinud Kai Aareleid; järelsõna: Ruth Sepp, LR 2014 \n3. Kuidas vaadata vett Julio Llamazares, tõlkinud Madis Kuuse ja Mari Laan, Toledo 2020 \n4. Kollane vihm Julio Llamazares, Mariliin Vassenin, Tallinn: Pegasus 2007. \n5. Salamise sõdurid  Javier Cercas; Mari Laan, Toledo Kirjastus, 2015  \n6. Piiriseadused  Javier Cercas; tõlkinud Riina Roasto ; saatesõna autor Consuelo Rubio, Toledo 2018 \n7. Asjad kutsuvad meid Juan José Millás; tõlkinud Kai Aareleid ja Margarita Kuusmaa, LR, 2013 \n8. Talv Lissabonis Antonio Muñoz Molina; Triin Lõbus. Toledo, 2018 \n9. Gurbilt teateid ei ole. Eduardo Mendoza; Maarja Paesalu; Toledo kirjastus, 2017  \n10. Oxfordi romaan ehk kõik hinged. Javier Marías; tõlkinud Kai Aareleid, Varrak, 2012  \n11. Isamaa Fernando Aramburu, Maria Kall, Toledo 2020 \n12. Nii valge süda. Javier Marías, Marin Mõttus, Varrak, 2002. \n13. Armumised. Javier Marías, Ruth Sepp, Toledo 2024.\n14. Õnnelik lõpp. Isaac Rosa Toledo, Marianne Ots, Toledo, 2024 \n15. Lõunas. Bene. Adelaida García Morales. Lembit Liivak. LR 1998. \n16. Õmblejanna Madriidist.  María Dueñas, Mari Laan, Kristiina Raudsepp, Toledo, 2016.\n17. Manolito Prillipapa. Elvira Lindo, Eva Kolli, Valgus, 2001 \n \nTEOSED, MIDA VÕIB VALIDA ETTEKANDEKS, KUI EELNEV NIMEKIRI ON AMMENDUNUD: \n\n18. Hurm ja pimedus Rosa. Montero, Marin Mõttus, LR 1996. \n19. Terra Alta. Javier Cercas, Merilin Kotta, Varrak 2020 \n20. Patty Diphusa ja teisi tekste. Pedro Almodóvar. Eva Kolli, Tänapäev 2005 \n21. Lõuna kuninganna. Arturo Pérez-Reverte. Kai Areleid, Varrak 2011 \n22. Elio ehk Üks animatograafiline lugu. Diego Arboleda, Raúl Sagospe. Ehte Puhang. 2019. \n23. Tramm Šiša Pangmale. Unai Elorriaga, Triin Lõbus, LR 2015 \n24. Bartleby & Co Enrique Vila-Matas. tõlkinud ja saatesõna kirjutanud Kai Aareleid, LR 2020\n25. Kirjapandud elud. Javier Marías, Maria Kall LR 2010", "recommended_materials": "SOOVITUSLIK LUGEMINE:\nJüri Talvet, Hispaania vaim. Tartu: Ilmamaa 1995\nJüri Talvet, El hispanismo en Estonia. Tartu: TÜ kirjastus 1996.\nJüri  Talvet, Tõrjumatu äär. Tartu: Ilmamaa, 2005. (käsitlused hispaania kirjandusest)\nJüri  Talvet, Teekond Hispaaniasse. Tallinn: LR 1985 (või sama raamatus: Hispaaniast Ameerikasse. Tallinn: Eesti Raamat 1992).\n F.Tuglas, Teekond Hispaania (F.Tuglas, Reisikirjad. Tallinn: ERK 1956 või ka F.Tuglas, Kogutud teosed. 5.kd. Tallinn: Eesti Raamat 1989).\n\nAlarcón, Pedro Antonio de. Kolmnurkkübar. Ruth Lias, Tln.: ER 2001.\nAzorín. Väikese filosoofi pihtimused. Tiiu Põder, Asta Põldmäe, Tln.: LR 1980.\nBaroja, Pío. Tee täiusele. Justa Kurfeldt. Tartu-Tallinn 1938.\nBaroja, Pío. Vagabund Elizabide. Asta Põldmäe, Jüri Talvet, Tln.: LR 1979.\nBlasco Ibáñez, Vicente. Neetud maa. Tartu, Aleks Sepp, 1934.\nCalderón de la Barca, Pedro. Nähtamatu daam (Rmt: Hispaania pärand, Tln., 2004)\nCalderón de la Barca, Pedro. Armastusega ei tehta nalja. (Rmt: Hispaania pärand, Tln. 2004)\nCalderón de la Barca, Pedro. Suur maailmateater. Jüri Talvet. Tartu, 2006.\nCela, C. J. Apelsin on talvine vili. Ants Viir, Ott Ojamaa, Tln.: LR 1977.\nCervantes, Miguel de. Koerte kõnelus. Aita Kurfeldt, Tln.: ER 1972.\nGómez de la Serna, R. Gregeriiad. Jüri Talvet, Tln.: LR 1974.\nGómez de la Serna, R. El Greco. Asta Põldmäe, Ain Kaalep, Tln.: Kunst 1990.\nOrtega y Gasset, José. Masside mäss. Ruth Lias, Tln: Vagabund, 2002 (ka: \"Akadeemia\" 1991 nr.8-12 ja 1992, nr. 1-2).\nPérez Galdós, B. Osatu, Aita Kurfeldt, Tln.: ER 1979.\nUnamuno, Miguel de, Abel Sánchez. Ruth Lias, Tln.: LR 1989.\n Miguel de Unamuno Püha Manuel Hea, märter; hispaania keelest tõlkinud ja järelsõna Lembit Liivak 2011\nUnamuno, Miguel de. Inimeste ja rahvaste traagilisest elutundest. Ruth Lias, Jaan Unt, Tartu: Ilmamaa 1996.\nUnamuno, Miguel de; Kristluse agoonia, Ruth Lias, Ilmamaa 2009.\nUnamuno, Miguel de. Armastus ja pedagoogika. Kolm näitlikku novelli ja proloog. \nUnamuno, Miguel de. Malemängija don Sandalio romaan, Helina Aulis, Mari Kruse, Riina Roasto, TÜ kirjastus, 2011\nVega Carpio, Lope de, Sevilla täht. Ain Kaalep, Tln.: LR 1962.\nVega Carpio, Lope de, Tantsuõpetaja. (Rmt. Hispaania pärand, Tln, 2004)\nHispaania pärand: \"Kuldajastu\" komöödia August Sanga ja Aleksander Kurtna tõlkes;  Miguel de Cervantes, Lope de Vega, Pedro Calderón de la Barca; koostaja ja vastutav väljaandja Riina Schutting ; toimetaja Jüri Talvet ; 2004 \nMõõn Juan Goytisolo, tõlkinud Tatjana Hallap, Tln.: LR 1974.\nMatute, A. M. Sõdurid nutavad öösel. Aita Justa Kurfeldt, Tln.: ER 1971."}, "participants": {"lecturers": [{"person_uuid": "311b47bf-6d91-a862-8939-85cb52516b52", "person_name": "Klaarika Kaldjärv", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"time": "2025-02-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus. Hispaania riigid ja keeled, Al-Andalus, rekonkista, kristlikud riigid, Alfonso X, Cid."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Romanss, keskaja luule, Manrique, Celestina."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Renessanss, rüütliromaanid, kelmiromaan."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Müstikud, barokk, Lope de Vega."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Tirso de Molina, Don Juan, Calderón de la Barca."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Góngora, Quevedo, Gracián."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Don Quijote 1-2."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Don Quijote 3-4."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Don Quijote 5-6."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "18. sajand, 19. sajand."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "20. sajand I-II"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "20. sajand III-IV"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "üliõpilaste ettekanded"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "üliõpilaste ettekanded"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "üliõpilaste ettekanded"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "üliõpilaste ettekanded"}}]}, "registration_info": {"audience": {"et": "Romanistika suunamoodul + kõrvalaine soovijatele"}, "min_students": 5, "max_students": 20}, "parent_uuid": "d6bd6c4a-8804-a77f-90d0-7e38f0e4f048", "parent_code": "FLGR.03.198", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}