{"uuid": "534af67a-d136-615e-a0dc-7967346505f8", "code": "FLGR.03.179", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Oral and Written French I", "et": "Prantsuse keele suulise ja kirjaliku väljenduse õpetus I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is a training of oral and written expression on the independent user's level (B1-B2), to assure an equal level for new students in the French Department. The training of oral speech involves various topics and is based on different types of texts. The oral exercises concern more precisely French pronunciation. The course also includes practical training in written expression: the students are required to hand in a certain number of written papers and essays, which are analyzed and commented on by the lecturer. Above all, the course works on (1) formal letters and (2) literary and film critics. The course includes also a work on spelling by dictations and individual correction of homework.", "et": "Kursusel arendatakse prantsuse keele suulist ja kirjalikku väljendusoskust iseseisva keelekasutaja tasemel (B1-B2). Suulise väljendusoskuse harjutamisel käsitletakse erinevaid teemasid ja erinevaid tekstitüüpe. Suulised harjutused keskenduvad prantsuse keele hääldamisele. Kirjaliku väljendusoskuse harjutamiseks tuleb üliõpilastel esitada nõutud arv kirjalikke töid, mida seminarides kommenteeritakse. Käsitletakse eelkõige järgmisi tekstiliike: 1) ametlikud kirjad ja 2) kirjandus- ja filmikriitika. Kursusel harjutatakse ka õigekirja etteütlustes ja kodutöödes."}, "objectives": [{"en": "Training of oral and written expression.", "et": "Täiendada prantsuse keele suulist ja kirjalikku väljendusoskust edasijõudnu tasemel"}], "learning_outcomes": [{"en": "The students:", "et": "Aine edukalt läbinud üliõpilane:"}, {"en": "1)  can interact with a degree of fluency and spontaneity in regular interaction with native speakers and take an active part in discussion in familiar contexts, accounting for and sustaining his views;", "et": "1) suudab raskusteta suhelda igapäevasituatsioonis emakeelsete kõnelejatega ning on võimeline osa võtma aruteludest tuttavatel teemadel ja oma arvamust avaldama;"}, {"en": "2) can describe experiences and events, narrate a story or relate the plot of a book or film and describe his reactions;", "et": "2) oskab kirjeldada kogemusi ja sündmusi, jutustada lugu, edasi anda raamatu või filmi sisu;"}, {"en": "3) can present clear, detailed descriptions on a wide range of subjects and explain a viewpoint on a topical issue giving the advantages and disadvantages of various options;", "et": "3) on võimeline selgelt käsitlema ainest laias teemaderingis, selgitama oma seisukohti aktuaalsetel teemadel, tuues välja poolt- ja vastuargumendid;"}, {"en": "4) can write clear, detailed text on a wide range of subjects which are familiar or of personal interest;", "et": "4) oskab kirjutada selgeid tekste tuttavatel ja huvipakkuvatel teemadel;"}, {"en": "5) can write an essay or a report, passing on information or giving reasons in support of or against a particular point of view, and is able to write summaries and reviews of professional or literary works.", "et": "5) suudab kirjutada esseed, aruannet või referaati, kommenteerides ja põhjendades oma seisukohti, ning ülevaateid raamatutest või artiklitest"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}