{"uuid": "012c9698-68c4-5398-92fd-d05590c355ca", "code": "hv-2024-spring-fulltime-p2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-20T11:35:09", "title": {"en": "Oral and Written French I", "et": "Prantsuse keele suulise ja kirjaliku väljenduse õpetus I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular part 2 3 CP HV", "et": "24/25 K PÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "fr", "et": "prantsuse keel", "en": "French"}], "description": {"en": "The course is a training of oral and written expression on the independent user's level (B1-B2), to assure an equal level for new students in the French Department. The training of oral speech involves various topics and is based on different types of texts. The oral exercises concern more precisely French pronunciation. The course also includes practical training in written expression: the students are required to hand in a certain number of written papers and essays, which are analyzed and commented on by the lecturer. Above all, the course works on (1) formal letters and (2) literary and film critics. The course includes also a work on spelling by dictations and individual correction of homework.", "et": "Kursusel arendatakse prantsuse keele suulist ja kirjalikku väljendusoskust iseseisva keelekasutaja tasemel (B1-B2). Suulise väljendusoskuse harjutamisel käsitletakse erinevaid teemasid ja erinevaid tekstitüüpe. Suulised harjutused keskenduvad prantsuse keele hääldamisele. Kirjaliku väljendusoskuse harjutamiseks tuleb üliõpilastel esitada nõutud arv kirjalikke töid, mida seminarides kommenteeritakse. Käsitletakse eelkõige järgmisi tekstiliike: 1) ametlikud kirjad ja 2) kirjandus- ja filmikriitika. Kursusel harjutatakse ka õigekirja etteütlustes ja kodutöödes."}, "objectives": [{"en": "Training of oral and written expression.", "et": "Täiendada prantsuse keele suulist ja kirjalikku väljendusoskust edasijõudnu tasemel"}], "learning_outcomes": [{"en": "The students:", "et": "Aine edukalt läbinud üliõpilane:"}, {"en": "1)  can interact with a degree of fluency and spontaneity in regular interaction with native speakers and take an active part in discussion in familiar contexts, accounting for and sustaining his views;", "et": "1) suudab raskusteta suhelda igapäevasituatsioonis emakeelsete kõnelejatega ning on võimeline osa võtma aruteludest tuttavatel teemadel ja oma arvamust avaldama;"}, {"en": "2) can describe experiences and events, narrate a story or relate the plot of a book or film and describe his reactions;", "et": "2) oskab kirjeldada kogemusi ja sündmusi, jutustada lugu, edasi anda raamatu või filmi sisu;"}, {"en": "3) can present clear, detailed descriptions on a wide range of subjects and explain a viewpoint on a topical issue giving the advantages and disadvantages of various options;", "et": "3) on võimeline selgelt käsitlema ainest laias teemaderingis, selgitama oma seisukohti aktuaalsetel teemadel, tuues välja poolt- ja vastuargumendid;"}, {"en": "4) can write clear, detailed text on a wide range of subjects which are familiar or of personal interest;", "et": "4) oskab kirjutada selgeid tekste tuttavatel ja huvipakkuvatel teemadel;"}, {"en": "5) can write an essay or a report, passing on information or giving reasons in support of or against a particular point of view, and is able to write summaries and reviews of professional or literary works.", "et": "5) suudab kirjutada esseed, aruannet või referaati, kommenteerides ja põhjendades oma seisukohti, ning ülevaateid raamatutest või artiklitest"}], "notes": {}}, "grading": {"independent_work": {"et": "Exercices d'écriture à faire chez soi pour évaluer les compétences apprises en cours.\nPréparation d'un exposé oral en fin de semestre.\nDivers exercices (écrits et oraux) en lien avec les activités de cours (p. ex. finir les exercices commencés en cours)\n\nConsignes fournies au cours du semestre selon la progression du travail.\n\nLes travaux écrits sont remis à l'enseignant sur Moodle ou par e-mail au format .doc, .docx, .rtf."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Critères d'évalution\n\"A\" (100%-91%): L'étudiant ne fait aucune erreur d'orthographe, de grammaire ou de conjugaison, ou seulement quelques erreurs aléatoires. Il utilise ses connaissance correctement et de manière créative. Le vocabulaire requis est acquis.\n\"B\" (90%-83%): L'étudiant fait quelques erreurs d'orthographe, de grammaire ou de conjugaison. Il utilise ses connaissances de l'ensemble correctement et de manière créative. Le vocabulaire requis dans la grande majorité acquis.\n\"C\" (82%-75%): L'étudiant fait des erreurs d'orthographe, de grammaire ou de conjugaison. Il utilise ses connaissances mais se contente de ce qui a été appris. Le vocabulaire requis globalement acquis\n\"D\" (74%-68%): L'étudiant fait des erreurs basiques d'orthographe, de grammaire ou de conjugaison. Il utilise ses connaissances mais a de nombreux oublis. Le vocabulaire requis globalement\n\"E\" (60% -67%): L'étudiant a une certaine connaissance de l'orthographe, de la grammaire et de la conjugaison française. Il est capable de synthétiser la langue à l'aide de schémas appris. Il a appris le minimum requis de vocabulaire.\n\"F\" = FAIL (0% -59%): Les compétences de l'étudiant en orthographe, grammaire et conjugaison ne sont clairement pas suffisantes. Il n'est pas capable de synthétiser la langue de manière satisfaisante. Il n'a pas acquis le vocabulaire requis."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Critères d'évalution\n\"A\" (100%-91%): L'étudiant ne fait aucune erreur de grammaire ou de conjugaison, ou seulement quelques erreurs aléatoires. Il utilise ses connaissance correctement et de manière créative. Le vocabulaire requis est acquis.\n\"B\" (90%-83%): L'étudiant fait quelques erreurs de grammaire ou de conjugaison. Il utilise ses connaissances de l'ensemble correctement et de manière créative. Le vocabulaire requis dans la grande majorité acquis.\n\"C\" (82%-75%): L'étudiant fait des erreurs de grammaire ou de conjugaison. Il utilise ses connaissances mais se contente de ce qui a été appris. Le vocabulaire requis globalement acquis\n\"D\" (74%-68%): L'étudiant fait des erreurs basiques de grammaire ou de conjugaison. Il utilise ses connaissances mais a de nombreux oublis. Le vocabulaire requis globalement\n\"E\" (60% -67%): L'étudiant a une certaine connaissance de la grammaire et de la conjugaison française. Il est capable de synthétiser la langue à l'aide de schémas appris. Il a appris le minimum requis de vocabulaire.\n\"F\" = FAIL (0% -59%): Les compétences de l'étudiant en grammaire et conjugaison ne sont clairement pas suffisantes. Il n'est pas capable de synthétiser la langue de manière satisfaisante. Il n'a pas acquis le vocabulaire requis.\n"}}], "grade_preconditions": {"et": "Les différents travaux exigés au cours du semestre ont été effectués.\nSix absences maximum autorisées."}, "grade_evaluation": {"et": "Exercices écrits et oraux réalisés au cours du semestre (30 %)\nExamen écrit (35 %)\nExposé oral (35 %)"}, "grade_conditions": {"A": {"et": "Koondhinne : 91-100 %"}, "B": {"et": "Koondhinne : 83-90.99 %"}, "C": {"et": "Koondhinne : 75-82.99 %"}, "D": {"et": "Koondhinne : 68-74.99 %"}, "E": {"et": "Koondhinne : 60-67,99 %"}, "F": {"et": "Koondhinne : 0-59.99 %"}}, "debt_elimination": {"et": "En accord avec l'enseignant."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "e8e7706a-7931-4e5b-a626-2c4beb50ab1c", "type": "MOODLE", "code": "FLGR.03.179", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "f906f6b5-6ff5-162b-00f5-d70819ff077b", "person_name": "Vincent Dautancourt", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "3e8d4953-584b-62c0-a17c-40880d943e2f", "person_name": "Léa Pillot--Colin", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 20}, "parent_uuid": "534af67a-d136-615e-a0dc-7967346505f8", "parent_code": "FLGR.03.179", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}