{"uuid": "6eb862bd-11b2-de0f-927f-67bdbbe817ac", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-03T13:32:34", "title": {"en": "Seminar in Discourse Analysis", "et": "Diskursuseanalüüsi seminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 6, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course introduces the notion of discourse and its interdisciplinary application in different subfields of English Studies: linguistics, literature, culture studies and ELT. The course introduces argumentation techniques and discourses used in English-language texts as well as methods suitable for analyzing them. The course will cover both spoken and written texts in different subfields of English Studies, analyzing argumentation techniques, structural principles and cultural-ideological discourses used in the texts. The analysis of texts supports the development of students' skills of oral and written expression in English, but also critical reading and analysis skills necessary in conducting their own independent research.", "et": "Kursus tutvustab diskursuse mõiste ja selle rakendamisvõimalusi erinevates anglistika alavaldkondades (keele- ja kirjandusteaduses, kultuuriuuringutes, keeleõppes).\nKursus tutvustab ingliskeelsetes tekstides kasutatavaid argumentatioonivõtteid ja diskursusi ning tekstide ja diskursuste analüüsiks sobivaid meetodeid. Vaadeldakse nii suulisi kui kirjalikke tekste, analüüsides neis kasutatavaid argumentatsioonivõtteid, struktuurilist ülesehitust, kultuurilis-ideoloogilisi diskursusi. Tekstide analüüs toetab üliõpilaste ingliskeelse suulise ja kirjaliku väljenduse oskuse arengut, aga ka iseseisvaks uurimistööks vajalike kriitilise lugemise ja analüüsi oskust."}, "objectives": [{"en": "The course introduces the concept of discourse and the range of its applications in different subfields of English Studies (linguistics, literature, culture studies, language teaching). The course introduces argumentation techniques and discourses used in English-language texts as well as methods suitable for analyzing them. The course will cover both spoken and written texts in different subfields of English Studies. Students will read and analyze different text types, including academic research articles, honing their skills of critical reading necessary for their own independent research.", "et": "Kursuse eesmärgiks on tutvustada diskursuse mõistet ja selle rakendusvõimalusi erinevates anglistika valdkondades (keele- ja kirjandusteaduses, kultuuriuuringutes, keeleõppes). Kursus tutvustab ingliskeelsetes tekstides kasutatavaid argumentatsioonivõtteid ja diskursusi ning tekstide ja diskursuste analüüsiks sobivaid meetodeid. Vaadeldakse nii suulisi kui kirjalikke tekste anglistika erinevates alavaldkondades. Loetakse ja analüüstakse erinevaid tekstitüüpe, sh akadeemilisi tekste, mille kaudu üliõpilased harjutavad oma uurimistöödes vajalikku kriitilise lugemise oskust."}], "learning_outcomes": [{"en": "Students get an overview of the interdisciplinary possibilities of discourse analysis and are able to use its methods in their own research. After completing the course, students can recognize discourses prevalent in English-speaking cultures and can compare them to the Estonian ones. They acquire methods suitable for analyzing different English-language text types and the ability to apply them also in their own work. They also learn to critically analyze the uses of discourse analysis in scholarly literature. Students develop the skill of critical reading and text analysis, ability to work with English-language academic texts, skill of academic writing.", "et": "Kursuse tulemusena  omandavad üliõpilased ülevaate diskursusanalüüsi interdistsiplinaarsetest võimalustes ning oskavad selle põhimeetodeid oma uurimustöös rakendada. Nad tunnevad  ära ingliskeelsetes kultuurides käibivaid diskursusi ning oskavad neid Eesti omadega võrrelda. Nad omandavad erinevate ingliskeelsete tekstitüüpide analüüsiks sobivaid võtteid ja õpivad ka kriitiliselt analüüsima diskursusanalüüsi kasutust teaduskirjanduses. Üliõpilased arendavad kriitilise lugemise ja tekstide lähianalüüsioskust, oskust töötada ingliskeelsete tekstidega ning akadeemilise kirjaliku eneseväljenduse oskust."}], "notes": {}}, "grading": {"independent_work": {"et": "1. iseseisev praktiline tekstianalüüs\n2. lõpuessee, milles analüüsitakse diskursuse mõiste rakendust mingis teadusartiklis.\nTäpsemad juhised on kättesaadavad Moodle'is"}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Üliõpilased viivad läbi praktilise tekstianalüüsi (2-3 lk) enda poolt valitud teksti baasil kodueksami vormis, kasutades kursuse jooksul tutvustatud meetodeid ja termineid. Maksimaalsed punktid saavad üliõpilased, kes suudavad teksti analüüsiks valida sobiva meetodi niing seda korrektselt ja järjekindlalt teksti analüüsis kasutada. Õpetajakoolituse tudengitel soovitatakse sooritada kas mingi õppematerjali analüüs või enda poolt tunnis kasutatava keele vestlusanalüüs. Mitte-süstemaatiline lähenemine või terminoloogilised vead, samuti puudulik eneseväljendusoskus vähendavad punkte. Negatiivse hinde saavad üliõpilased, kelle töö sisaldab plagiaati."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Üliõpilased kirjutavad analüütilise essee (1500-1800 sõna) teadusartikli teemal. Üliõpilased valivad oma huviala mingile aspektile pühendatud teadusartikli ning analüüsivad seda kriitiliselt. Essee peaks andma kokkuvõtte valitud artiklist (mitte rohkem kui 1/3 essee mahust!), kuid selle põhiosa peaks olema pühendatud teksti süvaanalüüsile. Maksimaalsed puntid saab essee, mille keskmeks on artiklis defineeritud terminid, uurimistöös kasutatav metoodika ja selle sobivus püstitatud küsimuste lahendamiseks ning mis analüüsib argumenteeritud nende aspektide kasutust antud artiklis. Essee ei  refereeri ainult artikli sisu, vaid väljendab ka analüüsija kritiilist suhestumist kirjutatusse, mida peavad toetama konkreetsete näidetega illustreeritud väited. Puhtalt referatiivsed tööd saavad madalama hinde. Plagieeritud tööd saavad 0 punkti ja üliõpilane saab automaatselt negatiivse hinde."}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Seminarides osalemine on kohtuslik, kuna seminarides harjutatakse mõlemaks hinnatavaks tööks vajalikke oskusi. Hinnatakse nii kohalkäimist kui aktiivset osalust seminaris ja rühmatöödes. "}}], "min_points_from_tests": 50, "grade_preconditions": {"et": "Jooksvate harjutuste ja praktilise tekstianalüüsi õigeaegne sooritamine ja lõpuessee kirjutamine."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb 3 komponendist:\n1. aktiivne osalus seminarides (20%)\n2.praktiline tekstianalüüs (40%)\n3. analüütiline essee (40%)"}, "debt_elimination": {"et": "Mõjuvate põhjuste puhul on võimalik paluda kirjalikele tööde esitamiseks lisaaega. Hilinemisega esitatud tööd võivad saada madalama hinde."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "f3f2029b-591f-4d74-97e0-aa1de8d901d1", "type": "MOODLE", "code": "FLGR.01.181_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Kursuse jooksul Moodle'i keskkonnas kättesaadavaks tehtud artiklid", "recommended_materials": "Brown, Gillian and George Yule. 1983. Discourse Analysis. Cambridge: Cambridge UP.\nSchiffrin, Deborah, Deborah Tannen and Heidi E. Hamilton (eds). 2003. The Handbook of Discourse Analysis. Malden and Oxford: Blackwell Publishing. \nVan Dijk, Teun A. (ed). 1997. Discourse Studies. A Multidisciplinary Introduction. Vols. I-II. London and Thousand Oaks: Sage."}, "participants": {"lecturers": [{"person_uuid": "7c940156-1b65-df4f-a452-da4549ded130", "person_name": "Raili Marling", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "03e47ac8-8f69-799f-63b2-21aa0d6dc2b3", "person_name": "Susanna Soosaar", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}, "entries": [{"course_week": 1, "time": "2024-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Introduction Text and discourse analysis"}}, {"course_week": 1, "time": "2024-10-11", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "Language forms and functions. Read text by McCarthy on Moodle"}}, {"course_week": 1, "time": "2024-11-01", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "Discourse, vocabulary and grammar. Pick your text for practical analysis"}}, {"course_week": 1, "time": "2024-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Text analysis practice"}}, {"course_week": 1, "time": "2024-11-15", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {}, "description": {"et": "Practical text analysis deadline!"}}, {"course_week": 1, "time": "2024-11-23", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "Academic texts"}}, {"course_week": 1, "time": "2024-12-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Practice of analyzing academic texts"}}, {"course_week": 1, "time": "2024-12-20", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {}, "description": {"et": "Deadline for submission of article abstracts for the final paper"}}, {"course_week": 1, "time": "2025-01-06", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {}, "description": {"et": "Deadline for final essays"}}]}, "registration_info": {"audience": {"et": "Võõrkeeleõpetaja õppekava 2. aasta üliõpilased"}, "min_students": 5}, "parent_uuid": "cb25628f-3d9d-eeb1-d68c-21e683eea510", "parent_code": "FLGR.01.181", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}