{"uuid": "8b6f7e4e-388b-23a7-6a75-ceb7e253fa23", "code": "FLGR.01.206", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-26T09:39:45", "title": {"en": "English-Canadian Multicultural Writing", "et": "Kanada ingliskeelne multikultuuriline kirjandus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is based on a comparative analysis of the theory of Canadian multiculturalism and the experience of living in Canadian multicultural society. In order to understand the literary as well as historical and cultural contexts of Canadian Aboriginal and immigrant writing, the course first provides basic knowledge of the formation of Canadian population and Canada's development from a bicultural to a multicultural nation. In the seminars the works by a number of Native, Inuit, European, Asian and Black Canadian authors are analysed, with an aim to learn to see and understand the problems and issues faced by different individuals and communities as well as Aboriginal and immigrant generations in Canada. The course ends with an insight into the current debates in Canadian society concerning multiculturalism and its limits.", "et": "Kursus on üles ehitatud Kanada multikultuurilisuse teooria ja Kanada multikultuurilises ühiskonnas elamise kogemuse võrdlevale analüüsile. Kanada põlisrahvaste ja sisserändajate loomingu kirjanduslike aga ka ajalooliste ja kultuuriliste taustade mõistmiseks annab kursus kõigepealt alusteadmised Kanada rahvastiku kujunemisest ning Kanada arengust kahekultuurilisest maast multikultuuriliseks. Seminarides analüüsitakse terve rea indiaani, inuiti ning Euroopa, Aasia ja Aafrika päritolu autorite loomingut, et õppida nägema ja mõistma probleeme ja küsimusi, millega on silmitsi erinevad indiviidid ja kogukonnad ning põlisrahvaste ja sisserändajate põlvkonnad Kanadas. Kursuse lõpetab sissevaade käesoleval ajal Kanada ühiskonnas toimuvatesse aruteludesse multikultuurilisusest ja selle piiridest."}, "objectives": [{"en": "To provide an overview of Canadian literature in English by Native, Inuit, European, Asian and Black Canadian authors as well as its contexts. To develop the skills of literary analysis as well as introduce the development of Canadian multicultural society and its problems.", "et": "Anda ülevaade Kanada indiaani ja inuiti ning Euroopa ja Aasia päritolu ja mustanahaliste autorite ingliskeelsest kirjandusest ja selle kontekstidest. Arendada kirjandusanalüüsi oskusi ning tutvustada Kanada multikultuurilise ühiskonna kujunemist ja probleeme."}], "learning_outcomes": [{"en": "On completion of the course the student knows the main factors and characteristic features of the development of Canadian population and multicultural society, knows the works of major authors of Canadian multicultural literature in English, can analyse and appreciate the literary qualities of these works as well as knows their literary, historical, cultural, political and social contexts. On the example of Canada, the course lays the foundations to an ability to identify and understand the problems of other multicultural literatures and societies.", "et": "Kursuse lõpuks teab üliõpilane Kanada rahvastiku ja multikultuurilise ühiskonna kujunemise peamisi tegureid ja iseloomulikke jooni, tunneb Kanada ingliskeelse multikultuurilise\nkirjanduse olulisemate autorite teoseid, oskab analüüsida ja hinnata nende teoste kirjanduslikke kvaliteete ning tunneb teoste kirjanduslikke, ajaloolisi, kultuurilisi, poliitilisi ja ühiskondlikke kontekste. Kanada näitel paneb kursus aluse oskusele näha ja mõista teiste multikultuuriliste kirjanduste ja ühiskondade problemaatikat."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}