{"uuid": "600fdf8e-af96-08f9-d3fe-06e6a99f693f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-10T14:09:08", "title": {"en": "How to Comprehend Folklore? From Folklore Scholar to the Teacher", "et": "Kuidas mõista rahvaluulet? Folkloristilt õpetajale"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU04", "structural_unit_name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 2, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course revises basic folkloristic concepts, gives an overview of different folklore genres (incl. fairy tale, legend, folk song) and demonstrates how folklore texts can be analysed as well as used for practicing different skills. In addition, the course explores folk religion, customs and various other non-textual traditional phenomena as well as cultural diversity in Estonian context.", "et": "Kursusel korratakse folkloristika põhimõisteid, käsitletakse erinevaid rahvaluulezhanre (sh muinasjutt, muistend, rahvalaul) ning õpitakse rahvaluuletekste erinevatest aspektidest analüüsima ja mitmesuguste oskuste ning pädevuste harjutamiseks kasutama. Samuti käsitletakse kursusel usundit ja kombestikku ning teisi mitte-tekstilisi rahvaluulenähtusi ja arutletakse mitmekultuurilisuse üle Eestis."}, "objectives": [{"en": "The course familiarises students with approaches in contemporary folklore studies and with possibilities for teaching folklore in school. By means of seminars, readings and practical exercises, students acquire knowledge and skills for creating exercises on folklore topics, for supervising research papers on folklore related topics and for integrating different subjects by means of folklore.", "et": "Kursus tutvustab rahvaluule õpetamise võimalusi põhikoolis ja gümnaasiumis lähtudes tänapäeval folkloristikas käibivatest seisukohtadest ja meetoditest ning riiklikes õppekavades ja ainekavades seatud eesmärkidest. Seminaride ja iseseisvate ülesannete toel omandatakse teadmised ja oskused rahvaluuleteemaliste ülesannete koostamiseks ja uurimistööde juhendamiseks ning rahvaluule kasutamiseks erinevate õppeainete lõimimiseks."}], "learning_outcomes": [{"en": "Upon completing the course, students have an overview of theoretical and methodological tenets of contemporary folkloristics and are capable of applying them in teaching. Students know how to create exercises using folklore texts and how to conduct and supervise qualitative research projects on folkloristic topics that increase pupils' awareness of folklore's role in daily life and of their own role as bearers of various traditions. Participants are capable of using folklore to enhance oral and written self-expression skills, to develop critical thinking as well as to integrate various subjects.", "et": "Kursuse läbijad saavad ülevaate tänapäeva folkloristikas käibivaist seisukohtadest ja meetoditest ning oskavad neid õpetajatöös rakendada, sh koostada rahvaluuleteemalisi ülesandeid ja juhendada uurimistöid, mis kasvatavad õpilaste teadlikkust folkloori rollist igapäevaelus ning neist endist pärimuse loojate ja kandjatena. Kursusel osalejad omandavad ka pädevuse kasutada rahvaluulet suulise ja kirjaliku eneseväljenduse ja analüüsivõime arendamiseks ning erinevate õppeainete lõimimiseks ja õppekava läbivate teemade käsitlemiseks."}], "notes": {"et": "Ainet loetakse üle aasta (2016/2017, 2018/2019 jne)."}}, "grading": {"independent_work": {"et": "õpipäevik peatükkide \"Autoetnograafiline lähenemine\" ja \"Osalusvaatlus\" põhjal, oma ideede lisamine (kuni 10 punkti)\npea päevikut kolme päeva vältel, milles keskendud elava rahvaluule leidmisele ümbritsevas maailmas. Vaatluse põhjal 2-3minutiline sõnavõtt, milles kirjeldad, kuidas läks (kuni 10 punkti)\ntagasiside ühe kaasmagistrandi päevikule (kuni 3 punkti)\nküsimustele vastamine peatüki \"Intervjuu\" põhjal (kuni 5 punkti)\nkoostada miniuurimistöö koostamise juhend (kuni 15 punkti)\ntagasiside kaasmagistrandi miniuurimistöö ideele ja juhendile (kuni 3 punkti)\nvastata küsimustele ERA ekskursioonil kuuldu põhjal (kuni 9 punkti)\nprojekti väljamõtlemine õpilastele (kuni 15 punkti)\ntagasiside kaasüliõpilase projekti kohta (kuni 5 punkti)\nvastata küsimustele peatükkide \"Rahvaluule žanrid\", \"Muistend\" ja \"Muinasjutt\" põhjal (kuni 10 punkti)\nkoostada tööleht või ülesanne rahvajuttude teemal (kuni 12 punkti)\nanda tagasisidet kaasmagistrandi koostatud töölehele või ülesandele (kuni 3 punkti)"}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Seminarides osalemine. Ülesannete esitamine tähtajaks. Kaasõppijate tagasisidestamine."}}], "grade_preconditions": {"et": "Seminarides osalemine. Ülesannete esitamine tähtajaks. Kaasõppijate tagasisidestamine."}, "grade_evaluation": {"et": "Seminarides osalemine. Ülesannete esitamine tähtajaks. Kaasõppijate tagasisidestamine."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=1201", "is_moodle_connected": true, "learning_environments": [{"uuid": "2396c2b7-4078-4e21-be21-adc8050dc0cf", "type": "MOODLE", "code": "FLKU.04.070", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Elo-Hanna Seljamaa. Osalusvaatlus. - M. Metsvahi (koost.), Folkloristlikud välitööd. Tartu 2017. Lk. 108-125. \nPihla Maria Siim. Autoetnograafiline lähenemine - M. Metsvahi (koost.), Folkloristlikud välitööd. Tartu 2017. Lk. 184-192.\nMerili Metsvahi. Intervjuu. - M. Metsvahi (koost.), Folkloristlikud välitööd. Tartu 2017. Lk. 79-103.\nÜlo Valk. Rahvaluule žanrid. - Regivärsist netinaljadeni. Sissejuhatus rahvaluulesse. Koostanud Merili Metsvahi ja Ülo Valk. Tallinn: Koolibri 2005. Lk. 29-33.\nMerili Metsvahi. Muistend. - Regivärsist netinaljadeni. Sissejuhatus rahvaluulesse. Koostanud Merili Metsvahi ja Ülo Valk. Tallinn: Koolibri 2005. Lk. 35-47.\nRisto Järv. Muinasjutt. - Regivärsist netinaljadeni. Sissejuhatus rahvaluulesse. Koostanud Merili Metsvahi ja Ülo Valk. Tallinn: Koolibri 2005. Lk. 49-61.", "recommended_materials": "Esimest kolme soovitan väga lugeda (seal sisalduvatest teadmistest on kasu mitmetel seminaridel):\nElo-Hanna Seljamaa. Välja dokumenteerimine: märkmed ja välitööpäevik. - M. Metsvahi (koost.), Folkloristlikud välitööd. Tartu 2017. Lk. 130-154.\nElo-Hanna Seljamaa 2012. Rahvaluulest folkloristikas, koolis ja ühiskonnas. - Harro-Loit, Halliki ja Monika Tasa (toim.). Õpetaja kui kultuurimälu vahendaja. Kultuurilise identiteedi mõtestamise ja tõlgendamise võimalusi. Tartu: Kultuuriteooria tippkeskus, 71-87.\nÜlo Valk. Mis on rahvaluule? - Regivärsist netinaljadeni. Sissejuhatus rahvaluulesse. Koostanud Merili Metsvahi ja Ülo Valk. Tallinn: Koolibri 2005. Lk. 7-12\n\nArvo Krikmann. Lühivormid. - Regivärsist netinaljadeni. Sissejuhatus rahvaluulesse. Koostanud Merili Metsvahi ja Ülo Valk. Tallinn: Koolibri 2005. Lk.\n\nRaamat \"Folkloristlikud välitööd\" tervikuna\nÜlo Valk. Inimene ja teispoolsus eesti rahvausundis. - Eesti rahvakultuur. Koostanud ja toimetanud Ants Viires ja Elle Vunder. Tallinn: Eesti Entsüklopeediakirjastus 1998. Lk. 485-511.\nVÕI Ülo Valk. Inimene ja teispoolsus eesti rahvausundis. - Eesti rahvakultuur. Koost ja toim Ants Viires ja Elle Vunder. Teine, täiendatud trükk. Tallinn: Eesti Entsüklopeediakirjastus 2008. Lk. 379-395.\nArgikultuuri uurimise terminoloogia e-sõnastik. Toim. Tiiu Jaago. Tartu Ülikool, eesti ja võrdleva rahvaluule osakond. URL: http://argikultuur.ut.ee\nMetsvahi, Merili 2000. Muistend kui tegelikkus - Mall Hiiemäe, Janika Oras (eds.), Maa-alused. Pro Folkloristica VII. Tartu. Lk. 44-59.\nSeljamaa, Elo-Hanna 2010. \"Kui pidu korraldatakse, on järelikult seda kellelegi vaja\": Vene vastlapühade tähistamisest Tallinnas. - Keel ja Kirjandus 8-9, 671-686.\nJaago, Tiiu 1999. Rahvaluule mõiste kujunemine Eestis. - Mäetagused. Hüperajakiri, 9, 70-91. URL: http://www.folklore.ee/tagused/nr9/rhl.htm\nLeete, Art, Ülo Tedre, Ülo Valk, Ants Viires 2008. Uurimislugu. - Ants Viires ja Elle Vunder (koost., toim.). Eesti rahvakultuur. Teine, täiendatud trükk. Tallinn: Eesti Entsüklopeediakirjastus, 15-39.\nValk, Ülo 2010. Eesti folkloristika kulg distsipliinist diskursiivseks formatsiooniks. Mõtteid ja tähelepanekuid. - Keel ja Kirjandus, 8-9, 561-574.\nRegivärsist netinaljadeni. Sissejuhatus rahvaluulesse. Koostanud Merili Metsvahi ja Ülo Valk. Tallinn: Koolibri 2005. - raamat tervikuna\nEesti muinasjutud I: 1. Imemuinasjutud (Monumenta Estoniae Antiquae V.) Koost. ja toim. R. Järv, M. Kaasik, K. Toomeos-Orglaan. Tartu: Eesti Kirjandusmuuseumi Teaduskirjastus, 2009.\nEesti muinasjutud. I: 2. Imemuinasjutud (Monumenta Estoniae Antiquae V.) Koost. ja toim. Risto Järv, Mairi Kaasik, Kärri Toomeos-Orglaan, Inge Annom. Tartu: Eesti Kirjandusmuuseumi Teaduskirjastus, 2014.\nMetsvahi, Merili 2014. Varasem perekondlik korraldus ja õe-venna intsestiteema rahvaluules - Vikerkaar 7-8. Lk. 123-137.\nMetsvahi, Merili 2015. \"Tüdrukut poisi käte vahelt magamast leida pole nende seas häbiasi.\" August Wilhelm Hupeli avaldatud talupoegade seksuaalelu kirjeldused eesti perekonna ajaloo kontekstis - Ariadne Lõng 1/2. Lk. 104-127.\nMetsvahi, Merili 2015. Venna ja õe abielu tagajärjel tekkinud järve muistend. Perekonnaajaloolisi tõlgendusi.\" Keel ja Kirjandus 8-9. Lk. 573-588."}, "participants": {"lecturers": [{"person_uuid": "59c0fead-998b-fec3-de19-fec20e60f910", "person_name": "Merili Metsvahi", "structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "n. 2,4,6,7,14,15"}, "entries": [{"time": "2024-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatav loeng rahvaluulest ja sellest, kuidas seda õpikutes esitatakse ning mida õpetajana sellele lisada, et õpilased rahvaluulest terviklikuma ja elulähedasema pildi saaksid. Kodus: lugeda läbi peatükid \"Osalusvaatlus\" ja \"Autoetnograafiline meetod\" raamatust \"Folkloristlikud välitööd\", jälgida maailma mõne päeva vältel folkloristi perspektiivist ja kirjutada lühike välitööpäevik, postitada see Moodle'isse ja lugeda ka teiste välitööpäevikuid."}}, {"time": "2024-09-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Folkloor meis ja meie ümber: kodutööde arutelu. Veel osalusvaatlusest, välitööde dokumenteerimine, välitööeetika, intervjuu, uurija ja uuritavate suhe. Kodus läbi lugeda peatükk \"Intervjuu\" ning vastata küsimustele peatüki põhjal, samuti mõelda välja, millise (mini)uurimistöö võiks õpilane kirjutada rahvaluule teemal, mis sisaldaks ka välitööde tegemist. Koostada juhend ja postitada Moodle'isse. Õppejõud määrab, kes kelle tööd tagasisidestab."}}, {"time": "2024-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Rahvaluule teemalise välitöid sisaldava (mini)uurimistöö teema ja juhendi tagasiside kaasüliõpilaste ja õppejõu poolt. Tänapäeva folkloor: tänapäeva muistendid; internetifolkloor."}}, {"time": "2024-10-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "ekskursioon Eesti Rahvaluule Arhiivi ja kirjandusmuuseumi teistesse osakondadesse. Kodus: kirjalikult küsimustele vastamine kuuldu ja nähtu põhjal, e-ülesande/töölehe koostamine õpilastele mõne kirjandusmuuseumi andmebaasi ja/või mõne muu kirjaliku allika põhjal, teise üliõpilase ülesande tagasisidestamine."}}, {"time": "2024-12-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Jutustamise ja lugude tähtsusest ühiskonnas ja kasvatuses. Rahvajutud: muinasjutt, muistend, memoraat, pajatus, naljand, anekdoot"}}, {"time": "2024-12-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Folkloristika kui humanitaarteadus. Lokaalne või globaalne? Ilus või ropp? Folkloori teine elu. Rahvaluule žanrid. Rahvalaul."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "b4dd91cf-d47c-48f4-878a-9cc687f320d3", "parent_code": "FLKU.04.070", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}