{"uuid": "88f043c7-569c-ac9c-5382-f8eef5f6bf21", "code": "FLKU.05.148", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of Estonian Theatre", "et": "Eesti teatri ajalugu"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "An overview of the main trends of the development of Estonian theatre and drama from the initial stage up to the present is given: the development of the theatre institutsion, the role of the theatre in the Estonian society and culture (including the relationship with literature), the most essential artistic trends, the work of the outstanding directors. The lectures are illustrated with the video recordings.", "et": "Kursus annab ülevaate eesti teatri ja näitekirjanduse arengu peajoontest algusaegadest kuni tänapäevani. Jälgitakse teatriinstitutsiooni arengut, teatri seisundit ühiskonnas ja kultuuris (rõhuga teatri ja kirjanduse suhteil), olulisemaid suundi lavakunstis, tähtsamate lavastajate loomingut. Kursus on illustreeritud videolõikudega (1970.-2010. aastate teater)."}, "objectives": [{"en": "1. has an general overview of the periods of Estonian theatre history, understands the chronology\n2. knows the most important theatre directors and associates them to the main historic periods\n3. analysis the classics of Estonian dramaturgy and associates them to the main historic periods\n4. is able to place theatrical processes to the context of  general history and sees their relations", "et": "Kursuse eduka läbimise korral üliõpilane:\n\n1.\tomab ülevaadet Eesti teatri ajaloo põhiperioodidest, orienteerub kronoloogias,\n2.\tteab Eesti tähtsamaid lavastajaid ja seostab neid põhiperioodidega,\n3.\tanalüüsib Eesti klassikalist näitekirjandust ja seostab neid põhiperioodidega,\n4.\tsuudab asetada teatriprotsessid üldajaloo konteksti ja näha seoseid;"}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "A student knows main features of the history of Estonian theatre and drama: changes of theatrical system, main artistic trends (Realism, Modernism, Postmodernism, etc), functions of the theatre. A student  knows how to analyse the work of outstanding stage directors and playwrights and how to relate it with historical context.", "et": "Üliõpilane tunneb eesti teatri ja draama ajaloo põhijooni: teatrisüsteemis toimunud muutusi, peamisi voole (realism, modernism, postmodernism jt), teatri funktsioone jm. Oskab analüüsida ja ajaloolise kontekstiga suhestada tähtsamate näitekirjanike ja lavastajate loomingut."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}