{"uuid": "8fd6a80a-f21d-ab35-aa34-b5e8585053cf", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-21T08:49:55", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 30, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "label": {"en": "24/25 S block mode HV", "et": "24/25 K SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 780, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Writing and defending a master's thesis that meets the requirements. The master's thesis guide and evaluation criteria are available on Moodle.", "et": "Nõuetele vastava magistritöö koostamine ja kaitsmine. Magistritöö juhend ja hindamiskriteeriumid on kättesaadavad magistriseminari Moodle'is."}, "objectives": [{"en": "Planning, writing and defending an independent comprehensive professional research. In the Master's thesis, the student demonstrates his knowledge and ability to creatively use the knowledge acquired in Master's studies in solving practical or theoretical problems. When writing the master's thesis, the student demonstrates the ability to set a research problem and/or goal and research questions, to know and use professional literature, to find and/or create sources, and to delimit the subject area and conduct independent research. When the research results are formalized into a master's thesis, the student demonstrates his academic writing skills, and his academic debating skills are demonstrated during the defense.", "et": "Iseseisva tervikliku erialase uurimistöö planeerimine, kirjutamine ja kaitsmine. Magistritöös näitab üliõpilane oma teadmisi ja võimet loovalt kasutada magistriõppes omandatud teadmisi praktiliste või teoreetiliste probleemide lahendamisel. Magistritöö kirjutamisel demonstreerib üliõpilane uurimisprobleemi ja/või eesmärgi ning uurimisküsimuste seadmise oskust, erialase kirjanduse tundmise ja kasutamise, allikate leidmise ja/või loomise ning ainevaldkonna piiritlemise ja iseseisva uurimistöö oskust. Uurimistulemuste magistritööks vormistamisel näitab üliõpilane akadeemilise kirjutamise oskust ning kaitsmisel avaldub tema akadeemilise väitluse oskus."}], "learning_outcomes": [{"en": "The student who has passed the module:", "et": "Aine läbinud üliõpilane:"}, {"en": "Sets a research problem and/or goal and research questions important from the point of view of the field and uses appropriate sources/materials and research methods to solve them.", "et": "Püstitab valdkonna seisukohalt olulise uurimisprobleemi ja/või -eesmärgi ja uurimisküsimused ning kasutab nende lahendamiseks sobivaid allikaid/materjale ja uurimismeetodeid."}, {"en": "Knows the research history of the  topic, places the discussed topic in a professional context and uses relevant sources/materials in a purposeful manner.", "et": "Tunneb uuritava teema varasemat uurimislugu, paigutab käsitletava teema erialasesse konteksti  ja kasutab teemakohaseid allikaid/materjale eesmärgipäraselt. "}, {"en": "Conducts independent research work: finds an argumentative solution based on the research problem and/or goal, structures the work logically, interprets the results and relates them to each other and synthesizes them with the literature.", "et": "Viib läbi iseseisva uurimistöö: leiab uurimisprobleemist ja/või -eesmärgist lähtuva argumenteeritud lahenduse, struktureerib töö loogiliselt, tõlgendab tulemusi ning seostab neid omavahel ja sünteesib kirjandusega."}, {"en": "Writes the master's thesis in professional and correct Estonian according to the requirements of academic research.", "et": "Vormistab oma magistritöö vastavalt akadeemilise uurimistöö nõuetele erialases ja korrektses eesti keeles.  "}, {"en": "Reasonably argues the positions of his research in the defense speech summarizing the research and in the academic discussion", "et": "Argumenteerib uurimistööd kokku võtvas kaitsekõnes ja akadeemilises diskussioonis põhjendatult oma uurimistöö seisukohtade üle"}], "notes": {}}, "grading": {"independent_work": {"et": "Juhendajalt"}, "grade_preconditions": {"et": "Õppekava täitmine täies mahus"}, "grade_evaluation": {"et": "Magistritööd hindab selleks moodustatud komisjon kinnisel koosolekul. Hinnatakse järgmiste kriteeriumite alusel: 1) uurimisülesanne, allikad ja meetod; 2) allikate ja kirjanduse kasutamine; 3) uurimisülesande lahendamine; 4) töö vormistamine; 5) töö kaitsmine."}, "grade_conditions": {"A": {"et": "Tööl on uudne, teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus ning seda on igakülgselt põhjendatud ja piiritletud. Meetod(id) on valitud lähtuvalt eesmärgist ja võimaldavad seda saavutada.  Allikad/materjalid on valitud teemakohaselt, need on mitmekesised ja piisavad.\nVarasem uurimislugu on esitatud läbimõeldult ja mitmekülgselt, teema on põhjendatult paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt, demonstreerides nende põhjalikku tundmist.\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt omapoolse originaalse panuse. Töö on loogiliselt struktureeritud. Argumentatsioon on elegantne ja erudeeritud, tulemuste tõlgendamine ja omavaheline seostamine silmapaistev ja süntees kirjandusega läbimõeldud ja isikupärane.\nVormistus vastab kehtivale Juhendile. Viitamine on korrektne. Töö on kirjutatud suurepärases eesti keeles, väljendusviis on elegantne, stiililiselt ja grammatiliselt laitmatu.\nÜliõpilane annab kaitsmiskõnes asjakohase ja kontekstualiseeriva ülevaate töö uurimisprobleemist /eesmärgist, uurimisküsimustest, meetoditest ja peamistest tulemustest. Demonstreerib suurepärast esinemis- ja väitlusoskust ning eruditsiooni. Vastab põhjendatult ja vajaliku üldistusega esitatud küsimustele."}, "B": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, seda on igakülgselt põhjendatud ja piiritletud. Meetod(id) on valitud lähtuvalt eesmärgist ja võimaldavad seda saavutada. Allikad/materjalid on valitud teemakohaselt ja need on piisavad.\nVarasem uurimislugu on esitatud läbimõeldult, teema on põhjendatult paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt, demonstreerides nende väga head tundmist.\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt töö tulemused. Töö on loogiliselt struktureeritud. Argumentatsioon on põhjendatud ja sidus, tulemuste tõlgendamine ja omavaheline seostamine põhjalik ja süntees kirjandusega läbimõeldud.\nVormistus vastab kehtivale juhendile, üksikute väikeste puudustega. Töö on kirjutatud väga heas eesti keeles, stiil on grammatiliselt korrektne. Viitamine ja väljendusviis on korrektsed.\nÜliõpilane annab kaitsmiskõnes asjakohase ja kontekstualiseeriva ülevaate töö uurimisprobleemist / eesmärgist, uurimisküsimustest meetoditest ja peamistest tulemustest. Esineb ja väitleb ladusalt. Vastab põhjendatult ja vajaliku üldistusega esitatud küsimustele."}, "C": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, seda on põhjendatud ja piisava selgusega piiritletud. Meetod(id) on osaliselt valitud lähtuvalt eesmärgist ning võimaldavad seda saavutada. Allikad/materjalid on valitud teemakohaselt, aga neis esineb puudujääke.\nVarasem uurimislugu on esitatud, teema on paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt. \nAutor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt töö tulemused. Töö on üldjoontes loogiliselt struktureeritud. Argumentatsioon on sidus, tulemuste tõlgendamine ja omavaheline seostamine piisav ja süntees kirjandusega üldjoontes läbimõeldud.\nVormistus vastab kehtivale juhendile, üksikute puudustega. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb ebatäpsusi, kuid viitamissüsteem on ühtne.\nÜliõpilane annab kaitsmiskõnes asjakohase ülevaate töö uurisprobleemist /eesmärgist ja uurimisküsimustest, meetoditest ja peamistest tulemustest. Esineb ja väitleb ladusalt. Vastab põhjendatult esitatud küsimustele."}, "D": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, kuid need on ebapiisavalt põhjendatud ja ebaselgelt piiritletud. Meetod(id) on osaliselt valitud lähtuvalt eesmärgist.  Allikad/materjalid on valitud teemakohaselt, aga neis esineb olulisi puudujääke.\nVarasem uurimislugu on esitatud osaliselt, teema on osaliselt paigutatud erialasesse konteksti. Teemakohaste allikate/materjalide kasutuses on märgatavaid puudujääke.\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades töö tulemused. Töö struktuuris on küsitavusi. Argumentatsioon on kohati katkendlik, tulemuste tõlgendamine ja omavaheline seostamine laialivalguv ja  süntees kirjandusega juhuslik.\nVormistus vastab kehtivale juhendile, kuid esineb ka puudusi. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb mitmeid ebatäpsusi ja kohatist ebajärjekindlust.\nÜliõpilane annab kaitsmiskõnes ülevaade töö uurimisprobleemist /eesmärgist ja uurimisküsimustest, meetoditest ja peamistest tulemustest. Vastab esitatud küsimustele üldjoontes veenvalt."}, "E": {"et": "Tööl on teaduslik probleemiasetus ja/või eesmärgipüstitus, kuid neid ei ole põhjendatud ja selgelt piiritletud. On küsitavusi valitud meetod(it)e sobivuses töö eesmärgi  saavutamiseks. Allikad/materjalid on osaliselt valitud teemakohaselt, aga neis esineb olulisi puudujääke.\nVarasem uurimislugu on esitatud kasinalt, teema paigutamine erialasesse konteksti jääb pinnapealseks. Teemakohaste allikate/materjalide kasutuses on olulisi puudujääke.\nAutor viib ettevõetud ülesande lahendamise lõpule, kuid tulemused jäävad ebaselgeks. Töö struktuuris on märkimisväärseid küsitavusi. Argumentatsioon on katkendlik, tulemuste tõlgendamine ja omavaheline seostamine pealiskaudne ja  süntees kirjandusega napp ja juhuslik.\nVormistus vastab üldjoontes kehtivale juhendile, kuid esineb ka märkimisväärseid puudusi. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb olulisi ebatäpsusi ja ebajärjekindlust.\nÜliõpilane kirjeldab kaitsmiskõnes töö uurimisprobleemi / eesmärki ja uurimisküsimusi, meetodeid ja tulemusi, kuid on laialivalguv; vastab esitatud küsimustele ebaselgelt ja mitteveenvalt."}, "F": {"et": "Magistritöö ja selle kaitsmise tulemus jääb allapoole hindele E seatud tingimusi."}, "mi": {"et": "Üliõpilane ei ilmu kaitsmisele kohale."}}, "debt_elimination": {"et": "Kokkuleppel juhendajaga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "ebf91e3f-fa18-c1a9-526f-60b22503306e", "person_name": "Laur Vallikivi", "structural_unit": {"code": "HVKU12", "name": {"en": "Arctic Studies Centre", "et": "arktiliste kultuuride keskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVKU", "is_expired": true}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "7e7d2b35-3392-d4eb-0d75-d885338bf5a6", "person_name": "Jana Reidla", "structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "c37ebdca-08b7-e9d3-b120-339d5f403ba4", "person_name": "Art Leete", "structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Magistritöö valmimise etappe tutvustatakse magistriseminaris."}}, "registration_info": {"audience": {}}, "parent_uuid": "2229b36f-78c1-ff85-0c63-5beb3ab471b0", "parent_code": "FLKU.03.003", "parent_credits": 30, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}