{"uuid": "d03976c3-abd1-1993-4086-4eb556237b59", "code": "FLKU.03.010", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Principles of Ethnology and Cultural Anthropology", "et": "Etnoloogia ja kultuuriantropoloogia alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course touches upon the basic concepts and research problems and history of ethnology and cultural anthropology, main research methods and major thematic areas of these disciplines (social structure, politics, economy, religion, family, gender roles, culture change, applied anthropology and ethics).", "et": "Aine käsitleb etnoloogia ja kultuuriantropoloogia põhimõisteid, etnoloogiateaduse ajalugu ning peamisi teoreetilisi suunitlusi alates 19. sajandi teisest poolest, välitööde peamisi meetodeid, etnoloogia ja kultuuriantropoloogia suuremaid uurimisvaldkondi (sotsiaalne struktuur, poliitika, majandus, religioon, perekond ja soorollid, kultuurimuutused, rakendus ja eetika)."}, "objectives": [{"en": "Purpose of the course is to provide an overview of the basic concepts and research problems of ethnology and cultural anthropology. Besides, the course touches upon research methods of these disciplines. After that, overview of the major thematic areas of these disciplines will be provided.", "et": "Anda ülevaade etnoloogia ja kultuuriantropoloogia põhimõistetest ja -probleemidest, samuti meetoditest, mille abil uuritakse etnoloogias ning antropoloogias kultuuri kui kompleksset tervikut. Samuti anda ülevaade etnoloogia ning kultuuriantropoloogia ajaloost ning peamistest teemavaldkondadest."}, {"en": "To advance culturally informed analytic skills of discussion of students.", "et": "Arendada üliõpilastes kultuuripädevat analüüsi- ja arutlusoskust."}, {"en": "To shape and support students' positive attitude towards cultural differences. ", "et": "Kujundada ja toetada üliõpilaste positiivset hoiakut kultuurierinevuste suhtes."}, {"en": "To promote creative use of social media in promoting tolerance and understanding in regard of cultural diversity.", "et": "Aidata kaasa sotsiaalmeedia loovale kasutamisele tolerantsuse ja mõistmise suurendamisele kultuurilise mitmekesisuse suhtes."}, {"en": "To foster students' skills for applying their knowledge of cultural differences.", "et": "Arendada üliõpilaste oskusi kultuurilise mitmekesisuse alaste teadmiste rakendamiseks praktikas."}], "learning_outcomes": [{"en": "By the end of the course, student will be familiar with  the basic concepts and research problems of ethnology and cultural anthropology, main research methods and major thematic areas of these disciplines. Student will be able to analyse phenomena of everyday life from the standpoint of ethnology and cultural anthropology.", "et": "Õppeaine edukal läbimisel tunneb üliõpilane etnoloogia ja kultuuriantropoloogia põhitermineid ja -probleeme, distsipliinide arengut tähistanud olulisemaid teoreetilisi seisukohti, põhimeetodeid ning uurimisvaldkondi. Üliõpilane on võimeline analüüsima igapäevaeluga seotud kultuurinähtusi etnoloogilisest ning antropoloogilisest vaatenurgast lähtudes."}, {"en": "Student is able to explain positive effect of cultural differences on development of a society.", "et": "Üliõpilane oskab informeeritult selgitada kultuuriliste erinevuste positiivset mõju ühiskonna arengus."}, {"en": "Student can use social media for creative promoting of tolerance and understanding in regard of cultural diversity.", "et": "Üliõpilane oskab kasutada sotsiaalmeediat tolerantsuse ja mõistmise suurendamiseks kultuurilise mitmekesisuse suhtes."}, {"en": "Student is able to apply in practice knowledge regarding cultural diversity.", "et": "Üliõpilane on võimeline praktikas rakendama omandatud teadmisi kultuurilise mitmekesisusest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}