{"uuid": "7bea5107-f3c6-5fa2-39af-6a72f3f81dda", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-05T14:44:08", "title": {"en": "Culture Management Practice", "et": "Kultuurikorralduse praktika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 6, "internship": 72}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Practical activity in the field of cultural management.", "et": "Kultuurikorralduslik praktiline tegevus mingi ürituse korraldamise raames."}, "objectives": [{"en": "Offering a practical outlet to the knowledge achieved during the study process and obtaining experience for working in an organization  acting in the field of  cultural management", "et": "Üliõpilase õppetöö käigus omandatud teadmistele praktilise väljundi pakkumine ning kogemuse saamine tööks kultuurikorraldusega tegelevas organisatsioonis."}], "learning_outcomes": [{"en": "Knowledge of the organization of work in a cultural institution.\nSkills of analysing and solving tasks set by the tutor.\nTime management and independent work management.\nSelf-analytical skills.", "et": "Teadmised kultuuriasutuse töökorraldusest.\nOskused analüüsida ja lahendada määratud ülesandeid.\nOskused oma aega planeerida ning vastu võtta iseseisvaid otsuseid.\nMeeskonnatöö oskused.\nEneseanalüüs."}], "notes": {"et": "ETNOLOOGIA JA RAKENDUSANTROPOLOOGIA tudengid: \nPraktika sooritamise soovist teatada ENNE ainele registreerimist etnoloogia praktikate koordinaatorile kirsti.joesalu@ut.ee\n\nFOLKLORISTIKA: Praktika koordinaator on Kristel Kivari (kristel.kivari@ut.ee)\n\nTEATRITEADUS: Praktikabaasid on erinevad teatrid ja teatriorganisatsioonid. Praktika sooritamiseks palun kontakteeruda riina.oruaas@ut.ee. \n\nKIRJANDUSE ERIALAL on võimalik kultuurikorralduse praktikat teha peaasjalikult mitmesuguste kirjandusürituste korraldamise ja läbiviimise juures ning Tartu kirjanduseluga seotud projektide juures. Praktikakohti pakuvad peaasjalikult kirjandusfestivalid Prima Vista ja Hullunud Tartu, Eesti Kirjanduse Selts ning kirjanduslinn Tartu UNESCO loovlinnade võrgustik. Korralduslik praktikavalmidus on ka kirjandusajakirjal Värske Rõhk. Algava semestri väljapakutud praktikakohad kuulutatakse välja eelneva semestri lõpus. Kokkuleppel ülikoolipoolse praktikakoordinaatoriga on võimalik teha kultuurikorralduspraktikat ka muudes asutustes või tudengi väljapakutud viisil. Täpsema info saamiseks kirjandusalase kultuurikorralduspraktika kohta tuleks kontakteeruda Piret Põldveriga (piret.poldver@ut.ee)\n\nKirjandusfestivali Prima Vista praktikakohad 2024/2025 kevadsemestriks:\n\nVABATAHTLIKE KOORDINAATOR - osalemine festivali korralduskoosolekutel, vabatahtlike otsimine (kutsekirja koostamine), vabatahtlike andmete haldamine, vabatahtlike tööülesannete jagamine (sh suhtlemine erinevate ürituste korraldajatega, nende vajaduste kaardistamine), vabatahtlikele festivali idee kommunikeerimine, vabatahtlike töö kontroll, (sponsorite otsimine vabatahtlikele). tööga kaasneb väike projektipõhine tasu.\n\nSOTSIAALMEEDIA ASSISTENT - ürituste jooksev kajastamine festivali ajal, festivali Instagrami konto haldamine, huvi korral ka TikToki videosisu loomine, uute kajastusideede väljapakkumine, koostöö turundusjuhi ja fotograafidega, osalemine festivali korralduskoosolekutel.\n\nPROJEKTIJUHT - väiksemamahulise kirjandusürituse planeerimine ja korraldamine kirjandusfestivalil, vastavalt ideele esinejate leidmine, nendega suhtlemine ja kohale organiseerimine, toimumispaiga leidmine ja kinnitamine, eelarve ja turundusplaani koostamine, suhtlus turundusjuhi ja finantsjuhiga, sisuline aruandlus.\n\nKõikide praktikakohtade kinnitamisele eelneb sobivusvestlus festivali esindajatega.\n\nKõikidele erialadele sobiv praktika: Elektriteatri Koolikino programmi koordinaatori assisteerimine (Koolikino kataloogifilmide valimine; Koolikino kataloogifilmidele õppematerjalide loomine; suhtlus erinevate aineõpetajatega ja nende vajaduste välja selgitamine; filmiteemaliste töötubade, aruteluringide ja aktiivõppeprogrammide läbiviimine; eriseansside korraldamine). Lähem info Sigrid Butlersilt (sigrid@elektriteater.ee) ja oma eriala praktikakoordinaatorilt."}}, "grading": {"independent_work": {"et": "Esitada tuleb praktikaaruanne ja enne praktikat sõlmida õpileping. \n\nVõimalik on ka sooritada praktika enda valitud ürituse juures. Etnoloogia: praktika sooritamiseks palun kontakteeruda kirsti.joesalu@ut.ee\n\nTeatriteadust õppivatel üliõpilastel on võimalik sooritada praktika festivalide juures (Draama, Baltoscandal vmt), teatrites ja teatriga seotud kultuuriasutustes. Teatriteaduse praktikate info on Moodle'i kursusel FLKU.05.259 Teatripraktika (külalise võti: praktikant). Praktika sooritamiseks palun kontakteeruda riina.oruaas@ut.ee. \n\nKirjanduse erialal on võimalik praktikat teha suuremate kirjandusürituste juures (festivalid Prima Vista, Hullunud Tartu jm), praktikakohti vahendab Eesti Kirjanduse Selts. Kirjanduse praktikate info on Moodle'i kursusel HVKU.05.020 Kirjanduspraktika koolis (külalise võti: Praktika)"}, "grade_preconditions": {"et": "Praktikandi kirjalik aruanne ja praktikabaasi poolse juhendaja hinnang."}, "grade_evaluation": {"et": "Praktikandil on kaks juhendajat, praktikabaasi poolne ja ülikoolipoolne. \nÜlikoolipoolne juhendaja hindab koostöö laabumist ning annab tagasisidet töökohapoolsele juhendajale ja praktikandile. Samuti annab ülikoolipoolne juhendaja lõpliku hinnangu praktika edukusele, kõrvutades töökohapoolse juhendaja hinnangut, praktikandi eneseanalüüsi ning isiklikke tähelepanekuid. Kui hinnangud on väga erinevad, on ülikoolipoolsel juhendajal õigus nõuda üliõpilaselt ja töökohapoolselt juhendajalt täiendavaid selgitusi. \npraktikabaasi poolne juhendaja tutvustab praktikandile töökorraldust, annab talle konkreetseid tööülesandeid, annab praktika jooksul tagasisidet praktikandi tegevusele ning täidab hinnangulehe, mis koos praktikandi koostatud aruandega on aluseks ülikoolipoolse juhendaja lõplikule hinnangule."}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "9892f4a9-3bf2-41a2-04e4-dc0c78316fc0", "person_name": "Kirsti Jõesalu", "structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}}, "parent_uuid": "bfeda694-3da5-6cc8-25d2-711c4647668a", "parent_code": "FLKU.03.007", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}