{"uuid": "28995372-cf70-f2fc-975d-2dcf5a78fc49", "code": "FLKU.05.120", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-10T11:56:10", "title": {"en": "Academic Writing: Skills and Hazards", "et": "Akadeemiline kirjutamine: oskused ja ohud"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The main topics of the course are:\n1. Basics of scholarly rhetoric: the establishment of authorityand credibility, scholarly „communities of interpretation\", recognition of logical fallacies in argumentation; definition of terms and the hazards of interdisciplinarity and mixing paradigms, decorum and conventions of academic style.\n2. Writing skills: footnoting, balancing footnoting, quotation, and paraphrase, developing ideas and paragraphing, transitions, different formal conventions of footnoting, summarizing, composing a critical bibliography. \n3. The genres of academic writing.\n4. Advising and peer editing of writing. Cautions with regard to plagiarism", "et": "Kursusel tutvustatakse loengute, rühmatöö ning praktiliste harjutuste kaudu akadeemilise kirjutamist ja kriitilist lugemist harjutatakse erinevate tekstide kirjutamist ja analüüsi.\nTeemad : 1.  Teadusliku retoorika põhialused: a. teadusliku autoriteet.  Kellele me kirjutame? b. argumentatsioon c.  defineerimine ja teoreetilise aluse loomine d. kriitilis-analüütiline vs. refereeriv stiil. Stiilivääratused ja ebaühtlused. \n2. Kirjutamisoskused:  a.  Efektiivne viitamine:  parafraseerimine, refereerimine, tsiteerimine ja nende omavaheline tasakaal; b. viitesüsteemide erialalised erinevused; c.  Mitmepinnaline ekspositsioon: seletavate (joonealuste) viidete kasutamine argumendi arendamiseks d.  Konspekteerimine ja abstraktide kirjutamine e.  Kriitilise bibliograafia koostamine.\n 3.  Akadeemilise kirjutamise žanrid: väitekiri, kriitiline retsensioon, kirjandusülevaade, abstrakt, artiklitena kaitstava dissertatsiooni sissejuhatav peatükk, väitekirja võõrkeelne kokkuvõte; kuidas kohandada väitekirja peatükki avaldatavaks artikliks.\n 4. Akadeemilise kirjutamise oskuste õpetamine magistritööde juhendamise kontekstis: a. Teemast teesini, ideest kontseptsioonini: kuidas arendada mõtteid?  b.  Kuidas hinnata ja valida sekundaarkirjandust? c. Kuidas defineerida põhimõisteid?  d. Kuidas lepitada (integreerida) teooriat ja empiirikat?  e.  Kuidas tasakaalustada analüüsi ja refereeringut?  f. Oma sõnad ja teiste sõnad: loomevarguse ennetamine ja vältimine."}, "objectives": [{"en": "The aim of the course is to  develop  students` skills in written scholarly rhetoric and critical-analytical thinking; to sharpen skills of recognizing effective academic writing; to write clearly, strategically, and authoritatively in a variety of forms required in university courses and professional work (research paper, master`s thesis, conference abstract, review articles etc.)", "et": "Loengute ning õpikodade kaudu läbi viidav praktiline kursus, mille eesmärkideks on (1)  arendada üliõpilaste  oskuseid teadustöö kirjalikus retoorikas ning kriitilises-analüütilises mõtlemises (2) teravdada võimet ära tunda efektiivselt teaduslikku kirjutamist (3) kirjutada selgelt, strateegiliselt, korrektselt ja autoriteetselt erinevates vormides (ettekende teesid, retsensioon, artikkel, magistritöö jm)."}], "learning_outcomes": [{"en": "After successful completion of the course the student is able to:", "et": "Õppeaine edukal läbimisel üliõpilane:"}, {"en": "a) distinghuish adacemic style and rethorics from non-academic writing; can formulate one's ideas argumentatively;", "et": "a) oskab eristada akadeemilist stiili ja retoorikat mitteakadeemilisest; suudab oma ideid esitada argumenteerivalt"}, {"en": "b) plan an independent research project or a smaller piece of writing;", "et": "b) oskab iseseisvalt planeerida akadeemilist uurimistööd või väikesemamahulise teksti kirjutamist;"}, {"en": "b) formulate research questions;", "et": "b) suudab püstitada uurimisküsimusi;"}, {"en": "c) critically analyse the literature related to the topic;", "et": "c) oskab kriitiliselt analüüsida teemakohast erialast kirjandust;"}, {"en": "d) plan the collection and analysis of the empirical material; is familiar with major methods for data collection and analysis;", "et": "d) oskab kavandada teemakohase empiirilise materjali kogumist ja analüüsi, tunneb peamisi andmekogumis- ja analüüsimeetodeid;"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}