{"uuid": "56ca23e1-222b-b1ec-f1bf-358517d35cb2", "code": "FLKU.03.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research Seminar in Ethnology and Folkloristics", "et": "Etnoloogia ja folkloristika magistriseminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The content of the seminars is related to the objectives and learning outcomes of the course.\nSeminars of the first part of the course focus on introducing learning opportunities and choices available within the curriculum, as well as on current research projects of the related departments. Through self-directed assignments students draft their semester time-tables, study abroad plan and individual study paths.\n\nSeminars are dedicated to sub-topics of the master's thesis proposal. An important role is given to discussions, feedback to each others' homeworks and to master's thesis completed earlier by other students. Students get individual feedback to their projects and problems that emerge in the course of planning their research. Sub-topics covered at the seminars also depend on individual research interests of the students of the particular year.", "et": "Magistriseminaride sisu on seotud aine eesmärgi ja õpiväljunditega.\n\nKursuse esimese osa seminarides tutvutakse magistriprogrammi võimaluste ning seotud osakondades tehtavate teadusprojektidega. Iseseisvate tööde abil jõutakse teadlikult ajastatud semestriplaani, välissemestri plaani ning individuaalse õpitee kavani.\n\nKursuse teise osa seminarides süvenetakse  lähemalt igasse magistritöö kavandi alapunktiga seotud teemasse. Seminarides on oluline osa aruteludel, üksteise kodutööde ja varem kaitstud magistritööde vastastikusel analüüsil, üliõpilane saab jooksvalt tagasisidet oma uurimistöö eri etappidele ja tööprotsessi käigus esilekerkivate probleemidele. Seminarides käsitletavad alateemad sõltuvad ka magistrantide individuaalsetest uurimisteemadest."}, "objectives": [{"en": "The objective of the first part of the course is\n1) to provide an overview about the structure, organization and principles of choices within the given MA program, incl. possibilities of studying abroad\n2) to support students in exploring one's needs and styles of learning, analyzing study activities and making informed choices in creating individual study paths\n\nThe objective of the second path of the course is to prepare master's students for independent research and to give feedback to their individual projects. The focus is on different stages related to planning a master's studies research project in ethnology and folkloristics, specific problems involved in each stage are discussed in detail. As the result of the course each student writes up an independent master's thesis research proposal.", "et": "Seminari eesmärgiks kursuse esimeses osas on \n1) anda ülevaade magistriprogrammi ülesehitusest ja valikuvõimalustest, sh välisõpingute võimalustest\n2) toetada üliõpilast isiklike õpivajaduste tundmaõppimisel, õpitegevuste analüüsimisel ja läbimõeldud valikute tegemisel õppekavas\n\nSeminari eesmärgiks kursuse teises osas on:\n1) valmistada üliõpilasi ette iseseisvaks uurimistööks oma magistritöö raames ning anda sellele jooksvalt individuaalset tagasisidet. Keskendutakse planeeritava magistritöö kavandi koostamise eri etappidele etnoloogia ja folkloristika erialadel, lähemalt käsitletakse iga kavandi osaga seotud spetsiifilisi probleeme. Ainekursuse lõpuks valmib igaühel individuaalne magistritöö kavand."}], "learning_outcomes": [{"en": "After successful completion of the course the student is able to: ", "et": "Õppeaine edukal läbimisel oskab üliõpilane:"}, {"en": "a) make informed choices concerning one's study path", "et": "a) kavandada teadlikult oma õppimisprotsessi"}, {"en": "b) (self)critically reflect upon one's learning experience", "et": "b) reflekteerida (enese)kriitiliselt õppimiskogemuse üle"}, {"en": "c) communicate constructively with co-students, give and receive feedback", "et": "c) suhelda konstruktiivselt kaasõppijatega, anda tagasisidet ja analüüsida saadud tagasisidet"}, {"en": "d) plan an independent research project  focusing on a manageable research topic during the master's studies;", "et": "d) iseseisvalt planeerida akadeemilist uurimistööd  piiritletud ja magistriõpingute raames teostataval teemal;"}, {"en": "e) formulate research questions; ", "et": "e) püstitada uurimisküsimusi;"}, {"en": "f) critically analyse the literature related to the topic; ", "et": "f) kriitiliselt analüüsida teemakohast erialast kirjandust;"}, {"en": "g) plan the collection and analysis of the empirical material;", "et": "g) kavandada teemakohase empiirilise materjali kogumist ja analüüsi;"}, {"en": "h) draft the schedule of the research process.", "et": "h) planeerida kogu uurimisprotsessi ajakava."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}