{"uuid": "bdde72de-1e1e-0fb5-cefd-ad2570f0aefc", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-12T17:22:49", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 15, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC", "name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "email": "keeled@ut.ee", "webpage_url": "https://maailmakeeled.ut.ee", "address": "Lossi 3\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 3", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode HV", "et": "24/25 K SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC", "structural_unit_name": {"en": "Institute of Foreign Languages and Cultures", "et": "maailma keelte ja kultuuride instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 340, "individual_work": 50, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}, {"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "A student carries out research or compiles study material with methodological explanations under supervision that will enable him/her continue academic work on PhD level.", "et": "Üliõpilane viib õppejõu juhendamisel läbi uurimistöö või koostab õppetöös kasutatava metoodiliselt põhjendatud materjali, mis võib luua eeldused õpingute jätkamiseks doktoriõppes."}, "objectives": [{"en": "The student carries out independent research on a topical subject, using the appropriate methodology, or compiles a set of study materials with methodological explanations.", "et": "Üliõpilane viib iseseisvalt läbi uurimistöö aktuaalsel teemal kasutades sobivat metoodikat või koostab õppetööks kasutatava metoodiliselt põhjendatud materjali."}], "learning_outcomes": [{"en": "A student who prepared and successfully defended a teacher training thesis:", "et": "Õpetajakoolituse lõputöö koostanud ja edukalt kaitsnud üliõpilane:"}, {"en": "1) Has established a research question and goal linking the teacher's work and research in the field of learning and/or teaching foreign languages, and has chosen a suitable method for analyzing it in cooperation with the supervisor. The research follows the principles of scientific ethics.", "et": "1) On püstitanud õpetaja tööd ja võõrkeelte õppimise ja/või õpetamise alast uurimistööd siduva uurimisküsimuse ja -eesmärgi ning valinud koostöös juhendajaga selle analüüsimiseks sobiva meetodi. Uurimus järgib teaduseetika põhimõtteid."}, {"en": "2) Has prepared a feasible work plan in cooperation with the supervisor and has independently applied constructive criticism to improve the work in the process of completing the work. Has adhered to the agreements with the supervisor.", "et": "2) On koostöös juhendajaga koostanud teostatava tööplaani ja töö valmimise protsessis iseseisvalt rakendanud konstruktiivset kriitikat töö parendamiseks. On pidanud kinni kokkulepetest juhendajaga. "}, {"en": "3) Has worked through specialized literature on the topic, selected suitable sources and connected them to the analysis part of his research as a whole.", "et": "3) On läbi töötanud teemakohast erialakirjandust, valinud sobivad allikad ja sidunud need oma uurimuse analüüsiosaga tervikuks."}, {"en": "4) Has analyzed and interpreted the results of the conducted research or prepared educational material based on the selected theoretical and/or methodological framework. ", "et": "4) On analüüsinud ja tõlgendanud läbi viidud uurimuse tulemusi või koostatud õppematerjali valitud teoreetilisele ja/või metoodilisele raamistikule toetudes."}, {"en": "5) The phrasing, structure and formatting of the text have been based on the department's guidelines and academic writing practices. ", "et": "5) On lähtunud teksti sõnastuses, ülesehituses ja vormistuses osakonna juhendist ja akadeemilise kirjutamise tavadest."}, {"en": "6) Has prepared and presented a defense speech summarizing the work and answered questions about the work in public defense.", "et": "6) On valmistanud ette ja esitanud tööd kokku võtva kaitsekõne ja vastanud tööd puudutavatele küsimustele avalikul kaitsmisel. "}], "notes": {"et": "Osakondade lõputööde juhendid:\nInglise keele õpetaja: https://maailmakeeled.ut.ee/et/sisu/anglistika-magistritood\nSaksa keele õpetaja: https://maailmakeeled.ut.ee/et/germanistika/oppimine\nVene keele õpetaja: https://maailmakeeled.ut.ee/et/slavistika/oppimine\nPrantsuse keele õpetaja: https://maailmakeeled.ut.ee/et/sisu/tahtajad-lopetajatele/prantsuse-keel-ja-kirjandus\nHispaania keele õpetaja: https://maailmakeeled.ut.ee/et/sisu/tahtajad-lopetajatele-hispaania-keel-ja-kirjandus"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Üliõpilane esitab korrektse magistritöö kirjalikult ja kaitseb seda suuliselt komisjoni ees.\nMagistritöö lõplik hinne kujuneb kaitsmiskomisjoni, juhendaja(te) ja retsensendi kokkuleppel pärast kaitsmist, arvesse võetakse nii retsensendi hindeid, juhendaja arvamust kui ka kaitsmise edukust."}}], "grade_preconditions": {"et": "Võõrkeeleõpetaja õppekava läbimine, kirjaliku töö esitamine."}, "grade_evaluation": {"et": "Uurimistöö 90%\nSuuline kaitsmine 10%"}, "grade_conditions": {"A": {"et": "Magistritöö keskendub võõrkeelte õppimise ja/või õpetamise selgelt defineeritud ja ajakohasele aspektile. Probleemipüstitus on loogiline ja uuenduslik; koostatud õppematerjali metoodilist raamistikku ja rakendamisvõimalusi on veenvalt põhjendatud; koostatud õppematerjal on hästi läbi mõeldud ja vastab tänapäevase võõrkeeleõpetuse põhimõtetele. Kirjandusallikad on piisavad ja mitmekesised. Selgelt on näha üliõpilase analüütiline panus. Töö on kirjutatud korrektses akadeemilises keeles ning vastab eriala vormistusnõuetele.\nÜliõpilane vastab kaitsmisel retsensendi ja komisjoni küsimustele põhjalikult ning näitab uurimisteema ja suulise akadeemilise keele valdamist."}, "B": {"et": "Magistritöö keskendub võõrkeelte õppimise ja/või õpetamise selgelt defineeritud ja ajakohasele aspektile. Probleemipüstitus on konkreetne ja loogiline; koostatud õppematerjali metoodilist raamistikku ja rakendamisvõimalusi on piisavalt põhjendatud; koostatud õppematerjal on üldiselt loogiliselt üles ehitatud ja kooskõlas tänapäevase võõrkeeleõpetuse suundumustega. Kirjandusallikad on piisavad ja tasakaalustatud. Näha on üliõpilase analüütiline panus. Töö on kirjutatud korrektses akadeemilises keeles, kuigi esineb üksikuid vigu. Vastab vormistusnõuetele, kuid vormistuses võib esineda väiksemaid vigu.\nÜliõpilane vastab kaitsmisel ammendavalt retsensendi ja komisjoni küsimustele ning näitab oma orienteerumist uurimisteemas ja suulise akadeemilise keele valdamist."}, "C": {"et": "Magistritöö keskendub võõrkeelte õppimise ja/või õpetamise konkreetsele aspektile. Probleemipüstitus on loogiline, kuid pinnapealne; õppematerjali metoodilist raamistikku ja rakendamisvõimalusi on rahuldavalt selgitatud, kuid need ei ole alati kooskõlas esitatud õppematerjaliga; õppematerjal järgib tänapäevase võõrkeeleõpetuse põhimõtteid, kuid esineb küsitavusi selle sisus ja ülesehituses. Kirjandusallikaid on piisavalt. Üliõpilase enda analüütiline panus olemas. Töö on kirjutatud korrektses keeles, kuigi esineb keele- ja vormistusvigu.\nÜliõpilane vastab kaitsmisel enamikule retsensendi ja komisjoni küsimustest. Üliõpilane esineb korrektses akadeemilises keeles, kuid spontaanses diskussioonis tekib keelevigu."}, "D": {"et": "Magistritöö teema ja eesmärk on sõnastatud laialivalguvalt ja üldsõnaliselt. Probleemipüstitus on üldsõnaline ega vasta töö mahule; õppematerjali metoodilise raamistiku ja rakendusvõimaluste analüüs on pealiskaudne; koostatud õppematerjal lähtub võõrkeeleõppe põhimõtetest, kuid selle ülesehitus on ebaselge ja esineb vigu. Kirjandusallikaid on napilt ja allikate valik on juhuslik. Üliõpilase panus töösse pole selgelt välja toodud. Töös kasutatud keeles ja vormistuses esineb läbivalt vigu.\nÜliõpilane vastab kaitsmisel ammendavalt üksnes lihtsamatele retsensendi ja komisjoni küsimustele ning teeb suulises akadeemilises keeles läbivalt vigu."}, "E": {"et": "Magistritöö teema ja eesmärgi sõnastus on ebamäärane. Probleemipüstitus on ebaselge; õppematerjali metoodilist raamistikku on kirjeldatud, kuid enamasti refereerivas vormis ja seda on vähe seostatud koostatud õppematerjaliga; õppematerjalis esineb vigu, selle seosed tänapäevase võõrkeeleõpetuse põhimõtetega jäävad sageli nõrgaks. Kirjandusallikaid on napilt, nende seotus tööga küsitav ning kõiki loetletud allikaid pole töös kasutatud. Üliõpilase panust töösse pole välja toodud. Töös kasutatud keeles esineb läbivalt vigu; vormistus ei järgi viitamisjuhendit.\nÜliõpilane ei suuda kaitsmisel vastata paljudele retsensendi ja komisjoni küsimustele. Üliõpilase suuline keel on vigane ja ei järgi akadeemilise keele reegleid."}, "F": {"et": "Magistritöö teema ja probleemipüstitus on ebaselged; puuduvad seosed metoodilise raamistiku ja õppematerjali vahel; õppematerjalis puudub üliõpilase isiklik panus, selle rakendamine õpetamisel on küsitav. Kasutatud on vähe ja sobimatuid allikaid või allikad pole töö teemaga otseselt seotud. Uurimismeetodid on probleemi lahendamiseks sobimatud. Analüüs on pinnapealne, ebaloogiline või katkendlik, üliõpilase enda panus puudub. Töö sisaldab loomevargust. Töös kasutatud keeles esineb läbivalt vigu, mis teevad tekstist arusaamise keeruliseks; vormistus ei järgi viitamisjuhendit.\nÜliõpilane ei suuda kaitsmisel vastata enamikule retsensendi ja komisjoni küsimustest. Üliõpilane ei suuda end arusaadavalt väljendada, tema esinemisoskused on puudulikud."}}, "debt_elimination": {"et": "Kokkuleppel komisjoniga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "8d3a3c6f-f72e-2d16-ec64-bcfbbfcf1645", "person_name": "Natalja Zagura", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "a38b6152-004f-fbfa-2576-2a56c1d8abd8", "person_name": "Anu Treikelder", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Vt ajakava oma osakonna kodulehel. "}}, "registration_info": {"audience": {}}, "parent_uuid": "18f72e3c-38f2-0549-a35c-435a8659819d", "parent_code": "FLLC.00.011", "parent_credits": 15, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}