{"uuid": "f1171d7f-831f-246e-cf34-dc53b258ff04", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-09T09:52:37", "title": {"en": "Didactics of the Spanish Language II", "et": "Hispaania keele didaktika II"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 A regular HV", "et": "24/25 S PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 30, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "es", "et": "hispaania keel", "en": "Spanish"}], "description": {"en": "The objective of this course is to support teachers in training in their preparations for actual teaching of Spanish as a foreign language. We will apply the knowledge acquired in the pedagogical base module to the planning, execution and evaluation of Spanish classes. We will discuss setting goals for self and students, analyse different study materials and their appropriateness for reaching said goals. Also we will draw out example course and lesson plans. \nThe course will begin with a needs analysis that will set the work plan for the upcoming semester. ", "et": "Kursuse eesmärk on toetada õpetajakoolituse läbijaid reaalse õppetöö läbiviimisel. Rakendame pedagoogilistes alusainetes omandatud teadmisi konkreetse õppetöö kavandamisel, läbiviimisel ja hindamisel. Käsitleme eesmärkide seadmist endale ja õpilastele, analüüsime erinevaid õppematerjale ja nende sobivust eesmärkide saavutamiseks. Koostame näitlikke kursuseplaane ja tunnikavasid. \nKursus algab osalejate vajaduste analüüsiga, mille käigus pannakse paika semestri tööplaan. "}, "objectives": [{"en": "Planning a course in Spanish as a Foreign Language and its evaluation according to the needs of the target group. Choosing and adapting materials, compiling and analysis of lesson plans.", "et": "Hispaania keele kursuse kavandamine ja hindamine sihtrühmast lähtuvalt. Materjalide valimine ja kohandamine, tunnikavade koostamine ja analüüs."}], "learning_outcomes": [{"en": "After completing the course, the student", "et": "Aine edukalt läbinud üliõpilane"}, {"en": "- applies their theoretical knowledge on the methods and approaches to teaching foreign languages to plan and assess their work. ", "et": "-\trakendab teoreetilisi teadmisi võõrkeelte õpetamise metoodikast oma töö kavandamiseks ja analüüsimiseks;"}, {"en": "- analyses the compliance of FL Spanish textbooks and other study materials with the needs of different target groups.", "et": "-\tanalüüsib hispaania keele õpikute ja teiste õppevahendite vastavust erinevate sihtrühmade vajadustele."}, {"en": "- sets study methodologically sound objectives for their teaching, chooses appropriate activities for reaching them and selects suitable evaluation methods for their continuous and final assessment.", "et": "- seab õppetöös metodoloogiliselt põhjendatud eesmärke, valib nende saavutamiseks sobivad tegevused ja jooksvaks ning lõpphindamiseks kohased meetodid. "}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Cada participante debe realizar un plan de curso, entregado en partes a lo largo del cuatrimestre, y presentar el resultado final oralmente en clase.\n\nEl plan debe incluir: \n*Descripción del curso al cual se destina (duración, nivel de los participantes, edades, requisitos especiales). Una parte esencial de esto son los objetivos de estudio. \n*Resumen de los materiales que se va a usar y justificación para su selección, junto a la descripción de dos vías alternativas de actuación que se descartaron en la fase de planificación. \n*Planificación de los temas a cursar, junto con dos planes de clase ejemplares. \n*Recuento de los métodos de evaluación que se van a utilizar, junto con la justificación para su selección. \n*Para uno de los métodos de evaluación final selectos, una rúbrica detallada de evaluación. \n\nCaracterísticas de un buen trabajo escrito: \n*Sigue la estructura de un trabajo académico: empieza por una introducción que establece los objetivos del trabajo, sigue con la exposición de las partes requeridas del contenido organizadas en una secuencia lógica, y termina con una conclusión que resume la experiencia y añade una evaluación personal justificada a la experiencia de componer el material expuesto. \n* Bibliografía: utiliza una variedad de fuentes fidedignas, no sólo enciclopedias electrónicas. No copia sino parafrasea las ideas de otras personas con referencias correctas.\n* Lenguaje: utiliza un lenguaje adecuado a un registro académico. Es correcta gramaticalmente o contiene errores de gramática que no impiden la comprensión. \n*Formato: se formula según los requisitos a los trabajos escritos académicos que se establecen en el Departamento de Lengua y Literatura Hispánicas. \n\n\nCaracterísticas de una buena presentación:\n* Contenido: presenta una visión exhaustiva del asunto o tiene un enfoque personal justificado. La exposición es bien estructurada y lógica.\n* Exposición: utiliza un lenguaje adecuado a un registro académico. Es correcta gramaticalmente o contiene errores de gramática que no impiden la comprensión. Su habla y línea de pensamiento son fáciles de seguir y lógicas, apoyadas por materiales adicionales.\n* Puntualidad: presenta su exposición en el momento acordado y manda la versión electrónica a tiempo."}}], "grade_preconditions": {"et": "Participación mínima en 70% de las clases."}, "grade_evaluation": {"et": "Participación en los seminarios 30%\nContenidos del Plan de Curso 60%\nExposición del Plan de Curso y participación en la discusión 10% "}, "debt_elimination": {"et": "Vastavalt ÕKEle ja kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "20596b33-7415-4fb8-ad6d-a6084dd0d533", "type": "MOODLE", "code": "FLLC.03.002", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Consejo de Europa. (2001) \"MCERL\". Bruselas. Disponible en: http://cvc.cervantes.es/ensenanza/biblioteca_ele/marco/\n\nInstituto Cervantes. (2006). \"Plan Curricular del Instituto Cervantes\". Madrid: Biblioteca Nueva. Disponbile en: http://cvc.cervantes.es/ensenanza/biblioteca_ele/plan_curricular/default.htm\n\nRichards J. C & Rodgers T. S. (2001). Approaches and Methods in Language Teaching. Cambridge: Cambridge University Press", "recommended_materials": "- Alonso E., ¿Cómo ser profesor/a y querer seguir siéndolo?, Edelsa 2005\n- Giovannini A., Martín Peris E., Rodríguez M., Simón T., Profesor en acción 1-3, Edelsa 2007\n- Ribas R., d'Aquino A., ¿Cómo corregir errores y no equivocarse en el intento?, Edelsa 2004\n- Amat i Salas, O., Aprender a enseñar, Ediciones Gestión 2000 S.A 2002"}, "participants": {"lecturers": [{"person_uuid": "b8049028-e668-ca0c-ab5d-0c9c0674083d", "person_name": "Mari Kruse", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-16"}}, "registration_info": {"audience": {"et": "magistriõpe"}, "min_students": 1}, "parent_uuid": "269387eb-7efc-fca3-f4dd-b833f934d6b8", "parent_code": "FLLC.03.002", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}