{"uuid": "a386776a-9dae-69b8-b65b-cf0b0fc6d261", "code": "hv-2018-autumn-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Introduction to Culture Studies", "et": "Sissejuhatus kultuuriteooriatesse"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 24, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 116, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Concept and definitions of culture; history and philosophy of culture, Kulturwissenschaft; development of social theory, culture and society (Durkheim, Marx, Weber); approaches to culture in socio-cultural anthropology, main schools (evolutionism, functionalism, structural-functionalism, structural anthropology, interpretive anthropology); sociology of culture (Frankfurt school, Althusser, Gramsci, Bourdieu); macro and micro theories of culture; psychoanalytic approaches to culture (Freud, Jung, Lacan); postmodern and poststructuralist approaches (Baudrillard, Foucault); globalization; psychology of culture (Wundt, Vygotsky); semiotics of culture (Tartu-Moscow school); cultural ecology.", "et": "Kultuuri mõiste ja selle erinevad määratlused (Kroeber ja Kluckhohn, erinevad distsiplinaarsed käsitlused); Kultuurifilosoofia, kultuuriajalugu ja saksa Kulturwissenschaft; Kultuuriantropoloogia kujunemine; kultuuriantropoloogia koolkonnad (evolutsionism, funktsionalism, strukturalism, tõlgendav antropoloogia jms); Kultuuri sotsioloogilise käsitluse alusepanijad (Durkheim, Marx, Weber); Koolkonnad ja edasiarendused kultuurisotsioloogias, postmarksism (Frankfurdi klk, Althusser, Gramsci, Bourdieu); kultuuri mikro- ja makroteooriad, structure-agency; Briti kultuuriuuringud, Psühhoanalüütilised kultuurikäsitlused (Freud, Jung, Lacan); Postmodernism ja postsrukturalism; individuaalsuse probleem (Lacan, Foucault); Globaalkultuuriteooriad; Kultuurikäsitlused kultuuripsühholoogias, kultuuri ja taju küsimused (Wundt, Võgotski); Kultuurisemiootika kujunemine ja eripära (Vene vormikoolkond, Jakobson, Lotman); kultuur keskkonnas (nature-nurture; kultuurievolutsionism, keskkonna kultuuriline tajumine)."}, "objectives": [{"en": "The course provides a general overview of the history and development of the idea of culture in humanities and social sciences, and of different theoretical and methodological approaches to study culture.", "et": "Aine eesmärgiks on anda üldine ülevaade kultuuri teoreetilistest käsitlustest sotsiaal- ja humanitaarteadustes ning nende kujunemisloost, tutvustada erinevate kultuurikäsitluste filosoofilisi ja metodoloogilisi lähtekohti, keskseid mõisteid ja kontseptsioone."}], "learning_outcomes": [{"en": "Having graduated from the course a student: 1. is acquainted to main theoretical approaches to culture in the 19th and 20th centuries, to main authors, terms and concepts; 2. recognises the main theoretical and philosophical issues related to defining and studying culture; 3. is independently able to read critically cultural theoretical texts; 4. is able to apply at a preliminary level cultural theoretical ideas and concepts for analysing everyday cultural situations.", "et": "Õppeaine edukal läbimisel üliõpilane\n1. omab ülevaadet kultuuriteooria olulisematest suundadest, autoritest, kesksetest mõistetest ning kontseptsioonidest 20. sajandil\n2. orienteerub vastavate teooriate üldises raamistikus, põhimõistes, mudelites, meetodites \n3. on võimeline iseseisvalt kriitiliselt lugema kultuuriteoreetilisi tekste\n4. oskab algtasemel rakendada vastavaid teoreetilisi mõisteid ja mudeleid ümbritseva kultuurikonteksti analüüsil"}], "notes": {}}, "grading": {"independent_work": {"et": "Tudengid peavad kriitiliselt lugema seminari tekste ja suutma leida seoseid tekstide ja loengus räägitud teemade vahel. Tudengid saadavad kirjalikult õppejõule 2-3 vabalt valitud küsimusele vastused.Küsimused on leitavad ÕISis.  Seminarides toimuvad arutelud on ka üks tagasiside vormidest, mida õppejõud tudengite tekstimõistmisele annab.  Juhul kui tudeng ei saa osaleda seminaris, siis saadab ta kirjalikud vastused kõikidele küsimustele. Nendele eraldi õppejõud tagasiside ei anna. Küll aga teeb ta seda konsultatsioonis, mida saab õppejõuga kokku leppida.\n\nReading seminar texts.Student has to differentiate the key points of the article and to synthesize it with his/her previous knowledge and own opinion. Student should be able to answer to question about seminar texts. Questions is in SIS. Student also send to lecture written answer for two questions. If student can't be participate in seminar then student will send answer for all questions about seminar text."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Seminarides osalemine ja kirjalikud seminari tekstide küsimuste vastused 20%\nE -   vastused  üldjoontes loogilised, ent seosed puudulikud;\nD -   vastused küsimustele üldjoontes loogilised ja seostatud; esineb probleeme materjali mõistmisel\nC -  vastuste analüütilised seosed ja tõlgendused korralikud; \nB -  maht ja seostamine omandatud materjaliga väga hea, seoste ja viidete põhjalik analüüs, tõlgendamine julge ja seostele tuginev; \nA -  vastuse maht ja seostamine tekstiga loominguline, analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, lisatud omapoolne probleemi edasiarendus.\n\nParticipation in seminars and written answers to the questions about text (given by lecturer) 20%  \nE -   answers are generally logical, but relations between different statements are missing;\nD -   answers are generally logical and related each other; but there is still missing the demonstration of understanding of whole topic; \nC - analytical relations between topics and correct and interpretations are logical;   \nB -  the scope of acquired material is very good and a student demonstrates the integration of new concepts with his/her previous knowledge, analysis of different viewpoints are courageous and thorough;\nA -  the scope of acquired material is very good and a student demonstrates the integration of new concepts with his/her previous knowledge, relations between topics are thorough and inventive, there is also included a critical point of view and a problem solving."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik eksam, mis hõlmab ka kohustusliku kirjanduse kontrolli,\nmoodustab 80 % hindest.\n Hindamiskriteeriumid:\n\t-   loengus ja seminarides omandatu maht;\n\t-\tanalüütilisus, seoste loomine, tõlgendamisoskus;\n\t-\tteemakäsitluse loogilisus ja terviklikkus.\n\nE -  analüüsi ja iseseisva tõlgendamise elemendid olemas, teemakäsitlus üldjoontes loogiline, ent seosed lünklikud;\nD -  analüüs ja iseseisev tõlgendamine arusaadavad, ent ebakindlad, teemakäsitus üldjoontes loogiline ja seostatud;\nC -  analüütilised seosed ja tõlgendused korralikud, kindlus seoste loomisel, teemakäsitlus loogiline, ent terviku seisukohalt täheldatavad mõned küsitavused;\nB -  maht ja seostamine omandatud materjaliga väga hea, seoste ja viidete põhjalik analüüs, tõlgendamine julge ja seostele tuginev, teemakäsitus tervikuna loogiline ja ladus;\nA -  maht ja seostamine tekstiga loominguline, analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, teemakäsitlus uudne, loogiline, tekst tervikuna väga hästi sõnastatud.\n\nWritten exam, which include also understanding seminar text, 80% of total mark\n \n Criteria of assessment:  \n\t-   acquired scope of  topics that are studied in lectures and seminars\n\t-   analytical skills, creating of relations between different topics, skills of interpretations;\n\t-   consistency and wholeness of topic.  \n\n E - the form is, in general, in compliance with the requirements and correct; references are minimal and insecure; the elements of analysis and independent interpreting are there; the coverage of the subject is, in general, logical, but the connections are full of gaps;\nD - the form is in compliance with the requirements and, in general, correct; references are minimal, but relevant; the analysis and independent interpreting is understandable, but at times insecure; the coverage of the subject is logical and associated;\nC - the form is in compliance with the requirements and correct; references are relevant and sufficient; analytical connections and interpretations are proper and there is certainty in creating connections; the treatment of the subject is logical, but there are some weaknesses from the point of view of the whole;\nB - the form is excellent; the choice, amount and association of references with the text is very good; thorough analysis of connections and references; bold interpretation based on connections; the treatment of the subject as a whole is logical and smooth;\nA - the form is excellent; the choice, amount and association of references with the text is creative; the depth of the analysis and the level of independent interpretation is remarkable; the connections are thorough-going and creative; the treatment of the subject is innovative and logical; the text is a remarkable achievement on the whole."}}], "grade_preconditions": {"et": "Osalemine seminarides (vähemalt kuuest seminaris neljas), kuus (6) lühikest kirjalikku tööd (ca 2000 tm) igaks seminariks loetud tekstide põhjal.\n\nParticipation in seminars (at least 2/3), 6 written short answers which are based on questions of seminar text (2000 letter)"}, "grade_evaluation": {"et": "Osalemine ja aktiivsus seminarides 20%, Kirjalik eksam 80 %.\n\nParticipation and activity in seminars 20 %, written exam 80%"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga.\n\nConsultation with lecturer."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Wright, Georg Henrik von. 1996 [1993]. Spengler ja Toynbee. Kogumikus Minerva öökull.\nlk. 75-135.\n\n \n\nTodorov, Tzvetan. 2001. Ameerika avastamine.- Ameerika vallutamine. Teise probleem. Tallinn: Varrak. lk.11-67.\n\n\n A.R. Radcliffe-Brown: \"Funktsiooni mõistest sotsiaalteadustes\" (79-93)\n\"Sotsiaalsest struktuurist\" (131-153) raamatust \"Funktsioon ja struktuur Briti koolkonnas\" TLÜ Kirjastus 2013.\n\n\nMarx, Karl 1953. Kapital. I kd, 1. rmt. Lihtne taastootmine. Tallinn: Eesti Riiklik Kirjastus, lk 491-502.\nAlthusser, Louis. Ideoloogia ja ideoloogilised riigiaparaadid I. - Akadeemia nr 7, 2006, lk 1451-1481.\n \nFreud, Sigmund. Ahistus kultuuris, lk 18-51\n\nJameson, Fredric. Postmodernism ja tarbimisühiskond. - Vikerkaar, nr 1-2, 1997, lk 128-141.\nBaudrillard, Jean. Tähenduse implosioon meedias. - Simulaakrumid ja simulatsioon, Tallinn: Kunst. 1999, lk: 119-129\n\nBarber, Benjamin R.  10. Džihaad McMaailma vastu või Džihaad Mcmaailma kaudu? 11. Džihaad Mcmaailma sees: \"demokraatiad\" 15. Džihaad ja McMaailm uues maailmakorratuses 16. Metsik kapitalism demokraatia vastu. - Džihaad Mcmaailma vastu. Tallinn: Tänapäev, lk. 169-196, lk. 229-254.\n \nLotman, Juri 1999. Argielu ja kultuur: argikäitumise poeetika 18. saj vene kultuuris. - Semiosfäärist. Tallinn: Vagabund, lk 263-300.\n \nCassirer, Ernst 1997. Sümbol - inimloomuse võti; Loomsetest reaktsioonidest inimomaste vastusteni. - Uurimus inimesest. Tartu: Ilmamaa, lk 44-67.\nHuizinga, Johan 2004. Mängu kui kultuurinähtuse olemus ja tähendus. - Mängiv inimene. Tallinn: Varrak, lk 9-37.", "recommended_materials": "Denis McQuail. McQuaili massikommunikatsiooni teooria. Tartu: Tartu Ülikooli Kirjastus, 2003.\nDominic Strinati. Sissejuhatus popkultuuri teooriatesse. Tallinn: Kunst, 2001.\nEpp Annus. 20. sajandi mõttevoolud. Tartu: Tartu Ülikooli Kirjastus, 2009.\nErnst Cassirer. Uurimus inimesest. Sissejuhatus inimkultuuri filosoofiasse. Tartu, Ilmamaa, 1999.\nJanek Kraavi. Postmodernism ja postmodernistlik kultuur. Ülevaade 20. sajandi teise poole kultuuri ja mõtlemise arengust. Viljandi Kultuuriakadeemia, 2005\nJohan Huizinga. Mängiv inimene. Tallinn: Varrak, 2004.\nJuri Lotman. Semiosfäärist. Tallinn: Vagabund, 1999.\nMarcel Danesi. Kultuuride analüüs. Tallinn: Valgus, 2005\nPeter L. Berger; Thomas Luckmann. The Social Construction of Reality: a treatise in the sociology of knowledge. London: Penguin Books, 1991."}, "participants": {"lecturers": [{"person_uuid": "3b114103-d1b3-57e5-5f55-8dea0e13a6d4", "person_name": "Andreas Ventsel", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2018-09-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus. Kultuuri määratlemise põhiviisid. Kultuuriteooriate alused."}}, {"time": "2018-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuurifilosoofia"}}, {"time": "2018-09-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuurifilosoofia. 1.Seminar\nWright \"Toynbee ja Spengler\""}}, {"time": "2018-09-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuurisotsioloogia 1"}}, {"time": "2018-09-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuurisotsioloogia 1-2"}}, {"time": "2018-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuurisotsioloogia. 2. seminar\nMarx ja Althusser"}}, {"time": "2018-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuurisotsioloogia 2"}}, {"time": "2018-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuuriantropoloogia"}}, {"time": "2018-10-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuuriantropoloogia. 3. Tzvetan Todorov"}}, {"time": "2018-10-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuuriantropoloogia. 4. seminar\nRadcliffe-Brown"}}, {"time": "2018-10-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuuripsühholoogia.Psühhoanalüütilised kultuuriteooriaid."}}, {"time": "2018-10-31", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuuripsühholoogia.Psühhoanalüütilised kultuuriteooriaid.5. seminar. Freud"}}, {"time": "2018-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuuripsühholoogia."}}, {"time": "2018-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Postmodernistlikud ja poststrukturalistlikud kultuuriteooriad."}}, {"time": "2018-11-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Postmodernistlikud ja poststrukturalistlikud kultuuriteooriad. 6.Seminar\nJameson/Baudrillard"}}, {"time": "2018-11-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Globalism, regionalism. 7.seminar\nBarber"}}, {"time": "2018-11-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kultuurisemiootika"}}, {"time": "2018-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuurisemiootika. 8.seminar\nLotman"}}, {"time": "2018-12-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kultuuriteooriad ja kultuuriteadus. 9.Seminar\nHuizinga & Cassirer"}}, {"time": "2018-12-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kokkuvõte"}}, {"time": "2018-12-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Eksam"}}]}, "registration_info": {"audience": {}, "min_students": 15}, "parent_uuid": "e719eded-8ab3-58c0-2b80-dbe4547d9bca", "parent_code": "FLSE.00.138", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}