{"uuid": "ecf8264e-3880-e695-48dc-61973a309dac", "code": "FLSE.00.336", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sociocultural Systems and Semiotic Subject", "et": "Sotsiokultuurilised süsteemid ja semiootiline subjekt"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "1. Sociosemiotics: matter and historical background. (Socio)semiotics as a social science: the position of pragmatism and semiology.\n2. Relations between 'culture' and 'society': historical and conceptual background. The discovery of the society and the individual. \n\n3 Fusion of the object- and the metalevel in societal inquires. \n\n4. Interdisciplinariness on meta- and object levels. Diversity of knowledge, 'diverse worlds', ways to connect them \n\n5. Object, metalanguage, prejudice in the study of culture and society. \n\n6. Materiality-psychlogility of signs. Unlimited semiosis, Habit, boundedness of interpretants.\n\n7.Social act of action: gestures, meanings, significancies. Object types in the semiotic reality.", "et": "Kursuse põhiteemad:\n1.\tSotsiosemiootika: aines ja ajalooline taust. (Sotsio)semiootika kui sotsiaalteadus: pragmatismi ja semioloogia positsioon.  \n2.\t'Kultuuri' ja 'ühiskonna' suhted: ajaloolis-kontseptuaalne taust. Ühiskonna ja indiviidi avastamine-tegemine. Objekt- ja metatasandi põimitus ühiskonnauuringutes.   \n3.\tInterdistsiplinaarsus meta- ja objekttasandil. Teadmiste eri liigid ja maailmad, nende ühendamise viisid.  \n4.\tObjekt, metakeel ja eelarvamus kultuuri ja ühiskonna kirjeldamises.  \n5.\tMärkide materiaalsus-psühholoogilisus-sotsiaalsus. Lõppematu semioosis, harjumus ja interpretantide põimitus.  \n6.\tSotsiaalne suhtlusakt: žestid, tähendused ja tähtsused. Objektitüübid semiootilises reaalsuses.  \n7.\tSemiootiline mina.\n8.\tSemiootiline kompetentsus. Ratsionaalsus ühiskonnas."}, "objectives": [{"en": "The course gives an overview of sociosemiotics in the era of interdsciplinarity, and introduces sociosemiotics as connected with the general transdisciplinarity in humanities and the social sciences. We view methods and principles in the social sciences. Main stands in research in sociosemiotics. The structure and function of communicative systems in society. Examples outlined about those connections between the object- and metalevel that have influenced scientific thought and that have led to the emergence of sociosemiotics. The accent is not on individual or individualised objects, but on the complex 'individual-culture-society-environment'.", "et": "Kursus annab ülevaate sotsiosemiootikast interdistsiplinaarsuse ajajärgu|,ja tutvustab sotsiosemiootika kui interdistsiplinaarse suuna seoseid üleüldise sotsiaalhumanitaarteadusliku transdistsiplinaarsusega. Vaadeldakse sotsiaalteaduslikke metoodeid ja põhimõtted sotsiosemiootikas. Suhtluse uurimise põhiseisukohad sotsiosemiootikas. Kommunikatsioonisüsteemide struktuur ja funktsioon ühiskonnas. Indiviidi arengu staadiumid võrrelduna nende eritlemisega psühholoogia, sotsioloogia jm ühiskonnadistsipliinide raames. Tuuakse näiteid nendest objekt- ja metatasandi vahelistest seostest, mis on teadusliku mõtte arengut mõjutanud ning viinud sotsiosemiootika tekkeni. Fookuses on, et sotsiosemiootika ei keskendu individualiseeritud objektidele, vaid tegeleb pigem kompleksiga'inimene-kultuur-ühiskond-keskkond'."}], "learning_outcomes": [{"en": "1) has knowledge about both the semiotic and the semiological paradigms that led to the emergence of sociosemiotics; \n\n2) is able to critically assess publications in sociosemiotics, and to distinguish/compare those from sociosemiotics as a scinetific paradigm \n\n3) understands semiotics as social science and has the relevant basic knowledge about carrying out a semiotic analysis", "et": "Õppeaine läbinu:\n1) omab teadmisi semiootilisest ja semioloogilisest paradigmast, mis viisid\nsotsiosemiootika tekkeni;\n2) on võimeline kriitiliselt hindama sotsiosemiootikaks nimetatud uurimusi ning\nvõrdlema/eristama neid sotsiosemiootikast kui teaduslikust paradigmast;\n3) mõistab semiootikat kui sotsiaalteaduslikku distsipliini ja evib teadmisi\nsotsiaalteadusliku semiootilise uurimuse läbiviimise põhitõdedest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}