{"uuid": "a21ced5e-0b97-9be0-3cf7-01aa74481d0f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-25T10:45:45", "title": {"en": "Semiotic Analysis of Art and Multimedia", "et": "Multimeedia ja kunsti semiootiline analüüs"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV Eng", "et": "25/26 K PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 30, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course is divided into two sections.\nThe first section is on semiotics of performance (a detailed description is given under time schedule).\nThe second section gives an overview of interaction of different semiotic modalities in construction of meaning and of means of semiotic conceptualisation and analysis of their interaction", "et": "Kursus on jaotatud kahte ossa. Esimene osa on pühendatud etenduse semiootilisele käsitlusele (täpsem ülevaade teemadest ajakava all). Teine osa annab ülevaate erinevate semiootiliste modaalsuste rollist tekstilise tähenduse loomisel ja semiootilise kontseptualiseerimise vahenditest ning modaalsuste interaktsiooni analüüsist."}, "objectives": [{"en": "The course gives an overview of different semiotic means of analysis of performative (dance, theatre, rituals, bodily expression etc) and multimedial (cinema, TV, video, commercials, print media, new media etc) texts. The course gives an overview of the central problems, main authors, approaches and methods for analysing performative and multimedial texts, and performativity and multimediality in culture more generally. In seminars various methods are applied in constructing and analysing performative and multimedial texts. Course also contains practical works (small scenes and etudes etc).", "et": "Kursuse peamine eesmärk on anda ülevaade performatiivsete (teater, tants, rituaalid, kehaline eneseväljendus jmt) ja multimeedialiste (kino, televisioon, video, reklaam, trükimeedia, uus meedia jne) kultuurinähtuste semiootilise analüüsi erinevatest vahenditest. Tutvustatakse olulisemaid probleeme, tähtsamaid autoreid, teooriaid, käsitlusi ja analüüsimeetodeid. Seminarides proovitakse erinevaid teooriaid rakendada perfomatiivsete ja multimeedialiste tekstide konstrueerimisel ning analüüsimisel. Kursus sisaldab ka praktilisi ülesandeid (nt etüüdid)."}], "learning_outcomes": [{"en": "On successful completion of the unit, students will be able to:\n- appreciate some of the central issues in semiotic approach to mediation, multimedial and performative arts and texts;\n- demonstrate knowledge of the key concepts, models and issues introduced during the course;\n- describe semiotic aspects of a phenomena in hand and choose relevant concepts and models for analysing them;\n- read the relevant texts critically and reflexively and be able to identify problems arising from them; withdraw the most important concepts of a theoretical texts and defend his/her position in a discussion;\n- understand different cultural events which can be analysed as performances or instances of mediation;\n- know and can apply different semiotic approaches in analysis of multimedial relations and performativity in texts and in culture;\n- discriminate, combine and describe different semiotic modalities and analyse their interaction in meaning construction both in multimedial and performative texts;\n- break down and also compose multimedial and performative texts, evaluate the influence and role of author, receiver and context when analysing or constucting the text;", "et": "Loengu läbinud üliõpilane:\n1) suudab tekstidest olulisima välja tuua kaitstes oma seisukohti diskussioonis;\n2) õpib kehalise eneseväljenduse vahendusel isiklikku kogemust analüüsima;\n3) teab etenduse uuringute ajalugu, tunneb semiootilist ning fenomenoloogilist lähenemist;\n4) saab aru erinevatest etenduse all mõistetud kultuurinähtustest;\n5) teab ja oskab rakendada erinevaid semiootilisi lähenemisi tekstide multimeedialiste suhete analüüsimisel;\n6) eraldab, kombineerib ja kirjeldab erinevaid semiootilisi modaalsusi ning analüüsib nende interaktsiooni tähenduse konstrueerimisel;\n7) suudab luua multimediaalset teksti ning hinnata autori, vastuvõtja ja konteksti mõju ja rolli teksti analüüsimisel või konstrueerimisel."}], "notes": {"et": "The course gives an overview of the nature of semiotic issues in multimedial and performative phenomena in culture and an introduction to different semiotic means of analysis of performative (dance, theatre, rituals, bodily expression etc) and multimedial (cinema, TV, video, commercials, print media, new media etc) texts. The course gives an overview of the central problems, main perspectives, authors, approaches and methods for thinking about and analysing performative / multimedial texts, and performativity and multimediality in culture more generally.\nIn seminars various perspectives and methods are applied in discussing, constructing and analysing performative and multimedial texts."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Look at the course manual."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "The criteria of assesment for written analysis\nA - the object chosen is excellent for analysis of multimediality or performativity; analysis is very detailed and comprehensive; theoretical texts used for the analysis are relevant for the topic, the concepts used in a well-defined, the argumentation clear and well-structured, the author's own synthesis original, scientifically correct presentation of the text;\nB - the object chosen is suitable for analysis of multimediality or performativity; analysis is thorough, detailed and comprehensive; correct use of terms, the theoretical texts used relevant for the topic, original ideas present, minor gaps in argumentation, presentation or structuring of the text;\nC - the object chosen is rather suitable for analysis of multimediality or performativity; analysis is well made and gives good overview of the multimedial or performative issues at hand; the use of concepts not fully consistent, the line of argumentation tracable but further comments needed, problems with the integrity of the text;\nD - the object chosen might not be quite as suitable for analysis of multimediality or performativity; the analysis is not very comprehensive and discusses some of the multimedial or performative issues at hand; the central concepts irrelevant or not well defined, larger gaps in binding different parts of the text together, the theoretical works not fully relevant, the text lacks originality;\nE - the object chosen is not very suitable for analysis of multimediality or performativity; the analysis is sketchy and discusses few of the relevant multimedial or performative issues; the argumentation of the text hard to follow, no relevant references, the text is unstructured and the presentation does not fully follow the academic standards;\nF - the object chosen is not suitable for analysis of multimediality or performativity; analysis is lacking or irrelevant; no signs of logical argumentation, originality or academic structuring principles, concerning both the form as well as the content;"}}], "grade_preconditions": {"et": "Participation in lectures and seminars ( at least 50%), final presentation."}, "grade_evaluation": {"et": "The criteria of assesment for attendence, activity\nA - attended in all lectures and seminars, participated actively in discussions;\nB - attended in 90% of lectures and seminars, participated actively in discussions;\nC - attended in 75% of lectures and seminars, participated in discussions;\nD - attended in 60% of lectures and seminars, at times participated in discussions;\nE - attended in 50% of lectures and seminars, little participation in discussions;\nF - attended in less than 50% of lectures and seminars, no acitve participation in discussions;"}, "debt_elimination": {"et": "To be arranged individually."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "The materials will be shared during the course."}, "participants": {"lecturers": [{"person_uuid": "256d35f6-eb41-60a4-0a3e-7e450916033b", "person_name": "Katre Pärn", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The program will be presented in the beginning of the course."}}]}, "registration_info": {"audience": {"et": "The course is intended for international MA students in semiotics, and is a part of international program of master studies in semiotics. However, other interested graduate students and 3rd year bachelor students are welcome."}, "min_students": 3}, "parent_uuid": "c6f715c6-7fb1-f1f0-b6fd-02fee0e0512a", "parent_code": "FLSE.00.273", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}