{"uuid": "eaa9092f-83b2-c6bc-d697-0c30a312eb7e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-10T12:52:23", "title": {"en": "Ecosemiotics", "et": "Ökosemiootika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 A regular HV", "et": "24/25 S PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 18, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The topic of the course is an introduction to ecosemiotics - i.e., the discipline on the border of ecology and cultural semiotics. Its main questions include the interpretation of natural and cultural environment, the mechanisms that create and balance the environmental conflicts. For understanding ecosemiotics the course gives a preview of ecology and the possibilities for applying these in ecosemiotic paradigm are discussed. The course deals also with the history and typology of the relationships between culture and nature.", "et": "Antakse sissejuhatav ülevaade ökosemiootikast - ökoloogia ja kultuurisemiootika piirialal kujunenud distsipliinist. Selle peamisteks küsimusteks on loodus- ja kultuurikeskkonna interpreteerimine, keskkonnakonflikte tekitavad ja neid tasakaalustavad mehhanismid. Ökosemiootika mõistmiseks antakse ülevaade ökoloogia põhialustest ja näidatakse, kuidas on need ökosemiootika teoorias arendamist leidnud. Eraldi käsitletakse inimese ja keskkonna vastastikust mõju, kultuuri ja ühiskonna sümbioosi kultuuriepohhide ja märgisüsteemide kujunemisel."}, "objectives": [{"en": "The course gives a systematic overview of the basics of ecology, ecosemiotic paradigm, and relations between culture and nature. Populations, ecosystems, societies and cultural phenomena are treated as semiotic and communicative webs by emphasizing their structure, dynamics and interrelations. Semiotic aspects of environmental problems are analyzed.", "et": "Kursus annab süstemaatilise ülevaate ökoloogia põhialustest, ökosemiootika paradigmast ning kultuuri ja looduse suhetest. Populatsioone, ökosüsteeme, inimühiskonda ja kultuurinähtusi käsitletakse semiootiliste ja kommunikatiivsete suhtevõrgustikena, tuues esile nende struktuursust, dünaamikat ja vastasseoseid. Vaadeldakse keskkonnaprobleemide semiootilisi aspekte."}], "learning_outcomes": [{"en": "1) After completing the course the student is familiar with the basics of ecology and major environmental problems; 2) knows theoretical foundations of ecosemiotics and is able to apply these independently; 3) has an overview of essential authors and directions of environmental thought.", "et": "1) Õppeaine läbinud üliõpilane on tuttav ökoloogia alustega ja peamiste keskkonnaprobleemidega; 2) tunneb ökosemiootika teoreetilisi aluseid ja analüüsimeetodeid ning oskab neid iseseisvalt rakendada. 3) omab ülevaadet keskkonnamõtte suundadest ja olulisematest autoritest."}], "notes": {"et": "Kõik loengud ja seminarid toimuvad plaanitult auditoorse tööna. Vajadusel jooksvad muudatused."}}, "grading": {"independent_work": {"et": "Loetud 12 erialase teksti refereerimine.\nRefereeringute esitamine kirjalikult ja ettekannetena."}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Esitatud refereeringute arv (arvestatakse õigeaegset esitamist).\nTekstidest arusaamine, ökoloogia, ökosemiootika ja keskkonnamõtte aluste tundmine.\nRefereeritud tekstide põhjal küsimuste ja aruteluteemade väljapakkumine."}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Osaletud seminaride arv.\nÜhe refereeritud teksti avalik tutvustamine seminaris.\nAktiivne osalemine arutelus."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Ökosemiootika või keskkonnahumanitaaria teemalise mõiste analüüs ja seostamine semiootikaga (1 lk ulatuses). TÄHTAEG: 21. oktoober"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Keskkonnakriisi probleemile semiootilise lahenduse pakkumine (1 lk ulatuses). TÄHTAEG: 2. detsember"}}], "grade_preconditions": {"et": "Eksamile pääsemise tingimused:\n1) osavõtt 75% loengutest ja seminaridest,\n2) kodutööde õigeaegne esitamine."}, "grade_evaluation": {"et": "Hindamise aluseks on: (1) loetud tekstide refereerimine kodutööna, (2) refereeringute esitamine ja arutelus osalemine seminaris ning (3) kirjalikud ülesanded. Lõplik hinne kujuneb hindamismeetodite (1) - 20%, (2) - 20%, (3) - 60% suhte põhjal."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine õppejõuga kokkuleppel."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "1f5b8d30-eda1-4ea7-b375-6441842908af", "type": "MOODLE", "code": "FLSE.00.069", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1. Pickett, S., & Cadenasso, M. 2002. The Ecosystem as a Multidimensional Concept: Meaning, Model, and Metaphor. Ecosystems, 5, 1-10.\n2. Patten, Bernard C.; Odum, Eugene P. 1981. The cybernetic nature of ecosystems. - The American Naturalist 118(6): 886-895.\n3. Rowley-Conwy, Peter; Layton, Robert 2011. Foraging and farming as niche construction: stable and unstable adaptations. Philosophical Transactions of the Royal Society B: Biological Sciences 366(1566): 849-862.\n4. Diamond, Jared 2005. Collapse: How Societies Choose to Fail or Succeed. London: Penguin Books, 486-499.\n5. Uexküll, Jakob von 2012. Ptk.-d Tähendusõpetus. Looduse kompositsiooniõpetus. - Omailmad. Tartu: Ilmamaa, 317-323, 346-355.\n6. Nöth, Winfried 2001. Ecosemiotics and the semiotics of nature - Sign Systems Studies 29(1): 71-81.\n7. Farina, A., & Belgrano, A. 2005. The Eco-field Hypothesis: Toward a Cognitive Landscape. Landscape Ecology, 21, 5-17.\n8. Kull, Kalevi 2010. Ecosystems are Made of Semiosic Bonds: Consortia, Umwelten, Biophony and Ecological Codes. Biosemiotics (2010) 3:347-357. \n9. Lindahl Elliot, Nils 2006. Mediating Nature. London, New York: Routledge, 198-216.\n10. Whitehouse, Andrew 2015. Listening to Birds in the Anthropocene: The Anxious Semiotics of Sound in a Human-Dominated World. Environmental Humanities, vol. 6, 53-71\n11. Augustyn, Prisca 2013. Man, nature, and semiotic modelling or How to create forests and backyards with language. Sign Systems Studies 41(4), 488-503.\n12. Rueckert, William 1996. Literature and Ecology. An experiment in ecocriticism. - Glotfelty, Cheryll; Fromm, Harold. The Ecocriticism Reader. Landmarks in Literary Ecology. Athens: University of Georgia Press, 105-123.", "recommended_materials": "Bateson, G. 1972. Steps to an Ecology of Mind. New York: Ballantine.\nCoupe L. (ed.) 2000. The Green Studies Reader: From Romanticism to Ecocriticism. London: Routledge.\nDiamond, J. 2002. Püssid, pisikud ja teras. Inimühiskondade erinevad saatused. Tlk. A. Kivikangur. Tallinn: Eesti Entsüklopeediakirjastus.\nDodson, S. I.; Allen, T. F. H.; Carpenter, S. R. 1998. Ecology. New York; Oxford: Oxford University Press.\nGlotfelty C., Fromm H. (eds.) 1996. The Ecocriticism Reader: Landmarks in Literary Ecology. Athens, Georgia: Georgia University Press.\nIngold T. 2000. The Perception of the Environment: Essays in Livelihood, Dwelling and Skill. London: Routledge.\nKeskpaik R. 2003. Loodus kui sõnum: mis on ökosemiootiline vaade loodusele. Looduskaitsealaseid töid VII: 45-50.\nKull K. 1998. Semiotic ecology: different natures in the semiosphere. - Sign Systems Studies 26, 344-371.\nLuhmann. N. 1998. Ecological Communication. Chicago: University of Chicago Press.\nMaran, T.; Tüür, K. (koost., toim.) 2005. Eesti looduskultuur. Tartu: Eesti Kultuuriloo ja Folkloristika Keskus, Eesti Kirjandusmuuseum.\nMasing, V. 1998. Ökoloogialeksikon. Tallinn: Eesti Entsüklopeediakirjastus.\nNöth W. 1998. Ecosemiotics. - Sign Systems Studies 26, 332-343.\nPalang H., Sooväli H. (toim.) 2001. Maastik: Loodus ja kultuur (maastikukäsitlusi Eestis). Tartu: Tartu Ülikooli geograafia instituut.\nPonting C. 2009. Uus maailma roheline ajalugu. Tallinn: Varrak.\nSign Systems Studies 29.1 Special Issue on Semiotics of Nature. 2001\nSign Systems Studies 44(1/2). Special issue: Framing nature and culture. 2016\nSimmons, I.G. 1993. Interpreting Nature: Cultural Constructions of the Environment. London: Routledge.\nSpirn, A. W. 1998. The Language of Landscape. New Haven, London: Yale University Press.\nUexküll J. v. 2012. Omailmad. Eesti mõttelugu. Tartu: Ilmamaa."}, "participants": {"lecturers": [{"person_uuid": "023d1771-d955-fe94-59d4-c6eded488908", "person_name": "Timo Maran", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-14"}, "entries": [{"course_week": 2, "time": "2024-09-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus. Ülevaade ökoloogia ajaloost: etapid, põhimõisted ja suunad. Kultuuri ja looduse suhe ökoloogia osana. Ökosemiootika mõiste."}}, {"course_week": 3, "time": "2024-09-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "Ökoloogilised tegurid. Eri liikide vaheliste seoste ruumiline ja ajaline dünaamika. Ökosüsteemi mõiste ja omadused. Aine ja energiaringed. Biosfäär ja semiosfäär. Gaia."}}, {"course_week": 4, "time": "2024-09-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Kommunikatsiooni roll ökosüsteemis. Inimese kui liigi eripära ökosüsteemis. Ühiskondade ja põllumajanduse tüübid ja nende mõju kultuurilised ja ökoloogilised aspektid. Keskkonnaajalugu. Inimühiskonna ja looduse suhete semiootilised aspektid."}}, {"course_week": 5, "time": "2024-09-30", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Loetud ökoloogiaalaste tekstide refereerimine ja arutelu."}}, {"course_week": 6, "time": "2024-10-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {"et": "Signifikatsioonilised suhted organismi ja keskkonna vahel. G. Tembrocki tööd. Semioositüüpide jaotus loomadel. J. v. Uexküll ja Omailma teooria ökosemiootika kontekstis. Semiootiliste suhete mõju ökosüsteemile. Organismi piiride küsimus."}}, {"course_week": 7, "time": "2024-10-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {"et": "Bioloogilise ja kultuurilise ökosemiootika eristus. Looduse ja kultuuri suhete kirjeldamine ökosemiootika vaatenurgast. K. Kull ja loodustüüpide klassifikatsioon. Põlisloodus. Teine loodus. Virtuaalne loodus. Inimkultuuri ja keskkonna võimalikud suhtetüübid. Semiotsiid."}}, {"course_week": 8, "time": "2024-10-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {}, "description": {"et": "Ökosemiootika rakendusvõimalused. Omailma analüüsi rakendused. A. Farina ja ökovälja mudel. K. Kulli loodustüüpide ja A. Hornborgi semioositüüpide mudeli rakendused. Hübriidsed keskkonnad Nils Lindahl Ellioti ja Bruno Latouri töödes. Loodusteksti mudel ja selle kasutamine looduskirjanduse analüüsis."}}, {"course_week": 9, "time": "2024-10-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "Loetud ökosemiootikaalaste tekstide refereerimine ja arutelu."}}, {"course_week": 10, "time": "2024-11-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {}, "description": {"et": "Ökoloogilise liikumise suunad ja probleemid (R. Carlson, A. Leopold). Ökoloogilised kriisid. Biotsentrism ja antropotsentrism. Looduse väärtustamistasandid (isend, liik, ökosüsteem). Süvaökoloogia (A. Naess). Loomaõiguslus. Ökoanarhism. Looduskaitse põhjendused. Ökoloogiline ja lokaalne majandus (E.F. Schumacher)."}}, {"course_week": 11, "time": "2024-11-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {}, "description": {"et": "Keskkonnaeetika lähtekohad. Semiootiline eetika ja semioeetika (S. Petrilli ja A. Ponzio). Omailm kui väärtustuse alus. Autokommunikatsioon, dialogism ja T.A. Sebeoki \"semiotic self\". Kultuuri lokaalsus ja keskkonnaseosed. Kontekstualiseeritus (G. Bateson)."}}, {"course_week": 12, "time": "2024-11-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {}, "description": {"et": "Ökokriitika ja looduskirjandus. Ökokriitika tunnused ja paiknemine kirjandusteoorias. Eesti loodusmõtte kujunemine. Looduskirjanduse määratlus, tunnused ja tüübid. Keskkonnakirjandus. Eesti looduskirjanduse kesksed autorid (J. Piiper, F. Jüssi, J. Lepasaar, J. Kaplinski, P. Ernits jt.)."}}, {"course_week": 13, "time": "2024-11-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "Loetud loodusmõtteliste tekstide refereerimine ja arutelu."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "1351846b-e2a8-aa73-c83c-1215320ee2ef", "parent_code": "FLSE.00.069", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}