{"uuid": "77803055-c9cc-39f3-8f4f-8f210d0027cd", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-25T10:49:42", "title": {"en": "Zoosemiotics: Umwelt and Animal Communication", "et": "Zoosemiootika: omailm ja loomade kommunikatsioon"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular HV Eng", "et": "25/26 K PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 26, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 118, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The topic of the course is sign communication among animals. Attention will be paid to the prerequisites, elements and types of biocommunication as well as its properties in different environments. By analysing examples from many animal groups (invertebrates, fishes, reptiles and amphibians, birds, and mammals), the role of communication and semiotic processes in the social, territorial, and sexual behaviour of animals will be discussed. Closer attention will be paid to communication between human beings and animals, as well as to the zoosemiotic features that form the basis for depicting animals in mythology, folklore, and literature.", "et": "Kursuse teemaks on loomade märgiline kommunikatsioon. Tähelepanu pööratakse biokommunikatsiooni eeldustele, elementidele ja erinevatele tüüpidele ning selle omadustele erinevates keskkondades. Analüüsides näiteid mitmetest loomarühmadest (selgrootud, kalad, roomajad ja kahepaiksed, linnud, imetajad), käsitletakse kommunikatsiooni ja semiootiliste protsesside rolli loomade sotsiaalses, territoriaalses ja sugulises käitumises. Lähemalt vaadeldakse kommunikatsiooni inimese ja loomade vahel ning zoosemiootilisi aluseid loomade"}, "objectives": [{"en": "The course gives a systematic overview of communication and sign systems in the animal world. This helps to understand the origins of human language, as well as the importance of communication and its different types beyond human culture.", "et": "Antud kursus annab süsteemse ülevaate loomariigi kommunikatsioonist ja peamistest märgisüsteemidest. Õpitu aitab mõista inimkeele allikaid, kommunikatsiooni olulisust, sh inimkultuurist väljapoole jäävaid eri tüüpe ja viise."}], "learning_outcomes": [{"en": "After completing the course the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1) knows the theoretical foundations and major authors of zoosemiotics; ", "et": "1) tunneb zoosemiootika teoreetilisi aluseid ja peamisi autoreid;"}, {"en": "2) is capable of orienting in standpoints and basic concepts of various disciplines that study animal communication; ", "et": "2) oskab orienteeruda loomade kommunikatsiooni uurivate distsipliinide seisukohtades ja põhimõistetes;"}, {"en": "3) has acquired an overview of major communication strategies and sign systems used by different animal groups; ", "et": "3) omab ülevaadet eri loomarühmade peamistest kommunikatsioonistrateegiatest ja märgisüsteemidest;"}, {"en": "4) has learned the basics of conducting zoosemiotic analysis.", "et": "4) on omandanud lähtekohad iseseisva zoosemiootilise analüüsi läbiviimiseks."}], "notes": {}}, "grading": {"independent_work": {"et": "Student should write a short independent study on some topic of the theory, history or methodology of zoosemiotics; on some general topic of animal communication; or on some specific communication problem or animal group. Sample topics with literature will be given in class although students are encouraged to suggest their own topics. The length of the research paper should be 8-10 pages (spacing 1.5; font Times New Roman 12) and it should follow general principles of academic research (e.g. using specific academic literature on chosen topic)."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Active participation in seminars - there are eight seminars altogether, five of them for reading and discussing selected texts in zoosemiotics (will be made available through the Study Information Systems of the University of Tartu), a field trip to apply the gained knowledge and the last one for discussing research papers written by students. Students are expected to come to class fully prepared to discuss the required materials. Participation in the seminars is checked and graded."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Research paper - research paper is a short independent study on some topic of the theory, history or methodology of zoosemiotics; on some general topic of animal communication; or on some specific communication problem or animal group. Sample topics with literature will be given in class although students are encouraged to suggest their own topics according to their research interests and academic background. The length of the research paper should be 8-10 pages (spacing 1.5; font Times New Roman 12) and it should follow general principles of academic research. In bibliography and formatting stylesheet of Sign Systems Studies should be followed. All sources, including internet sources, must be properly cited as plagiarism is not tolerated at the University of Tartu. Grading criteria include general quality and logic of research, soundness of key arguments, originality of the selected topic, personal input of the student, relevance and amount of used materials.\n\nDeadline for the Research paper is 29 April."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Written exam - exam is a compound test with different types of questions (discussion points, interpretation of images, choice based questions, true/false questions) that cover the basic knowledge discussed in lectures and seminars. Exam will be taken in class during one and a half hour without using auxiliary materials."}}], "grade_preconditions": {"et": "Participation in seminars, submitting research paper."}, "grade_evaluation": {"et": "Active participation in seminars: 30% of the final grade.\nResearch paper: 40% of the final grade.\nWritten exam: 30% of the final grade."}, "debt_elimination": {"et": "Possibilities to make up for missed or failed assignments will be agreed with the lecturer."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Sorabji, Richard 1983. Animal Minds & Human Morals: The Origins of the Western Debate. Cornell Studies in Classical Philology. Ch. I. The crisis: the denial of reason to animals. Ithaca, NY: Cornell University Press, pp. 7-16.\nDarwin, Charles 1873. The Expression of the Emotions in Man and Animals. Ch. II. General principles of expression, cont., London: John Murray, pp. 50-65.\nSebeok, Thomas A. 1990. Zoosemiotics: At the intersection of nature and culture. In: Thomas A. Sebeok. Essays in Zoosemiotics (Monograph Series of the TSC 5). Toronto: Toronto Semiotic Circle; Victoria College in the University of Toronto, pp. 37-47. \nSebeok, Thomas A. 1990. 'Talking' with animals: Zoosemiotics explained. In: Thomas A. Sebeok. Essays in Zoosemiotics (Monograph Series of the TSC 5). Toronto: Toronto Semiotic Circle; Victoria College in the University of Toronto, 105-113.\nWenner, Adrian 1969. The study of animal communication: An overview. In: Sebeok, Thomas A. and Ramsay, Alexandra (Eds.). Approaches to Animal Communication. The Hague: Mouton, pp. 232-243.\nHediger, Heini. 1968. The animal's expression. In: The Psychology and Behaviour of Animals in Zoos and Circuses. Trans. Geoffrey Sircom. New York: Dover Publications, pp. 141-153.\nBateson, Gregory 1999 [1972]. Problems in Cetacean and other mammalian communication. In: Gregory Bateson. Steps to an Ecology of Mind. Chicago, London: University of Chicago Press, pp. 364-378.\nKomárek, Stanislav 2009. Nature and Culture: The World of Phenomena and the World of Interpretation. Lincom Studies in the Humanities 2. Ch. Modelling. Muenchen: Lincom. pp. 108-116.\nGriffin, Donald R. 1981. The Question of Animal Awareness: Evolutionary Continuity of Mental Experience. Ch. Is man language. New York: Rockefeller University Press, pp. 73-85.\n Ingold, Tim 1988. The animal in the study of humanity? In: Ingold, Tim (Ed.). What is an Animal? (One World Archaeology 1). London, Boston: Unwin Hyman, pp. 84-99\n\nMaran, Timo; Martinelli, Dario; Turovski, Aleksei (Eds.) 2011. Readings in Zoosemiotics. (Semiotics, Communication and Cognition 8). Berlin: DeGruyter Mouton.\nSebeok, Thomas A. 1990. Essays in Zoosemiotics (= Monograph Series of the TSC 5). Toronto: Toronto Semiotic Circle; Victoria College in the University of Toronto.", "recommended_materials": "Allen, Colin; Bekoff, Marc 1997. Species of Mind. The Philosophy and Biology of Cognitive Ethology. Cambridge, MA: The MIT Press.\nHediger, Heini 1968. The Psychology and Behaviour of Animals in Zoos and Circuses. New York: Dover Publications.\nIngold, Tim (Ed.) 1988. What is an Animal? London: Unwin Hyman.\nRogers, Lesley J.; Kaplan, Gisela 1998. Songs, Roars, and Rituals. Communication in Birds, Mammals, and Other Animals. Cambridge, MA: Harvard University Press.\nMaran, Timo; Toennessen, Morten; Armstrong Oma, Kristin; Kiiroja, Laura; Magnus, Riin; Mäekivi, Nelly; Rattasepp, Silver; Thibault, Paul; Tüür, Kadri 2016. Animal Umwelten in a Changing World. Zoosemiotic Perspectives. (Tartu Semiotics Library 18). Tartu: University of Tartu Press. \nMartinelli, Dario 2007. Zoosemiotics. Proposal for a Handbook. Helsinki: Acta Semiotica Fennica 26. Imatra: International Semiotics Institute at Imatra.\nMartinelli, Dario (Ed.) 2009. Zoosemiotics. Special issue. Sign Systems Studies 37(3/4).\nSebeok, Thomas A. 1972. Perspectives in Zoosemiotics. Janua Linguarum. Series Minor 122. The Hague: Mouton de Gruyter.\nUexküll, Jakob v. 1982. The Theory of Meaning. Semiotica 42(1): 25-82."}, "participants": {"lecturers": [{"person_uuid": "515f1d29-4526-64a6-e053-e07a827fcd73", "person_name": "Siiri Tarrikas", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "023d1771-d955-fe94-59d4-c6eded488908", "person_name": "Timo Maran", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction to semiotics and zoology. Semiotic approaches to animals. Zoosemiotics as a synthesis between humanities and natural sciences. IN CLASS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Different approaches to animal communication: medieval ideas, views in ethology, socio-biology, behavioural ecology, comparative psychology and cognitive ethology. Emphasis is put on the works of Ch. Darwin, J. V. Uexküll, K. Lorenz, N. Tinbergen and D. Griffin. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Zoosemiotic paradigm. Concept of zoosemiotics. Position of zoosemiotics among other branches of semiotics (phytosemiotics, anthroposemiotics). History, representatives (T. A. Sebeok, H. Hediger, G. Tembrock, P. Marler), and main sources in zoosemiotics. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Prehistory of zoosemiotics. Selected readings by C. Osborne and Ch. Darwin. RQ: Is difference between humans and animals quantitative or qualitative? Do animals have mind? Discussion about topic from independently listened lectures. IN CLASS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Basic concepts in zoosemiotics: Appearances in animals. Semiosis in animals. Type of signs: icon, index and symbol. Categorical perception. Associations and conditioning and animal cognition. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Defining communication. Autocommunication, different types of feedback. Unidirectional and bidirectional communication. Communication in and between species. Social relations in biocommunication. Semiotic aspects of biocommunication. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Essentials in zoosemiotics. Selected readings by F.B. Skinner and Th. A. Sebeok. RQ: Can we use humanities' methodologies to study animal communication? What are strengths and weaknesses in this? Discussion about topic from independently listened lectures. IN CLASS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communication in relation to body, physiology and ecology of the animals. Body types of animals. Different sensory organs and properties of communication channels (visual, tactile, auditory, chemical). Preferences in communication channels by different animal groups. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communication of invertebrates. Biology of invertebrates as a basis for communication. Cognitive and sensory capacities of insects. Intraspecific communication in solitary and collective insects. Interspecific communication in symbiotic relations. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Chapters from animal communication studies. Selected readings by T. Rugaas, H. Hediger. RQ: How can we classify animal communication? Why to do this? Discussion about topic from independently listened lectures. IN CLASS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communication of fish, amphibians and reptiles. Biology and sensory organs of fish, amphibians and reptiles. Intra- and interspecific communication mechanisms. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communication of birds. Biology, life strategies and communication organs of birds. Song as an intraspecific communication mechanism. Communication in flocks and colonies. Interspecific communication in birds. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Theoretical and metatheoretical perspectives. Selected readings by J. Goodall, C. Wolfe. RQ: Can we avoid anthropomorphism in science? Should we? Discussion about topic from independently listened lectures. IN CLASS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communication of mammals. Biology, life strategies and communication organs of mammals. Tactile communication and social relations in mammals. Ritual communication for solving conflicts. Communication between parents and offspring. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Different approaches to the evolution of communication. Phylogenetic prerequisites of communication. Communication as evolutionary adaptation. Communication as a precursor of human language. Activity of an individual and evolutionary processes. Semiosis and communication as factors in evolution. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Humanities, animals and contemporary zoosemiotics. Selected readings by D. Griffin, and T. Scott-Phillips et al. RQ: What studies of animal communication can provide to humanities? Are we animals? Discussion about topic from independently listened lectures. IN CLASS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Deceptive resemblances in nature. Camouflage, mimesis, warning colouration and mimicry as zoosemiotic phenomena. Batesian mimicry, Müllerian mimicry and other mimicry types. Structure and semiotics of biological mimicry. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communication between humans and animals. Domestication and communicative abilities of domesticated animals. Human influence on communicative abilities of wild animals. Nonverbal communication in humans and its role in relations with animals. Language studies in apes, dolphins, parrots and other animals. PRERECORDED IN MOODLE"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Field trip to river Emajõgi, (depending on the weather) possibly in the late evening to watch bats and see how a device is used for recording their voices and identifying species. OUTDOORS"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Final seminar, short presentations and discussion on research papers. IN CLASS"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "7bef1aa5-69cc-569d-66b3-b36401b197e3", "parent_code": "FLSE.00.260", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}