{"uuid": "ec8669d1-1040-6a38-7f30-d59cbd4c215e", "code": "FLSE.00.337", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Biosemiotics", "et": "Biosemiootika ja elurikkus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "An overview will be given on research issues of contemporary biosemiotics: mechanisms of semiosis, typology of semiosis, structure of biological sign systems. Methododological issues of biosemiotics will be discussed, incl. relations between metaphysical and scientific approaches in the history of semiotics and in development of biosemiotics.", "et": "Antakse ülevaade biosemiootika tänapäevastest probleemidest: semioosi mehhanismid, semioosi tüpoloogia, bioloogiliste märgisüsteemide struktuur. Vaadeldakse ka biosemiootika metodoloogilisi küsimusi, sealhulgas metafüüsiliste ja teaduslike lähenemiste vahekorda semiootika ajaloos seoses biosemiootika kujunemisega. Süvendatud käsitlus mõnedest biosemiootika osadest. Uuemate biosemiootika alaste uurimistulemuste tundmaõppimine."}, "objectives": [{"en": "An overview will be provided on central studies and contemporary situation of biosemiotics.", "et": "Antakse ülevaade biosemiootika keskse tähtsusega uurimustest ja praegusaegsest olukorrast maailmas, samuti biosemiootika tänapäevastest probleemidest ja diskussioonidest. Tutvutakse biosemiootika rakendusvõimalustega."}], "learning_outcomes": [{"en": "Students gain a systematic overview on central discussion on biosemiotics, classical texts and contemporary directions of studies.", "et": "Omandatakse süstemaatiline ülevaade biosemiootika peamistest diskussioonidest, klassikalistest tekstidest ning praegusaegsetest uurimissuundadest. Omandatakse oskus näha biosemiootilisi aspekte oma uurimistöös ja erinevate semiootikaharude juures, samuti analüüsida biosemiootiliste ideede arengut. Täiustatakse akadeemilise esinemise ja kirjutamise oskusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}