{"uuid": "5241a2ae-643c-a26b-2397-552f878761dd", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-22T11:48:45", "title": {"en": "Design Thinking and Applied Semiotics", "et": "Disainimõtlemine ja rakendussemiootika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 A regular HV Eng", "et": "24/25 S PÕ HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 18, "practice": 0, "seminar": 8, "independent_work": 52, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "There are four seminars and nine lectures each week for the length of the semester. The course has a final project, either as individual or group participation, that is presented and due at the end of course. Once the students select which project they want to focus on, then individuals and the formed groups would be given various readings related to the project. Additionally, there are four homework assignments will help guide students through the design process of the chosen project. The students are also provided a structure for packaging their final project as a design deliverable. At the end of the course there is a short presentation of each project, which is intended to briefly explain the key aspects of the project and the main takeaways on what was learned from applied theory.", "et": "Kursuse käigus viiakse läbi üks ühisprojekt. Harjutatakse probleemi tuvastamist ja hindamist; semiootilise perspektiivi piiritlemist; asjakohase interdistsiplinaarse välja kaardistamist ja semiootiliste teadmiste ja meetodite rolli määratlemist; lahenduskäigu otsimist, planeerimist ja teostamist; meeskonnatöö planeerimist ja koordineerimist."}, "objectives": [{"en": "The course objective is to give students first-hand experience for applying semiotics to real-world projects and scenarios. The course utilizes Tartu as a creative city to tap into the potentiality of showing how semiotics can be applied to design thinking and strategic planning in the local environment. Students who want to apply do not need prior skills in semiotics or design, and students enrolled in the semiotics bachelor's and master's programs will see how this course is designed to incorporate theories branching from culture semiotics, biosemiotics and ecosemiotics. However, it should not deter any other students without a background in semiotics to attend this course, much of the mechanics of design and semiotics can be understood as a transdisciplinary approach, which is a unique experience for a wide range of students from various departments to gain insight on the application of semiotics. \n\nThe main theory used to orient the course is around the notion of semiotic components (resources, affordances, competence, and scaffolding). As the students will see, the components are practical, as an apparatus, to examine how meaning-making of an umwelt is embedded and constructed within an environment. Additionally, the semiotic components within an environment serve as a trajective compass to navigate our subjective experience through the paradoxical nature of physical reality and digital reality. Students who attend this course will get a clearer understanding on how semiotic theory relates to real-world problems and scenarios; and although the profession of a \"semiotician\" is usually framed within academia, the students will leave the course with a valuable semiotic toolkit to vividly see how various professions utilize the interwoven relations of design and semiotics.", "et": "Projektipõhise analüüsipraktika eesmärgiks on õppida kasutama semiootika teooriaid ja lähenemisi praktiliste sotsiokultuuriliste olukordade ja protsesside hindamisel, uurimisel, aktuaalsete probleemide määratlemisel, analüüsimisel ja lahenduste leidmisel."}], "learning_outcomes": [{"en": "Students will learn how design and semiotics consist of two processes: the linear, deliberate act that aims at a target and the non-linear, unexpected outcome that emerges. There is an overall emphasis in the course, as applied theory, to elaborate on the roles of subject, object, and environment as a grounding for co-development. \n\nList of outcomes\n1.Understand deliberate acts versus intentionality during a design process;\n2.Ability to use semiotic components as an apparatus towards real-world scenarios;\n3.How to package a design deliverable using semiotic components to provide to a stakeholder;\n4.Gain experience in solving practical assignments, project management and teamwork.", "et": "-erialaste teadmiste seostamisvõime eluliste situatsioonide ja ülesannetega;\n-oskus kasutada semiootika teooriaid ja meetodeid praktiliste probleemide tuvastamisel, hindamisel ja lahendamisel ning eesmärgipäraselt põimida teiste valdkondade vahenditega;\n-kogemus erinevate uurimisviiside kasutamisel andmete kogumisel, analüüsimisel ning tulemuste mõtestamisel;\n-praktilise ülesande lahendamise, projektijuhtimise ja meeskonnatöö kogemus."}], "notes": {}}, "grading": {"independent_work": {"et": "Homework 1 - Select final project and form groups, if needed. Put together a short description on what the problem is and how to provide potential solution. All project material provided in moodle.\nHomework 2 - Upload in moodle a written text that briefly describes what are the desired and non-desired interactions for the user of the final project chosen, keep in mind how the contextualization of the environment can impact the interactions. \nHomework 3 - Identify any relevant things and objects related to the final project, and list any known semiotic components that resonate with the key stakeholders for project, and upload in moodle.\nHomework 4 - List any obstacles, concerns, and unexpected outcomes so we can collectively discuss in the following seminar.\nPresentation - Present final design deliverable at the end of the course. Provide a recap on the chosen project, the relevant stakeholders, any processes regarding deliberate acts and intentionality, and list any potential design outcomes related to the project."}, "grade_preconditions": {"et": "For a positive evaluation to proceed with delivering the final project as a presentation, the student is required to attend at least 50% of all seminars and lectures that will be in-person and must submit all (4) homework assignments before the deadlines."}, "grade_evaluation": {"et": "A positive evaluation of the final result is based on two criteria: (a) the student's completion of previous attendance and homework requirements; and (b) the group's or individual's capacity to provide a coherent analysis for an identified stakeholder in the final project while constructing the design deliverable using the provided structure."}, "debt_elimination": {"et": "Specified individually"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "8cf234b2-dd88-4275-8e2d-138a9ca6e07b", "type": "MOODLE", "code": "FLSE.00.348_ENG", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Campbell, Cary; Olteanu, Alin; Kull, Kalevi 2019. Learning and knowing as semiosis: Extending the conceptual apparatus of semiotics. Sign Systems Studies 47(3/4): 352-381.\nKozicki, Alec 2023a. Affordance and Ton: The meaning-carriers of semiosis. In: Kõvamees, Erik; Miyamoto, Oscar (eds.), Concepts for Semiotics (vol. 2). University of Tartu Press, 149-165.\n- 2023b. Umwelt in an umwelt: Co-developing within immersive virtual environments and the paradoxical nature of reality and hyperreality. Sign Systems Studies 51(1): 73-100.\nSeif, Farouk 2020a. De-Sign as a destiny of negation: The paradox of sustaining boundaries while traversing. The American Journal of Semiotics 36(3/4): 179-2I5.", "recommended_materials": "Berque, Augustine 2019 An enquiry into the ontological and logical foundations of sustainability: Toward a conceptual integration of the interface 'Nature/Humanity'. Global Sustainability 13(2): 1-10. https://doi.org/10.1017/sus.2019.9\nKull, Kalevi 1998. Semiotic ecology: different natures in the semiosphere. Sign Systems Studies 26(1): 344-371.\n- 2005. Semiosphere and a dual ecology: Paradoxes of communication. Sign Systems Studies 33(1): 175-189. \nHartley, John 2015. Urban semiosis: Creative industries and the clash of systems. International Journal of Cultural Studies: 18(1) 79-101.\nSeif, Farouk 2020b. The role of pragmatism in De-sign: Persevering through paradoxes of design and semiotics. Cognitio: Revisita de Filosofia 21(1): 112-131.\n- 2022. De-sign agency as the envoy of intentionality: Trajectories toward cultural sensitivity and environmental sensibility. Biosemiotics 15: 285-307.\nSemenenko, Aleksei 2016. Homo polyglottus: Semiosphere as a model of human cognition. Sign Systems Studies 44(4): 494-510."}, "participants": {"lecturers": [{"person_uuid": "c0f99e96-6eb1-6288-1160-961221175023", "person_name": "Silver Rattasepp", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "263d9ad1-055c-6c00-6afa-7b1f571f4e7c", "person_name": "Alec Richard Kozicki", "structural_unit": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-13,15"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Course introduction;\nOverview of coursework;\nIntroduce the projects the students can choose for a final project;\nDiscussion on how to navigate yourself in the course using deliberate acts and intentionality."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Exploring the role of the user\nCommunication and metacommunicative processes;\nDistinguishing what is the rhematic versus dicent user;\nHow to frame the target users and key stakeholders for the final projects."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The environment as a designed system\nCo-development process of user and environment; \nPhysical and Digital environments as grounds for meaning-making;\nDiscuss the homework 1 assignment due before next class."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Modeling the Artifact and the desired outcome\nHow to anticipate user interactions of an artifact;\nDistinction of technology and technics;\nDiscuss the beginning steps for the chosen final project."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Umwelt and Lifeworld\nIdentifying the biological meaning-making processes of the user;\nExamining the role of ontology in design (e.g., biomechanics).\nDiscuss the homework 2 assignment due before next class."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Semiotic components as an apparatus\nLearning what the four semiotic components consist of;\nExplore how the components vary per different types of user interactions."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Distinction of Things and Objects\nThe relation of the mind and environment for the human lifeworld;\nSynthesizing the semiotic components to things and objects;\nDiscuss the homework 3 assignment due before next class."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Exploring the world of affordances and tones\nDistinguishing the objectivity of affordances and the subjectivity of tones;\nCreative exercise in class to expand the horizon of perceived affordances;\nClass discussion of potential tones related to course projects."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Degrees of Nature and Semiotic Ecology\nOverview on the four degrees of nature;\nExplaining the importance of paradoxical thinking for the nature of physical reality and hyperreality;\nIdentifying the characteristics of an immersed human lifeworld;\nDiscuss the homework 4 assignment due next class."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "A recap of Designer-Artifact-User systems\nDiscussion about the theories taught leading up to this seminar;\nIdentifying and going beyond the barriers related to the final projects."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Constructing a design deliverable\nLearning how to translate semiotic terminology into relevant information for key stakeholders;\nHow to effectively write about the deliberate acts and unexpected outcomes for the final project."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sit-in with potential clients about semiotic consulting"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Presentations of design deliverables for course projects"}}]}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 24}, "parent_uuid": "4a3323ac-bbb9-ab2c-0644-ea204ec0defb", "parent_code": "FLSE.00.348", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}