{"uuid": "6f39e122-3849-05b5-64fc-23908cbf1706", "code": "hv-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-31T11:13:23", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 30, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 S block mode HV", "et": "24/25 K SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 748, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Master's Thesis in semiotics and culture studies", "et": "Uurimuse kavandamine, teostamine, magistritöö koostamine ja kaitsmine"}, "objectives": [{"en": "The main aim of master thesis is to direct students to study a complex problem and test his / her abilities to solve this question. Master thesis develops students' creativity, practical application of theoretical knowledge and ability to choose the most efficient methodology. It also expresses the correct usage of thematic literature and skills of delimiting a theme in a larger field of study.", "et": "Magistritöö eesmärk on suunata üliõpilane tervikliku erialase probleemi uurimisele ja arendada tema oskusi ja võimeid selle lahendamiseks. Magistritöös näitab üliõpilane oma võimeid loovalt kasutada magistriõppes omandatud teadmisi praktiliste või teoreetiliste semiootika probleemide lahendamisel. Magistritöö kirjutamisel demonstreerib üliõpilane erialase kirjanduse kasutamise ja iseseisva töö oskust."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "After passing this module the students are capable of writing and compiling a master thesis and protecting their ideas and argumentation in academic discussion. Besides this module helps to assess one's own and peers' works, and develop through constructive criticism to act in an ethically conflicting situation.", "et": "Magistritöö teostamise ja kaitsmise järel üliõpilane\n-\tkavandab ja teostab uurimistööd ning esitab tulemusi korrektse erialase teadusktekstina\n-\tesitab ja kaitseb enda seisukohti ja arutluskäiku akadeemilises diskussioonis\n-\tLeiab ja püstitav semiootilisi uurimisprobleeme ning rakendab erialaseid pädevusi nende lahendamisel."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"en": " - Problem statement, objectives, and historiography;\n - Selection and application of sources and analytical methods;\n - Presentation and synthesis of results;\n - Structure, language use, and formatting;\n - Oral defense of the work: structure and delivery of the presentation, responses to the reviewer’s questions.", "et": "Hindamiskriteeriumid:\n\n- probleemipüstitus, eesmärk ja historiograafia;\n- allikate ja analüüsimeetodi valik ja rakendamine;\n- tulemuste esitus ja süntees;\n- ülesehitus, keelekasutus, vormistus;\n- töö suuline kaitsmine: töö tutvustuse ülesehitus ja esitlus, vastamine retsensendi küsimustele."}}], "grade_preconditions": {}, "grade_evaluation": {}, "grade_conditions": {"A": {"en": "The work is of a very high standard. The problem statement is innovative and well-justified, with objectives clearly defined and achievable. Historiography, theory, and methods are thoroughly and appropriately selected and applied. Results are exceptionally well-interpreted and situated within the disciplinary context. The structure is logical, language use is academic, and grammar is flawless. The defense demonstrates in-depth understanding, with well-reasoned answers to questions.", "et": "Töö on väga kõrgetasemeline. Probleemipüstitus on uudne ja põhjendatud, eesmärk selgelt piiritletud ja saavutatav. Historiograafia, teooria ja meetodid on põhjalikult ja asjakohaselt valitud ning rakendatud. Tulemused on silmapaistvalt tõlgendatud ja paigutatud eriala konteksti. Töö ülesehitus on loogiline, keelekasutus akadeemiline ja grammatiliselt korrektne. Kaitsmisel näidatakse põhjalikku teemakäsitlust ja vastatakse argumenteeritult küsimustele."}, "B": {"en": "he work is strong and well-constructed but falls short of the A level in some aspects. The problem statement and objectives are clear but could be improved in terms of novelty or justification. Historiography, theory, and methods are generally suitable, but the depth of analysis or synthesis may be somewhat superficial. The structure is logical but may have minor issues, and there may be small formatting or language errors. The defense is convincing but not consistently thorough.", "et": "Töö on tugev ja hästi koostatud, kuid jääb mõnes aspektis A tasemest nõrgemaks. Probleemipüstitus ja eesmärk on selged, kuid uudsuse või põhjenduse osas võiks olla parem. Historiograafia, teooria ja meetodid on üldiselt sobivad, kuid analüüsi või sünteesi sügavus võib jääda mõnevõrra pealiskaudseks. Töö on loogiliselt üles ehitatud, kuid võib sisaldada väiksemaid vormistus- või keelevigu. Kaitsmine on veenev, kuid mitte alati täiesti põhjalik."}, "C": {"en": "The work is adequate and meets the requirements but is of average quality. The problem statement and objectives are present but lack clarity or strong justification. Historiography, theory, and methods are partially appropriate but insufficiently supported by reasoning or analysis. The structure is logical but may lack balance. Formatting and language meet guidelines but contain more errors. The defense provides an overview but reveals gaps and inadequate topic engagement.", "et": "Töö on korralik ja nõuetele vastav, kuid selle tugevus on keskmine. Probleemipüstitus ja eesmärk on olemas, kuid nende selgus või põhjendatus on piiratud. Historiograafia, teooria ja meetodid on osaliselt sobivad, kuid põhjendused või analüüs võivad olla nõrgad. Töö ülesehitus on loogiline, kuid osad võivad olla tasakaalust väljas. Vormistus ja keelekasutus vastavad juhendile, kuid vigu on rohkem. Kaitsmisel antakse ülevaade, kuid esineb lünki ja ebapiisavat teemakäsitlust."}, "D": {"en": "The work meets minimum requirements but is of low quality. The problem statement and objectives are unclear or poorly justified. Historiography, theory, and methods are not consistently relevant or adequately selected. Analysis and results are weak, with unclear connections. The structure is poorly organized, and formatting and language contain numerous errors. The defense fails to explain the work sufficiently or answer questions competently.", "et": "Töö vastab miinimumnõuetele, kuid selle kvaliteet on madal. Probleemipüstitus ja eesmärk on ebaselged või halvasti põhjendatud. Historiograafia, teooria ja meetodid ei ole alati asjakohased või on valitud ebapiisavalt. Analüüs ja tulemused on nõrgad ning seosed ebaselged. Töö ülesehitus on ebaloogiline, vormistus ja keelekasutus sisaldavad palju vigu. Kaitsmisel ei suudeta teemat piisavalt selgitada ega küsimustele asjatundlikult vastata."}, "E": {"en": "The work is on the borderline of meeting minimum requirements. The problem statement and objectives are unclear or missing. Historiography, theory, and methods are unsuitable or irrelevant. Analysis is minimal or entirely inadequate. The structure and formatting are weak, and language use is error-prone. The defense does not present the work clearly or address questions effectively.", "et": "Töö on minimaalsete nõuete piiril. Probleemipüstitus ja eesmärk on ebaselged või puuduvad. Historiograafia, teooria ja meetodid on ebasobivad või ebaolulised. Analüüs on puudulik või täiesti ebaadekvaatne. Töö ülesehitus ja vormistus on nõrgad, keelekasutus vigaderohke. Kaitsmisel ei suudeta tööd arusaadavalt esitada ega küsimustele vastata."}, "F": {"en": "The work does not meet requirements. The problem statement, objectives, theory, methods, and results are either missing or entirely inadequate. The structure and formatting are non-existent. The defense fails to clarify the work or respond to questions.", "et": "Töö ei vasta nõuetele. Probleemipüstitus, eesmärk, teooria, meetodid ja tulemused puuduvad või on täiesti ebasobivad. Töö ülesehitus ja vormistus on olematud. Kaitsmisel ei suudeta tööd üldse selgitada ega küsimustele vastata."}}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "2774f3de-3b3c-6520-b082-35d7800324fd", "person_name": "Nelly Mäekivi", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"course_week": 35, "time": "2025-04-29", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "Magistritöö elkaitsmine"}, "description": {}}, {"course_week": 38, "time": "2025-05-20", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "Magistritöö kaitsmine"}, "description": {}}]}, "registration_info": {"audience": {}}, "parent_uuid": "5bab465b-0e81-047b-5ee2-ca8a772b0fab", "parent_code": "FLSE.00.243", "parent_credits": 30, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}