{"uuid": "7a51e16a-bc8c-dfc3-170a-b03f1abdd397", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-25T11:14:55", "title": {"en": "Communication and Power", "et": "Kommunikatsioon ja võim"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 A regular HV Eng", "et": "25/26 S PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course deals with main 20th century theoretical approaches of  power, communication, ideology and discourse, wellknown authorities (Dijk, Laclau, Schmitt, Reis etc) and links between their thoughts and ideas. Comparing concepts like: ideology,  politics, discourse,  , power, communication etc. Main idea to explore how in contemporary media age power relation are  established through communication, \"soft power\" \nIn homeworks students are required to exert learned skills for the analyses of concrete sociopolitical phenomena.", "et": "Kursusel käsitletakse 20 sajandi peamisi teoreetilisi lähenemisi võimule, kommunikatsiooile ja ideoloogia ning diskursusele (Dijk, Laclau, Schmitt etc). Peamise eesmärgina seame kaasaja meedia ja võimusuhete analüsi."}, "objectives": [{"en": "The main purpose of this course is to develop skills for analysing and comprehending contemporary sociopolitical phenomena.", "et": "Kursuse eesmärk on arendada tänapäevaste sotsio-poliitiliste fenomenide analüüsioskust."}, {"en": "Throughout the course the students will read and discuss topics like identity and ideology; political communication; discourse and ideology; concept of power ; semiotic mechanism of constructing identities etc.", "et": "Kursuse jooksul tudengid loevad ja arutavad teemade üle nagu identifikatsioon ja ideoloogia, poliitiline kommunikatsioon, diskursus ja ideoloogia, võimu kontseptsioonid ja semiootilised identiteediloome mehhanismid"}], "learning_outcomes": [{"en": "Students will be able to: \n1) identify and analyse the signifying, symbolic and ideological systems;\n2) understand the role of communication in establishing social relations;\n3) define semiotic aspects of sociopolitical research and describe relations between these;\n4) define the major paradigms, theories, and concepts in 20th century theoretical approaches of power ;\n5) apply critical reading and analytical skills to various academic and non-academic texts;\n6) express personal theoretical preferences and defend them by constructing evidence-based arguments.\n7) develop the skills of team work", "et": "Tudengid peaksid oskama:\n1) identifitseerima ja analüüsima tähistamispraktikate ning erinevate ideoloogiliste süsteemide vahekorda\n2)mõistma kommunikatsiooni rolli kaasaja identiteetidde kujunemisel\n3) määratlema semiootilise analüüsi objektina võimusuhteid\n4) määratlema 20 sajandi peamised suunad võimuküsimustele"}], "notes": {}}, "grading": {"independent_work": {"et": "In case of possible general limitations of COVID 19, all lectures and seminars will take place online. This will be announced at the time the restrictions are imposed.\n\n1) Report of a) online lectures or b) analysis of social phenomena. \na.     Report of online lectures consists: a) group of students (3-4 students in one group) needs to send to lecturer a written overview (min 1200 words) about one online lecture(s) (preliminary list of lecture is in SIS, but it is be better when students will find new online lectures from different universities webpages ) and b) makes oral presentation in the class. The work should consist of a critical overview about these online lectures. Those academic web-based lectures represent different (and sometimes contradictory) perspectives thus students have to generate pro and contra arguments and present their own opinion. Students need to: outline 3 main arguments of the lecture, relate those ideas with their own examples and/or previous knowledge and write one question/critical comment about the lecture. Other groups have to actively participate in discussion. Web-based learning is meant to supplement ideas discussed in lectures/seminars, online lectures should provoke critical analysis and synthesis of different ideas. Each group has 15 minutes for presentation and 5-10 for questions.\nb.    Analysis of socio-political phenomenon: students do homework in a group (about 3-4 people), where they analyze a social phenomenon in the light of the theories presented in the lecture. Students present a) a written summary of homework (min. 1200 words) and send it to the lecturer, and b) introduce the main arguments of the analysis in the seminar. In homework, students must justify: the choice of the phenomenon to be studied, the chosen method of analysis and the main research results. It is also necessary to demonstrate the ability to critically relate to the chosen material and to find connections between your analysis and other topics of the course.is meant to supplement ideas discussed in lectures/seminars, online lectures should provoke critical analysis and synthesis of different ideas. Each group have 15 minutes for presentation and 5-10 for questions.  \n\n2) Reading seminar's texts. Students have to differentiate the key points of the article and synthesize it with his/her previous knowledge and own opinion. Students should be able to answer questions about seminar's texts. Questions are uploaded in SIS. Students will also send to the lecturer written answers for two questions (before or after seminar). If a student can't participate in a seminar then the student will send answers for all questions about seminar text."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Report (+oral presentation) of online lecture/analysis of social phenomenon (30% of grade), for grading we take into account following points:\n*\tCritical analysis, \n*\tConnections with previous knowledge and student's own opinion \n*\tThe reflection of how student's understandings have developed during the course"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Exam (written)\n-Correct use of terms and concepts (if you use terms that were introduced during the course with some other meaning, then a corresponding explanation is needed)\n-Application of the texts read during the course (please use the relevant reading materials of the course for arguing)\n-The use of additional sources and proof of their relevance for the topic (use at least some other secondary sources that we've not discussed in the course)\n-Logical argumentation and clear connections between different ideas\n-Originality (a fuzzy criteria for sure, what is meant under that is that you'd provide the background for what has been said before about the point you're discussing and departing from that, suggest your own synthetic or new solution or view-point to the topic)\n-Scientifically correct presentation of the text (clear demarcation of your own thoughts and those of the others, a unified reference system and everything else that is proper to the scientific text)\n\nE - the argumentation of the text hard to follow, no relevant references, the text is unstructured and the presentation does not fully follow the academic standards\nD - the central concepts irrelevant or not well defined, larger gaps in binding different parts of the text together, the theoretical works not fully relevant, the text lacks originality\nC - the use of concepts not fully consistent, the line of argumentation tracable but further comments needed, problems with the integrity of the text\nB - correct use of terms, the theotretical texts used relevant for the topic, original ideas present, minor gaps in argumentation, presentation or structuring of the text\nA - theoretical texts used for the analysis relevant for the topic, the concepts used in a well-defined and understandable meaning, the argumentation clear and well-structured, the author's own synthesis original, scientifically correct presentation of the text"}}], "grade_preconditions": {"et": "Participation in seminar, homework\nStudents who cannot participate in seminars will send answers for all questions about seminar-texts. The questions and texts students will find in SIS."}, "grade_evaluation": {"et": "Final mark: Participation in seminar (10%) + homework 30 % + exam (written) 60%. Exam  include both course material and seminar texts.  In case of restrictions of COVID 19 the final  exam can be change with final essay.\nStudent can get max. 100 points; written exam gives 60 points,  analysis of online lecture or social political phenomenon gives  30 points and participation in seminars (10%). Participation on seminars and groupwork is precondition for final result of assessment. For grading, a student must have done all 3. Min. points for passing are: oral examination E,  report of online lecture or analysis of social political phenomenon  E ."}, "debt_elimination": {"et": "Previous agreement with lecturer"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Seminartexts\nCarl Schmitt \"The concept of Political\"\nMichel Foucault \"Order of Discourse\"\nEmil Benveniste \"Subjectivity in Language\" & Louis Althusser \"Ideology interpellates individuals as subjects\"\nErnesto Laclau.\" Why empty signfier matters in politics\".\nSadowski, J. (2019). When data is capital: Datafication, accumulation, and extraction. In: Big Data & Society. January-June 2019: 1-12.\nFuchs, C. (2014). The Digital Labour Theory of Value and Karl Marx in the Age of Facebook, YouTube, Twitter, and Weibo. In: Fuchs, C., Digital Labour and Karl Marx, London: Routledge, cap. 2, pp. 26-41.\n\n\n\nBooks:\nLaclau, Ernesto (2005a). On Populist Reason. London, New York: Verso, Laclau, Ernesto and Mouffe, Chantal (1985).  \n\"How to make political identities\" 1994. London: Verso. 1 chapter\nSelg, Peeter&Ventsel, Andreas 2020.Introducing Relational Political Analysis. Political Semiotics as a Theory and Method. Palgrave Macmillan (chapters)\nTerranova, T. (2004). Network Culture. Politics for the Information Age. London: Pluto Press; chapters 3, 4, 5.", "recommended_materials": "Reis, Carlos 1993. Towards a semiotics of ideology. Approaches to semiotics 109. Berlin, New York: Mouton de Gruyter. \nTeun v. Dijk. \"Ideoloogia\" 2005. Tartu Ülikooli Kirjastus\nM. Foucault \"Diskursuse kord\". 2005. Tallinn: Varrak\nE. Laclau. \"Emancipation(s)\" 1996. London: Verso\nWodak, Ruth; Meyer, Michael 2001. Methods of Critical Discourse Analysis. London. Thousand Oaks. New Delhi: SAGE Publications. \nFairclough, Norman (1989). Language and Power. London: Longman\nLaclau, Ernesto; Mouffe, Chantal (1985). Hegemony and Socialist Strategy: Towards a Radical Democratic Politics. London: Verso.\nLaclau, Ernesto (1993). Discourse. In. A companion to contemporary political philosophy, (ed.) R. E. Goodin and P. Pettit, Oxford: Blackwell, 431-437\nFoucault, Michel (1969). L'archelogie de savoir. Paris: Gallimard.\nFoucault, Michel (1984). Histoire de la sexualité, vol. III. Le souci de soi. Paris: Gallimard.\nHabermas, Jürgen (1989 [1962]), The Structural Transformation of the Public Sphere: An Inquiry into a Category of Bourgeois Society. MIT Press\nHeiskala, Risto (1997). Society as Semiosis. Neostructuralist theory of culture and society. Department of Sociology. Univerity of Helsinki.\nHowarth, David and Stavrakakis, Yannis (eds.) (2000a). Discourse theory and political analysis: identities, hegemonies and social change. New York: Manchester University Press\n.Leeuwen, Theo van (2008). Discourse and Practice. New tools for Critical Discourse Analysis. Oxford: University Press, Žižek, Slavoj (1989). The Sublime Object of Ideology. London: Verso\nTilly, Charles (2007). Democracy. Cambridge University Press.\nLukács, G. (1978). The Ontology of Social Being. Vol. II Marx. London: Merlin London Press; chapter 2 (pp. 25-68).\nMarx, K. (1867). Capital. A Critique of Political Economy. Volume One. London: Penguin.\nRossi-Landi, F. (1983). Language as Work and Trade. A Semiotic Homology for Linguistic & Economics. London: Bergin & Garvey Publishers (1983)"}, "participants": {"lecturers": [{"person_uuid": "3b114103-d1b3-57e5-5f55-8dea0e13a6d4", "person_name": "Andreas Ventsel", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "a669ef99-a346-2f92-6052-23ab63549dcb", "person_name": "Daniel Tamm", "structural_unit": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-11,13-16"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction. Problemsituation"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Politics and political"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "1. seminar. Carl Schmitt. \"The Concept of Political\""}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Power: 3 dimensions of power (Dahl, Baratz&Bachrach, Lukes) and Foucault"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "2.seminar Michel Foucault \"The order of discourse\""}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ideology, communication and power relations"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "3. seminar. Benveniste and Althusser"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Hegemony, identity and ideology"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "4. seminar. Ernesto Laclau. Why empty signfier matters in politics"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Political Semiotics"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Analysing power in discourse: Critical discourse studies"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "5. seminar\nHeidi E. Huntington (2016) Pepper Spray Cop and the American Dream: Using Synecdoche and Metaphor to Unlock Internet Memes' Visual Political Rhetoric, Communication Studies, 67:1, 77-93, DOI: 10.1080/10510974.2015.1087414"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Homework (report on online lecture  or analysis of social-political phenomenon"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Homework (report on online lecture  or analysis of social-political phenomenon"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Exam"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "39428322-3aa5-e310-1250-b08e3e89626d", "parent_code": "FLSE.00.276", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}