{"uuid": "a6665aa4-fc67-9887-b7af-0b767456821e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-25T10:46:51", "title": {"en": "Semiotics of Translation", "et": "Tõlkesemiootika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 A regular HV Eng", "et": "25/26 S PÕ HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 26, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Translation from the viewpoint of semiotics, relations of translation with other meaning-generating processes, analysis of different types of translation phenomena.", "et": "Tõlkimine semiootika vaatepunktist, tõlkimise seosed muude tähendusloomeprotsessidega, eri tüüpi tõlkenähtuste analüüsimine."}, "objectives": [{"en": "To give an overview of the main ways and representatives of semiotic approaches to translation; to introduce theoretical concepts that can be applied for analysing different types of translation.", "et": "Anda ülevaade tõlkimise mõtestamise olulisematest semiootikaga seostuvatest viisidest ja esindajatest; tutvustada teoreetilisi kontseptsioone ja mõisteid rakendamiseks eri tüüpi tõlgete analüüsimisel."}], "learning_outcomes": [{"en": "The student who has passed the course ", "et": "Õppeaine läbinud tudeng "}, {"en": "1) is able to interpret translation from the viewpoint of semiotics as one of the main meaning-generating processes and can relate it to other meaning-generating processes such as semiosis, (meta-, auto-) communication, interpretation, different textual transformations;", "et": "1) oskab mõtestada tõlkimist semiootika vaatepunktist kui üht peamist tähendusloome protsessi ning oskab seda suhestada teiste tähendusloome protsessidega nagu semioos, (meta-, auto-)kommunikatsioon, interpretatsioon, erinevad tekstitransformatsioonid;"}, {"en": "2) knows the main authors, terms and concepts relevant for the relations between semiotics and translation;", "et": "2) tunneb tõlke ja semiootika seoste seisukohalt olulisemaid autoreid, mõisteid ja kontseptsioone;"}, {"en": "3) is able to analyse translational phenomena, applying terms and concepts acquired and working independently with theoretical literature.", "et": "3) oskab analüüsida tõlkenähtusi, rakendades seejuures omandatud mõisteid ja kontseptsioone ning töötades iseseisvalt teoreetilise kirjandusega."}], "notes": {"et": "Kursus kombineerib loengute ja seminaride formaati, oodatud on tudengite aktiivne osalemine."}}, "grading": {"independent_work": {"et": ".\nTo pass the course the student is expected to\n*\tRead and respond to the texts required in the course;\n*\tIndependent creative translation of a chosen text;\n*\tFeedback to your peers' translation;\n*\tPass the final exam.\n\nMore specific guidelines for independent work will be given during the course.\n."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Providing responses for the obligatory texts readings in Moodle. Up to 25 points for the responses given to all obligatory texts (2 points for each text, 1 bonus point if all texts have been responded to).\n."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Translation of a chosen text - can provide up to 20 points.\n\nTranslation will be assessed according to the following criteria:\n- showing evidence of relevant use of acquired concepts and approaches to translation (10 points);\n- explaining the reasons for the choice of the text and strategy of translation (10 points).\n."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Feedback to your peers' translations - up to 5 points.\n\nFeedback will be assessed according to the following criteria:\n- ability to pinpoint (ir)relevant conceptual means used in translation; \n- pointing out both the strengths and weaknesses of translation and its presentation.\n."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Combined final exam: oral discussion based on the written analysis of a case of translation - can provide up to 50 points (up to 25 points for the written analysis and up to 25 for the oral discussion).\n\nAssessment criteria for the analysis and discussion: \n- demonstration of the ability to choose and apply relevant concepts and conceptual frameworks acquired during the course in the analysis of translation; \n- clear and logical presentation of the analysis both in written and oral form; \n- ability to engage in the discussion about issues discussed during the course as related to one's own analysis."}}], "grade_preconditions": {"et": ".\nIn order to be eligible for passing the course, all of the independent tasks listed above need to be done. In other words, failing to complete any of the independent tasks means failing the course.\nAssignments need to be completed on time (due dates will be specified at the beginning of the semester) (in case of lasting illness or other compelling reasons extension of deadline is negotiable; please contact elin.sytiste@ut.ee)."}, "grade_evaluation": {"et": ".\nThe final grade will be composed of the following components:\n*\tReading and responding to obligatory texts can provide up to 25 points;\n*\tProducing a translation of a chosen text can provide up to 20 points;\n*\tGiving feedback to your peers' translation can provide up to 5 points;\n*\tPassing the final combined (written + oral) exam can provide up to 50 points.\n\nIt is possible to receive bonus points for a remarkably good completion of some task.\n\nThe final grade for the course will be acquired by converting the result received on the 100-point scale into alphabetical grade (91-100 points: A, 81-90 points: B, 71-80 points: C, 61-70 points: D, 51-60 points: E, less than 51 points: F)\n."}, "debt_elimination": {"et": "Assignments need to be completed on time (due dates will be specified at the beginning of the semester). Late assignments  will be graded down one point per day. Extension of deadlines is possible in case of compelling reasons (illness etc.), of which please let me know as soon as possible (elin.sytiste@ut.ee).\n."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": ".\n*\tBachmann-Medick, Doris 2009. Introduction. The translational turn. Translation Studies 2(1): 2-16.\n*\tGottlieb, Henrik 2008. Multidimensional translation. In: Schjoldager, Anne; Gottlieb, Henrik; Klitgård, Ida. Understanding Translation. Aarhus: Academica, 39-65.\n*\tHolmes, James S. 1988[1972]. Rebuilding the bridge at Bommel: Notes on the limits of translatability. In: Translated! Papers on Literary Translation and Translation Studies. Amsterdam: Rodopi, 45-52.\n*\tJakobson, Roman 1966[1959]. On linguistic aspects of translation. In: Brower, Reuben A. (ed.), On Translation. New York: Oxford University Press, 232-239.\n*\tLotman, Juri 2000[1990]. Three functions of the text. In: Universe of the Mind. A Semiotic Theory of Culture. (Shukman, Ann, trans.) Bloomington: Indiana University Press, 11-19.\n*\tMonticelli, Daniele 2017. From modelling to untranslatability: Translation and the semiotic relation in Y. Lotman's work (1965-1992). In: Acta Slavica Estonica IX. Translation Strategies and State Control. (Pild, Lea, ed.) Tartu: University of Tartu Press, 16-35.\n*  Ojamaa, Maarja; Torop, Peeter 2015. Transmediality of cultural autocommunication. International Journal of Cultural Studies 18(1): 61-78.\n*\tPérez-González, Luis 2014. Multimodality in translation and interpreting studies: Theoretical and methodological perspectives. In: Bermann, Sandra; Porter, Catherine (eds.), A Companion to Translation Studies. John Wiley & Sons, 119-131.\n*\tTorop, Peeter 2000. Intersemiosis and intersemiotic translation. S: European Journal for Semiotic Studies. Vol. 12, No. 1: 71-100.\n*\tTrivedi, Harish 2005. Translating culture vs. Cultural translation. 91st Meridian 4(1): 1-8.\n*\tVan Gorp, Henrik 2004. Translation and comparable transfer operations. In: Kittel, Harald a.o. (eds.), Übersetzung: Ein internationals Handbuch zur Übersetzungsforschung. 1. Teilband. Berlin, New York: Walter de Gruyter, 62-68.\n*\tVieira, Else Ribeiro Pires 1999. Liberating Calibans. Readings of Antropofagia and Haroldo de Campos' poetics of transcreation. In: Bassnett, Susan; Trivedi, Harish, eds., Post-colonial Translation: Theory and Practice. London, New York: Routledge, 95-113. \n*\tYoung, Robert J.C. 2014. Philosophy in translation. In: Bermann, Sandra; Porter, Catherine (eds.), A Companion to Translation Studies. John Wiley & Sons, 41-53.\n.", "recommended_materials": ".\n*\tBenjamin, Walter 1997[1923]. The translator's task. (Rendall, Steven, trans.) TTR: traduction, términologie, rédaction 10(2): 151-165.\n*\tCattrysse, Peter 2001. Multimedia & translation: methodological considerations. In: Gambier, Yves; Gottlieb, Henrik (eds.), (Multi)Media Translation: Concepts, Practices, and Research. Amsterdam, Philadelphia: John Benjamins Publishing Company, 1-12.\n*\tDelabastita, Dirk 1993. \"There's a double tongue\". An Investigation into the Translation of Shakespeare's Wordplay, with Special Reference to Hamlet. Amsterdam, Atlanta: Rodopi, 1-54.\n*\tDerrida, Jacques 1984. Two words for Joyce. In: Attridge, Derek; Ferrer, Daniel (eds.), Post-Structuralist Joyce. Cambridge: University of Cambridge Press, 145-160.\n*       Fast, Karin; Örnebring, Henrik 2017. Transmedia world-building: The Shadow (1931-present) and Transformers (1984-present). International Journal of Cultural Studies 20(6): 636-652.\n*\tFlotow, Luise von 1991. Feminist translation: Contexts, practices and theories. TTR: traduction, términologie, rédaction 4(2): 69-84.\n*\tJakobson, Roman 1981. The Dominant. - Selected Writings, Vol. III. Poetry of Grammar and Grammar of Poetry. The Hague: Mouton, 751-756.\n*       Kull, Kalevi; Torop, Peeter 2003. Biotranslation: Translation between Umwelten. In: Petrilli, Susan (ed.), Translation Translation. Amsterdam, New York: Rodopi, 315-328.\n*\tLefevere, André 1992. Translation: The categories. In: Translation, Rewriting, and the Manipulation of Literary Fame. London, New York: Routledge, 41-58.\n*\tLotman, Juri 2000[1990]. Universe of the Mind. A Semiotic Theory of Culture. (Shukman, Ann, trans.) Chapters 8-10. Bloomington: Indiana University Press, 123-150.\n*\tMarais, Kobus; Kull, Kalevi 2016. Biosemiotics and translation studies. In: Gambier, Yves; van Doorslaer, Luc (eds.), Border Crossings. Translation Studies and Other Disciplines. Amsterdam, Atlanta: John Benjamins, 169-188.\n*\tReiss, Katharina 2000[1971]. Type, kind and individuality of text: Decision making in translation. (Kitron, Susan, trans.) In: Venuti, Lawrence (ed.), The Translation Studies Reader. London, New York: Routledge, 160-171.\n*       Saldre, Maarja; Torop, Peeter 2012. Transmedia space. In: Ibrus, Indrek; Scolari, Carlos A. (eds.), Crossmedia Innovations. Frankfurt am Main: Peter Lang, 25-44.\n*\tVermeer, Hans 2000[1989]. Skopos and commission in translational action. (Chesterman, Andrew, trans.) In: Venuti, Lawrence (ed.), The Translation Studies Reader. London, New York: Routledge, 221-232.\n."}, "participants": {"lecturers": [{"person_uuid": "3716341a-60ef-70a8-c9ca-05fa43d2f4f8", "person_name": "Elin Sütiste", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-15"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Overview of the course"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: biotranslation, Umwelt\n\nTexts to be discussed:\n*      Marais, Kobus; Kull, Kalevi 2016. Biosemiotics and translation studies. In: Gambier, Yves; van Doorslaer, Luc (eds.), Border Crossings. Translation Studies and Other Disciplines. Amsterdam, Atlanta: John Benjamins, 169-188.\n*      Kull, Kalevi; Torop, Peeter 2003. Biotranslation: Translation between Umwelten. In: Petrilli, Susan (ed.), Translation Translation. Amsterdam, New York: Rodopi, 315-328."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: source, target; text types, translation types; dominant; purpose; context\n\n\nTexts to be discussed:\n*    Jakobson, Roman 1966[1959]. On linguistic aspects of translation. In: Brower, Reuben A. (ed.), On Translation. New York: Oxford University Press, 232-239.\n*    Lotman, Juri 2000[1990]. Three functions of the text. In: Universe of the Mind. A Semiotic Theory of Culture. (Shukman, Ann, trans.) Bloomington: Indiana University Press, 11-19.\n\nOptional reading:\n*    Jakobson, Roman 1981. The Dominant. - Selected Writings, Vol. III. Poetry of Grammar and Grammar of Poetry. The Hague: Mouton, 751-756.\n*    Reiss, Katharina 2000[1971]. Type, kind and individuality of text: Decision making in translation. (Kitron, Susan, trans.) In: Venuti, Lawrence (ed.), The Translation Studies Reader. London, New York: Routledge, 160-171.\n*    Vermeer, Hans 2000[1989]. Skopos and commission in translational action. (Chesterman, Andrew, trans.) In: Venuti, Lawrence (ed.), The Translation Studies Reader. London, New York: Routledge, 221-232.\n."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: transfer operations (substitution, addition, deletion, repetition, permutation); layers and codes in a text\n\n\nText to be discussed:\n*    Van Gorp, Henrik 2004. Translation and comparable transfer operations. In: Kittel, Harald a.o. (eds.), Übersetzung: Ein internationals Handbuch zur Übersetzungsforschung. 1. Teilband. Berlin, New York: Walter de Gruyter, 62-68.\n\nOptional reading:\n*    Delabastita, Dirk 1993. \"There's a double tongue\". An Investigation into the Translation of Shakespeare's Wordplay, with Special Reference to Hamlet. Amsterdam, Atlanta: Rodopi, 1-54."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: modernizing, historicizing, neutralizing, exocitizing; homologous vs analogous translation\n\n\nText to be discussed:\n*    Holmes, James S. 1988[1972]. Rebuilding the bridge at Bommel: Notes on the limits of translatability. In: Translated! Papers on Literary Translation and Translation Studies. Amsterdam: Rodopi, 45-52.\n\nOptional reading:\n*    Lefevere, André 1992. Translation, Rewriting, and the Manipulation of Literary Fame. Chapt. 1, 4. London, New York: Routledge, 1-10, 41-58."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Translation in culture and taxonomy of translation types\n\nKey notions: total translation; textual, metatextual, in- and intertextual, extratextual translation; recoding, transposing; analytic, synthetic; dominant, autonomous translation\n\nText to be discussed:\n*    Torop, Peeter 2000. Intersemiosis and intersemiotic translation. S: European Journal for Semiotic Studies. Vol. 12, No. 1: 71-100.\n\nOptional reading:\n*    Osimo, Bruno 2012. Peeter Torop for Italian science of translation. In: Sütiste, Elin; Loogus, Terje; Saldre, Maarja (eds.), Semiotics of Translation and Cultural Mediation. Special Issue of Sign Systems Studies 40(3/4): 557-572.\n*    Sütiste, Elin; Torop, Peeter 2007. Processual boundaries of translation: Semiotics and translation studies. Semiotica 163(1/4): 187-207.\n\n*     Sütiste, Elin 2012. Preface: On the paths of translation semiotics with Peeter Torop. In: Sütiste, Elin; Loogus, Terje; Saldre, Maarja (eds.), Semiotics of Translation and Cultural Mediation. Special Issue of Sign Systems Studies 40(3/4): 269-278.\n."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: modelling, polyglotism, translation, dialogue, border, semiosphere, self-description, the (un)translatable\n\nText to be discussed:\n* Monticelli, Daniele 2017. From modelling to untranslatability: Translation and the semiotic relation in Y. Lotman's work (1965-1992). In: Acta Slavica Estonica IX. Translation Strategies and State Control. (Pild, Lea, ed.) Tartu: University of Tartu Press, 16-35.\n\nOptional reading:\n* Lotman, Juri 2000[1990]. Universe of the Mind. A Semiotic Theory of Culture. (Shukman, Ann, trans.) Chapters 8-10. Bloomington: Indiana University Press, 123-150."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "INDEPENDENT OUT-OF-CLASS WORK \nChoose a text and translate it in any preferred manner (to be presented in next class). Make use of concepts learned so far. Post your translation in Moodle on the day before the next class at the latest.\n\nTexts to read (and, along with other texts read so far, use in your work):\n*    Gottlieb, Henrik 2008. Multidimensional translation. In: Schjoldager, Anne; Gottlieb, Henrik; Klitgård, Ida. Understanding Translation. Aarhus: Academica, 39-65.\n*    Pérez-González, Luis 2014. Multimodality in translation and interpreting studies: Theoretical and methodological perspectives. In: Bermann, Sandra; Porter, Catherine (eds.), A Companion to Translation Studies. John Wiley & Sons, 119-131.\n\nOptional reading:\n*    Cattrysse, Peter 2001. Multimedia & translation: methodological considerations. In: Gambier, Yves; Gottlieb, Henrik (eds.), (Multi)Media Translation: Concepts, Practices, and Research. Amsterdam, Philadelphia: John Benjamins Publishing Company, 1-12."}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Student presentations of translations and their ad hoc analysis in class.\nIn addition to making a translation of your own and presenting it in class of 29 October, each group will give feedback to their peers' translations."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The question of (un)translatability. Parametres of translatability.\n\nText to be discussed:\n* Young, Robert J.C. 2014. Philosophy in translation. In: Bermann, Sandra; Porter, Catherine (eds.), A Companion to Translation Studies. John Wiley & Sons, 41-53.\n\nOptional reading:\n* Benjamin, Walter 1997[1923]. The translator's task. (Rendall, Steven, trans.) TTR: traduction, términologie, rédaction 10(2): 151-165.\n* Derrida, Jacques 1984. Two words for Joyce. In: Attridge, Derek; Ferrer, Daniel (eds.), Post-Structuralist Joyce. Cambridge: University of Cambridge Press, 145-160."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: cultural translation, communication and autocommunication; transmediality; narration; truthfulness\n\nText to be discussed:\n\n*\tElleström, Lars 2020. Representing the Anthropocene: Transmediation of Narratives and Truthfulness from Science to Feature Films. Ekphrasis 2. DOI: 10.24193/ekphrasis.24.3.\n\nOptional reading:\n\n*\tTrivedi, Harish 2005. Translating culture vs. Cultural translation. 91st Meridian 4(1): 1-8.\n\n*\tFlotow, Luise von 1991. Feminist translation: Contexts, practices and theories. TTR: traduction, términologie, rédaction 4(2): 69-84.\n\n*\tVieira, Else Ribeiro Pires 1999. Liberating Calibans. Readings of Antropofagia and Haroldo de Campos' poetics of transcreation, pp. 95-113. \n\n*       Bachmann-Medick, Doris 2009. Introduction. The translational turn. Translation Studies 2(1): 2-16."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Key notions: cultural translation, communication and autocommunication; the self and the other\n\nText to be discussed:\n* Flotow, Luise von 2019. On the Challenges of Transnational Feminist Translation Studies. TTR, 30 (1-2), 173-194. https://doi.org/10.202/1060023ar"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Text to be discussed:\n* Ojamaa, Maarja; Torop, Peeter 2015. Transmediality of cultural autocommunication. International Journal of Cultural Studies 18(1): 61-78.\n\nOptional reading:\n* Fast, Karin; Örnebring, Henrik 2017. Transmedia world-building: The Shadow (1931-present) and Transformers (1984-present). International Journal of Cultural Studies 20(6): 636-652.\n* Saldre, Maarja; Torop, Peeter 2012. Transmedia space. In: Ibrus, Indrek; Scolari, Carlos A. (eds.), Crossmedia Innovations. Frankfurt am Main: Peter Lang, 25-44"}}]}, "registration_info": {"audience": {}, "min_students": 3, "max_students": 40}, "parent_uuid": "25c92913-f104-6c43-4de4-5e25fab8b59c", "parent_code": "FLSE.00.274", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}