{"uuid": "4dc43c02-9768-a8a5-9d52-542c51ecc908", "code": "hv-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-28T21:45:19", "title": {"en": "Master's Project", "et": "Magistriprojekt"}, "credits": 15, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "HVFI04", "structural_unit_name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 32, "independent_work": 358, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The Master's Project (15EAP) is a creative applied research. It focuses on a practical researchtopic, partly using academic, partly other forms of expression. In addition to the Master's project, the student, in cooperation with the supervisor, selects courses in the amount of 15 ECTS, which give additional competencies for carrying out a specific project.", "et": "Magistriprojekt (15EAP) on loovrakenduslik uurimus. Selles keskendutakse rakenduslikule küsimusele, kasutades osalt akadeemilist, osalt mõnda muud väljendusviisi. Magistriprojektile lisaks valib üliõpilane koostöös juhendajaga 15 EAP mahus aineid, mis annavad lisapädevusi konkreetse projekti teostamiseks."}, "objectives": [{"en": "The aim of the master's project is to direct the student to use their knowledge and skills to analyze and solve a problem of a practical nature. Upon preparation of a master's project, the student will demonstrate the use of professional knowledge and skills of independent and teamwork and the presentation of results by academic writing or alternative means of expression. The master's project includes courses supporting it, the aim of which is to give the student additional competencies for professional career paths.", "et": "Magistriprojekti eesmärk on suunata üliõpilane kasutama oma teadmisi ja oskusi praktilist laadi probleemi analüüsiks ja lahendamiseks. Magistriprojekti koostamisel demonstreerib üliõpilane erialaste teadmiste kasutamise ning iseseisva ja meeskonnatöö oskust ning tulemuste esitamist akadeemilise kirjutamise või alternatiivsete väljendusvahendite abil. Magistriprojekti juurde kuuluvad seda toetavad ained, mille eesmärk on anda üliõpilasele lisapädevusi erialaseks karjääriteeks."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "1) finds a specific practical output or application for professional knowledge;\n2) finds and uses the specialised literature necessary for the investigation and resolution of a specific problem;\n3) applies disciplinary methods suitable for researching the problem and providing a solution;\n4) writes a clearly structured and coherent academic text.", "et": "Magistriprojekti teostanud üliõpilane:\n1)\tleiab erialastele teadmistele konkreetse praktilise väljundi või rakenduse;\n2)\tleiab ja kasutab konkreetse probleemi uurimiseks ja lahendamiseks vajalikku erialast kirjandust;\n3)\trakendab probleemi uurimiseks ja lahenduse pakkumiseks sobivaid erialaseid meetodeid;\n4)\tkirjutab selgelt struktureeritud ja sidusat akadeemilist teksti."}], "notes": {}}, "grading": {"independent_work": {"en": "Instructions for completing the master's project can be obtained from the supervisor, the master's seminar and from the master's project Guidelines (for submission and instructions see: https://moodle.ut.ee/course/view.php?id=5706)", "et": "Juhiseid magistriprojekti tegemiseks saab juhendajalt ja magistriseminarist ning magistriprojekti juhisest (vt juhist ja tööde esitamist: https://moodle.ut.ee/course/view.php?id=5706)"}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"en": "The assessment of the master's project is differentiated (A, B, C, D, E, F). An applied master's project shall be assessed on the basis of the following criteria:\n- the definition of the problem to be investigated and solved in the project; the relationship between the problem, its practical solution and its theoretical-methodological justification;\n- the coherence of the form and presentation of the project with the objective;\n- the use of suitable methods for researching the subject and finding applied solutions; critical evaluation of their use and appropriateness (which worked, what did not work and why);\n- the use of academic sources to analyse the problem in the theoretical-methodological part of the project;\n- reflection on the work process and its results as a whole;\n- correct and relevant implementation of the applied part of the project, correctness of the theoretical part;\n- oral defence of the project: structure and presentation, answering the questions of the reviewer.", "et": "Magistriprojekti hindamine toimub kaitsmisel ning on eristav (A, B, C, D, E, F, mi). Rakenduslikku magistriprojekti hinnatakse järgmiste kriteeriumide alusel:\n- projektis uuritava ja lahendatava probleemi sõnastus ning probleemi, selle praktilise lahenduse ja teoreetilis-metodoloogilise põhjenduse seostatus; \n- projekti vormi ja esitusviisi vastavus eesmärgile; \n- sobivate erialaste meetodite kasutamine teema uurimiseks ja rakenduslike lahenduste leidmine ning nende kasutamise ja kohasuse kriitiline hindamine (mis töötas, mis mitte ja miks);\n- erialase kirjanduse kasutamine probleemi analüüsimiseks töö teoreetilis-metodoloogilises osas; \n- reflekteerimine tööprotsessi ning selle tulemuste üle tervikuna;\n- projekti praktilise osa korrektne ja valitud esitusviisile vastav teostus ja vormistatus, teoreetilise osa korrektsus;\n- projekti suuline kaitsmine: tutvustuse ülesehitus ja esitlus, vastamine retsensendi küsimustele."}}], "grade_preconditions": {"en": "Passing the pre-defence and the written consent of the supervisor (of all supervisors if more than one) which includes the fulfilment of the conditions set in the pre-defence.", "et": "Eelkaitsmise läbimine ja juhendaja (mitme juhendaja korral kõigi) kirjalik nõusolek, mis hõlmab eelkaitsmisel seatud tingimuste täitmist. "}, "grade_evaluation": {}, "grade_conditions": {"A": {"en": "The work is of a high standard and comprehensive. The problem statement is clearly formulated, innovative, and thoroughly justified. The practical and theoretical parts are excellently integrated. The methods, literature, and analysis are well thought-out and relevant. The work is well-structured, accurately formatted, and uses academic language. The reflection is meaningful and situates the results within a broader context. During the defense, the author demonstrates deep understanding and provides well-reasoned answers to questions.", "et": "Töö on kõrgetasemeline ja terviklik. Probleemipüstitus on selgelt sõnastatud, uuenduslik ja põhjalikult põhjendatud. Praktiline ja teoreetiline osa on suurepäraselt seotud. Meetodid, kirjandus ja analüüs on läbimõeldud ja asjakohased. Töö on korrektselt vormistatud, ülesehitus loogiline ning keelekasutus akadeemiline. Refleksioon on sisukas ja paigutab tulemused laiemasse konteksti. Kaitsmisel näitab autor põhjalikku teemakäsitlust ja vastab argumenteeritult küsimustele."}, "B": {"en": "he work is strong and well-prepared but falls slightly short of an A in certain aspects. The problem statement and objectives are clear but could be improved in terms of novelty or justification. The practical and theoretical parts are well connected but lack some depth. The use of methods and literature is appropriate, but the analysis and reflection could be more thorough. The formatting is correct, and the defense is well-conducted, though minor shortcomings are present.", "et": "Töö on tugev ja hästi koostatud, kuid jääb mõnes aspektis A tasemest nõrgemaks. Probleemipüstitus ja eesmärk on selged, kuid uudsuse või põhjenduse osas võiks olla parandusi. Praktiline ja teoreetiline osa on hästi seotud, kuid mõningane sügavus puudub. Meetodite ja kirjanduse kasutamine on asjakohane, kuid analüüs ja refleksioon võiksid olla põhjalikumad. Vormistus on korrektne ja kaitsmine hästi läbiviidud, kuigi esineb väiksemaid puudujääke."}, "C": {"en": "The work is satisfactory but has noticeable deficiencies. The problem statement and objectives are generally understandable but too broad or insufficiently defined. The connection between the practical and theoretical parts is present but uneven. The use of methods and literature is adequate but superficial. The reflection is shallow, with simplified conclusions and analysis. The formatting is average, with some errors. The defense is acceptable but includes imprecise or superficial answers.", "et": "Töö on rahuldav, kuid esineb märgatavaid puudusi. Probleemipüstitus ja eesmärk on üldiselt arusaadavad, kuid liiga üldised või piiritlemata. Praktilise ja teoreetilise osa seotus on olemas, kuid ebaühtlane. Meetodite ja kirjanduse kasutamine on sobiv, kuid pealiskaudne. Refleksioon on pinnapealne, järeldused ja analüüs on lihtsustatud. Vormistus on keskpärane, esineb vigu. Kaitsmine on rahuldav, kuid vastused on osaliselt ebatäpsed või pinnapealsed."}, "D": {"en": "The work is weak and inconsistent. The problem statement and objectives are vague or difficult to understand. The connection between the practical and theoretical parts is weak or almost nonexistent. The selection and application of methods and literature are inadequate. Reflection and analysis are superficial or missing. The formatting and language use are poor, with numerous errors. The defense is poorly structured, with insufficient answers and inadequate handling of the topic.", "et": "Töö on nõrk ja ebaühtlane. Probleemipüstitus ja eesmärk on ebamäärased või raskesti mõistetavad. Praktilise ja teoreetilise osa seos on nõrk või peaaegu olematu. Meetodid ja kirjandus on valitud ebapiisavalt ning nende kasutamine on ebaadekvaatne. Refleksioon ja analüüs on pealiskaudsed või puuduvad. Vormistus ja keelekasutus on nõrgad, esineb palju vigu. Kaitsmine on halvasti struktureeritud, vastused on ebapiisavad ja teemakäsitlus puudulik."}, "E": {"en": "The work meets only the minimum requirements. The problem statement and objectives are unclear or unjustified. The practical and theoretical parts do not support each other. The methods and literature are inappropriate, with minimal analysis and reflection. The formatting and language use are very weak. The defense fails to provide substantive answers, and the presentation is unsuccessful.\nMinimum requirements:\n• the objective is formulated and the work corresponds to it; practical solution and reasoning are related;\n• the form and presentation of the project are suitable for the purpose\n• disciplinary methods have been used;\n• disciplinary literature has been used;\n• the work process and results have been reflected;\n• the implementation of the practical part of the project corresponds to the chosen from of presentation, the practical and theoretical parts are formatted mostly correctly;\n• the author introduces the work and answers the reviewer's questions.", "et": "Töö vastab vaid miinimumnõuetele. Probleemipüstitus ja eesmärk on raskesti mõistetavad või põhjendamata. Praktiline ja teoreetiline osa ei toeta üksteist. Meetodid ja kirjandus on ebasobivad, analüüs ja refleksioon on peaaegu olematud. Vormistus ja keelekasutus on väga nõrgad. Kaitsmisel ei suudeta küsimustele sisukalt vastata, esitlus on ebaõnnestunud.\nMinimaalsed nõuded: \n•\ton sõnastatud eesmärk ja töö vastab sellele; praktiline lahendus ja põhjendus on seotud; \n•\tprojekti vorm ja esitusviis sobivad eesmärgiga\n•\ton kasutatud erialaseid meetodeid;\n•\ton kasutatud erialast kirjandust;\n•\ttööprotsessi ja tulemusi on reflekteeritud;\n•\tprojekti praktilise osa teostus vastab valitud esitusviisile, praktiline ja ja teoreetiline osa on teostatult valdavalt korrektselt;\n•\tautor tutvustab tööd ja vastab retsensendi küsimustele.\n"}, "F": {"en": "The work does not meet the requirements. The problem statement and objectives are absent or entirely flawed. The practical and theoretical parts are unconnected or missing. Methods and literature are either unused or completely inappropriate. The formatting and language use are wholly unsuitable. The defense is either absent or entirely unsuccessful.", "et": "Töö ei vasta nõuetele. Probleemipüstitus ja eesmärgid puuduvad või on täiesti ekslikud. Praktiline ja teoreetiline osa on omavahel sidumata või puuduvad. Meetodid ja kirjandus ei ole kasutatud või on täiesti ekslikud. Vormistus ja keelekasutus on täielikult sobimatud. Kaitsmine puudub või on täiesti ekslik."}}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "2774f3de-3b3c-6520-b082-35d7800324fd", "person_name": "Nelly Mäekivi", "structural_unit": {"code": "HVFI04", "name": {"en": "Department of Semiotics", "et": "semiootika osakond"}, "phone": "+372 737 5933", "webpage_url": "https://flfi.ut.ee/et/semiootika-osakond", "address": "Jakobi 2, III korrus, ruumid 302-314, 317-318\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 302-314, 317-318", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-21"}, "entries": [{"course_week": 35, "time": "2025-04-29", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "eelkaitsmine"}, "description": {}}, {"course_week": 38, "time": "2025-05-20", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "kaitsmine"}, "description": {}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "45eda5cf-5750-68c0-cb3d-cbec5a49c344", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "4e50359e-19bf-7c64-4ffb-a4ab8e8f7a92", "parent_code": "FLSE.00.296", "parent_credits": 15, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}