{"uuid": "70c6167e-430e-5e3a-ff9d-2d10e4fc1d44", "code": "HTEP.01.218", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Development and Education for Deaf People", "et": "Surdopedagoogika alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "57dcf795-3d64-c580-02f7-b07bcb6ae636", "code": "SHHI.03.009", "title": {"en": "Psychology of Learning Disabilities", "et": "Õpiraskuste psühholoogia"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "17288317-e650-66f1-3ae9-f857913f0eac", "code": "HTEP.01.050", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Psychology of Learning Disabilities", "et": "Õpiraskuste psühholoogia"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}]}, "overview": {"description": {"en": "Hearing and hearing loss: causes, classification, assessment methods, technical compensating possibilities. The detection of hearing loss. The effect of hearing loss to child's (speech) development. Teaching and therapy methods, adjustment of (learning)environment and inclusive education.  Basic counselling of children and adults with hearing loss. ", "et": "Kuulmine ja kuulmislangus: põhjused, klassifitseerimine, hindamisvõimalused, tehniline kompenseerimine. Kuulmislanguse märkamine. Kuulmislanguse mõju lapse (kõne)arengule. Õpetamis- ja teraapiameetodid, kuulmislangusega laps kaasava hariduse tingimustes - (õpi)keskkonna kohandamine. Kuulmislangusega laste ja nende tugivõrgustiku nõustamine. "}, "objectives": [{"en": "To give an overview of hearing loss and ways for compensating for it. To give an overview of (speech) development of children with hearing loss. To introduce the methods and techniques of speech and language therapy of children with hearing loss and of teaching children with hearing loss. To introduce the methods and techniques of counselling the support network of children with hearing loss.", "et": "Anda ülevaade kuulmisest ja kuulmislangusest, kuulmislanguse märkamisest, tehnilistest kompenseerimisvõimalusest ning kuulmispuudega laste (kõne) arengust. Tutvustada võimalusi kuulmispuudega laste kõne ja keele arengu toetamiseks ning nende õpetamiseks (kaasava hariduse tingimustes). Tutvustada võimalusi kuulmislangusega laste ja nende tugivõrgustiku nõustamiseks."}], "learning_outcomes": [{"en": "After passing the subject successfully student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- knows the definition of hearing loss, its causes, levels and classifications;", "et": "- teab kuulmislanguse olemust, põhjuseid, astmeid ja klassifikatsioone;"}, {"en": "- knows the various possibilities of diagnosing hearing loss and assessing children with hearing loss;", "et": "- teab kuulmislangusega lapse hindamise ja kuulmislanguse diagnoosimise vahendeid ja võimalusi;"}, {"en": "- is familiar with the possibilities of technical rehabilitation for hearing loss; ", "et": "- on kursis kuulmislanguse kompenseerimise tehniliste võimalustega;"}, {"en": "- can detect hearing loss, knows the principles of counseling and guiding the persons with hearing loss and their support network;", "et": "- oskab kuulmislangust märgata, nõustada kuulmislangusega last ja tema tugivõrgustikku;"}, {"en": "- knows how hearing loss affects (speech and language) development:", "et": "- teab, kuidas kuulmislangus mõjutab kõne ja keele arengut;"}, {"en": "- knows different ways to support listening skills, speech and language development of children with hearing loss;", "et": "- teab kuulmislangusega laste kuulamisoskuse, kõne ja keele arendamise vajadusi ja võimalusi;"}, {"en": "- knows different teaching possibilities, methods and techniques for children with hearing loss and the principles how to choose between them;", "et": "- teab kuulmislangusega laste erinevaid õpetamismeetodeid ja nende valimise printsiipe;"}, {"en": "- has an overview how to adjust (learning)environment according to the needs of children with hearing loss.", "et": "- teab võimalusi, kuidas kuulmispuudega lapse vajadustest lähtuvalt kohandada (õpi)keskkonda."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}