{"uuid": "b8502809-4461-d4c5-c693-53ba4908d439", "code": "HTEP.01.057", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Special Needs Education", "et": "Eripedagoogika alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Special Needs Education as field of study and directions of study of the science of pedagogy. Students concentrate on the involving study models to teach children with learning disabilities, hearing disorder, visual disorder, behavioral and emotional disorder, communication disorder,  mental retardation, physical and health impairments, severe handicaps, gifted and talented students. The Individualized educational program. Principles of early intervention. Working with parents and families. SEN students in vocational education", "et": "Kaasaegne eripedagoogika sotsiaalteaduste süsteemis rakendatuna kutseõppesse. Eripedagoogika harud ja teaduse rakendusvaldkonnad. \nHEV õppurite liigitus kutseõppes.\nHEV laste ja noorte gruppide õppekorralduse eripärasused. \nKaasava õppe  mudelid. Kool Kõigile: juhtideed ja tegelikkus. \nÕpetame HEV õppuri õppima. \nÕpetaja professionaalsus tööks HEV õppuritega. \nÕppija üleminekute toetamine."}, "objectives": [{"en": "Give students basic knowledge of special education as a branch of science and the ways of putting it into practise in teaching and social integration of children and youth with special educational needs.The students are given an overview of the main topics and problems of sprecial education in vocational education.", "et": "Kujundada üliõpilastel baasteadmised eripedagoogikast kui teadusharust ja selle rakendusvõimalustest HEV laste ja noorte õpetamiseks ning sotsiaalseks integratsiooniks. Õppeaine käigus saab üliõpilane ülevaate peamistest eripedagoogilistest teemadest ja probleemidest kutsehariduses."}], "learning_outcomes": [{"en": "The subject will teach students:·", "et": "Aine läbimise tulemusel üliõpilased:·"}, {"en": "- Basic terminology of the subject·", "et": "- on omandanud eripedagoogika valdkonna põhiterminoloogia·"}, {"en": "- Knowledge of the structure (branches) of contemporary special needs education·", "et": "- teavad kaasaegse eripedagoogika struktuuri (harusid)·"}, {"en": "- Knowledge of the models used in teaching students with special educational needs·", "et": "- tunnevad hariduskorralduse mudeleid HEV õppurite õpetamiseks·\t"}, {"en": "- Attaching importance to the practise of principles of equal opportunities and inclusive studies·", "et": "- tähtsustavad võrdsete võimaluste ja kaasava õppe põhimõtete rakendamist·"}, {"en": "- Primary preparation to notice special educational needs in children and how to make the first intervention·", "et": "- omavad esmast ettevalmistust laste ja noorte hariduslike erivajaduste  märkamiseks ja esmaseks sekkumiseks·"}, {"en": "- The principals of team work needed in the developmental work with students with special educational needs·", "et": "- tunnevad meeskonnatöö aluseid HEV õppurite arengu toetamiseks·"}, {"en": "- How to analyze the micro environment around students with special educational needs ( is it contributory or inhibiting to the development).", "et": "- tähtsustavad sujuvate üleminekute kvaliteeti ning oskavad planeerida sujuvat üleminekut ühest haridusastmest teise"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}