{"uuid": "2d3a7fc5-819a-0e46-76d4-8757d7ccd674", "code": "HTEP.01.044", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-09T12:55:31", "title": {"en": "Basics of Adapted Instruction", "et": "Jõukohase õppe alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "a05073cb-342d-af63-8f26-acf5b35f8eae", "code": "HTEP.01.035", "title": {"en": "The Basics of Psychology of the Children with Special Needs", "et": "Erivajadustega laste psühholoogia alused"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Students familiarize themselves with the possibilities of organizing based on students' individual learning abilities or skills. Knowledge is acquired on changing the complexity of learning activities for students with learning difficulties, as well as on individualizing and differentiating instruction. The focus is on considering the developmental differences of SEN pupils while organizing teaching, raising awareness of the importance of speech and the teacher's role in regulating and adapting learning activities.", "et": "Üliõpilased tutvuvad õpilaste individuaalsest õpivõimekusest või õpioskustest lähtuva õppe korraldamise võimalustega. Omandatakse teadmisi õpiraskustega õpilaste õpitoimingute keerukuse muutmiseks, õppe individualiseerimiseks ja diferentseerimiseks. Keskendutakse tuge vajavate õpilaste arenguerisuste arvestamisele õppe organiseerimisel, teadvustatakse kõne osatähtsust ja õpetaja rolli õpitegevuse reguleerimisel ning jõukohastamisel."}, "objectives": [{"en": "Develop the professional skills of future special education teachers and speech therapists by introducing methods for changing the difficulty level of learning activities, individualizing teaching, and selecting suitable teaching methods for teaching SEN pupils.", "et": "Arendada tulevaste eripedagoogide ja logopeedide professionaalseid oskusi, tutvustades võimalusi tuge vajavate õpilaste õpitoimingute raskusastme muutmiseks, õppetöö individualiseerimiseks ja jõukohaste õppemeetodite valikuks."}], "learning_outcomes": [{"en": "The student\n*\tknows the basics of instruction adaptation;\n*\trelying on legal documents is able to find possibilities to guarantee adapted instruction;\n*\tknows and is able to regulate the level of difficulties of learning procedure and use possibilities of individualization and choose adapted teaching methods; \n*\tis able to use possibilities of adapted instruction for pupils with mild intellectual disabilities.", "et": "Õppeaine läbinud üliõpilane:\n* teab õppe jõukohastamise põhimõtted ja aluseid;\n* toetudes seadusandlusele oskab leida jõukohase arendava õppe tagamise võimalusi;\n* teab ja oskab reguleerida õppetunnis õpitoimingute raskusastet ja kasutada individualiseerimise võimalusi ning valida jõukohaseid õppemeetodeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}