{"uuid": "c3a72bf5-a7c0-7830-bcc0-d7b0ea8796cd", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-24T19:36:07", "title": {"en": "Development and Education for Deaf People", "et": "Surdopedagoogika alused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 14, "practice": 5, "seminar": 3, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "57dcf795-3d64-c580-02f7-b07bcb6ae636", "code": "SHHI.03.009", "title": {"en": "Psychology of Learning Disabilities", "et": "Õpiraskuste psühholoogia"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "17288317-e650-66f1-3ae9-f857913f0eac", "code": "HTEP.01.050", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Psychology of Learning Disabilities", "et": "Õpiraskuste psühholoogia"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Hearing and hearing loss: causes, classification, assessment methods, technical compensating possibilities. The detection of hearing loss. The effect of hearing loss to child's (speech) development. Teaching and therapy methods, adjustment of (learning)environment and inclusive education.  Basic counselling of children and adults with hearing loss. ", "et": "Kuulmine ja kuulmislangus: põhjused, klassifitseerimine, hindamisvõimalused, tehniline kompenseerimine. Kuulmislanguse märkamine. Kuulmislanguse mõju lapse (kõne)arengule. Õpetamis- ja teraapiameetodid, kuulmislangusega laps kaasava hariduse tingimustes - (õpi)keskkonna kohandamine. Kuulmislangusega laste ja nende tugivõrgustiku nõustamine. "}, "objectives": [{"en": "To give an overview of hearing loss and ways for compensating for it. To give an overview of (speech) development of children with hearing loss. To introduce the methods and techniques of speech and language therapy of children with hearing loss and of teaching children with hearing loss. To introduce the methods and techniques of counselling the support network of children with hearing loss.", "et": "Anda ülevaade kuulmisest ja kuulmislangusest, kuulmislanguse märkamisest, tehnilistest kompenseerimisvõimalusest ning kuulmispuudega laste (kõne) arengust. Tutvustada võimalusi kuulmispuudega laste kõne ja keele arengu toetamiseks ning nende õpetamiseks (kaasava hariduse tingimustes). Tutvustada võimalusi kuulmislangusega laste ja nende tugivõrgustiku nõustamiseks."}], "learning_outcomes": [{"en": "After passing the subject successfully student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- knows the definition of hearing loss, its causes, levels and classifications;", "et": "- teab kuulmislanguse olemust, põhjuseid, astmeid ja klassifikatsioone;"}, {"en": "- knows the various possibilities of diagnosing hearing loss and assessing children with hearing loss;", "et": "- teab kuulmislangusega lapse hindamise ja kuulmislanguse diagnoosimise vahendeid ja võimalusi;"}, {"en": "- is familiar with the possibilities of technical rehabilitation for hearing loss; ", "et": "- on kursis kuulmislanguse kompenseerimise tehniliste võimalustega;"}, {"en": "- can detect hearing loss, knows the principles of counseling and guiding the persons with hearing loss and their support network;", "et": "- oskab kuulmislangust märgata, nõustada kuulmislangusega last ja tema tugivõrgustikku;"}, {"en": "- knows how hearing loss affects (speech and language) development:", "et": "- teab, kuidas kuulmislangus mõjutab kõne ja keele arengut;"}, {"en": "- knows different ways to support listening skills, speech and language development of children with hearing loss;", "et": "- teab kuulmislangusega laste kuulamisoskuse, kõne ja keele arendamise vajadusi ja võimalusi;"}, {"en": "- knows different teaching possibilities, methods and techniques for children with hearing loss and the principles how to choose between them;", "et": "- teab kuulmislangusega laste erinevaid õpetamismeetodeid ja nende valimise printsiipe;"}, {"en": "- has an overview how to adjust (learning)environment according to the needs of children with hearing loss.", "et": "- teab võimalusi, kuidas kuulmispuudega lapse vajadustest lähtuvalt kohandada (õpi)keskkonda."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Referaat ühel etteantud teemadest. Referaadi pikkus 1500 sõna. Referaat tuleb saata aadressidele: anneli.ojaste@kliinikum.ee, piret.zimmer@gmail.com. Täpsed juhised iseseisva töö tegemiseks antakse osalejatele ainekursuse alguses.\n\n2. Filmi Sound and Fury iseseisev vaatamine. Link filmile - https://www.youtube.com/watch?v=QGBmIXfiYNI"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Referaat valitud teemal. Hinnatakse: \n1. Referaadi õigeaegset esitamist.\n2. Töö korrektset vormistust, sh korrektset keelekasutust, kirjaliku eneseväljendamise oskust.\n3. Töö asjakohasust. Nõutud on vähemalt neljale kaasaegsele teadusartiklile viitamine.\n4. Oskust loetu kohta järeldusi teha, arutleda, luua seoseid loengus käsitletud teemadega."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A- õppija valdab ainet suurepäraselt: mõistab sügavuti kuulmispuude olemust, selle avaldumisvorme, mõju lapse arengule ja kompenseerimisvõimalusi; oskab põhjalikult välja tuua erinevate õpetamismeetodite eesmärke, põhisisu ja valikupõhimõtted; teab kahte vastandlikku lähenemist kurtusele ning oskab sisukalt arutleda teemaga seonduvate probleemide üle; oskab edukalt nõustada, kuidas kohandada õpikeskkonda ja õppevara kuulmispuudega lapsele sobivaks, teab põhjalikult multisensoorse lähenemise võtteid ning implanteeritud lapse arendamise võimalusi. Valdab väga hästi teemakohaseid erialaseid mõisteid. Juhtumikirjelduse koostamisel kasutab üliõpilane oskuslikult teoreetilisi teadmisi. \n\nB- õppija valdab ainet suurepäraselt: mõistab kuulmispuude olemust, selle avaldumisvorme, mõju lapse arengule ja kompenseerimisvõimalusi; oskab välja tuua erinevate õpetamismeetodite eesmärke, põhisisu ja valikupõhimõtted; teab kahte vastandlikku lähenemist kurtusele ning oskab arutleda teemaga seonduvate probleemide üle; oskab nõustada, kuidas kohandada õpikeskkonda ja õppevara kuulmispuudega lapsele sobivaks, teab hästi multisensoorse lähenemise võtteid ning implanteeritud lapse arendamise võimalusi. Valdab hästi teemakohaseid erialaseid mõisteid. Juhtumikirjelduse koostamisel kasutab üliõpilane  teoreetilisi teadmisi.\n\nC- õppijal on piisavad teadmised ainest: ta saab aru põhilistest teoreetilistest seisukohtadest, kuid  vastustes ei too alati välja kõike vajalikku, eksib olulise ja ebaolulise info eristamisel. Teab erinevaid õpetamismeetodeid ja -võtteid, kuid ebapiisava täpsusega. Oskab üldjoontes õigesti kirjeldada vastandlikke lähenemisi kurtuse käsitlusele, kuid eksib detailides. Suudab nimetada põhilisi õpikeskkonna ja õppevara kohandamise põhimõtteid; teab üldjoontes multisensoorse lähenemise ja implanteeritud lapse arendamise võtteid. Valdab osaliselt teemakohaseid erialaseid mõisteid. Juhtumikirjelduse koostamisel kasutab üliõpilane piiratult teoreetilisi teadmisi. \n\nD- õppija teadmised ainest ei ole terviklikud ja integreeritud. Kogu teooriat ei valda, teadmistes on lüngad. Raskusi on õppemeetodite eesmärkide ja sisu kirjeldamisega, valikute põhjendamisega; teadmised õppematerjalide ja õpikeskkonna kohandamise ning implanteeritud lapse arendamise põhimõtetest ei ole piisavad; ei suuda omandatud teadmisi rakendada juhtumikirjelduste alusel lahenduste pakkumisel; teemakohaseid erialaseid mõisteid täiel määral ei valda. \n\nE- õppija tunneb mõningaid teoreetilisi seisukohti, kuid on raskustes nende täpsel kirjeldamisel, põhjendamisel, arutlemisel. Teraapiate eesmärgid, töövõtted ja meetodid on kirjeldatud liialt üldiselt, nende valikul ei arvesta kliendi probleemiga ega too näiteid. Teemakohaseid erialaseid mõisteid enamasti õigesti ei valda. \n\nF- õppija ei oska esitada faktiteadmisi, arutleda teraapia korralduse, meetodite vms üle, ei suuda põhjendada oma vastuseid. Erialaseid mõisteid ei valda."}}], "grade_preconditions": {"et": "Kodutöö (referaadi) õigeaegne esitamine, praktikumides ja seminarides osalemine."}, "grade_evaluation": {"et": "Kodutöö (referaat) moodustab 20% eksamihindest. Kirjalik eksam (valik- ja vabavastustega test) moodustab 80% eksamihindest."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga vastavalt õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "ce405a4e-4d53-4aba-85fb-1a0b504727b4", "type": "MOODLE", "code": "HTEP.01.218_SO", "base_url": "undefined", "linked_to_groups": ["04fe798f-b66a-5176-3637-13745d239295", "817785a7-ae3d-6efb-e1bf-31dbc6214b4e"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "a4738488-fd55-d55f-dc58-bb23111a7802", "person_name": "Piret Zimmer", "structural_unit": {"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "1. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "eafd89e7-538c-6387-987c-7fcbc1520210", "person_name": "Anneli Ojaste", "structural_unit": {"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "1. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}], "assistants": ["0b1d34b5-63ee-24d8-0108-8bffcbc2ac46"], "study_groups": [{"uuid": "817785a7-ae3d-6efb-e1bf-31dbc6214b4e", "code": "1. rühm", "max_size": 27}, {"uuid": "04fe798f-b66a-5176-3637-13745d239295", "code": "2. rühm", "max_size": 27}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}, "max_students": 54}, "parent_uuid": "70c6167e-430e-5e3a-ff9d-2d10e4fc1d44", "parent_code": "HTEP.01.218", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}