{"uuid": "ac9b49f2-63ce-9584-de3b-d943aae9e1bd", "code": "HTEP.01.149", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-07T15:23:34", "title": {"en": "Counselling in Special Education and Speech Therapy", "et": "Nõustamine eripedagoogikas ja logopeedias"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Competencies for pedagogical-psychological counselling are considered.", "et": "Käsitletakse eripedagoogi ja logopeedi pädevusi pedagooglilis-psühholoogilises nõustamises lapse, pere ja asutuse tasandil."}, "objectives": [{"en": "Support development of counselling skills in future work.", "et": "Luua eeldused nõustamistegevuseks erialases töös."}], "learning_outcomes": [{"en": "The student:\nKnows the theoretical principles of counselling. Knows the structure of a session and the factors supporting the establishment of psychological contact. Applies this knowledge in conversations.\nUses  active listening, questioning, empowerment, assertiveness and information providing techniques according to the situation. \nUnderstands the importance of counselling in their work and the role limits.\nRecognizes ethical dilemmas and applies ethical principles in the analysis and solving of problems.\nAnalyzes him/herself in the counselling role and takes the analysis into consideration in self-development. Knows different methods for supporting self-development. Values self-development working in a counselling role.", "et": "Teab nõustamise teoreetilisi aluspõhimõtteid. Tunneb nõustamisseansi ülesehitust ning kontakti loomist ja säilitamist soodustavaid tegureid. Rakendab neid teadmisi vestluses. \nOskab situatsioonile vastavalt kasutada suhtluspartneriga aktiivse kuulamise, küsitlemise, jõustamise, kehtestamise ja informeerimise tehnikaid.\nMõistab nõustamist kui üht osa oma tööst ja arvestab seejuures oma pädevuse piiridega. \nTunneb nõustamisel ära eetilised dilemmad ning rakendab kutse-eetika printsiipe probleemide analüüsil ja lahendamisel.\nAnalüüsib end nõustajana ja võtab analüüsi tulemusi enda arengu planeerimisel arvesse. Teab erinevaid meetodeid enesearengu toetamiseks. Väärtustab enesearengut nõustavas rollis tegutsemiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}