{"uuid": "33bee022-9cea-4d52-dfc1-20d3241c3a02", "code": "sv-2025-spring-fulltime-p2-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-07T16:29:45", "title": {"en": "Practical English I", "et": "Praktiline inglise keel I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "label": {"en": "25/26 S regular part 2 3 CP SV Eng", "et": "25/26 K PÕ 2. osa 3 EAP SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The English course develops students' language skills and enriches their vocabulary. While discussing the topics attention is drawn to various techniques which are suitable for teaching English at primary level. The course offers ideas and vocabulary for dealing with the cross-curricular topics of the national curriculum as well as the topics of the English syllabus of the first and second school stages. The course helps learners perceive language as a system and encourages them to use the acquired knowledge while teaching at primary level.", "et": "Inglise keele kursus, mille käigus arendatakse kõiki keele osaoskusi ning pööratakse tähelepanu sõnavara rikastamisele. Teemade käsitlemisel pööratakse tähelepanu erinevatele töövõtetele, mis sobivad kasutamiseks nooremas kooliastmes. Antakse ideid ja vajalik sõnavara põhikooli riikliku õppekava läbivate teemade ja inglise keele ainekava teemavaldkondade käsitlemiseks I ja II kooliastmes. Tähelepanu pööratakse keele kui tervikliku süsteemi teadvustamisele ja omandatud oskuste rakendamisele inglise keele õpetamisel I ja II kooliastmes."}, "objectives": [{"en": "To develop language skills on C1 level in order to prepare students for teaching English in primary school. To introduce students to the topics of the English syllabus of the first and second school stages. To introduce students to the topic-related vocabulary.", "et": "Arendada keele osaoskusi lähtudes Euroopa Nõukogu keeletaseme C1 nõuetest valmistamaks üliõpilasi ette inglise keele õpetamiseks I ja II kooliastmes. Tutvustada põhikooli riikliku õppekava I-II kooliastme inglise keele ainekava teemavaldkondi ja nendega seonduvat sõnavara."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Õppeaine läbinud üliõpilane: "}, {"en": "- understands longer listening texts;", "et": "- saab kuulamisel aru pikematest tekstidest; "}, {"en": "- uses language flexibly for various purposes as well as expresses and gives reasons for one's viewpoints;", "et": "- kasutab keelt paindlikult erinevatel eesmärkidel ning väljendab ja põhjendab oma seisukohti;·"}, {"en": "- understands longer reading texts and prose;", "et": "- saab lugemisel aru pikematest tekstidest ning proosast;"}, {"en": "- knows the topics of the English syllabus of the first and second school stages and topic-related vocabulary.", "et": "- tunneb I-II kooliastme inglise keele ainekava teemavaldkondi ja vastavat sõnavara."}], "notes": {}}, "grading": {"independent_work": {"en": "The list of independent work and guidelines for doing it are available in Moodle.", "et": "Iseseisvate tööde loetelu ja juhised nende tegemiseks on üleval Moodle'is."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltööde hinded moodustavad lõpphindest 40p.\nMõlemal semestril tuleb sooritada kaks kontrolltööd (aastas kokku neli kontrolltööd).\nKontrolltööde abil hinnatakse sõnavara omandamist ning kuulamis- ja kirjutamisoskust.\nPositiivse tulemuse saavutamiseks peab üliõpilane saama vähemalt 60%.\nHinne A - 100-93%\nHinne B - 92-85%\nHinne C - 84-77%\nHinne D - 76-69%\nHinne E - 68-60%"}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Sügissemestril tuleb lugeda vähemalt 200 lk ilukirjanduslikku teksti ja välja kirjutada 50 väljendit, mille teadmist kontrollitakse kodulugemise vastamisel.\nKodulugemise koondhinne annab 10p lõpphindest.\nHinne A - ülevaade on terviklik, annab selge pildi süeest ja peategelastest, kuid ei lasku liigselt detailidesse; esitus on ladus ja keelevigadeta; kasutatav sõnavara ja välja kirjutatud väljendid on vastavuses B2/C1 keeletasemega; teab vähemalt 93% väljenditest.\nHinne C - ülevaade on arusaadav, kuid nõuab täpsustavaid küsimusi; esitus on üldiselt ladus, kuid esineb mõningaid keelevigu; kasutatav sõnavara ja välja kirjutatud väljendid vastavad enamasti B2 keeletasemele; teab vähemalt 77% väljenditest.\nHinne E - ülevaade on laialivalguv, kuid annab mõningase pildi süeest; peategelasi ei kirjeldata piisavalt; esitus on konarlik ja esineb rohkelt keelevigu; kasutatud sõnavara ja välja kirjutatud väljendid vastavad osaliselt B2 keeletasemele; teab vähemalt 60% väljenditest."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Mitteeristav hindamine\nKodutöö alla kuuluvad erinevad kontrollitavad kirjalikud ja suulised ülesanded, mis moodustavad 20p lõpphindest.\nHindamiskriteeriumid: \nArvestatud töö vastab sisult, mahult ja vormistuselt esitatud nõuetele; kasutatud sõnavara ja keelestruktuurid vastavad enamasti B2 keeletasemele; võib esineda keelelisi vigu, kuid need ei sega teksti mõistmist."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Suulise eksami hinne moodustab lõpphindest 30p.\nSuulise eksami abil hinnatakse omandatud sõnavara, grammatilist korrektsust, esituse ladusust ja küsimustele vastamist. Kui eksamil kasutatakse lugemistekste, siis hinnatakse ka loetust arusaamist ja oskust oluline info välja tuua.\nHinne A - arutleb teema üle loogiliselt ja kasutab sihipäraselt õpitud temaatilist sõnavara C1 keeletasemel; väljendab oma mõtteid ladusalt ja arusaadavalt; keel on leidlik ja rikastatud sobilike idiomaatiliste väljenditega; esineb üksikuid grammatilisi ebatäpsusi; vastab küsimustele selgelt ja põhjalikult; saab aru loetud teksti mõttest ja suudab välja tuua olulise.\nHinne B - arutleb teema üle loogiliselt ja kasutab valdavalt õpitud temaatilist sõnavara B2/C1 keeletasemel; väljendab oma mõtteid ladusalt ja arusaadavalt; keel on rikas ja kujundlik; esineb grammatilisi ebatäpsusi; vastab küsimustele valdavalt selgelt ja põhjalikult; saab aru loetud teksti mõttest ja suudab valdavalt välja tuua olulise.\nHinne C - arutleb teema üle loogiliselt, kuid esitus nõuab täpsustavaid küsimusi; kasutab enamasti õpitud temaatilist sõnavara B2/C1 keeletasemel; väljendab oma mõtteid üldiselt ladusalt, ilma oluliste grammatikavigadeta; vastab küsimustele arusaadavalt ja piisavalt põhjalikult; saab aru loetud teksti mõttest, kuid toob välja ka ebaolulisi detaile.\nHinne D - arutleb teema üle üldjoontes loogiliselt, kuid kaldub kohati teemast kõrvale; kasutab osaliselt temaatilist sõnavara B2 keeletasemel; väljendab oma mõtteid konarlikult; esineb grammatilisi vigu; vastab küsimustele ebapiisavalt; ei ole kogu teksti mõttest aru saanud ja ei suuda kõige olulisemat välja tuua.\nHinne E - teema käsitlus on arusaadav, kuid laialivalguv ja kasutatav sõnavara vastab osaliselt B2 keeletasemele; väljendab oma mõtteid konarlikult ja ebatäpselt; kasutab vähesel määral õpitud temaatilist sõnavara; esineb rohkelt grammatilisi vigu; vastab küsimustele napisõnaliselt; ei ole kogu teksti mõttest aru saanud ja suudab välja tuua üksikud olulised detailid."}}], "grade_preconditions": {"et": "Arvestus (mitteeristav hindamine) sügissemestril, eksam (eristav hindamine) kevadsemestril. Arvestuse saamiseks (eksamile pääsemiseks) peavad olema sooritatud kontrolltööd ja kodulugemine positiivsele hindele ning tehtud kodused tööd. \nÕppetöös osalemine vähemalt 80% ulatuses. Kui üliõpilane on õppetöös osalenud vähem kui 50%, tuleb kursus sooritada uuesti. Praktikumi- ja iseseisva töö tunnid tuleb läbida nii sügis- kui kevadsemestril. Eksamile pääsemiseks peab olema sooritatud arvestus. Eksamile registreerumine kohustuslik."}, "grade_evaluation": {"et": "Õppeaasta kontrolltööd (40p);·kodulugemine (10p); kontrollitavad kodused tööd (20p); suuline eksam (30p). Juhul kui (välis)üliõpilane võtab ainult õppeaine 2. osa, siis kujuneb hinne kontrolltööde (1/3), koduste tööde (1/3) ja suulise eksami (1/3) põhjal."}, "grade_conditions": {"A": {"et": "100-93p"}, "B": {"et": "92-85p"}, "C": {"et": "84-77p"}, "D": {"et": "76-69p"}, "E": {"et": "68-60p"}, "F": {"et": "Vähem kui 60p"}, "mi": {"et": "Üliõpilane pole ilmunud õppetööle"}}, "debt_elimination": {"et": "Vastavalt TÜ õppekorralduseeskirjale"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Kontrolltööde tulemused selguvad 1-2 nädala jooksul peale kontrolltöö sooritamist (sõltuvalt rühma suurusest). Lõpphinne selgub suulise eksami järgselt."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "ed2383c5-4084-706e-5fdc-424b4798674b", "person_name": "Kristel Ruutmets", "structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-37"}, "entries": [{"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Praktikumides käsitletakse erinevaid teemasid vastavalt teemaplokkidele ja infole Moodle'is."}}]}, "registration_info": {"audience": {"et": "Klassiõpetaja 1. kursus (inglise keele tulemuse pingerea alusel). Eriala valimiseks peab olema inglise keele riigieksam sooritatud vähemalt 75 punktile või saavutatud B2 keeletase rahvusvahelisel inglise keele eksamil."}, "min_students": 10, "max_students": 24}, "confirmation_process": {"confirmation_uuid": "608fb9d7-a459-bcb8-86f4-3e4495b9feea", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "e6ce56bc-c2ac-7446-5cee-7684477b36ce", "parent_code": "HTHT.02.006", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}