{"uuid": "8de8b2d5-eb86-53fa-6b0d-9de8382cd72e", "code": "HTHT.02.042", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching Language Skills in Preschool", "et": "Keeleliste osaoskuste õpetamine koolieelses eas"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The development of language skills is important as it includes listening, speaking, reading and writing. Developing each skill means that the teacher is familiar with approriate methods, incl. game, and creates supportive learning environment.", "et": "Keeleoskuse omandamine on väga oluline õpilase arengu seisukohalt, sest kujundab  inimesele eluks vajalikke oskusi: kuulamist, kõnelemist, lugemist ja kirjutamist. Iga keelelise osaoskuse arendamine eeldab, et õpetaja kasutab teatud töövõtteid, kuid eelkooliealisele lapsele peavad need kõik olema seotud mänguga ja toimuma lapse arengut toetavas keskkonnas. Lasteaiaõpetaja ülesanne on sellise keskkonna loomine ja mängulise õpitegevuse juhtimine, et lastel kujuneks kuulamisoskus, areneks eakohane kõne, kujuneks lugemis- ja kirjutamisvalmidus."}, "objectives": [{"en": "To give future preschool teachers an overview of the development of language skills (years 0-7) and prepare them for developing these skills.", "et": "Anda tulevasele lasteaiaõpetajale ettekujutus sellest, kuidas toimub kuulamise õpetamine, kõnearendus (0-7a) ja sõnavara arendamine ning kuidas neile keelelistele osaoskustele toetudes  valmistada last ette lugema ja kirjutama õppimiseks.\nAine läbitakse kahe semestri jooksul.  Ainult kevadsemestril osaleda pole võimalik."}], "learning_outcomes": [{"en": "By the end of the course students ", "et": "Aine läbinud üliõpilane:"}, {"en": "* will know the factors of the development of language skills at preschool age;", "et": "*tunneb lapse kõne arengu seaduspärasusi koolieelses eas;"}, {"en": "* will be able to develop children's listening skills;", "et": "*oskab juhtida lasteaia - ealiste kuulamisõpetust;"}, {"en": "* will know the factors influencing reading and writing skills;", "et": "*tunneb lugemis- ja kirjutamisoskuse arenguga seotud tegureid;"}, {"en": "*can use different methods to teach reading considering children's skills and (special) needs;", "et": "*oskab rakendada erinevaid lugema õpetamise (mängulisi) meetodeid, arvestades lasteaia - ealiste  oskusi ja (eri)vajadusi"}, {"en": "* can use games as part of learning;", "et": "*suudab juhtida mängu kui õppeprotsessi   lasteaiarühmas ning valdab eesti keele õpetamise spetsiifilisi  võtteid;"}, {"en": "*can monitor children's language development and evaluate the efficiency of one's own work.", "et": "*suudab märgata ja jälgida laste keeleliste oskuste edenemist, vastavalt ka iseenda töö tulemuslikkust hinnata ning suunata"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}