{"uuid": "8e4b7cf0-1db8-2bef-d3e0-0c695594858f", "code": "HTHT.02.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "English for Teachers (B1)", "et": "Erialane inglise keel (B1 keeletase)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Different educational texts about primary and basic school teachers' profession, preparation, teacher training practice in Estonia and elsewhere, most important issues, strategies (themes chosen by students) in school stages I, II and III are treated. Discussions on educational issues are initiated. Different strategies are used: discussions, case studies, presentations, writing annotations in order to enrich both oral and written expression. Interactive approach and social learning are applied.", "et": "Kursuse käigus töötatakse erinevate pedagoogikaalaste tekstidega: alg- ja põhihariduse õpetaja elukutse spetsiifika; alghariduse õpetajate ettevalmistamine Eestis; õpetamine alg- ja põhikoolis (üliõpilaste valitud teemad). Tundides arutletakse õpitud sõnavara piires tekstipõhistelt haridusteemadel. Arutelude, juhtumianalüüside ja ettekannete, rühma- ja paaristööd, suuliste ettekannete ja kirjalike refereeringute abil õpitakse rakendama suulist ja kirjalikku keelekasutust. Õpetamisel kasutatakse interaktiivseid võtteid ja sotsiaalset õppimist.\nAine on mõeldud eelisjärjekorras HUM-i, LORE-i ja KLASSSIÕPETAJA eriala üliõpilastele."}, "objectives": [{"en": "To enrich students speciality-related vocabulary and develop their grammar skills (B1 language level) in order to prepare them to work independently with the scientific literature in the field of pre-school and primary school education.", "et": "Rikastada üliõpilaste sõnavara ja grammatilisi oskusi B1 keeletasemel, töötamaks iseseisvalt erialase haridust puudutava pedagoogilise kirjandusega."}], "learning_outcomes": [{"en": "On completion of the course the student:\nknows essential vocabulary in the field of primary school and basic school education and comprehends speciality-related texts (B1language level);\ncan discuss about educational issues within the range of the vocabulary acquired;\nis able to paraphrase and refer to the educational texts;\nis able to compile written and oral presentations on the basis of literature in the field of primary school and basic school education.", "et": "Üliõpilane tunneb alg- ja põhihariduse pedagoogika alast sõnavara ja suudab tekste mõista (B1 keeletase);\nüliõpilane suudab arutleda haridusalastel teemadel omandatud sõnavara ulatuses;\nüliõpilane suudab parafraseerida ja refereerida haridusalaseid tekste;\nüliõpilane oskab koostada suulise ettekande alg- ja põhihariduse erialakirjanduse põhjal."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}