{"uuid": "86644d00-20ed-4a9c-c482-dc817dbdd333", "code": "sv-2025-spring-fulltime-p2-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-07T16:33:52", "title": {"en": "English for Teachers (B2)", "et": "Erialane inglise keel õpetajatele (B2 keeletase)"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "label": {"en": "25/26 S regular part 2 3 CP SV Eng", "et": "25/26 K PÕ 2. osa 3 EAP SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "During the course students read and discuss different texts on primary and basic education as well as other educational issues and get to know the related vocabulary. The possible topics include: teachers and their work, curriculum and related topics, children's development, special educational needs and inclusive education, bullying at school, studying at university and good learning practice, etc. Students read speciality-related (scientific) texts and make a literature review (autumn term) and an oral presentation (spring term).", "et": "Kursuse käigus töötatakse nii erinevate alg- ja põhiharidust puudutavate kui ka üldiste haridusalaste tekstidega ning tutvutakse vastava sõnavaraga. Võimalikud läbitavad teemad: õpetajad ja nende töö, õppekava ja sellega seotud temaatika, laste areng, hariduslikud erivajadused ja kaasav haridus, kiusamine koolis, õppimine ülikoolis ja õppimise hea tava jmt. Üliõpilased loevad erialast teksti ja koostavad selle põhjal ülevaate (sügissemester) ning suulise ettekande (kevadsemester)."}, "objectives": [{"en": "To enlarge students' vocabulary and improve their language skills on B2 language level for working independently with speciality-related literature.", "et": "Rikastada üliõpilaste sõnavara ja keelelisi oskusi B2 keeletasemel töötamaks iseseisvalt erialase kirjandusega."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Kursuse läbinud üliõpilane"}, {"en": "- knows essential vocabulary in the field of education and comprehends speciality-related texts;", "et": "- tunneb olulisemat oskussõnavara ja mõistab erialaseid tekste;"}, {"en": "- discusses educational issues within the range of the vocabulary acquired;", "et": "- arutleb õpitud sõnavara piires haridusteaduslikel teemadel;"}, {"en": "- can summarise and paraphrase educational texts;", "et": "- oskab teha kokkuvõtte erialasest tekstist ja seda parafraseerida;"}, {"en": "- compiles and makes an oral presentation on speciality-related literature;", "et": "- koostab ja esitab loetud erialase kirjanduse põhjal suulise ettekande;"}, {"en": "- analyses and gives feedback on peers' presentations.", "et": "- analüüsib ja tagasisidestab kaasüliõpilaste ettekandeid."}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisvate tööde loetelu ja juhised on Moodle'is."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Eristav hindamine.\nKontrolltööde hinded moodustavad 50% (25%+25%) eksamihindest.\nMõlemas semestris toimub vähemalt 2 kontrolltööd.\nKontrolltööde abil hinnatakse erialase sõnavara omandamist, erialasest tekstist arusaamise oskust, kuulamis- ja kirjutamisoskust B2 keeletasemel. Kontrolltöö koosneb erinevatest ülesandetüüpidest (näiteks: lünkade täitmine, valikvastustega ülesanded, teemale kirjutamine, õigete paaride sobitamine jne.).\nKontrolltöö hindamiskriteeriumid:\nA: 100-91%\nB: 90-81%\nC: 80-71%\nD: 70-61%\nE: 60-51%"}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Eristav hindamine.\nEttekande hinne moodustab lõpphindest 25%.\nEttekanne sooritatakse kevadsemestril kokkulepitud ajakava alusel ning tehakse inglise keeles.\nEttekanne põhineb üliõpilase poolt loetud ingliskeelsel  haridusteemalisel teaduslikul artiklil ja kestab 6-8 minutit.\nEttekande koostamisel ja esitamisel lähtub üliõpilane suulise ettekande juhendist (vt Moodle'is \"Checklist for an oral presentation\").\nEttekandega kontrollitakse erialasest teaduslikust tekstist arusaamist ja olulise informatsiooni leidmist, suulist väljendusoskust ja sõnavaralist ja grammatilist kompetentsust, esinemisoskust ja ettekande näitlikustamist.\nHindamiskriteeriumid:\nA: Esitlus on tervikuna väga veenev, loogiliselt üles ehitatud ja sorav. Esitlust on illustreeritud korrektsete slaididega ja see mahub etteantud ajavahemikku. Üliõpilane suudab vastata kuulajate küsimustele. Üliõpilane kasutab sihipäraselt B2 keeletasemele vastavat sõnavara, võib esineda üksikuid grammatilisi vigu ja hääldusvigu. Üliõpilane esineb selgelt ja arusaadavalt, omab väga head kontakti publikuga.\nB: Esitlus on üldiselt tervikuna veenev, loogiliselt üles ehitatud ja sorav. Esitlust on illustreeritud slaididega ja see mahub etteantud ajavahemikku. Üliõpilane suudab enamasti vastata kuulajate küsimustele. Üliõpilane kasutab küllaltki sihipäraselt B2 keeletasemele vastavat sõnavara, võib esineda grammatilisi vigu ja hääldusvigu. Üliõpilane esineb selgelt ja arusaadavalt, omab head kontakti publikuga.\nC: Esitlus on põhiosades selge ja veenev. Esitlust on illustreeritud slaididega ja see mahub üldjoontes etteantud ajavahemikku. Üliõpilane suudab enamasti vastata kuulajate küsimustele. Üliõpilane kasutab enamasti B2 keeletasemele vastavat sõnavara, esineb kohati grammatilisi vigu ja hääldusvigu. Üliõpilane esineb enamasti selgelt ja arusaadavalt, omab kontakti publikuga.\nD: Esitlus on vähe veenev. Slaidid ei illustreeri kohati ettekannet ja/või ettekanne ei mahu etteantud ajavahemikku. Üliõpilane ei suuda alati vastata kuulajate küsimustele. Üliõpilane kasutab osaliselt B2 keeletasemele vastavat sõnavara, esineb rohkesti grammatilisi vigu ja hääldusvigu. Üliõpilane esineb kohati ebaselgelt ja arusaamatult, kontakt publikuga nõrk.\nE: Esitlus on väga vähe veenev. Slaidid ei illustreeri ettekannet ja/või ettekanne ei mahu etteantud ajavahemikku. Üliõpilane ei suuda enamasti vastata kuulajate küsimustele. Üliõpilane kasutab vähesel määral B2 keeletasemele vastavat sõnavara, esineb rohkesti grammatilisi vigu ja hääldusvigu. Üliõpilane esineb kohati ebaselgelt ja arusaamatult, kontakt publikuga väga nõrk."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Mitteeristav hindamine\nArvestuse ja lõpphinde saamiseks peavad olema kodutööd sooritatud. Kodutöö alla kuuluvad erinevad kontrollitavad kirjalikud ja suulised ülesanded.\nHindamiskriteeriumid: \nArvestatud töö vastab sisult, mahult ja vormistuselt esitatud nõuetele; kasutatud sõnavara ja keelestruktuurid vastavad enamasti B2 keeletasemele; võib esineda keelelisi vigu, kuid need ei sega teksti mõistmist."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Eristav hindamine.\nKodulugemise hinne moodustab 25% lõpphindest.\nSügissemestril tuleb lugeda vähemalt 35 lk ingliskeelset erialast teksti ja välja kirjutada 35 väljendit, mille teadmist kontrollitakse kodulugemise individuaalsel vastamisel.\nHinne A - ülevaade on terviklik, esitus on ladus ja keelevigadeta; kasutatav sõnavara ja välja kirjutatud väljendid on vastavuses B2 keeletasemega; teab vähemalt 93% väljenditest.\nHinne C - ülevaade on arusaadav, kuid nõuab täpsustavaid küsimusi; esitus on üldiselt ladus, kuid esineb mõningaid keelevigu; kasutatav sõnavara ja välja kirjutatud väljendid vastavad enamasti B2 keeletasemele; teab vähemalt 77% väljenditest.\nHinne E - ülevaade on laialivalguv, kuid annab mõningase pildi; esitus on konarlik ja esineb rohkelt keelevigu; kasutatud sõnavara ja välja kirjutatud väljendid vastavad osaliselt B2 keeletasemele; teab vähemalt 60% väljenditest."}}], "grade_preconditions": {"et": "Mitteeristav hindamine (arvestus) sügissemestril, eristav hindamine kevadsemestril. Arvestuse saamiseks peavad olema sooritatud kontrolltööd positiivsele hindele, tehtud kodused tööd ja vastatud kodulugemine. Lõpphinde saamiseks peab olema sooritatud arvestus, kevadsemestri kodutööd, kontrolltööd ja sooritatud suuline ettekanne. \nKontaktõppes osalemine on kohustuslik vähemalt 80% ulatuses. Kui üliõpilane on õppetöös osalenud vähem kui 50%, tuleb kursus sooritada uuesti. Praktikumi- ja iseseisva töö tunnid tuleb läbida nii sügis- kui kevadsemestril."}, "grade_evaluation": {"et": "Sügissemestri arvestus kujuneb kontrolltööde ja kodulugemise vastamise põhjal. (3EAP)\nKevadsemestri hinne kujuneb kontrolltööde ja suulise ettekande hinnete põhjal. (3EAP)\nLõpphinne (õppeaasta lõplik tulemus) kujuneb sügis- ja kevadsemestri hinnete põhjal. Õppeaasta kontrolltööde koondhinne 50%, suuline ettekanne 25%, kodulugemine 25%. (6EAP)"}, "debt_elimination": {"et": "Võlgnevusi saab likvideerida kokkuleppel õppejõuga ning korduseksamit sooritada vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Kontrolltööde tulemused selguvad 1-2 nädala jooksul peale kontrolltöö sooritamist (sõltuvalt rühma suurusest)."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "ed2383c5-4084-706e-5fdc-424b4798674b", "person_name": "Kristel Ruutmets", "structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Praktikumides käsitletakse teemasid vastavalt Moodle'i teemplokkidele. Semestris toimub kaks kontrolltööd. Suulised ettekanded toimuvad kahes või kolmes viimases praktikumis (sõltuvalt osalejate/ettekannete arvust)."}}]}, "registration_info": {"audience": {"et": "Inglise keele riigieksami tulemus peab olema vahemikus 70-85 punkti või saavutatud B2 tase inglise keele rahvusvahelisel eksamil. C1 tasemel on vaja registreerida õppeainele SHHI.02.055, B1 tasemel õppeainele HTHT.02.001."}, "min_students": 10, "max_students": 20}, "confirmation_process": {"confirmation_uuid": "b99cf67e-c02a-b79f-0710-df63654f67a9", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "b8b8aa79-b2c5-a4ad-6076-37f84433c3b4", "parent_code": "HTHT.02.002", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}