{"uuid": "b8b8aa79-b2c5-a4ad-6076-37f84433c3b4", "code": "HTHT.02.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "English for Teachers (B2)", "et": "Erialane inglise keel õpetajatele (B2 keeletase)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the course students read and discuss different texts on primary and basic education as well as other educational issues and get to know the related vocabulary. The topics include: teachers and their work, curriculum and related topics, children's development, special educational needs and inclusive education, bullying at school, studying at university and good learning practice, etc. Students read speciality-related (scientific) texts and make a literature review (autumn term) and an oral presentation (spring term).", "et": "Kursuse käigus töötatakse nii erinevate alg- ja põhiharidust puudutavate kui ka üldiste haridusalaste tekstidega ning tutvutakse vastava sõnavaraga. Läbitavad teemad: õpetajad ja nende töö, õppekava ja sellega seotud temaatika, laste areng, hariduslikud erivajadused ja kaasav haridus, kiusamine koolis, õppimine ülikoolis ja õppimise hea tava jmt. Üliõpilased loevad erialast teksti ja koostavad selle põhjal ülevaate (sügissemester) ning suulise ettekande (kevadsemester)."}, "objectives": [{"en": "To enlarge students' vocabulary and improve their language skills on B2 language level for working independently with speciality-related literature.", "et": "Rikastada üliõpilaste sõnavara ja keelelisi oskusi B2 keeletasemel töötamaks iseseisvalt erialase kirjandusega."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Kursuse läbinud üliõpilane"}, {"en": "- knows essential vocabulary in the field of education and comprehends speciality-related texts;", "et": "- tunneb olulisemat oskussõnavara ja mõistab erialaseid tekste;"}, {"en": "- discusses educational issues within the range of the vocabulary acquired;", "et": "- arutleb õpitud sõnavara piires haridusteaduslikel teemadel;"}, {"en": "- can summarise and paraphrase educational texts;", "et": "- oskab teha kokkuvõtte erialasest tekstist ja seda parafraseerida;"}, {"en": "- compiles and makes an oral presentation on speciality-related literature;", "et": "- koostab ja esitab loetud erialase kirjanduse põhjal suulise ettekande;"}, {"en": "- analyses and gives feedback on peers' presentations.", "et": "- analüüsib ja tagasisidestab kaasüliõpilaste ettekandeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}