{"uuid": "96cc020f-248c-0594-f89f-6ac1a0d2cd69", "code": "HTHT.02.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Handicraft and Home Economics", "et": "Käsitöö ja kodunduse alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of Estonian folk art and of consumer education", "et": "Kursusel tutvutakse eesti rahvakunsti ja saadakse ülevaade tarbijakasvatusest."}, "objectives": [{"en": "The aim of the course is to give an overview of the historical development of crafts and home economics, the nature of crafts, as well as consumer education; to develop understanding of the nature and evolution of  folk textile, emphasising  individual parts of national costume  and the tradition of wearing it.", "et": "Üldeesmärgiks on saada ülevaade käsitöö ja kodunduse õppeainest, käsitöö olemusest ning tarbijakasvatusest. Kujundada arusaam rahvatekstiili olemusest ja kujunemisest kultuuriajaloo taustal, tuues esile rahvarõiva üksikosade valmistamise alused ja kandmise traditsioonid."}], "learning_outcomes": [{"en": "After completing the course students", "et": "Õppeaine läbinus üliõpilane:"}, {"en": "1.\twill  have an overview of the concept of folk art, national costumes of Estonian parishes and their development trends on the background of the history of costume and fundamentals of ornament; ", "et": "1. omab ülevaadet rahvakunsti mõistest, eesti kihelkondade rahvarõivastest ja nende arengusuundadest üldise kostüümiajaloo taustal ning ornamenteerimise põhialustest;"}, {"en": "2.\tcan  comprise a summary of a set of Estonian national costume based on literature and museum exhibits; ", "et": "2. koostab ja tutvustab kirjanduse ning muuseumiesemete vaatluse põhjal ühest eesti kihelkonna rahvarõivakomplektist kokkuvõtliku ülevaate;"}, {"en": "3.\twill know the techniques of costume design and can prepare as well as analyse  methodological material for crafts lessons of second and third school stages; ", "et": "3. tunneb ja oskab valmistada rahvarõivaste juures kasutatavaid töövõtteid ja koostab nendest metoodilise õppematerjalide kogu ning analüüsib omandatud teadmiste rakendamise võimalusi II ja III kooliastme käsitöötundides;"}, {"en": "4.\twill analyse their consumer behaviour and the possibilities of applying acquired knowledge to practice.", "et": "4. analüüsib oma tarbijakäitumist ja omandatud teadmiste rakendamise võimalusi II ja III kooliastme käsitöö- ja kodunduse tundides."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}