{"uuid": "e6ce56bc-c2ac-7446-5cee-7684477b36ce", "code": "HTHT.02.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical English I", "et": "Praktiline inglise keel I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The English course develops students' language skills and enriches their vocabulary. While discussing the topics attention is drawn to various techniques which are suitable for teaching English at primary level. The course offers ideas and vocabulary for dealing with the cross-curricular topics of the national curriculum as well as the topics of the English syllabus of the first and second school stages. The course helps learners perceive language as a system and encourages them to use the acquired knowledge while teaching at primary level.", "et": "Inglise keele kursus, mille käigus arendatakse kõiki keele osaoskusi ning pööratakse tähelepanu sõnavara rikastamisele. Teemade käsitlemisel pööratakse tähelepanu erinevatele töövõtetele, mis sobivad kasutamiseks nooremas kooliastmes. Antakse ideid ja vajalik sõnavara põhikooli riikliku õppekava läbivate teemade ja inglise keele ainekava teemavaldkondade käsitlemiseks I ja II kooliastmes. Tähelepanu pööratakse keele kui tervikliku süsteemi teadvustamisele ja omandatud oskuste rakendamisele inglise keele õpetamisel I ja II kooliastmes."}, "objectives": [{"en": "To develop language skills on C1 level in order to prepare students for teaching English in primary school. To introduce students to the cross-curricular topics of the national curriculum as well to the topics of the English syllabus of the first and second school stages. To introduce students to the topic-related vocabulary.", "et": "Arendada keele osaoskusi lähtudes Euroopa Nõukogu keeletaseme C1 nõuetest valmistamaks üliõpilasi ette inglise keele õpetamiseks I ja II kooliastmes. Tutvustada põhikooli riikliku õppekava läbivaid teemasid ning I-II kooliastme inglise keele ainekava teemavaldkondi ja nendega seonduvat sõnavara."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Õppeaine läbinud üliõpilane: "}, {"en": "- understands longer listening texts;", "et": "- saab kuulamisel aru pikematest tekstidest; "}, {"en": "- uses language flexibly for social and professional purposes as well as expresses and gives reasons for one's viewpoints;", "et": "- kasutab keelt paindlikult nii ühiskondlikel kui tööalastel eesmärkidel ning väljendab ja põhjendab oma seisukohti;·"}, {"en": "- understands longer reading texts and prose;", "et": "- saab lugemisel aru aktuaalsetel teemadel kirjutatud pikematest tekstidest ning proosast;"}, {"en": "- knows the topics of the English syllabus of the first and second school stages and topic-related vocabulary;", "et": "- tunneb I-II kooliastme inglise keele ainekava teemavaldkondi ja vastavat sõnavara; "}, {"en": "- knows the cross-curricular topics of the national curriculum and can integrate them into first and second school stage English lessons;", "et": "- teab põhikooli riikliku õppekava läbivaid teemasid ja oskab neid integreerida I ja II kooliastme inglise keele tundi; "}, {"en": "- has ideas for dealing with the topics mentioned above.", "et": "- omab ideid erinevatest võimalustest nende teemade käsitlemiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}