{"uuid": "adfc8c81-9ad8-15cf-fdf9-ab28eb4e5181", "code": "HTHT.02.055", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Tuition of Children with Mother Tongue Other than Estonian", "et": "Muukeelne laps eesti koolis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course defines the concept of culture and intercultural communication. Methods and principles of cross-cultural learning are analyzed. A special attention will be given to the Estonian school situation where students with different language background are thought. Case studies are analyzed in order to find solutions applicable in school stages I and II.", "et": "Kursusel antakse ülevaade kultuuri mõistest ja kultuuridevahelise suhtlemise baastõdedest. Käsitletakse kultuuridevahelise õppimise põhimõtteid ja meetodeid. Vaadeldakse lähemalt olukordi, millega õpetaja puutub kokku eestikeelses koolis muukeelsete laste õpetamisel. Juhtumeid analüüsides püütakse leida optimaalseid lahendusi, mis sobiksid I ja II kooliastme õpilastele."}, "objectives": [{"en": "To get a general overview about intercultural communication and development of ideas of multilingual education in Estonian and worldwide context. To support future teachers readiness to work in multicultural and -lingual classroom.", "et": "Saada ülevaade kultuuridevahelise suhtlemise põhitõdedest ning mitmekeelse hariduse ideede arengust Eestis ja maailmas. Toetada tulevase õpetaja valmisolekut töötamaks mitmekeelses ja -kultuurilises klassiruumis."}], "learning_outcomes": [{"en": "To pass the course successfully the student:", "et": "Õppeaine edukal läbimisel üliõpilane: "}, {"en": "* knows basic theoretical principles of intercultural communication;", "et": "*\tteab põhilisi teoreetilisi seisukohti kultuuridevahelisest suhtlemisest;"}, {"en": " * is aware of good practices in supporting multilingual pupils in Estonian schools;", "et": "*\ttunneb Eesti koolide häid praktikaid muukeelsete laste toetamisel;"}, {"en": "* understands how multicultural background influences learning process; ", "et": "*\tmõistab, kuidas multikultuurilisus mõjutab õppeprotsessi;"}, {"en": "* knows  principles and methods of cross-cultural studies; ", "et": "*\ttunneb kultuuridevahelise õppimise printsiipe ja meetodeid;"}, {"en": "* can use appropriate teaching strategies based on the needs of students with different language background.", "et": "*\toskab kasutada sobivaid õpetamismeetodeid lähtuvalt olukorrast kui klassis on eesti keelest erineva kodukeelega õpilasi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}