{"uuid": "0caaed88-33d5-050b-ee74-f1a032b7476b", "code": "HTHT.02.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Colour Theory, Composition and Perspective", "et": "Värvi-, kompositsiooni- ja perspektiiviõpetus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The subject consists of three parts: Golour Studies, Study of Composition and Study of Perspective. Itten`s,  Edward`s  and Lapin's work have been used to apply theoretical knowledge into practice.", "et": "Õppeaine koosneb kolmest osast: värvusõpetus, kompositsioon, perspektiiviõpetus. Toetutakse Itteni,  Edwardsi, Lapini jt töödele, rakendades saadud teadmisi praktilistes töödes."}, "objectives": [{"en": "The main aim is to introduce the most important parts of structure of Art Studies and creative work; as well as form theoretical, practical and methodological skills for teaching in elementary school.", "et": "Üldeesmärgiks on kunstiõpetuses ja kunstiloomingus oluliste struktuuriosade tutvustamine,  teoreetiliste, praktiliste ja metoodiliste oskuste kujundamine õpetamaks kunstiõpetust põhikoolis"}], "learning_outcomes": [{"en": "The student who has passed the course:\n- knows the structure of Art and Art Studies;\n- understands the basic rules of colour studies, compositions and perspective;\n- knows the terminology related to the domains of colour studies, compositions and perspective and is able to analyze  a piece of work and students`work accordingly;\n- applies his/her theoretical, didactis and practical skills in creative work.", "et": "Kursuse läbinud üliõpilane \n- tunneb kunstiloomingu ja kunstiõpetuse struktuuri;\n- mõistab värvi-, kompositsiooni ja perspektiiviõpetuse reegleid ja põhimõtteid; \n- teab põhilist värvi-, kompositsiooni- ja perspektiiviõpetuse alast terminoloogiat,\n- on võimeline analüüsima nii oma loovtöid, kunstiteoseid kui õpilastöid; \n- rakendab omandatud teoreetilisi, metoodilisi ja praktilisi oskusi oma töödes ja kunstitegevuste kavandamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}