{"uuid": "009f6704-0b7c-3a9d-dd44-969de411d8c0", "code": "HTHT.02.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical English Grammar for Teachers of Young Learners I", "et": "Inglise keele praktiline grammatika I ja II kooliastme õpetajale (I)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Upper-intermediate grammar course focusing on grammar terminology, tense forms both in the active and passive voice, parts of speech, passive voice, forming questions, derivation, phrasal verbs, nouns and pronouns. The course exploits interactive and social learning, concentrating on motivating strategies.The attention is also paid on the beginners' typical mistakes and how to analyse these mistakes. Both essential grammar basis for teaching in stages I and II as well as assumption for choosing suitable study strategies are developed.", "et": "Kõrgema kesktaseme grammatikakursus, mille käigus käsitletakse grammatika terminoloogiat, aegade moodustamist ja kasutamist aktiivis ja passiivis, küsimuste moodustamist, frasaalverbe, nimisõna, asesõna, sõnatuletamist jne. Käsitletakse grammatika teemavaldkondi, mis on olulised inglise keele õpetamisel I ja II kooliastmes. Õpitakse interaktiivse ja sotsiaalse õppimise kaudu, pöörates tähelepanu grammatika mängulistele õppimisvõimalustele, mis on vajalikud I ja II kooliastme õpilaste motiveerimiseks. Keskendutakse ka algaja õppija tüüpilistele vigadele ja tulevase õpetaja oskusele neid õpilastele lihtsalt ja arusaadavalt selgitada. Luuakse nii tugev grammatiline baas algeastmes õpetamiseks kui ka eeldus sobilike didaktiliste ja interaktiivsete õpistrateegiate valimiseks."}, "objectives": [{"en": "To reinforce the most essential language structures from the aspect of practical language usage. To illustrate different strategies for teaching grammar in the school stages I and II.", "et": "Kinnistada olulisemaid keelestruktuure praktilise keelekasutuse seisukohast lähtudes. Näitlikustada erinevaid grammatika õpetamise võtteid I ja II kooliastmes."}], "learning_outcomes": [{"en": "The student knows grammar terminology, grammar rules within the range of the themes covered, can form and correctly use the most essential language structures. The studemt knows different task types for teaching grammar and can choose form among them the most suitable ones for school stages I and II. The student can select and apply different interactive strategies of teaching grammar, testing them on their fellow students and reflecting both his/her own as well as the others' performance.", "et": "Õppeaine läbinud üliõpilane: tunneb grammatika termineid; teab grammatikareegleid läbivõetud teemade piires; oskab moodustada ja korrektselt kasutada olulisemaid keelestruktuure. Üliõpilane tunneb grammatika õpetamise võtteid, mis on tulemuslikud I ja II kooliastmes. Üliõpilane oskab koostada erinevaid grammatika õpetamise õpiülesandeid I ja II kooliastmele. Üliõpilane oskab valida ja rakendada erinevaid algajatele ja eelkesktaseme õppijatele mõeldud grammatika õpetamise interaktiivseid õpitegevusi, nende abil kaasüliõpilasi õpetada ning nii oma kui kaasüliõpilaste sooritust reflekteerida."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}