{"uuid": "1b70873f-bbec-c88b-7fb0-25c39382fb8b", "code": "HTHT.02.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methodology of Teaching Handicraft, Home Economics and Art", "et": "Käsitöö, kodunduse ja kunstiõpetuse didaktika"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces the basic issues of crafts, home economics and art didactics The topics include history of teaching, different teaching methods, learning environment, teaching left-handed children etc.", "et": "Kursusel tutvustatakse käsitöö, kodunduse ja kunstiõpetuse didaktika põhialuseid. Tutvutakse käsitöö, kodunduse ja kunstiõpetuse õpetamise ajalooga, erinevate õpetamismeetoditega, õpikeskkonnaga jne. Käsitletakse vasakukäeliste ja erivajadustega laste õpetamist."}, "objectives": [{"en": "To give didactic knowledge for teaching crafts, home economics and art in basic school.", "et": "Üldeesmärgiks on saada põhilised ainedidaktilised teadmised käsitöö ja kodunduse ning kunstiõpetuse tundide läbiviimiseks II ja III kooliastmes."}], "learning_outcomes": [{"en": "After completing the course students\n1.\twill have an overview of the crafts, home economics and art syllabi of the national curriculum and can bring examples of integration of the subjects; \n2.\twill have  knowledge of the learning process, lesson planning and modern teaching methods; \n3.\twill have knowledge and skills to teach the aforementioned subjects at basic school; \n4.\tcan apply the acquired knowledge in lesson planning, express their ideas as well as analyse the study material.", "et": "Õppeaine läbinud üliõpilane:\n1. omab ülevaadet käsitöö ja kodunduse ning kunsti ainekavast, oskab kirjeldada selle seost üldosaga ning tuua näiteid õppeainete ja läbivate teemade lõimimispõhimõtete kohta;\n2. oskab koostada ja kasutada erinevaid õppematerjale ning analüüsida neid;\n3. mõistab õppimise olemust, on teadlik selle toetamise võimalustest;\n4. oskab kavandada ja analüüsida käsitöö ja kodunduse ning kunsti tunde II ja III kooliastmes, kasutades teadmisi õppeprotsessist, ainetunni planeerimisest, kaasaegsete õpimeetoditest, -stiilidest õppetöös ning pidades silmas õpikeskkonna võimalusi;\n5. omab ainedidaktilisi teadmisi käsitöö ja kodunduse ning kunsti õppeainete õpetamiseks, suutes neid selgelt ja loogiliselt formuleerida nii kõnes kui kirjas;\n6. oskab ennast ja oma tegevust aineõpetajana mõtestada ning suudab lõimida õpetaja läbivaid kompetentse aine- või valdkonnaspetsiifilise õppetööga."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}