{"uuid": "65af0e27-c8ce-cecc-39c8-88c16051cf4a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-12T13:19:31", "title": {"en": "Basics and Methodology of Teaching Social Sciences", "et": "Ühiskonnaõpetuse alused ja didaktika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 4, "practice": 10, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course provides future teachers with necessary skills and knowledge about how to teach social life skills on the first and second school stages, work as a form teacher and organise extra- curricula activities. It helps to systematise and reinforce knowledge about\n the beginning of human society and statehood as well as of social, economic and political organisation of society . It helps to understand the processes happening in modern society.", "et": "1.\tÜhiskonnaõpetuse ajaloost Eestis. Ainekava eesmärgid ja sisulised struktuurid Eesti riiklikus õppekavas. 2.\tInimühiskonna kujunemine ja areng nüüdisühiskonnaks. Väärtushinnangud    eri aegadel (Materjal WebCT-s).3.\tDemokraatia tekke eeltingimused, olemus ja põhijooned. Demokraatia areng kaasajal. 4.\tÜhiskonnaelu valdkonnad ja ühiskonna sotsiaalne struktuur (Materjal WebCT-s)5.\tRiigi tekke eeldused, mõiste, funktsioonid. Riigiteooriad, riigikorrad ja valitsemisvormid ajaloos ja tänapäeval.6.\tEesti Vabariigi ühiskonnaelu korraldus."}, "objectives": [{"en": "To form attitudes and provide knowledge and skills that are necessary for teaching social life skills on the first and second school stages, in a form teacher's work and extra- curricula activities.", "et": "Aidata kujundada teadmisi, oskusi, hoiakuid, mis on vajalikud   ühiskonnas toimetuleku õpetamiseks I, ja II kooliastmes, samuti klassijuhatajatöös ja klassivälises tegevuses."}], "learning_outcomes": [{"en": "By the end of the course a student will know the syllabus of social studies;  have basic knowledge of the characteristics of a state and criteria for sovereignty;  know the history of the Republic of Estonia; can explain the most important civil rights; will have basic knowledge of Estonian legislation and legal provisions on children's rights; can teach social studies using modern teaching methods.", "et": "Teab  Eesti riiklikus õppekavas ühiskonnaõpetuse I ja II kooliastme ainetemaatikat  ja -struktuuri; ·\tOmandab põhiteadmised riigi tunnustest ja suveräänsust tagavatest elementidest;·\tTeab Eesti riigi ajaloolist ning tänapäevast ülesehitust;·\tOskab selgitada olulisemaid inim- ja kodanikuõigusi ajaloos ja tänapäeval;·\tTunneb üldjoontes Eesti Vabariigi põhiseadust ning põhilisi lastega seonduvat seadusandlust; ·\tOskab ühiskonnnaõpetuse temaatikat edasi anda kaasaegsete õppemeetodite abil"}], "notes": {}}, "grading": {"independent_work": {"et": "Seadustik laste õiguste kaitseks. Laste turvalisuse tagamine suhetes täiskasvanutega ja omavahelistes suhetes. (Moodle keskkonnas) Ajatabeli koostamine ja hindamine. Ajakasutamise planeerimine. (Ülesanded õpimappi) Ajakirjandus infoallikana (Matejal Moodle keskkonnas). Rahvusvahelised suhted ja globaalprobleemid ühiskonnas (Materjal Moodle keskkonnas). Vahekohtrolltöö (Moodle keskkonnas -  Eesti riigi tänapäevane ülesehitus.  Multikultuursus (Materjal Moodle keskkonnas). Kodune eksamiessee Eesti ühiskonnaelu valupunktidest (Moodle keskkonnas) Kokkuvõttev seminar: Eesti Vabariigi ühiskonna- ja hariduselu probleemid ajaloos ja tänapäeval. Didaktikaülesannete täitmine ja õpimapi vormistamine."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "ARVUTIKLASSIS - Eksamitest - 50% eksami lõpphindest. Testi hindamine:A-st-D-ni. . A-100-91% testi punktidest; B -90 - 81 5; C - 80 -71 %; D - 70-60 %; F- 59 % eksamitesti hindest. Eksamitest sooritatakse arvutiklassis iseseisvalt kõrvalise ja abimaterjalide abita. \nÕpimapp 25 % eksamihindesst (vt nõuded õpimapile kursuse TÜ Moodle keskkonnas);\nKodune eksamiessee tänapäeva Eesti ühiskonnaelu probleemidest 25% eksami lõpphindest (vt nõuded eksmiesseele  kursuse TÜ Moodle keskkonnas)"}}, {"work_type": {"code": "portfolio", "et": "Õpimapp", "en": "portfolio"}, "description": {"et": "Eksami osa - esitatud õpimapp (kodutööde ja didaktiliste ülesannetega). Nõuded õpimapile esitatud kursuse TÜ Moodle keskkonnas. Õpimapp kujuneb e-kodutöödest, auditoorsetel kollokviumidel tehtud didaktikaülesannete ja koduste didaktikaülesannete vormistamistest. Õpimapi esitamine kohustuslik enne auditoorset eksamitesti sooritamist arvutikalssis kususe TÜ Moodle keskkonnas.\nÕpimapi hindamine: D - esitatud ja vomistatud nõuetekohaselt 75 % nõutud kodutöödest.\nC - vormistatud kõik nõutud kodutööd, kuid neis esineb lünki või töölehtedel ja didaktikaülesannetes esineb vigu. Õpimapi struktureerimine jätab soovida. On lisatud omapoolne kokkuvõte õpimapile.\nB - Esitatud ja vormistatud korrektselt kõik kodutööd, esineb mõni üksik näpuviga, õpimapp on struktureeritud. On lisatud omapoolne kokkuvõte õpimapile.\nA - Õpimapi üleanded on kõik esitatud ja vormistatud suurepäraselt, vigadeta. On näha didaktikaülesannete loovust, õpimapp on struktrueeritud korrektselt, lisatod on õppija omapoolne õpimapi analüüs."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Eksami osa - kodune essee esitatud Moodle keskkonnas - ühel etteantud teemal. Hindamine A-st kuni D-ni 25-13 punkti järgmiselt: A- 25 -23 p; B - 22-20 p; C 19-16 p; D- 15-13 p, F- 12 ja vähem punkti.\nEksamiessee pikkus 2-4 A4 lk., lisatud viited essee lõppu. Kasutatud vähemalt 3-4 allika (viidatud) mõtteid. Essee on struktureeritud, varustatud autori nimega, tiitellehte pole vaja."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kodune kontrolltöö kursuse TÜ Moodle keskkonnas kursuse keskel. Koduse vahekontrolltöö  positiivne sooritamine (60% punktidesst) eksamitestile pääsemise tingimus."}}], "grade_preconditions": {"et": "Eksamile registreerimine. Kohutstulikud seminarid (3 seminaritööd Moodle keskkonnas osaleda foorumis ja esitada kodutööd), positiivsele hindele soovitatud 1 kontrolltöö semestri keskel, kodune arutlus (esitada Moodle keskkonnas)"}, "grade_evaluation": {"et": "Kodune arutlus Moodle keskkonnas ja didaktikaülesanded õpimappi moodustavad 57 % ning kirjalik eksamitest 43% sooritatuna arvutiklassis."}, "debt_elimination": {"et": "Vastavalt TÜ õppekorralduseeskirjale"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee/", "is_moodle_connected": true, "learning_environments": [{"uuid": "b2bfe345-d3a0-4df7-bf5c-a256f85b1a47", "type": "MOODLE", "code": "HTOS.02.500", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "f9da2024-f7dc-8846-eb6c-634141141a03", "person_name": "Aare Ristikivi", "structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ühiskonnaõpetuse ajaloost Eestis. Ainekava eesmärgid ja sisulised struktuurid RÕK-s. Õppekirjandus. Kursuse Moodel keskkonna tutvustamine. (Auditoorne kontakt)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "ARVUTIKLASSIS - Riikluse kujunemine ajaloos ja tänapäeva. Tutvumine kursuse Mahara keskkonnaga ja esimeste õpimapi ülesannete üleslaadimine. (Auditoorne kontakt)"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Iseseisev e-õpe (praktikum): Inimühiskonna kujunemine ja areng nüüdisühiskonnaks. Väärtushinnangud  eri aegadel (Materjal kursuse TÜ Moodle keskkonnas). Demokraatia tekke eeltingimused, olemus ja põhijooned. Demokraatia areng kaasajal. Ühiskonnaelu valdkonnad ja ühiskonna sotsiaalne struktuur. (Ülesanded õpimappi)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Riikluse kujunemine, sotsiaalse keskkond ja selle muutumine ajas. Sotsiaalhoolekanne ajaloos ja Eestis. Väärtuskasvatus. Kodanukuühiskonna ühiskonna eesmärgid ja kujunemine.  Meedia kujunemine ja roll kaasaja ühiskonnas. (Auditoorne kontakt)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sotsiaalne toimetulek; ühiselu reeglite ja normide  kehtestamine, otsustusmäng, valikute tegemine Õiguskord ja õiguskaitse. Kodaniku ja inimõiguste kujunemine ajaloos ja tänapäeval. Eesti Vabariigi põhiseadused ajaloos ja kehtiv põhiseadus ja  laste kaitse seaduse analüüs.  (ülesanded õpimappi Mahara keskkonnas)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Didaktika: hinnangu andmine, purunematu kolmnurk. Kodu ja kooli koostöö; ühise eesmärgi nimel. Valupunktide aknad - ühise arvamuse kujundamine (Ülesanded õpimappi) (Auditoorne kontakt) Ajakasutustabeli koostamise juhised õpimappi."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Mängud ühiskonnaõpetuse tundides: mudeldusmäng - Allikad. Pagulaste rollimäng. Väärtuskasvatuse mäng (Ülesanded õpimappi) (Auditoorne kontakt)"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "KODUNE vahekontrolltöö Moodle keskkonnas. Ajatabeli koostamine ja hindamine. Aja kasutamise planeerimine. (Ülesanded õpimappi)(praktikum)"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Õppekäik Eesti Vabariigi Riigikohtusse"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "ARVUTIKLASSIS kokkuvõttev seminar: - Eesti koht maailmas. Eestlus kodu ja välismaal. Eesti seotus   rahvusvaheliste organisatsioonidega. Rahvusvahelised suhted ja globaalprobleemid ühiskonnas. Õpimaopi ülesannete üleslaadimine Mahara keskkonnas (EKSAMI osa) (Auditoorne kontakt)"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Individuaalne artuluse esitamine ühiskonna valupunktidest Moodle keskkonnas. (EKSAMI osa)(praktikum)"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Eksamitest - arvutiklassis (auditoorne kontakt) (Eksami osa)"}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 31}, "parent_uuid": "c10de524-030e-1014-c8e7-15bcd1fb2733", "parent_code": "HTOS.02.500", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}