{"uuid": "704b1369-c426-b1c2-ca51-1039e43f5bbf", "code": "HTOS.02.204", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methodology of Teaching Estonian I", "et": "Eesti keele algõpetuse didaktika I"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Estonian at primary school has the biggest number of lessons and links all the other subjects. It is is important for the development of children and gives all the necessary skills for life, such as listening, speaking, reading and writing. Developing each language skill requires different knowledge from a teacher.Teaching writing at primary school includes teaching calligraphy, ortography and creative writing. All these require different techniques. The course deals with various aspects of teaching Estonian at primary school.", "et": "Emakeel on algklassides suurima tundide arvuga ja teisi aineid ühendav õppeaine, väga oluline õpilase arengu seisukohalt, sest kujundab  inimesele eluks vajalikke oskusi: kuulamist, kõnelemist, lugemist ja kirjutamist. Iga keelelise osaoskuse arendamine eeldab, et õpetaja kasutab teatud töövõtteid. Mõiste „kirjutamine\" tähendab 1.kooliastmel omakorda nii kirjatehnikat, ortograafiat kui loovkirjutamist, mis kõik eeldavad õpetajalt erinevat lähenemist. Kuidas oma tööd planeerida, kui tuleb arvestada nii paljude asjadega, samas õpilaste erinevate vajadustega - seda kõike tuleb käsitleda emakeele õpetamise didaktikas."}, "objectives": [{"en": "To provide knowledge and skills to work as a teacher of Estonian at primary school.", "et": "Valmistada üliõpilane ette töötama klassiõpetajana, kes valdab eesti keele õpetamise spetsiifikat."}], "learning_outcomes": [{"en": "By the end of the course a student can design a syllabus based on it; can design a lesson plan for the Estonian language class, considering the skills and abilities of children, incl. special educational needs; can direct the learning process and will know different methods for teaching Estonian at primary school; can monitor and identify children's progress and evaluate the efficiency of teaching; will set a role model for pupils and teach them values.", "et": "Aine läbinud üliõpilane:*oskab koostada tunnikonspekti emakeeletunniks, arvestades I kooliastme laste oskusi ja (eri)vajadusi;*suudab juhtida õppeprotsessi oma tunnis ja rühmas ning valdab eesti keele algõpetuse spetsiifilisi metoodilisi võtteid;*suudab jälgida ja ära tunda õpilaste oskuste edenemist emakeeles ning vastavalt ka iseenda töö tulemuslikkust hinnata;*realiseerib õppeaines peituvaid kasvatuslikke väärtusi ja on oma eetilise käitumisega õpilastele eeskujuks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}