{"uuid": "6b4529eb-8c73-a793-5591-3fd68dabe156", "code": "HTOS.02.465", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Food Chemistry", "et": "Toiduainete keemia"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Fundamental concepts of dietary and food chemistry will be introduced. Using inquiry learning method students will get basic knowledge in food chemistry as well chemical aspects of food preparation processes. In seminars and labs student get skills in food analysis to assess the food quality parameters. Food chemistry course will give students basic knowledge also in digestive processes and food additives and about their influence to the organism.", "et": "Kursuses selgitatakse tervisliku toitumise aluseid, toiduainete keemilist koostist ja toidu valmistamisel kulgevaid keemilisi protsesse. Käsitletakse ka toidu seedimise ja toitainete omastamisega seotud probleeme. Õppetöös kasutatakse avastusõppe meetodit. Seminarides ning laboris saavad üliõpilased praktiliselt uurida toiduaineid ning määrata toidu kvaliteeti, samuti teavet kasutatavate toidulisandite ja nende toime kohta organismile."}, "objectives": [{"en": "To introduce chemical aspects of food and food preparation using inquiry learning method.", "et": "Selgitada toiduainete ning toiduvalmistamise keemilisi aspekte suunatud uurimusliku õppe rakendamisel."}], "learning_outcomes": [{"en": "Students will be expected", "et": "Õppeaine läbinu:"}, {"en": "- to gain knowledge in theoretical basis of guided inquiry based learning and teaching method and its practical application in teaching of food chemistry;", "et": "- on tuttav uurimusliku õppe meetodi teoreetiliste aluste ning praktilise rakendamisega toiduainete keemia õpetamisel ;"}, {"en": "- to understand and explain major principles of integrative approach used in inquiry based science education (IBSE);", "et": "- mõistab integreeritud õppe vajalikkust põhikooli astmes ning oskab seda uurimusliku õppeviisi rakendamisega saavutada;"}, {"en": "- to obtain skills in practical application of IBSE in its hierarchic structure;", "et": "- oskab rakendada uurimuslikku õpet selle hierarhilises ülesehituses ning looma ainetevahelisi seoseid"}, {"en": "- to understand the necessity of explaining phenomena in our surrounding and everyday life using knowledge and skills gained with inquiry learning;", "et": "- oskab uurimusliku õppe tundides omandatud teadmisi seostada ümbritseva keskkonna ning igapäevase elu nähtustega;"}, {"en": "- to analyze the ability of developing higher order cognitive skills in students by using inquiry based learning in science.", "et": "- oskab analüüsida uurimusliku õppe käigus omandatavate oskuste ja teadmiste olulisust õpilaste kõrgemat järku tunnetuslike oskuste kujunemisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}