{"uuid": "328d3697-67b1-e832-7ebd-a1955c62c884", "code": "HTOS.02.260", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching English to Young Learners II", "et": "Inglise keele didaktika esimeses ja teises kooliastmes II"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course continues the preparation of students for teaching English on the two first schools tages. The topics include: teaching grammar and pronunciation, integrating English with other subjects, project work, testing, error correction, using songs and technology in lessons, etc.", "et": "Praktilist laadi kursuse käigus jätkatakse üliõpilaste ettevalmistust inglise keele õpetamiseks I-II kooliastmes. Kursuse jooksul käsitletakse järgmisi teemasid: grammatika ja häälduse õpetamine, inglise keele lõimimine teiste õppeainetega, projektitöö, testimine ja vigade parandamine, laulude ja tehnoloogia kasutamine inglise keele tunnis jms."}, "objectives": [{"en": "To continue providing students with didactic skills for teaching English on the first two school stages.", "et": "Jätkata üliõpilastele ainedidaktilise ettevalmistuse andmist õpetamaks inglise keelt I ja II kooliastmes."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Õppeaine läbinud üliõpilane: "}, {"en": "- knows and uses the terminology of ELT methodology as well as the theoretical principles related to the topics discussed;", "et": "- tunneb ja kasutab inglise keele didaktikaga seotud põhiterminoloogiat ja teoreetilisi põhimõtteid ainekursusel käsitletavate teemade osas;"}, {"en": "- knows and can use methodological techniques, including those related to using digital technology, for teaching English at primary level within the range of topics discussed;", "et": "- tunneb ja oskab kasutada metoodilisi võtteid, sh digitehnoloogilisi, ainekursusel käsitletavate valdkondade piires õpetamaks inglise keelt I-II kooliastmes;"}, {"en": "- has an overview of the main principles and techniques of foreign language teaching methods;", "et": "- omab ülevaadet võõrkeele õpetamise meetodite põhiprintsiipidest ja võtetest;"}, {"en": "- designs a test and an assessment scale for primary school students in order to assess their English knowledge and skills;", "et": "- koostab kontrolltöö ja hindamisskaala I-II kooliastme õpilaste inglise keele teadmiste ja oskuste hindamiseks;"}, {"en": "- designs an activity that is based on project work, digital technology and/or integration between subjects for teaching English at the primary level;", "et": "- koostab projektitööle, digitehnoloogiale ja/või ainete omavahelisele lõimingule toetuvat tegevust õpetamaks inglise keelt I ja II kooliastmes;"}, {"en": "- analyses their own as well as fellow-students' homework.", "et": "- analüüsib enda ja kaasüliõpilaste koduseid töid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}