{"uuid": "e129786c-452b-ad21-cf50-fb9c8b08e558", "code": "HTOS.02.077", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Literature for Children", "et": "Eesti lastekirjandus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course includes the following topics: Estonian folklore and ealier school literature; Estonian children's literature and the development of critical thought; Estonian children's poetry, modern children's literature.", "et": "Õppeaine hõlmab järgmisi teemasid: eesti lasteluule, eesti folkloor, eesti lasteproosa klassika, uuem eesti lasteproosa, eesti lastenäidend, lastejakirjad ja lastekirjanduse kriitika."}, "objectives": [{"en": "To provide knowledge of the history, theory and classics of Estonian children's literature necessary for teaching at primary school. To foster students' understanding of a child's emotinal world with the help of children's literature.", "et": "Üldeesmärgiks on anda ülevaade eesti lastekirjanduse ajaloost, teooriast ja lastekirjanduse klassikast kindlustamaks lastekirjanduse tundmine  põhikooli I ja II  astme õppeainete õpetamiseks ja lapse tundemaailma ning käitumise mõistmiseks kirjanduskogemuse varal."}], "learning_outcomes": [{"en": "By the end of the course a student will have basic knowledge of Estonian literature and the theory of children's literature; analyses literary works and is able to espress the results, is able to connect literature with real life contexts; can apply acquired knowledge in teaching different subjects and extra-curricular activities.", "et": "Õppeaine läbinud üliõpilane:\n- omab erialaseid baasteadmisi eesti lastekirjandusest ja lastekirjanduse teooriast;\n- analüüsib iseseisvalt kirjandusteoseid, valdab kirjalikku ja suulist eneseväljendust ning seostab kirjandust reaalelulise kontekstiga;\n- rakendab saadud teadmisi põhikooli I ja II kooliastme õppeainete (lugemine-kirjutamine, inimeseõpetus, kirjandus) õpetamisel ning klassivälises tegevuses."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}