{"uuid": "cd1e4310-612d-2325-61c9-020c71562d7a", "code": "HTOS.02.487", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Academic Writing", "et": "Akadeemilise kirjutamise alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will give an overview of the structure and organisation of different educational texts. Students will learn how to search scientific literature, define terms and structure the material; use correct APA referencing; use correct terminolgy used in preschool and primary education; write an introduction. Theory is supported by practical assignments. Analysis of  various texts (scientific articles, students' theses). Independent work includes working with  electronic materials.", "et": "Kursusel antakse ülevaade erinevate haridusalaste teadustekstide struktuurist ja kompositsioonist; õpetatakse otsima erialakirjandust; defineerima, materjali struktureerima; nõuetekohaselt APA süsteemis viitama; kasutama korrektselt erialaseid (eelkõige alus- ja alghariduses kasutatavaid) termineid ning koostama sissejuhatust. Teoreetilist materjali  toetatakse näidete, praktiliste harjutuste ja nõuannetega alus- ja alghariduse teemalistest teadustöödest. Seminarides analüüsitakse valdkondlikke teadusartikleid, näiteid üliõpilaste bakalaureuse- ja magistritöödest, praktikumides sooritatakse teemakohaseid harjutusi. Iseseisva tööna täidetakse elektroonilisi sisupakette."}, "objectives": [{"en": "The aim of the course is develop student' academic writing skills in their field of specialisation as well as prepare them to compile scientific texts", "et": "Kujundada valdkonnaspetsiifilistes õpingutes vajamineva akadeemilise kirjutamise põhioskus, valmistamaks üliõpilasi ette kirjutama erialateemalisi teadustekste"}], "learning_outcomes": [{"en": "Upon completion of the course students should recognise the conventions of academic writing and be able to express themselves accordingly; have acquired theory and practice of creating academic texts; be able to find information from relevant data bases; write an introduction and abstract, use correct APA referencing and be able to write/format a course paper, bachelor's or master's thesis in APA style.", "et": "Õppeaine läbinud üliõpilane järgib sotsiaalvaldkonnas tunnustatud  akadeemilise kirjutamise tavasid ning oskab väljendada end mõistetavalt erialases teaduskeeles. Ta on omandanud haridusalaste teadustekstide koostamise sisulised ja kompositsioonilised normid; oskab valida infot oma eriala andmebaasidest; kirjutada nõuetekohast sissejuhatust ja resümeed; kasutada korrektset APA viitamist ning on võimeline kirjutama/ vormistama seminari-, bakalaureuse- või magistritööd, lähtudes APA standarditest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}