{"uuid": "11d4e447-930f-a377-3602-c6255ad05948", "code": "HTOS.02.235", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Biological Diversity I", "et": "Elu mitmekesisus I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course gives an overview of plants, algae, lichen and mushrooms, their structures, system, biology, adaptation and spread. Practical sessions introduce groups of plants, mushrooms, lichen and their most well-known representatives.", "et": "Kursus annab ülevaate taimedest, vetikatest, samblikest ja seentest, nende ehitusplaanidest, süsteemist, bioloogiast, kohastumustest ja levikust. Praktikumides tutvustatakse taimerühmi, seeni, samblikke, vetikaid ning nende tuntumaid esindajaid."}, "objectives": [{"en": "To give botanical knowledge and skills which are necessary for teaching Nature Studies as well as for practical work at the  first and second school stages and  pre-school.", "et": "Botaanikaalaste teadmiste ja oskuste kujundamine, mis on vajalikud loodusõpetuse õpetamiseks I ja II kooliastmes ja koolieelses lasteasutuses. Praktiliste tööde läbiviimiseks vajalike oskuste ja vilumuste kujundamine."}], "learning_outcomes": [{"en": "A student who has taken the subject will have  knowledge of the plant kingdom; know how to notice and solve botany-related problems in Nature Studies; have an overview of algae, lichen, mushrooms; know how to apply acquired knowledge in  teaching Nature Studies; know how to carry out practical work.", "et": "Aine läbinu tunneb taimeriigi süsteemi ja selle mitmekesisust; oskab märgata ja lahendada loodusteaduslikke probleeme, mis on seotud botaanikaga; omab ülevaadet vetikatest, samblikest, seentest; oskab kasutada kursusel omandatud teadmisi loodusõpetuse õpetamisel; oskab läbi viia praktilisi töid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}