{"uuid": "a1b79f78-e73b-c8b0-d0e4-6303f2f6328f", "code": "HTOS.02.503", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Modern Estonian", "et": "Kaasaegne eesti keel"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Much attention is paid to distinct articulation in the course, students are taught to identify the length of sounds and sounds in combination, listen to and correctly pronounce word duration. The problematic areas in Estonian orthography which might give rise to mistakes are treated and new standards in spelling are introduced. In the second term parts of speech as well as declination and conjugation are introduced, rules for writing words separately and together are discussed, punctuation in different sentence types is treated.", "et": "Kursusel juhitakse tähelepanu eesti keele häälikute täpsetele häälduskohtadele, õpetatakse eristama häälikute ja häälikuühendite pikkusi, kuulama ja õigesti hääldama sõnaväldet. Käsitletakse veaohtlikke valdkondi eesti ortograafias ja tutvustatakse uuendusi õigekirjutuses. Teisel semestril tutvutakse sõnaliikidega; antakse ülevaade sõnade muutmisest (käänamine ja pööramine),  kokku-lahkukirjutamisest  ja kirjavahemärkide kasutamisest erinevates lausetüüpides. Keskendutakse probleemsetele valdkondadele sõnade käänamisel ja pööramisel ning kirjavahemärkide kasutamisel."}, "objectives": [{"en": "To develop students' understanding of orthoepy, orthography, morphology and syntax of the Estonian language as well as students' grammar use and knowledge of writing words separately or together by linking theoretical knowledge with preschool education and didactics of school stage I.", "et": "Kujundada terviklik arusaam õigekeelsusest, ühendades teoreetilised teadmised alushariduse ja esimese kooliastme didaktikaga."}], "learning_outcomes": [{"en": "As a result of the course the student speaks Estonian grammatically correctly, pronounces all sounds and sounds in combination distinctly, uses spelling rules, applies different forms of declinable words and verbs correctly, uses appropriate spelling rules, uses correctly punctuation in different sentence types, knows basic problem areas in teaching the Estonian language and can take knowledge gained into consideration in his/her future job as a teacher.", "et": "Aine läbinud üliõpilane oskab ise õigesti ja puhtalt hääldada eesti keele kõiki häälikuid ja  häälikuühendeid ning eristab neid pikkuse järgi; oskab praktiliselt kasutada  eesti õigekirja põhireegleid ning tuntumaid võõrsõnu; kasutab õigesti  veaohtlike käänd- ja tegusõnade erinevaid vorme; oskab rakendada kokku- ja lahkukirjutamise reegleid; kasutab õigeid kirjavahemärke erinevates lausetüüpides; oskab kasutada virtuaalseid õigekeelsusallikaid; tunneb eesti keele alus- ja algõpetuse põhilisi probleeme ja oskab neid oma tulevases töös arvestada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}