{"uuid": "ddd97d3d-d7a8-fea8-f7b8-56667148b76f", "code": "HTOS.02.254", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Developing Writing Skills", "et": "Kirjaliku väljendusoskuse arendamine"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Writing different texts (description, short story, letters, essay, poems). Text organisation. Commonly misspelt words. Punctuation. Analysing and practising different writing tasks which are suitable for basic school students.", "et": "Kursusel antakse praktilisete ülesannete läbi ülevaade erinevate kirjalike tekstide sõnavarast, struktuurist ja stiilist. Tähelepanu pööratakse nii teksti organiseerimise võtetele, õigekirjale, sh veaohtlikele sõnadele) kui ka  kirjavahemärkide kasutamisele. Analüüsitakse  ja praktiseeritakse erinevaid kirjutamisülesandeid, mis on sobilikud kasutamiseks põhikooli esimeses, teises ja kolmandas kooliastmes."}, "objectives": [{"en": "The aim of the course is to teach students to write and analyse different texts as well as enlarge their vocabulary and develop stylistic skills. To give students ideas how to use different  writing activities in English lessons at basic school.", "et": "Õpetada kirjutama ja analüüsima erinevaid tekste ning rikastada üliõpilaste sõnavara ja stiili. Anda juhiseid ja soovitusi erinevate kirjutamisülesannete kasutamiseks I, II ja III kooliastmes."}], "learning_outcomes": [{"en": "After completing the course a student will know the main features of different texts (description, a short story, essay, report); analyse the style and vocabulary of dig'fferent texts and pay attention to their specific features;  creates different texts, using appropriate vocabulary and style; be able to teach the writing of different texts to primary school children; know the main rules of punctuation and use them correctly; know the spelling of difficult words and be able to correct them; analyse tasks written by their peers.", "et": "Õppeaine edukalt läbinud üliõpilane tunneb erinevate tekstide tunnusjooni (kirjeldus, jutuke, essee, referaat jne);  analüüsib erinevas stiilis tekste ja pöörab tähelepanu nende eripäradele; koostab erinevaid tekste, kasutades vastavalt tekstiliigile sobivat sõnavara ja stiili; oskab sobilikke töövõtteid kasutades õpetada erinevate tekstide koostamist nooremas kooliastmes; teab kirjavahemärkide kasutamise põhireegleid ja kasutab neid õigesti; teab veaohtlikke sõnu ning märkab vigu; analüüsib kaasüliõpilaste töid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}