{"uuid": "cb95e41b-7192-c5da-46fb-d0538888d48a", "code": "HVAJ.06.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Historical Imagology", "et": "Ajaloo imagoloogia"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ06", "structural_unit_name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course deals with the racial and national/ethnic stereotypes and discusses their formation during the history. The course concentrates especially to the period from the 18th century up to the first half of the 20th century. After a general introduction of the theoretical issues and the terminology, the issues of the Otherness and  prejudice are discussed. \nThe course consists of lectures, seminars and independent reading.", "et": "Kursus tutvustab imagoloogia uurimissuunda. Kursuse käigus tutvustatakse olulisemaid teooriaid ja käsitlusi, mis on seotud antud teemaga. Käsitletakse rahvusliku identiteedi küsimust, rassiteooria ja  eugeenika kujunemist, samuti etniliste vähemuste vastast poliitikat. Massimeedia ja stereotüübid. Muuhulgas keskendutakse propaganda teooriale ja vaenlase kuvandi loomise protsessile."}, "objectives": [{"en": "The main purpose of the course is to give an overview  of the formation of the ethnic  prejudice and stereotypes and its influence to  history.", "et": "Kursuse eesmärk on anda ülevaade etniliste stereotüüpide kujunemisest ning nende mõjust ajaloole. Samuti käsitletakse vaenlase kuvandi ja propaganda temaatikat.  Kursuse keskseteks mõisteteks on identiteet, kuvand, stereotüüp."}], "learning_outcomes": [{"en": "Student has an overview of the historical develpoments  and processes of history, knows thoroughly various theoretical conceptions. Is able to present his/her views in the form of scientific discussion or essay.", "et": "Üliõpilane omandab ülevaate ajaloo arengutest ja protsessidest, tunneb põhjalikult erinevaid teooriaid ning suudab esitada oma seisukohti nii väitluses kui ka teadusliku essee vormis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}