{"uuid": "0873a346-cc30-d9cd-f21d-e2155881e43c", "code": "HVAJ.03.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Nationalism and National Movements in the Eastern Baltic Littoral (from the Late 18th Century to the World War I)", "et": "Rahvuslus ja rahvuslikud liikumised Läänemeremaades (18. sajandi lõpust Esimese maailmasõjani)"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ03", "structural_unit_name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ03", "name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "phone": "+372 737 5650", "address": "Jakobi 2 - 220, 231\nEST", "street": "Jakobi 2 - 220, 231", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course presents the concepts of nationalism and national movements in the eastern Baltic region and treats its influence on the development of society and culture from the late 18th century until World War I. The course will focus on the similarities and differences on Poland and Lithuania on one hand and Estonia and Latvia on the other. The former territories were Roman Catholic and had previous experience of independent statehood; the latter ones were provinces of foreign powers, sharing Lutheran cultural tradition. The whole region belonged to the Russian Empire.", "et": "Kursus käsitleb rahvusluse ja rahvusliku liikumise mõisteid ning praktikat 18. sajandi lõpust kuni I maailmasõjani, võttes lähema vaatluse alla katoliikliku taustaga ja iseseisvat riiklust omanud ning omavahel seotud Poola ja Leedu ning luterliku taustaga ning varem naaberriikide provintside staatuses olnud Eesti ja Läti, mis vaadeldaval ajavahemikul kuulusid kõik Vene impeeriumi koosseisu."}, "objectives": [{"en": "The aim of the course is to develop the understanding of the problems of nationalism and national movements in the eastern Baltic littoral", "et": "Edendada üliõpilastes arusaamist rahvusluse ja rahvusliku liikumise probleemidest Läänemere regioonis"}], "learning_outcomes": [{"en": "The student acquires systematic and comprehensive knowledge about the influence of nationalism on the development of society and culture from the late 18th century until World War I on the example of four countries of the eastern Baltic region (today's Estonia, Latvia, Lithuania and Poland). Knowledge about these developments will promote the understanding of the history of these countries and nationalities.", "et": "Üliõpilane saab süstemaatilisi ja mitmekülgseid teadmisi rahvusluse mõjust ühiskonna ja kultuuri arengule 18. sajandi lõpust kuni I maailmasõja alguseni nelja Läänemere piirkonna (Eesti, Läti, Leedu a Poola) näitel. Teadmised sellest aitavad paremini mõista nii Eesti kui ka ajalooliselt temaga seotud naaberpiirkondade ja rahvaste ajalugu."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}