{"uuid": "d4ad03c9-208a-2bff-10ed-fb0aee212f44", "code": "HVAJ.05.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Art from the National Awakening Period to 1918", "et": "Eesti kunst ärkamisajast kuni 1940. aastani"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ05", "structural_unit_name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ05", "name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "phone": "+372 737 5655", "address": "Ülikooli 18 - 024\nEST", "street": "Ülikooli 18 - 024", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "With the help of abundant visual materials, the work of the artists that were active in  from  the National Awakening Period to 1940 will be examined, along with the stylistic schools and ideas that developed against this background. The work of the Estonian artists will be placed in the context of contemporary European art and attention will be paid to external contacts and influences. The positioning of the art in relation to the local cultural and political-economic developments will also be covered, and a survey will be provided of the formation of the institutions that organised the national art scene.", "et": "Rohke visuaalse materjali abil vaadeldakse käsitletaval perioodil Eestis tegutsenud kunstnike loomingut, tekkinud stiililisi koolkondi ning ideid nende taustal. Eesti kunstnike looming asetatakse kaasaegse Euroopa kunsti konteksti ning pööratakse tähelepanu kunsti välissidemetele ning välismõjudele. Käsitlemata ei jäeta kunsti positsioneerumist siinsete üldkultuuriliste ja poliitilismajanduslike arengute suhtes ning ülevaade antakse ka rahvuslikku kunstielu korraldavate institutsioonide väljakujunemisest."}, "objectives": [{"en": "To provide an overview of the art processes and work of artists in Estonia from the National Awakening Period to 1940.", "et": "Anda ülevaade kunstiprotsessidest ja kunstnike loomingust Eestis rahvuslikust ärkamisajast kuni 1940. aastani."}], "learning_outcomes": [{"en": "A student that completes the course:\n- will be very familiar with the work of the artists and most important architects active in Estonian during this period; and the prevalent schools, styles, and artistic ideas;\n- will be familiar with the art policy and institutional base of Estonian art and the developmental history of the art scene;\n- will know how to place the Estonian art of this period into the context of European art;\n- will be familiar with the influence vector that has affected Estonian art from the outside and will know how to detect these influences in the works of art;\n- will know how to see the work of Estonian artists in the context of contemporary cultural and political-economic development.", "et": "Kursuse läbinud üliõpilane:\n-tunneb käsitletaval perioodil Eestis tegutsenud kunstnike ja\nolulisemate arhitektide loomingut, selle koolkondlikku ja stiililist\njagunemist ning kunstilisi ideid;\n-on tuttav Eesti kunsti kunstipoliitilise ja institutsionaalse baasi ning\nkunstielu kujunemise looga;\n-oskab vaadeldava perioodi Eesti kunsti paigutada Euroopa kunsti konteksti,\ntunneb Eesti kunsti väljastpoolt mõjutanud mõjuvektoreid, oskab mõjutusi\nteostes tähele panna;\n-mõistab näha Eesti kunstnike loomingut kaasaegsete üldkultuuriliste ja\npoliitilis-majanduslike arengute kontekstis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}