{"uuid": "cb0f6fcc-b33d-ce47-3e79-df969637d881", "code": "HVAJ.05.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of World Art from the Baroque to Romanticism", "et": "Üldine kunstiajalugu: kunst barokist romantismini"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ05", "structural_unit_name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ05", "name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "phone": "+372 737 5655", "address": "Ülikooli 18 - 024\nEST", "street": "Ülikooli 18 - 024", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will provide an overview of the diversity and contradictory nature of the art history of the Baroque period. It will deal with the influence and hybridisation of various styles, and highlight the differences between the works of art from various centres and countries.  Along with the Classicism engendered by Andrea Palladio and its repercussions, the course also examines Roman Baroque and its reflections in Bohemian and Bavarian architecture, French Rationalism as the basis for the architectural language that developed in the 17th century, and the development of Rococo piquancy, as well as the Picturesque and Sublime in England. At the level of fine arts, the main emphasis is on the period between Mannerism and Romanticism, with attention focused on contradictory trends and individual themes: the differences between Caravaggio and the Caraccis; Flemish and Dutch painting; the Enlightenment and the Empire; the universal language of Classicism and the diverse art rhetoric of the 19th-century styles. Simultaneously with the top events in Europe, facts and issues related to the closer vicinity  - the art history of Estonia, the Baltics and Scandinavia - are also presented.", "et": "Kursus annab ülevaate barokiperioodist kunstiajaloos selle ja mitmekesisuses ja vastuolulises, käsitleb erinevate stiilide mõjusid ja ristumisi, toob esile erinevused erinevate keskuste ja maade kunstiloomingus. Andrea Palladiost lähtuva klassika ja selle järelmõjude kõrval on vaatluse all Rooma barokk ja selle reflektsioonid Böömi ja Baieri arhitektuuris, Prantsuse ratsionalism kui alus 17. sajandil formeerunud arhitektuurikeelele, rokokoo pikanterii ning Inglise pitoreski ja subliimse alge kujunemisele. Kujutava kunsti tasandil keskendutakse peamistele perioodidele manerismi ja romantismi vahel, fokusseerides aine esitamisel tähelepanu vastandlikele tendentsidele ja üksikteemadele: erinevustele Caravaggio ja Caraccide, Flaami ja Hollandi maalikunsti, valgustusajastu ja ampiiri, klassitsismi universaalse keele ja 19. sajandi stiilide mitmekesise kunstiretoorika vahel. Paralleelselt nn. tähtsündmustele Euroopas esitletakse fakte ja probleeme ka lähemast ringist - Eesti, Baltimaade ja Skandinaavia kunstiajaloo vallast."}, "objectives": [{"en": "The course provides an overview of the most important trends in European art history from the 16th to the 19th century.", "et": "Kursus annab ülevaate olulisematest tendentsidest Euroopa kunstiajaloos 16-19. Sajandil."}], "learning_outcomes": [{"en": "A student that completes the course: ", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- will have an overview of Western European art from the late Baroque to Impressionism; ", "et": "-omab ülevaadet Lääne Euroopa kunstist ajavahemikul hilisbarokist impressionismini; "}, {"en": "- will be familiar with the work of the most outstanding artists and architects of the period; ", "et": "-tunneb ajastu väljapaistvamate kunstnike ja arhitektide loomingut ja teoseid;"}, {"en": "- in addition to understanding the art, will also be able to speak and write about it.", "et": "-on võimeline kunsti mõistmise kõrval ka sellest kõnelema ja kirjutama."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}