{"uuid": "8a15869b-ba80-be0e-ac02-bc5cb2ee587f", "code": "HVAJ.06.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Cold War", "et": "Külm sõda"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ06", "structural_unit_name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course discusses the main events and key problems of international relations during the era of the Cold War. It analyses military strategy, ideology, propaganda and public diplomacy, diplomacy, summitry, the activities of special services, international organizations, European integration, main turning points in global politics and the development of international law.", "et": "Aine käsitleb külma sõja-aegsete rahvusvahelise suhete peamisi sündmusi ja sõlmprobleeme, ning analüüsib ajastule iseloomulikku sõjalist strateegiat, ideoloogiat, propagandat ja avalikku diplomaatiat, diplomaatiat, tippkohtumisi ja eriteenistuste tegevust, rahvusvahelisi organisatsioone, Euroopa integratsiooni, peamisi globaalseid välispoliitilisi murranguid ning rahvusvahelise õiguse arengut."}, "objectives": [{"en": "The objective is to study the era of the Cold War in international relations, tracing the developments in military strategy, ideology and propaganda, diplomacy and secret services, European integration, international organisations and international law.", "et": "Aine eesmärgiks on õppida tundma külma sõja ajastut rahvusvahelistes suhetes, käsitledes sõjalise strateegia, ideoloogia ja propaganda, diplomaatia ja eriteenistuste, Euroopa integratsiooni ning rahvusvaheliste organisatsioonide ja rahvusvahelise õigusega seotud probleeme."}], "learning_outcomes": [{"en": "1. The student knows the main events and turning points in the international history of the Cold War.", "et": "1. Üliõpilane tunneb külma sõja ajaloo peamisi rahvusvahelise poliitika sündmusi ja pöördepunkte."}, {"en": "2. The student is able to characterize international relations in the Cold War era.", "et": "2. Üliõpilane oskab iseloomustada külma sõja-aegseid rahvusvahelisi suhteid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}