{"uuid": "46b150bd-fc91-deb9-ec02-514ad12c2249", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-06T18:49:36", "title": {"en": "The Third Reich and the Second World War", "et": "III Reich ja Teine maailmasõda"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 A regular HV", "et": "24/25 S PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ06", "structural_unit_name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The history of the Third Reich is dealt with from different perspectives, from political history until evryday life. The Second World War brought enormous social, political and economic changes and was together with the First World War the most important event in European contemporary history.", "et": "III Reich'i ajalugu käsitletakse mitmest perspektiividest nii sotsiaalmajandusliku, poliitilise kui ka argipäeva elu vaatevinklist. Teine maailmasõda tõi enesega kaasa kaugeleulatuvaid sotsiaalseid, poliitilisi ja majanduslikke muudatusi ning tekitas koos Esimese maailmasõjaga sügavaima lõhe Euroopa lähiajaloos."}, "objectives": [{"en": "An overview of the history of the Third Reich and the Second World War in Europe.", "et": "Ülevaate andmine III Reichi ja Teise maailmasõja ajaloost Euroopas."}], "learning_outcomes": [{"en": "The students \n- understand the main lines of development of the Third Reich and the Second World War \n- are able to assess the central questions of research critically", "et": "- Üliõpilased tunnevad olulisemates üldjoontes III Reichi ja Teise maailmasõja arenguid \n- Üliõpilased on võimelised keskseid uurimisteemasid kriitiliselt hindama"}], "notes": {"et": "2024/2025. ÕPPEAASTAL LOENGUID EI TOIMU!"}}, "grading": {"independent_work": {"et": "Kohustusliku kirjanduse lugemine, valikuliselt soovitusliku kirjanduse läbi töötamine ja ettevalmistused eksamiks."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik eksam\nKodutöö: 10-12 lk tekst, TNR 12/1,5, viited"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "E (lävend): üliõpilane demonstreerib kodutöös, et on kursis kursuse käigus käsitletud teemadega, tunneb peamisi probleeme ning oskab oma teemat üldiselt analüüsida.\nD (rahuldav): üliõpilane kasutab kodutöös õigesti kursuse käigus käsitletud peamisi mõisteid, tunneb peamisi probleeme ning oskab oma teemat rahuldaval tasemel analüüsida.\nC (hea): üliõpilane oskab kodutöös rakendada käsitletud mõisteid, tunneb hästi käsitletud probleeme ja kirjanduses kajastatud vaidlusi ning argumentide struktuuri, näitab heal tasemel oma teema oskusi, esineda võib väheolulisi vigu.\nB (väga hea): üliõpilane oskab kodutöös hästi rakendada kursusel käsitletud mõisteid, tunneb põhjalikult käsitletud probleeme ja kirjanduses kajastatud vaidlusi ning argumentide struktuuri, oskab oma teemat edukalt analüüsida, võib esineda väheolulisi vigu.\nA (suurepärane): üliõpilane oskab kodutöös sujuvalt rakendada käsitletud mõisteid, üksikasjalikult käsitletud probleeme ja kirjanduses kajastatud vaidlusi ning valdab argumentide struktuuri, oma teema analüüsides näitab üles loovat ja uuenduslikku mõtlemist, võib esineda pisivigu."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "Kirjalik eksam (kodutöö 10-12 lk)"}, "debt_elimination": {"et": "Lühike essee kokkuleppel õppejõuga (5-6 lk)"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Weinberg, Gerhard L.; A World at Arms: A Global History of World War II, Cambrigde: Cambridge University Press, 1994", "recommended_materials": "'"}, "participants": {"lecturers": [{"person_uuid": "53fee63a-b1c9-d9bc-ca34-1eda12062758", "person_name": "Olaf Mertelsmann", "structural_unit": {"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Iseseisev töö individuaalse ajakava järgi"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus I\nAllikad. Teaduslik olukord. Teesid ja küsimused seoses Kolmanda Riigi iseloomuga: kas poliitika baseerus pikaajalisel plaanil või kohandati ta iga kord pragmaatiliselt vastavalt olukorrale? Kas Kolmas Riik oli konsensuse diktatuur? Kas oli tegemist moderniseeriva diktatuuriga? Kas Hitler oli tõepoolest kõikvõimas diktaator? Marksistlik interpretatsioon. Tänapäevased interpretatsioonimudelid. Totalitarismiteooria. Võrdlus stalinismiga. Seminari käigus tuleks otsida vastuseid neile küsimustele."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus II\nAllikad. Teaduslik olukord. Teesid ja küsimused seoses Teise maailmasõja iseloomuga. Sõja põhijooned. Millised olid sõja põhjused? Sõjaks valmistumine ja sõjaga kohanemine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Weimari Vabariigi häving ja natside võimule tulek \nHitleri teekond võimuni - kas see oli vältimatu? Natsionaalsotsialistliku võimuhaaramise põhjused. Olemasoleva riigi institutsionaalsed ümberkorraldused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ideoloogia, riik ja partei, Hitler\nAdolf Hitleri \"Mein Kampf\". Natsionaalsotsialistliku ideoloogia iseloom. Geopoliitika. Rassism. Antisemitism. Sotsiaaldarwinism. Vaenlaskujud. Maailmapilt. Süstemaatilise vormi\"kahepalgelisus\" (Fraenkel). Kurjuse banaalsus (Arendt). Funktsionalistlik interpretatsioon. Füüreri kasuks töötamine (Kershaw). Diktaatori biograafia. Eluviis ja valitsemisstiil. Saavutuselt saavutuseni. Sõjaõnne pöördumine ja järk-järguline langus. Hitleri roll süsteemis. Karismaatiline valitsemine (Weber). Radikaliseerumine sõja jooksul."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Saksa ühiskond enne sõda, kultuur ja haridus\nKohandumine, kaasajooksiklus ja massiline toetus. Teistsuguste välistamine ühiskonnast. Ühiskondlik muutumine. Süsteemi populaarsuse põhjused. Natsionaalsotsialism - Saksa ajaloo loogiline jätk või modernse ühiskonna \"tööõnnetus\"? Tsensuur. Haridussfäär. Kultuuripoliitika. Kolmanda Riigi ilus välimus. Kultuuriline pluralism diktatuuris."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Teekond sõjani ja sõja puhkemine\nSituatsioon Euroopas. Välispoliitiline areng. Versailles' rahulepingu pärand. Ekspansiivsed diktatuurid. Majanduslik sõjaks valmistumine. Rahva meeleolud. Molotov-Ribbentropi pakt sõja eeltingimusena. Lääneliitlaste reaktsioon. Poola vallutamine välksõjana."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sõda Läänes\nVälksõda. Saksa võimuala laienemine. Hitleri esimene kaotus: õhulahing Inglismaa pärast. Militaarsete kordaminekute põhjused. Uued strateegiad. Piiratud ressursid. Relvastustoodangu võidujooks."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sõda Idas\nJugoslaavia sõjakäik. Hävitussõda. Ideoloogiliselt mõjutatud sõjapidamine. Operatsioon \"Barbarossa\". Kallaletung Nõukogude Liidule polnud preventiivsõda. Nõukogude Liidu rünnaku ebaõnnestumise põhjused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Õhu- ja meresõda\nMaterjalilahing ja kõrgtehnoloogia. Tsiviilohvrid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Okupatsiooni erinevad mudelid Idas ja Läänes. Kollaboratsioon, kooperatsioon ja vastupanu. Okupatsioonirežiimide erinevad liigid. Rüüstamine ja massihävitamine. Eesti näide. Ideoloogia mõju okupatsioonipoliitikale. Okupatsiooni edu faktorid Läänes ja ebaedu faktorid Idas. Kollaboratsiooni põhjuseid. Piir mõtteka koostöö ja kollaboratsiooni vahel. Poliitiline vastupanu. Militaarne opositsioon. Atentaat Hitlerile. Partisanivõitlus. Vastupanu Taanis, Norras ja okupeeritud Nõukogude Liidus. Aktiivne ja passiivne vastupanu. Põhjused, miks enamik sakslasi režiimi lõpuni toetas."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Terrorisüsteem\na. süüdlased\nSS, Gestaapo, SD, eriväeosad. Politseipataljon 101 näitena. Süüdlasprofiil. Üksikute operatsioonida käik. Põhjuseid, miks võeti kuritegudest osa. Paljud süüdlased olid täiesti tavalised mehed (Browning). Riiklikud kuriteod ja massimõrvad 20. sajandi ilminguna.\nb. ohvrid\nEutanaasia massigaasitamise katsetusena. Mustlaste saatus. Wannseekonverents. Juudid ohvritena. Holokaust. Antisemitism. Irratsionaalsete massimõrvade põhjused. Oletatav ohvrite arv.\nc. Sõjategevuse ja massikuritegude seosed. Brutaliseerumine. Vägivalla põhjused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kohaliku rinde mobiliseerimine, ühiskondlikud muudatused, sõjaaegne majandus\nTerve ühiskond sõjas. Erinevad mobiliseerimisstrateegiad. \"Totaalne sõda\". Sõda muudatuste käivitajana. Planeeritud ja planeerimata muudatused. Kohanemine ja inerts. Rahuaja ja sõjamajandus. Plaani- ja käsumajandus. Majanduse mobiliseerimine. Efektiivsus ja sõja kasumlikkus? Põllumajandus. Okupatsioonimajandus - edukus ja ebaedukus. Tööstus. Turumajanduse jätkumine riikliku poliitika dirigistlikes raamides. Tooraine küsimus. Tehnoloogiline moderniseerumine. Sõjamajandus ja hilisem saksa majandusime."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Neutraalsed riigid, Euroopa diplomaatia\nSõja tagajärjed. Neutraalsus või pragmaatiline kooperatsioon? Sõjaaegsed rahvusvahelised suhted. Militaarsete huvide esikohale asetamine? Suured konverentsid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sõjajärgsed plaanid\nErinevad arusaamad taastustöödest ja sõja eesmärkidest. Sotsialism, rassistlik diktatuur või demokraatia."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sõja lõpp ja lõppdiskussioon\nVõitlus kibeda lõpuni. Kokkuvarisemine. Sõja tagajärjed. Sakslaste massiline pagendamine Ida-Euroopast. Võitjavõimude konverentsid. Nürnbergi protsess. Kolmas Riik sakslaste kollektiivses mälus. Diktatuuri pärandiga ümber käimine. Kas Külm sõda oli juba ette planeeritud? Võitjate okupatsioonirežiimid."}}]}, "registration_info": {"audience": {"et": "Uusima aja erialamoodul (alates 2021/2022 õppekava versioonist)"}, "min_students": 3}, "parent_uuid": "0cbc466e-19ad-46a3-29c6-07b5e5b47117", "parent_code": "HVAJ.06.020", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}