{"uuid": "2e480cd7-2526-de94-1cc5-10548f9e387c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-27T20:41:09", "title": {"en": "Historical Imagology", "et": "Ajaloo imagoloogia"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 A regular HV", "et": "24/25 S PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ06", "structural_unit_name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 12, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course deals with the racial and national/ethnic stereotypes and discusses their formation during the history. The course concentrates especially to the period from the 18th century up to the first half of the 20th century. After a general introduction of the theoretical issues and the terminology, the issues of the Otherness and  prejudice are discussed. \nThe course consists of lectures, seminars and independent reading.", "et": "Kursus tutvustab imagoloogia uurimissuunda. Kursuse käigus tutvustatakse olulisemaid teooriaid ja käsitlusi, mis on seotud antud teemaga. Käsitletakse rahvusliku identiteedi küsimust, rassiteooria ja  eugeenika kujunemist, samuti etniliste vähemuste vastast poliitikat. Massimeedia ja stereotüübid. Muuhulgas keskendutakse propaganda teooriale ja vaenlase kuvandi loomise protsessile."}, "objectives": [{"en": "The main purpose of the course is to give an overview  of the formation of the ethnic  prejudice and stereotypes and its influence to  history.", "et": "Kursuse eesmärk on anda ülevaade etniliste stereotüüpide kujunemisest ning nende mõjust ajaloole. Samuti käsitletakse vaenlase kuvandi ja propaganda temaatikat.  Kursuse keskseteks mõisteteks on identiteet, kuvand, stereotüüp."}], "learning_outcomes": [{"en": "Student has an overview of the historical develpoments  and processes of history, knows thoroughly various theoretical conceptions. Is able to present his/her views in the form of scientific discussion or essay.", "et": "Üliõpilane omandab ülevaate ajaloo arengutest ja protsessidest, tunneb põhjalikult erinevaid teooriaid ning suudab esitada oma seisukohti nii väitluses kui ka teadusliku essee vormis."}], "notes": {}}, "grading": {"independent_work": {"et": "Lugeda läbi kohustuslik kirjandus, osaleda seminarides ja kirjutada kodutööna teaduslik essee. Vt lähemalt Moodle õpikeskkonnas. \n\nEssee teemad (teemasid võib kitsendada):\n1.\tKumb tsivilisatsioon on parem - kas ohverdav või tappev? \n(Vt. Tzvetan Todorovi raamatu \"Ameerika vallutamine. Teise probleem\". Tallinn: Varrak 2001).\n2.\tHirm ja eelarvamus  ajaloos. \n(Vt. Juri Lotmani essee Nõiajaht. Hirmu semiootika //  Hirm ja segadus. Esseid kultuurisemiootikast. Tallinn: Varrak, 2007, lk. 50-68 ).\n3.\tVaenlase kuvand  ja propaganda.\n4.\tRahvusliku identiteedi küsimusest.\n5.\t\"Võõra\" mõiste käsitlusest ajaloos.\n6.\tVabateema (kokkuleppel õppejõuga)."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Eksamihinde kujunemine: essee (60%), seminarides osalemine ja kohustuslik kirjandus (40%). Täpsem juhend esimeses loengus.\nEssee hindamiskriteeriumid: Hinne \"A\" - probleemiasutus on selge, tekst on isikupärane ja originaalne. Essee on hästi struktureeritud, tekst grammatiliselt korrektne, vormistus suurepärane sh viitamine süsteemne.\nHinne \"B\" - väljendab väga head arusaamist teemast. Teema käsitlus on paljusõnaline ja vajaks konkretiseerimist, arutlust on kerge jälgida, essee moodustab sidusa terviku. Grammatika on hea, viitamises ja vormistuse esineb üksikuid ebatäpsusi.\nHinne \"C\" - probleemiasetus ei ole piisavalt selge, argumentides võib esineda väikeseid loogikavigu, arutlust on teinekord raske jälgida. Tekstis esineb stiililisi vajakajäämisi. Vormistuses esineb ebatäpsusi.\nHinne \"D\" - rahuldav arusaamine teemast, puudub selge liigendus, esineb mõttekordusi jne. Esineb lõpetamata ja ebagrammatilisi lauseid. Vormistus on lohakas, viitamises esineb ebatäpsusi või mõni viide puudub.\nHinne \"E\" - arusaamine käsitletavast teemast on nõrk, esineb vasturääkivusi. Puudub sissejuhatus ja töö liigendusega on probleeme. Esineb rohkesti kirjavigu ja ebagrammatilisi lauseid. Vormistuses esineb märkimisväärseid puudusi.\nHinne \"F\" - on kirjutatud valitud teemast mööda. Tekstilõigud on seosetud, arutlust on raske jälgida. Argumente ei leidu, puudub kaitstav seisukoht. Sõnavara ja lauseehitus on algeline, esineb palju kirjavigu, stiil on akadeemilisele tööle sobimatu. Vormistus on täiesti ebakorrektne. Viited enamasti puuduvad."}}], "grade_preconditions": {"et": "Osavõtt seminaridest ja positiivne tulemus essee eest."}, "grade_evaluation": {"et": "Eksamihinne kujuneb seminaride ja essee põhjal. Lisaks suuline vestlus kohustusliku kirjanduse ja loengutes käsitletud teemadel.\nEssee tuleb üles laadida Moodle'is:"}, "debt_elimination": {"et": "Korduseksam."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "d1f1552d-f753-4f13-a7fe-de77b7ab1886", "type": "MOODLE", "code": "HVAJ.06.018", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Tzvetan Todorov. Ameerika vallutamine. Teise probleem. Tallinn: Varrak, 2001. Lk. 11-23, 47-67, 159-180.\nJuri Lotman. Nõiajaht. Hirmu semiootika. // Hirm ja segadus. Esseid kultuurisemiootikast. Tallinn: Varrak, 2007. Lk. 50-68.\nStephen Jay Gould. Vääriti mõõdetud inimene. Tallinn: Varrak, 2001. Lk. 64-111; 154-163.", "recommended_materials": "o Allport, G. W. The Nature of Prejudice. New York, 1958.\no Berger, D. History and Hate: The Dimensions of Anti-Semitism. Philadelphia, New York, Jerusalem, 1986.\no Boulding K. E. The Image: Knowledge in Life and Society. The University of Michi¬gan Press, 1973.\no Bukovsky, Vladimir. Poliitiline korrektsus ja kõlblus. // Akadeemia. 2009, nr. 12.\no Ellul, J. Propaganda. The Formation of Men's Attitudes. New York: Vintage Books, A Divison of Random House, 1973.\no Field, G. G. Evangelist of Race: The Germanic Vision of Houston Stewart Chamberlain. N. Y., 1981.\no Gould, S. J. Vääriti mõõdetud inimene. Varrak: 2001.\no Hall, C. Civilising subjects: Metropole and Colony in the English Imagination 1830-1867. Cambridge: Polity, 2007.\no Hiiemaa, K. Aafrika imago eestikeelses trükisõnas. Tartu: Tartu Ülikooli Kirjastus, 2009.\no Imagology: The cultural construction and literary representation of national characters. A critical survey. Edited by Manfred Beller and Joep Leerssen. Studia Imagologica 13. Amsterdam, New York: Rodopi, 2007.\no Imagology and Cross-cultural Encounters in History. Eds. K. Alenius, O. F. Fält, M. Mertaniemi. (Studia historica septentrionalia 56). Rovaniemi, 2008.\no Jääts, I. Valgevenelased XIX sajandi lõpus ja XX sajandil. - Akadeemia. 1995, nr.4\no Koivunen, L. Visualising the \"Dark Continent\": The Process of Illustrating Nineteenth-Century British Travel Accounts of Africa. Turku, 2006.\no Kurs, O. Sakslased Venemaal. - Akadeemia. 1993, nr.7.\no Kurs, O. Ingeri põliselanike saatus. - Akadeemia. 1990, nr.7.\no Lasswell, H. Propaganda Technique in the World War. London, 1927 (1971).\no Le Bon, G. Hulkade psühholoogia. // \"Loomingu Raamatukogu\" 1991/ 11-13.\no Leete, A. Põhjarahvad antiigist tänapäevani: obiugrilaste ja neenetsite kirjelduste muutumine. Tartu, 2000.\no Looking at the Other: Historical study of images in theory and practise. Eds. Kari Alenius, Olavi K. Fält & Seija Jalagin. Oulun Yliopisto: Oulu,2002. http://herkules.oulu.fi/isbn9514266331/isbn9514266331.pdf\no Lyman, S. M. The \"Yellow Peril\" Mystique: Origin and Vicissitudes of a Racist Discourse. // International Journal of Politics, Culture and Society. Vol. 13. No.4, Summer 2000. P. 683-747.\no Nederveen Pieterse, J. Racism and Stereotyping for Beginners. Dutch: 1994\no Oinas, F. J. Naabrid ja võõrad keeles ning rahvaluules. // Kalevipoeg kütkeis ja muid esseid rahvaluulest, mütoloogiast ja kirjandusest. Toronto, 1979. Lk. 114.\no Racial Discrimination and Ethnicity in European History. Ed. G. Hálfdanarson. Pisa, 2003.\no Hall, S. The Spectacle of the 'Other'. // Representation. Cultural Representations and Signifying Practices. Ed. by Stuart Hall. London, Thousand Oaks, New Delhi: SAGE Publication Ltd, 1997, pp. 223-290.\no Said, E. W. Orientalism. New York, 1978.\no Stadius, P. Southern Perspectives on the North: Legends, Stereotypes, Images and Models. Dansk-Berlin, 2001.\no Stepan, N. The Idea of Race in Science: Great Britain 1800-1960. The Macmillan Press LTD: London and Basingstoke, 1982.\no Zur, O. The Love of Hating: The Psychology of Enmity. // History of European Ideas. Vol. 13, No. 4, pp. 345-369, 1991.\no Taylor, P. M. Munitions of the Mind: A History of Propaganda from the Ancient World to the Present Day. Manchester University, 2003\no Theories of Race and Racism. A Reader. Ed. Les Back and John Solomos. London and New York, 2001.\nTsensuur ja propaganda Nõukogude Eestis. // Ajalooline Ajakiri, 4, 2018.\no Vampires Unstaked: National Images, Stereotypes and Myths in East Central Europe. Oxford, 1995.\no Veere, K. Eestlaste ja soomlaste stereotüüpide muutused 1990. aastatel. // Eesti ja eestlased võrdlev\nVeski, K. Kuidas kirjeldada elevanti. Manihheistlik Aafrika-käsitlus 19. sajandi misjonikirjanduses. // Vikerkaar, 7-8, 2019. Lk. 91-102."}, "participants": {"lecturers": [{"person_uuid": "cc009e03-b113-4105-27ee-de2f2b85bc89", "person_name": "Karin Veski", "structural_unit": {"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-2, 5-11, 13"}, "entries": [{"course_week": 1, "time": "2024-09-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 2, "time": "2024-09-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 5, "time": "2024-10-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 6, "time": "2024-10-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 7, "time": "2024-10-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 8, "time": "2024-10-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 9, "time": "2024-10-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 10, "time": "2024-11-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 11, "time": "2024-11-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 13, "time": "2024-11-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {}}]}, "registration_info": {"audience": {"et": "Uusima aja erialamoodul"}}, "parent_uuid": "cb95e41b-7192-c5da-46fb-d0538888d48a", "parent_code": "HVAJ.06.018", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}