{"uuid": "828b88ef-2879-ef01-62a4-9615e1ac0d8c", "code": "HVAJ.06.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Contemporary International Relations (Since the 1990s)", "et": "Nüüdisaja rahvusvahelised suhted (alates u. 1990)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ06", "structural_unit_name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "*The course focuses on the development of the post-Cold War international order, placing it in the context of earlier transformations in the international system. \n*It brings the perspectives of East-Central Europe, the Baltic States and the Nordic states into focus.\n*The objective is to offer the student background knowledge and the tools to think about the meanings of current international developments. Are we currently witnessing another tranformation in the international order?", "et": "* Õppeaine keskendub külma sõja-järgse maailmakorra kujunemise loole, asetades selle varasemate rahvusvahelise süsteemi murrangute taustale.\n* Fookuses on Ida-ja Kesk-Euroopa, Baltimaade ja Põhjala riikide perspektiiv.\n* Aine eesmärgiks on anda üliõpilasele teadmised ja vahendid arutlemaks tänapäeva rahvusvaheliste sündmuste tähenduse üle. Kas oleme tunnistajaks külma sõja-järgse maailmakorra kokkuvarisemisele ja uue ajastu algusele?"}, "objectives": [{"en": "The purpose of the course is to analyse and conceptualise basic events, developments and trends in contemporary international relations (since the end of the Cold War) from the perspective of the main schools of foreign-policy analysis and international relations theory.", "et": "Aine eesmärgiks on tutvuda nüüdiasaja (s-o alates külma sõja lõpust) rahvusvaheliste suhete peamiste sündmuste, arengute ja trendidega, analüüsides ja kontseptualiseerides neid välispoliitika analüüsi ja rahvusvaheliste suhete teooria peamistest koolkondadest lähtudes."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud üliõpilane"}, {"en": "-can describe the main events, developments and trends in contemporary international relations", "et": "- oskab kirjeldada nüüdiasja rahvusvaheliste suhete peamisi sündmusi, arenguid ja trende"}, {"en": "-knows and is able to use the main methods of Foreign Policy Analysis", "et": "- tunneb ja oskab kasutada välispoliitika analüüsi peamisi meetodeid"}, {"en": "-knows the main schools of the international relations theory", "et": "- tunneb peamisi nüüdisaegse rahvusvaheliste suhete teooria koolkondi"}, {"en": "-can analyse the main developements in international politics affecting the contemporary history of Estonia.", "et": "- oskab analüüsida Eesti lähiajalugu enim mõjutanud rahvusvahelise poliitika tegureid"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}