{"uuid": "352c0378-6f15-a244-3e40-d7c3bf4d07d8", "code": "HVAJ.00.008", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Historiography", "et": "Sissejuhatus ajalookirjutusse"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ", "structural_unit_name": {"en": "Institute of History and Archaeology", "et": "ajaloo ja arheoloogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ", "name": {"en": "Institute of History and Archaeology", "et": "ajaloo ja arheoloogia instituut"}, "email": "ajalugu@ut.ee", "phone": "+372 737 5651", "webpage_url": "https://ajalugu-arheoloogia.ut.ee", "address": "Jakobi 2\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course introduces history as a field of research, its main concepts, contemporary topics and currents and given an overview of current research in Estonia. It covers different types of texts the student will tackle in their studies with main focus on evaluation, analysis and writing of academic research texts and source criticism. The course will also include tips on study skills, internship placements, studying abroad and future career prospects.", "et": "Aine raames tutvustatakse ajalooteadust ja selle põhimõisteid ning antakse ülevaade Eestis täna tehtavast teadustööst ning põgus ülevaade ajalookirjutuse uuematest suundadest.\nTutvustatakse erinevaid tekstitüüpe, millega ajaloo üliõpilane oma õpingute jooksul ja edaspidi kokku puutub. Põhirõhk on allikakriitikal ja eri teadustekstide analüüsimisel, koostamisel ja hindamisel.\nLühidalt tutvustakse olulisemaid õpioskusi, praktika- ja välismaal õppimise võimalusi, tuleviku karjääriväljavaateid ning motivatsiooni- ja ametikirjade ning teadusliku CV koostamist"}, "objectives": [{"en": "1) To introduce students to specifics of historical research, methodology, new themes and currents in history. To provide an overview of research done in Estonia today. ", "et": "1) Tutvustada üliõpilasele ajalooteaduse eripärasid, uurimismeetodeid, valdkondi ja uuemaid suundi ning anda üliõpilasele ülevaade täna Eestis uuritavatest uurimisteemadest."}, {"en": "2) To introduce different types of sources, genres and texts used in history. ", "et": "2) Tutvustada üliõpilaste erinevaid allikatüüpe, ajalookirjutuse žanre ja tekstiliike."}, {"en": "3) To prepare students for writing high quality academical texts, including the choice of sources and literature, source criticism.", "et": "3) Valmistada üliõpilasi ette erinevate teadustööde kirjutamiseks ja tutvustada neile ajaloolase töömeetodeid, sh allikate ja kirjanduse valikut ning allikakriitikat."}, {"en": "4) To prepare students for their further study at the institute of history and archaeology.", "et": "4) Valmistada õpilasi ette edasiseks õppetööks ajaloo- ja arheoloogia instituudis."}], "learning_outcomes": [{"en": "1) Student describes different modern topics and currents in history writing. ", "et": "1) Üliõpilane kirjeldab erinevaid tänapäevase ajalookirjutuse suundi."}, {"en": "2) Student can distinguish between popular science and academical research, and can evaluate sources critically. ", "et": "2) Üliõpilane eristab populaarteaduslikke ja erinevaid teaduslikke tekste ning oskab materjali kriitiliselt hinnata."}, {"en": "3) Student finds sources and literature for her/his research projects.", "et": "3) Üliõpilane leiab oma edasiseks õppetööks vajalikke allikaid ja kirjandust."}, {"en": "4) Student writes analytical and critical academic texts that follow the guidelines of the institute. ", "et": "4) Üliõpilane koostab instituudi nõuetele vastavaid akadeemilises stiilis analüüsivaid ja allikakriitilisi tekste."}, {"en": "5) Student guides her/his further studies according to her/his personal goals for further study and career prospects.", "et": "5) Üliõpilane juhib teadlikult oma edasist õppimist ja teadustööd lähtuvalt potentsiaalsetest karjäärivõimalustest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}