{"uuid": "bc623c34-f81e-5c54-2316-6861154c087e", "code": "HVAJ.06.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-20T12:18:51", "title": {"en": "International Relations in the 20th Century and Estonia", "et": "Rahvusvahelised suhted 20. sajandil ja Eesti"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ06", "structural_unit_name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ06", "name": {"en": "Department of Contemporary History", "et": "uusima aja osakond"}, "phone": "+372 737 5656", "address": "Jakobi 2 - 223\nEST", "street": "Jakobi 2 - 223", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The main causes of the Wars and conflicts. The development of the international relations up to the 1991 andthe role of Estonia . The national question as a factor in the international relations. The problem of security of the small states. The transmission of the role of state in the 20th century.", "et": "Sõdade ja konfliktide peamised põhjused ja Eesti. Rahvusvaheliste suhete areng kuni 1990. aastateni ning Eesti koht selles. Rahvusküsimus kui mõjutegur rahvusvahelistes suhetes. Migratsiooniprobleemid. Riigi rolli muutumine 20. sajandil."}, "objectives": [{"en": "Võrrelda erinevaid lähenemisteid poliitilisele ajaloole ja rahvusvahelistele suhetele läbi Eesti perspektiivi.\nThe course proposes to teach to see the so-called open questions and issues in current international relations and history. The aim of the course is to help students by lectures, seminars and individual work to come to the conviction that in explaining the essence of war and peace, the different ways of periodicity of history, a variety of theoretical points of world outlooks etc. are implemented. The introduction of the main trends of international relations. The comparison of the different approaches in political history and international relations through the perspective of Estonia.", "et": "Kursuse eesmärgiks on rahvusvaheliste suhete ja ajaloo õpetamisel lähtuda nn avatud küsimustest. Läbi loengute, seminaride ja iseseisva uurimistöö selgitada sõja ja rahuga seotud probleeme, ajaloo periodiseerimise erinevaid võimalusi. Avada rahvusvaheliste suhete ajalugu läbi erinevate seletusvõimaluste ja tutvustada peamisi teooriaid. Võrrelda erinevaid lähenemisteid poliitilisele ajaloole ja rahvusvahelistele suhetele läbi Eesti perspektiivi."}], "learning_outcomes": [{"en": "- Ability to analyze the history of Europe in the 20th century in a comparative perspective from the point of Estonia. \n- Detailed knowledge of the history of international relations after WWI", "et": "Kursuse edukalt läbinud üliõpilane:\n- suudab analüüsida 20. sajandi Euroopa ajalugu võrdlevas perspektiivis läbi Eesti ajaloo prisma;\n- omandab teadmised rahvusvaheliste suhete ajaloost Esimese maailmasõja järel"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}