{"uuid": "d7b1ed79-b0c3-32a7-6239-a2e7f92c0fa5", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-17T14:29:07", "title": {"en": "Literary Culture of Medieval Europe", "et": "Keskaegse Euroopa kirjakultuur"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ07", "structural_unit_name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 20, "practice": 4, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 80, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": false, "uuid": "2a44f9ae-8fde-75b2-f25f-ab8e65be5ef5", "code": "FLAJ.07.004", "title": {"en": "Medieval History", "et": "Keskaeg"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-16T09:23:23"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "'", "et": "Ainekursus annab ülevaate keskaja Euroopa kirjakultuuri peamistest arenguetappidest ja keskaegse kirjasõna uurimise ja kasutamise võimalustest. Käsitletakse olulisemaid mälestisi nende ajaloolises kontekstis ning tutvustatakse nende uurimise võimalusi (sh uurimislugu) ja metodoloogiat. Lähema vaatluse all on keskaegse kirjakultuuri eripärad ja kirjasõna roll keskaegses ühiskonnas, eriti suhestatuna kaasaja ühiskondlike, religioossete ja poliitiliste arengutega."}, "objectives": [{"en": "'", "et": "1. anda süsteemne ülevaade kirjakultuuri arengust keskaegses Euroopas;\n2. tutvustada ja selgitada keskaja kirjakultuuri eripärasid ja kirjasõna peamiseid funktsioone;\n3. tutvustada keskaja kirjakultuuri eri vorme ja kirjasõna anrilise jaotuse võimalusi;\n4. tutvustada keskaja kirjasõna olulisi mälestisi ja nende uurimislugu ning nende ajalooallikana kasutamise võimalusi;\n5. õpetada erialast terminoloogiat ning selle aktiivset kasutamist kõnes ja kirjas."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "'", "et": "1. tunneb keskaegse Euroopa kirjakultuuri arenguloo põhilisi etappe nende üldajaloolises kontekstis;\n2. tunneb keskaegse kirjakultuuri, sh kirjasõna eripärasid ja oskab neid arvestada keskaegsete tekstide kasutamisel ja tõlgendamisel;\n3. oskab identifitseerida keskaja kirjalikke allikaid ning suudab neid tõlgendada kaasaja kontekstis;\n4. tunneb keskaja kirjasõna olulisemaid mälestisi, oskab määratleda nende anrilist kuuluvust ja analüüsida neid ajaloolises kontekstis;\n5. valdab olulisemat ainespetsiifilist ja allikaomast terminoloogiat ning oskab seda erialases töös rakendada;\n6. on omandanud oskuse kasutada ainespetsiifilisi teadmisi ja oskussõnavara kirjaliku töö koostamisel ja suulises ettekandes."}], "notes": {"et": "Alternatiiv õppeainele HVAJ.07.002 Üldajaloo seminar."}}, "grading": {"independent_work": {"et": "Õppeprotsessi lahutamatuks osaks on iseseisev töö õppe- ja teaduskirjandusega, mille praktiliseks väljundiks on lühiuurimuse kirjutamine ja esitamine ning töö tulemuste tutvustamine suulises kollokviumis. \n\n1) Üliõpilane koostab lühiuurimuse ühe keskaegse autori (resp. kommentaatori, kompilaatori) ja tema kirjapärandi kohta. Nõuded lühiuurimuse sisule ja vormile on kättesaadavad õppeaine E-keskkonnas, täiendavaid soovitusi, juhtnööre ja tagasisidet annab õppeaine vältel õppejõud. Lühiuurimuse teema tuleb õppejõuga kooskõlastada hiljemalt 5. märtsiks 2025, mustand esitada 16. mail 2025. \n2) Üliõpilane tutvustab valminud töö sisu ja tulemusi suulises ettekandes ning osaleb ka kaasüliõpilaste tööde aruteludes. Vastavad kollokviumid toimuvad tunniplaanijärgsetel aegadel. Kollokviumi järgselt saab üliõpilane tööle individuaalset tagasisidet. \n3) Üliõpilane esitab nõutekohaselt kirjutatud ja vormistatud töö lõppversiooni hiljemalt kolm tööpäeva enne ÕIS-is valitud eksamiaega. \n\nHaridusliku erivajadusega üliõpilasel on õigus taotleda üldistest tingimustest ja tähtaegadest erandeid (kohandusi). Vastavas küsimuses tuleb üliõpilasel iseseisevalt pöörduda õppeosakonna nõustaja poole, kes koostab üliõpilasele soovitatud kohanduste loetelu ja edastab selle õppejõule. Selleks, et üliõpilasele vajalikke individuaalseid kohandusi oleks võimalik teha alates õppeaine algusest, peab vastav teave jõudma õppejõuni võimalikult varakult, s.o semestri alguses."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "- Kirjalikule lõpphindamisele (eksamile) pääsemise eeldus. \n- Hindamine: mitteeristav.\n- Arvestuse saamiseks peab töö lõppversioon olema esitatud tähtaegselt ja vastama nii sisult kui vormilt (probleemipüstitus, allikate ja kirjanduse valik, maht, erialane oskussõnavara ja keelekasutus, viitamine, vormistus) õppeaines kirjalikule tööle kehtivatele nõuetele. Kui esitatud töö vastab plagiaadi tunnustele, menetletakse rikkumist vastavalt Tartu Ülikoolis kehtivale korrale. "}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "- Kirjalikule lõpphindamisele (eksamile) pääsemise eeldus.\n- Hindamine: mitteeristav.\n- Arvestuse saamiseks peab üliõpilane pidama kirjaliku töö teemal ettekande ning võtma osa kaasüliõpilaste tööde aruteludest. "}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "- Hindamine: eristav."}}], "grade_preconditions": {"et": "1) Ettekande pidamine, milles tutvustatakse iseseisva lühiuurimuse sisu ja tulemusi. \n2) Osavõtt kaasüliõpilaste tööde aruteludest. \n3) Nõuetekohase lühiuurimuse tähtaegne esitamine."}, "grade_evaluation": {"et": "Üliõpilasel, kes on täitnud kõik lõpphindamisele pääsemise tingimused, kujuneb hinne kirjaliku eksami sooritamise tulemusel."}, "grade_conditions": {"A": {"et": "91-100% punktidest. Üliõpilane valdab kõiki õppeaines käsitletud teemasid ammendavalt. Ta teab keskaegse Euroopa kirjakultuuri arenguloo põhilisi etappe, sh olulisemaid regionaalseid erijooni, ning oskab neid kaasaegses kontekstis selgitada, iseloomustada ja võrdlevalt analüüsida. Üliõpilane mõistab kirjakultuuri eripära ja kirjasõna rolli keskaegses ühiskonnas ning oskab seda suhestada kaasaja ühiskondlike, religioossete ja poliitiliste arengutega. Vastustest ilmneb oskus luua seoseid keskaja eri alaperioodide, ajaloolis-poliitiliste regioonide ja teemavaldkondade lõikes. Üliõpilane valdab erialast oskussõnavara ja oskab seda erialaspetsiiflises tekstis korrektselt kasutada. Vastused on antud keeleliselt korrektses vormis."}, "B": {"et": "81-90% punktidest. Üliõpilane valdab kõiki õppeaines käsitletud teemasid. Ta teab keskaegse Euroopa kirjakultuuri arenguloo põhilisi etappe, sh olulisemaid regionaalseid erijooni, ning oskab neid kaasaegses kontekstis selgitada ja iseloomustada. Üliõpilane mõistab kirjakultuuri eripära ja kirjasõna rolli keskaegses ühiskonnas ning oskab seda suhestada kaasaja ühiskondlike, religioossete ja poliitiliste arengutega, kuid vastustes esineb üksikuid väheolulisi ebatäpsuseid. Vastustest ilmneb oskus luua seoseid keskaja eri alaperioodide, ajaloolis-poliitiliste regioonide ja teemavaldkondade lõikes. Üliõpilane valdab erialast oskussõnavara ja oskab seda erialaspetsiiflises tekstis korrektselt kasutada. Vastused on antud keeleliselt korrektses vormis."}, "C": {"et": "71-80% punktidest. Üliõpilane valdab kõikide õppeaines käsitletud teemade peamist faktoloogiat, kuid ei oska alati selgitada selle kaasaegset konteksti või mõju. Ta teab keskaegse Euroopa kirjakultuuri arenguloo põhilisi etappe, sh olulisemaid regionaalseid erijooni, ning oskab neid selgitada ja iseloomustada. Vastustes esineb puudujääke seoste loomisel ja konteksti avamisel keskaja eri alaperioodide, ajaloolis-poliitiliste regioonide ja teemavaldkondade lõikes. Esineb üksikuid vigu erialase oskussõnavara kasutamises. Vastused on antud keeleliselt korrektses vormis."}, "D": {"et": "61-70% punktidest. Üliõpilane valdab vaid mõningate õppeaines käsitletud teemade peamist faktoloogiat. Tal puuduvad piisavad teadmised mitmetest õppeaines käsitletud teemadest: mitmed teemad on omandatud ammendavalt, kuid teadmised üksikutest teemadest on ebapiisavad. Vastustes esineb puudujääke seoste loomisel ja konteksti avamisel keskaja eri alaperioodide, ajaloolis-poliitiliste regioonide ja teemavaldkondade lõikes. Esineb üksikuid vigu erialase oskussõnavara kasutamises. Vastused on antud keeleliselt korrektses vormis."}, "E": {"et": "51-60% punktidest. Üliõpilane valdab vaid mõningate õppeaines käsitletud teemade peamist faktoloogiat. Vastustes esineb puudujääke seoste loomisel ja konteksti avamisel keskaja eri alaperioodide, ajaloolis-poliitiliste regioonide ja teemavaldkondade lõikes. Esineb üksikuid vigu erialase oskussõnavara kasutamises. Vastused on antud keeleliselt korrektses vormis, kuid võib esineda üksikuid vigu akadeemilise sõnakasutuse osas."}, "F": {"et": "1) Üliõpilane ei ole täitnud kõiki kirjalikule lõpphindamisele pääsemise tingimusi. 2) Üliõpilane on õppeaines toime pannud akadeemilise petturluse. 3) Kirjalikul lõpphindamisel on pälvitud vähem kui 51% punktidest. Üliõpilane ei valda õppeaines käsitletud teemasid, sh peamist faktoloogiat. Vastustest ilmneb, et ta ei tunne Euroopa kirjakultuuri arenguloo põhilisi etappe ja/või olulisemaid regionaalseid erijooni. Üliõpilane ei oska luua temaatilisi seoseid keskaja eri alaperioodide, ajaloolis-poliitiliste regioonide ja teemavaldkondade lõikes. Ta ei valda erialast oskussõnavara. "}, "mi": {"et": "Üliõpilane on täitnud kõik kirjalikule lõpphindamisele pääsemise tingimused, kuid jätnud hindamisele ilmumata. "}}, "debt_elimination": {"et": "1) Kollokviumidest põhjusega puudumisel (nt: tõendatud haigestumisel) on üliõpilasel õigus pidada ettekanne tunniplaaniväliselt, õppejõuga kooskõlastatud ajal. \n2) Individuaalsed erandid õppeaines kehtivatest tähtaegadest ja tingimustest on võimalikud eelneval kokkuleppel ja tõendatud põhjuse olemasolul.\n3) Kõik võlgnevused peavad olema heastatud hiljemalt kolm tööpäeva enne üliõpilase valitud korralise hindamise toimumist. Võlgnevuste heastamine alles kordushindamiseks ei ole võimalik.\n4) Üliõpilasel, kes on nõuetekohaselt täitnud kõik kirjalikule lõpphindamisele pääsemise tingimused, kuid jätnud eksamile ilmumata, on õigus sooritada kordushindamine üldises korras. \n5) Üliõpilasel, kes sooritas korralise eksami negatiivsele tulemusele, on õigus sooritada kordushindamine üldises korras."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hiljemalt viis tööpäeva pärast korralise või kordushindamise toimumist. Seejuures saab üliõpilane individuaalset tagasisidet nii kirjaliku eksamitöö kui kirjaliku koduse töö (lühiuurimuse) kohta. "}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "2935f721-08c4-4e55-9477-52a63b4b3bf4", "type": "MOODLE", "code": "HVAJ.07.020", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Vt: õpikeskkond moodle.ut.ee.", "recommended_materials": "Vt: õpikeskkond moodle.ut.ee."}, "participants": {"lecturers": [{"person_uuid": "cb02e745-44f7-f9e6-17de-833664e720eb", "person_name": "Kerli Kraus", "structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 24, "time": "2025-02-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Sissejuhatus õppeainesse. Keskaegse kirjakultuuri eripärad I"}, "description": {}}, {"course_week": 25, "time": "2025-02-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Keskaegse kirjakultuuri eripärad ja uurimise võimalused"}, "description": {}}, {"course_week": 27, "time": "2025-03-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Varakeskaeg: kirjasõna suulise kultuuri rüpes "}, "description": {}}, {"course_week": 28, "time": "2025-03-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Kõrgkeskaeg: kirjasõna teisenenud funktsioonid "}, "description": {}}, {"course_week": 29, "time": "2025-03-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Keskaja lõpusajandid: vernakulaarkeelte esiletõus "}, "description": {}}, {"course_week": 30, "time": "2025-03-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Haridusolud ja kirjakultuur keskajal: vastastikused seosed"}, "description": {}}, {"course_week": 31, "time": "2025-03-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Institutsionaalne ja professionaalne kirjakultuur "}, "description": {}}, {"course_week": 32, "time": "2025-04-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ajalookirjutus ja kroonikakirjutus "}, "description": {}}, {"course_week": 33, "time": "2025-04-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ajalookirjutus ja kroonikakirjutus II"}, "description": {}}, {"course_week": 34, "time": "2025-04-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ladina keel ja vernakulaarkeeled kõrg- ja hiliskeskajal"}, "description": {}}, {"course_week": 35, "time": "2025-04-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ladina keel ja vernakulaarkeeled kõrg- ja hiliskeskajal II"}, "description": {}}, {"course_week": 36, "time": "2025-05-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Pragmaatiline kirjaoskus: ekspertkultuur ja õiguskultuur "}, "description": {}}, {"course_week": 37, "time": "2025-05-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Pragmaatiline kirjaoskus: ekspertkultuur ja õiguskultuur II"}, "description": {}}, {"course_week": 38, "time": "2025-05-19", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Üliõpilaste ettekanded"}}, {"course_week": 39, "time": "2025-05-26", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Üliõpilaste ettekanded"}}]}, "registration_info": {"audience": {"et": "Üldajaloo bakalaureuseõppe erialamooduli õppeaine (alates 2021/2022 õppekava versioonist), teistele valik- või vabaaine."}}, "parent_uuid": "50f02837-98b6-fc46-b983-e199205ce787", "parent_code": "HVAJ.07.020", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}