{"uuid": "5bc1591e-cb07-e877-dd51-6d36c01ba240", "code": "HVAJ.01.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Estonian Archaeology", "et": "Sissejuhatus Eesti arheoloogiasse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ01", "structural_unit_name": {"en": "Department of Archaeology", "et": "arheoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ01", "name": {"en": "Department of Archaeology", "et": "arheoloogia osakond"}, "phone": "+372 737 5652", "webpage_url": "https://arheo.ut.ee", "address": "Jakobi 2 - 207\nEST", "street": "Jakobi 2 - 207", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is intended as an introduction to archaeology studies and it is recommended to take it in the first or second year of your studies. The course consists of lectures, practical tasks and field trips.", "et": "Kursus on mõeldud sissejuhatuseks arheoloogiaõpingutesse ning soovitav on seda võtta oma õpingute esimesel või teisel aastal. Kursus koosneb loengutest, praktilistest ülesannetest ja õpperetkedest."}, "objectives": [{"en": "The course gives an overview of Estonian archaeology, including its research areas, sources, literature, and databases. It provides a basic knowledge of Estonian prehistory and Estonian historical archaeology. Archaeology as a profession and the archaeology-related jobs are introduced.", "et": "Kursus annab ülevaate Eesti arheoloogia uurimisvaldkondadest, allikatest, erialakirjandusest ja andmebaasidest. Antakse alusteadmised Eesti muinasajast ja Eesti ajaloolise aja arheoloogiast. Samuti tutvustatakse arheoloogide töömaailma."}], "learning_outcomes": [{"en": "On successful completion of the course a student: \n- knows the research areas of Estonian archaeology, has a basic knowledge of Estonian prehistory and Estonian historical archaeology \n- is familiar with information search principles in archaeology and can use archaeological databases \n- orients in professional concepts and is familiar with professional texts such as archaeological reports, fieldwork review papers, problem-based scientific articles \n- has functional reading skills of archaeological scientific literature \n- has developed reasoning and writing skills \n- can reflect upon one's learning process\n- knows professional career opportunities and has developed skills for career development.", "et": "Kursuse läbinud üliõpilane: \n-  tunneb Eesti arheoloogia uurimisvaldkondi, omab alusteadmisi Eesti muinasajast ja Eesti ajaloolise aja arheoloogiast,  \n- oskab otsida arheoloogilist infot ning kasutada erialaseid andmebaase  \n- orienteerub erialastes mõistetes ja  tunneb erialaseid tekstitüüpe (arheoloogilised aruanded, välitööde ülevaateartiklid, teaduslikud probleemartiklid) \n- omab erialase teaduskirjanduse funktsionaalset lugemisoskust, on arendanud arutlemise ning kirjalikku eneseväljendamise oskust \n- oskab reflekteerida oma õppeprotsessi\n- tunneb erialaseid karjäärivõimalusi ning on arendanud enda karjääriplaneerimise oskusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}