{"uuid": "9e156676-75d6-0d40-b9a7-447fce5be759", "code": "hv-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-12T13:47:10", "title": {"en": "History of World Art: Renaissance Period", "et": "Üldine kunstiajalugu: renessansskunst"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ05", "name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "phone": "+372 737 5655", "address": "Ülikooli 18 - 024\nEST", "street": "Ülikooli 18 - 024", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ05", "structural_unit_name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The lectures continue the introduction of art history in the context of temporal discourse and historical narrative. The central concepts of European visual culture and the important criteria inherent to the development of a contemporary worldview are also discussed, with the focus on sources and trends. In the seminars, the focus is on the work of various artists and their broader meaning.", "et": "Loengutes jätkatakse kunstiajaloo tutvustamist ajalise diskursuse ja ajaloolise narratiivi võtmes ja esitletakse Euroopa visuaalse kultuuri kesksete mõistete ja kaasaegse maailmapildi kujunemisele omaseid olulisemaid kriteeriume, peatudes peamistel renessansi allikatel ja suundumustel. Semnaridel keskendutakse erinevate kunstnike loomingule ja selle laiemale tähendusele."}, "objectives": [{"en": "To provide a concept of the fine art of the Renaissance era, its basic periods, artists and architectural personalities. To reveal the internal importance of the culture of form; to deal, along with style, with the origins and philosophical background of the Renaissance as the rebirth of the classical ideal; to bring forth the ambivalence of beauty, as the central issue of the period in various countries and schools (art south and north of the Alps). To deal with the beginning of the new era in connection with the democratisation of art and the various opportunities for its interpretation based on examples in printmaking, architectural theory, etc.", "et": "Anda ettekujutus renessansi ajastu kujutavast kunstist, selle põhiperioodidest, kunstnikest ja arhitektiisiksustest. Avada vormikultuuri sisemine tähenduslikkus, käsitleda stiili kõrval renessansi kui klassikalise ideaali taassünni allikaid ja filosoofilisi tagamaid, tuua esile ilu kui perioodi keskse kategooria ambivalentsus erinevate maade ja koolkondade (kunst lõuna ja põhja pool Alpe) lõikes. Käsitleda uue ajastu algust seostes kunsti demokratiseerumise ja selle erinevate interpreteerimise võimalustega trükigraafika, arhitektuuriteooria jms. näidete varal."}], "learning_outcomes": [{"en": "A student that completes the course: \n- will be familiar with the history of art in the Renaissance period; \n- will be familiar with the works of outstanding artists and architects of the era; \n- will be able to speak and write about the art of the Renaissance.", "et": "Kursuse läbinud üliõpilane:\n-tunneb renessansiajastu kunsti ajalugu;\n-tunneb ajastu väljapaistvamate kunstnike ja arhitektide loomingut;\n-on võimeline renessansi kunstist kõnelema ja kirjutama.   \ninglise keeles."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Suuline ettekanne, milles üliõpilane esitleb ühe perioodil olulist kunstnikku (arhitekti)\n2. Lugemisülesannete sooritamine \n3. Kirjalik essee renessansiperioodi teoreeriliste tekstide põhjal\n4. Suuline eksam, milles võetakse vaatluse alla aine põhiliste seisukohtade omandamine, analüüsivõime ja kriitilis - hinnanguline oskus töötada materjaliga iseseisvalt. (50 %)."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Essee kirjanduse põhjal.\nKursuse raames tuleb koostada essee juhendaja poolt heaks kiidetud kirjanduse põhjal. Allikaid peaks olema minimaalselt 3, millest vähemalt 2 on võõrkeelsed. Essee mahuks on 5-6 lk, Times New Roman 12, reavahe 1,5. Essee vormistada akadeemilisi traditsioone järgides, joonealuse viiteaparatuuriga.\n\nE - minimaalsel lubataval tasemel ülevaade teemast, allikmaterjali valik nõrk, analüüs ja järeldused pinnapealsed. Vormistus suurte puudustega.\nD - piisaval tasemel ülevaade teemast, allikmaterjali valik kesine, analüüs ja järeldused pädevad, vormituses esineb puudusi.\nC - heal tasemel ülevaade kteemast, hea allikmaterjali valik, analüüs ja järeldused heal tasemel, vormistuses esineb ebatäpsusi.\nB - väga heal tasemel ülevaade teemast, hea allikmaterjali valik, analüüs ja järeldused usutavad ja kohased teemale, vormistuses esineb üksikuid ebatäpsusi.\n\nA - silmapaistev ja eriti laiapõhjaline ülevaade teemast, silmapaistvalt asjakohane allikmaterjali valik, analüüs ja järeldused kõrgel tasemel, originaalsed, demonstreerides üliõpilase võimet seostuda eriala professionaalsete standarditega, vormistus korrektne."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Eksam\n\nE Üliõpilane tunneb ainet pealiskaudselt, suudab küll eristada peamisi probleeme, ei orienteeru seejuures sügavamalt perioodi kunstimaailmas ja selle sõlmküsimustes. Faktiteadmine ebapiisav.\nD. Tunneb ainet, esitleb seda ilma korrektselt aga mõningate oluliste puudustega. Analüüs kohati nõrk ja ebapädev, järeldused kahvatud ja pinnalised.\nC Üliõpilane on töö sooritanud heal tasemel, mõttearendus huvitav, faktiline taust piisav. Puuduseks on selge kontseptsiooni esitamise oskus, analüüsi fragmentaarsus ja lõppjärelduste kohatine paikapidamatus.\nB. Väga heal tasemel töö, mis annab ajastust ja teemast laiaulatusliku ning pädeva ülevaate, oskab sulatada üksikfaktid laiemasse konteksti ja tõstatada probleeme renessansi ajastu kunsti ideelisel tausta.\nA. Suurepärane töö nii sisult kui vormilt. Kirjutatud värske ja tabava sulega, avab harvaesinevalt huvitavaid ja originaalseid vaatenurki nii teemale, ajastule kui loomingulistele omapäradele. Analüüs järjekindel, järeldused vastavuses aine põhiseisukohtadega, materjali esitlus küündib professionaalse kunstiteaduse läveni."}}, {"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Suuline power point esitlus. Eeldab ühe renessansi ajastu kunstniku loomingu läbi töötamist ja esitlemist seostes nii tema eluloo kui laiemalt ajastu tausta, selle ideede ja teoreetiliste seisukohtadega.\n\nE Üliõpilane tunneb kunstnikku, tema loomingut ja ümbritsevat kultuuriruumi minimaalsel tasemel. Slaidivalik juhusliku iseloomuga, ega anna ülevaadet tervikust. Ridamisi eksimusi faktides ja hinnangutes.\nD Üliõpilane tunneb piisaval tasemel kunstniku loomingulist biograafiat, oskab eristada olulise, teha järeldusi ajastu kultuuri taustal\nC Heal tasemel teadmised kunstnikust, tema loomingust ja selle kohast ajastu kunstis. Esitlus on läbi mõeldud ja selgepiiriline, seosed laiema kultuuritaustaga paikapidavad, analüüs ja järeldused läbi mõeldud ja usutavad.\nB. Väga heal tasemel kunstniku, elu ja tema loomingu tundmine. Oskab leida paralleele teiste samal ajal tingimustes töötanud kunstnikega, analüüsida erinevaid loomingulisi suundi, aduda ühe isiku biograafiaga piiritletud aine laiamaid ulatuvusi.\nA. Suurepärane materjali valdamine, kunstniku looming tõuseb esile ereda ja meeldejäävana, esile on tõstetud nii selle erisused kui samasused teiste ajastu oluliste loovisikute kõrval. Leitud kontaktipind perioodi maailmapildi ja teoreetiliste vaadetega. Üliõpilane valdab kunstiajaloo historiograafilisi ja metoodilisi suundi ja seisukohti. Väljapaistev retoorika ja sõnaseade."}}], "grade_preconditions": {"et": "Eksamile pääsemise eelduseks on seminariettekande esitlus, lugemisülesannete  ja essee õigeaegne esitamine."}, "grade_evaluation": {"et": "Suulise esitluse hinne 20%\nEsssee hinne 20%\nLugemisülesanded 20%\nEksamihinne 40%\nSuuline lõpphindamine (eksam) moodustab 40% kogu lõpphindest, mille puhul on eelduseks kogu läbitud materjali omandamine, analüüsi võime oskus seda interpreetida ja esitleda kunstiajaloo puhul nõutavas sõnalises vormis."}, "debt_elimination": {"et": "Korduseksam"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "c012e481-2254-4fdf-9c85-4ebd040c3d7b", "type": "MOODLE", "code": "HVAJ.05.006", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "1e885117-fb89-d85c-90b5-f3aee98c2b70", "person_name": "Holger Rajavee", "structural_unit": {"code": "HVAJ05", "name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "phone": "+372 737 5655", "address": "Ülikooli 18 - 024\nEST", "street": "Ülikooli 18 - 024", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25; 29, 31-38"}}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "e6192b75-aa8b-bed2-c466-f51ba846b885", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "57720c86-1365-4fea-9918-8ea3082a1ab7", "parent_code": "HVAJ.05.006", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}