{"uuid": "b3b8e286-9232-ee90-be97-3790c09369c5", "code": "HVAJ.05.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-24T07:43:41", "title": {"en": "History of the Ideas and Theories of Art. Basic Texts. I - II", "et": "Kunsti ideede ja teooria ajalugu. Tüvitekstid. I ja II"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ05", "structural_unit_name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ05", "name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "phone": "+372 737 5655", "address": "Ülikooli 18 - 024\nEST", "street": "Ülikooli 18 - 024", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Work with basic texts of art history. The founding purpose of mainly seminar-style approach is to learn preconditions and opportunities of art history as its own discipline from Plato's academy to Modernism.", "et": "Süvendatud töö kunstiajaloo tüvitekstidega. Põhiliselt seminarivormis lähenemise põhieesmärgiks on õppida tundma kunstiajaloo kui omaette distsipliini kujunemise eeldusi ja võimalusi alates Platoni akadeemiast kuni modernismi teooriateni."}, "objectives": [{"en": "Give an overview of development of art history on the general background of the era's aesthetic and philosophical thought from Antiquity to Modernism. The purpose of the course is to study prerequisites of art history as its own train of thought and discipline of science, and their usage as main cornerstone of art history.", "et": "Anda ülevaade kunstiajaloo kujunemisest ajastu esteetilise ja filosoofilise mõtte taustal antiikajastust modernismini. Kursuse eesmärgiks on kunstiajaloo kui omaette mõttevoolu ja teadusdistsipliini tundma õppimine ning käsitlemine."}], "learning_outcomes": [{"en": "The attested student has a theoretical base for acquiring the profession and prerequisites to treat art historical events.", "et": "Aine läbinud üliõpilane omab erialaks vajalikku teoreetiliste teadmiste baasi ja eeldusi aine raames vaadeldava ajajärgu kunstiajalooliste ilmingute käsitlemiseks oma edasises teoreetilises ja loovpraktilises töös."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}