{"uuid": "cfaa6715-3bee-e75f-43eb-a6151f289dbf", "code": "HVAJ.03.016", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "The Baltics in the International Relations of the Baltic Sea Region 1558-1920", "et": "Baltikum Läänemere regiooni rahvusvahelistes suhetes 1558-1920"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ03", "structural_unit_name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ03", "name": {"en": "Department of Estonian History", "et": "Eesti ajaloo osakond"}, "phone": "+372 737 5650", "address": "Jakobi 2 - 220, 231\nEST", "street": "Jakobi 2 - 220, 231", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The history of Estonians and Latvians has been influenced by the power struggles of their neighboring countries to a great extent. Control over the Baltics reflected the power relations of the whole Baltic Sea region. The course focuses on three defining conflicts that took place in the region. These are, firstly, a series of wars between Poland, Sweden, Denmark and Russia that has been lately termed as the Nordic Hundred Years' War (1554-1661), The Great Northern War (1700-1721) and The First World War (1914-1918). With all the aforementioned wars the Baltics is placed into a wider international context and the role of the Baltics in causing these conflicts and the aims of the belligerents regarding the Baltics will be analyzed. The direct and indirect impacts of these wars on the local society will be discussed as a separate topic. The course consists of lectures and three seminars. Students are required to work through the assigned literature for the seminars.", "et": "Baltikum on olnud sajandeid kohaks, kus on põrkunud Läänemerd ümbritsevate riikide ambitsioonid ning kontroll Baltikumi üle peegeldas suuresti võimusuhteid kogu Läänemere regioonis. Valikkursus keskendub kolmele olulisemale piirkonnas aset leidnud konfliktile. Nendeks on esiteks viimasel ajal Põhjamaade Saja-aastase sõjana tuntuks saanud sõdade jada Poola, Rootsi, Taani ja Venemaa vahel (1554-1661), Põhjasõda (1700-1721) ning Esimene maailmasõda (1914-1918). Kursus ei keskendu niivõrd sõjasündmustele Eesti-, Liivi- ja Kuramaal, vaid sõdivate riikide välispoliitikale ning laiemale rahvusvahelisele olukorrale. Loengutes ja seminarides arutleme muu hulgas põhjuste üle, miks siinne maa on aegade jooksul nii rohketest sõdadest räsitud ning käsitleme argumente, mida on kasutatud õigustamaks ülemvõimu Baltikumi üle."}, "objectives": [{"en": "The aim of the course is to give an overview of the role that the historical Baltics (the main emphasis is on the provinces of Estland and Livland) played in the power struggles of the Baltic Sea region and the impact these events had on the local society from the middle of the 16th century to the end of the First World War.", "et": "Kursuse eesmärk on anda ülevaade ajaloolise Baltikumi (põhirõhuga Eesti- ja Liivimaal) kohast Läänemere regioonis aset leidnud võimuvõitlustes ning nende mõjudest siinsele ühiskonnale 16. sajandi keskpaigast kuni Esimese maailmasõja lõpuni."}], "learning_outcomes": [{"en": "A student who has successfully completed the course:\n1) is aware of the major events that took place in the international relations of the Baltic Sea region from the middle of the 16th century until the end of the First World War and of the role played by the Baltics in these events;\n2) can associate the wider events taking place in the Baltic sea Region with the developments that were occurring in the Baltics at the same time;\n3) has acquired experience in working with sources related to the history of international relations.", "et": "Kursuse edukalt läbinud üliõpilane:\n1)\torienteerub Läänemere regiooni rahvusvahelistes suhetes 16. sajandi keskpaigast kuni Esimese maailmasõja lõpuni \n        aset leidnud olulisemates sündmustes ning rollis, mida Baltikum neis mängis; \n2)\toskab seostada Läänemere regiooni rahvusvahelistes suhetes toimuvat samal ajal Baltikumis aset leidnud arengutega;\n3)\ton omandanud kogemuse iseseisvaks tööks rahvusvaheliste suhete ajaloo allikatega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}