{"uuid": "7995ab59-6ebb-f772-d7a2-94ae8651eae4", "code": "HVAJ.05.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Curation", "et": "Kureerimise alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ05", "structural_unit_name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVAJ05", "name": {"en": "Department of Art History", "et": "kunstiajaloo osakond"}, "phone": "+372 737 5655", "address": "Ülikooli 18 - 024\nEST", "street": "Ülikooli 18 - 024", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course examines the changing relationships between academic study and new configurations of museum display and interpretation. Such topics as the roles of museums in modern cultures, museum education programs and audiences, new technologies, collection management, curatorial work etc.", "et": "Praktika raames antakse üliõpilastele ülevaade kolme Tartus asuva muuseumi struktuurist, toimimisest, kogude jaotusest, kartoteekidest ja andmebaasidest. Loengutele (nt näituseprotsessi läbikäimine ideekavandist ja projektikirjeldusest tööde laenamise, näituse kujunduse, näitusetrükiste, haridusprogrammide, kommunikatsiooni ja turunduseni) järgnevad praktikapäevad  Eesti Rahva Muuseumis, Tartu Kunstimuuseumis ja Tartu Linnamuuseumis."}, "objectives": [{"en": "The course brings the academic study of art museums together with museum practice, and emphasizes the international contexts of museums in the modern world.", "et": "Kursuse eesmärgiks on anda teadmisi näituste koostamisest ja teostamisest nii ajaloolises vaates kui kaasaegses kultuurisituatsioonis. Loengute raames tehakse samm-sammult läbi näituseks valmistumise protsess ning praktilise kogemusena saab üliõpilane teada kaasaaegsete muuseumide toimimispõhimõtetest, struktuuridest ja töövaldkondadest."}], "learning_outcomes": [{"en": "During this course the students will:\n*\tgain the practical knowledge and understanding about the structure, work, collections, catalogue and databases of the museums in Tartu\n*\tunderstand current developments in the museum sector and gain a critical awareness of problems and new insights\n*\tundertake an extended placement to further enhance your practical skills and knowledge", "et": "Kursuse läbinud üliõpilane omab ülevaadet Tartus asuvatest muuseumidest ja kogudest, nende korraldusest ja kättesaadavusest; tunneb erisuunitlusega muuseumide tegevusvaldkondi (kogud ja nende täienemine, näituse- ja teadustöö kureerimine, konserveerimine, haridus, kommunikatsioon, turundus, näitusekorraldus jne); mõistab paremini oma eriala töövõimalusi ja -valikuid; mõtleb kaasa muuseumide (digitaalse)arengu ja näitus/teaduspoliitika teemadel nii Eestis, kui ka rahvusvahelises kontekstis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}