{"uuid": "dbd267f6-f6d8-84b5-752d-26ae887ac6c1", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-10T17:38:38", "title": {"en": "The Power of the Habsburgs: History, Culture and Art", "et": "Habsburgide võim: ajalugu, kultuur ja kunst"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "label": {"en": "24/25 A regular HV", "et": "24/25 S PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVAJ07", "structural_unit_name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 18, "practice": 6, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 130, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course \" The Power of the Habsburgs: History, Culture and Art \" contextualizes the role of the Habsburgs as the leading dynasty of Europe during the end of the 15h century and the first half of the 16. century. In addition to giving an overview of various aspects of Habsburg political system and power policies, attention is also paid on the role of personal relations, the court and the pieces of art exhibited at the court in the diplomatic relations of the Habsburg and in their performance of power. The Habsburg court can be considered an excellent example of European courtly culture of the time, where art and culture were harnessed into the service of the ideological program of the ruler.", "et": "Ainekursus \"Habsburgide võim: ajalugu, kultuur, kunst\" käsitleb Habsburgide rolli Euroopa juhtiva dünastiaga 15. sajandi lõpus ja 16. sajandi esimesel poolel. Lisaks ülevaatele Habsburgide poliitilisest süsteemist ja võimupoliitika erinevatest aspektidest pööratakse tähelepanu isiklike sidemete, valitseja õukonna ja seal eksponeeritud kunstiteoste rollile diplomaatilises suhtluses ja võimuteostuses. Habsburgide õukonda võib pidada eeskujulikuks näiteks tolleaegse Euroopa õukonnakultuurist, mille oluliseks tahuks oli kunst ja kultuur rakendamine valitseja ideoloogilise programmi teenistuses."}, "objectives": [{"en": "- To give an overview of the history of Habsburg dynasty, and its most important monarchs during the end of the 15th century and the first half of the 16th century.", "et": "- Ülevaate andmine Habsburgide dünastia ajaloost ja selle olulisimatest monarhidest 15. sajandi lõpul ja 16. sajandi I poolel."}, {"en": "- To introduce political, social and cultural activities of Habsburg monarchs, especially Maximilian I and Charles V.", "et": "- Tutvustada Habsburgidest monarhide, eelkõige Maximilian I ja Karl V, poliitilist, ühiskondlikku ja kultuurilist tegevust."}, {"en": "- To introduce political system and politics of the Habsburgs and their relations with courtly life and cultural activities. ", "et": "- Tutvustada Habsburgide poliitilist võimusüsteemi ja poliitikat ning selle seoseid õukonnaelu ja kultuurilise tegevusega."}, {"en": "- To develop the ability to understand and analyze historical scientific texts.", "et": "- Arendada ajalooalaste teaduslike tekstide mõistmise ja analüüsimise oskust."}, {"en": "- To develop the ability to read, understand and analyze primary sources.", "et": "- Arendada primaarallikate lugemise, mõistmise ja analüüsimise oskust."}], "learning_outcomes": [{"en": "The student who has taken this course: ", "et": "Aine läbinud üliõpilane:"}, {"en": "-\tIs familiar with the main characteristics of the politics of the Habsburg monarchs.", "et": "-\tOn tuttav Habsburgide dünastia poliitika põhijoontega."}, {"en": "-\tWill grasp the essence of the pre-modern political system, which was based on personal relations.", "et": "-\tTajub eelmodernsele ühiskonnale omase personaalsetel suhetel põhineva poliitilise süsteemi põhiolemust."}, {"en": "-\tAcknowledges the connection between the political-diplomatic capabilities of a monarch and the splendor of his court.", "et": "-\tTeadvustab õukondliku hiilguse seotust valitseja poliitilis-diplomaatilise võimekusega."}, {"en": "-\tHas gained elementary knowledge of culture at the Habsburg court, where luxury goods, often used for ideological aims, played an important role.", "et": "-\tOmab ettekujutust Habsburgide õukonnakultuurist, kus luksusesemed, mida sageli kasutati ideoloogilistel eesmärkidel, mängisid olulist rolli."}, {"en": "-\tIs aware of the role artworks as political instruments.", "et": "- On teadlik esemete ja kunstiteoste rollist poliitilise instrumendina."}, {"en": "- Has personal experience in understanding and analyzing historical scientific texts.", "et": "- Omab isiklikku kogemust ajalooalaste teadustekstide mõistmisel ja analüüsimisel."}, {"en": "- Has personal experience in reading, understanding and analyzing primary sources.", "et": "- Omab isiklikku kogemust primaarallikate lugemisel, mõistmisel ja analüüsimisel."}], "notes": {}}, "grading": {"independent_work": {"et": "Loengute eel (v.a esimene loeng) tuleb lugeda teemakohast kirjandust ning vastata selle põhjal esitatavatele küsimustele."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A -Üliõpilane on suurepäraselt omandanud kursuses jagatud teadmised, on suuteline looma seoseid omandatud teadmiste vahel, ega tee faktide osas vigu. Vastus on keeleliselt ja grammatiliselt korrektne.\nB - Üliõpilane on väga hästi omandanud kursuses jagatud teadmised,  on suuteline looma seoseid omandatud teadmiste vahel, ega tee faktide osas olulisi vigu. Vastus on keeleliselt ja grammatiliselt korrektne.\nC - Üliõpilane on korralikult omandanud kursuses jagatud teadmised, on suuteline looma mõningaid seoseid omandatud teadmiste vahel, kuid teeb faktide osas mõningaid vigu. Vastus on keeleliselt ja grammatiliselt korrektne.\nD - Üliõpilane on kesiselt omandanud kursuses jagatud teadmised, on suuteline looma vaid üksikuid seoseid omandatud teadmiste vahel või teeb faktide osas vigu.\nE - Kursuses jagatud teadmised on omandatud kasinalt, on suuteline looma vaid minimaalseid seoseid omandatud teadmiste vahel ja teeb faktide osas vigu.\nF - Kursuse jagatud teadmised on omandatud puudulikult.\nmi - Üliõpilaine ei ilmunud eksamile."}}], "grade_preconditions": {"et": "Üliõpilane võtab aktiivselt osa seminaridest ja praktikumist ning teeb ühe seminari tarbeks iseseisva töö.\nÜliõpilane on sooritanud iseseisvad tööd moodle'is hindele \"arvestatud\"."}, "grade_evaluation": {"et": "Kirjalik eksam moodustab 60%, iseseisev töö 30% ning aktiivne osalemine seminaris ja praktikumides 10% lõplikust hindest."}, "grade_conditions": {"A": {"et": "Üliõpilane on suurepäraselt omandanud ainekursusel jagatud teadmised, ta suudab luua seoseid nende teadmiste vahel ega tee faktide osas vigu. Vastus on keeleliselt ja grammatiliselt korrektne. Kirjalik uurimistöö vastab täielikult juhises esitatud nõuetele."}, "B": {"et": "Üliõpilane on väga hästi omandanud ainekursusel jagatud teadmised, ta suudab luua seoseid nende teadmiste vahel ega tee faktide osas olulisi vigu. Vastus on keeleliselt ja grammatiliselt korrektne. Kirjalikus uurimistöös on mõningaid puudusi sellele esitatud nõuete järgimise osas."}, "C": {"et": "Üliõpilane on hästi omandanud ainekursusel jagatud teadmised, ta suudab luua mõningaid seoseid nende teadmiste vahel, faktide osas esineb mõningaid vigu. Vastus on keeleliselt ja grammatiliselt korrektne. Kirjalikus uurimistöös esineb märkimisväärseid puudusi sellele esitatud nõuete järgimise osas."}, "D": {"et": "\nÜliõpilane on kesiselt omandanud ainekursusel jagatud teadmised, ta suudab luua üksikuid seoseid omandatud teadmiste vahel, faktide osas on vigu. Kirjalikus uurimistöös esineb olulisi puuduseid sellele esitatud nõuete järgimise osas."}, "E": {"et": "\nÜliõpilane on kasinalt omandanud ainekursusel jagatud teadmised, ta suudab luua väga üksikuid seoseid omandatud teadmiste vahel ning teeb faktide osas vigu. Kirjalikus uurimistöös on väga tõsised puudused sellele esitatud nõuete järgimise osas."}, "F": {"et": "\nAinekursusel jagatud teadmised on omandatud puudulikult. Uurimistöö ei vasta sellele esitatud nõuetele. Üliõpilane ei ole täitnud eksamile pääsemise kriteeriumeid."}, "mi": {"et": "Üliõpilane täitis eksamile pääsemise kriteeriumid, kuid ei ilmunud eksamile."}}, "debt_elimination": {"et": "Mittearvestatud kodutööd saab järele vastata; need võlgnevused tuleb likvideerida enne eksamit.\n\nSeminarist puudumisel tuleb teha seminari kirjanduse põhjal kirjalik töö, milles peab andma lühikokkuvõtte tekstist tuues esile autori peamised seisukohad. Kirjatöö tuleb vormistada šriftis Times New Roman, tähesuurus 12, reavahe 1,5. Teksti pikkus peab olema 2 lk (u 5300 tähemärki).\n\nEksamile mitte ilmumisel või selle mitterahuldaval sooritamisel on võimalik sooritada korduseksam."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "841bdf89-ea98-416c-9862-635f5e94e307", "type": "MOODLE", "code": "HVAJ.07.007", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "The Abdication of Emperor Charles V (1555/56), transl. by Thomas A. Brady (moodle'is).\n\nTekstid iseseisva töö tarbeks (lisanduvad jooksvalt).", "recommended_materials": "Larry Silver. \"Marketing Maximilian. The Visual Ideology of a Holy Roman Emperor\". Princeton 2008\nOtto von Habsburg. \"Karl V (1500-1558) : Euroopa keiser\". Tallinn: 2003.\nMargus Laidre. \"Plus ultra. Lugu mehest kellele kuulus pool maailma.\" - Tuna 2000, nr 4, lk 11-20."}, "participants": {"lecturers": [{"person_uuid": "20961704-3df7-7829-af75-b1667b42c760", "person_name": "Madis Maasing", "structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "9064c341-1464-83e3-6792-b4632d965f8b", "person_name": "Mihkel Mäesalu", "structural_unit": {"code": "HVAJ07", "name": {"en": "Department of General History", "et": "üldajaloo osakond"}, "phone": "+372 737 5657", "address": "Jakobi 2 - 219\nEST", "street": "Jakobi 2 - 219", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVAJ"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-16"}, "entries": [{"course_week": 2, "time": "2024-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Sissejuhatus. Ülevaade Habsburgide dünastia ajaloost"}, "description": {"et": "Aine ja selle läbimiskriteeriumide tutvustus. Üldine ülevaade Habsburgide dünastia ajaloost algusest tänapäevani."}}, {"course_week": 3, "time": "2024-09-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Habsburgide dünastia  Rudolf I-st Maximilian I-ni"}, "description": {"et": "Ülevaade Habsburgide dünastia käekäigust hiliskeskajal. Loengut peab Mihkel Mäesalu.                        "}}, {"course_week": 4, "time": "2024-09-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "Habsburgid ja Püha Rooma riik"}, "description": {"et": "Käsitlus Habsburgide kui Püha Rooma riigi valitsejate sidemetest selle liikmetega ja instantsidega."}}, {"course_week": 5, "time": "2024-10-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "Habsburgid ja reformatsioon"}, "description": {"et": "Seminaris käsitletakse tekste, mis avavad Habsburgide (eriti Karl V) seoseid reformatsiooniga ja suhtumist sellesse, eelkõige 1520. - 1550. aastatel."}}, {"course_week": 6, "time": "2024-10-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"et": "Habsburgid ja Liivimaa"}, "description": {"et": "Ülevaade Habsburgide ja Liivimaa vahelistest sidemetest eelkõige 16. sajandil."}}, {"course_week": 7, "time": "2024-10-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {"et": "Habsburgide õukonnad"}, "description": {"et": "Ülevaade Habsburgide õukondadest, mis olid 16. sajandi I poole Euroopa hiilgavaimad."}}, {"course_week": 8, "time": "2024-10-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"et": "Erasmuse vürstipeegel ja Karl V mälestused"}, "description": {"et": "Seminaris käsitletakse väljavõtteid kahest tekstist: Rotterdami Erasmuse vürstipeeglit (1515, pühendatud tulevasele Karl V-le) ning Karl V mälestusi (esialgsel kujul kirjutatud arvatavasti 1540. aastate lõpus, pühendatud tulevasele Felipe II-le). "}}, {"course_week": 9, "time": "2024-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {"et": "Habsburgid kunstipatroonidena"}, "description": {"et": "Ülevaade Habsburgide ja kunsti (kunstnike ja kunstiteoste) seostest. Loengut peab Kerttu Palginõmm."}}, {"course_week": 10, "time": "2024-11-08", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 9, "topic": {"et": "Tutvumine Habsburgidega seotud trükigraafikaga Tartu Ülikooli kunstimuuseumis"}, "description": {"et": "Tutvumine Habsburgidega seotud trükigraafikaga Tartu Ülikooli kunstimuuseumis. Praktikumi viib läbi Kerttu Palginõmm."}}, {"course_week": 11, "time": "2024-11-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {"et": "Karl V valdused ja nende valitsemine"}, "description": {"et": "Ülevaade sellest, kuidas Karl V ajal valitseti tema üle Euroopa ulatunud valduseid."}}, {"course_week": 12, "time": "2024-11-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {"et": "Habsburgid ja teised Euroopa suurvõimud 16. sajandil"}, "description": {"et": "Käsitlus Habsburgide suhetest Prantsusmaa, Inglismaa ja teiste olulisemate Euroopa võimudega 16. sajandist."}}, {"course_week": 13, "time": "2024-11-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 12, "topic": {"et": "Habsburgid ja ristisõjad"}, "description": {"et": "Ülevaade Habsburgide rollist ristisõdades, eriti 15. ja 16. sajandil."}}, {"course_week": 14, "time": "2024-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 13, "topic": {"et": "Karl V tagasiastumine"}, "description": {"et": "Seminaris käsitletakse Karl V tagasiastumisega seotud allikaid."}}, {"course_week": 15, "time": "2024-12-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 14, "topic": {"et": "Habsburgide surm ja mälestamine"}, "description": {"et": "Loengut peab Mihkel Mäesalu."}}]}, "registration_info": {"audience": {"et": "Üldajaloo valikaine"}, "min_students": 2}, "parent_uuid": "00009c92-2480-11d9-0b94-2035e58e1380", "parent_code": "HVAJ.07.007", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}