{"uuid": "c9877137-843d-d0eb-6d84-404a2f26c5b6", "code": "HVEE.05.023", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Didactics of Estonian Language and Estonian Literature", "et": "Eesti keele ja kirjanduse didaktika alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE05", "structural_unit_name": {"en": "Department of Applied Linguistics", "et": "rakenduslingvistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE05", "name": {"en": "Department of Applied Linguistics", "et": "rakenduslingvistika osakond"}, "phone": "+372 737 5227", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "f62722de-d3fd-34fc-9f8a-261fcd1a1366", "code": "FLEE.09.017", "title": {"en": "Estonian Phonetics and Phonology", "et": "Eesti foneetika ja fonoloogia"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "8a9bc3c5-6df1-b3b7-bb26-6a1ff5c011d7", "code": "FLEE.02.183", "title": {"en": "Morphology of the Estonian Language", "et": "Eesti keele vormiõpetus"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "9c73570d-10a9-0c4e-e0a8-359b1abb63fd", "code": "FLEE.02.184", "title": {"en": "Word Formation of Estonian Language", "et": "Eesti keele sõnavara struktuur ja sõnamoodustus"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "4145317f-fe3c-0b10-d61f-ef2d88227ded", "code": "FLEE.02.097", "title": {"en": "Syntax of Estonian Language", "et": "Eesti keele lauseõpetus"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "During the course the main principles of teaching Estonian are treated. The course takes a cursory look at the development of mother tongue didactically. The usage methods and the important ways of achieving studying goals, based on the current teaching materials, are introduced.", "et": "Käsitletakse emakeeleõpetuse põhiprintsiipe. Põgusalt peatutakse emakeeledidaktika arengulool. Tutvustatakse käibivate õppematerjalide kasutamismeetodeid ja olulisi õppe-eesmärkide saavutamise võimalusi."}, "objectives": [{"en": "The goal of the course is to ensure that the student knows the principles of teaching and can take them into account in teaching literacy and literature; that the student has acquired the general principles of teaching, educating and managing the classroom; is familiar with the content of the general curriculum and the curriculum for literacy and literature education in  the comprehensive and secondary school, knows the basic ways to develop competencies through teaching literacy and literature; knows the basic principles for planning teaching activities and lessons; knows the difference between subject-centred and student centred approaches to teaching and is able to take it into account in planning lessons; knows different methods of assessment and common mistakes in student assessment; has an overview of the current teaching materials for literacy and literature teaching.", "et": "Kursusega taotletakse, et üliõpilane tunneb didaktikaprintsiipe ja oskab neid arvestada eesti keele ja kirjanduse õpetamisel; on omandanud aine õpetamise, kasvatuse ja klassiruumi haldamise üldised alused; on tuttav riikliku õppekava ja eesti keele ja kirjanduse ainekavade sisuga; tunneb põhilisi pädevuste arendamise võtteid eesti keele ja kirjanduse õpetuses; tunneb tunni ülesehitust ja planeerimise aluseid; oskab arvestada aine- ja õpilasekesksuse põhimõtetega tundide ettevalmistamisel ja kavandamisel; tunneb erinevaid hindamisviise ja hindamisega seotud probleeme; omab ülevaadet käibelolevatest eesti keele ja kirjanduse õppevahenditest."}], "learning_outcomes": [{"en": "The student successfully completing the course has acquired the general principles of teaching, educating and managing the classroom; knows different teaching conceptions, methods and ways; Knows the basics of classroom management and the most common mistakes young teachers do; is familiar with the content of the general curriculum and the curriculum for literacy and literature education in  the comprehensive and secondary school, knows the basic principles for planning teaching activities and lessons; knows different methods of assessment and common mistakes in student assessment; has an overview of the current teaching materials for literacy and literature teaching.", "et": "Kursuse sooritanu teab didaktika põhiolemust ja -probleeme, tunneb peamisi didaktikaprintsiipe;\n- tunneb erinevaid õpi- ja õppimiskäsitlusi, õppevorme ja -meetodeid;\n- tunneb klassi juhtimise põhiprintsiipe ja oskab ette näha ohte noorele õpetajale;\n- teab riikliku õppekava põhiprintsiipe ja eesti keele ja kirjanduse ainekava sisu ja eesmärke;\n- teab tunni põhilisi ülesehitusvõimalusi õpilase ja õppekava vajadustest lähtuvalt;\n- tunneb erinevaid hindamisviise ja oskab ette näha hindamisega seotud ohte;\n- omab ülevaadet eesti keele ja kirjanduse õppematerjalidest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}