{"uuid": "d7c82883-64f4-2426-d710-1a8ebc6638e2", "code": "HVEE.00.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Spoken and Written Communication in Estonian", "et": "Eesti keele suulise ja kirjaliku väljenduse õpetus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE", "structural_unit_name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course supports the writing of thesis in Estonian. All independent work done in the course is related to the topic of student's thesis. \nThe course is divided into two modules.\n1. Communication skills in writing: general principles of academic text, reference, citation, reference management, discipline-specific language, discipline-specific information research, process oriented writing, sources of practical language planning, professional text.\n2. Communication skills in speaking: general principles of spoken language, public speaking, preparing and giving a presentation.\nOrthography topics are embedded in other topics and are addressed throughout the course.", "et": "Ainekursus toetab eestikeelse lõputöö kirjutamist. Kõik kursusel tehtavad iseseisvad tööd on seotud üliõpilase lõputöö teemaga.\nAinekava jaguneb kaheks mooduliks.\n1. Kirjalik väljendusoskus: akadeemilise teksti üldpõhimõtted, refereerimine, tsiteerimine, viitamine, viitehaldus, erialakeel, erialainfootsing, protsessikeskne tekstiloome, keelehooldeallikate kasutamine, tarbetekst.\n2. Suuline väljendusoskus: suulise teksti eripära, avalik esinemine, ettekande koostamine ja pidamine.\nOrtograafia teemad on põimitud teiste teemade sisse ja neid käsitletakse läbivalt."}, "objectives": [{"en": "The aim is to improve the communication skills in writing and speaking of undergraduate students of the Faculty of Science and Technology and to support students in writing their thesis.", "et": "Eesmärk on tõhustada loodus- ja täppisteaduste valdkonna bakalaureuseõppe üliõpilaste erialase suulise ja kirjaliku eneseväljenduse oskust ning toetada neid lõputöö kirjutamisel."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the students:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- follow the guidelines of their speciality or institute and the principles of academic text when compiling the thesis;", "et": "- lähtub lõputöö koostamisel oma eriala või instituudi kirjalike tööde vormistamise juhendist ja akadeemilise teksti eripärast;"}, {"en": "- apply the principles of process oriented writing in order to develop their writing skills;", "et": "- rakendab akadeemilise teksti koostamisel protsessikeskse tekstiloome võtteid, et arendada oma kirjutamisoskust;"}, {"en": "- are able to find relevant information about orthography from the practical language planning sources;", "et": "- oskab otsida keelehooldeallikatest asjakohast teavet õigekirjutuse kohta;"}, {"en": "- apply the main features of plain language;", "et": "- rakendab akadeemilise teksti loomisel selgekeelsuse põhimõtteid;"}, {"en": "- use effective techniques when giving a presentation.", "et": "- kasutab ettekande pidamisel esinemist toetavaid võtteid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}