{"uuid": "0f48ecbe-39c4-e574-256f-9f4479ef04ff", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-09T09:23:58", "title": {"en": "Digital Fieldwork and Documentation Methods", "et": "Digitaalsed välitööde ning keele dokumenteerimise meetodid"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVEE03", "name": {"en": "Department of Finno-Ugric Studies", "et": "soome-ugri osakond"}, "phone": "+372 737 5423", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}, "label": {"en": "24/25 S regular HV Eng", "et": "24/25 K PÕ HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE03", "structural_unit_name": {"en": "Department of Finno-Ugric Studies", "et": "soome-ugri osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 8, "practice": 3, "seminar": 4, "independent_work": 141, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": ".", "et": "."}, "objectives": [{"en": "The aim of this course is to provide students with both technical skills and theoretical knowledge needed to carry out linguistic fieldwork on Finno-Ugric languages using modern, digital techniques. It is intended for students who have basic training in the main subfields of descriptive linguistics (phonology, morphology and syntax) and are familiar with grammatical structures in at least one Finno-Ugric language. In the course, we will use digital technologies to support documentation and exploring languages and/or dialects under investigation. This will include learning and practicing how to successfully record elicitation and spontaneous language use, how to collect and store metadata, how to transcribe and annotate recordings (using the software ELAN), and how to securely store, archive and make accessible the documentation and its derivates. In this, we will also focus on methods for working with langauge consultants to collect information about inherent grammatical structures and to transcribe spontaneous speech. Last but not least, ethical and legal issues will be discussed throughout.", "et": "."}], "learning_outcomes": [{"en": "After completing the course, students:\n- can use digital recording devices to create quality recordings of linguistic events, especially using audio (but with some basic use of video as well)\n- can successfully lead fieldwork sessions to attempt to understand grammatical structures in an unfamiliar langauge\n- can develop and implement an appropriate annotation structure for transcribing and annotating recordings using ELAN\n- understand the legal and ethical complexities of working with personal data in linguistics fieldwork, and know how to take measures to ensure legal and ethical standards are adhered to\n- can collect and manage metadata\n- can ensure that digital results of fieldwork will be useful and accessible in a transparent way, even in the long-term\n- can conceive of a project plan for a language documentation project", "et": "."}], "notes": {}}, "grading": {"independent_work": {"et": "1.\tIndependent reading of theoretical literature, review of slides and other class materials; see moodle for details.\n2.\tEssay: write a preliminary project description  for a linguistics fieldwork/documentation project; see moodle for details.\n3.\tMini-project: complete a short fieldwork project, including doing a recording, collecting metadata, and transcribing and annotating the session in ELAN; see moodle for details."}, "grade_preconditions": {"et": "-\tnot more than 3 unexcused absences\n-\tsubmission of essay and mini-project"}, "grade_evaluation": {"et": "50% essay grade and 50% mini-project grade; in borderline cases, level of active class participation will be considered."}, "grade_conditions": {"A": {"et": "The essay is insightful, well-thought out, and considers all relevant points concerning fieldwork methods, recording techniques, ethics, software, archiving, project design and even other potentially relevant aspects. The mini-project consists of a high-quality recording, a well-thought out ELAN structure, detailed transcriptions and relevant annotations, and thorough, structured metadata. Participation: active, regular participation in class discussions and regular attendance; 90-100% of all possible points."}, "B": {"et": "The essay is relatively insightful and shows some good insights; most relevant points concerning fieldwork methods, recording techniques, ethics, software, archiving, project design are covered. The mini-project consists of a medium-quality recording, a solid ELAN structure, quality transcriptions and mostly relevant annotations, and rather thorough, structured metadata. Participation: active, regular participation in class discussions and regular attendance; 80-89% of all possible points."}, "C": {"et": "The essay is presented sufficiently but lacks thoroughness; many relevant points concerning fieldwork methods, recording techniques, ethics, software, archiving, project design are covered, but some are missing. The mini-project consists of a recording with acceptable quality but some problems, a basic ELAN structure, somewhat inconsistent transcriptions and basic annotations, and minimal, not consistently structured metadata. Participation: active, somewhat irregular participation in class discussions and somewhat regular attendance; 70-79% of all possible points."}, "D": {"et": "The essay is minimally sufficiently and lacks thoroughness; only a few relevant points concerning fieldwork methods, recording techniques, ethics, software, archiving, project design are covered, but most are missing. The mini-project consists of a poor-quality recording with multiple problems, a very basic or partially incomplete ELAN structure, inconsistent transcriptions and minimal or missing annotations; minimal, inconsistently structured metadata. Participation: irregular participation in class discussions; irregular attendance; 60-69% of all possible points."}, "E": {"et": "The essay is poorly presented, barely sufficient, lacks thoroughness; few relevant points concerning fieldwork methods, recording techniques, ethics, software, archiving, project design are covered at all and only insufficiently described. The mini-project consists of an exceptionally poor-quality recording with many problems, an exceptionally basic and partially incomplete ELAN structure, very inconsistent transcriptions and very minimal or missing annotations; very minimal, inconsistently structured metadata. Participation: no participation in class discussions; irregular attendance; 50-59% of all possible points."}, "F": {"et": "The essay and/or the mini-project are incomplete and or not submitted at all. Participation: no participation in class discussions; more than 3 unexcused absences; less than 50% of all possible points."}}, "debt_elimination": {"et": "Contact the instructors to request changing submission deadlines (only if there is an urgent, valid need)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "By the end of the semester (contact the instructors if an earlier date is needed)."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "74ae83b2-a68f-47eb-82cf-18ab58039d2c", "type": "MOODLE", "code": "HVEE.03.027_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "7d1896bd-7571-e53a-7b79-a4d87d8a42e0", "person_name": "Elena Markus", "structural_unit": {"code": "HVEE03", "name": {"en": "Department of Finno-Ugric Studies", "et": "soome-ugri osakond"}, "phone": "+372 737 5423", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "f40b5efe-5e30-2f79-738b-f878e6178388", "person_name": "Fedor Rozhanskiy", "structural_unit": {"code": "HVEE03", "name": {"en": "Department of Finno-Ugric Studies", "et": "soome-ugri osakond"}, "phone": "+372 737 5423", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "4c08efb0-6068-fdcd-612e-b0b832320b5c", "person_name": "Joshua Karl Wilbur", "structural_unit": {"code": "HVEE06", "name": {"en": "Centre for Digital Humanities and Information Society, University of Tartu", "et": "digihumanitaaria ja infoühiskonna keskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVEE"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-38. (see moodle for detailed schedule)"}}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 15}, "parent_uuid": "a4ec16f1-a1a6-032d-06f8-91d0bc4256ac", "parent_code": "HVEE.03.027", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}