{"uuid": "51164958-9009-76bd-1e82-4267f84b41bf", "code": "HVEE.05.047", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Language Communication Course with a Language Friend", "et": "Eesti keele suhtluskursus keelesõbraga"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE05", "structural_unit_name": {"en": "Department of Applied Linguistics", "et": "rakenduslingvistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE05", "name": {"en": "Department of Applied Linguistics", "et": "rakenduslingvistika osakond"}, "phone": "+372 737 5227", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is formed as a pair work of students with Estonian and non-Estonian mother tongue. A student with a non-Estonian mother tongue is paired with a language friend who is a student with an Estonian mother tongue, with whom the content and activities of the course meetings are thought through. All participants fill out an individual learning diary in Moodle, where a short description should be made for each language learning meeting that took place.", "et": "Kursus toimub eesti ja mitte-eesti emakeelega üliõpilaste paaristööna. Mitte-eesti emakeelega üliõpilase paariliseks on eesti emakeelega üliõpilasest keelesõber, kellega koos mõeldakse läbi kursuse kohtumiste sisu ja tegevused. Kõik osalejad täidavad Moodle'is individuaalset õpipäevikut, kuhu tuleb iga toimunud keeleõppekohtumise kohta teha lühike sissekanne."}, "objectives": [{"en": "To give Estonian-speaking students the first experience of teaching their mother tongue as a foreign language and the opportunity to act as a mediator of Estonian culture. To provide non-Estonian native students the opportunity to develop communication skills in Estonian and to improve their knowledge of Estonian society and culture. Develop cooperation, communication and time management skills.", "et": "Anda eesti emakeelega üliõpilastele oma emakeele võõrkeelena õpetamise esmane kogemus ning võimalus olla eesti kultuuri vahendaja rollis.  Pakkuda mitte-eesti emakeelega üliõpilastele võimalust arendada eesti keeles suhtlemise oskust ja täiendada teadmisi eesti ühiskonnast ja kultuurist. Arendada koostöö-, suhtlus- ja ajaplaneerimisoskust."}], "learning_outcomes": [{"en": "A native Estonian speaking student who completed the course", "et": "Kursuse läbinud eesti emakeelega üliõpilane"}, {"en": "a) has gained first-hand experience of teaching his mother tongue as a foreign language and introducing Estonian society and culture;", "et": "a) on saanud oma emakeele võõrkeelena õpetamise ja eesti ühiskonna ning kultuuri tutvustamise esmase kogemuse;"}, {"en": "b) has developed his cooperation, communication and time management skills.", "et": "b) on arendanud oma koostöö-, suhtlus- ja ajaplaneerimisoskust."}, {"en": "A student with a non-Estonian mother tongue who completed the course", "et": "Kursuse läbinud mitte-eesti emakeelega üliõpilane"}, {"en": "a) has developed his Estonian language communication competence;", "et": "a) on arendanud oma eesti keele suhtluspädevust;"}, {"en": "b) has improved his knowledge of Estonian society and culture;", "et": "b) on täiendanud oma teadmisi eesti ühiskonnast ja kultuurist;"}, {"en": "c) has developed his cooperation, communication and time management skills.", "et": "c) on arendanud oma koostöö-, suhtlus- ja ajaplaneerimisoskust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}