{"uuid": "fd2524b8-b358-9981-8c8e-acbf67e97134", "code": "HVEE.03.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Votic in the Context of Other Minor Finnic Languages of Ingria", "et": "Vadja keel Ingerimaa teiste vähemuskeelte kontekstis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE03", "structural_unit_name": {"en": "Department of Finno-Ugric Studies", "et": "soome-ugri osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE03", "name": {"en": "Department of Finno-Ugric Studies", "et": "soome-ugri osakond"}, "phone": "+372 737 5423", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Votic phonetics, morphophonology (grade alternations, gemination), nominal morphology (case, number), pronouns, numerals, comparative degree of adjectives, verbal morphology (person, number, tense, mood, polarity). History of Ingria, language extinction, language shift, language continuum, fieldwork.", "et": "Kursusel käsitletakse vadja keele foneetikat, morfofonoloogiat (astmevaheldus, geminatsioon), morfoloogiat (nime-, ase- ja omadussõnu ning tegusõnade vorme). Samuti Ingerimaa ajalugu, keelevahetuse, keele väljasuremise ning välitööde teemasid."}, "objectives": [{"en": "The goal of the course is to give the basic knowledge of the Votic language (phonetics, grammar, and syntax) in the context of other minor Finnic languages spoken in Ingria. The course pays much attention to the history of the region, the current sociolinguistic situation, language contacts, identities and the problem of a dialect continuum. Also, methodology of field research on a nearly extinct language will be discussed.", "et": "Kursuse eesmärk on anda algteadmisi vadja keelest (foneetika, grammatika ja süntaks) teiste Ingerimaal kõneldavate soome vähemuskeelte taustal. Kursusel pööratakse suurt tähelepanu piirkonna ajaloole, praegusele sotsiolingvistilisele olukorrale, keelekontaktidele, identiteedi küsimusele ja murrete kontiinumile. Samuti arutatakse peaaegu väljasurnud keele välitööde meetodeid."}], "learning_outcomes": [{"en": "The students will get to know the structure, dialectology, and history of the Votic language, be able to read and analyse Votic texts, understand the typical effects of language contacts in multilingual environment, and get acquainted with the principles of collecting field data from speakers of highly endangered languages.", "et": "Kursuse läbinud üliõpilane tunneb vadja keele struktuuri, dialektoloogiat ja ajalugu, oskab lugeda ja analüüsida vadjakeelseid tekste, suudab mõista keelekontaktide tüüpilisi mõjusid mitmekeelses keskkonnas, ja tunneb välitöödel andmete kogumise meetodeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}