{"uuid": "8266da1f-11ff-3644-d13f-b496c2e38238", "code": "HVEE.00.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-04T15:30:00", "title": {"en": "Professional Practice of Estonian and Finno-Ugrian Linguistics", "et": "Eesti ja soome-ugri keeleteaduse erialapraktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE", "structural_unit_name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "There are two ways to complete the professional practice:\n1) Do professional practice in one semester at one institution. To do this, register for the \"Professional Practice of Estonian and Finno-Ugrian Linguistics\" subject. If you want to start the practice in the middle of the semester or e.g. in the summer, write to the practice lecturer Maria Reile (maria.reile@ut.ee). \n2) Complete a practice portfolio during the entire study period, i.e. do various practices at several institutions. To do this, write to the practice lecturer Maria Reile (maria.reile@ut.ee). You do not need to register for the subject if you plan the work-activities needed to complete the practice for a longer period than one semester. \n\nThe list of practice places, the practice diary and portfolio, etc. can be found in the \"Eesti ja soome-ugri keeleteaduse praktika\" Moodle study guide (\"Õpijuhis\"). Everyone can access Moodle, it is not necessary to be registered for the subject or Moodle.", "et": "Praktika läbimiseks on kaks võimalust: \n1) Tee praktika ühes jaos ja ühes asutuses. Selleks registreeri end \"Eesti ja soome-ugri keeleteaduse erialapraktika\" ainesse. Kui soovid praktikat alustada keset semestrit või nt suvel, siis kirjuta praktika õppejõule Maria Reilele (maria.reile@ut.ee). \n2) Täida kogu õppeperioodi vältel praktikaportfooliot ehk tee mitmesugust praktikat mitmes asutuses. Selleks kirjuta praktika õppejõule Maria Reilele (maria.reile@ut.ee). Praktikaainele pole end vaja registreerida, kui plaanid praktika läbimiseks vajaminevad tööd-tegevused pikema aja peale kui üks semester. \n\nPraktikakohtade loendi, praktikapäeviku ja -portfoolio jm leiab \"Eesti ja soome-ugri erialapraktika\" Moodle'i õpijuhendist. Moodle'ile pääsevad kõik ligi, selleks ei pea ainele ega Moodle'isse registreeritud olema."}, "objectives": [{"en": "The aim of the practical training is to give students practical work experience in their chosen specialty outside the university or, as an exception, in one of its units. During the practical training students improve their knowledge and skills in the specialty and across specialties as well as skills related to self-directed student and people. Students will become more aware of career development opportunities in their specialty and in the wider field of arts and humanities.", "et": "Erialapraktika eesmärk on anda üliõpilasele omandataval peaerialal praktiline töökogemus väljaspool ülikooli või erandjuhul mõnes selle allasutuses. Praktika käigus arendab üliõpilane individuaalselt erialaseid ja erialaüleseid teadmisi ning praktilisi oskusi, aga ka ennastjuhtiva õppija ja inimestega seotud oskusi. Praktika käigus suureneb üliõpilase teadlikkus võimalustest kujundada karjääri oma erialal ning humanitaarteaduste ja kunstide valdkonnas laiemalt."}], "learning_outcomes": [{"en": "Students:", "et": "Praktikant:"}, {"en": "* apply the knowledge and skills acquired in their specialty in the work environment, taking into account its special requirements;", "et": "* rakendab omandatud erialateadmisi ja -oskusi töökeskkonnas, arvestades selle erinõudeid;"}, {"en": "* complete practical training tasks in an organized and purposeful manner", "et": "* täidab süsteemselt ja eesmärgipäraselt praktikaülesandeid; "}, {"en": "* develop their communication, cooperation and time management skills and are more aware of themselves, their skills in their specialty and their people skills;", "et": "* arendab suhtlus-, koostöö- ja ajaplaneerimisoskust ning on teadlikum endast, oma erialastest ja inimestega seotud oskustest;"}, {"en": "* give feedback to their supervisor, analyze and apply the feedback given by the supervisor", "et": "* annab praktikajuhendajatele tagasisidet ning analüüsib ja rakendab juhendajatelt saadud tagasisidet;"}, {"en": "* analyze the practical training experience in the context of their studies and career development and value practical training as part of the learning process.", "et": "* analüüsib erialast praktikakogemust oma õpingute ja karjäärikujundamise kontekstis ning väärtustab praktikat õppeprotsessi osana."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}