{"uuid": "cab003e8-9729-82c4-2106-410e8c7266e3", "code": "HVEE.00.010", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice of Digital Humanities", "et": "Digihumanitaaria praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE", "structural_unit_name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The practice is individual and will take place in a government office, private business or a non-government organization related to digital humanities under the guidance of supervisors from the place of the practice and the university. During the internship the student acquires both digital humanities knowledge and general work experience. The student will find the institution for the practice or the university supervisor will help to find the place of the practice and a supervisor that is suitable for the student.", "et": "Praktika on individuaalne ja toimub digihumanitaariaga seotud riigiasutuses, äriettevõttes või vabaühenduses praktikakoha- ja ülikoolipoolse juhendaja juhendamisel. Üliõpilane omandab praktikal esmaseid digihumanitaaria-alaseid teadmisi ja üldisi töökogemusi. Praktikakoha leiab üliõpilane ise või see otsitakse üliõpilase soovidest lähtuvalt koos õppeaine vastutava õppejõuga."}, "objectives": [{"en": "- to learn how to integrate ICT skills with humanities knowledge in a work environment;", "et": "- õppida IKT-oskuste ja humanitaarteaduste lõimimist töökeskkonnas;"}, {"en": "- to acquire a basic competence of digital humanities in a work environment;", "et": "- omandada töökeskkonnas õppides esmane digihumanitaaria-alane pädevus;"}, {"en": "- to develop the skills of analyzing critically the content of studies through the experience of internship.", "et": "- arendada oskust õpitut praktikakogemuste põhjal analüüsida ja kriitiliselt hinnata."}], "learning_outcomes": [{"en": "After completing the practice, the student is able to:\n- know the components of the practice (work environment, supervisor, contract, report of the practice, feedback); \n- make a time schedule and manage time;\n- gain experience in collecting, systemizing and analyzing information;\n- describe and analyze the experience of the practice;\n- gain experience in team work and develope communication skills;\n- gain primary skills for integrating ICT-skills with humanities in the work environment;\n- value the practice as a part of the study process;", "et": "Üliõpilane\n- teab praktika komponente (töökeskkond, juhendaja, leping, praktikaaruanne, tagasiside);\n- oskab koostada praktika ajakava ja oma aega planeerida;\n- on saanud teabe kogumise, süstematiseerimise ja analüüsimise kogemuse;\n- oskab praktikakogemust kirjeldada ja analüüsida;\n- on omandanud meeskonnatöö kogemusi ja arendanud suhtlusoskusi;\n- on omandanud esmase IKT-oskuste ja humanitaarteaduste lõimimise oskuse\ntöökeskkonnas;\n- väärtustab praktikat õppeprotsessi osana;"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}