{"uuid": "0f8eb39b-5ba7-e787-13d1-76e99eca40fc", "code": "HVEE.01.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"vro": "Lõunõeesti keeleq", "en": "South Estonian Languages", "et": "Lõunaeesti keeled"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE01", "structural_unit_name": {"en": "Department of Estonian", "et": "eesti keele osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE01", "name": {"en": "Department of Estonian", "et": "eesti keele osakond"}, "phone": "+372 737 5224", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVEE"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"vro": "Kursus om mõtõld peris alostajilõ, kel olõ-õi innemb lõunõeesti keelega kokkoputmist olnuq, a ka noilõ, kiä jo kiilt vähäkese tundvaq, a tahtnuq umma keelemõistmist parandaq. Saias tutvas lõunõeesti keele aoluu ja täämbädse pääväga, opitas praktilidsõlt võro kiilt, kullõldas seto, mulgi ja tarto keelt ni kaias, kuis noil keelil vaiht tetäq.", "en": "The course aims to give an introduction into the historical development and the present stage of South Estonian languages. Students learn Võro language on elementary level and learn to distinguish Seto, Mulgi and Tartu languages.", "et": "Kursus on mõeldud päris algajatele, kellel ei ole olnud enne lõunaeesti keeltega kokkupuutumist, aga ka neile, kes juba pisut mõnda neist keeltest tunnevad, kuid tahaksid oma oskusi parandada. Tutvutakse lõunaeesti keelte ajaloo ja tänapäevaga. Õpitakse praktiliselt võru keelt ning tutvutakse seto, mulgi ja tartu keelega, õppides neil vahet tegema."}, "objectives": [{"vro": "Kaias lõunõeesti keele aoluulist kujonõmist, jagonõmist, päämäidsi tunnusjuuni ja täämbädse päävä saiso. Läbi praktilidsõ keeleoppusõ saias algtasõmõl võro keele mõistminõ. Opitas seto, mulgi ja tarto keele tunnusjuuni ja saias teetäq, kuis noil keelil vaiht tetäq.", "en": "The course gives an overview of South Estonian historical development, division, main features and contemporary situation. Through practical learning students acquire elementary skills of Võro language. By reading and listening to the texts, the students learn about the characteristics of the Seto, Mulgi and Tartu languages and learn to distinguish them all.", "et": "Tutvutakse lõunaeesti keelte ajaloolise kujunemise, jagunemise, peamiste tunnusjoonte ja tänapäevase olukorraga. Läbi praktilise keeleõppe omandatakse algtasemel võru keele oskus. Tekste lugedes ja kuulates tutvutakse seto, mulgi ja tartu keele iseärasustega ja õpitakse neil kõigil vahet tegema."}], "learning_outcomes": [{"vro": "Kursusõ läbitennüq tundvad lõunõeesti keele jagonõmist, päämäidsi tunnusjuuni, keele kujonõmisluku ja täämbädse päävä saiso; niisama mõistvaq algtasõmõl võro kiilt (innekõgõ õigõkirotust, helüoppust ja sõnamuutmist), saavaq võrokiilsest tekstist arvo ni mõistvaq lihtsämbit lausit eesti keelest võro kiilde ümbre pandaq; mõistvaq seto, mulgi ja tarto keelel vaiht tetäq.", "en": "Students will know the historical development and contemporary situation of South Estonian and will have elementary skills of Võro (especially orthography, phonology, and inflection). Students understand Võro language and can translate simple sentences from Estonian into Võro; they know the main features of the Seto, Mulgi and Tartu languages and can distinguish them all.", "et": "Kursuse läbinud tunnevad lõunaeesti keele jagunemist, peamisi tunnusjooni, keele kujunemislugu ja tänapäevast olukorda; samuti valdavad võru keelt (eelkõige ortograafiat, fonoloogiat ja sõnamuutmist) elementaarsel tasemel, saavad võrukeelsest tekstist aru ning oskavad lihtsamaid lauseid eesti keelest võru keelde tõlkida; tunnevad seto, mulgi ja tartu keele peamisi iseärasusi ja oskavad neil kõigil vahet teha."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}