{"uuid": "a7cb8b16-cd6c-82fe-2d9f-e59f970573a9", "code": "HVEE.00.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to the Studies of Finno-Ugric Languages and Estonian Language", "et": "Sissejuhatus soome-ugri keelte ja eesti keele uurimisse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE", "structural_unit_name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The study history of Estonian and Finno-Ugric languages is introduced in the form of lectures and seminars. The first half of the course is dedicated to the study of Estonian, the second half to the study of other Finno-Ugric (Uralic) languages. The course include two independent homeworks that deepen knowledge on Estonian and Finno-Ugric linguistics. The course includes a visit to institutions that are related to studying, teaching or developing these languages.", "et": "Kursusel käsitletakse loengute ja seminaride vormis eesti keele ja soome-ugri keelete uurimise olulisemaid perioode, uurijaid  ja uurimissuundi nii minevikus kui tänapäeval, antakse ülevaade Uurali rahvastest ja keeltest ning tutvustatakse  olulisemaid uurimiskeskusi tänapäeval. Kursusesse on integreeritud õppekäik uurimisasutustesse Tallinnas. Kursuse käigus tehakse kaks iseseisvat tööd, mis puudutavad eesti ja soome-ugri keelte uurimislugu."}, "objectives": [{"en": "The main objective of the course is to provide an overview of Estonian and other Finno-Ugric languages and linguistics, the main milestones and central persons in the study history of these languages and main directions of current linguistic studies in this field. In addition the course increases competences in finding and assessing relevant  information related to the topics of the course.", "et": "Kursuse eesmärk on anda ülevaade soome-ugri keeltest ja eesti keelest ja keeleteadusest, nende keelte uurimise ajaloost ja levinumatest uurimissuundadest. Lisaks suurendab kursus pädevust otsida ja hinnata informatsiooni ja infoallikaid, mis on kursusel käsitletavate teemadega seotud."}], "learning_outcomes": [{"en": "After completing the course students", "et": "Kursuse läbinud üliõpilane"}, {"en": "- know which languages and language groups belong to the Uralic language family.", "et": "- teab mis keeled ja keelerühmad kuuluvad Uurali keelkonda, "}, {"en": "- know the main periods, milestones, researchers and relevant topics in the study of Uralic languages;", "et": "- tunneb Uurali keelte uurimisloo olulisemaid etappe ja suundi  ning olulisemaid uurijaid;"}, {"en": "- have deepened their knowledge on one language or relevant topic in the study history of Uralic languages;", "et": "- on tutvunud lähemalt ühe uurali keelekonda kuuluva keelega või uurimissuunaga;"}, {"en": "- know the main periods, milestones, researchers and relevant topics in the study of Estonian, ", "et": "- tunneb eesti keele uurimise olulisemaid etappe, uurijaid ning uurimissuundi;"}, {"en": "- have deepened their knowledge on one relevant topic in the study history of Estonian;", "et": "- on tutvunud lähemalt ühe keeleuurimissuunaga või olulise keeleuurija panusega eesti keele uurimisse;"}, {"en": "- know the main centers in Estonia where Estonian and other Finno-Ugric are studied;", "et": "- teab, millised on olulisemad eesti ja soome-ugri keelte uurimise ja arendamisega tegelevad asutused Eestis;"}, {"en": "- is able to find, assess and present relevant information related to the study of Estonian and Finno-Ugric languages.", "et": "- oskab otsida, kriitilsielt hinnata ning esitada informatsiooni eesti ja soome-ugri keelte uurimisloo kohta."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}