{"uuid": "08683b2c-d248-fa10-37a8-5b0e29e56f29", "code": "HVEE.00.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Digital Humanities Seminar", "et": "Digihumanitaaria seminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVEE", "structural_unit_name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVEE", "name": {"en": "Institute of Estonian and General Linguistics", "et": "eesti ja üldkeeleteaduse instituut"}, "phone": "+372 737 5221", "webpage_url": "https://keel.ut.ee", "address": "Jakobi 2, IV korrus\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, IV korrus", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides the foundations for independent research in digital humanities. The participant will read a number of digital humanities texts and discuss them in seminars. At the end of the course, the participant will design a research project in digital humanities. The contents of the course will partly depend on the background and interests of the participants. The course is meant for a student who already has some experience in courses related to the field of digital humanities and wants to further their knowledge.", "et": "Aine annab alused iseseisvaks uurimistööks digihumanitaaria vallas. Aine käigus loeb osaleja läbivalt eri laadi digihumanitaaria alaseid tekste ning arutleb nende sisu üle seminaris. Aine lõpus koostab osaleja ise uurimiskava. Aine täpne sisu sõltub osaliselt osalejate taustast ja huvidest. Aine on mõeldud tudengile, kes on juba digihumanitaaria valdkonnaga kokku puutunud ja soovib oma teadmisi süvendada."}, "objectives": [{"en": "The aim of the course is to give a student a necessary foundation to do independent research in digital humanities. The course introduces digital humanities texts in its various forms to the participant, and teaches their understanding and interpretation. The course provides the foundations to discuss these works and the first experience in designing a research project in digital humanities. The contents of the course will partly depend on the background and interests of the participants. The course is meant for a student who already has some experience in courses related to the field of digital humanities and wants to further their knowledge.", "et": "Aine eesmärgiks on anda üliõpilasele vajalikud alusteadmised, et teha iseseisvat uurimistööd digihumanitaaria vallas. Aine tutvustab osalejale digihumanitaariaalaseid tekste erinevates vormides ning õpetab neid mõistma ja tõlgendama. Aine annab alused valdkonna tööde teemal arutlemiseks ning annab esmase kogemuse digihumanitaariaprojekti kavandamisel. Aine täpne sisu sõltub osaliselt osalejate taustast ja huvidest. Aine on mõeldud tudengile, kes on juba digihumanitaaria valdkonnaga teistes kursustes kokku puutunud ja soovib oma teadmisi süvendada."}], "learning_outcomes": [{"en": "By the end of the course the students are familiar with the foundations of research in digital humanities. They can read and understand digital humanities communications in their main ways of dissemination - conferences, journals, datasets. They know how to find texts and data on the topics that interest them in digital humanities. They are able to discuss the works in the seminar group. They know how to initiate an independent research project in digital humanities.", "et": "Õppeaine läbinud üliõpilane on kursis digihumanitaaria uurimistöö alustega. Ta oskab lugeda ja mõistab digihumanitaarse uurimistöö esitlusi nende peamistes levikukanalites - konverentsidel, ajakirjaartiklites ning andmekogudes. Ta oskab leida tekste ja andmeid endale huvitavatel teemadel digihumanitaarias. Ta suudab ülal hoida arutlust nendest töödest seminarigrupis. Üliõpilane teab kuidas alustada iseseisvat uurimistööd digihumanitaaria vallas."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}