{"uuid": "c8797b69-9060-fe0a-3754-42c157b18213", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-20T16:09:33", "title": {"en": "Master's Seminar", "et": "Magistriseminar"}, "credits": 1, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 1, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVFI01", "name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "phone": "+372 737 5314", "webpage_url": "https://filsem.ut.ee/et/filosoofia-osakond", "address": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 315, 319-326, 328, 336-337", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVFI"}, "label": {"en": "25/26 S regular part 1 1 CP HV Eng", "et": "25/26 K PÕ 1. osa 1 EAP HV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVFI01", "structural_unit_name": {"en": "Department of Philosophy", "et": "filosoofia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "hours": {"lecture": 0, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 8, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The Master's seminar consists of two parts and takes place over three semesters. The first part of the seminar will focus on (a) the teaching of research skills (including how to approach a research topic, how to find relevant literature, how to read scientific literature, how to present your research in writing and orally, how to find and apply to relevant conferences, etc.) and (b) will provide students with an overview of what they need to do to apply to graduate school (if they wish to do so), and of how to use the MA to develop non-academic career paths (if they wish to do so). The second part of the seminar takes place in the second and third semesters. The second part of the seminar focuses on peer review of students’ research work by other students.", "et": "Magistriseminar koosneb kahest osast ja toimub kolme semestri vältel. Esimene osa keskendub (a) uurimistöö oskuste õpetamisele (kuidas läheneda uurimisteemale, kuidas leida relevantset kirjandust, kuidas lugeda teaduslikku kirjandust, kuidas esitleda oma uurimistööd kirjalikult ja suuliselt, kuidas leida sobivateemalisi konverentse ning neile kandideerida jne) ja (b) annab üliõpilastele ülevaate sellest, mida on vaja teha doktoriõppesse kandideerimiseks (kui nad soovivad seda teha), ning kuidas kasutada magistriharidust mitteakadeemilise karjääritee arendamiseks (kui nad soovivad seda teha). Seminari teine osa toimub teisel ja kolmandal semestril. Seminari teine osa keskendub üliõpilaste uurimistööde kursusekaaslaste-poolsele tagasisidestamisele."}, "objectives": [{"en": "The purposes of the MA seminar are (a) to develop a skillset helpful in conducting independent research and (b) to provide a space for students to do their research work socially, developing their research through peer review in various formats.", "et": "Magistriseminari eesmärgid on: (a) arendada oskuste kogumit, mis on kasulik iseseisva uurimistöö läbiviimiseks, ja (b) pakkuda üliõpilastele ruumi uurimistöö tegemiseks sotsiaalsel viisil, arendades oma uurimistööd kursusekaaslastelt erinevates formaatides saadud tagasiside abil."}], "learning_outcomes": [{"en": "On successful completion of the course, the student", "et": "Õppeaine läbinud õppija:"}, {"en": "has practiced crucial skills for successful research, such as defining a research problem,", "et": "on harjutanud eduka uurimistöö jaoks vajalikke oskusi, näiteks uurimisprobleemi määratlemist,"}, {"en": "can search for relevant sources, knows relevant databases, knows reference management software and other important research tools,", "et": "oskab otsida asjakohaseid allikaid, tunneb asjakohaseid andmebaase, oskab kasutada viitehaldustarkvara ja muid olulisi uurimisvahendeid,"}, {"en": "has practiced presentation skills and question & answer routineboth for a mono-disciplinary and inter-disciplinary audience,", "et": "on harjutanud esinemisoskust ning küsimuste ja vastuste esitamise praktikat nii mono- kui ka interdistsiplinaarsele publikule,"}, {"en": "has learned how to write an abstract and a handout,", "et": " on õppinud, kuidas kirjutada kokkuvõtet ja käsilehte,"}, {"en": "can do philosophy socially, i.e., provide constructive feedback and helpfully participate in the discussion of the work of others,", "et": "oskab filosofeerida koos teistega, st anda konstruktiivset tagasisidet ja osaleda abivalmilt kaaslaste tööde arutelus,"}, {"en": "is in a position to apply to PhD programmes in philosophy or related disciplines,", "et": "on võimeline kandideerima filosoofia või sellega seotud erialade doktoriõppesse,"}, {"en": "has learned time management and project management skills.", "et": "on õppinud aja- ja projektijuhtimise oskusi."}], "notes": {"et": "Prerequisite courses: Start module of the Philosophy in Practice MA."}}, "grading": {"independent_work": {"et": "Independent work might consist of preparing for MA seminar meetings through readings, submitting written works, or preparing for a presentation."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "MA seminar is graded in a non-differentiated manner (pass/fail). \nIn order to pass, the students have to meet the following conditions during their 2nd study semester:\n1. Seminar participation (full participation unless good reasons are given to the lecturer in advance)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "2. Completion of smaller independent assignments (pass-fail criteria).\nThese assignments concern students' research practices (e.g., time management and literature review ability)."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "3. Presentation\nEach student presents their own research ideas at least once per semester. All students are expected to be helpful members of the seminar team by improving the research work shared with them. When students present their own research as the basis for doing philosophy socially in the seminar, they will have 3 choices: \n* to hold a 40-minute presentation followed by a critical and constructive effort to improve the work by the whole seminar; \n* to submit a paper (maximum 20 pages) to be pre-read before the seminar. The seminar will then consist of critical and constructive efforts to improve the work by the whole seminar; \n* to produce a 3-page version of their research work, which will be read for 40 minutes in the seminar and followed by critical and constructive efforts to improve the work by the whole seminar."}}], "grade_preconditions": {"et": "Seminar participation is required throughout the semester; independent assignments have to be fulfilled correctly and on time."}, "grade_evaluation": {"et": "Seminar participation is required throughout the semester; independent assignments have to be fulfilled correctly and on time."}, "debt_elimination": {"et": "In case of a missed seminar, please contact the instructor for any replacement work."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "All materials and assignments can be found in course Moodle.", "recommended_materials": "See Moodle."}, "participants": {"lecturers": [{"person_uuid": "1cb0f1ea-baed-c018-9ef1-64a85c0a7a04", "person_name": "Francesco Orsi", "structural_unit": {"code": "HVFI01PF", "name": {"en": "Chair of Practical Philosophy", "et": "praktilise filosoofia õppetool"}, "phone": "+372 737 5317", "address": "r 326, 328\nEST", "street": "r 326, 328", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-39"}}, "registration_info": {"audience": {"et": "Philosophy in Practice MA students"}, "min_students": 4, "max_students": 20}, "parent_uuid": "4b8c2c1b-0fa6-228d-bb91-6f55ea73776b", "parent_code": "HVFI.01.004", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}