{"uuid": "bee725a9-711f-76c2-4a0d-8bbc764eb11d", "code": "HVKU.03.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Seminar on Ethnology", "et": "Etnoloogia seminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the first part of the course the focus is on different stages related to planning a BA studies research project in ethnology, specific problems involved in each stage are discussed in detail. As the result of the first part of the course each student writes up an independent BA thesis research proposal. During the second part of the course the focus is on conducting individual research work under specialised supervision and with the help of respective development seminars.", "et": "Kursuse esimeses osas keskendutakse planeeritava lõputöö kavandi koostamise eri etappidele, lähemalt käsitletakse iga kavandi osaga seotud spetsiifilisi probleeme; kursuse esimese osa lõpuks valmib igaühel individuaalne lõputöö kavand. Kursuse teises osas keskendutakse individuaalse uurimisprojekti täitmisele erialase juhendaja ja vastavate arenguseminaride toel."}, "objectives": [{"en": "The objective of the course is to prepare master's students for independent research and to give feedback to their individual projects. During the first part of the course the focus is on different stages related to planning a BA studies research project in ethnology, specific problems involved in each stage are discussed in detail. As the result of the first part of the course each student writes up an independent BA thesis research proposal. During the second part of the course the focus is on conducting individual research work under specialised supervision and with the help of respective development seminars.", "et": "Valmistada üliõpilasi ette iseseisvaks uurimistööks oma bakalaureuseõppe lõputöö raames ning anda sellele jooksvalt individuaalset tagasisidet. Kursuse esimeses osas keskendutakse planeeritava lõputöö kavandi koostamise eri etappidele, lähemalt käsitletakse iga kavandi osaga seotud spetsiifilisi probleeme; kursuse esimese osa lõpuks valmib igaühel individuaalne lõputöö kavand. Kursuse teises osas keskendutakse individuaalse uurimisprojekti täitmisele erialase juhendaja ja vastavate arenguseminaride toel."}], "learning_outcomes": [{"en": "After successful completion of the course the student is able to:", "et": "Õppeaine edukal läbimisel oskab üliõpilane:"}, {"en": "- make informed choices concerning one's study path", "et": "- kavandada teadlikult oma õppimisprotsessi"}, {"en": "- (self)critically reflect upon one's learning experience", "et": "- reflekteerida (enese)kriitiliselt õppimiskogemuse üle;"}, {"en": "- plan an independent research project focusing on a manageable research topic during the BA studies;", "et": "- iseseisvalt planeerida akadeemilist uurimistööd piiritletud ja bakalaureuseõpingute raames teostataval teemal;"}, {"en": "- formulate research questions;", "et": "- püstitada uurimisküsimusi;"}, {"en": "- critically analyse the literature related to the topic;", "et": "- kriitiliselt analüüsida teemakohast erialast kirjandust;"}, {"en": "- plan the collection and analysis of the empirical material;", "et": "- kavandada teemakohase empiirilise materjali kogumist ja analüüsi;"}, {"en": "- draft the schedule of the research process.", "et": "- planeerida kogu uurimisprotsessi ajakava;"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}