{"uuid": "02f53178-0a54-ba1f-aa2a-5bd32b700324", "code": "HVKU.10.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Contemporary Societies of Asia and Middle East: Traditions, Innovations, Challenges", "et": "Tänapäeva Aasia ja Lähis-Ida ühiskonnad: traditsioonid, uuendused, väljakutsed"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU10", "structural_unit_name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU10", "name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "webpage_url": "https://flku.ut.ee/et/orientalistika-keskus", "address": "Ülikooli 18\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course introduces features and processes characterising contemporary Asian and Middle East societies. The course provides students with the basic knowledges and skills to analyse various (geo)political, economic, environmental factors, social and administrative systems, public relations, national cultural and ideological concepts, challenges and responses to the global concerns. The course regards relations between European Union and Asian and Middle East countries. The special attention is dedicated to analysis of Estonian trade relations and the opportunities to intensify them, including the detailed analysis of the Estonian export potential and countries import specifics. The course also includes a brief comparative analysis of different options of arranging business in the targeted countries and regions and provides students with the sufficient information and insights for making initial assessment of their capacities to enter local markets.", "et": "See kursus tutvustab tänapäeva Aasia ja Lähis-Ida ühiskondi iseloomustavaid funktsioone ja protsesse. Kursus annab õpilastele põhilised teadmised ja oskused erinevate (geo)poliitiliste, majanduslike, keskkonnategurite, sotsiaalsete ja haldussüsteemide, avalike suhete, rahvuskultuuriliste ja ideoloogiliste kontseptsioonide, väljakutsete ja globaalsete probleemide lahendamiseks. Kursus käsitleb Euroopa Liidu ning Aasia ja Lähis-Ida riikide suhteid. Erilist tähelepanu pööratakse Eesti kaubandussuhete analüüsile ja nende tihendamise võimalustele, sh Eesti ekspordipotentsiaali ja riikide impordi spetsiifika detailsele analüüsile. Kursus sisaldab ka lühikest võrdlevat analüüsi erinevate ettevõtete korraldamise võimaluste kohta sihtriikides ja piirkondades ning annab õpilastele piisavalt teavet ja teadmisi, et teha esialgne hinnang nende võimekusele siseneda kohalikele turgudele."}, "objectives": [{"en": "The aim of the course to introduce contemporary features and processes characterising societies and ethnic cultures of Asia and Middle East. The course aims to provide students with knowledges and analytical multidisciplinary tools to understand and interpret specific epistemological forms, models of behaviour, social values and cultural codes applied in various situations and spheres of today's life in Asia and Middle Eastern. The course is designed to provide students with the basic knowledge of contemporary (geo)political, economic, environmental situations, social and administrative systems, publicity, national cultural and ideological concepts. These form grounds for relevant understanding, strategic and prognostic analytics, decision making to develop collaborative relations, including business, with partners representing Asian and Middle East countries. The course provides skills to define possible problems and risks for new comers, including companies, in local conditions of the targeted regions and develops abilities to avoid or minimise unsolicited consequences. The course provides students with the practical intellectual basis and skills to build successful cross-cultural business interactions, productive and trustful professional relationships with countries of Asia and Middle East.", "et": "Kursuse eesmärk on tutvustada Aasia (Ida-ja Lõuna-Aasia) ja Lähis-Ida ühiskondi ja rahvuskultuure iseloomustavaid kaasaegseid jooni ja protsesse. Kursuse eesmärk on anda õpilastele teadmisi ja analüütilisi multidistsiplinaarseid vahendeid, et mõista ja tõlgendada konkreetseid Epistemoloogilisi vorme, käitumismudeleid, sotsiaalseid väärtusi ja kultuurikoode, mida rakendatakse tänapäeva elu erinevates olukordades ja valdkondades Aasias ja Lähis-Idas. Kursuse eesmärk on anda õpilastele põhiteadmised kaasaegsetest (geo)poliitilistest, majanduslikest, keskkonnaalastest olukordadest, sotsiaalsetest ja haldussüsteemidest, avalikust, rahvuskultuurilisest ja ideoloogilisest kontseptsioonist. Need on aluseks asjakohasele mõistmisele, strateegilisele ja prognostilisele analüüsile, otsuste tegemisele, et arendada koostöösuhteid, sealhulgas äri, partneritega, kes esindavad Aasia ja Lähis-Ida riike.\nKursus annab oskused uute soovijate, sealhulgas ettevõtete võimalike probleemide ja riskide määratlemiseks sihtpiirkondade kohalikes tingimustes ning arendab võimeid soovimatute tagajärgede vältimiseks või minimeerimiseks. Kursus annab õpilastele praktilise intellektuaalse aluse ja oskused edukate kultuuridevaheliste ärisuhete loomiseks, produktiivseteks ja usaldusväärseteks professionaalseteks suheteks Aasia ja Lähis-Ida riikidega."}], "learning_outcomes": [{"en": "Students completed the course will be able to think systematically, compare and analyse data, concerning variations of political, economic and social systems, cultural norms, models of perception, evaluation and behaviour in contemporary Asia and Middle East. Students will be able to understand and explain actual processes and situations, political attitudes, explain cooperative and conflicts factors, business behavior, mechanism of public relations in the contemporary life of targeted regions. Students will be prepared to understand and explain societal phenomena, business behavior, public attitudes, political, economic and social demands and developing processes in Asian and Middle East countries. Students will be able to apply gained knowledges and skills to practical situations of the personal and career development, concerning relations and business arrangements between Estonia and Asia and Middle East countries.", "et": "Kursuse läbinud õpilased saavad süstemaatiliselt mõelda, võrrelda ja analüüsida andmeid poliitiliste, majanduslike ja sotsiaalsete süsteemide, kultuuriliste normide, tajumise, hindamise ja käitumise mudelite kohta tänapäeva Aasias ja Lähis-Idas. Õpilased saavad mõista ja selgitada tegelikke protsesse ja olukordi, poliitilisi hoiakuid, selgitada koostöö-ja konfliktitegureid, ärikäitumist, avalike suhete mehhanismi sihtpiirkondade kaasaegses elus.\nÕpilased on valmis mõistma ja selgitama ühiskondlikke nähtusi, ärikäitumist, avalikke hoiakuid, poliitilisi, majanduslikke ja sotsiaalseid nõudmisi ning arenguprotsesse Aasia ja Lähis-Ida riikides. Õpilastel on võimalik rakendada omandatud teadmisi ja oskusi isikliku ja karjääri arendamise praktilistes olukordades, mis puudutavad suhteid ja ärikorraldust Eesti ning Aasia ja Lähis-Ida riikide vahel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}