{"uuid": "3078b4a9-aa18-3b93-157b-ef25f43678d4", "code": "HVKU.10.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Asian and Middle Eastern Civilizations", "et": "Aasia ja Lähis-Ida tsivilisatsioonid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU10", "structural_unit_name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU10", "name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "webpage_url": "https://flku.ut.ee/et/orientalistika-keskus", "address": "Ülikooli 18\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course gives a comprehensive introduction into the studies of the Asian and Middle Eastern societies in the frame of interdisciplinary approaches and analytics. Important part of the course is comparative study of historical processes, societies of regarding region, ways, factors and specifics of the development, mutual relations of states and peoples within particular periods and situations. The course provides knowledge and deeper insights on the historical grounds and causes of the contemporary conditions and situations in the targeted regions.", "et": "Kursus annab põhjaliku sissejuhatuse Aasia (Ida - ja Lõuna-Aasia) ja Lähis-Ida ühiskondade uuringutesse interdistsiplinaarsete lähenemisviiside ja analüüsi raames. Kursuse oluline osa on piirkonna ajalooliste ja kaasaegsete ühiskondade võrdlev uurimine, viisid, tegurid ja arengu eripära, riikide ja rahvaste vastastikused suhted teatud perioodidel ja olukordades. Kursus annab teadmisi ja sügavamaid teadmisi sihtpiirkondade kaasaegsete tingimuste ja protsesside ajaloolistest põhjustest ja põhjustest."}, "objectives": [{"en": "The aim of this course is to introduce societies of Asia (East and South Asia) and Middle East in their synchronic and diachronic perspectives, using analytics of multidisciplinary and social studies approaches. This course aims to form general and subject-specified practical competencies that allow students to work successfully in their chosen field and provide effective tools to improve their professional skills, competitive abilities and benefits at the labor market. The course is designed to provide students by the ability to use", "et": "Selle kursuse eesmärk on tutvustada Aasia (Ida - ja Lõuna-Aasia) ja Lähis-Ida ühiskondi nende sünkroon - ja diakroonilistes perspektiivides, kasutades multidistsiplinaarsete ja ühiskonnaõpetuse lähenemisviiside analüüsi."}, {"en": "in their professional activities the knowledge of traditional and modern problems of formation and development of social, political and cultural traditions of Asian and Middle East societies; the ability to apply historical, regional, cultural, comparative and other approaches in the interpretation of the latest social, economic, political processes in Asia and Middle East and to regard them in a broader context of the global international relations.", "et": "Selle kursuse eesmärk on moodustada üldised ja teemakohased Praktilised pädevused, mis võimaldavad õpilastel oma valitud valdkonnas edukalt töötada ja pakkuda tõhusaid vahendeid oma professionaalsete oskuste, konkurentsivõimeliste võimete ja kasu parandamiseks tööturul. Kursuse eesmärk on anda õpilastele võimalus kasutada oma professionaalse tegevuse teadmisi traditsioonilise ja kaasaegse probleemide kujunemise ja arengu sotsiaalseid, poliitilisi ja kultuurilisi traditsioone ning Aasia ja Lähis-Ida ühiskondades; võime rakendada ajaloo -, regionaal -, kultuuri -, võrdlev ja muud meetodid tõlgendamist hiljemalt sotsiaalsed, majanduslikud, poliitilised protsessid Aasias ja Lähis-Idas ning arvesse neid laiemas kontekstis globaalse rahvusvahelised suhted."}], "learning_outcomes": [{"en": "Students completed the course will be able to think systematically and analyse data, concerning Asian and Middle East societies, in comparative perspectives, regional, diachronical and synchronical. Students will be able to understand and explain specifics and commonalities of ethnic and cultural contexts, social institutes and authorities, national and religious traditions and values in different societies. These will give students possibilities for a personal development and the own civic engagement. Student will be capable to regard the cases and experiences of other societies in relations to one's own cultural and social environment. Students of the course will be able to analyse and explain mechanisms and factors influencing on the life, transformations, of the societies, to understand, interpret and prognosticate consequences of various events and processes inside and between particular societies, and to develop the abilities for strategic management.", "et": "Selle kursuse õpilased saavad süstemaatilisi teadmisi Aasia ja Lähis-Ida riikide ja rahvaste kohta. Õpilased saavad ka alused ja oskused analüüsida andmeid erinevate eluvaldkondade ühiskondades ajaloolises, kultuurilises, sotsiaalses kontekstis ja võrdlev perspektiive. Need annavad kindla aluse Aasia ja Lähis-Ida ühiskondade piirkondlike ja juhtumiuuringute süvaõppe jätkamiseks.\nKursuse läbinud õpilased saavad süstemaatiliselt mõelda ja analüüsida andmeid Aasia ja Lähis-Ida ühiskondade kohta võrdlevates perspektiivides, piirkondlikes, diakroonilistes sünkroonsetes. Õpilased saavad mõista ja selgitada eripära ja sarnasusi Etnilise ja kultuurilise konteksti, sotsiaalse instituudid ja asutused, riiklike ja religioossete traditsioonide ja väärtuste erinevates ühiskondades. Need annavad õpilastele võimalused isiklikuks arenguks ja enda kodanikuaktiivsuseks. Õpilane on võimeline suhtuma teiste ühiskondade juhtumitesse ja kogemustesse oma kultuurilises ja sotsiaalses keskkonnas. Kursuse üliõpilased saavad analüüsida ja selgitada ühiskonna elu, muutusi, mõjutavaid mehhanisme ja tegureid, mõista, tõlgendada ja prognoosida erinevate sündmuste ja protsesside tagajärgi konkreetsete ühiskondade sees ja nende vahel ning arendada strateegilise juhtimise võimeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}