{"uuid": "6fe21d4c-219f-2e57-4416-4673425d011b", "code": "HVKU.05.024", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "World Literature until 1900", "et": "Maailmakirjandus 20. sajandi alguseni"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is focused on the literature of Europe from the Middle Ages to the beginning of the 20th century. Throughout the course, comparisons are made with the literatures of Asia and the Middle East, pointing at the connections and global circulation of a variety of literary phenomena - at the process of cultural exchange both among European literatures as well as between the East and the West.", "et": "Kursuse keskmes on Euroopa kirjandus keskajast kuni 20. sajandi alguseni. Läbivalt tuuakse võrdlusi ka Aasia ja Lähis-Ida kirjandustega, osutades paljude kirjandusnähtuste seostele ja üleilmsele ringlusele - kultuurivahetusprotsessile nii Euroopa kirjanduste kui ka Ida ja Lääne vahel."}, "objectives": [{"en": "The aim of the course is to get acquainted with significant works and literary phenomena of world literature, to acquire a notion of the peculiar genres, literary currents and ideas of those works and to learn to recognize those characteristics in other works of literature.", "et": "Kursuse eesmärgiks on tutvuda maailmakirjanduse oluliste teoste ja kirjandusnähtustega, saada ettekujutus nende teoste žanrilistest, voolulistest, ideelistest iseärasustest ning osata neid ära tunda ka teistes kirjandusteostes. "}, {"en": "The approach of the course is textual. The specific poetics of an author as well as the characteristics of style and literary current, representing the era, are explained by means of texts through a comparative approach.", "et": "Kursuse lähenemisviis on tekstikeskne. Tekstide kaudu selgitatakse nii autorile eriomast poeetikat kui ka ajastuomaseid  stiililisi ja voolulisi tunnusjooni, rakendades võrdlevat vaatenurka."}], "learning_outcomes": [{"en": "The student", "et": "Üliõpilane "}, {"en": "- has read the required amount (at least two thousand pages in two terms) of the works discussed in the course;", "et": "-\ton lugenud nõutud mahus (vähemalt 2000 lk kahe semestri peale) kursusel käsitletud teoseid; "}, {"en": "- analyses the works of literature, noticing their characteristics of literary current, spirituality and style;", "et": "-\tanalüüsib kirjandusteoseid, pannes tähele nende vooluloolisi, vaimuloolisi ja stiililisi tunnuseid;"}, {"en": "- realises the global distribution of literary phenomena and produces examples of different types of literary contacts;", "et": "-\tteadvustab kirjandusnähtuste üleilmset levikut ja toob näiteid eri tüüpi kirjanduskontaktidest; "}, {"en": "- explains the concept and content of world literature in different eras;", "et": "-\tselgitab maailmakirjanduse mõistet ja sisu eri ajastutel;"}, {"en": "- applies the acquired knowledge of the history of literature to the analysis of other texts;", "et": "-\trakendab omandatud kirjandusloolisi teadmisi teiste tekstide analüüsimisel;"}, {"en": "- discusses the works that have been read.", "et": "-\tarutleb loetu üle."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}