{"uuid": "4852b9d9-ee04-0453-627a-d7fd7ef348d7", "code": "HVKU.04.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-26T14:19:35", "title": {"en": "Master's Project in Folkloristics", "et": "Magistriprojekt folkloristikas"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU04", "structural_unit_name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The master's project consists of two parts.\n\nThe output of the master's project, or the practical part, is an independent whole, which may take forms such as educational material, artwork, book or publication, board game, mapping application, database, podcast, exhibition, concert, performance, event organization, etc.\nThe minimum length of the main text of the master's project, excluding appendices, is 20 standard pages, and the maximum length is 30 standard pages (1 page = 1800 characters excluding spaces). In the main text, the master's student must justify their choice of topic and reflect on the process and outcome of their work.", "et": "Magistriprojekt koosneb kahest osast. 1. Magistriprojekti väljund ehk praktiline osa  on iseseisev tervik, mille vormideks võib olla näiteks õppevahend, kunstiteos, raamat või trükis, lauamäng, kaardirakendus, andmebaas, taskuhääling, näitus, kontsert, etendus, sündmuse korraldamine, vm. \nMagistriprojekti katusteksti miinimummaht ilma lisadeta on 20 ja maksimummaht 30 standardlehekülge (1 lk = 1800 tm ilma tühikuteta). Katustekstis peab magistrant põhjendama oma teema valikut, reflekteerima tööprotsessi ja tulemuse üle."}, "objectives": [{"en": "The aim of the master's project is to enable students to use their knowledge and skills for the analysis and solution of more practical problems. The project involves applying specialized knowledge in the development of various outputs and analyzing the work process.", "et": "Magistriprojekti eesmärgiks folkloristika erialal on  võimaldada magistrantidel kasutada oma teadmisi ja oskusi praktilisemat laadi probleemi analüüsiks ja lahendamiseks. Projektis kasutatakse erialaseid teadmisi erinevate väljundite välja töötamisel ning analüüsitakse tööprotsessi."}], "learning_outcomes": [{"en": "A student completing the master's project:\ncan find a specific practical (including creative research-based) output or application based on specialized knowledge, or can apply specialized knowledge in creating a practical output;\ncan find and use literature necessary for researching and solving a specific problem;\ncan use appropriate specialized and/or creative research methods to investigate and propose solutions to applied problems;\ncan reflect on the implementation of the practical (or creative research-based) aspect of the project;\nacquires new practical and transferable skills.", "et": "Magistriprojektiga lõpetav üliõpilane: \n\n1) oskab leida erialastele teadmisele konkreetse praktilise (sh loovuurimusliku) väljundi või rakenduse või oskab praktilise väljundi loomisel rakendada erialaseid teadmisi; \n\n2) oskab leida ja kasutada konkreetse probleemi uurimiseks ja lahendamiseks vajalikku erialast kirjandust; \n\n3) oskab kasutada rakendusliku probleemi uurimiseks ja lahenduse pakkumiseks sobivaid erialaseid ja/või loovuurimuslikke meetodeid; \n\n4) oskab reflekteerida projekti praktilise (või loovuurimusliku) osa teostamise üle \n\n5) omandab uusi praktilisi ja ülekantavaid oskusi \n\n6) oskab kirjutada selgelt struktureeritud ja sidusat akadeemilist teksti"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}