{"uuid": "3ba51eea-f895-677c-e031-9e2f857bf0cf", "code": "HVKU.05.029", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Seminar in Comparative Literature", "et": "Võrdleva kirjandusteaduse seminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Literary works from Estonian and world literature will be read and compared. The focus is on early 20th century literature, the \"Young-Estonian\" era, when Estonian literature was more involved than ever before in consciously modernizing world literature, trying to capture its aesthetic and worldview nerve. Borrowing itself, a conscious will to adapt, not a naive, imitative or epigonal relationship with other literatures, is one of the main features of literary modernism.", "et": "Kursusel loetakse ja võrreldakse kirjandusteoseid eesti ja maailmakirjandusest.  \t\t\t\t\t\t\nFookuses on 20. sajandi alguse kirjandus, \"Noor-Eesti\" aeg, mil eesti kirjandus rohkem kui varem osales teadlikult moderniseeruvas maailmakirjanduses, püüdes tabada selle esteetilist ja maailmavaatelist närvi. Juba laenulisus ise, teadlik adaptsioonitahe, mitte naiivne, imiteeriv ega epigoonlik suhestumine teiste kirjandustega on kirjandusliku modernismi üks peamisi tunnuseid."}, "objectives": [{"en": "The seminar addresses one selected literary phenomenon from a comparative perspective, applying the methods of comparative literature. The aim of the course is to develop an understanding of the transnational distribution of literary phenomena, the fundamental borrowing character of literature as \"a factor accelerating the immanent evolution of literature\" (J. Lotman). The concept, based on a dynamic concept of culture instead of an essentialistic one, sees borrowing as an opportunity to enrich culture, an opportunity for evolution at all.", "et": "Seminaris käsitletakse üht valitud kirjandusnähtust võrdlevast vaatenurgast, rakendades võrdleva kirjandusteaduse meetodeid. Kursuse eesmärgiks on luua arusaam kirjandusnähtuste transnatsionaalsest levikust, kirjanduse põhimõttelisest laenulisest iseloomust kui \"immanentset kirjandusarengut kiirendavaks tegurist\" (J. Lotman). Käsitlus, mis lähtub essentsialistliku kultuurikontseptsiooni asemel dünaamilisest kultuurimõistest, näeb laenamises kultuuri rikastamise võimalust, arenguvõimalust üleüldse."}], "learning_outcomes": [{"en": "Student", "et": "Üliõpilane "}, {"en": "(close) reads and analyzes literary works selected for the course;", "et": "(lähi-) loeb ja analüüsib kursuseks valitud kirjandusteoseid;"}, {"en": "compares them using the perspective and methods of comparative literature;", "et": "oskab neid võrrelda, kasutades võrdleva kirjandusteaduse vaatepunkti ja meetodeid;"}, {"en": "operates with stylistic, fluid and thought concepts; ", "et": "opereerib stilistiliste, vooluliste ja mõttelooliste mõistetega;"}, {"en": "participates in and conducts a discussion in the classroom;  ", "et": "põhjendab oma seisukohti suulises arutelus;"}, {"en": "writes comparative analysis on a selected topic.", "et": "kirjutab võrdleva analüüsi valitud teemast lähtuvalt."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}