{"uuid": "fb17dc31-2e3c-ba78-cd17-e94028bb9a87", "code": "HVKU.04.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Conceptualising Society Through the Lens of Culture, Past and Present", "et": "Ühiskonna kultuuriline mõtestamine enne ja nüüd"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU04", "structural_unit_name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The first half of the course introduces to students the world view of Estonian peasants before modernization and in the early modern period and gives an overview of the sources that can be used to explore these topics. The influence of laws, regulations and orders given by the landlords, of Lutheran teaching, folk customs, folk belief, and family loyalty on the life of the peasantry will be discussed. The second half of the course uses the concepts of culture, folklore and cultural heritage for ethnographic explorations of identity-related processes in contemporary Estonia as it is being shaped by migration, increased diversity and inequality as well as information and communication technologies.", "et": "Kursuse esimeses pooles tutvutakse eesti talupoja maailmakäsitusega modernismieelsel ajal ja moderniseerumise algusajal ning allikatega, mille põhjal saab neid teemasid käsitleda. Arutletakse selle üle, mil moel mõjutasid talurahva elu seadused, regulatsioonid, mõisnike käsud, luterlik õpetus, rahvakombed ja -uskumused ning lojaalsus suguvõsale. Kursuse teises pooles käsitletakse kultuuri, folkloori ja kultuuripärandi mõistete ning etnograafiliste meetodite toel eelkõige identiteediga seotud protsesse tänases Eestis, mida kujundavad ränne, suurenenud mitmesus ja ebavõrdsus ning info- ja kommunikatsioonitehnoloogiad."}, "objectives": [{"en": "The aim of the course is to give an overview of the concepts, sources and approaches used to conceptualise society through the lens of culture in the pre-modern period, on the one hand, and in the present time, on the other. To begin with, students are familiarised with pre-modern Estonian-speaking peasants' mental world and way of life as well as with the context they took shape in. Insight will be given about how peasants' social relationships, lifestyle and mental world changed in the new environment of the modern era. The latter part of the course seeks to introduce opportunities provided by ethnographic methods and by the concepts of culture, folklore, and cultural heritage to rethink identity and make sense of Estonia's increasing diversity. Hands-on assignments encourage students to put the newly acquired skills and knowledge into practice.", "et": "Kursuse eesmärgiks on anda ülevaade mõistetest, allikatest ja lähenemistest, mida kasutatakse Eesti ühiskonna kultuuriliseks mõtestamiseks ühelt poolt modernismieelsel perioodil ja teisalt tänapäeval. Tutvutakse modernismieelse eesti soost talupoja mõtte- ja elulaadiga ning kontekstiga, milles need välja olid kujunenud. Antakse sissevaade sellesse, kuidas muutusid modernismiajastu uues keskkonnas talupoegade sotsiaalsed suhted, elulaad ja mõttemaailm. Õpitakse tundma võimalusi nüüdisühiskonna etnograafiliseks uurimiseks kultuuri, folkloori ja kultuuripärandi mõistete toel, pöörates erilist tähelepanu identiteedi (ümber)mõtestamisele ja Eesti mitmesusele. Praktilised ülesanded julgustavad üliõpilasi erialaseid oskusi ja teadmisi ümbritsevale elule rakendama."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students will be familiar with concepts, sources and approaches for conceptualising past and present societies through the lens of culture and have practiced using them individually as well as in a group-work setting. Learners are able to distinguish between pre-modern and modern features and to place historic sociocultural processes in Estonia in the broader European context. They also know how to research processes and topics related to identity and migration ethnographically, placing Estonia in the global context characterised by rapid circulation and diversification of people, ideas, objects and information. Students have developed skills required to work with scholarly texts and to express themselves orally and in writing.", "et": "Kursuse läbinud üliõpilased tunnevad mõisteid, allikaid ja meetodeid ühiskonna kultuuriliseks mõtestamiseks varasematel sajanditel ja tänapäeval ning omavad kogemusi nende kasutamisest iseseisvas ja rühmatöös. Õppijad oskavad eristada mitmeid modernismieelse ja modernismiaja tunnusjooni ning mõtestada Eesti- ja Liivimaa ajaloolisi ühiskondlik-kultuurilisi protsesse üleeuroopalises kontekstis. Teisalt oskavad nad paigutada tänase Eesti globaalsesse konteksti, mida iseloomustavad inimeste, asjade, ideede, ja informatsiooni kiire liikumine, paljusus ja ebaühtlane jaotus, ning käsitleda identiteedi ja rändega seotud teemasid etnograafilise kultuuriuurimise vaatepunktist. Arenenud on üliõpilase oskus refereerida erialast teksti, end suuliselt ja kirjalikult väljendada ning teha rühmatööd."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}