{"uuid": "387011be-c093-a099-6cef-1498afe5adb5", "code": "HVKU.05.023", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "MA Seminar in Estonian and Comparative Literature", "et": "Eesti ja maailmakirjanduse magistriseminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The Master's seminar of literature and theatre studies takes place in the 1st term and in two specialized groups: Estonian literature and world literature. Part of the seminars are common to all participants. At the seminar the students get acquainted with the demands set for the thesis, analyze earlier master's theses, read scholarly articles of their field, learn to use  archive materials, etc. In the end of the seminar the student presents a preliminary plan for the Master's thesis.", "et": "Eesti ja maailmakirjanduse magistriseminar toimub 1. semestril kahes erialases rühmas: eesti kirjandus ja maailmakirjandus. Osa seminare toimub ühiselt. Seminaris tutvutakse magistritöödele esitatavate nõuetega, analüüsitakse varasemaid magistritöid, loetakse erialaseid teadusartikleid, õpitakse kasutama arhiivimaterjale jne. Seminari lõpus esitab magistrant magistritöö esialgse kava."}, "objectives": [{"en": "The aim of the Master's seminar is to support the writing of the Master's thesis and to offer both the specialized and the interdisciplinary forum for discussion.", "et": "Magistriseminari eesmärgiks on edendada magistritöö valmimist ning pakkuda nii erialast kui ka interdistsiplinaarset diskussioonifoorumit."}], "learning_outcomes": [{"en": "The seminar directs the student to work systematically with his/her Master's thesis, to plan and organize it, to learn to ask research questions and to choose theoretical/methodological approach and the volume of the work according to them. The supervisor of the thesis takes also part in the work of the seminar.", "et": "Magistriseminar suunab tudengit süsteemselt tegelema oma magistritööga, seda tööd planeerima ja korraldama, õppima esitama uurimisküsimust ja valima vastavalt sellele uurimistöö mahu ja teoreetilis-metodoloogilise lähenemise. Magistriseminari on kaasatud ka magistritöö juhendaja."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}