{"uuid": "5ceb00a4-cbc0-2bfc-5959-519c8eec833a", "code": "hv-2018-autumn-fulltime-p1-c6-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Theoretical Conceptualizations of Folklore and Cultural Heritage", "et": "Pärimuse ja kultuuripärandi teoreetilised käsitusviisid"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 6, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "label": {"en": "18/19 A regular part 1 6 CP HV Eng", "et": "18/19 S PÕ 1. osa 6 EAP HV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU", "structural_unit_name": {"en": "Institute of Cultural Research", "et": "kultuuriteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 6, "practice": 12, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "*\tthe origin of cultural heritage and intangible cultural heritage as categories of thought and action, and their development into socio-cultural and economic resources used on the local, national and global levels;\n*\tcontemporary theoretical approaches to cultural heritage and related concepts (including representation, memory, performance, heritagization, narrative, identity, community, migration, transnationalism and diaspora);\n*\tinternational organisations (including UNESCO and WIPO) and conventions (UNESCO's Convention Concerning the Protection of the World Cultural and Natural Heritage, and the Convention for the Safeguarding of the Intangible Cultural Heritage) shaping the field of cultural heritage and, more specifically, that of intangible cultural heritage;\n*\ttheoretical approaches in contemporary folkloristics and cultural anthropology that elucidate the specific nature of intangible cultural heritage, processes of heritage making (re- and de-contextualisation), and links between heritage and identity; \n*\tcase studies from different geographic and socio-cultural contexts explaining the application opportunities of cultural heritage in civil society, the public sector, tourism and other branches of the economy; typical conflicts of interests, and ways of solving them ethically.", "et": "1) Kultuuripärandi ja vaimse kultuuripärandi kategooriate päritolu ning kujunemine kasvava mõjuga ühiskondlik-kultuuriliseks ja majanduslikuks ressursiks nii kohalikul ja rahvuslikul kui ka rahvusvahelisel tasandil; 2) kultuuripärandi kaasaegsed teoreetilised käsitused ja sellega seotud mõisted (sh representatsioon, mälu, esitus, narratiiv, identiteet, kogukond, migratsioon, hargmaisus, diasporaa); 3) kultuuripärandi ja kitsamalt vaimse kultuuripärandi valdkonda reguleerivad ja suunavad rahvusvahelised konventsioonid (sh UNESCO ülemaailmne kultuuri- ja looduspärandi kaitse konventsioon; UNESCO vaimse kultuuripärandi kaitse konventsioon) ja organisatsioonid (sh UNESCO, WIPO); 4) kesksed kaasaegsed folkloristlikud teooriad, mis aitavad mõista vaimse kultuuripärandi erinevust argikultuurist, selle seoseid individuaalse ja kollektiivse identiteediga ning kultuuripärandi valdkonda iseloomustavaid re- ja dekontekstualiseerimise protsesse; 5) juhtumianalüüsid erinevatest geograafilistest ja ühiskondlik-kultuurilistest kontekstidest, mis selgitavad kultuuripärandi rakendusvõimalusi kodanikuühiskonnas, avalikus sektoris, turisminduses ja teistes ettevõtluse harudes, tüüpilisi huvide konflikte erinevate osapoolte vahel ning võimalusi nende eetiliseks lahendamiseks."}, "objectives": [{"en": "This course aims \n*\tto give students factual and theoretical knowledge and vocabulary to describe and analyse processes, participants and relationships pertaining to cultural heritage and, more specifically, intangible cultural heritage on the local, national and international levels;\n*\tto provide students with an understanding of the specifics of intangible cultural heritage, and its differences from folklore and professional culture;\n*\tto give students a broad-based understanding of the functions and application opportunities of folklore and cultural heritage in different areas of society, and of common problems and their ethical solutions;\n*\tto develop students' oral and written communication skills and teamwork skills.", "et": "Kursuse eesmärk on anda üliõpilastele faktilised ja teoreetilised teadmised ning sõnavara kultuuripärandi ja kitsamalt vaimse kultuuripärandi valdkonna protsesside, osapoolte ja suhete kirjeldamiseks ja analüüsimiseks kohalikul, rahvuslikul ja rahvusvahelisel tasandil; valdkonna suunamiseks vajalik võime mõista vaimse kultuuripärandi eripära ja erinevust folkloorist ning professionaalsest kultuurist; laiaulatuslik ettekujutus pärimuse ja kultuuripärandi funktsioonidest ja rakendusvõimalustest ühiskonna erinevates sektorites, pärandirakendustega kaasnevatest potentsiaalsetest probleemidest ja nende eetilistest lahendustest; arendada üliõpilaste erialast eneseväljendusoskust ja rühmatööks vajalikke oskusi."}], "learning_outcomes": [{"en": "Upon passing this course, students should\n*\thave gained an overview of the history of cultural heritage and intangible cultural heritage, as categories of thought and action, as well as of the main international organisations and conventions guiding developments in the field of cultural heritage on the local, national and international levels;\n*\tbe knowledgeable about the main concepts and approaches in the field of cultural heritage;\n*\thave a good command of theoretical approaches in contemporary folkloristics and be able to use them to critically analyse relationships between folk culture, professional culture and cultural heritage under global capitalism;\n*\thave gained a broad-based understanding of the functions and application opportunities of folklore and cultural heritage in individual and collective identity processes, as well as in different areas of society;\n*\tbe capable of identifying diverse actors in the field of cultural heritage (representatives of the state and local governments, communities, entrepreneurs, civil society and cultural elites);\n*\thave gained an overview of common problems in the field of cultural heritage (including copyright issues), and of ways of preventing and solving them ethically.", "et": "Kursuse läbinud üliõpilane: 1) omab ülevaadet kultuuripärandi ja vaimse kultuuripärandi kategooriate kujunemisloost ning peamistest rahvusvahelistest organisatsioonidest ja raamdokumentidest, mis suunavad pärandiloome protsesse; 2) orienteerub kultuuripärandi valdkonna kesksetes käsitusviisides ja mõistetes;  3) tunneb folkloristika olulisemaid kaasaegseid teoreetilisi lähtekohti ning oskab nende toel kriitiliselt analüüsida rahvakultuuri, professionaalse kultuuri ja kultuuripärandi suhteid globaalse kapitalismi tingimustes; 4) omab laiapõhjalist ettekujutust pärimuse ja kultuuripärandi funktsioonidest ja rakendusvõimalustest individuaalses ja kollektiivses identiteediloomes ning ühiskonna erinevates sektorites nii kohalikul, rahvuslikul kui ka rahvusvahelisel tasandil; 5) oskab identifitseerida kultuuripärandi väljal tegutsevaid osapooli (sh riigi ja kohaliku omavalitsuse esindajad, kohalik kogukond, eraettevõtjad, haritlaskond, kodanikuaktivistid), erinevusi ja ühisosa nende tegevuses ja huvides; 6) omab ettekujutust kultuuripärandi valdkonna tüüpilistest konfliktsituatsioonidest (sh autoriõigusega seonduv) ning võimalustest probleeme ennetada ja eetiliselt lahendada."}], "notes": {}}, "grading": {"independent_work": {"et": "1) Summaries and other written assignments based on compulsory readings; to be submitted prior to classroom meetings.\n2) Course diaries analysing and commenting on lectures, classroom discussions and on one's own learning process; submitted after each classroom meeting;\n3) Composing an abstract of the final essay and giving feedback to an abstract by a fellow student;\n4) Oral presentation. \n5) A written essay completing the course; deadline TBA.\n\nGuidelines will be given at the beginning and during the course."}, "independent_work_assessments": [{"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Summaries and other written assignments based on compulsory readings; max. 6 points per assignment, 42 points per course. Length: 1 page / 300-350 words per text (one article, book chapter, etc.)\n\n- ability to identify and grasp authors' aims, main arguments, theoretical starting points, methods, and concepts succinctly;\n- ability to create links between the readings; \n- ability to display critical thinking skills\n- correct formatting (citations!)."}}, {"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Course diaries analysing and commenting on lectures, classroom discussions and on one's own learning process; max. 3 points per diary, 21 points per course. Length: 200-350 words per lecture or seminar. \n\n- the student has understood the topic of the lecture/seminar and raises pertinent topics and issues;\n- the author demonstrates an ability to process one's own learning."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "- ability to present the main arguments and concepts succinctly; \n- ability to formulate questions for classroom discussion and to lead discussion.\nMax. 4 points."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "1) composing the abstract of the final essay (max. 4 points); 2) giving feedback to an abstract composed by a fellow student (max. 2 points).\n- the abstract outlines the aims of the essay, a theoretical framework and, if applicable, relevant empirical case studies;\n- feedback is analytical and constructive."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Final essay drawing on texts, topics and concepts discussed during the course, as well as on empirical data. Up to 18 points."}}], "min_points_from_tests": 75, "grade_preconditions": {"et": "1) Participation in biweekly lectures, seminars (preferably no missed classes!) and activities online;\n2) Punctual submission of coursework;\n3) Abstract of the final essay and feedback;\n4) Oral presentation;\n5) Punctual submission of the final essay."}, "grade_evaluation": {"et": "1) Participation in biweekly classroom meetings (preferably no missed classes!) (1,5 points per meeting, 9 points in total) and online activities;\n2) Punctual submission of coursework - course diaries max. 21 points, assignments based on readings max. 42 points\n3) Abstract of the final essay and feedback - max. 6 points\n4) Oral presentation - max. 4 points\n5) Final essay - max. 18"}, "debt_elimination": {"et": "Upon agreement with lecturers."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "TBA", "recommended_materials": "TBA"}, "participants": {"lecturers": [{"person_uuid": "89200cf9-6d34-1814-d081-e291802bf554", "person_name": "Ülo Valk", "structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "ebf91e3f-fa18-c1a9-526f-60b22503306e", "person_name": "Laur Vallikivi", "structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "a146afcd-97a6-b24d-191f-4e052cd9e491", "person_name": "Elo-Hanna Seljamaa", "structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "66be232c-ce23-0265-4ddb-9b3f92cefca7", "person_name": "Kristin Kuutma", "structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "45217e09-83d6-8ab9-b0d0-26a89cb82456", "person_name": "Kristel Kivari", "structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "2f646ff2-4573-9f0f-82ea-a47ecfeb46cb", "person_name": "Anastasiya Astapova", "structural_unit": {"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2018-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "INTRODUCTION TO THE COURSE (Kristel Kivari)\n\nI. FOLKLORE: HISTORY OF THE CONCEPT and ITS USES (Ülo Valk)\n1) McNeill, Lynne S. 2013. What is folklore? In: Folklore Rules: a Fun, Quick, and Useful Introduction to the Field of Academic Folklore Studies. Logan: Utah State University Press, pp. 1-19.\n2) Bauman, Richard 2016. The Philology of the Vernacular. In: Grand Theory in Folkloristics. Ed. by Lee Haring. Bloomington and Indianapolis: Indiana University Press, pp. 63-70."}}, {"time": "2018-09-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "II. COMMUNITY AND FOLK? (Elo-Hanna Seljamaa)\nRequired readings: \nDundes, Alan 1980. Who Are The Folk? In: Interpreting Folklore. Bloomington: Indiana University Press."}}, {"time": "2018-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "III. ETHNICITY (Laur Vallikivi)\nRequired readings: \nEriksen, Thomas Hylland 2010. Ethnicity and nationalism. Anthropology, culture and society (third edition).  London: Pluto, pp. 1-42."}}, {"time": "2018-10-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "RECAP SEMINAR: TOPICS I-III (Kristel Kivari)"}}, {"time": "2018-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "IV. NATIONALISM (Anastasiya Astapova)\nRequired readings:\nHearn, Jonathan 2005. Rethinking Nationalism, Chapter 2. Primordialism, Chapter 4. Modernism. Palgrave Macmillan."}}, {"time": "2018-11-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "V. HERITAGE DISCOURSES (Kristin Kuutma)\nRequired readings: \n1) Kuutma, Kristin 2015. 'From Folklore to Intangible Heritage', in W. Logan, M. Nic Craith, and U. Kockel (eds), A Companion to Heritage Studies, London: Wiley-Blackwell, 41-53.\n2) Blake, Janet 2017. 'Development of UNESCO's 2003 Convention: Creating a new heritage protection paradigm', in M.L. Stefano and P. Davis (eds), The Routledge Companion to Intangible Cultural Heritage, London-New York: Routledge, 11-21.\n3) Cameron, Christina 2015. 'UNESCO and Cultural Heritage: Unexpected Consequences', in W. Logan, M. Nic Craith, and U. Kockel (eds), A Companion to Heritage Studies, London: Wiley-Blackwell, 322-336.\nSuggested reading:\n4) Harrison, Rodney 2015. 'Heritage and Globalization', in E. Waterton and S. Watson (eds), The Palgrave Handbook of Contemporary Heritage Research, Basingstoke-New York: Palgrave Macmillan, 297-312."}}, {"time": "2018-12-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "RECAP SEMINAR: TOPICS IV-V (Kristel Kivari)"}}]}, "registration_info": {"audience": {"et": "\"Folkloristics and Applied Heritage Studies\" MA programme compulsory general course; other students welcome; no prerequisites"}, "min_students": 7, "max_students": 20}, "parent_uuid": "8d480bfc-dd3c-183f-9141-7f6e293f15cf", "parent_code": "HVKU.04.006", "parent_credits": 12, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}