{"uuid": "1d91cb51-16f8-4733-5e50-85f2c8996adb", "code": "HVKU.03.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Cultural Event, Audience and Reception", "et": "Kultuurisündmus, publik ja retseptsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course treats possibilities of analysing cultural events proceeding from terms \"performance\", \"performativity\" and \"event\" and from context of the performance studies. Students can analyse different cultural events.\nThe course treats the main terms, problems and authors of audience research and reception theory. One learns how to plan and conduct an empirical research project about reception or audience research and how to analyse collected material. An empirical research will be carried out with a group.", "et": "Tutvustatakse etendusuuringute, publiku-uuringute ja retseptsiooniteooria põhimõisteid ja metodoloogilisi seisukohti.\nÕpitakse planeerima ja läbi viima publiku-uuringuid või retseptsiooniesteetilist uurimustööd ning kogutud materjali analüüsima. \nÜliõpilased analüüsivad konkreetseid kultuurinähtusi. Rühmatööna viiakse läbi empiiriline uurimus."}, "objectives": [{"en": "To study analysis of cultural events as performances in wider social and cultural context.", "et": "Õpitakse analüüsima erinevaid kultuurinähtusi kui etendusi. "}, {"en": "To study audience research and reception theory and to learn to plan and conduct an empirical research project about reception and to analyse collected material.", "et": "Tutvutakse publiku-uuringute ja retseptsiooniteooria põhimõistetega, õpitakse planeerima ja läbi viima retseptsiooniesteetilist uurimustööd ning kogutud materjali analüüsima."}], "learning_outcomes": [{"en": "The student can analyse various cultural events using the model of cultural performance and the vocabulary of performance studies. The student is able to investigate cultural events in the wider social and cultural context.\nStudent knows the main terms and authors of reception theory and audience research, is able to plan and conduct an empirical research project about reception or audience research and to analyse collected material.", "et": "Üliõpilane oskab analüüsida erinevaid kultuurinähtusi, rakendades kultuurietenduse mudelit ja etendusuuringute põhisõnavara.\nÜliõpilane suudab käsitleda üksikuid kultuurinähtusi laiemas sotsiaal-kultuurilises kontekstis.\nÜliõpilane tunneb publiku-uurimise ja retseptsiooniteooria põhimõisteid ning -autoreid, oskab planeerida ja läbi viia retseptsiooniesteetilist uurimustööd ning kogutud materjali analüüsida."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}