{"uuid": "e7653217-e662-5f4a-82d9-e0e98a36b6b8", "code": "HVKU.10.008", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-26T14:15:09", "title": {"en": "Middle East and Soviet/Russian Imperialism since 1917 until Putin: Politics, Diplomacy, Influence Activities, Hybrid War", "et": "Lähis-Ida riigid ja Nõukogude/Vene imperialism alates 1917. aastast kuni Putinini: poliitika, diplomaatia, mõjutustegevus, hübriidsõda"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU10", "structural_unit_name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU10", "name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "webpage_url": "https://flku.ut.ee/et/orientalistika-keskus", "address": "Ülikooli 18\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will provide an overview of Russia's relations with the Middle Eastern states, from the collapse of Tsarist Russia (World War I and its aftermath) and the emergence of Soviet Russia (since 1922 USSR) to the regime of Vladimir Putin. This module will cover Soviet/Russian diplomacy in the Middle East, the relationship between the USSR/Russia and the Middle East. In addition, the strategic interests of the Soviet Union and Russian Federation in the region will also be discussed, as well as influence (including various aspects of hybrid warfare such as information warfare, espionage) and political and even military interventions - e.g. the intervention of the Russian Federation in the Syrian civil war.", "et": "Kursus annab ülevaate Venemaa ja Lähis-Ida suhetest alates Tsaari Venemaa lagunemisest (I Maailmasõda ja sellele järgnev ajastu) ja Nõukogude Venemaa tekkest kuni Vladimir Putini režiimini. Käesolevas aines käsitletakse Nõukogude Liidu ja Venemaa diplomaatiat Lähis-Idas, NSV Liidu/Venemaa Föderatsiooni ja Lähis-Ida riikide suhteid. Lisaks käsitletakse samuti Nõukogude Liidu ja Venemaa strateegilisi huvisid regioonis, kuid ka mõjutustegevust (sh  erinevad hübriidsõja tahud nagu nt infosõda, spionaaž) ja ka poliitilisi ning isegi sõjalisi sekkumisi - nt Venemaa Föderatsiooni sekkumine Süüria kodusõtta."}, "objectives": [{"en": "The aim of this course is to provide an overview of the relations between Russia and the Middle East from the collapse of Tsarist Russia and the emergence of Soviet Russia to the Putin regime. The subject will cover Soviet and Russian diplomacy in the Middle East, as well as Soviet and Russian strategic interests in the region, but also influence (different aspects of hybrid war, including information warfare, espionage) and political and even military interventions - e.g. the intervention of the Russian Federation in the Syrian civil war.", "et": "Aine eesmärk anda ülevaate Venemaa ja Lähis-Ida suhetest alates Tsaari Venemaa lagunemisest ja Nõukogude Venemaa tekkest kuni Putini režiimini. Aines käsitletakse Nõukogude Liidu ja Venemaa diplomaatiat Lähis-Idas, samuti Nõukogude Liidu ja Venemaa strateegilisi huvisid regioonis, kuid ka mõjutustegevust (sh  erinevad hübriidsõja tahud nagu nt infosõda, spionaaž) ja ka poliitilisi ning isegi sõjalisi sekkumisi - nt Venemaa Föderatsiooni sekkumine Süüria kodusõtta."}], "learning_outcomes": [{"en": "The student will be able to orientate him/herself in the relations between the Soviet Union and the Russian Federation in the 20th and 21st centuries with Middle Eastern countries. The student will understand how the USSR and Putin's Russia conducted their influence activities in the region. The student will have an overview of how the USSR and the Russian Federation intervened in the internal affairs of the countries of the Middle East, including militarily, politically (e.g. in Syrian civil war).", "et": "Õppur orienteerub 20.-21. saj Nõukogude Liidu/Venemaa Föderatsiooni ja Lähis-Ida riikide suhetes. Õppur mõistab kuidas NSVLiit ja VF viis läbi oma mõjutustegevusi regioonis. Õppur omab ülevaadet sellest kuidas NSVLiit ja VF sekkusid Lähis-Ida riikide siseasjadesse, sh ka sõjaliselt, poliitiliselt (nt Süüria kodusõda)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}