{"uuid": "75e53a20-90ac-1ed9-a5d6-858b5d17f0ff", "code": "HVKU.05.034", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Contemporary Theatre Practice", "et": "Eesti nüüdisteatri praktikum"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the course, Estonian contemporary theatre is studied according to problem based learning (PBL) method. As a result of PBL group work, students write a group report on one theatre institution. During the studies the students read articles on contemporary Estonian theatre, watch video recordings, analyze statistics and repertory data. During the course, each group submits presentations on current work. As a summary of the course, the groups will write a joint paper.", "et": "Kursuse vältel uuritakse Eesti kaasaegset teatrit probleemipõhise õppe meetodil (PBL). Kursus põhineb rühmatöödel. Uurimistööde käigus loetakse kaasaegset teatrit käsitlevaid artikleid, vaadatakse videosalvestusi, analüüsitakse statistilisi ja repertuaariandmeid jms. Kursuse vältel toimuvad iga õppegrupi projektide esitlused. Kursuse kokkuvõttena kirjutatakse rühmatöö."}, "objectives": [{"en": "*In the course Estonian contemporary theatre is introduced, focussing on innovative and avant-garde groups since 1990s, and main discussion topics on theatrical discourse. ", "et": "*Tutvustada eesti nüüdisteatri esteetikat, rõhuga innovaatilistel suundumustel alates 1990. aastatest, ning teatrikunsti puudutavaid diskussioone. "}, {"en": "*An overview of the institutional structure and historical context of the contemporary theatre will be given.", "et": "*Anda ülevaade kaasaegse eesti teatri institutsionaalsetest vormidest ja nende ajaloolisest kontekstist."}, {"en": "* To indicate relations between theatre production and institutional practices, including theatre structure (personnel) marketing, repertoire strategies, audiences etc.", "et": "*Näidata seoseid teatrikunsti teoste ja teatri praktilise toimimise, sh teatri struktuuri, turundusstrateegiate, repertuaariplaanide, publiku ja sihtrühmade jms vahel."}], "learning_outcomes": [{"en": "1. Student analysis at least one of the innovative practices in Estonian contemporary theatre and at least one of significant concepts \n2. interprets at least one critical discussions related to Estonian theatre \n3. knows in general the Estonian theatre institutional system and has a deepened understanding of functioning of at least one Estonian theatre institution (it's structure, marketing strategies, repertoire principles, audiences, target groups). \n4. makes connections between innovative practices, theoretical concepts and practical functioning of a theatre institution. \n5. implements acquired knowledge by problem based learning method implemented in teams", "et": "Kursuse eduka läbimise korral üliõpilane:\n\n1. analüüsib vähemalt üht uuenduslikku suunda eesti nüüdisteatris ja vähemalt üht enam levinud teatrikontseptsioonidest,\n2. tõlgendab vähemalt ühe teatriga seotud kriitilisi diskusiooniteemasid eesti teatris.\n3. tunneb üldjoontes kaasaegse Eesti teatri institutsionaalset struktuuri ja süvendatult vähemalt ühe teatri struktuuri ja praktilist toimimist (struktuur, turundus, repertuaariplaan, publik, sihtrühmad jms).\n4. loob seoseid eesti nüüdisteatri suundade, teatriteoreetiliste kontseptsioonide ja teatri praktilise institutsionaalse toimimise vahel.\n5. rakendab omandatud teadmisi meeskonnatöös probleemisepõhise õppe meetodid rakendades."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}