{"uuid": "55c6e65f-6951-2770-4c43-4d09e3318197", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-09T09:26:11", "title": {"en": "Contemporary Societies of Asia and Middle East: Traditions, Innovations, Challenges", "et": "Tänapäeva Aasia ja Lähis-Ida ühiskonnad: traditsioonid, uuendused, väljakutsed"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVKU10", "name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "webpage_url": "https://flku.ut.ee/et/orientalistika-keskus", "address": "Ülikooli 18\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "label": {"en": "24/25 A regular HV Eng", "et": "24/25 S PÕ HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU10", "structural_unit_name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 26, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course introduces features and processes characterising contemporary Asian and Middle East societies. The course provides students with the basic knowledges and skills to analyse various (geo)political, economic, environmental factors, social and administrative systems, public relations, national cultural and ideological concepts, challenges and responses to the global concerns. The course regards relations between European Union and Asian and Middle East countries. The special attention is dedicated to analysis of Estonian trade relations and the opportunities to intensify them, including the detailed analysis of the Estonian export potential and countries import specifics. The course also includes a brief comparative analysis of different options of arranging business in the targeted countries and regions and provides students with the sufficient information and insights for making initial assessment of their capacities to enter local markets.", "et": "See kursus tutvustab tänapäeva Aasia ja Lähis-Ida ühiskondi iseloomustavaid funktsioone ja protsesse. Kursus annab õpilastele põhilised teadmised ja oskused erinevate (geo)poliitiliste, majanduslike, keskkonnategurite, sotsiaalsete ja haldussüsteemide, avalike suhete, rahvuskultuuriliste ja ideoloogiliste kontseptsioonide, väljakutsete ja globaalsete probleemide lahendamiseks. Kursus käsitleb Euroopa Liidu ning Aasia ja Lähis-Ida riikide suhteid. Erilist tähelepanu pööratakse Eesti kaubandussuhete analüüsile ja nende tihendamise võimalustele, sh Eesti ekspordipotentsiaali ja riikide impordi spetsiifika detailsele analüüsile. Kursus sisaldab ka lühikest võrdlevat analüüsi erinevate ettevõtete korraldamise võimaluste kohta sihtriikides ja piirkondades ning annab õpilastele piisavalt teavet ja teadmisi, et teha esialgne hinnang nende võimekusele siseneda kohalikele turgudele."}, "objectives": [{"en": "The aim of the course to introduce contemporary features and processes characterising societies and ethnic cultures of Asia and Middle East. The course aims to provide students with knowledges and analytical multidisciplinary tools to understand and interpret specific epistemological forms, models of behaviour, social values and cultural codes applied in various situations and spheres of today's life in Asia and Middle Eastern. The course is designed to provide students with the basic knowledge of contemporary (geo)political, economic, environmental situations, social and administrative systems, publicity, national cultural and ideological concepts. These form grounds for relevant understanding, strategic and prognostic analytics, decision making to develop collaborative relations, including business, with partners representing Asian and Middle East countries. The course provides skills to define possible problems and risks for new comers, including companies, in local conditions of the targeted regions and develops abilities to avoid or minimise unsolicited consequences. The course provides students with the practical intellectual basis and skills to build successful cross-cultural business interactions, productive and trustful professional relationships with countries of Asia and Middle East.", "et": "Kursuse eesmärk on tutvustada Aasia (Ida-ja Lõuna-Aasia) ja Lähis-Ida ühiskondi ja rahvuskultuure iseloomustavaid kaasaegseid jooni ja protsesse. Kursuse eesmärk on anda õpilastele teadmisi ja analüütilisi multidistsiplinaarseid vahendeid, et mõista ja tõlgendada konkreetseid Epistemoloogilisi vorme, käitumismudeleid, sotsiaalseid väärtusi ja kultuurikoode, mida rakendatakse tänapäeva elu erinevates olukordades ja valdkondades Aasias ja Lähis-Idas. Kursuse eesmärk on anda õpilastele põhiteadmised kaasaegsetest (geo)poliitilistest, majanduslikest, keskkonnaalastest olukordadest, sotsiaalsetest ja haldussüsteemidest, avalikust, rahvuskultuurilisest ja ideoloogilisest kontseptsioonist. Need on aluseks asjakohasele mõistmisele, strateegilisele ja prognostilisele analüüsile, otsuste tegemisele, et arendada koostöösuhteid, sealhulgas äri, partneritega, kes esindavad Aasia ja Lähis-Ida riike.\nKursus annab oskused uute soovijate, sealhulgas ettevõtete võimalike probleemide ja riskide määratlemiseks sihtpiirkondade kohalikes tingimustes ning arendab võimeid soovimatute tagajärgede vältimiseks või minimeerimiseks. Kursus annab õpilastele praktilise intellektuaalse aluse ja oskused edukate kultuuridevaheliste ärisuhete loomiseks, produktiivseteks ja usaldusväärseteks professionaalseteks suheteks Aasia ja Lähis-Ida riikidega."}], "learning_outcomes": [{"en": "Students completed the course will be able to think systematically, compare and analyse data, concerning variations of political, economic and social systems, cultural norms, models of perception, evaluation and behaviour in contemporary Asia and Middle East. Students will be able to understand and explain actual processes and situations, political attitudes, explain cooperative and conflicts factors, business behavior, mechanism of public relations in the contemporary life of targeted regions. Students will be prepared to understand and explain societal phenomena, business behavior, public attitudes, political, economic and social demands and developing processes in Asian and Middle East countries. Students will be able to apply gained knowledges and skills to practical situations of the personal and career development, concerning relations and business arrangements between Estonia and Asia and Middle East countries.", "et": "Kursuse läbinud õpilased saavad süstemaatiliselt mõelda, võrrelda ja analüüsida andmeid poliitiliste, majanduslike ja sotsiaalsete süsteemide, kultuuriliste normide, tajumise, hindamise ja käitumise mudelite kohta tänapäeva Aasias ja Lähis-Idas. Õpilased saavad mõista ja selgitada tegelikke protsesse ja olukordi, poliitilisi hoiakuid, selgitada koostöö-ja konfliktitegureid, ärikäitumist, avalike suhete mehhanismi sihtpiirkondade kaasaegses elus.\nÕpilased on valmis mõistma ja selgitama ühiskondlikke nähtusi, ärikäitumist, avalikke hoiakuid, poliitilisi, majanduslikke ja sotsiaalseid nõudmisi ning arenguprotsesse Aasia ja Lähis-Ida riikides. Õpilastel on võimalik rakendada omandatud teadmisi ja oskusi isikliku ja karjääri arendamise praktilistes olukordades, mis puudutavad suhteid ja ärikorraldust Eesti ning Aasia ja Lähis-Ida riikide vahel."}], "notes": {}}, "grading": {"independent_work": {"et": "."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "EST\nLõplik hindamine on essee Aasia ja Lähis-Ida piirkondade ja traditsioonidega seotud uurimisteemal (võib võtta võrdlevas perspektiivis teiste piirkondadega). Analüüs peaks olema kirjutatud teemal, mis on seotud vaadeldavate riikidega, sisaldama uurimisküsimust, mille pikkus on 1000-1500 sõna. See peaks sisaldama viiteid vähemalt 5 väljaandele koos tsitaatidega. Analüüs võib mõtiskleda kursuse teemade ja publikatsioonide peamiste ideede üle, kuid see võib keskenduda ka mõnele erilisele juhtumile või analüüsida ja arutada teatud materjali, mille õpilased on valinud. See peaks näitama iseseisvat ja kriitilist mõtlemist ning originaalseid argumente. Bibliograafiat tuleks muuta, järgides Chicago stiili käsiraamatut, kasutades autori-kuupäeva süsteemi (http://www.chicagomanualofstyle.org)\nHindamiskriteeriumid hõlmavad analüüsi taset, ühenduste loomist, allikate sõltumatu uurimise tõlgendusvõime taset, viidete asjakohasust ja ulatust; nõuete täitmist, saadud teadmiste, oma ideede ja hüpoteesi esitamise õigsust ja loogikat.\n\nENG\nThe final assessment is an essay on a research topic related to Asian and Middle Eastern regions and traditions (might be taken in a comparative perspective with other regions). An essay should be written on a topic, related to the regarded countries, contain a research question, with a length of 1000-1500 words. It should contain references to at least 5 publications, with the quotes indicated. The essay can reflect on the main ideas regarded during the course topics and publications, but it can also focus on some special case or analyse and discuss certain material that the students have selected. It should demonstrate independent and critical thinking and original arguments. The bibliography should be edited, following the Chicago Manual of Style using the author-date system (http://www.chicagomanualofstyle.org) \nAssessment criteria include the level of analysis, establishing connections, level of interpretation abilities of independent inquiry of sources, relevance and extent of references; compliance with the requirements, correctness and logic of presenting obtained knowledge, own ideas and hypothesis."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "EST\nSeminaride käigus peaks iga üliõpilane koostama ühe ettekande koos ettekandega õppejõu poolt soovitatud või iseseisvalt valitud teemal ja lektori poolt tõestatud teemal. Ettekande peaks esitama bibliograafia. Ettekanne peaks olema seotud kursusel käsitletavaga, sisaldama uurimisaspekti ja olema esitatud seminaril aruteludeks vajalike küsimustega. Rohkem juhiseid üksikute tööde kohta antakse klassis. Hindamiskriteeriumid see hõlmab võimeid sõltumatu uurimise allikatest, asjakohasust ja ulatust viide.\nTäiendavaid konsultatsioonivõimalusi pakutakse digitaalselt piiramatul kujul.\n\nENG\nDuring the seminars, each student is supposed to prepare one report with a presentation on the topic suggested by the lecturer or chosen independently and proved by the lecturer. The presentation should be provided by the bibliography. The presentation should be related to the one of regarded in the course societies, to contain a research aspect and to be provided by questions for debates during the seminar. \nMore instructions about the individual works will be given in the class. Assessment criteria for this includes abilities of independent inquiry of sources, relevance and extent of reference.\nAdditional consultation possibilities will be provided digitally in unlimited form."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "EST\nIseseisev töö koosneb artiklite lugemisest, materjalide, sh video analüüsimisest, kirjalike ülesannete täitmisest (seminari ettekannete ja aruannete koostamine, asjaomase loengu või vastamata seminari vajaliku lugemise Kokkuvõte, lõpliku essee ettevalmistamine).\nEnne iga klassi õpilased saavad kaks Artiklit mitmeid küsimusi ette üksikute analüüs ja arutelud klassis. Selle hindamiskriteeriumid hõlmavad nõuete täitmist, saadud teadmiste, oma ideede ja hüpoteesi esitamise õigsust ja loogikat küsimustes.\n____________________\nENG\nIndependent work will consist of reading articles, analysing materials, including video, doing written assignments (preparation of presentations and reports for the seminar, a summary of the required reading for the lecture concerned or the missed seminar, preparation of the final essay). Before each class students get two articles with a number of questions provided for the individual analysing and discussions in the class. Assessment criteria for this includes compliance with the requirements, correctness and logic of presenting obtained knowledges, own ideas and hypothesis on questions."}}], "grade_preconditions": {"et": "Participation in all seminars\nPresentation of a seminar report\nFinal essay"}, "grade_evaluation": {"et": "Activity in class or forum: 20%\nSeminar reports: 30%\nFinal exam: 50%\n\nAll seminar reports must be handed in.\nTo obtain final grade, the following is required:\nActivity in class or on forum: 20% (oral or written statements on homework study materials and questions for each class).\nSeminar reports and presentations: 30% (1 report with presentation of independent inquiry and suggested debate questions).\nFinal exam: 50% (Final essay). Differentiated (A, B, C, D, E, F, not present).\nAn assay  should be written on a on a topic, related to the regarded regions, contain a research question, with the length of 1000-1500 words. It should contain references to at least 5 publications, with the quotes indicated. The assay  can reflect on the main ideas in regarded during the course topics and publications, but it can also focus on some special case or analyze and discuss certain material that the students have selected. It should demonstrante independent and critical thinking and original arguments. The bibliography should be edited, following the Chicago Manual of Style using the author-date system (http://www.chicagomanualofstyle.org)"}, "debt_elimination": {"et": "Upon agreement with the instructor."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "3a538175-e567-48db-a476-465aff575852", "type": "MOODLE", "code": "HVKU.10.004_ENG", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "recommended_materials": "."}, "participants": {"lecturers": [{"person_uuid": "516e2ac1-de08-1d2a-93e2-ad30fc158fd1", "person_name": "Elo Süld", "structural_unit": {"code": "HVUS07", "name": {"en": "University of Tartu Asia Centre", "et": "Tartu Ülikooli Aasia keskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVUS"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "73027d14-70f2-a892-6535-1b953cbf9439", "person_name": "Alevtina Solovyeva", "structural_unit": {"code": "HVKU10", "name": {"en": "Centre for Oriental Studies", "et": "orientalistikakeskus"}, "webpage_url": "https://flku.ut.ee/et/orientalistika-keskus", "address": "Ülikooli 18\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "51005", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction to the course: theories, approaches and sources to study contemporary Asian and Middle East societies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Countries of contemporary Middle East: political, economic, social systems and ideologies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Identities, life-styles and cultural codes of contemporary Middle East societies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Traditions and innovations in contemporary Middle East"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Local and global challenges in contemporary Middle East"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Dialogues between East and West (Cosmopolitical Ecologies)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Countries of contemporary Asia: political, economic, social systems and ideologies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Traditions and innovations in contemporary East and South Asia"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Local and global challenges in contemporary East and South Asia"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Dialogues between East and West (Cosmopolitical Ecologies)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Countries of contemporary Central Asia: political, economic, social systems and ideologies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Identities, life-styles and cultural codes of contemporary Central Asia societies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Traditions and innovations in contemporary Central Asia"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Local and global challenges in contemporary Central Asia"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Dialogues between East and West (Cosmopolitical Ecologies)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Conclusive lecture: Asian and Middle East countries in contemporary global contexts - perspectives and strategies of developing partnerships"}}]}, "registration_info": {"audience": {"et": "All students, no prerequisites."}, "min_students": 3}, "parent_uuid": "02f53178-0a54-ba1f-aa2a-5bd32b700324", "parent_code": "HVKU.10.004", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}