{"uuid": "46b20003-2d44-b4b7-8cb1-b3015bb4d519", "code": "HVKU.04.041", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-05T13:48:27", "title": {"en": "Estonian Folk Songs: Sources, Theories and Types", "et": "Eesti rahvalaul: allikad teooriad ja liigitus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU04", "structural_unit_name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The development of the Estonian regilaul (the older folk song), pre-song genres. The compositional principles and poetics of regilaul. Changes of folksongs in connection to cultural thinking. Newer folk songs. Research methods and research history of Estonian folk song", "et": "Eesti regilaulu kujunemise varasem ajalugu, laulueelsed žanrid. Regilaulu kompositsioonivõtted ja poeetika. Rahvalaulude muutumine ajaloos koos kultuurilise mõtlemisega. Uuem rahvalaul. Eesti rahvalaulu uurimismeetodid ja uurimislugu."}, "objectives": [{"en": "The course provides an overview of the development and changes in Estonian folk songs, their structure, types and research.", "et": "Kursus annab ülevaate eesti rahvalaulu kujunemisloost ja muutumisest, struktuurist, alaliikidest ja uurimisest."}], "learning_outcomes": [{"en": "1. The student is familiar with the main types of Estonian folk songs and related genres;", "et": "1. Üliõpilane tunneb eesti rahvalaulu põhiliike ja sellega seotud žanre;"}, {"en": "2. The student has an overview of the structural elements and compositional principles of regilaul;", "et": "2. Üliõpilane omab ülevaadet regilaulu struktuurielementidest ja komponeerimisprintsiipidest;"}, {"en": "3. The student is familiar with the diachronic and mental history of the development of Estonian folksong, especially regilaul;", "et": "3. Üliõpilane tunneb eesti rahvalaulu, eriti regilaulu diakroonilist ja mõtteloolist arengulugu;"}, {"en": "4. The student has an overview of the history of research and publication of Estonian folk songs.", "et": "4. Üliõpilane omab ülevaadet eesti rahvalaulude uurimisloost ja publitseerimisest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}