{"uuid": "fbe90f2b-f37a-65e6-b283-907949a7f6df", "code": "HVKU.04.045", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:13:38", "title": {"en": "Practice of Applied Folkloristics", "et": "Rakendusfolkloristika praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU04", "structural_unit_name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU04", "name": {"en": "Department of Estonian and Comparative Folklore", "et": "eesti ja võrdleva rahvaluule osakond"}, "phone": "+372 737 5304", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the practice, the student:\nCollaborates with the non-university partner to develop a practice plan and formulate practice objectives.\nImplements the tasks outlined in the plan.\nSubmits a written practice report, which critically analyzes and evaluates the acquired experience and the perspectives on folklore processes revealed within the project (including the methods used, their application, results obtained, etc.).\nPresents the research findings to the non-university partner (where fieldwork was conducted) in a suitable format and manner.", "et": "Üliõpilane viib kursust koordineeriva õppejõu juhendamisel läbi iseseisva praktika rakendades varem omandatud teadmisi.\nPraktika raames üliõpilane:\n- koostab koostöös ülikoolivälise partneriga praktika plaani ja sõnastab praktika eesmärgid;\n- viib plaanis nimetatud tööd ellu;\n- esitab kirjaliku praktikaaruande, milles analüüsib ja hindab kriitiliselt omandatud kogemust ja projekti raames ilmnenud vaadet folklooriprotsessidele (s.h. kasutatud meetodeid ja nende rakendamist ja saadud tulemusi jm);\n- esitab oma uurimuse tulemused ülikoolivälisele partnerile (kelle juures välitööd läbi viidi) sobivas vormis ja viisil."}, "objectives": [{"en": "The aim of the course is to provide an opportunity for the application of folklore-related knowledge in various non-university settings (such as another research institution, organization, company, NGO, etc.) and to analyze this experience.", "et": "Õppeaine eesmärgiks on pakkuda võimalust folkloristika-alaste teadmiste rakendamiseks erinevate ülikooliväliste partnerite juures (nt teine uurimisasutus, organisatsioon, ettevõte, MTÜ vm) ning seda analüüsida."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the student will be able to:", "et": "Kursuse edukal läbimisel oskab üliõpilane:"}, {"en": "Apply specialized knowledge to carry out a practical project at a non-university partner.", "et": "1. rakendada erialaseid teadmisi praktilise projekti läbiviimiseks ülikoolivälise partneri juures."}, {"en": "Critically analyze the knowledge and experiences acquired during the practice and assess the possibilities of applying folklore-related knowledge, including the use of various sources, the significance of context, limitations of use and impact, and creative interpretations.", "et": "2. oskab kriitiliselt analüüsida praktika käigus omandatud teadmisi ja kogemusi ja suudab analüüsida folkloristika-alaste teadmiste rakendamisvõimalusi, s.h. erinevate allikate kasutamist, konteksti olulisust, kasutus- ja mõjupiiranguid ning loovaid interpretatsioone."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}