{"uuid": "242b916e-74b9-2936-6149-ebbc375cc96b", "code": "HVKU.03.028", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice Abroad", "et": "Välispraktika"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Practice abroad is an international work-related learning experience that follows university regulations and is guided by a tutor. All activities should be agreed earlier with the program director (ene.koresaar@ut.ee). This practice course is conducted outside Estonia.", "et": "Välispraktika on õpiväljundite saavutamiseks korraldatav üliõpilase sihipärane tegevus rahvusvahelises töökeskkonnas õppeasutuse määratud vormis ning juhendaja juhendamisel. Kõik tegevused tuleks eelnevalt kooskõlastada programmijuhiga (ene.koresaar@ut.ee). Välispraktika sooritatakse väljaspool Eestit."}, "objectives": [{"en": "The aim of the practice course is to provide students with work experience. To learn and develop transferable skills, such as time management, team work, project management and international communication skills, as well as develop attitudes necessary for working. To practice implementing knowledge acquired during studies in a working environment and develop proficiency. To develop the skills to critically analyse the content of studies through the experience of internship abroad.", "et": "Välispraktika eesmärk on anda üliõpilastele praktilist töökogemust. Arendada nende ülekantavad oskusi (sh projektijuhtimine, ajaplaneerimine, enesejuhtimine jne). Harjutada erinevates õppeainetes õpitu rakendamist töökeskkonnas ja arendada vastavaid vilumusi. Arendada oskust õpitut praktikakogemuse põhjal analüüsida ja kriitiliselt hinnata."}, {"en": "The exact nature of the practice seminar will be individually decided by student and supervisor, depending on the background and interests of the student. The practice has to fall into one of the following three categories:", "et": "Välispraktika täpne sisu määratakse individuaalselt ning sõltub üliõpilase taustast ning huvidest, praktika tegevus peab langema ühte allpool kirjeldatud kategooriasse:"}, {"en": "1) Practical training in entrepreneurship. The student will go, on the basis of a practice contract, outside the University and abroad to some organisation. They will be assigned a practice supervisor. They will perform the work tasks assigned to them by their place of practice.", "et": "1) Ettevõtluspraktika. Tudeng läheb praktikalepingu alusel praktikale mõne organisatsiooni juurde ülikoolist ja Eestist välja. Talle määratakse praktikakoha poolt juhendaja. Ta sooritab praktikakohas talle ettenähtud tööülesanded."}, {"en": "2) Project based practice. The sudent will participate in the work of a team abroad within a specific project from beginning to the end. The project must be a response/solution to a specific need or request by an organisation outside the University.", "et": "2) Projektipõhine praktika. Tudeng osaleb ühe konkreetse projekti meeskonna töös välismaal projekti algusest lõpuni. Projekti lähteülesandeks on ülikooliväline tellimus mõne organisatsiooni poolt."}, {"en": "3) Teaching/research management assistant. The student will assist a member of the faculty at a foreign university with a course or research (incl. organizing academic events).", "et": "3) Õppeassistendi ja/või teaduskorralduse praktika. Tudeng assisteerib õppejõudu välisülikoolis ühe konkreetse õppeaine läbiviimise või teadustöö tegemise juures (sh akadeemiliste ürituste korraldamine)."}], "learning_outcomes": [{"en": "After completing the practice, the student is able to:", "et": "Praktika sooritanud üliõpilane:"}, {"en": "- creatively apply disciplinary knowledge and -skills within a working environment;", "et": "- oskab erialateadmisi ja -oskusi töökeskkonnas loovalt rakendada;"}, {"en": "- analyse the practice experience critically (via self-analysis) and integrate the theoretical knowledge with the international practice;", "et": "- analüüsib oma praktilist tegevust enesekohaselt ja -kriitiliselt (eneseanalüüs), püüdes selle käigus lõimida praktikat teoreetiliste teadmistega;"}, {"en": "- develop transferable skills in an international working environment (such as teamwork, time management, project management, etc);", "et": "- on arendanud ülekantavaid oskusi rahvusvahelises töökeskkonnas (näiteks meeskonnatöö, ajaplaneerimine, projektijuhtimine jt);"}, {"en": "- provide feedback about the internship abroad to the tutor and other students.", "et": "- annab välispraktika kohta tagasisidet juhendajale ja kaastudengitele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}