{"uuid": "e6336978-cebd-895f-1c61-83c4d9a3f603", "code": "HVKU.05.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Doctoral Seminar in Literary and Theatre Studies", "et": "Kirjanduse ja teatriteaduse doktoriseminar"}, "credits": 10, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU05", "structural_unit_name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU05", "name": {"en": "Department of Literature and Theatre Research", "et": "kirjanduse ja teatriteaduse osakond"}, "phone": "+372 737 5223", "webpage_url": "https://flku.ut.ee/et/instituudist/kirjanduse-teatriteaduse-osakond", "address": "Ülikooli 16, r 107-116b\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, r 107-116b", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}]}, "additional_info": {"duration_in_semesters": 3, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Reading research literature; discussion of the most important developments and issues in the field and in the students' research; presentation of the work in progress;  identification of theoretical and practical difficulties and search for solutions to the research problems; compiling written instructions and summaries; using different formats and genres of presentation and debate.", "et": "Erialakirjanduse lugemine ja analüüs; olulisemate lähenemiste ja uurimisküsimuste arutlus;  käimasoleva uurimistöö tutvustus; töös esilekerkivate arengute, teoreetiliste ja praktiliste probleemide ühine arutelu ja lahenduste otsing, kirjalike käsitluste ja kokkuvõtete koostamine, esinemised ja debatid erinevas formaadis ja žanris."}, "objectives": [{"en": "To develop the skills and ability to carry out research work; to analyze cutting-edge theories, approaches, and the ways of their application;  to identify and solve problems in the research in progress. The seminar addresses the possibilities and ways of production of a new cultural- and literary-theoretical knowledge; discusses relations between literary studies, philosophy, anthropology, and other disciplines; explores literature's relation to other arts, media, and cultural practices;  examines forms and functions of fictionality in everyday culture.", "et": "Iseseisva uurimistöö oskuste arendamine; uusimate teooriate ja lähenemiste analüüs ning rakendusvõimaluste hindamine; töös esile kerkinud probleemide identifitseerimine ja lahendamine.  Seminaril käsitletakse uue kirjandus- ja kultuuriteoreetilise teadmuse loomise võimalusi; vaadeldakse kirjandusteaduse suhteid filosoofia, antropoloogia ja muude teadustega ning kirjanduse suhteid teiste kunstide, meediumite ja kultuuripraktikatega; uuritakse fiktsionaalsuse vorme ja funktsioone kutuuris."}], "learning_outcomes": [{"en": "Students learn to develop academic discussion, initiate and plan their research work, identify and criticaly analyze theories, approaches, and methods relevant to their work, formulate research questions, identify problems in their own and other students' work and offer innovative and creative solutions, substantiate and defend their claims in oral and written speech.", "et": "Üliõpilased õpivad arutlema erialastel teemadel, algatama ja kavandama uurimustööd, kriitiliselt analüüsima tööga seonduvaid teooriaid, lähenemisi ja meetodeid, püstitama ja sõnastama uurimisküsimusi, identifitseerima probleeme oma ja teiste doktorantide uurimistöös ning pakkuma neile uudseid ja loovaid lahendusi, põhjendama, argumenteerima ja kaitsma oma seisukohti kõnes ja kirjas."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}