{"uuid": "59326298-b247-bc4b-9232-011284fbe099", "code": "HVKU.00.010", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-14T16:53:34", "title": {"en": "How is Life-Changing Creation Born and What can I Gain from It? (using music as an example)", "et": "Kuidas sünnib elumuutev looming ja mis minul sellest võita on? (Muusika näitel)"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU", "structural_unit_name": {"en": "Institute of Cultural Research", "et": "kultuuriteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU", "name": {"en": "Institute of Cultural Research", "et": "kultuuriteaduste instituut"}, "email": "sille.vadi@ut.ee", "phone": "+372 737 5223", "webpage_url": "https://kultuuriteadused.ut.ee/et", "address": "Ülikooli 16\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course requires no musical hearing and is open to all. We will go through 10 stages from the birth of creation to eternity. We will discuss the impact of narrative embedded in the creation at each stage. We will analyse the credibility of the message contained in the creation, and, using the human voice as an example, we will learn how to convey a compelling and believable message using suitable techniques. We will reflect on the world-enhancing possibilities of good narrative delivery. We will learn techniques for listening to music or consuming any creation to enhance its positive impact on our creativity and mental well-being. We will discuss the impact of creation on different scales, from home to the song festival. Several of the lectures will feature panel discussions, and experts in their fields will be invited. Each lecture will include practical music listening. The course requires active participation and delivers the content more holistically by being physically present.", "et": "Kursus ei eelda muusikalist kuulmist ning on avatud kõikidele huvilistele. Käime läbi 10 etappi loomingu sünnist igavikuni. Käsitleme iga etapi juures loomingusse põimitud narratiivi mõju võimalusi. Analüüsime loomingus peituva sõnumi usutavuse olemust ning õpime inimhääle näitel edastama mõjuvat ja usutavat sõnumit vastavate tehnikate abil. Mõtestame hea narratiivi edastuse maailma parandavaid võimalusi. Õpime kasutama tehnikaid muusika kuulamiseks või mistahes loomingu tarbimiseks eesmärgiga suurendada selle positiivset mõju iseenda loovusele ja vaimsele heaolule. Arutame loomingu mõju erinevates mastaapides, kodust laulupeoni. Mitmes loengus toimuvad paneelvestlused ning külla on kutsutud ka oma ala asjatundjad. Iga loeng kätkeb endas praktilist muusika kuulamist. Kursus eeldab aktiivset osalust ja annab sisu edasi terviklikumalt füüsiliselt kohal viibides."}, "objectives": [{"en": "The course aims", "et": "Kursuse eesmärk on"}, {"en": "- to develop the ability to understand the plausibility of the narrative used in a work of art and the possibilities of its impact (using music and human voice as an example);", "et": "-\tarendada oskust mõtestada loomingus kasutatava narratiivi usutavust ja mõju võimalusi (muusika ja inimhääle näitel);"}, {"en": "- to broaden the knowledge of the creative process more widely through the example of music;", "et": "-\tavardada teadmisi loomeprotsessist laiemalt muusika näitel;"}, {"en": "- to develop the ability to listen to music or use any creation to cultivate one's mental well-being and creativity.", "et": "-\tarendada oskust kuulata muusikat või kasutada mistahes loomingut enda vaimse heaolu ja loovuse kultiveerimiseks."}], "learning_outcomes": [{"en": "A student who completes the course", "et": "Kursuse edukalt läbinud üliõpilane"}, {"en": "- can understand the plausibility of a narrative using the example of differences in the human voice;", "et": "-\toskab mõtestada narratiivi usutavust inimhääle kõla erinevuste näite varal;"}, {"en": "- has a holistic and comprehensive understanding of the processes of musical composition/production;", "et": "-\tomab terviklikku ja põhjalikku ettekujutust muusikaloome protsessidest;"}, {"en": "- can use techniques for listening to music or consuming any creation to enhance the positive impact on one's own creativity and mental health.", "et": "-\toskab kasutada tehnikaid muusika kuulamiseks või mistahes loomingu tarbimiseks eesmärgiga suurendada positiivset mõju iseenda loovusele ja vaimsele tervisele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}