{"uuid": "3a458d7a-8b34-175c-6ae2-59e61c1a27e1", "code": "HVKU.03.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Internships/Fieldwork", "et": "Erialane praktika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU", "structural_unit_name": {"en": "Institute of Cultural Research", "et": "kultuuriteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVKU", "name": {"en": "Institute of Cultural Research", "et": "kultuuriteaduste instituut"}, "email": "sille.vadi@ut.ee", "phone": "+372 737 5223", "webpage_url": "https://kultuuriteadused.ut.ee/et", "address": "Ülikooli 16\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students design individual courses in collaboration with their supervisors, based on the topics of their master's thesis or master's project, as well as on other professional needs and interests. The course may consist of one or several of the following components: ethnographic fieldwork (including planning, conducting and documentation of fieldwork); research administration (e.g. the organisation of conferences and seminars) or cultural management (e.g. the organisation of cultural events); assisting academic teaching; a project in applied anthropology (e.g. applied projects in collaboration with the civil society, communities or businesses); internship in a museum or archive; experimental design (e.g. the testing of materials, techniques, designs or products that draw on traditional techniques, designs and methods). Each component of the internship/fieldwork must be accompanied by a practice diary and report.", "et": "Üliõpilane kujundab aine sisu koostöös juhendajaga lähtudes oma magistritöö või -projekti teemast ning erialastest eesmärkidest ja vajadustest. Näiteks võib praktika hõlmata ühte või mitut järgmistest valdkondadest: etnograafilised välitööd (sh välitööde planeerimine, läbiviimine, dokumenteerimine, materjalide korrastamine); korralduspraktika (teadus- ja kultuuriürituste korraldamise erinevad etapid); assistendipraktika (õppetöö läbiviimine); rakendusantropoloogia praktika (rakendusliku kultuurianalüüsi kogemuste omandamine ühiskonna erinevates sektorites, sh kodanikuühiskond, töö kogukondade, ettevõtete jm organisatsioonidega); muuseumipraktika; arhiivipraktika; eksperimentaalpraktika (konkreetse materjali, tehnika, toote, disaini katsetamine ja testimine, ammutades inspiratsiooni traditsioonilistest tehnikatest, disainist, töövõtetest). Praktika iga komponendi juurde kuulub praktikapäevik ja -aruanne."}, "objectives": [{"en": "This course aims to increase students' competence in their chosen specialisations and to support the progress of their master's thesis or master's project. Students are given opportunities to enhance knowledge and skills obtained during their MA studies by applying them creatively in different situations and spheres of life, and by analysing their professional development and needs.", "et": "Suurendada üliõpilase asjatundlikkust valitud uurimis- või tegevusvaldkonnas ja toetada magistritöö või -projekti valmimist, võimaldades tal õpingute käigus omandatud teadmisi ja oskusi ühiskonna erinevates sfäärides loovalt rakendada, praktilise kasutamise kaudu kinnistada ning eneseanalüüsi kaudu hinnata."}], "learning_outcomes": [{"en": "Upon successful completion of this course, students should\n*\thave increased their skills in planning, initiating, carrying out and leading projects in their chosen specialisations, and in reflecting on their professional activities;\n*\tbe capable of applying their specialist knowledge and skills to gather information, and solve real-life situations and ethical problems under time constraints;\n*\thave developed their skills in expressing themselves orally and in writing to diverse audiences;\n*\thave developed their sense of responsibility, people skills and teamwork skills;\n*\trecognise their opportunities and tasks as (future) specialists.", "et": "Praktika tulemusel on arenenud üliõpilase võime 1) erialaseid projekte planeerida, algatada, ellu viia, juhtida ja oma erialast tegevust reflekteerida; 2) kasutada erialaseid teadmisi ja oskusi erinevate olukordade ja probleemide eetiliseks lahendamiseks ning informatsiooni kogumiseks ja hindamiseks piiratud aja tingimustes; 3) oma erialaseid seisukohti  suuliselt ja kirjalikult erinevatele auditooriumitele väljendada. Samuti on paranenud üliõpilase 4) vastutustunne, juhtimis-, suhtlemis- ja meeskonnatööoskused, ning ta 5) teadvustab enda kui (tulevase) erialaspetsialisti võimalusi ja ülesandeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}