{"uuid": "4bc704ae-8ed7-c6be-990c-b2a1613f46e8", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T22:48:55", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 30, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVKU03", "structural_unit_name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 780, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The Master's thesis in Ethnology is an independent, empirically based and theoretically informed academic study that reflects the student's professional knowledge acquired during Master's studies, orientation in the chosen subject area and academic writing skills. The thesis is written under the supervision of a faculty member and defended in an open discussion in front of a defence committee.", "et": "Etnoloogia magistritöö on iseseisev, empiirilisel materjalil põhinev ja teoreetiliselt mõtestatud akadeemiline uurimus, mis väljendab üliõpilase magistriõpingutes omandatud erialaseid teadmisi, orienteerumist valitud teemavaldkonnas ja akadeemilist väljendusoskust. Magistritöö kirjutatakse erialaõppejõu juhendamisel ja kaitstakse avalikul väitlusel kaitsmiskomisjoni ees"}, "objectives": [{"en": "A Master’s thesis in ethnology is an independent academic research project based on empirical material and theoretical analysis. It demonstrates the student’s professional knowledge acquired during the Master’s programme, their familiarity with the chosen field of study, and their academic expression skills. The author of the thesis can identify a scientific problem, delineate the research area, collect, systematise, analyse, and synthesise data, apply research methods appropriate to the objectives, and present the research findings in a properly formatted manner.\n\nThe sources or materials studied in a Master’s thesis in ethnology or folklore studies may:\n(a) be created by the student using fieldwork methods,\n(b) utilise existing sources (archival materials, documents, online sources, etc.), or\n(c) combine both approaches.\n\nThe thesis is written under the supervision of a faculty member specialising in the field and is defended in a public discussion before a defence committee.", "et": "Etnoloogia magistritöö on iseseisev, empiirilisel materjalil põhinev ja teoreetiliselt mõtestatud akadeemiline uurimus, mis väljendab üliõpilase magistriõpingutes omandatud erialaseid teadmisi, orienteerumist valitud teemavaldkonnas ja akadeemilist väljendusoskust. Magistritöö autor oskab püstitada teaduslikku probleemi, piiritleda teemavaldkonda, koguda, süstematiseerida, analüüsida ja üldistada andmeid, rakendada eesmärkidele vastavaid uurimismeetodeid ning korrektselt vormistada uurimuse tulemusi. Etnoloogia või folkloristika eriala magistritöös uuritava materjali ehk allikad: (a) loob üliõpilane ise kasutades välitööde meetodeid või (b) kasutab olemasolevaid allikaid (arhiiviallikad, dokumendid, internetiallikad vm) või (c) kombineerib neid mõlemaid. Magistritöö kirjutatakse erialaõppejõu juhendamisel ja kaitstakse avalikul väitlusel kaitsmiskomisjoni ees."}], "learning_outcomes": [{"en": "A student who has completed the course is able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "- formulate a research problem, aim, and research questions relevant to the field for their Master’s thesis;\n- select sources, materials, and research methods appropriate to the research problem;\n- apply the chosen methods accurately and purposefully in addressing the research task", "et": "- oskab magistritöös sõnastada valdkonna seisukohalt olulise uurimisprobleemi, eesmärgi ja uurimisküsimused; \n- valib töö uurimisprobleemile vastavad allikad, materjalid ja uurimismeetodid;\n- rakendab valitud meetodeid korrektselt ja sihipäraselt uurimisülesande lahendamisel;\n"}, {"en": "- demonstrate knowledge of the previous research on the chosen topic and place their research within the relevant theoretical and methodological context of the field; \n- utilise sources and literature pertinent to the topic appropriately and critically", "et": "- tunneb uuritava teema varasemat uurimislugu ja oskab oma teema paigutada erialasesse teoreetilisse ja metodoloogilisse konteksti; \n- oskab kasutada teemakohaseid allikaid ja kirjandust asjakohaselt ning kriitiliselt;"}, {"en": "- conduct independent and well-argued research that addresses the stated research problem and objectives;\n- analyse and interpret research findings, linking them both to each other and to existing literature;\n- synthesise the results and conclusions of their work, contributing new knowledge or professional insights to the field", "et": "- suudab teostada iseseisva ja argumenteeritud uurimistöö, mis vastab püstitatud uurimisprobleemile ja -eesmärkidele; \n- analüüsib ja tõlgendab uurimistulemusi ning seostab neid nii omavahel kui ka varasema kirjandusega;\n- sünteesib töö tulemusi ja järeldusi, pakkudes uusi teadmisi või erialaseid arusaamu;"}, {"en": "- prepare and format the Master’s thesis in accordance with the requirements of academic writing and formatting;\n- use professional terminology accurately and express their ideas clearly and precisely", "et": "- koostab ja vormistab magistritöö vastavalt akadeemilise kirjutamise ja vormistamise nõuetele;\n- kasutab korrektselt erialast terminoloogiat ja väljendab oma seisukohti korrektses, selges ja täpses keeles;"}, {"en": "- deliver a well-reasoned and structured defence speech that clearly and comprehensibly presents the main arguments of the research;\n- engage in academic discussion, defend their positions, and provide justified responses to questions about their work.", "et": "- koostab põhjendatud ja struktureeritud kaitsekõne, mis esitab uurimistöö põhiseisukohad selgelt ja arusaadavalt;  \n- osaleb akadeemilises diskussioonis, kaitstes oma seisukohti ja vastab põhjendatult oma töö kohta esitatud küsimustele."}], "notes": {"et": "Magistritööle esitavad sisulised ja vormilised nõuded on täpsemalt kirjeldatud etnoloogia, folkloristika ja rakendusantropoloogia õppekava magistritöö juhendis."}}, "grading": {"independent_work": {"et": "Magistritöö kirjutatakse erialaõppejõu juhendamisel järgides Etnoloogia, folkloristika ja rakendusantropoloogia õppekava magistritöö juhendit."}, "grade_preconditions": {"et": "Õppekava täitmine täies mahus"}, "grade_evaluation": {"et": "Uurimisülesanne, allikad ja meetod (15%). \nAllikate ja kirjanduse kasutamine (15%)\nUurimisülesande lahendamine (50%)\nTöö vormistamine (10%)\nKaitsmine (10%)\n"}, "grade_conditions": {"A": {"et": "Tööl on uudne, teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus ning seda on igakülgselt põhjendatud ja piiritletud. Meetod(id) on valitud lähtuvalt eesmärgist ja võimaldavad seda saavutada. Allikad/materjalid on valitud teemakohaselt, need on mitmekesised ja piisavad.\n\nVarasem uurimislugu on esitatud läbimõeldult ja mitmekülgselt, teema on põhjendatult paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt, demonstreerides nende põhjalikku tundmist.\n\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt omapoolse originaalse panuse. Töö on loogiliselt struktureeritud. Argumentatsioon on elegantne ja erudeeritud, tulemuste tõlgendamine ja omavaheline seostamine silmapaistev ja süntees kirjandusega läbimõeldud ja isikupärane.\n\nVormistus vastab kehtivale Juhendile. Viitamine on korrektne. Töö on kirjutatud suurepärases eesti keeles, väljendusviis on elegantne, stiililiselt ja grammatiliselt laitmatu. Töö maht vastab nõuetele.\n\nAnnab asjakohase ja kontekstualiseeriva ülevaate töö uurimisprobleemist /eesmärgist, uurimisküsimustest, meetoditest ja peamistest tulemustest. Demonstreerib suurepärast esinemis- ja väitlusoskust ning eruditsiooni. Vastab põhjendatult ja vajaliku üldistusega esitatud küsimustele."}, "B": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, seda on igakülgselt põhjendatud ja piiritletud. Meetod(id) on valitud lähtuvalt eesmärgist ja võimaldavad seda saavutada. Allikad/materjalid on valitud teemakohaselt ja need on piisavad.\n\nVarasem uurimislugu on esitatud läbimõeldult, teema on põhjendatult paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt, demonstreerides nende väga head tundmist.\n\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt töö tulemused. Töö on loogiliselt struktureeritud. Argumentatsioon on põhjendatud ja sidus, tulemuste tõlgendamine ja omavaheline seostamine põhjalik ja süntees kirjandusega läbimõeldud.\n\nVormistus vastab kehtivale juhendile, üksikute väikeste puudustega. Töö on kirjutatud väga heas eesti keeles, stiil on grammatiliselt korrektne. Viitamine ja väljendusviis on korrektsed. Töö maht vastab üldjoontes nõuetele.\n\nAnnab asjakohase ja kontekstualiseeriva ülevaate töö uurimisprobleemist / eesmärgist, uurimisküsimustest meetoditest ja peamistest tulemustest. Esineb ja väitleb ladusalt. Vastab põhjendatult ja vajaliku üldistusega esitatud küsimustele."}, "C": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, seda on põhjendatud ja piisava selgusega piiritletud. Meetod(id) on osaliselt valitud lähtuvalt eesmärgist ning võimaldavad seda saavutada. Allikad/materjalid on valitud teemakohaselt, aga neis esineb puudujääke.\n\nVarasem uurimislugu on esitatud, teema on paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt.\n\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt töö tulemused. Töö on üldjoontes loogiliselt struktureeritud. Argumentatsioon on sidus, tulemuste tõlgendamine ja omavaheline seostamine piisav ja süntees kirjandusega üldjoontes läbimõeldud.\n\nVormistus vastab kehtivale juhendile, üksikute puudustega. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb ebatäpsusi, kuid viitamissüsteem on ühtne. Töö maht vastab üldjoontes nõuetele.\n\nAnnab asjakohase ülevaate töö uurisprobleemist /eesmärgist ja uurimisküsimustest, meetoditest ja peamistest tulemustest. Esineb ja väitleb ladusalt. Vastab põhjendatult esitatud küsimustele."}, "D": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, kuid need on ebapiisavalt põhjendatud ja ebaselgelt piiritletud. Meetod(id) on osaliselt valitud lähtuvalt eesmärgist. Allikad/materjalid on valitud teemakohaselt, aga neis esineb olulisi puudujääke.\n\nVarasem uurimislugu on esitatud osaliselt, teema on osaliselt paigutatud erialasesse konteksti. Teemakohaste allikate/materjalide kasutuses on märgatavaid puudujääke.\n\nAutor viib ettevõetud ülesande lahendamise lõpule, esitades töö tulemused. Töö struktuuris on küsitavusi. Argumentatsioon on kohati katkendlik, tulemuste tõlgendamine ja omavaheline seostamine laialivalguv ja süntees kirjandusega juhuslik.\n\nVormistus vastab kehtivale juhendile, kuid esineb ka puudusi. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb mitmeid ebatäpsusi ja kohatist ebajärjekindlust.  Töö maht ületab või jääb oluliselt allapoole nõutud piiri.\n\nAnnab ülevaade töö uurimisprobleemist /eesmärgist ja uurimisküsimustest, meetoditest ja peamistest tulemustest. Vastab esitatud küsimustele üldjoontes veenvalt."}, "E": {"et": "Tööl on teaduslik probleemiasetus ja/või eesmärgipüstitus, kuid neid ei ole põhjendatud ja selgelt piiritletud. On küsitavusi valitud meetod(it)e sobivuses töö eesmärgi saavutamiseks. Allikad/materjalid on osaliselt valitud teemakohaselt, aga neis esineb olulisi puudujääke.\n\nVarasem uurimislugu on esitatud kasinalt, teema paigutamine erialasesse konteksti jääb pinnapealseks. Teemakohaste allikate/materjalide kasutuses on olulisi puudujääke.\n\nAutor viib ettevõetud ülesande lahendamise lõpule, kuid tulemused jäävad ebaselgeks. Töö struktuuris on märkimisväärseid küsitavusi. Argumentatsioon on katkendlik, tulemuste tõlgendamine ja omavaheline seostamine pealiskaudne ja süntees kirjandusega napp ja juhuslik.\n\nVormistus vastab üldjoontes kehtivale juhendile, kuid esineb ka märkimisväärseid puudusi. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb olulisi ebatäpsusi ja ebajärjekindlust.  Töö maht ületab või jääb oluliselt allapoole nõutud piiri.\n\nKirjeldab töö uurimisprobleemi / eesmärki ja uurimisküsimusi, meetodeid ja tulemusi, kuid on laialivalguv; vastab esitatud küsimustele ebaselgelt ja mitteveenvalt."}, "F": {"et": "Magistritöö ja kaitsmise tulemus jääb allapoole hindele E seatud tingimusi."}, "mi": {"et": "Üliõpilane ei ilmu kaitsmisele."}}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "Kõik magistritööd puudutavad materjalid on kättesaadavad Moodle'is aines Etnoloogia ja folkloristika magistriseminar (FLKU.03.006)", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "3e16cfc2-15f8-eaa5-3f9d-427071ed6481", "person_name": "Ester Bardone", "structural_unit": {"code": "HVKU03", "name": {"en": "Department of Ethnology", "et": "etnoloogia osakond"}, "phone": "+372 737 5654", "webpage_url": "https://flku.ut.ee/et/etnoloogia-osakond", "address": "Ülikooli 16, ruumid 204, 211, 213\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 16, ruumid 204, 211, 213", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVKU"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Magistritöö valmimise ajajoont tutvustatakse Etnoloogia ja folkloristika magistriseminaris. Magistritöö kirjutatakse juhendajaga kokkulepitud ajakava järgi."}}, "registration_info": {"audience": {}}, "parent_uuid": "128fe2c1-ad18-6dff-3fa1-95722c0a88a1", "parent_code": "HVKU.03.063", "parent_credits": 30, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}