{"uuid": "b06b4924-36d0-b715-1670-0a998342096d", "code": "HVLC.06.029", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Danish for Intermediate Learners, Level B1.1 > B1.2", "et": "Taani keel kesktasemele, tase B1.1 > B1.2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "rarely", "et": "harvem, kui üle õppeaasta", "en": "less than every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false, "language_training": {"language": {"code": "da", "et": "taani keel", "en": "Danish"}, "start_level": {"code": "B1.1", "et": "B1.1", "en": "B1.1"}, "end_level": {"code": "B1.2", "et": "B1.2", "en": "B1.2"}}}, "overview": {"description": {"en": "The course is intended for second year students majoring in Scandinavian languages and cultures. A knowledge of Danish at level B1 as described in the Common European Framework of Reference is a prerequisite for participating. The backbone of the course is language practice, including increasing vocabulary and discussing grammar problems. Active participation in the classes is expected. There is a lot of group and pair work. A great emphasis is also placed on individual work in Moodle.", "et": "Kursus on mõeldud teise aasta tudengitele, kes õpivad Skandinaavia keelte ja kultuuride erialal. Kursusel osalemise eeltingimusteks on taani keele teadmised Euroopa Nõukogu keeleoskustasemel B1. Kursus on üles ehitatud praktilisele keelekasutusele sh. sõnavara laiendamisele ja grammatikaküsimustele. Tunnid eeldavad aktiivset osavõttu, teeme palju rühma- ja paaristööd. Samuti on suur rõhk iseseisval tööl Moodle'i keskkonnas."}, "objectives": [{"en": "The course intends to strengthen the students' practical knowledge of Danish, leading them to the language proficiency level B1.2 as described in the European Frame of Reference; develop the students' reading, speaking, listening and writing skills in Danish, deepen the theoretical base knowledge necessary for linguistic analysis and discussion, and expand knowledge of ways of expression characteristic to the Danish culture and society.", "et": "Kursuse eesmärgiks on süvendada tudengite praktilist taani keele oskust ja viia see Kursuse eesmärgiks on süvendada tudengite praktilist norra keele oskust ja viia see Euroopa Nõukogu keeleoskustasemele B1.2, arendada tudengite oskuseid taani keele lugemises, rääkimises, kuulamises ja kirjutamises, süvendada teoreetilised alusteadmised, mis on vajalikud lingvistilise arutelu ja analüüsi jaoks ning suurendada teadmisi taani keele ühiskonnale ja kultuurile omastest väljendusviisidest."}], "learning_outcomes": [{"en": "After completing the course, the student: \n- understands texts on familiar and interesting topics, e.g. work, school, free time etc; \n- holds a fluent conversation on familiar and interesting topics; \n- holds a prepared presentation on a familiar topic, expressing themselves in simple, relatively clear and understandable language; \n- composes simple texts on familiar or interesting topics; \n- applies theoretical base knowledge in the field of Danish philology; \n- describes experiences, events, dreams and goals, as well as explains briefly their opinions and plans; \n- understands differences between Estonian and Danish cultures, and takes them into account in both written and spoken communication.", "et": "Kursuse läbinud üliõpilane:\n\n- saab aru tekstidest endale tuttaval ja huvipakkuval teemal, nagu töö, kool, vaba aeg vm;\n- vestleb ladusalt endale tuttavatel ja huvipakkuvatel teemadel;\n- esineb ettevalmistunult lihtsas keeles endale tuttaval teemal, väljendudes võrdlemisi selgelt ja arusaadavalt;\n- koostab lihtsat teksti tuttaval või enda jaoks huvipakkuval teemal;\n- rakendab teoreetilisi alusteadmisi taani filoloogia valdkonnas;\n- kirjeldab kogemusi, sündmusi, unistusi ja eesmärke ning põhjendab ja selgitab lühidalt \noma seisukohti ja tulevikuplaane;\n- mõistab eesti ja taani kultuurierisusi ning arvestab nendega nii suulises kui kirjalikus keelekasutuses."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}