{"uuid": "8fc13369-643c-d32f-23ad-49b939d398a3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-11T12:26:09", "title": {"en": "Swedish for Beginners II (on the Basis of English), Level A1.2 > A2.1", "et": "Rootsi keel algtasemele II (inglise keele baasil), tase A1.2 > A2.1"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV Eng", "et": "24/25 K PÕ HV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 64, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "language_training": {"language": {"code": "se", "et": "rootsi keel", "en": "Swedish"}, "start_level": {"code": "A1.2", "et": "A1.2", "en": "A1.2"}, "end_level": {"code": "A2.1", "et": "A2.1", "en": "A2.1"}}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "se", "et": "rootsi keel", "en": "Swedish"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "In addition to the textbook materials and activities, we focus on everyday language use and practise vocabulary you need when settling in Sweden for studies, business or life. Also vocabulary for work situations, Business Swedish and communication will be practised.\n\nVocabulary: family and relatives, describing people, shopping, writing a letter, customs and traditions, sports. The Swedish culture and society. We shall also learn some introductory basics in Swedish business culture and business vocabulary, discuss the Swedish meeting style, and watch and analyse some relevant videos and video-clips along the way.\n\nGrammar: irregular verbs; Preteritum, Perfekt, Pluskvamperfekt - formation and use. Adjectives and adverbs. Expressions of time. Word order in subordinate clauses. The definite declension of the adjective in outline and adjectival nouns. Modal verbs. S-verbs: reciprocal, deponent and passive. Reflexive verbs and pronouns. Present and past participles. Comparison of adjectives. Transitive and intransitive verbs. Compound verbs. Affixation. Passives. Abbreviations.", "et": "Peamised vestlus- ja grammatikateemad: \n\nHarjutame palju reaalseid suhtlusolukordi, arendame sõnavara, mida võid vajada \"kohe täna\" Rootsi õppima v elama asudes ning Rootsit külastades.\n\nSõnavara: perekond ja sugulased, inimeste kirjeldamine, poes käik, kombed ja traditsioonid, kirja kirjutamine, sport. Rootsi kultuur ja ühiskond; sissejuhatavad väljendid ärikeeles ja koosolekusõnavara.\nGrammatika: Aegade tabel. Preteritum, Perfekt, Pluskvamperfekt. Omadussõnad ja määrsõnad - ühildumine nimisõnaga (kordus). Ajaväljendid. Sõnade järjekord kõrvallauses. Määratlussõna tabel. Modaalverbid. S-tegusõna: vastastikused tegusõnad, depoonens ja passiiv. Enesekohased tegusõnad ja asesõnad. Oleviku ja mineviku kesksõna. Omadussõnade võrdlusastmed. Sihilised ja sihitud verbid. Liitverbid. Passiiv. Lühendid."}, "objectives": [{"en": "In order to participate in the course students must have successfully passed Swedish for beginners I ( or: if equivalent, provide a certificate on having successfully passed an  0-A1 course with 30x2 lessons).\n\nThe course will offer working with: texts, discussing topics and analysing/watching videos on Swedish culture and society corresponding to language level A1-A2/B1. Studytrips and  -events.\n\nThe aim of the course is to increase one's vocabulary and to  to speak Swedish (level A2) in more simple everyday situations; also to develop the grammar skills (level A2); brush up pronunciation (level A2), to write independent papers (level A2), to read texts and be able to understand the content (level A2), to listen to authentic texts on CDs and DVDs, etc. Also, to learn more about the Swedish society, culture and everyday life.", "et": "NB! Kursusel osalemiseks on kohustuslik kursuse rootsi keel algajatele I läbimine v sellele vastavad oskused ( tõend, et läbitud on vähemalt 30x2 akadeemilise tunniga kursus).\n\nJätkukursusel tegeletakse:\n\n1. Sõnavara arendamine ja grammatikastruktuuride omandamine A1-A2 tasemel.\n2. osata kõneleda ning mõista igapäevaseid suhtlemissituatsioone tasemel A2.\n3. Osata lugeda tekste tasemel A2-B1.\n4. Hääldamise viimistlemine, jõudmaks tasemele A2-B1.\n5. Kirjutamisoskuse arendamine: eesmärk - suuta kirjutada iseseisvalt etteantud teemadel omandatud grammatika piires - A2.\nTekstid, vestlusteemad ja videod keeletasemel A2/B1. \nEttekanded, rühmatööd, õpivisiidid ja -üritused.\n6. Mõista tekste (kuulamine, autentsed tekstid ja õppematerjalid ) ja suuta kõnelda tasemel A2.\n7. Samuti tutvume erinevate tegevuste käigus põgusalt rootsi kultuuri, ühiskonna ja igapäevaeluga\n\nTekstid, vestlusteemad ja videod keeletasemel A1-1A2/B1. Ettekanded, rühmatööd, õpivisiidid ja -üritused."}], "learning_outcomes": [{"en": "By the end of the course the students have increased their vocabulary and developed their speaking skills as well as their knowledge of grammar s to the level of A2, they are able to read and to listen and speak on the obtained topics on level A2,  and write the texts up to level A2. Getting to know the ( introductory level) Swedish society and culture, as well as business style and business culture. Being able to present themselves, their studies, their day and everyday practices, studies, describing a person, speaking about some more simple traditions and customs, managing in some daily situations (shopping, post office, cafe', at a meeting, at a business meeting, at the office, etc.).", "et": "Kursuse lõpuks on sõnavara suurenenud ning kõnelemisoskus arenenud tasemeni A2; grammatikatase, lugemis- kuulamis- ja kirjutamisoskus arenenud tasemeni A2. Rootsi ühiskonna ja kultuuriga lähemalt tutvumine. Rootsi koosoleku-, äri- ning suhtlusstiiliga tutvumine ( valitud õppuritele rootsi ärikeele õppereis Soome)."}], "notes": {"et": "Dear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling.\nRequiring special conditions at the end of the semester is not acceptable."}}, "grading": {"independent_work": {"et": "Progress tests, assignments, presentations"}, "grade_preconditions": {"et": "1. Participation in at least 80% of the classes.\n2. Active participation in the seminars; all tasks completed on time; home-work done:).\n3. 1 individual mini-presentation on a topic relating to the Swedish society, culture, , etc..\n    1 group report\n     home-reading \n4. 4 mini-tests"}, "grade_evaluation": {"et": "In order to get a \"Pass\", all requirements have to be fulfilled with a positive result within the time-frame given."}, "debt_elimination": {"et": "Any shortcomings must be eliminated by April 28 at the latest to be allowed into the final book-presentations stage."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "aaa66a22-89dc-4405-9337-1c4107171d0a", "type": "MOODLE", "code": "HVLC.06.011_ENG_2022", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Ilmar Mullamaa \"Rootsi keele õpik\",  Svenska utifran,  Moodle, Rivstart, osv.\n\nThe detailed course plan and list of course materials are available in our e-support Moodle course that will be open for the participants from the first lessons"}, "participants": {"lecturers": [{"person_uuid": "45edf2d2-9de6-3a33-2b14-422ae5a1ec47", "person_name": "Kristina Mullamaa", "structural_unit": {"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}], "assistants": ["44da1232-9c4b-2715-e732-8e64aa323c43"]}, "schedule": {"weeks": {"et": "24-39"}}, "registration_info": {"audience": {"et": "24-39"}, "min_students": 15, "max_students": 15}, "parent_uuid": "294d9b61-c96c-c754-552f-82a5a68a0e91", "parent_code": "HVLC.06.011", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}