{"uuid": "9b0c5f8f-6955-a626-0240-c4c0d475cf1a", "code": "HVLC.03.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "French for Beginners III (on the Basis of English), Level A1.2 > A2.1", "et": "Prantsuse keele algkursus III (inglise keele baasil), tase A1.2 > A2.1"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "fr", "et": "prantsuse keel", "en": "French"}, "start_level": {"code": "A1.2", "et": "A1.2", "en": "A1.2"}, "end_level": {"code": "A2", "et": "A2", "en": "A2"}}}, "overview": {"description": {"en": "The course presupposes the Council of Europe Level A1.2.\nThe contents of  the course (communication situations and vocabulary):\n- learning and studies;\n- expressing opinion, emotions, motivation and preferences;\n- accommodation (types and description);\n- comparison;\n- everyday activities;\n- giving advice and asking for one;\n- describing the past (memories, habits), telling a biography or stories in the past, talking about one's experiences.\nGrammar topics:\n- revision of verb conjugation (indicative mood, present tense);\n- revision of personal pronouns as direct (pronom personnel complément d'objet direct, COD) and indirect objects (pronom personnel complément d'objet indirect, COI);\n- pronoun of place Y and spatial prepositions;\n- comparatives and superlatives;\n- causal conjunctions;\n- relative pronouns (qui, que, où);\n- indefinite adjectives and pronouns;\n- the past tenses imparfait and passé composé and choosing between them when telling a story in the past;\n- passé composé: agreement of the past participle in gender and in number;\n- present continuous présent continu.", "et": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel A1.2.\nSemestris käsitletavad suhtlussituatsioonid ja sõnavara:\n- õpingud ja õppimine;\n- arvamuse avaldamine, emotsioonide verbaalne väljendamine, motivatsiooni ja eelistuste selgitamine;\n- majutus- ja elukohtade tüübid ja kirjeldamine;\n- võrdlemine;\n- igapäevategevused;\n- nõuannete küsimine ja andmine;\n- mineviku kirjeldamine (mälestused, harjumused), eluloost rääkimine, minevikulugude jutustamine, oma kogemuste edastamine.\nGrammatika: \n- tegusõna pööramine olevikus (ülevaatlik kordamine);\n- sihitisasesõnade kordamine: otsesihitis COD (pronom personnel complément d'objet direct) ja kaudsihitis COI (pronom personnel complément d'objet indirect);\n- kohaasesõna Y ja kohaeessõnad;\n- kesk- ja ülivõrre;\n- põhjendavad sidesõnad;\n- siduvad asesõnad (qui, que, où);\n- umbmäärased ase- ja omadussõnad;\n- minevikuajad: kestev minevik imparfait, liitminevik passé composé ja ülevaade mineviku kesksõnade ühildumisest;\n- sobiva minevikuaja (imparfait või passé composé) valik minevikuloo jutustamisel;\n- kestev olevik présent continu."}, "objectives": [{"en": "The course continues giving further basic knowledge and practising it in speech and writing with the aim of developing reading, conversational and listening  skills. The focus is on practicing the use of personal pronouns and the main past tenses.", "et": "Kursuse eesmärgiks on jätkata algtaseme keelestruktuuride ja suhtluskeele omandamist kõnes ja kirjas, arendades lugemis-, jutustamis-, vestlus- ja kuulamisoskust. Rõhku pööratakse sihitisasesõna ja levinumate minevikuaegade kasutamisele."}], "learning_outcomes": [{"en": "By the end of the course, the students will have acquired the necessary vocabulary and grammar in a way that it covers all four language skills in what comes to coping within the matters treated during the language course: they understand and are able to write texts on different subjects, are able to have a conversation or understand a spoken text both in present and in past, to talk about their experiences in the past.", "et": "Õppeaine läbinud üliõpilane on omandanud vajaliku sõnavara ja grammatika viisil, mis semestri käigus käsitletud temaatika piires võimaldab rakendada kõiki keelelise kompetentsi osaoskusi: mõista ja koostada erineva sisuga tekste, vestelda ning aru saada kuulatud tekstidest nii olevikus kui minevikus."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}