{"uuid": "ca5070b7-c637-66b3-4f06-15de7a53bd24", "code": "HVLC.09.057", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-12T15:21:42", "title": {"en": "Educational Estonian, Level B2", "et": "Eesti keel tööks eestikeelses haridusasutuses, tase B2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC09", "structural_unit_name": {"en": "Department of Languages of the Baltic Region", "et": "balti regiooni keelte osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC09", "name": {"en": "Department of Languages of the Baltic Region", "et": "balti regiooni keelte osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "start_level": {"code": "B2", "et": "B2", "en": "B2"}, "end_level": {"code": "B2.1", "et": "B2.1", "en": "B2.1"}, "is_in_depth_estonian_training": true}}, "overview": {"description": {"en": "Estonian language communication course, which introduces what is happening in the educational landscape and provides practical skills for entering school life, especially for teachers. The main emphasis is on auditory learning that enables self-expression.", "et": "Eesti keele suhtluskursus, mis juhatab sisse haridusmaastikul toimuvasse ja annab praktilisi oskusi kooliellu sisenemiseks eelkõige õpetajatele. Põhirõhk on auditoorsel eneseväljendamist võimaldaval õppetööl."}, "objectives": [{"en": "To give students who speak Estonian as a second language and who plan to work primarily as teachers, the opportunity to improve their Estonian language skills, to help acquire the linguistic competence necessary to enter the labor market - to acquire vocabulary in the field of education, to learn how to correctly write a CV, motivation letter, to prepare for job interviews, to experience different learning methods that can use in the future when working as a teacher.", "et": "Anda eesti keelt teise keelena rääkivatele tudengitele, kel kavas tulevikus eelkõige õpetajana tööle asuda, võimalus täiendada oma eesti keele oskust, aidata omandada tööturule sisenemiseks vajalikku keelelist pädevust - omandada haridusvaldkonna sõnavara, õppida korrektselt kirjutama elulookirjeldust, motivatsioonikirja, valmistuda tööintervjuudeks, kogeda erinevaid õppemeetodeid, mida tulevikus saavad kasutada õpetajana töötades."}], "learning_outcomes": [{"en": "The participant in the study communicates in Estonian on (various) topics in the field of education, actively participates in the conversation, takes over the speaking round, can explain and justify his opinion if necessary; knows the vocabulary of the field of education, knows how to prepare a clear and logical curriculum vitae and motivation letter, emphasizes the important things, knows how to prepare for a job interview; prepares and carries out one learning activity by applying the active learning method.", "et": "Õppes osalenu suhtleb eesti keeles haridusvaldkonna (erinevatel) teemadel, osaleb aktiivselt vestluses, võtab kõnevooru üle, vajadusel oskab selgitada ja põhjendada oma arvamust; valdab haridusvaldkonna sõnavara, oskab koostada selget ja loogilist elulookirjeldust ja motivatsioonikirja, rõhutada olulist, teab, kuidas valmistuda tööintervjuuks; valmistab ette ja viib läbi ühe õppetegevuse aktiivõppemeetodit rakendades."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}