{"uuid": "4aad2fc3-9be6-ab51-72e4-e3d8de77e233", "code": "HVLC.09.058", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-29T12:11:41", "title": {"en": "Estonian Intensive Course for Beginners (Level 0 - A1.2)", "et": "Eesti keele intensiivkursus algajatele (tase 0 - A1.2)"}, "credits": 12, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC09", "structural_unit_name": {"en": "Department of Languages of the Baltic Region", "et": "balti regiooni keelte osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC09", "name": {"en": "Department of Languages of the Baltic Region", "et": "balti regiooni keelte osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "start_level": {"code": "0", "et": "0", "en": "0"}, "end_level": {"code": "A1.2", "et": "A1.2", "en": "A1.2"}}}, "overview": {"description": {"en": "All major spelling and grammar topics are covered, including declension, conjugation, degree changes, sentence structure, etc. Special attention is paid to the differences between Estonian and English. Throughout the course, students engage in reading, conversation, discussion, writing short dialogues and texts, and listening to/watching topic-related materials. The textbook used is \"E nagu Eesti\" by M. Pesti and H. Ahi, covering chapters 1-8. NB! NEW VERSION from 2015!\"", "et": "Käsitletakse kõiki tähtsamaid õigekirja küsimusi ning peamisi grammatika teemasid: käänamist, pööramist, astmevaheldust, lauseehitust jms. Erilist tähelepanu pööratakse eesti ja inglise keele vahelistele erinevustele. Kursuse vältel üliõpilased loevad, vestlevad, arutlevad, kirjutavad lühidialooge ja -tekste ning kuulavad-vaatavad teemakohaseid materjale. \nÕpik: M. Pesti, H. Ahi \"E nagu Eesti\", teemad 1-8. NB! UUS VERSIOON alates 2015!"}, "objectives": [{"en": "The aim of the course is to provide basic knowledge of Estonian grammar and structure, and to systematically develop all four language skills (listening, speaking, reading, writing) through various activities: practicing pronunciation; listening to and reading everyday dialogues, creatively reproducing them; reading and listening to texts, answering questions, and making small summaries; working with vocabulary.", "et": "Kursuse eesmärk on anda algteadmisi eesti keele grammatikast ja struktuurist ning arendada süstemaatiliselt kõiki nelja osaoskust (kuulamine, rääkimine, lugemine, kirjutamine) mitmesuguste tegevuste kaudu: häälduse harjutamine; igapäevateemaliste dialoogide kuulamine, lugemine, loov reprodutseerimine; tekstide lugemine ja kuulamine, küsimustele vastamine ja väikeste kokkuvõtete tegemine; töö sõnavaraga."}, {"en": "As a result of these activities, the student should reach a basic level of language proficiency. The final level in all language skills is A1.2.", "et": "Nende tegevuste tulemusena peaks üliõpilane jõudma esmase keeleoskuse tasemele. Lõpptase kõigis osaoskustes on A1.2."}], "learning_outcomes": [{"en": "A student who has completed the course:", "et": "Kursuse läbinud tudeng"}, {"en": "understands the basics of Estonian grammar and structure;", "et": "- tunneb eesti keele grammatika ja struktuuri põhitõdesid;"}, {"en": "can comprehend simpler Estonian texts and speech;", "et": "- suudab mõista lihtsamaid eestikeelseid tekste ja eestikeelset kõnet;"}, {"en": "is able to use learned grammar and vocabulary in simpler everyday communication situations;", "et": "- oskab kasutada õpitud grammatikat ja sõnavara lihtsamates igapäevastes suhtlussituatsioonides;"}, {"en": "understands frequently used words and phrases related to important information in daily life areas;", "et": "- saab aru sageli kasutatavatest sõnadest ja fraasidest, mis on seotud tema jaoks olulise infoga igapäevaelu valdkondades; "}, {"en": "comprehends short and very simple texts, can find relevant information for themselves;", "et": "- saab aru lühikestest ja väga lihtsatest tekstidest, oskab leida sealt enda jaoks olulist infot;"}, {"en": "understands short and simple personal letters and can write them;", "et": "- saab aru lühikestest lihtsatest isiklikest kirjadest ja oskab neid kirjutada;"}, {"en": "manages everyday typical communication tasks requiring simple information exchange on familiar topics.", "et": "- saab hakkama igapäevaste tüüpiliste suhtlusülesannetega, mis nõuavad lihtsat infovahetust tuttavatel teemadel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}