{"uuid": "9b79fbbe-13c2-dc72-a25a-716b4f728906", "code": "HVLC.01.069", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-12T10:34:13", "title": {"en": "Key Texts in English Studies: Text-Critical Reading", "et": "Anglistika võtmetekstid: tekstikriitiline lugemine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will give a contextualised overview of theoretical texts that have plaid an important role in Anglo-American academic culture. We will read, and analyse different key texts on culture, English language and literature. The texts may include, for example, Ch. Darwin On the Origin of Species; B.L. Whorf's 'The Relation of Habitual Thought and Behaviour to Language' (1956); G. Lakoff 'Metaphors We Live By'; S. Ahmed 'Happy Objects'  etc. Each seminar will be concerned with one text on a specific cultural/theoretical subject. The texts are chosen in cooperation with students based on their interests and research field chosen by them. The texts will be analysed keeping in mind both the form and the content as well as broader context such as academic discipline and time of writing.", "et": "Kursus annab kontekstualiseeritud ülevaate inglise keeles kirjutatud ja anglo-ameerika akadeemilises kultuuriruumis tähtsat rolli mängivatest teoreetilistest tekstidest. Tutvutakse, loetakse ja analüüsitakse erinevaid võtmetekste inglise keelest, kultuurist ja kirjanduses (nt. Ch. Darwin \"On the Origin of Species\"; B. L. Whorf'i \"The Relation of Habitual Thought and Behaviour to Language\" (1956); G. Lakoff \"Metaphors We Live By\"; S. Ahmed \"Happy Objects\"; jne.) Igaks seminariks valmistatakse ette üks tekst, mis puudutab teatud kultuurilist/teoreetilist teemat. Tekste valitakse ka koos üliõpilastega lähtuvalt nende huvidest ja magistritöö suunast. Tekste analüüsitakse lähtuvalt nii teksti vormilisest kui ka sisulisest küljest, analüüsides võetakse arvesse laiemat konteksti st. konkreetse akadeemilise distsipliini eripärasid ja teksti kirjutamise aega."}, "objectives": [{"en": "The aim of the course is to read and analyse academic texts in different sub-fields of English Studies and essays on literary and cultural theory, their style and argumentative devices as well as means of expression specific to the English-speaking world. Through reading and discussing the views and methods of different theorists are introduced; we will also be discussing the combination and application possibilities of the discussed material on the analysis of various cultural phenomena.", "et": "Kursuse eesmärgiks on lugeda ja analüüsida erinevatel ajaperioodidel inglise keeles kirjutatud erilaadseid teadusartikleid ning kirjandus- ja kultuuriteoreetilisi kirjatöid, nende stiili ja argumentatsioonivõtteid ning ingliskeelsele kultuuriruumile omaseid väljendusviise. Kursuse jooksul mõtestatakse tekstide läbi laiemalt lahti tähtsamad anglo-ameerika akadeemilise kultuuriruumiga seotud kontseptsioone ja teoreetilisi suundumusi. Tekstide lugemise ja sellega kaasneva arutelu kaudu tutvustatakse nii erinevate teoreetikute vaateid, meetodeid ja nende kombineerimis- ja kasutusvõimalusi kultuurifenomenide analüüsimisel kui ka vahendeid edukaks tekstiloomeks."}], "learning_outcomes": [{"en": "On completing the course, the students will have an overview of and the ability to analyse different theoretical and academic key texts concerned with the English language, literature and culture. The students will be able to pay attention to idiosyncrasies in text formation and argumentation depending on the discipline, cultural context and time of writing. The students will be able to notice, analyse and apply the formal elements and style supporting the content of the text; through reading and discussions the students will develop the skills of critical reading and thinking, seminar discussions will develop their skills of oral expression. The students will be able to see the role of a single theoretical text in a more general cultural and academic context.", "et": "Kursuse läbinud üliõpilased omavad ülevaadet ja oskavad analüüsida erialaseid teaduslikke ja teoreetilisi tekste erinevate stiilikriteeriumite alusel (sõltuvalt teksti eesmärgist), tuvastades seejuures distsipliini piirangutest, kultuurikonteksti spetsiifikast või kirjutamise ajast tulenevaid eripärasid teksti koostamise vahendites ja argumentatsioonis. Üliõpilased oskavad tähele panna teksti sisu toetavat vormilist ja stilistilist külge ja arendavad kriitilise lugemise ja mõtlemise oskusi; seminaridiskussioonides ka suulise eneseväljenduse oskusi. Kursuse läbinud üliõpilased oskavad vaadelda üksiku teoreetilise teksti rolli laiemas kultuurilises kontekstis ning selle abil lahti mõtestada ühiskondlike protsesse."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}