{"uuid": "7d7c06d2-31d0-3cd6-52f4-f4f57487534e", "code": "HVLC.05.060", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Text Editing", "et": "Tekstide toimetamise praktikum"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC05", "structural_unit_name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Theoretical and practical problems of language use and stylistics are discussed, the skills to adequately and correctly express ideas in Russian oral and written speech are developed. During the course language editing is practised as well.\nThe basic topics of the course:\n1. Linguistic realization of the basic communicative qualities of the text.\n2. The basic norms of different levels of Russian and variants of norms.\n3. Lexical, grammatical and stylistic compatibility.\n4. Frequency mistakes in oral and written speech and ways of their correction.\n5. The principles of editing.", "et": "Tegeletakse keelekasutuse ja stilistika teoreetiliste ja praktiliste probleemidega, arendatakse adekvaatse ja õige suulise ja kirjaliku väljenduse oskust vene keeles. Harjutatakse keelelist redigeerimist.\nÕppeaine põhiteemad:\n1. Teksti peamiste kommunikatiivsete omaduste keeleline realiseerimine.\n2. Vene keele erinevate tasandite peamised normid ja nende variandid.\n3. Sõnade vaheline leksikaalne, grammatiline ja stilistiline ühilduvus.\n4. Sageduslikud keelevead suulistes ja kirjalikes tekstides ja vigade paranduse meetmed.\n5. Toimetamise põhimõtteid."}, "objectives": [{"en": "The purpose of the course is to develop the practical language skills of students, to train them to use various language units correctly, to give the participants an overview of", "et": "Kursuse eesmärgiks on arendada üliõpilaste praktilist keeleoskust, õpetada neid õigesti ja kohaselt kasutama erinevaid keeleühikuid, andes osavõtjatele ülevaate:"}, {"en": "1) the basic communicative qualities of good texts (correctness, relevance, accuracy, logicality, diversity of language, etc.) and the linguistic means of their realization;", "et": "1) korraliku teksti peamistest kommunikatiivsetest omadustest (õigekeelsus, kohasus, täpsus, loogilisus, keelerikkus jt) ja nende realiseerimise keelelistest vahenditest;"}, {"en": "2) features of the use of language in various functional styles and genres, in oral and written texts, in various situations,", "et": "2) keelekasutuse eripärast erinevates funktsionaalstiilides ja žanrides, suulistes ja kirjalikes tekstides, erinevates situatsioonides,"}, {"en": "3) about the basic norms at different levels of language and variants of norms.", "et": "3) keele erinevate tasandite raskematest normidest ja nende variantidest."}], "learning_outcomes": [{"en": "After completing the course the student", "et": "Õppeaine läbinud üliõpilane"}, {"en": "1) knows communicative requirements and language norms;", "et": "1) tunneb kõne kommunikatiivseid nõudeid ja keelenorme;"}, {"en": "2) is able to choose the appropriate forms and expressions corresponding to the functional style and genre;", "et": "2) oskab valida vastavalt funktsionaalstiilile ja žanrile sobivaid keeleväljendeid ja õigeid keelevorme;"}, {"en": "3) is able to compose a text that adheres to all language norms and communicative requirements; can assess the relevance of the text when giving feedback;;", "et": "3) oskab koostada kõikidele keelenormidele ja kommunikatiivsetele nõuetele vastavat teksti; oskab hinnata teksti vastavust nõuetele ning tagasisidet anda;"}, {"en": "4) knows main principles of editing and if necessary is able to correct the text;", "et": "4) tunneb toimetamise põhimõtteid ja oskab teksti vajadusel parandada;"}, {"en": "5) knows and is able to use the basic sources on a standard of speech.", "et": "5) tunneb ja oskab kasutada tähtsamaid keelehooldeallikaid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}