{"uuid": "02625e0a-eccd-a162-93ea-a2c28e0bf03b", "code": "HVLC.06.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sociolinguistics and Language Variation in the Nordic Countries", "et": "Sotsiolingvistika ja keele varieerumine Põhjamaades"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC06", "structural_unit_name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC06", "name": {"en": "Department of Scandinavian Studies", "et": "skandinavistika osakond"}, "address": "Lossi 3, ruumid 209-212\nEST", "street": "Lossi 3, ruumid 209-212", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course helps to better understand the relationship and developments between language and society in the Nordic countries as well as the place of different Scandinavian languages in the globalized world. Additionally, it develops the capacity to carry out independent research.", "et": "Aine aitab paremini mõista, millised on keele ja ühiskonna omavahelised seosed ja arengud Põhjamaades ning Skandinaavia keelte olukord gobaliseerunud maailmas. Aines osalemine arendab uurimis- ja analüüsioskusi."}, "objectives": [{"en": "The aim of the course is to provide an overview of the main research areas and methods of sociolinguistics focusing on language variation and change in the Nordic countries. The topics under discussion include sociolinguistic and regional variation of Scandinavian languages, the interrelationship between different Scandinavian languages, and language politics in different Nordic countries.", "et": "Kursuse eesmärgiks on anda ülevaade sotsiolingvistika peamistest uurimissuundadest ja meetoditest, keskendudes keele varieerumisele Põhjamaades. Lähemalt vaadeldakse Skandinaavia keelte sotsiolingvistilist ja piirkondlikku varieerumist, Skandinaavia keelte omavahelisi suhteid, ning keelepoliitikat erinevates Põhjamaades."}], "learning_outcomes": [{"en": "After participating in the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- has an understanding of the main research areas and methodological framework of sociolinguistics ", "et": "- tunneb sotsiolingvistika peamiseid uurimisvaldkondi ja metoodilist raamistikku;"}, {"en": "- understands the essence and importance of language variation and change in the Nordic countries and the interrelationship between different Scandinavian languages", "et": "- mõistab keele varieerumise ja muutumise olemust ja tähtsust Põhjamaades ja Skandinaavia keelte omavahelisi suhteid"}, {"en": "- is able to apply sociolinguistic methods in an independent mini-research paper.", "et": "- on võimeline iseseisvas mini-uurimuses rakendama sotsiolingvistika meetodit."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}