{"uuid": "5040151c-ec75-507b-2fc1-4d4e11071418", "code": "HVLC.03.029", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Spanish for Pre-intermediate Learners I, Level A2.1 > A2.2", "et": "Hispaania keele eelkesktasemele I, tase A2.1 > A2.2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "language_training": {"language": {"code": "es", "et": "hispaania keel", "en": "Spanish"}, "start_level": {"code": "A2.1", "et": "A2.1", "en": "A2.1"}, "end_level": {"code": "A2.2", "et": "A2.2", "en": "A2.2"}}}, "overview": {"description": {"en": "The topics covered during the course: introducing yourself and the others; countries, nations, languages; numbers; ordinal numbers; address; asking and giving phone numbers; home; family; food and drink; everyday activities.\nThe course focuses on the following grammatical areas:\nRegular and irregular verbs; conjugation of reflexive verbs; possessive pronouns;  verb gustar ; prepositions of place; prepositions of time; imperative; use of hay  and está; use of  ser and estar.", "et": "Teemad: tervitamine; enese ja teiste tutvustamine; maad; rahvad; keeled; arvud; järgarvud; telefoninumbrite küsimine ja ütlemine; ametid; perekond; kellaaeg; igapäevategevustest rääkimine; huvidest rääkimine; kohvikus/restoranis käimine;  kodu kirjeldamine; teenete palumine; linna kirjeldamine.\nGrammatika: reeglipäraste ja ebareeglipäraste verbide pööramine olevikus; refleksiivsete verbide pööramine; omastav asesõna; verb gustar, eessõnad, käskiv kõneviis; tegusõnade hay ja está kasutamine; tegusõnade ser ja estar kasutamine."}, "objectives": [{"en": "The course aims at systematic development of all four language skills (reading, writing, listening, speaking) through a wide variety of tasks:", "et": "Kursuse põhieesmärgiks on nelja osaoskuse (lugemine, kirjutamine, kuulamine, rääkimine) süstemaatiline arendamine mitmesuguste tegevuste kaudu:"}, {"en": "1) reading and listening to texts;", "et": "1) tekstide lugemine ja kuulamine;"}, {"en": "2) doing lexical exercises;", "et": "2) töö sõnavaraga;"}, {"en": "3) practicing grammar;", "et": "3) grammatika õppimine;"}, {"en": "4) doing pronunciation exercises", "et": "4) häälduse harjutamine."}], "learning_outcomes": [{"en": "On completion of the course the learners will be able to read and understand simple texts (both oral and written) in Spanish and use everyday vocabulary and grammar covered during the course. The learners will be able to talk and write about her/himself, her/his family, favourite activities and can cope with ordering a meal at a café/restaurant. The learners will be able  to understand and to compile simple oral and written texts.", "et": "Kursuse läbinud tudeng suudab mõista lihtsamaid hispaaniakeelseid tekste, oskab kasutada õpitud sõnavara ja grammatikat igapäevastes situatsioonides. Ta oskab olevikus rääkida ja kirjutada endast, oma  perekonnast, kodukülast/linnast, oma meelistegevustest ning saab hakkama kohvikus/restoranis käimisega. Ta suudab mõista ning luua lihtsaid suulisi ja kirjalikke tekste."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}