{"uuid": "208f9ad1-41e4-f433-b411-9403bee16fbe", "code": "HVLC.02.008", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-24T12:16:03", "title": {"en": "Bachelor's Seminar and Thesis", "et": "Bakalaureuseseminar ja -töö"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC02", "structural_unit_name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Bachelor's seminar ends with two exams: translating and analyzing two unfamiliar text passages from Latin and ancient Greek (with the help of a dictionary), and Ba thesis, which is defended in front of the examination board. Thus, during the seminar preparatory exercises for the translation exam are made and material from previous courses revised. The seminars also prepare students for writing the BA thesis by giving an overview of the formal requirements of the BA thesis,  means of writing the thesis, finding the necessary and suitable information, critical analysis of the sources, how to insert references and citations etc.", "et": "Bakalaureuseseminar lõppeb kaheosalise eksamiga: kirjalik eksam (tõlge) ja bakalaureusetöö, mida kaitstakse suuliselt eksaminõukogu ees. Kirjalik eksam koosneb kahe tundmatu tekstikatkendi (ladina ja vanakreeka keelest) kirjalikust tõlkest ja grammatilisest analüüsist, sõnaraamatu abil (kuid ilma grammatikata).  \nKursuse vältel tehakse seminarides ettevalmistusi eksamiks, samuti valmistutakse bakalaureusetöö kirjutamiseks. Tutvustatakse vajalikke tekstivormistamise ja bakalaureusetöö nõudeid, vajadusel vormistamise vahendeid. Vaadatakse, kuidas töö sisuliselt üles ehitada, vormistada korrektsed viited. Antakse juhiseid info otsimiseks ja allikate kriitiliseks hindamiseks."}, "objectives": [{"en": "The bachelor seminar prepares students for independent reserach. They study and learn to read topic-related special literature critically and learn to apply different research methods. They learn to devise a plan and time scedule for the BA thesis and to follow it. ", "et": "Seminar valmistab üliõpilasi ette iseseisvaks uurimistööks. Õpitakse tundma ja kriitiliselt lugema teemaga seonduvat erialakirjandust ning kasutatavat uurimimeetodit. Õpitakse tundma uurimistöö ülesehituse ja vormistuse peensusi. Õpitakse koostama uurimistöö plaani ja ajakava ja seda järgima."}, {"en": "Part of the seminar prepares students for translating an unfamiliar passage from Latin and ancient Greek, revising the material already learnt in previous courses.", "et": "Üks osa seminarist keskendub ka võõra ladina- ja vanakreekakeelse teksti tõlkimiseks ettevalmistamisele ja selleks vajaliku juba õpitud materjali ülekordamisele."}, {"en": "The main focus is on assisting students in their research and preparation for the written exam (translation) as well as to give them regular feedback on their work in progress.", "et": "Põhieesmärk on toetada üliõpilasi bakalaureusetöö kirjutamisel (ja tõlke-eksamiks valmistumisel) ning anda  nende tööle regulaarset tagasisidet."}], "learning_outcomes": [{"en": "Students who have completed the Bachelor seminar:", "et": "Bakalaureuseseminari läbinud üliõpilane:"}, {"en": "1)\tunderstands and translates a basic-level text from ancient Greek and Latin language with the help of a dictionary, uses suitable transating strategies;", "et": "1) mõistab ja tõlgib iseseisvalt kergemat vanakreeka ja ladinakeelset teksti sõnaraamatu abiga, valib tõlkimiseks sobiva taktika; "}, {"en": "2) analyzes the morphologica, syntactical and lexical structure of the text, explains the references to realia and most important names; ", "et": "2) analüüsib teksti morfoloogilist, süntaktilist ja leksikaalset struktuuri, selgitab tekstis leiduvaid viiteid antiiksetele reaalidele, olulisematele isiku- ja kohanimedele;"}, {"en": "3) is able to find and critically assess the literature and sources (on paper and in digital form) for the research paper;", "et": "3) suudab iseseisvalt leida ja hindab kriitiliselt uurimistööks vajalikke erialaseid allikmaterjale (nii paberkandjal kui elektroonilisi ressursse kasutades);"}, {"en": "4) proposes a hypothesis, solves the research question using appropriate research methods, explains the results of his/her research;", "et": "4) püstitab uurimisküsimuse, lahendab uurimisprobleemi rakendades selleks sobivat uurimismeetodit, põhjendab  uurimistöös saavutatud tulemusi;"}, {"en": "5) plans the time for writing the research paper, reflects on the working process, cooperates with the supervisor(s) and fellow students;", "et": "5) planeerib uurimistöö kirjutamisel oma aega, reflekteerib oma tööprotsessi üle, teeb koostööd juhendajaga ja kaasüliõpilastega; "}, {"en": "6) presents the results of the research paper in an open-defence, discusses the problems in the research process, explains the choises made during the research;", "et": "6) esitleb oma töö tulemusi avalikul kaitsmisel, arutleb tööprotsessis esinenud probleemide üle, põhjendab uurimistöö käigus tehtud valikuid;"}, {"en": "7) writes the research paper in correct language, uses appropriate tools and formats (either on paper or digitally) of writing and presenting the research.", "et": "7) kirjutab korrektses keelepruugis uurimistöö, kasutab uurimistöö kirjutamiseks, vormistamiseks, esitamiseks ja kaitsmisel sobilikke digitaalseid abivahendeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}