{"uuid": "46081ada-5ecd-ac95-bde7-5e0977e02d99", "code": "hv-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-03T11:49:40", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 15, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC07", "name": {"en": "Department of Translation and Interpretation Studies", "et": "tõlkeõpetuse ja -uuringute osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC07", "structural_unit_name": {"en": "Department of Translation and Interpretation Studies", "et": "tõlkeõpetuse ja -uuringute osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 380, "individual_work": 10, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}, {"code": "fr", "et": "prantsuse keel", "en": "French"}, {"code": "ru", "et": "vene keel", "en": "Russian"}, {"code": "de", "et": "saksa keel", "en": "German"}], "description": {"en": "Master's thesis is an independent research paper with a theoretical or practical approach from the areas of translation theory, terminology, work organisation of translators/interpreters, translator/interpreter training, or any other problem related to translation.", "et": "Magistritöö on iseseisev uurimuslik või rakenduslik töö tõlketeoreetiliste probleemide, terminoloogia, tõlgi/tõlkija töökorralduse, tõlkide/tõlkijate väljaõppe või mõne muu tõlkealase küsimuse valdkonnast."}, "objectives": [{"en": "Master's thesis directs students to the study of a research problem in their discipline and assesses their ability to find adequate solutions to it. In the thesis students demonstrate their ability to use the knowledge acquired in the Master's program creatively in solving practical and theoretical problems in their discipline. By writing the Master's thesis students demonstrate their ability ot work independently with specialist literature and to present the results of their research in the form of an appropriately formatted academic text.", "et": "Magistritöö eesmärk on anda üliõpilasele teadusliku uurimistöö kogemus. Magistritöös näitab üliõpilane oma võimeid loovalt kasutada magistriõppes omandatud teadmisi praktiliste või teoreetiliste probleemide lahendamiseks. Magistritöö kirjutamisel demonstreerib üliõpilane erialase kirjanduse kasutamise ja iseseisva uurimistöö oskust ning tulemuste esitamist korrektses akadeemilises keeles vormistatud erialase tekstina."}], "learning_outcomes": [{"en": "Students who have completed their Master's theses", "et": "Magistritöö kirjutanud üliõpilane"}, {"en": "1) are capable of raise a research problem in speciality and solve it in the course of independent work;", "et": "1) püstitab erialase uurimisküsimuse ja lahendab selle iseseisva töö käigus;"}, {"en": "2) have necessary theoretical and methodological knowledge for solving the research questions raised;", "et": "2) sünteesib teoreetilisi ja metodoloogilisi teadmisi uurimisküsimuse lahendamiseks;"}, {"en": "3) can use knowledge acquired to study theoretical and practical problems in their independent research; ", "et": "3) valib sobiva andmekogumis- ja andmeanalüüsimeetodi, töötleb ja analüüsib uurimisandmeid ning tõlgendab saadud tulemusi;"}, {"en": "4) can write clearly structured fluent academic texts on topics related to their specialty;", "et": "4) kirjutab selgelt struktureeritud sidusat teksti erialastel teemadel;"}, {"en": "5) are capable of defending their viewpoints presented in the Master's thesis in the course of an academic discussion.", "et": "5) kaitseb akadeemilises diskussioonis magistritöös esitatud seisukohti."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Hinnatakse järgmiste kriteeriumide alusel:\n1) Eesmärk ja probleemipüstitus: selgus, seostatus, põhjendatus ja loogilisus.\n2) Materjal ja selle usaldusväärsus: materjali piisavus ja sobivus töö eesmärkide täitmiseks.\n3) Teooria, meetod ja analüüs: terminite selgitamine ja kasutamine analüüsis, meetodi esitamine ja rakendamine, teooria ja analüüsi seotus.\n4) Tulemused ja järeldused: tulemuste esitamine, järelduste põhinemine analüüsil, nende selgus ja adekvaatsus.\n5) Vormistus ja keeleline korrektsus: pealkirjade vastavus sisule, struktuuri selgus, akadeemiline keelekasutus, vormistusnõuete järgimine, stiili ühtsus, keeleline korrektsus. \n6) Töö kaitsmine akadeemilises diskussioonis: töö eesmärkide ja uurimistulemuste esitlemine, retsensendi ja komisjoni küsimustele vastamine."}}], "grade_preconditions": {"et": "õppekava täitmine"}, "grade_evaluation": {"et": "Oponendi hinnangu ja töö kaitsmise alusel."}, "grade_conditions": {"A": {"et": "1. Eesmärk ja probleemipüstitus on selge, seostatud, põhjendatud ja loogiline.\n2.\tTeoreetiline ja/või empiiriline materjal on piisav, usaldusväärne ja sobiv töö eesmärkide täitmiseks.\n3. Teooriaosas esitatud termineid ja mõisteid on selgitatud ja analüüsis kasutatud. Meetod on selgelt esitatud, seda on põhjendatud ja töös rakendatud. Teooriaosa ja analüüs on omavahel hästi seotud. Analüüs lähtub töö eesmärkidest ja probleemipüstitusest, on sidus ja loogiline. Illustreerivad näited on põhjendatud.\n4. Töö tulemused on esitatud selgelt. Järeldused põhinevad materjali analüüsil, on konkreetsed ja adekvaatsed ning seostuvad tugevalt uurimistöö eesmärkidega. \n5. Kõik pealkirjad vastavad sisule. Struktuur on loogiline ja põhjendatud. Järgitud on akadeemilise keelekasutuse tavasid. Töö vastab vormistus-nõuetele. Viitamine on korrektne. Stiil on ühtne. Näited on muust tekstist eristatud. Kasutatud kirjanduse loend on korrektne. Kasutatud lühendid on selgitatud. Tekst on keeleliselt korrektne.\n6. Üliõpilane esitab töö eesmärgid ja uurimistulemused selgelt ja loogiliselt, põhjendab veenvalt tehtud valikuid, vastab retsensendi ja komisjoni küsimustele põhjalikult ning demonstreerib uurimisteema valdamist."}, "B": {"et": "1. Eesmärk ja probleemipüstitus on selge, põhjendatud ja loogiline.\n2. Teoreetiline ja/või empiiriline materjal on piisav, usaldusväärne ja sobiv töö peamiste eesmärkide täitmiseks.\n3. Teooriaosas esitatud termineid ja mõisteid on selgitatud ja analüüsis kasutatud. Esitatud meetodit on töös rakendatud. Teooriaosa ja analüüs on omavahel seotud. Analüüs lähtub töö eesmärkidest ja probleemipüstitu¬sest, on sidus ja loogiline. Illustreerivad näited on põhjendatud.\n4. Töö tulemused on esitatud selgelt. Järeldused põhinevad materjali analüüsil, on konkreetsed ja adekvaatsed ning seostuvad uurimistöö eesmärkidega.\n5. Samad nõuded nagu “A” puhul, kuid esineb üksikuid väheolulisi vajakajäämisi.\n6. Üliõpilane esitab töö eesmärgid ja uurimistulemused selgelt ja loogiliselt, põhjendab veenvalt tehtud valikuid, vastab ammendavalt retsensendi ja komisjoni küsimustele ning demonstreerib oma orienteerumist uurimisteemas."}, "C": {"et": "1. Eesmärk ja probleemipüstitus on selge, kuid kohati pinnapealne.\n2. Teoreetiline ja/või empiiriline materjal on usaldusväärne, sobiv ja üldjoontes piisav töö peamiste eesmärkide täitmiseks.\n3. Teooriaosas esitatud mõisteid on selgitatud ja analüüsis osaliselt kasutatud. Esitatud meetodit on töös rakendatud. Teooriaosa ja analüüs on omavahel seotud. Analüüs lähtub töö eesmärkidest ja probleemipüstitu¬sest. Tööd illustreerivad näited.\n4. Töö tulemused on esitatud selgelt. Järeldused põhinevad materjali analüüsil, on adekvaatsed ja seostuvad uurimistöö eesmärkidega, kuid nende esitamises esineb väiksemaid probleeme, nt teatud laialivalguvus või pinnapealsus käsitlemisel.\n5. Samad nõuded nagu “A” puhul, kuid vormistuses ja keelelises korrektsuses esineb vigu.\n6. Üliõpilane esitab töö eesmärgid ja uurimistulemused, põhjendab tehtud valikuid, vastab enamikule retsensendi ja komisjoni küsimustele."}, "D": {"et": "1. Eesmärk ja probleemipüstitus on üldsõnaline ja pinnapealne.\n2. Teoreetilise ja/või empiirilise materjali piisavus ja/või sobivus töö eesmärkide täitmiseks on napp.\n3. Teooriaosas esitatud mõisteid on üldsõnaliselt selgitatud. Esitatud meetodit on töös osaliselt rakendatud. Teooriaosa ja analüüsi seotus on nõrk. Kasutatud on üksikuid näiteid.\n4. Töö tulemused on esitatud. Järeldused põhinevad vaid osaliselt materjali analüüsil ning nende side uurimistöö eesmärkidega pole üheselt selge.\n5. Akadeemilises keelekasutuses ja vormistuses esineb läbivalt vigu. Töö on vähesidus ja stiililt ebaühtlane.\n6. Üliõpilane esitab töö eesmärgid ja uurimistulemused üldsõnaliselt, vastab ammendavalt üksnes lihtsamatele retsensendi ja komisjoni küsimustele."}, "E": {"et": "1. Eesmärk ja probleemipüstitus on ebaselge.\n2. Teoreetiline ja/või empiiriline materjal on ainult osaliselt sobiv töö eesmärkide täitmiseks.\n3. Teooriaosas esitatud mõistete selgitus on pinnapealne. Meetodi kirjeldus ja rakendamine on ebaselge. Teooriaosa ja analüüsi seotus on kasin.\n4. Järelduste ja töö tulemuste seos kasin, seos uurimistöö eesmärkidega on nõrk, järeldused on lihtsustatud või ebapiisavad.\n5. Akadeemilises keelekasutuses ja vormistuses esineb läbivalt vigu. Töö on vähesidus,  stiililt ebaühtlane ja keeleliselt nõrk.\n6. Üliõpilane esitab töö eesmärgid ja uurimistulemused üldsõnaliselt ja laialivalguvalt. Ei suuda vastata paljudele retsensendi ja komisjoni küsimustele."}, "F": {"et": "Töö hinnatakse F-iga, kui see ei täida hinde \"E\" nõudeid. "}}, "debt_elimination": {"et": "Vastavalt õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "materials": [{"name": {"et": "Lõputööde valdkondlik kord https://humanitaarteadused.ut.ee/sites/default/files/2024-09/L%C3%B5put%C3%B6%C3%B6de%20n%C3%B5uded%20ja%20kaitsmiskord%20humanitaarteaduste%20valdkonnas_1.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Tõlkeõpetuse eriala lõputöö juhend https://maailmakeeled.ut.ee/sites/default/files/2024-11/T%C3%B5lke%C3%B5petuse%20eriala%20l%C3%B5put%C3%B6%C3%B6de%20juhend_2024.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Tõlkeõpetuse eriala vormistusjuhend https://maailmakeeled.ut.ee/sites/default/files/2024-11/L%C3%B5put%C3%B6%C3%B6de%20vormistusjuhend_2024.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}]}, "participants": {"lecturers": [{"person_uuid": "f4043902-2768-82ed-e403-1fbf7f13d58a", "person_name": "Terje Loogus", "structural_unit": {"code": "HVLC07", "name": {"en": "Department of Translation and Interpretation Studies", "et": "tõlkeõpetuse ja -uuringute osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "903d8759-0617-5e87-c334-86441d49039b", "person_name": "Marri Amon", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "ee81509a-8ad0-728b-51df-707d345e2331", "person_name": "Sirje Kupp-Sazonov", "structural_unit": {"code": "HVLC07", "name": {"en": "Department of Translation and Interpretation Studies", "et": "tõlkeõpetuse ja -uuringute osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "b99a0799-b099-7409-9dff-56ad5eec25a4", "person_name": "Marika Borovikova", "structural_unit": {"code": "HVLC07", "name": {"en": "Department of Translation and Interpretation Studies", "et": "tõlkeõpetuse ja -uuringute osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 1, "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {}, "description": {"et": "Töö esitamine Moodle'is. Töö tuleb esitada hiljemalt 13. mail 2025 kella 10ks. \nTöö PDF-fail ja pealkirjad originaal-, eesti ja inglise keeles saata milvi.kaber@ut.ee."}}, {"course_week": 1, "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {}, "description": {"et": "Kaitsmine toimub 3. juunil 2025."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "c1f7e202-f345-0a9f-8782-104612fa6ae7", "parent_code": "HVLC.07.014", "parent_credits": 15, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}