{"uuid": "9f0b0227-8386-8ffa-e023-a9aa436f735f", "code": "HVLC.02.011", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Apprenticeship in the Library", "et": "Raamatukogupraktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC02", "structural_unit_name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Apprenticeship is completed at Tartu University Library, at first learning about the work processes in the Library as a whole, thereafter focusing on the work in the departments of rare books and manuscripts and conservation and restauration. The apprenticeship includes acquiring and applying elementary skills of handling, preservation, description, conservation and restauration of rare and old books and archivalia. The exact work-load, schedules and duties will be specified in the beginning of the apprenticeship.", "et": "Praktika sooritatakse Tartu Ülikooli raamatukogus, selle käigus tutvutakse esmalt raamatukogu kõigi osakondade tööga, keskendudes seejärel tööle vanaraamatu- ja arhivaalidega; tööpraktika hõlmab vanaraamatu ja arhivaalide käitlemise, hoiu ja kirjeldamise elementaarsete oskuste omandamist ja rakendamist, samuti omandatakse elementaarsed konserveerimise ja parandamise oskused. Koormuse, tegevuste ja ajakava osas lepitakse täpsemalt kokku parktika alguses."}, "objectives": [{"en": "The apprenticeship in the library gives general understanding about the work processes in the library as a whole, focusing on the work with Rare and Old books, manuscripts and archivals. The goal is to give students an opportunity to use the foreign language skills and knowledge about history and culture in library work and thereby develop and deepen knowledge and skills necessary in their future professional careers and to create links between acquired knowledge and possibilities of applying it.", "et": "Raamatukogupraktika käigus omandatakse ettekujutus raamatukogu tööprotsessidest tervikuna, keskendudes tööle haruldaste ja vanade raamatute, käsikirjade ning arhivaalidega. Eesmärgiks on pakkuda võimalust kasutada oma keeleoskust või teadmisi aja- ja kultuuriloost raamatukogutöös, seeläbi kujundada ja kinnistada tööelus vajalikke teadmisi ja pädevusi ning luua seoseid omandatud teadmiste ja nende rakendusvõimaluste vahel."}], "learning_outcomes": [{"en": "Students who have completed their apprenticeship:\napply the knowledge from their speciality in work situations, considering the context of the library work; \nthey have acquired new knowledge about the databases, catalogues and special literature of their speciality and about handling rare books and archivals; \napply acquired knowledge and skills in completing  different work tasks; \nanalyze their activities in solving practical work-related questions in their speciality; \nhave the experience of completing specific work tasks, reflect on their working processes and plan and can evaluate the results of their work constructively.", "et": "Praktika sooritanud üliõpilane:\nrakendab erialateadmisi töösituatsioonis, arvestades raamatukogutöö eripära; \non omandanud uusi teadmisi oma erialal vajalikest andmebaasidest ja kataloogidest ning raamatute ja arhivaalide käitlemisest, mis põhinevad läbitud praktikal, ning oskab neid rakendada; \nanalüüsib oma tegevust eriala praktiliste tööalaste probleemide lahendamisel; \nomab konkreetsete tööülesannete ja tegevusplaani täitmise kogemust, reflekteerib oma tööprotsesside üle ning oskab oma tegevuse käigus saavutatut konstruktiivselt hinnata."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}