{"uuid": "10f5689f-d293-222f-5cb2-74cafb4e0d31", "code": "HVLC.09.053", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-19T15:01:13", "title": {"en": "Estonian for Advanced Learners I, Level B2.1 - B2.2 (Web-based)", "et": "Eesti keel kõrgtasemele I, B2.1 - B2.2 (veebiõpe)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC09", "structural_unit_name": {"en": "Department of Languages of the Baltic Region", "et": "balti regiooni keelte osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC09", "name": {"en": "Department of Languages of the Baltic Region", "et": "balti regiooni keelte osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "start_level": {"code": "B2.1", "et": "B2.1", "en": "B2.1"}, "end_level": {"code": "B2.2", "et": "B2.2", "en": "B2.2"}, "is_in_depth_estonian_training": true}}, "overview": {"description": {"en": "The course in Estonian is the first stage in the preparation for taking the National Advanced Estonian Language Test (C1). During the course the students will develop their conversation and reasoning skills, extend their  vocabulary, practice choosing a proper register of speech, study the structure of the written test and practice writing tasks (paying attention to the spelling), listen to different text types and do multiple choice listening tasks, develop general reading skills and reading for a purpose.\nStudy book:   \nM. Kitsnik, L. Kingisepp \"Avatud uksed\" study book and workbook\nTopics: \n1. Studying foreign languages. Grammar: suffixes of stress -ki, -gi, kord-compound words \n2. Destinies, biographies and about-turns. Grammar: past simple, present perfect, subjunctive mood.\n3. Body language and appearance. Grammar: plural cases, past participle.\n4. Jobs and professions. Grammar: Passive Voice, linking verbs with the particle ära.", "et": "Eesti keele kursus on esimeseks etapiks riigikeele eksami ettevalmistusele C1 tasemel. Kursusel arendatakse vestlus-ja argumenteerimisoskust, rikastatakse sõnavara, harjutatakse sobivat kõneregistrit; tutvutakse kirjutamistesti struktuuriga ning harjutakse kirjutusülesandeid, arendatakse õigekirja; kuulatakse erineva sisu ja funktsiooniga tekste, täidetakse valikvastustega kuulamisülesandeid; arendatakse üldist lugemisoskust ja eesmärgipärast lugemist. \nÕpik:\nM. Kitsnik, L. Kingisepp \"Avatud uksed\" õpik ja töövihik\nTeemad: \n1) Võõrkeelte õppimine. Grammatika: rõhuliited -ki, -gi, kord-liitsõnad \n2) Saatused, elulood ja kannapöörded. Grammatika: liht- ja täisminevik, tingiv kõneviis.\n3) Kehakeel ja välimus. Grammatika: mitmuse käänded, tud-kesksõna.\n4) Ametid ja töökohad. Grammatika: umbisikuline tegumood, ühendtegusõnad abisõnaga ära."}, "objectives": [{"en": "The aim of the course is to prepare the students for the National Advanced Estonian Language Test (C1). Students will extend their vocabulary, develop their reasoning skills, writing skills and comprehension of written and spoken texts.", "et": "Üliõpilaste ettevalmistus eesti keele C1 taseme eksami sooritamiseks.\nSõnavara laiendamine, argumenteerimis-, kirjutamisoskuse, loetu ja kuuldu mõistmise arendamine."}], "learning_outcomes": [{"en": "A student who has passed the course will have been prepared for taking the National Advanced Estonian Language Test (C1) by practicing all four language skills.", "et": "Kursuse läbinud üliõpilane on saanud esimese etapi ettevalmistuse eesti keele C1 taseme eksami sooritamiseks kõigi osaoskuste lõikes."}, {"en": "Speaking: He/she can communicate spontaneously by using grammatically correct language and proper register (might still use the avoidance strategy); understand oral speech in detail; express emotions and point out most important aspects; clearly express his/her ideas and opinions and present complicated arguments for and against a given statement.", "et": "* Rääkimine: oskab suhelda spontaanselt, kasutades grammatiliselt õiget keelt ning sobivat kõneregistrit (võib siiski esineda vältimisstrateegia kasutust); suudab detailselt öeldut mõista; oskab edasi anda emotsioone ja rõhutada olulisemat; oskab üsna täpselt väljendada oma arvamust ja mõtteid; oskab esitada keerukamaid poolt- ja vastuargumente"}, {"en": "Writing: He/she can express his/her ideas and viewpoints in writing; write long personal letters and relate them to received information, write formal letters (CV, application, summary etc.), is good at grammar and is able to write correctly and understandably.", "et": "* Kirjutamine: oskab kirjalikult väljendada arutlustes oma seisukohti ja mõtteid; oskab kirjutada pikemaid ja sisukamaid isiklikke kirju ning seostada neid teiste edastatud infoga; oskab kirjutada ametikirju (CV, avaldus, kokkuvõte jms); valdab üsna hästi grammatikat ning oskab ortograafilises mõttes selgelt ja arusaadavalt kirjutada"}, {"en": "Listening: He/she undestands oral texts on topics that are related to social life, academic world or work; understands the content of linguistically complicated lectures, presentations ets and professional discussions; is able to follow the conversation of native speakers; understands recordings and media files about professional work or studies.", "et": "* Kuulamine: mõistab kuuldut ja öeldut teemadel, mis tulevad tavaliselt ettesotsiaalse, akadeemilises või tööalases valdkonnas; oskab aru saada ka lingvistiliselt keerukamate loengute, ettekannete jms. põhisisu ning erialaseid diskussioone; suudab vaevata jälgida emakeelekõnelejate vestlust; saab aru eriala- ja õppetööga seotud lindistustest ja meediasalvestustest"}, {"en": "Reading: He/she can independently find specific information in the text by using ancillary materials, understand the content of news, articles and reports; understand text that are not related to his/her profession by using special dictionaries; can get primary as well as secondary information out of the texts read.", "et": "* Lugemine: suudab lugeda iseseisvalt vastavalt tekstile ja eesmärgile, kasutades abimaterjale; oskab kiiresti tabada uudiste, artiklite, aruannete sisu; oskab mõista ka oma erialaga mitteseotud tekste, kasutades terminoloogiasõnastikke; oskab ammutada loetust nii olulist kui ka teisejärgulist infot."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}