{"uuid": "6c560d01-c871-8749-0b46-7c729c015518", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T09:27:23", "title": {"en": "Bachelor's Seminar and Thesis", "et": "Bakalaureuseseminar ja -töö"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular part 2 3 CP HV", "et": "24/25 K PÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC02", "structural_unit_name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The bachelor's seminar ends with two exams: translating and analyzing two unfamiliar text passages from Latin and ancient Greek (with the help of a dictionary) and the BA thesis, which is defended in front of the examination board. Thus, during the seminar, preparatory exercises for the translation exam are made, and material from previous courses is revised. The seminars also prepare students for writing the BA thesis by giving an overview of the formal requirements of the BA thesis,  means of writing the thesis, finding the necessary and suitable information, critical analysis of the sources, how to insert references and citations, etc.", "et": "Bakalaureuseseminar lõppeb kaheosalise eksamiga: kirjalik eksam (tõlge) ja bakalaureusetöö, mida kaitstakse suuliselt eksaminõukogu ees. Kirjalik eksam koosneb kahe tundmatu tekstikatkendi (ladina ja vanakreeka keelest) kirjalikust tõlkest ja grammatilisest analüüsist, sõnaraamatu abil (kuid ilma grammatikata).  \nKursuse vältel tehakse seminarides ettevalmistusi eksamiks, samuti valmistutakse bakalaureusetöö kirjutamiseks. Tutvustatakse vajalikke tekstivormistamise ja bakalaureusetöö nõudeid, vajadusel vormistamise vahendeid. Vaadatakse, kuidas töö sisuliselt üles ehitada, vormistada korrektsed viited. Antakse juhiseid info otsimiseks ja allikate kriitiliseks hindamiseks."}, "objectives": [{"en": "The bachelor seminar prepares students for independent reserach. They study and learn to read topic-related special literature critically and learn to apply different research methods. They learn to devise a plan and time scedule for the BA thesis and to follow it. ", "et": "Seminar valmistab üliõpilasi ette iseseisvaks uurimistööks. Õpitakse tundma ja kriitiliselt lugema teemaga seonduvat erialakirjandust ning kasutatavat uurimimeetodit. Õpitakse tundma uurimistöö ülesehituse ja vormistuse peensusi. Õpitakse koostama uurimistöö plaani ja ajakava ja seda järgima."}, {"en": "Part of the seminar prepares students for translating an unfamiliar passage from Latin and ancient Greek, revising the material already learnt in previous courses.", "et": "Üks osa seminarist keskendub ka võõra ladina- ja vanakreekakeelse teksti tõlkimiseks ettevalmistamisele ja selleks vajaliku juba õpitud materjali ülekordamisele."}, {"en": "The main focus is on assisting students in their research and preparation for the written exam (translation) as well as to give them regular feedback on their work in progress.", "et": "Põhieesmärk on toetada üliõpilasi bakalaureusetöö kirjutamisel (ja tõlke-eksamiks valmistumisel) ning anda  nende tööle regulaarset tagasisidet."}], "learning_outcomes": [{"en": "Students who have completed the Bachelor seminar:", "et": "Bakalaureuseseminari läbinud üliõpilane:"}, {"en": "1)\tunderstands and translates a basic-level text from ancient Greek and Latin language with the help of a dictionary, uses suitable transating strategies;", "et": "1) mõistab ja tõlgib iseseisvalt kergemat vanakreeka ja ladinakeelset teksti sõnaraamatu abiga, valib tõlkimiseks sobiva taktika; "}, {"en": "2) analyzes the morphologica, syntactical and lexical structure of the text, explains the references to realia and most important names; ", "et": "2) analüüsib teksti morfoloogilist, süntaktilist ja leksikaalset struktuuri, selgitab tekstis leiduvaid viiteid antiiksetele reaalidele, olulisematele isiku- ja kohanimedele;"}, {"en": "3) is able to find and critically assess the literature and sources (on paper and in digital form) for the research paper;", "et": "3) suudab iseseisvalt leida ja hindab kriitiliselt uurimistööks vajalikke erialaseid allikmaterjale (nii paberkandjal kui elektroonilisi ressursse kasutades);"}, {"en": "4) proposes a hypothesis and/or a practical objective, solves the research question/objective of the thesis using appropriate research methods, and explains the results of his/her research;", "et": "4) püstitab uurimisküsimuse ja/või praktilisema eesmärgi, lahendab uurimisprobleemi rakendades selleks sobivat uurimismeetodit, põhjendab  uurimistöös saavutatud tulemusi;"}, {"en": "5) plans the time for writing the research paper, reflects on the working process, cooperates with the supervisor(s) and fellow students;", "et": "5) planeerib uurimistöö kirjutamisel oma aega, reflekteerib oma tööprotsessi üle, teeb koostööd juhendajaga ja kaasüliõpilastega; "}, {"en": "6) presents the results of the research paper in an open-defence, discusses the problems in the research process, explains the choises made during the research;", "et": "6) esitleb oma töö tulemusi avalikul kaitsmisel, arutleb tööprotsessis esinenud probleemide üle, põhjendab uurimistöö käigus tehtud valikuid;"}, {"en": "7) writes the research paper in correct language, uses appropriate tools and formats (either on paper or digitally) of writing and presenting the research.", "et": "7) kirjutab korrektses keelepruugis uurimistöö, kasutab uurimistöö kirjutamiseks, vormistamiseks, esitamiseks ja kaitsmisel sobilikke digitaalseid abivahendeid."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Lõpphindamine koosneb kahest osast: 1) keelelist kompetentsi näitavad eksamid (kreeka ja ladina keeles) ning 2) üldisemat antiikkultuuri tundmist ning teadusliku töö kirjutamise oskust näitav bakalaureusetöö ning selle kaitsmine. \n\nI Keeleeksamitel hinnatakse:\n- üldist tekstist arusaamist;\n- oskust omavahel kokku kuuluvaid sõnu-fraase ära tunda ja õigesti tõlkida;\n- oskust tekstis olevaid grammatilisi ja süntaktilisi vorme-konstruktsioone määratleda; \n- tekstist lähtuvatele kirjanduslikele ning kultuurilistele lisaküsimustele vastamist.\n\nII.Antiikkultuuri alase kompetentsi osaeksam: bakalaureusetöö.\nAntiikkultuuri alase kompetentsi osaeksam kujutab endast lühikesemahulist (u 25-40 lk) bakalaureusetööd, milles käsitletakse iseseisva analüüsi baasil mingit antiikkultuuri, keeli või kirjandust puudutavat teemat. \nHinne moodustab retsensendi ja komisjoni liikmete poolt antud hinnete keskmise põhjal, hindamisel arvestatakse: \n– kuivõrd selge ja aktuaalne on probleemiasetus/praktilisema suunaga töö eesmärk, kas töö meetod on sobilik valitud teema avamiseks ja püstitatud uurimisprobleemi/eesmärgi lahendamiseks;\n– kas bakalaureusetööks ettenähtud töö hulk peegeldub selle valmiskujus;\n– kas ja kuivõrd käsitleb autor uudseid aspekte, kuivõrd hästi on see töös esile toodud;\n– kas tehtud järeldused on paikapidavad ning originaalsed;\n– kas töö ülesehitus ja peatükkide seostatus on loogiline ning vastab esitatud probleemile/eesmärgile;\n– kas töö vormistus vastab juhendis ettenähtule; milline on töö keeleline, sh. ortograafiline, grammatiline ja terminoloogiline tase; \n– kuivõrd on lõputöö koostajal olemas ülevaade teemale vastavast kirjandusest ja kuivõrd see kajastub töös, kas kasutatud allikad on relevantsed;\n– lõputöö kirjutamise protsessis osalemist, koostööd juhendajaga;\n– kuivõrd hästi suudab autor kaitsmisel töös esitatud seisukohti kaitsta ja kui arusaadavalt vastata esitatud küsimustele.\n\nIII. Koondhinde kujunemine ja kompensatsioonimehhanism\nEksamihinne on koondhinne, mis moodustub kõigi alaosade (keelelise kompetentsi osaeksamid: kumbki 20% ja antiikkultuuri alase kompetentsi osaeksami-bakalaureusetöö, 60%) hinnete põhjal. Väga väljapaistva vastuse puhul võidakse andestada ka mõni raskem viga hinnet alandamata, nt keelelise kompetentsi osaeksami suurepärane tulemus võib kompenseerida bakalaureusetöö puudujääke ja vice versa. \nEksami positiivsele hindele sooritamiseks ei tohi kummaski osas jääda tulemus alla 40%."}}], "grade_preconditions": {"et": "Seminarides ja praktikumides osalemine. Bakalaureusetöö esitamine kaitsmiseks."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb kahe keeleeksami (kumbki 20%) ning seminaritöö (60%) koondhindena."}, "grade_conditions": {"A": {"et": "   Keeleeksamil on saadud täiesti adekvaatselt aru esitatud tekstikatkendeist ning esitatud nendest sisuliselt ja keeleliselt täiesti korrektne tõlge. Esitatud lisaülesanded (keeleline analüüs, küsimused autori/anri ja vormiprobleemide kohta) on vastatud õigesti. Töös võib esineda üksikuid väikseid vigu. \n   Bakalaureusetöös on püstitatud aktuaalne uurimisprobleem, praktilisema suunaga töö puhul ka praktilise töö eesmärk, valitud selle läbiviimiseks sobilik meetod. Analüüs (ning praktiline töö osa) on läbi viidud põhjalikult ja korrektselt, kasutatud relevantseid allikaid, analüüsi tulemused/järeldused on paikapidavad ja esitatud arusaadaval kujul. Töö on loogiliselt üles ehitatud, keeleliselt ja vormistuslikult korrektne. Töös võib esineda üksikuid väikseid vigu. Üliõpilane on teinud juhendajaga koostööd, esitanud seminarides tähtajaks nõutavad töö osad. Üliõpilane suudab kaitsmisel selgelt esitada ülevaate oma tööst ja selle tulemustest, vastab põhjalikult ja adekvaatselt retsensendi ning kaitsmiskomisjoni küsimustele.  "}, "B": {"et": "   Keeleeksamitel on tekstikatkendeist adekvaatselt aru saadud ning esitatud nendest sisuliselt ja keeleliselt korrektne tõlge. Esitatud lisaülesanded (keeleline analüüs, küsimused autori/anri ja vormiprobleemide kohta) on vastatud põhimõtteliselt õigesti. Töös võib esineda väiksemaid vigu. \n   Bakalaureusetöös on püstitatud aktuaalne uurimisprobleem, praktilisema suunaga töö puhul ka praktilise töö eesmärk, valitud selle läbiviimiseks sobilik meetod. Analüüs (ning praktiline töö osa) on läbi viidud põhjalikult ja korrektselt, kasutatud relevantseid allikaid, analüüsi tulemused/järeldused on paikapidavad ja esitatud arusaadaval kujul. Töö on loogiliselt üles ehitatud, keeleliselt ja vormistuslikult korrektne. Töö mõnes aspektis esineb mõningaid puudujääke. Üliõpilane on teinud juhendajaga koostööd, esitanud seminarides tähtajaks nõutavad töö osad. Üliõpilane suudab kaitsmisel esitada ülevaate oma tööst ja selle olulisematest tulemustest, vastab adekvaatselt retsensendi ja kaitsmiskomisjoni küsimustele, ent jääb mõnes kaitsmise aspektis pealiskaudseks. "}, "C": {"et": "   Keeleeksamil on tekstikatkendist saadud peaaegu adekvaatselt aru ning esitatud sisuliselt ja keeleliselt üldjoontes korrektne tõlge. Esitatud lisaülesannetele (keeleline analüüs, küsimused autori/anri ja vormiprobleemide kohta) vastamisel võib esineda mõningaid vigu ja nüansside mittemõistmist. \n   Bakalaureusetöös on püstitatud aktuaalne uurimisprobleem, praktilisema suunaga töö puhul ka praktilise töö eesmärk, valitud selle läbiviimiseks sobilik meetod. Analüüs (ning praktiline töö osa) on läbi viidud üldjoontes korrektselt, ent mitte väga põhjalikult. Kasutatud on üldjoontes relevantseid allikaid, analüüsi tulemused/järeldused on üldjoontes paikapidavad ja esitatud arusaadaval kujul, ent jäävad mõneti pealiskaudseks. Praktilisema suunaga töö puhul ei ole tulemus esitatud sisuliselt ja/või vormiliselt täiesti korrektselt. Töö on üldiselt loogiliselt üles ehitatud, esineb keelelisi ja/või vormistuslikke vigu. Üliõpilane on teinud juhendajaga koostööd, esitanud seminarides tähtajaks nõutavad töö osad. Üliõpilane suudab kaitsmisel esitada arusaadava ülevaate oma tööst ja selle olulisematest tulemustest, ent tal on mõningasi raskusi retsensendi ja kaitsmiskomisjoni küsimustele vastamisel."}, "D": {"et": "Keeleeksamitel on tekstikatkenditest saadud üldjoontes adekvaatselt aru, ent võib esineda suuremaid vigu ja kohatist sisu mittemõistmist. Esitatud tõlge on sisuliselt ja keeleliselt enam-vähem arusaadav. Lisaülesannetele (keeleline analüüs, küsimused autori/anri ja vormiprobleemide kohta) vastamisel võib esineda suuremaid vigu. \n   Bakalaureusetöös on püstitatud aktuaalne uurimisprobleem, praktilisema suunaga töö puhul ka praktilise töö eesmärk, valitud selle läbiviimiseks sobilik meetod. Analüüsi (ning praktilise töö osa) läbi viimisel on jäädud pealiskaudseks, lugejal võib tekkida raskusi teatud aspektide mõistmisel. Kasutatud on üldjoontes relevantseid allikaid, analüüsi tulemused/järeldused on üldjoontes paikapidavad ja esitatud arusaadaval kujul, ent jäävad pealiskaudseks. Praktilisema suunaga töö puhul võib olla mõningaid olulisi puudujääke sisulise ja/või vormilise korrektsuse osas. Töö on üldjoontes loogiliselt üles ehitatud, esineb keelelisi ja/või vormistuslikke vigu. Üliõpilane on teinud juhendajaga koostööd, esitanud seminarides tähtajaks nõutavad töö osad. Üliõpilane suudab kaitsmisel esitada ülevaate oma töö põhiolemusest ja selle tähtsamatest tulemustest, ent jääb väga pealiskaudseks ja tal on raskusi retsensendi ja kaitsmiskomisjoni küsimustele vastamisel."}, "E": {"et": "Keeleeksamitel on tekstikatkenditest aru saadud üksnes osaliselt, tõlge piirdub lauseosade, fraaside või üksiksõnade tõlkimisega, pikemate struktuuriüksuste (lause) ja lausete omavahelise seostamisega esineb raskusi. Tõlgetes rohkelt väikesi ja/või lisaks ka suuri vigu. Lisaülesannetele (keeleline analüüs, küsimused autori/anri ja vormiprobleemide kohta) vastamisel esineb põhimõttelisi vigu.\n   Bakalaureusetöös ei ole selgelt püstitatud uurimisprobleemi, praktilisema suunaga töö puhul praktilise töö eesmärki, töö läbiviimiseks valitud meetod ei pruugi olla sobivaim. Analüüsi (ning praktilise töö osa) läbi viimisel on jäädud ülimalt pealiskaudseks, lugejal tekib raskusi teatud aspektide mõistmisel. Kasutatud  allikate relevantsuses on küsitavusi, samuti esineb vigu analüüsi tulemustes/järeldustes, need on esitatud väga pealiskaudsel kujul. Praktilisema suunaga töö puhul esineb olulisi puudujääke sisulise ja/või vormilise korrektsuse osas. Töö ülesehitus ei ole valitud uurimisprobleemi/eesmärgi esitamiseks sobivaim, esineb ulatuslikumaid keelelisi ja/või vormistuslikke vigu. Üliõpilane on teinud juhendajaga koostööd, ent hilinenud seminarides tähtajaks nõutavate töö osade esitamisel. Üliõpilasel on kaitsmisel raskusi oma töö ülevaate ja selle tähtsamate tulemuste esitamisel, samuti retsensendi ja kaitsmiskomisjoni küsimustele vastamisel."}, "F": {"et": "Keeleeksamitel ei ole tekstikatkenditest üldjoonteski adekvaatselt aru saadud, esineb olulisi vigu sõnade-fraaside tõlkimisel, nende omavahelisel seostamisel. Lisaülesannetele ei ole suudetud õigesti vastata.\n   Bakalaureusetöös ei ole saavutatud õpiväljundeid, ei ole täidetud bakalaureusetöös toodud nõudeid või töös esineb plagiaati. "}, "mi": {"et": "Üliõpilane ei ole osalenud seminarides, ilmunud keeleeksamitele ega esitanud tähtajaks bakalaureusetööd."}}, "debt_elimination": {"et": "Vastavalt ÕKE-le."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "2a9f5a7f-31f3-47d2-aa68-74bb4b308a39", "type": "MOODLE", "code": "HVLC.02.008", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Bakalaureusetöö juhend  ning töö vormistamise juhend on leitav klassikalise filoloogia osakonna kodulehel (https://maailmakeeled.ut.ee/et/sisu/lopetajale) ja Moodle's."}, "type": {"code": "reference", "et": "Viide", "en": "Reference"}, "required": true}, {"name": {"et": "Vastava semestri bakalaureuseseminari läbimiseks olulised tähtajad on ajajoonena esitatud Moodle's."}, "type": {"code": "reference", "et": "Viide", "en": "Reference"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "667a0843-811d-b78a-0068-146520628e8d", "person_name": "Kadri Novikov", "structural_unit": {"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "0171fb2c-e302-060b-4597-9bf11f07cd8e", "person_name": "Ivo Volt", "structural_unit": {"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "1e5cb612-a312-70c6-c2f5-318eeac22158", "person_name": "Neeme Näripä", "structural_unit": {"code": "HVLC02", "name": {"en": "Department of Classical Studies", "et": "klassikalise filoloogia osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-38"}, "entries": [{"course_week": 25, "time": "2025-02-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä, I. Volt)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä, I. Volt).\nTäpsed kuupäevad lepitakse kokku jooksvalt (N. Näripä, I. Volt)"}}, {"course_week": 26, "time": "2025-02-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (I. Volt)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (I. Volt)"}}, {"course_week": 27, "time": "2025-03-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä)"}}, {"course_week": 28, "time": "2025-03-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (I. Volt)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (I. Volt)"}}, {"course_week": 29, "time": "2025-03-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä)"}}, {"course_week": 30, "time": "2025-03-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Töö teise osa esitlemine - märtsi lõpp"}, "description": {"et": "Töö teise osa esitlemine - märtsi lõpp.\nTöö teise osa esitlemine seminaris, tagasiside andmine kaastudengi tööle.  (N. Näripä, I. Volt, juhendajad)"}}, {"course_week": 31, "time": "2025-04-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (I. Volt)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (I. Volt)"}}, {"course_week": 32, "time": "2025-04-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (N. Näripä)"}}, {"course_week": 33, "time": "2025-04-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (I Volt)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: kreeka (I Volt)"}}, {"course_week": 34, "time": "2025-04-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (N. Näripä)"}, "description": {"et": "Keeleeksamiks ettevalmistav seminar: ladina (N. Näripä)"}}, {"course_week": 35, "time": "2025-05-01", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Töö esitamine eelkaitsmiseks"}, "description": {"et": "Töö esitamine eelkaitsmiseks"}}, {"course_week": 36, "time": "2025-05-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Eelkaitsmine"}, "description": {"et": "Bakalaureusetöö eelkaitsmine."}}, {"course_week": 38, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Proovieksam"}, "description": {"et": "Ladina keele proovieksam"}}, {"course_week": 39, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Proovieksam"}, "description": {"et": "Kreeka keele proovieksam"}}, {"course_week": 38, "time": "2025-05-25", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Bakalaureusetöö esitamine kaitsmiseks"}, "description": {"et": "Bakalaureusetöö esitamine kaitsmiseks"}}, {"course_week": 39, "time": "2025-05-30", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Ladina keele lõpueksam kell 12.00."}, "description": {"et": "Ladina keele lõpueksam kell 12.00."}}, {"course_week": 40, "time": "2025-06-03", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Kreeka keele lõpueksam kell 12.00."}, "description": {"et": "Kreeka keele lõpueksam kell 12.00."}}, {"course_week": 40, "time": "2025-06-05", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "Kaitsmine"}, "description": {"et": "Kaitsmine.\nBakalaureusetöö avalik kaitsmine kell 12.00."}}]}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "208f9ad1-41e4-f433-b411-9403bee16fbe", "parent_code": "HVLC.02.008", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}