{"uuid": "1b626f35-8105-11f0-8a76-45907bb32710", "code": "HVLC.04.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of German-Speaking Countries I", "et": "Saksakeelsete maade ajalugu I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC04", "structural_unit_name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC04", "name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course deals with the history of the German-speaking countries from the Fall of Rome to the end of Cold War.  The course is divided into two equal periods: the first semester is devoted to the period up to the End of the Holy Roman Empire; the second semester; the second semester focuses on the period from the Napoleonic Wars until the German Reunification. The course consists of seminars; students will receive course materials.", "et": "Ainekursus hõlmab saksa keelt kõnelevate maade ajalugu Lääne-Rooma langemisest kuni Külma sõja lõpuni. Kursus jaguneb kaheks ajaliselt võrdseks osaks: esimesel semestril käsitletakse ajavahemikku kuni Saksa Rahvuse Püha Rooma Riigi lõpuni, teisel semestri Napoleoni sõdadest kuni Saksamaade taasühinemiseni. Töö toimub seminarivormis, osalejad varustatakse materjalidega."}, "objectives": [{"en": "The aim of the course is to provide an overview of history of German-speaking countries during 2000 years, its main stages and key moments against the background of European history but also about different ways of treating history, creation of political myths and subjectivity of historical research.", "et": "Aine eesmärgiks on anda ülevaade saksakeelsete maade ajaloost antiigi lõpust kuni Saksamaade taasühinemiseni, selle tähtsamatest etappidest ja ajaloo sõlmhetkedest Euroopa ajaloo taustal, aga ka ajaloo käsitlemise võimalustest, müüdiloomest ja subjektiivsusest ajalooteaduses."}], "learning_outcomes": [{"en": "The student who has completed the course should know the main facts of  distinctive history of the German-speaking countries on the background of the history of Europe and be able to see it in the wider cultural context.", "et": "Iga kursuse läbinud üliõpilane on saanud võimaluse omandada põhiteadmised saksakeelsete maade ajaloost Euroopa ajaloo taustal ja vaadelda neid laiemas kultuurikontekstis.Oskab digivahendite abil leida infot ning hinnata selle asjakohasust ja usaldusväärsust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}