{"uuid": "9d62a259-f15f-2935-da34-e6bc5e5226d4", "code": "HVLC.03.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "French for the Intermediate Level I, B1.1 > B1.2", "et": "Prantsuse keel kesktasemele I, B1.1 > B1.2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "fr", "et": "prantsuse keel", "en": "French"}, "start_level": {"code": "B1", "et": "B1", "en": "B1"}, "end_level": {"code": "B2", "et": "B2", "en": "B2"}}}, "overview": {"description": {"en": "The course presupposes the Council of Europe Level B.1.\nThe vocabulary and grammar  studied during the course are related to the following topics :\n- Using different language registers (cultivated language; official vs everyday language), variations of spoken French (verlan, slang, etc.)\n- Review of French written press (nationwide daily and weekly newspapers, most important magazines)\n- How to talk about films, understand and compile film reviews\n- Stereotypes \n- Youth and education\n- Superstition and different habits related to it\n- Family\n- French habits\n- Work\n- Multicultural France \n- New technologies\nSpeech acts: expressing one's opinions, wishes, hopes, expectancies, doubts and convictions; making suppositions\nGrammar: relative pronouns, personal pronouns, past tenses and words expressing time, negation, passive voice, conditional and subjunctive mood", "et": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel B.1 või keelekeskuse neljanda semestri edukas läbimine. \nKursusel käsitletav sõnavara ja grammatika on seotud järgnevate teemadega:\n- Erinevate keeleregistrite kasutamine (hoolitsetud kõnepruuk; ametlik versus kodune kõnepruuk), prantsuse kõnekeele variatsioonid (verlan, argoo jne.)\n- Ajakirjanduse lugemise oskus: ülevaade üleriiklikest väljaannetest (päeva- ja nädalalehed ning tähtsamad ajakirjad)\n- Mõista uudiste kajastamist meedias, osata uudist edastada\n-  Erinevad isiksusetestid\n- CV ja motivatsioonikirja koostamine\n-  Reklaam, reklaamikampaaniate seos ühiskonnaelu küsimustega\n-  Stereotüübid, kõneldes erinevatest maadest ja rahvastest \n-  Ebausk ja sellega seotud kombed\n-  Filmitutvustuse mõistmine ja koostamine, filmikriitika, hinnangute andmine\n-  Mitmekultuuriline Prantsusmaa\nHarjutatavad kõneaktid: arvamuste, soovide, lootuste, ootuste, kahtluse ja kindlustunde väljendamine; oletuste tegemine.\nGrammatika:\nsiduvad asesõnad, isikulised asesõnad, minevikuajad ja ajaväljendid, eituslause, umbisikuline tegumood, tingiv ja kahtlev kõneviis."}, "objectives": [{"en": "This intermediate course aims to enlarge the students' vocabulary and knowledge of grammar and to develop their reading, conversational and listening skills, while focusing on the training of oral communication, as the course is carried out by a native speaker.", "et": "Kesktaseme kursus, mille käigus arendatakse vestlus-, kuulamis-, lugemis- ja kirjutamisoskust ning peamiselt kinnistatakse juba teoreetiliselt tuttavaid keelestruktuure. Kursuse põhirõhk on prantsuse keelt emakeelena kõneleva õpetaja poolt läbi viidavais tundides suuliste osaoskuste treeningul."}], "learning_outcomes": [{"en": "By the end of the course the student will have improved his oral expression skills towards more clarity and fluency. The student will have acquired language structures and enriched his vocabulary in a way that his language use will be more correct in spontaneous speech. The student has also developed his comprehension of written and spoken texts and improved his writing skills.", "et": "Kursuse läbinud üliõpilane on nii kõnes kui kirjas õppinud end väljendama selgemini, sõnavara ja väljendite poolest rikkamas keeles, mõistab paremini nii suulist kui kirjalikku teksti. Üliõpilase keelekasutus on spontaansetes kõnesituatsioonides muutunud korrektsemaks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}