{"uuid": "02bb1b35-fbfb-3a4d-1d13-a4dfdcb6f31d", "code": "HVLC.03.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Spanish for Beginners II, Level A1.1 > A1.2", "et": "Hispaania keel algtasemele II, tase A1.1 > A1.2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "es", "et": "hispaania keel", "en": "Spanish"}, "start_level": {"code": "A1.1", "et": "A1.1", "en": "A1.1"}, "end_level": {"code": "A1.2", "et": "A1.2", "en": "A1.2"}}}, "overview": {"description": {"en": "The course introduces the vocabulary related to the following topics: talk about events in the past, experiences, food and to go to restaurant, \nThe course focuses on the following grammatical areas:\nRegular and irregular verbs of the present indicative, reflexive verbs, direct object, past perfect, the use of the verbs to know (saber) and to be able (poder).", "et": "Tundide teemad: igaepäeva rutiinsed tegevused, kohvikus, restoranis ja toidupoes käimine, toiduvalmistamine, tee küsimine ja juhatamine; oma elukogemustest rääkimine.\nÜliõpilased omandavad oskuse rääkida endast ja oma perest, töökeskkonnast ja igapäevastest tegevustest, kirjeldada inimesi ja kohti, kasutada linnas liikumiseks, sisseostude tegemiseks jms vajalikke väljendeid ja sõnavara.\n\n\nGrammatika: tegusõna pööramine olevikus sh reeglipärased ja ebareeglipärased tegusõnad, enesekohane tegusõna, täisminevik, otsesihitis."}, "objectives": [{"en": "The aim of the course is to acquire the lower intermediate level of Spanish (A2) and introduce the students to some aspects of Spanish and Latin American cultures and history.", "et": "Õppeaine eesmärgiks on suhtluskeele omandamine A2 tasemel vastavalt Euroopa keelestandardile. Tutvutakse ka Hispaania ja Ladina-Ameerika kultuuri ja ajalooga."}], "learning_outcomes": [{"en": "On completion of the course the learners will be able to read and understand simple texts (both oral and written) and use the vocabulary and grammar covered during the course in everyday situations. The learners will be able to talk and write about her/his home and eating habits, to express (dis)approval and to socialize in the street, in the shop, at a restaurant, in a group. The learners will be able  to understand and to create the elementary oral and written texts.", "et": "Õppeaine läbinud üliõpilane suudab mõista ning luua lihtsamaid suulisi ja kirjalikke hispaaniakeelseid tekste, oskab kasutada õpitud sõnavara ja grammatikat igapäevastes situatsioonides. Üliõpilane oskab rääkida ja kirjutada oma igapäevastest harjumustest, toidust ja toidu valmistamisest, kirjeldada elukeskkonda, juhatada ja küsida teed. Üliõpilane oskab hispaania keelt hääldada, lugeda ning tunneb peamisi ortograafiareegleid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}