{"uuid": "535f7da5-fc56-c6c1-d65d-21b4c7c293cc", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-18T09:20:00", "title": {"en": "History of English Literature from Middle Ages to Romanticism", "et": "Inglise kirjandus keskajast romantismini"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 60, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course consists of the theoretical and practical parts. The theoretical part will concentrate on the general cultural scene, including architecture and the figurative arts, to provide a background for literary developments which will facilitate the analysis of chosen representative texts with the aim of showing how the two are interrelated and how literary trends and styles evolve. Respectively, the exam also consists of the theoretical and practical parts. The course is richly illustrated with pictorial material. All the course materials can be found at sisu.ut.ee/pilvirajamae.", "et": "Kursuse loengud koosnevad teoreetilisest ja praktilisest osast. Teoreetilises osas vaadeldakse ajastu kultuuripilti tervikuna, läbi arhitektuuri ja kaunite kunstide, et tuua välja vastastikused mõjud kirjandusega ja anda laialdased taustteadmised, mille põhjal siis vaadeldakse valitud representatiivseid tekste, et avada kultuurilised seosed ja selgitada erinevate kirjanduslike stiilide ja voolude põhialuseid. Sellele vastavalt on ka eksam kaheosaline, koosnedes teoreetilisest ja praktilisest osast. Kursust illustreerib rikkalik pildimaterjal. Kõik kursuse materjalid on leitavad kodulehel sisu.ut.ee/pilvirajamae."}, "objectives": [{"en": "The aim of the course is to give an overview of the main trends in English literature starting from the Old English period up to the Romantic period. For this purpose, the literature of the period is viewed in its historical context which includes also developments in figurative art and architecture in order to provide the students with a comprehensive overview of the period.", "et": "Kursuse eesmärgiks on anda ülevaade inglise kirjanduse põhisuundadest alates vana-inglise kirjandusest kuni kaheksateistkümenenda sajandi viimase veerandini. Sel eesmärgil vaadeldakse erinevaid kirjandusilminguid nende ajaloolises kontekstis ja seoses arengutega kujutavas kunstis ning arhitektuuris, et käsiteldavast perioodist kujuneks terviklik ülevaade."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "Having taken the course, the student will be able to distinguish between the different styles and trends of the period in their historical context and locate them in the general cultural scene of the period the integral part of which they are. The student will be able to recognize different styles and characteristics of the period under discussion based on the texts discussed in class. The student will have mastered the necessary terminology, having made notes in class and read the textbooks. The student will also be able to analyze the literary texts of the period and produce academic texts.", "et": "Kursus läbinuna on üliõpilane võimeline orienteeruma käsiteldava perioodi inglise kirjanduse erinevate stiilide ja voolude kujunemises nende ajaloolises kontekstis ja paigutatuna üldisesse kultuuripilti, mille lahutamatuks osaks nad on. Ta tunneb ära ja eristab erinevate perioodide stiile ja iseärasusi nende tekstide põhjal, mida kursuse jooksul käsitletakse. Ta orienteerub erialases terminoloogias, olles seda harjutanud nii konspekteerides loengus kuuldut kui töötanud õpikutekstidega. Ta on võimeline analüüsima selle perioodi kirjandustekste ja looma ka ise erialast teksti."}], "notes": {"et": "Õppeaine on soovitavaks eeldusaineks kursusele \"Inglise kirjandus romatismist modernismini\" 3 EAP"}}, "grading": {"independent_work": {"en": "Independent work: the student will work independently with the textbooks, making use of the revision questions which can be found in the course book.", "et": "Iseseisvate tööde loetelu ja juhised nende tegemiseks: Üliõpilane töötab iseseisvalt õpikutekstidega, milles teda aitavad kordamisküsimused, mis on ära toodud kompendiumis."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"en": "The exam will take place in the classroom. The exam paper will be written on paper using the pen.  The exam consists of the theoretical and practical parts. The exam will last 180 minutes. The exam paper will consist of 7 questions. In the exam room, no use can be made of course materials in whatever form – electronic or printed. Likewise no laptops, telephones and AI in whatever form will be allowed. ", "et": "Kursus lõpeb eksamiga klassiruumis. Eksamitöö kirjutatakse käsitsi paberile. \nEksam koosneb teoreetilisest ja praktilisest osast. Eksam kestab 180 minutit. Eksamitöö koosneb 7 küsimusest. Eksamiruumis ei saa kasutada kursuse materjale mitte mingisugusel kujul – ei elektrooniliselt ega välja prindituna. Samuti ei saa kasutada isiklikku arvutit, telefoni ega tehisaru ükskõik millisel kujul.\n"}}], "grade_preconditions": {"en": "Attendance at lectures is obligatory. You can miss 5 lectures out of the total 26. If you miss more lectures, you will have to present a doctor’s certificate.", "et": "Loengutes käimine on kohustuslik, kusjuures 26 loengust võib puududa 5 korral. Kui puudumisi tuleb rohkem kui 5, tuleb esitada arstitõend."}, "grade_evaluation": {"en": "---\nThe mark will consist of the following components:\nThe first two questions will be theoretical and based on the student's independent work. They will make up 50% of the mark which corresponds to the amount of the student's independent work uring the course. All of the five text questions will also make up 50% of the final result. To get the lowest positive mark E the student will need 60%. Thus:\n\nThe first theoretical question based on the course book material will amount to 25% of the final result.\nThe second theoretical question based on the textbooks will also amount to 25% of the final result.\nEvery one of the five text questions adequately answered amounts to 10% of the final result.\nThe marking scale is the following:\n91-100% A\n81-90% B\n71-80% C\n61-70% D\n51-60% E\n50% and less F\n\nFeedback for the examination paper will be found in Moodle under the exam date.\n\nTo facilitate the better acquisition of the material to be studied independently at home, a progress test will have to be taken during the last lecture of every month. It will consist of one of the revision questions assigned for study during the preceding month. The test will be written with pen on paper and last 30 minutes. Course materials in whatever form, electronic or printed, cannot be used for the test. The feedback for the test will be found in Moodle under the test date. Progress tests cannot be retaken. Should the student get a positive result for all 3 tests, he/she is exempted from answering the first 2 exam questions. Should there be fewer than 3 positive test results, all 7 of the examination questions will have to be answered. AI in whatever form cannot be used when taking the tests.", "et": "Eksamihinne kujuneb järgnevalt:\nKaks esimest, teoreetilisel materjalil põhinevat ja iseseisvat tööd nõudvat küsimust, annavad kokku 50% lõpphindest, sest see on ka üliõpilase iseseisva töö maht. Viis tekstianalüüsiküsimust annavad kokku samuti 50% lõpphindest. Eksami edukaks sooritamiseks madalaimale positiivsele hindele E on vaja saada kokku vähemalt 60%. \n\nLahtikirjutatuna kujuneb hinne järgmiselt:\nTeoreetiline küsimus kompendiumi materjalide põhjal vastatuna piisava põhjalikkusega: 25%\nTeoreetiline küsimus õpikute põhjal vastatuna piisava põhjalikkusega: 25%\nIgaüks viiest tekstiküsimusest vastatuna piisava põhjalikkusega: 10% \n\nHindamise skaala on järgmine:\n91-100% A\n81-90% B\n71-80% C\n61-70% D\n51-60% E\n50% või alla selle F\n\nTagasiside eksamitööle leiab Moodle'ist vastava eksamikuupäeva alt.\n\nHõlbustamaks iseseisvalt kodus loetava materjali omandamist toimuvad iga kalendrikuu viimases loengus progress testid. Test koosneb ühest kordamisküsimusest, mis valitakse nende hulgast, mis on eelneva kuu jooksul tulnud läbi töötada. Test toimub paberi ja pastakaga klassiruumis ja kestab 30 minutit. Kursuse materjale ei elektroonilisel ega väljaprinditud kujul ei saa testi tegemisel kasutada. Testi tagasiside leiab Moodle'is vastava testi kuupäeva alt. Progress testid ei kuulu ümbertegemisele. Kui üliõpilane on sooritanud kõik 3 progress testi positiivsele tulemusele, saab ta vabastuse vastata eksamil kahele esimesele, s.t. teoreetilisele, küsimusele. Kui positiivseid vastuseid tuleb kokku vähem kui 3, tuleb eksamil vastata kõigile 7 küsimusele. Tehisaru ükskõik millist varianti ei tohi testide tegemisel kasutada.\n"}, "debt_elimination": {"en": "By agreement with the lecturer in accordance with the study regulations", "et": "Kokkuleppel õppejõuga vastavalt õppekorralduseeskirjale"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"en": "According to the study regulations", "et": "Vastavalt õppekorralduseeskirjale."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "2fdfe025-1d62-4d1f-b4dc-9279f70dc867", "type": "MOODLE", "code": "HVLC.01.074", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "The course materials consist of the course book compiled by the lecturer, the students own lecture notes, the texts discussed in class and the textbooks. "}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "The chief textbook is Andrew Sanders. The Short Oxford History of English Literature. Oxford University Press. \n"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": true}, {"name": {"et": "Additional textbooks: An Outline of English Literature. Ed. by Pat Rogers. Oxford University Press; Myths and Legends of the Middle Ages, Senate; Roy Strong. \nThe Spirit of Britain. A Narrative History of the Arts. Pimlico. \n"}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": false}, {"name": {"et": "Materials can be found on the lecturer's website: sisu.ut.ee/pilvirajamae\n"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}], "recommended_materials": "Nimekirja täiendavatest perioodi käsitlevatest õpikutest leiab kursuse kompendiumist. Need ei ole kohustuslikud.\n--\nRecommendations for additional reading are to be found in the compendium. They are not obligatory."}, "participants": {"lecturers": [{"person_uuid": "cdf85e53-954a-56bf-541c-664e747599cb", "person_name": "Pilvi Rajamäe", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}}, "registration_info": {"audience": {}}, "parent_uuid": "cc38c7de-2d67-0d63-d147-cd737393993b", "parent_code": "HVLC.01.074", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}