{"uuid": "af9167ae-c2fe-8333-baba-697235ca1e86", "code": "HVLC.04.047", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Didactics of the German Language I", "et": "Saksa keele didaktika I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC04", "structural_unit_name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC04", "name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students learn how to structure the process of teaching and learning foreign languages in contemporary school. Organizational formats of teaching and their application to the study of foreign languages. Students learn and apply various methods of teaching foreign languages, techniques and games to develop listening, speaking, reading, and writing skills. They learn to analyse various textbooks of German and work out their own conception of teaching German on the basis of one topic in the textbook. The course ends with an exam.", "et": "Annotatsioon + eesmärk: Üliõpilane õpib, kuidas struktureerida võõrkeele õppimise ja õpetamise protsessi kaasaegses koolis. Õpitakse, millised on õppetöö organisatsioonilised vormid ning missuguse eesmärgiga rakendatakse neid võõrkeele õppimisel. Üliõpilane õpib tundma ning rakendama erinevaid võõrkeele õpetamise meetodeid, tehnikaid ja mänge kuulamis-, rääkimis-, lugemis-, kirjutamisvilumuste kujundamiseks.  \nÕpitakse analüüsima saksa keele õpikuid ning lähtudes õpiku ühest teemast oma saksa keele õpetamiskontseptsioon. \n Kursus lõpeb eksamiga."}, "objectives": [{"en": "The students obtain and  analyse different  contemporary methods of teaching German language", "et": "Aine eesmärgiks on erinevate kaasaegste saksa keele õpetamise meetodite analüüsimine ning omandamine."}], "learning_outcomes": [{"en": "The students learn to structure the process of teaching and work out their own conception of teaching", "et": "Üliõpilane omandab oskuse juhtida õppimise protsessi ja valida endale sobiv õpetamise viis"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}