{"uuid": "ec0935eb-c301-e50d-f2f9-6938f2b56403", "code": "HVLC.04.045", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "German Phraseology", "et": "Saksa keele fraseoloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC04", "structural_unit_name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC04", "name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "An introductional course in lexicology and lexicography. The course topics include morphological and semantic structure of lexikal items, semantic relations in the vocabulary (synonymy, antonymy, contrast, hierarchical relations; collocability and valence) lexical variation (semantic change, idioms, archaisms and neologisms).", "et": "Kursusel käsitletakse leksikoloogia uurimisvaldkondi ja selle seoseid teiste teadustega; sõnaraamatute funktsioone ja liike, antakse ülevaade sõna sisu ja vormi elementidest, sh sõnade motiveeritusest, sõnamoodustuse liikidest ja sõnade tähenduse muutumisest (idioomid; arhaismid ja neologismid). Õpitakse kirjeldama ja analüüsima paradigmaatilisi tähendussuhteid (sünonüümia, antonüümia, hüponüümia, tähendusväljad) ning süntagmaatiliste suhete avaldumisvorme leksikaalses süsteemis (nt kollokatsioonid, valents)."}, "objectives": [{"en": "This introductional course offers an overview of lexicology and of the structure of the German vocabulary. The knowledge aquired through the course will give the student basic competence required from participants in following linguistic courses (stylistics, phraseology, lexicography, textlinguistics, translation theory etc.).", "et": "Kursus annab sissejuhatava ülevaate fraseoloogia peamistest uurimissuundadest ja selle sidemetest teiste teadustega ning saksa keele sõnavara struktuurist. Sellega omandatakse alusteadmised lingvistiliste ainete (leksikograafia, fraseoloogia, stilistika jne) õppimiseks, teksti lingvistiliseks analüüsiks ja tõlkimiseks."}], "learning_outcomes": [{"en": "The student will be able", "et": "Kursuse edukalt läbinud üliõpilane"}, {"en": "- to describe the morphological and semantic regularities in the lexicon (arbitrarity and motivation of lexical items); ", "et": "- tunneb keelelise märgi funktsioone ja oskab selgitada seoseid sõnade vormi ja sisu vahel (arbitraarsus ja motiveeritus);"}, {"en": "- to analyze the morphological and semantic structure of words by using of dictionaries;", "et": "- oskab sõnaraamatute abil analüüsida sõnade morfoloogilist ja semantilist struktuuri;"}, {"en": "- to explain the main reasons of changes in the vocabulary (semantic shift, idiomaticity, archaisms and neologisms);", "et": "- tunneb sõnavara muutumise peamisi põhjusi ja ilminguid (tähenduse muutumine, idiomatiseerumine, arhaismid, neologismid, laenud, sõnamoodustus);"}, {"en": "- to recognize paradigmatic lexical relations (synonymy, antonymy, contrast, hierarchical relations);", "et": "- oskab sõnaraamatute abil kirjeldada sõnadevahelisi paradigmaatilisi suhteid (sünonüümia, antonüümia, kontrast, hierarhilised suhted);"}, {"en": "- to explain the main rules of collocability and collocability restrictions and to choose suitable words for a given context.", "et": "- oskab selgitada sõnade kollokatsioonilisi erinevusi, valida konteksti sobiva sõna ja oma valikut põhjendada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}