{"uuid": "0cf5da02-bc86-026d-76c8-a0f8373a1df2", "code": "HVLC.05.078", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Contemporary Methods of Slavic Linguistics and Literary Criticism", "et": "Tänapäeva keele- ja kirjandusteaduse meetodid slavistikas"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC05", "structural_unit_name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is held in the form of lectures and seminars and enables the novice doctoral student to better orientate himself / herself in the problems of modern Slavic studies and their methods, to develop his / her presentation skills and to use the acquired experience in developing his / her dissertation. The course provides an overview of the development of Russian linguistics and literary criticism. The problems and development trends of theoretical linguistics relevant to Slavic studies are discussed: cognitive linguistics, functional grammar, aspectology, typology methods, communicative grammar, theory of speech acts, logical analysis of language, etc. The pain points of modern literary studies are discussed: commentary as a research problem, the difficulties of researching intertextuality, research methods of studying the relationship between literature and described reality. The course expands the understanding of the nature of research analysis, and methods of linguistic and literary analysis.", "et": "Kursus toimub nii loengu-, kui ka seminari vormis ja võimaldab algaja doktorandile paremini orienteeruda tänapäeva slavistika probleemides ja nende lahendamise meetodites, arendada oma esinemisoskusi ning kasutada omandatud kogemust oma väitekirjade arendamisel. Kursus annab ülevaate vene keele- ja kirjandusteaduse kujunemisest. Käsitletakse slavistikale aktuaalseid teoreetilise keeleteaduse probleeme ja arengusuundi: kognitiivne lingvistika, funktsionaalne grammatika, aspektoloogia, tüpoloogia meetodid, kommunikatiivgrammatika, kõneaktide teooria, keele loogiline analüüs jt. Arutatakse tänapäeva kirjandusteaduse valupunkte: kommentaar kui probleem, intertekstuaalsuse uurimise raskusi, kirjanduse ja kirjeldava reaalsuse vahekorra uurimismeetodeid. Kursus laiendab ettekujutust teadusliku analüüsi olemusest, keele- ja kirjandusteadusliku analüüsi meetoditest."}, "objectives": [{"en": "1. To develop doctoral student's research analysis skills. \n2. To develop the doctoral student's presentation skills. \n3. To deepen the doctoral student's knowledge of contemporary research methods used in Slavic linguistics and literary studies, their development and interrelationships. \n4. To prepare the doctoral student for conducting and formalizing independent research.", "et": "Eesmärgid:\n1.\tArendada doktorandi teadusanalüüsi oskusi.\n2.\tArendada doktorandi esinemisoskusi.\n3.\tSüvendada doktorandi teadmisi kaasaegsete slaavi keele- ja kirjandusteaduses kasutatavatest uurimismeetoditest, nende arengust ja omavahelistest seostest.\n4.\tValmistada doktorandi ette iseseisva uurimistöö läbiviimiseks ja vormistamiseks."}], "learning_outcomes": [{"en": "Student who has passed the subject: ", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1) has developed his/ her scientific analysis skills; ", "et": "1) on arendanud oma teadusanalüüsi oskusi;"}, {"en": "2) has gained additional experience in conducting a scientific report;", "et": "2) on saanud täiendava kogemuse teadusettekande pidamisel;"}, {"en": "3) is able to apply the acquired knowledge and skills in researching his/ her dissertation topic and in writing research paper; ", "et": "3) oskab rakendada saadud teadmisi ja oskusi enda väitekirjateema uurimisel ning uurimustöö kirjutamisel;"}, {"en": "4) has an overview of the development of Russian linguistics and literary criticism; ", "et": "4) omab ülevaadet vene keele- ja kirjandusteaduse kujunemisest;"}, {"en": "5) has an overview of the research methods used in the contemporary Slavic linguistics, their development and their interrelationships; ", "et": "5) omab ülevaadet tänapäeva slaavi keeleteaduses kasutatavatest uurimismeetoditest, nende arengust ja omavahelistest seostest;"}, {"en": "6) is aware of the most important problems of modern literary studies: the difficulties of commenting on a text and performing intertextual analysis; ", "et": "6) on teadlik kaasaegse kirjandusteaduse tähtsamates probleemidest: teksti kommenteerimis ja intertekstuaalse analüüsi teostamise raskustest; "}, {"en": "7) is familiar with the research methods of the relationship between a literary text and a described reality.", "et": "7) tunneb kirjandusteksti ja kirjeldava reaalsuse vahekorra uurimismeetodeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}