{"uuid": "12ebd221-61de-29ef-a4bf-46d8e4d32b70", "code": "HVLC.05.064", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"ru": "Seminar po russkoj literaturovedcheskoj terminologii", "en": "Seminar on Russian Literary Terminology", "et": "Seminar vene kirjandusteaduse põhimõistetest"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC05", "structural_unit_name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC05", "name": {"en": "Department of Slavic Studies", "et": "slavistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview of Russian schools of literary studies, introduces classical works and modern research on Russian literature. It allows students to apply theory to specific samples of literary works.", "et": "Kursus annab ülevaate vene kirjandusteaduslikest koolkondadest, tutvustab klassikalisi ja kaasaegseid uurimismeetodeid vene kultuuriruumis. Võimaldab rakendada teoreetilisi oskussõnu (mõisteid) vene kirjanduse teoste analüüsis."}, "objectives": [{"en": "The seminar introduces students to the basic concepts and methods of the Russian tradition of literary studies, as well as samples of contemporary researches of various types. The course allows students to apply knowledge of the theory of literature to the historical forms of Russian literature.", "et": "Seminar tutvustab vene kirjandusteaduse traditsiooni põhimõisteid ja meetodeid, annab ülevaate kaasaegsete uuringute erinevatest tüüpidest. Kursus võimaldab rakendada kirjandusteaduse põhimõisteid vene kirjanduse tekstidel."}], "learning_outcomes": [{"en": "The student \n- knows the basic concepts of literary studies and is able to understand academic texts in Russian, \n- applies theoretical concepts in the field of Russian literature and is able to conduct academic discussions in Russian,\n- can differentiate and use different research methods in his / her studies,\n- applies theoretical concepts in research practice, critically evaluates their applicability in different contexts.", "et": "Üliõpilane tunneb kirjandusteadusalaseid põhimõisteid ja oskab mõista venekeelseid akadeemilisi tekste, rakendab teoreetilisi kontseptsioone vene kirjanduse alal ja suudab pidada akadeemilist arutelu vene keeles;\noskab eristada ja kasutada oma õpingutes erinevaid uurimismeetodeid; \nrakendab teoreetilisi mõisteid uurimispraktikas, kriitiliselt hindab nende kasutatavust erinevates kontekstides."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}