{"uuid": "18bb927e-e4c2-3acc-62e9-18a20edd2ba8", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-13T09:29:28", "title": {"en": "French for the Pre-intermediate Level II, A2.2 > B1.1", "et": "Prantsuse keel eelkesktasemele II, A2.2 > B1.1"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "24/25 S regular HV", "et": "24/25 K PÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "language_training": {"language": {"code": "fr", "et": "prantsuse keel", "en": "French"}, "start_level": {"code": "A2", "et": "A2", "en": "A2"}, "end_level": {"code": "B1", "et": "B1", "en": "B1"}}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "fr", "et": "prantsuse keel", "en": "French"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course presupposes the Council of Europe Level A2.\nThe course will be given in French but English might be used for specific and technical explanations in case of misunderstanding. Students are expected to speak French during the course but might use English if necessary. \nA particular focus will be given to the oral comprehension and expression. Some grammar structures will be studied as well such as the past perfect, present participle, gerund, past infinitive, conditional, present subjunctive etc.\nVarious topics related to french culture will be studied during the semester. Authentic documents will be given as much as possible, in order to familiarize students to an authentic language.", "fr": "Le prérequis pour le cours est le niveau A2 du CECR. \nLe cours sera donné en français mais l'anglais sera utilisé pour des explications et informations spécifiques en cas d'incompréhension. Les étudiants devront parler au maximum en français pendant le cours (mais l'anglais n'est pas proscrit). \nUne attention particulière sera portée sur la compréhension et l'expression orale. Quelques structures grammaticales seront aussi étudiées (par exemple le plus-que-parfait, le participe présent, le gérondif, l'infinitif passé, le conditionnel, le subjonctif présent, etc.).\nDivers sujets concernant la culture française seront étudiés. Les documents authentiques seront utilisés aussi souvent que possible, pour habituer les étudiants à un français authentique.", "et": "Kursusel osalemise eelduseks on Euroopa keeleõppe raamdokumendi keeleoskustase A2.\nAuditoorsed kohtumised toimuvad prantsuse keeles, äärmisel vajadusel võetakse selgituste andmisel appi inglise keel. Tudeng võiks tunnis kasutada võimalikult palju prantsuse keelt, kuid inglise keel ei ole hädaolukorras keelatud.\nPalju pööratakse tähelepanu suulisele väljendusoskusele ja suulise teksti mõistmisele. Samuti korratakse ja õpitakse mitmeid grammatikastruktuure (nt enneminevik, oleviku partitsiip, gerundium, tingiv kõneviis, subjunktiivi olevik, mineviku infinitiiv jne).\nPuudutatakse ka prantsuse kultuuriteemasid. Võimalusel kasutatakse lisaks ehtsaid keelelisi allikaid, et tudengid harjuksid autentse keelega."}, "objectives": [{"en": "The aim of the course is to develop the oral as well as the writing skills in french. Students will learn how to express themselves more fluently and will improve their comprehension of the french language.", "fr": "Le but du cours est de développer les compétences orales et écrites en français. Les étudiants apprendront comment s'exprimer de façon plus naturelle et amélioreront leur compréhension de la langue française.", "et": "Kursuse eesmärk on arendada suulist ja kirjalikku prantsuse keele oskust. Tudengid õpivad, kuidas end võimalikult loomulikult prantsuse keeles väljendada ning parendavad oma prantsuse keele mõistmise oskust."}], "learning_outcomes": [{"en": "At the end of the level, students will be able to express their opinion on simple topics and to deal with everyday life situations in french. They will be able to understand conversations about familiar topics and to identify the main points. They will also be able to have a conversation on a familiar topic with a french speaker.", "fr": "A la fin du niveau, les étudiants seront capables de donner leur opinion sur un sujet simple et de se débrouiller dans de situations de la vie de tous les jours en français. Ils pourront comprendre de simples conversations en français et en repérer les points principaux. Ils pourront aussi voir une conversation sur un sujet familier avec un locuteur français.", "et": "Kursuse läbinud tudeng on võimeline lihtsamatel teemadel prantsuse keeles arvamust avaldama ja saab argiolukordades prantsuse keelt kasutades hakkama. Tudeng mõistab lihtsamaid prantsuskeelseid vestlusi ning oskab välja tuua nende põhisisu. Samuti suudab tudeng prantsuse keelt kõneleva inimesega tuttaval teemal vestelda."}], "notes": {"et": "Äärmisel vajadusel toimub kursus kogu keeleõpperühmale e-õppe vormis. Hajatunde ei tehta.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/noustamiskeskus.\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}}, "grading": {"independent_work": {}, "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "b44d7d8a-24b0-4c0c-b60a-8f5ba63cd820", "type": "MOODLE", "code": "HVLC.03.011", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "3e8d4953-584b-62c0-a17c-40880d943e2f", "person_name": "Léa Pillot--Colin", "structural_unit": {"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true}], "assistants": ["90881785-82ac-7b5c-5f1f-8367af159574"]}, "schedule": {"weeks": {"et": "24-39"}}, "registration_info": {"audience": {}, "min_students": 15, "max_students": 20}, "parent_uuid": "8762ac69-e485-5a5d-58b9-1d718cd7252c", "parent_code": "HVLC.03.011", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}