{"uuid": "8f3f7e17-2af1-f5a2-96f0-48db46c32afe", "code": "hv-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "ESP English for Law Students I (Introduction), Level B2.1", "et": "Erialane inglise keel. Sissejuhatus õiguskeelde I, tase B2.1"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 40, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "language_training": {"language": {"code": "en", "et": "inglise keel", "en": "English"}, "start_level": {"code": "A2.1", "et": "A2.1", "en": "A2.1"}}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "During the course the students acquire some basic legal terminology, used mainly in the English legal system. Some comparisons of the terms are drawn with other legal systems. The use of legal English is practiced in professional conversations.\nMain topics:\nWhat is law? Legal systems.\nSources of law, civil and public law.\nCivil and criminal procedure.\nLawyers at work.\nLegalese, legal aid in Estonia, separation of powers.", "et": "Kursusel tutvustatakse inglise õiguskeelt, võttes aluseks Inglise õigussüsteemi põhimõisted. Võrdlused on ka teiste õigussüsteemide mõistetega. Arendatakse erialakeele kasutamist õigusalastes vestlustes ja aruteludes. \nTeemad:\nÕiguskeele olemus. Mis on õigus? Õigussüsteemid.\nÕiguse allikad. Tsiviil- ja avalik õigus.\nTsiviilmenetlus ja kriminaalmenetlus. \nJuristide töö, karjäär.\nÕiguskeel,  õigusteenused."}, "objectives": [{"en": "The aim of the course is to introduce the basic legal terminology, used mainly in the English legal system, to enable the students to recognize, understand and start using legal terms in order to build up their professional language.", "et": "Eesmärk on tutvustada inglise õiguskeelt, võttes aluseks Inglise õigussüsteemi põhimõisted. Arendada oskust tekstist leida, mõista ja kasutada õigustermineid, et panna alus erialakeelele."}], "learning_outcomes": [{"en": "Inglise keeles:\nA student who has passed the course is able to\n1. recognize and understand basic legal terms in a legal text;\n2. use legal terms and collocations in discussions and explain them (important due to difference among legal systems);\n3. identify and present relevant information in legal texts.", "et": "Kursuse läbinud üliõpilane: \n1. oskab tekstist leida õigustermineid, neist lihtsamas kontekstis aru saada;\n2. oskab erialastes diskussioonides kasutada õigustermineid ja kollokatsioone ja neid ka selgitada, mis õigussüsteemide erinevuse tõttu on hädavajalik;\n3. oskab õigusalasest tekstist leida vajalikku infot ja seda ka edastada."}], "notes": {"et": "1. Kontrolltöö: keeleline korrektsus, õigusterminite tundmine, oskus termineid inglise keeles selgitada, loovtöö vastavus teemale ja akadeemilise kirjutamise reeglite järgimine (vähemalt 51% õigeid vastuseid).\n2. Kaks õigusalast esseed: keeleline korrektsus, õigusterminite ja kollokatsioonide kasutamine kontekstis, teema ja sisu vastavus, akadeemilise kirjutamise reeglite järgimine. Valdkonnad: õigussüsteemid, õigusharud, tsiviil- ja kriminaalmenetlus, kohtud, kuritegude liigitus, vaidluste alternatiivne lahendamine; õigusharidus.\n3. Õigusalane vestlus: keeleline korrektsus, teema loogiline esitamine ja vastavus ülesandele, õpitud terminite ja kollokatsioonide kasutamine kontekstis, olulise info leidmine ja korrektne esitamine iseseisvalt ettevalmistatud kohtulahendi refereerimisel. Lahendi tõlkimisel kasutada erialatermineid.\n4. Osalemine praktikumides on kohustuslik (90%).  Kui üliõpilane puudub rohkem kui kahest praktikumist (s.t rohkem kui 4 tundi), mis on mõeldud tervele rühmale, siis tuleb tal aine uuesti läbida. \nKodulugemist vastatakse individuaalselt vastavalt kokkulepitud graafikule, siis osalevad ainult registreeritud.\nÜliõpilane osaleb keelepraktikumis aktiivselt ja valmistub igaks tunniks. See on üks n.n jooksva arvestuse tingimus."}}, "grading": {"independent_work": {"et": "Erialaste tekstide lugemine ja tõlkimine, terminite leidmine ja nende selgitamine ja omandamine, valmistumine diskussioonideks ja kommentaarideks auditooriumis, õigusalaste esseede kirjutamine, EK kaasuse ettevalmistamine vestluseks (case brief)."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö (vähemalt 51% õigeid vastuseid annab positiivse soorituse) põhineb materjali lk 1-56: keeleline korrektsus, õigusterminite tundmine, oskus termineid inglise keeles selgitada; loovtöö vastavus teemale, mõtted on seostatud ning arusaadavad, loogiline ülesehitus; korrektses vormistuses akadeemilise kirjutamise reeglite järgimine.\nThe written test is based on the materials on pages 1-56 and should be linguistically correct and legal terms professionally explained with some examples added. (51% is the pass mark). A short essay must be written following the rules of academic writing, and be well structured and logically built up, relevant to the topic."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Õigusalane vestlus, mis põhineb Euroopa Kohtu kaasusel. Nõutud on keeleline korrektsus, teema loogiline esitamine ja vastavus ülesandele (case brief), õpitud terminite ja kollokatsioonide kasutamine kontekstis, olulise info leidmine ja korrektne esitamine iseseisvalt ettevalmistatud kohtulahendi refereerimisel. Kaasuse tõlkimisel kasutada erialatermineid.\nConversation needs to be based on the reading assignment - the Judgment of the ECJ (case brief). It must be logically built up and linguistically correct so that mistakes do not cause misunderstandings. Legal terms and collocations should be used in context while briefing the case, and important legal information presented in an organised manner."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "due_date": "2017-09-18", "description": {"et": "Kaks õigeaegselt esitatud õigusalast esseed pikkusega kumbki 150 sõna. Nõutav on keeleline korrektsus, mis ei tekita arusaamatusi; õigusterminite ja kollokatsioonide kasutamine kontekstis, teema ja sisu vastavus, mõtted on seostatud ja arusaadavad ning järeldus põhjendatud, vormistusel akadeemilise kirjutamise reeglite järgimine. \nValdkonnad: õigussüsteemid, õigusharud, tsiviil- ja kriminaalmenetlus, kohtud, kuritegude liigitus, vaidluste alternatiivne lahendamine; õigusharidus.\nTwo essays, each of 150 words, will be passed when the rules of academic writing are followed. The essays should be logically built up and linguistically correct so that mistakes do not cause misunderstandings, and the content should be relevant to the topic.  Legal terms and collocations must be used in context, conclusions should be made and legal information presented in an organised manner. Topics concern legal systems, civil and criminal procedure, courts, classification of offences, ADR, and legal education."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Suuline arvestus on õigusalane vestlus õppejõu poolt antud teemal. Nõutud on keeleline korrektsus, sisu vastavus teemale, teema loogiline esitamine, õpitud terminite ja kollokatsioonide kasutamine kontekstis. Eraldi märkida välja kümme antud teema kohta käivat õigusalast põhiterminit ja neid inglise keeles selgitada.\nOral prelim is a conversation on a legal topic provided by the lecturer. Legal terms and collocations are used in the context and legal information should be presented in an organised manner. Students have to put down ten to twelve  legal terms relevant to the topic, use them in the conversation and be able to explain them in English."}}], "grade_preconditions": {"et": "1.Osavõtt õppetööst vähemalt 90% ulatuses.\nOsalemine keelepraktikumides on kohustuslik.  Kui üliõpilane puudub rohkem kui kahest praktikumist (s.t rohkem kui 4 tundi), mis on mõeldud tervele rühmale, siis tuleb tal aine uuesti läbida.\nParticipation in language seminars at least 90%.\nEvery student participates actively in language seminars and needs to be prepared for every seminar. When a student is absent from more than 2 seminars, meant for the whole group, he has to retake the course.\n2.Kontrolltöö (51% õigeid vastuseid) positiivne sooritamine.\nPassing the test with at least 51% correct answers.\n3.Esseede (2) õigeaegne esitamine (essee positiivne sooritamine vt hindamiskriteeriume).\nEssays (2) are submitted on time and must be passed. (see hindamiskriteeriumid) See: criteria.\n4.Aktiivne vestlustes osalemine, koduste ülesannete ettevalmistamine.\nÜliõpilane osaleb keelepraktikumis aktiivselt ja valmistub igaks tunniks. See on üks nn jooksva arvestuse tingimus \nEvery student participates actively in language seminars and needs to be prepared for every seminar. It is part of the so-called continuous assessment\n5.Kodulugemise vastamine.\nKodulugemist (case brief) vastatakse individuaalselt vastavalt kokkulepitud graafikule, siis osalevad ainult registreeritud.\nCase brief is answered according to the individuaal schedule."}, "grade_evaluation": {"et": "Arvestus saadakse kõigi tingimuste täitmisel: kontrolltöö positiivse sooritamise, kodulugemise õigeaegse vastamise, esseede nõuetekohase esitamise, koduste ülesannete täitmise, iseseisva töö, vestluste, aktiivse loengutes osalemise ja suulise arvestuse põhjal.\nThe course is passed when all the requiremnts have been met, i.e. test and essays(2)  passed, case briefed, oral prelim passed, seminars actively participated."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga nädala jooksul peale auditoorse töö lõppu.(viimane kuupäev 23.nov. 2018.)\nRetaking is possible upon the agreement with the lecturer during a week after the end of classes. The deadline is 23 November 2018."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "L. Soobik . English for Law Students. Juura Press 2013\nValik tekste õpikutest :\nNick Brieger.  Test Your Professional English. Law 2002\nAmy Krois-Lindner, Matt Firth.  Introduction to International Legal English. CUP 2008\nGillian D. Brown, Sally Rice. Professional English in Use Law. CUP 2007\nTracy Page, Alan Jones.  AQA Law GCSE. OUP 2014\nRichard Powell.  Law Today.  Longman 1993 \nGeoffrey Rivlin.  Understanding the Law. OUP 2004", "recommended_materials": "http://curia.europa.eu\nEnglish-English Law Dictionary"}, "participants": {"lecturers": [{"person_uuid": "ddf7e3f4-1d34-9d52-b9ce-c51aa64b1453", "person_name": "Liina Soobik", "structural_unit": {"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"b rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "a rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}], "study_groups": [{"uuid": "926b29c2-bbde-f5d6-9490-dbe7f0733ba4", "code": "b rühm", "max_size": 20}, {"uuid": "414df7b8-c0cd-8a01-125e-39870bbc40d4", "code": "a rühm", "max_size": 20}]}, "schedule": {"weeks": {"et": "2-11"}, "entries": [{"time": "2018-09-10", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "2.nädal(1.nädal inglise keele praktikumi) Sissejuhatus, nõuded. Õiguskeele olemus, akadeemilise kirjutamise reeglid\nMis on õigus? Õigussüsteemid.\nWeek 2 (week 1 for English)   Introduction, requirements. Rules of academic writing. What is  law? Legal systems."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "3.nädal   Õiguse allikad. Tsiviil ja avalik õigus.\nWeek 3           Sources of law, civil and public law."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "4.nädal   Õigussüsteemid, Juristide töö, karjäär.\nWeek 4    Legal systems; Lawyers at work"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "5.nädal  Õiguskeel , kohtute klassifikatsioon          . \nWeek 5    Legalese , classification of courts       ."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "6.nädal  Kohtute klassifikatsioon , menetlus \nWeek 6   Classification of courts, proceedings     ."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "7.nädal   Tsiviilmenetlus ja kriminaalmenetlus\n Week 7    Civil and criminal procedure"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "8.nädal  Pretsedendiõigus;Erikohtud. \nWeek 8     Case law;Tribunals"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "9.nädal     Arbitraaz   Kontrolltöö materjali lk 1-56 põhjal\nWeek 9    Arbritation; Written test on materials pp 1-56"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "10.nädal   Vaidluste alternatiivne lahendamine, õigusteenused. \n Week 10      ADR, legal services\n  Õigusriik, Euroopa Kohtu lahendite kokkuvõtted\n  State governed by the rule of law , Case briefs"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "11.nädal  Võimude lahusus  Projekt: õigusteenused (B 2 keeletasemega rühmas).\nWeek 11       Separation of powers      Project:  provision of legal services  ( in B 2 groups)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "11.nädal   Suuline arvestus \n Week 11        oral prelim.\n\nMärkus: Plaanis võib olla muutusi vastavalt rühma keeletasemele.\nThere may be changes in the schedule due to the language level of the group."}}]}, "registration_info": {"audience": {}, "min_students": 15, "max_students": 40}, "parent_uuid": "51f7cabc-cb67-057c-03a1-c10d61ea3cda", "parent_code": "HVLC.01.017", "parent_credits": 3, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}