{"uuid": "882904b3-dbf5-e8ea-f422-25154810ae57", "code": "HVLC.04.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "The Main Course of German Expression", "et": "Saksa keele suuline ja kirjalik väljendusõpetus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC04", "structural_unit_name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC04", "name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course deals with academic topics according to the level C1 on of the CEFR. All four skill (reading, listening, writing, speaking) will be trained, but there is a emphasize on oral and written skills. The course follows the idea of active learning, which means the students particpate activly in the course by dealing with tasks foremost in partner and groups. \nIn order to do that the students are asked to prepare for each lesson (reading texts, listening to audio-files, make a research on-line and so on).", "et": "Kursus koosneb 3 osast: Esmalt koostatakse meeskonnatöös üht Saksamaa Liitvabariigi liidumaad tutvustav video, posterettekanne vms, mida esitletakse laiemale publikule märtsis Saksa Kultuuri Instituudis kultuurifestivali \"Saksa kevad\" raames. Seejärel keskendutakse tekstilingvistilise analüüsi meetodile. Kursuse käigus tutvustab iga üliõpilane lühiettekandes üht aastatel 2010-2020 ilmunud saksakeelset teost ning selles esinenud sõnavara."}, "objectives": [{"en": "The purpose of the course is to improve the oral and written skills of the students for academic purposes.", "et": "Ainekursuse eesmärgiks on üliõpilaste suulise ja kirjaliku väljendusoskuse ning meeskonnatöö oskuse arendamine."}], "learning_outcomes": [{"en": "The student\n1.\tfinds information by digital means and assesses its relevance and reliability;\n2.\tcompiles a poster/vlog/ video, etc. in one of the States of the Federal Republic of Germany, using technological means and digital environments for cooperation and content creation;\n3.\tevaluates his or her own and peers' contribution and development in teamwork;\n4.\tapply techniques that support the presentation when making a presentation;\n5.\tanalyzes fictional text based of the principles of hermeneutics in the field of linguistic text analysis method;\n6.\tknows and uses different ways of working with text and different mnemonic techniques to support his/her learning;\n7.\tknows and uses monolingual electronic dictionaries (dwds.de, duden.de) and language corpora (deSkell) to specity language use:", "et": "Üliõpilane\n\n1) leiab digivahendite abil infot ning hindab selle asjakohasust ja usaldusväärsust;\n\n2) koostab meeskonnatöös postri/vlogi/video vms ühe Saksamaa Liitvabariigi liidumaa kohta, kasutades koostööks ja sisuloomeks tehnolooogilisi vahendeid ning digikeskkondi;\n\n\n3) hindab oma ja kaaslaste panust ning arengut meeskonnatöös;\n\n4) rakendab ettekannet tehes esinemist toetavaid võtteid;\n\n5)  analüüsib ilukirjanduslikke tekste hermeneutika põhimõtetest lähtuvalt lingvistilise tekstianalüüsi \nmeetodiga;\n\n6) tunneb ja kasutab erinevaid tekstiga töötamise viise ja mnemotehnilisi võtteid\noma õppimise toetamiseks;\n\n7) teab ja kasutab ükskeelseid elektroonilisi sõnaraamatuid (dwds.de, duden.de) ja keelekorpusi (deSkell) keelekasutuse täpsustamiseks,"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}