{"uuid": "866c5f7e-0894-f58d-49b5-70a74ea249fc", "code": "HVLC.03.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "French for the Advanced Level I, B2.1 > B2.2", "et": "Prantsuse keel kõrgtasemele I, B2.1 > B2.2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC03", "structural_unit_name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC03", "name": {"en": "Department of Romance Studies", "et": "romanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "fr", "et": "prantsuse keel", "en": "French"}, "start_level": {"code": "B2", "et": "B2", "en": "B2"}, "end_level": {"code": "C1", "et": "C1", "en": "C1"}}}, "overview": {"description": {"en": "The course presupposes the Council of Europe Level A 2.1/A 2.2, or a language experience acquired during a (students' exchange) stay in a French-speaking university\nThe subjects treated during  the course will be chosen according to the current events in France. The movies included into the course as an audio-visual aid for further discussions, will also be used to practice film analysis.\nContents by general topics:\n- General survey of French media: television, main daily and weekly newspapers\n- Culture and society: current tendencies\n- French cinema: movies and short films' analysis will be based on didactical materials (a set of different questions and tasks related to the film) available on the net.\n- French language in evolution\n- Means for developing argumentation skills:  how to construct a coherent text.", "et": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel B 2.1/B 2.2 või Erasmus programmi raames vahetusüliõpilasena saadud kogemused prantsuskeelses ülikoolis.\nSemestris käsitletav teemade valik on aktuaalne. See lähtub Prantsuse ajakirjandusest, nii jooksvatest ajakajalistest kui ka temaatilistest ajakirjanumbritest. Kursuse arutelude aluseks on ka ühiselt vaadatavad filmid, millega kaasneb filmianalüüs.\nTeemad:\n- Ülevaade prantsuse meediast: televisioon, tähtsamad päeva- ja nädalalehed\n- Kultuur ja ühiskond: aktuaalsed tendentsid \n- Prantsuse kino: täispikkade ja lühifilmide vaatamine ja analüüsimine nende filmide jaoks koostatud pedagoogiliste materjalide põhjal; sünopsise ja stsenaariumi mõistmine ja koostamine, kriitiliste hinnangute andmine \n- Prantsuse keele arengutendentsid\n- Argumenteerimisoskuse arendamine: teksti ülesehitus ja loogilised seosed"}, "objectives": [{"en": "The course for advanced learners aims to enlarge the students' vocabulary and knowledge of grammar and to develop their reading, conversational and listening skills, while focusing on the training of oral communication, as the course is carried out by a native speaker.", "et": "Kõrgema taseme kursus, mille käigus arendatakse vestlus-, kuulamis-, lugemis- ja kirjutamisoskust ning käsitletakse raskemaid keelestruktuure, kusjuures põhirõhk on prantsuse keelt emakeelena kõneleva õpetaja poolt läbi viidavais tundides suuliste osaoskuste treeningul."}], "learning_outcomes": [{"en": "By the end of the course the student will have improved his oral expression skills towards more clarity and fluency, has enriched his vocabulary. The student has also developed his comprehension of written and spoken texts, their use of language has improved in terms of rhythm and phonetics.", "et": "Kursuse läbinud üliõpilane on õppinud end väljendama selgemini, sõnavara ja väljendite poolest rikkamas keeles, mõistab paremini nii suulist kui kirjalikku teksti. Üliõpilase keelekasutus on arenenud nii kõnerütmi kui foneetika seisukohalt."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}