{"uuid": "a2b14725-b515-9235-b771-759614480561", "code": "HVLC.04.049", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical German Language B2.1 > B2.2", "et": "Praktiline saksa keel B2.1 > B2.2"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC04", "structural_unit_name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC04", "name": {"en": "Department of German Studies", "et": "germanistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"de": "Auf der Basis von Lese- und Hörtexten und vielseitigen Übungen erhalten die Studierenden die Möglichkeit, ihre sprachlichen Fertigkeiten (Sprechen, Lesen, Hören, Schreiben) zu vertiefen und Wissen über verschiedene grammatikalische Aspekte der Deutschen Sprache zu erlangen. Der Kurs basiert auf Ansätzen des kooperativen autonomen und handlungsorientierten Lernen und bezieht auch Konzepte der Mehrsprachigkeitsdidaktik mit ein. \nInhaltlich werden sowohl Alltags- als auch akademische Themen bearbeitet.", "en": "On the basis of written and audio-texts the students is provided with a rich input and a wide range of different exercises to improve reading, listening, speaking and writing skills and to gain knowledge about different grammatical aspects. Teaching methods pursue co-operated, autonomous and active learning and use multilingual approaches.\nRegarding subject matter the course covers both daily and academic topics.", "et": "Lugemis- ja kuulamistekstide ning mitmekesiste harjutuste abil luuakse (või täiendatakse) keeleoskust (rääkimine, lugemine, kuulamine, kirjutamine), omandatakse grammatilised põhialused ja püütakse saavutada vähemalt argipäeva keeleoskuse ning sõnaraamatuga lugemise tase. Käsitletakse nii igapäevaelu kui ka akadeemilisi teemasid."}, "objectives": [{"de": "Das Hauptaugenmerk des Kurses liegt auf der Erweiterung und Vertiefung der mündlichen und schriftlichen Ausdrucksfähigkeit im Deutschen. Darüber hinaus werden die  rezeptiven Fertigkeiten (Lesen und Hören) geübt, um  Lese- und Hörtexte mit fachspezifischen Inhalt verstehen zu können. Des Weiteren üben die Studierenden ihre Meinungen und Gedanken frei zu äußern und mit anderen Kursteilnehmern zu kooperieren. Neben den sprachpraktischen Zielen sollen Studierende in diesem Kurs in die Lage versetzt werden, die deutsche Sprache linguistisch analysieren zu können. Das sprachliche Zielniveau des Kurses orientiert sich an der Stufe B2 des europäischen Referenzrahmens.", "en": "A main objective of this course  is the improvement and expansion of means of expression in speaking and writing. A second focus is on the training of skills needed to understand written and audio texts with subject-specific content. Moreover the student will practice to speak freely in order to express opinions or co-operate with other course participants. Beside this practical objectives the course fosters the analytic approach to linguistic elements. The target level of the course corresponds to the level B2 of the CER.", "et": "Ainekursuse eesmärgiks on üliõpilaste lugemisvilumuse ja keeleoskuse arendamine. Harjutatakse retseptiivseid oskusi (lugemine, kuulamine), et suuta mõista erialaspetsiifilisi lugemis- ja kuulamistekste. Üliõpilased õpivad vabalt väljendama oma arvamusi ja mõtteid ning koopereeruma teiste õppijatega. Praktilise keele omandamise kõrval õpitakse keelt ka lingvistiliselt analüüsima. Kursuse keeletase vastab B2 tasemele."}], "learning_outcomes": [{"de": "Die Studierenden verfügen über Hör- und Lesefertigkeiten, um die Hauptaussagen komplexer Texte mit fachspezifischen Inhalt verstehen zu können. Die Studieren werden zudem in der Lage sein, ausführlich ihre Meinungen und Gedanken zu einer Vielzahl verschiedener Themen und Problemen auszudrücken. Außerdem können die Studierenden sich aktiv an Gesprächen beteiligen.", "en": "- The student will be able to understand (by reading or listening) the main ideas of complex texts with academic/ subject specific content. \n- The student will also have the skills to express his/ her own opinion in a detail and to present different arguments for a wide range of issues and topics. Moreover the student will be able to participate in conversations and make himself /herself understood.\n- The student will be able to understand and use Microsoft Word for formatting and correcting texts \n- The student will be able to talk about his or her own culture\n- The student will be able to work efficiently in a team", "et": "Üliõpilased omandavad kuulamis- ja lugemisoskuse, mis aitab mõista keerulisemaid erialaspetsiifilisi tekste. Nad suudavad väljendada oma arvamusi ja mõtteid erinevate teemade ja probleemide kohta ning osaleda aktiivselt aruteludes."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}