{"uuid": "d9f83bb7-bee8-6b96-7e66-f24c18461995", "code": "HVLC.01.075", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Traineeship in English Language and Literature", "et": "Inglise keele ja kirjanduse eriala praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVLC01", "structural_unit_name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVLC01", "name": {"en": "Department of English Studies", "et": "anglistika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVLC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "We offer four options for completing the training: cultural mediation, organizing events, traineeship at schools, assisting at university. The traineeship can be completed individually or in teams.  \n\n1. Cultural mediation: creation of field specific texts (e.g. Wikipedia articles, blog posts, etc.) related to prominent figures from English-speaking countries. (Lecturers: Pilvi Rajamäe, Eva Rein) \n\n2. Organizing events: participation in the organizing committees for field specific olympiads, conferences, seminars, cultural events, and other events. (Lecturers: Katiliina Gielen, Jane Klavan, Raili Marling) \n\n3. Traineeship at schools: application of field specific knowledge and skills in supporting and guiding language learners at schools, organizing events, activities and hobby groups at schools, assisting teachers. (Lecturers: Anneli Sigus, Ülle Türk, Natalja Zagura)  \n\n4. Assisting at university: assisting the lecturers at the English department in teaching-related activities (giving feedback, creation of materials, tutoring, supporting group work, etc.) and research (data collection, data analysis, etc.). (Lecturers: Djuddah Leijen, Liina Tammekänd, Reeli Torn-Leesik)", "et": "Pakume nelja laiemat praktika teemat: kultuurivahendus, ürituste korraldamine, praktika koolides, assisteerimispraktika. Praktikat saab teha individuaalselt või rühmades.   \n\n1. Kultuurivahenduse praktika: keele-, kirjanduse-, kultuuri- ja ühiskonnategelastega seotud erialaste tekstide koostamine, nt Wikipedia artiklid, blogipostitused jms. (Vastutavad õppejõud: Pilvi Rajamäe, Eva Rein) \n\n2. Ürituste korraldamine: erialaste olümpiaadide, konverentside, seminaride, kultuuriürituste (tähtpäevad, filmiõhtud) jms korraldusmeeskonnas osalemine. (Vastutavad õppejõud: Katiliina Gielen, Jane Klavan, Raili Marling) \n\n3. Praktika koolides: inglise keele ja ingliskeelse kultuuriruumi alaste teadmiste rakendamine keeleõppijate toetamisel ja suunamisel, koolides ingliskeelse kultuuriruumiga seotud ürituste korraldamine, huviringide juhendamine, õpetajate assisteerimine. (Vastutavad õppejõud: Anneli Sigus, Ülle Türk, Natalja Zagura) \n\n4. Assisteerimispraktika: anglistika osakonna õppejõudude abistamine õppetöö läbiviimisel (iseseisvate tööde tagasisidestamine, materjalide ettevalmistamine, konsultatsioonid, rühmatööde toetamine, jne.) ja teadustöö tegemisel (andmete kogumine, sisestamine, analüüsimine, jne.). (Vastutavad õppejõud: Djuddah Leijen, Liina Tammekänd, Reeli Torn-Leesik)"}, "objectives": [{"en": "The aim of the traineeship is to provide the students with an opportunity to apply their field specific knowledge and skills in extracurricular activities by developing their written and spoken communication in English, co-operative skills, entrepreneurship, time management, self-regulation and creativity.", "et": "Praktika eesmärgiks on anda võimalus üliõpilastel oma erialateadmisi ja -oskusi rakendada õppetöövälistes tegevustes arendades seejuures võõrkeelset suhtlust kõnes ja kirjas,  meeskonnatööoskust, ettevõtlikkust, aja planeerimist, enesejuhtimist ja loovust."}], "learning_outcomes": [{"en": "On successful completion of the traineeship, the student: ", "et": "Kursuse edukalt läbinud üliõpilane: "}, {"en": "- applies their field specific knowledge and skills in completing practical tasks ", "et": "- kasutab erialateadmisi ja -oskusi praktiliste ülesannete lahendamiseks "}, {"en": "- communicates in appropriate, field specific English ", "et": "- väljendab ennast kirjalikult ja suuliselt erialases võõrkeeles "}, {"en": "- collaborates with others; manages time, themselves and other people ", "et": "- teeb koostööd, planeerib aega, juhib ennast ja teisi "}, {"en": "- develops their creativity and entrepreneurship", "et": "- arendab enda loovust ja ettevõtlikkust"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}