{"uuid": "b13c107a-a92a-1fc3-7a05-883d1dda72a7", "code": "HVUS.06.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Seminar on Oriental Religions", "et": "Orientaalusundite seminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVUS06", "structural_unit_name": {"en": "Chair of Comparative Religious Studies", "et": "võrdleva usuteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVUS06", "name": {"en": "Chair of Comparative Religious Studies", "et": "võrdleva usuteaduse õppetool"}, "phone": "+372 737 5965", "address": "Ülikooli 18 - 308\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18 - 308", "zip": "50090", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVUS"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Depending on the specific Study Year, the seminar gives an intensive and comparative overview about one or more of the South West Asian classic non-Christian religion (Islam), or, about the classic religions of China and Japan (Taoism, Confucianism, Buddhism, Shintoism), or, about India's classic dharma religions (Hinduism, Buddhism, Jainism, Sikhism). The seminar is based on the independent work with the obligatory literature, presentations, and on the discussions. Precondition of the passing of exam is an active participation in the seminar and a paper.", "et": "Sõltuvalt konkreetsest õppeaastast, seminar annab süvendatud ja võrdleva ülevaate kas ühest Ees-Aasia klassikalisest mittekristlikust religioonist (islam), või Hiina ja Jaapani klassikalistest religioonidest (taoism, konfutsianism, budism, šintoism), või India klassikalistest religioonidest (hinduism, budism, džainism). Aine põhineb iseseisval tööl kohustusliku kirjandusega ja seminariaruteludel. Eksami sooritamise eelduseks on aktiivne osavõtt seminaridest ja kirjalik referaat."}, "objectives": [{"en": "The aim of the course for Fall 2020 is to give a more systematic overview about the religions of a specific region of the world and to reinforce and intensify knowledge about the great world religions today. This course will be focused on the religious traditions of South Asia, typically referred to as \"Dharma Traditions\": Hinduism/Vedanta; Jainism; Buddhism; and Sikhism. Special topics will include Goddess spirituality/divine feminine and social movement leaders such as Mahatma Gandhi, Dr BR Ambedkar, Vandana Shiva, and Arundhati Roy.", "et": "Kursuse eesmärgiks on anda süsteemne ülevaade maailma konkreetse piirkonna religioonidest ning kinnistada ja süvendada teadmisi tänapäeva suurtest maailmareligioonidest."}], "learning_outcomes": [{"en": "The student will gain a more systematic knowledge about the religions of a specific region of the world and, also, about the great world religions today. He/she will gain competency and mastery to relate what they learn, in general, with the larger context of religious history; also, will put it to use in studying of the other disciplines of religious history in the future. The student will also be better prepared to engage personally, intellectually, and professionally in meaningful ways with South Asian colleagues and contexts.\n\nThis course also gives the student vital experience in essential skills used routinely in academic and professional life in the engaging format of the seminar course. Students will be able to set up the work flow and formal processes for their program research theses by discerning course material relevant to their research interests.", "et": "Üliõpilasel on süsteemsemad teadmised maailma konkreetse piirkonna religioonide ja tänapäeva suurte maailmareligioonide kohta. Ta oskab neid teadmisi seostada religioonide ajaloo laiemas kontekstis ning rakendada võrdleva religiooniloo ainete edasisel õppimisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}