{"uuid": "de226b38-6ee1-c1b5-ad20-04193c0b8385", "code": "HVUS.03.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Projects Practice", "et": "Magistriprojekti praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVUS03", "structural_unit_name": {"en": "Chair of Practical Theology", "et": "praktilise usuteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVUS03", "name": {"en": "Chair of Practical Theology", "et": "praktilise usuteaduse õppetool"}, "address": "Ülikooli 18 - 312\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18 - 312", "zip": "50090", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVUS"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Supervised practice under the University and the practice base supervision in a company associated with the master's project. Students design individual courses in collaboration with their supervisors, based on the topics of their master's project, as well as on other professional needs and interests.", "et": "Superviseeritud praktika ülikoolipoolse ja praktikabaasipoolse praktikajuhendaja juhendamisel magistriprojektiga seotud ettevõttes. Üliõpilane kujundab aine sisu koostöös juhendajaga lähtudes oma magistriprojekti teemast ning erialastest eesmärkidest ja vajadustest."}, "objectives": [{"en": "The aim of the master's project practice is to apply the acquired theoretical knowledge in the practice associated with the master's thesis. The practice takes place outside the faculty in the field in which a person conducts a master's thesis (cultural, social, theological, translation, education or entrepreneurship).", "et": "Magistriprojekti  praktika eesmärgiks on rakendada omandatud teoreetilisi teadmisi magistriprojektiga seotud praktikas. Praktika toimub väljaspool teaduskonda valdkonnas, milles inimene sooritab magistriprojekti (kultuuriline, sotsiaalne, teoloogiline, tõlke-, haridus- või ettevõtlus)."}], "learning_outcomes": [{"en": "Through the Master's Project Practice, the student will get an overview of the place where the master's project will be delivered and the work culture of the enterprise. The student integrates into the work environment and acquires work and communication experiences. The student has a creative attitude to the role in the business environment and finds a place in the team and contributes to the work.", "et": "Magistriprojekti praktika kaudu saab üliõpilane ülevaate magistriprojekti sooritamise kohast ja antud ettevõtte töökultuurist. Üliõpilane integreerub töökeskkonda ja omandab töö- ja suhtlemiskogemusi. Üliõpilane suhtub loovalt oma rolli ettevõtluskeskkonnas ja leiab oma koha töökollektiivis ning annab oma panuse töösse."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}