{"uuid": "5ed93aa3-9dc6-6b6d-952d-f0d57b199de5", "code": "HVUS.05.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of Ancient Israel and the New Testament Era, Its Religion and the Life of Jesus", "et": "Vana-Iisraeli ning algkristluse aja- ja usundilugu"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVUS05", "structural_unit_name": {"en": "Chair of the Old Testament and Semitic Studies", "et": "Vana Testamendi ja semitistika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVUS05", "name": {"en": "Chair of the Old Testament and Semitic Studies", "et": "Vana Testamendi ja semitistika õppetool"}, "address": "Ülikooli 18 - 309\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18 - 309", "zip": "50090", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVUS"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The main problems and methods of the history of research of the history and religion history of Israel will be studied, also the background of Israelite religion, its genesis and basic structures, the main periods and events of the history of Israel at the end of the 2nd Mill. and in the 1st Mill. B.C., and the problems of Biblical archaeology. Historical overviewof the Palestine in the 1. century A.D. The main movements within Judaism. The historical and choronological problems of the life of Jesus. The main events in the life of Jesus and his main teachings are explained.", "et": "Kursus käsitleb Vana-Iisraeli aja- ja usundiloo  ja uurimismeetodeid, Iisraeli usundi tausta, tekkelugu ja põhijooni, põhilisi sündmusi ja perioode ajavahemikus 2. e.m.a. aastatuhande lõpp kuni 1. e.m.a. aastatuhande lõpp ning piibliarheoloogia probleeme. Ajalooline ülevaade 1. m.a.j. sajandi Palestiinast. Juutluse põhilised rühmitused. Jeesuse elu ja ajaloolisuse ja kronoloogia probleemid. Selgitatakse Jeesuse elu põhilisi sündmusi ja õpetuslikke peateemasid."}, "objectives": [{"en": "The aim is to study the history and religion history of Israel in the Old Testament times, to understand the genesis of the Old Testament, and to study the research history and its methods;  to give a basic knowledge about the historical situation and the main points of the life of Jesus and of the historical and theological problems related to it.", "et": "Õppida tundma Vana Testamendi aegse Iisraeli aja- ja religioonilugu, mõista seeläbi Vana Testamendi tekkelugu ning õppida tundma uurimislugu ja meetodeid. Anda baasteadmised kristluse tekke ajastuloolise korra ja kristluse keskse isiku elu kohta ja sellega seotud ajaloolistest ja teoloogilistest probleemidest."}], "learning_outcomes": [{"en": "The student will\n- know the main directions, representatives and contemporary problems and methods of the history of research of the history and religion history of Israel;\n- know the background of Israelite religion, its genesis and basic structures;\n- know the main periods and events of the history of Israel at the end of the 2nd Mill. and in the 1st Mill. B.C.;\n- know the main characteristics of the Ancient Near East at the end of the 2nd Mill. and in the 1st Mill. B.C.;\n- understand the basics and the methods of Biblical archaeology;\n- find the relevant lexical and scholarly literature and formulate the conclusions on their basis;\n- the student has a comprehensive overview of the Palestine in the 1. century A.D. and the main movements within Judaism of the time;\n- the student knows the main events of the life of Jesus and his main teachings.\nSisu lühikirjeldus", "et": "Üliõpilane\n- tunneb Iisraeli aja- ja religiooni uurimisloo tähtsamaid suundi, esindajaid ja kaasaegseid probleeme ning meetodeid;\n- tunneb Iisraeli usundi tausta, kujunemislugu ja põhivorme;\n- teab Iisraeli ajaloo põhiperioode ja tähtsamaid sündmusi 2. at lõpus ja 1. at eKr;\n- tunneb üldjoontes Vana Lähis-Ida tausta 2. at lõpus ja 1. at eKr;\n- mõistab üldjoontes piibliarheoloogia iseloomu ning meetodeid;\n- leiab olulisemat teatme- ja teaduskirjandust ning sõnastab selle põhjal järeldusi;\n- üliõpilasel on ülevaade I sajandi Palestiinast ja juutluse põhilistest rühmitustest; \n- ta tunneb Jeesuse elu põhilisi sündmusi ja õpetuslikke suundumusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}