{"uuid": "f807629c-3039-26cb-5242-dd1544f6ddaa", "code": "HVUS.00.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Special Seminar in Religious Studies and Theology", "et": "Religiooniuuringute ja teoloogia eriseminar"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVUS", "structural_unit_name": {"en": "School of Theology and Religious Studies", "et": "usuteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVUS", "name": {"en": "School of Theology and Religious Studies", "et": "usuteaduskond"}, "email": "strukt.usuteaduskond@lists.ut.ee", "phone": "+372 737 5300", "webpage_url": "https://usuteaduskond.ut.ee", "address": "Ülikooli 18\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "50090", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 3, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course is planned in a flexible manner, depending on the particular academic schedules and the concrete needs of the student. The options include: arrangement of specific seminars, or taking courses in other levels or in other disciplines, or attending courses offered by guest lecturers, or attending university courses abroad that focus on a specific topic or problem.", "et": "Kursus sisustatakse paindlikult, lähtudes iga õppeaasta eripärast ja konkreetse doktorandi vajadustest. Võidakse korraldada eraldi kursusi, arvestada osalemist teiste õppeastete või erialade kursustel või arvestada doktorandi poolt sooritatud külalisõppejõu kursust või välisülikoolis sooritatud spetsiifilist teadusteemat või probleemi käsitlevat ainet."}, "objectives": [{"en": "The purpose of the course is to introduce the doctoral student with the fresh results in his/her research discipline.", "et": "Kursuse eesmärgiks on tutvustada doktorandile tema eriala uuemaid uurimistulemusi."}], "learning_outcomes": [{"en": "Students who have completed the course:", "et": "Kursuse läbinud doktorant:"}, {"en": "1) are informed of philosophical, historic-political and cultural development trends in religion and theological thought;", "et": "1)  omab laialdast ülevaadet religiooni ja teoloogilise mõtlemise filosoofilistest, ajaloolis-poliitilistest ja kultuurilistest arengutendentsidest;"}, {"en": "2) are knowledgeable of different concepts of scientific study of religion and are able to highlight similarities and differences between them;", "et": "2)  omab ülevaadet religiooni teadusliku uurimise erinevatest kontseptsioonidest ning oskab esile tuua nende sarnasusi ja erisusi;"}, {"en": "3) understand interdisciplinary connections between religioos studies/theology and related disciplines, and are able to conceptualise such connections and relations;", "et": "3)  vaatleb religiooniuuringuid/teoloogiat koos teiste lähedaste distsipliinidega ning sõnastab nende interdistsiplinaarsed seosed ja suhted;"}, {"en": "4) are able to see possibilities of application of their research results;", "et": "4)  oskab adekvaatselt valida religiooniuuringute/teoloogia teoreetiliste seisukohtade rakendusi sõltuvalt praktilistest vajadustest;"}, {"en": "5) are able to present reasoned arguments and research results in professional domestic and international research communications;", "et": "5)  suudab selgelt väljendada oma seisukohti ning argumenteerida religiooniuuringute/teoloogia alases teaduslikus kodu- ja välismaises diskursuses;"}, {"en": "6) are able to determine imlpementation problems of diciplinary knowledge and find adequate solutions.", "et": "6)  teeb kindlaks erialaliste teadmiste rakendamisel esinevaid probleeme ja leiab neile lahendusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}