{"uuid": "0f558be5-e330-d5e6-8b9c-8dd8a1c4e1dd", "code": "HVUS.00.010", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-21T14:20:47", "title": {"en": "Teaching in a Multicultural School", "et": "Õpetamine mitmekultuurilises koolis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVUS", "structural_unit_name": {"en": "School of Theology and Religious Studies", "et": "usuteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVUS", "name": {"en": "School of Theology and Religious Studies", "et": "usuteaduskond"}, "email": "strukt.usuteaduskond@lists.ut.ee", "phone": "+372 737 5300", "webpage_url": "https://usuteaduskond.ut.ee", "address": "Ülikooli 18\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18", "zip": "50090", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Studies on intercultural differences. Intercultural communication. Multiculturalism as a fact: national and religious subcultures in Estonia (minorities living in Estonia and religions operating here) Multiculturalism in education. Bennett's development model of cultural sensitivity and its adaptation to the educational context. Problems in intercultural communication. Taking cultural and religious background into account in teaching. Multicultural and intercultural teaching. Principles and skills of intercultural teaching.", "et": "Kultuuridevaheliste erinevuste uuringud. Kultuuridevaheline kommunikatsioon. Mitmekultuurilisus kui fakt: rahvuslikud ja religioossed subkultuurid Eestis (Eestis elavad vähemusrahvused ja siin tegutsevad religioonid). Mitmekultuurilisus hariduses. Bennetti kultuuritundlikkuse arengumudel ja selle kohandamine hariduse konteksti. Probleemid kultuuridevahelises kommunikatsioonis. Kultuurilise ja usulise taustaga arvestamine õppetöös. Mitme- ja interkultuuriline õpetamine. Kultuuridevahelise õpetamise põhimõtted ja oskused."}, "objectives": [{"en": "The aim of the subject is that students become aware of the religious and cultural diversity in Estonia and develop the ability to apply the principles of culturally sensitive teaching in their teaching.", "et": "Õppeaine eesmärk on, et õppijad teadvustaksid Eestis esinevat usulist ja kultuurilist mitmekesisust ning arendaksid oskust rakendada õppetöös kultuuritundliku õpetamise põhimõtteid."}], "learning_outcomes": [{"en": "Student:", "et": "Üliõpilane: "}, {"en": "- knows the peculiarities of the larger national and religious groups represented in Estonia, is able to find the necessary information about cultural groups;", "et": "- tunneb suuremate Eestis esindatud rahvuslike ja religioossete rühmade omapärasid, oskab leida tööks vajalikku informatsiooni kultuuriliste rühmade kohta; "}, {"en": "- takes into account the cultural heterogeneity in teaching in Estonia;", "et": "- arvestab õppetöös Eestis esineva kultuurilise heterogeensusega; "}, {"en": "- recognizes the misunderstandings that arise in a multicultural environment and offers solutions to them;", "et": "- tunneb ära mitmekultuurilises keskkonnas tekkivad arusaamatused ning pakub neile lahendusi; "}, {"en": "- is able to create a learning environment that supports the involvement of the student's culture;", "et": "- oskab kujundada õppekeskkonda, mis toetab õpilase kultuuri kaasamist; "}, {"en": "- analyzes his / her intercultural teaching competence based on the development model of intercultural sensitivity", "et": "- analüüsib enda kultuuridevahelist õpetamispädevust lähtudes kultuuridevahelise tundlikkuse arengumudelist"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}