{"uuid": "f2972dcf-145c-c5be-b7f0-b23af208ebe2", "code": "HVVK.03.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice of Adventure Activities", "et": "Seiklustegevuste praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The practice is divided into experiential and theoretical sections; the latter consists of reflection and written reporting.\nExperiential section takes place in different organizations and contains:\n1.\tObservation.  Student has to get into an event or enterprise of experiential learning and, by observing the process, describe and define its structure, dynamics and main characteristics.\n2.\tParticipation.  In the framework of various events the student has to launch certain activities of adventure/gaming; as members of a team they take charge of specific tasks.\n3.\tManagement.  Student conceives and arranges an enterprise lasting more than one day, participating actively in the process from start to end.  He/she coordinates the work of a task-force and conducts ex-post analysis.\n Theoretical section of the practice contains two parts:\n1)\tReflection.  Analysis of the experience gained by participants and organizers of the enterprise; reflect on the personal lessons learned and assess the dynamics of professional development.\n2)\tReporting.  Systematise gained experience, including both stronger and weaker aspects of launched activities.  Compile a report which provides a logical and well-structured analysis of the whole practice.", "et": "Spetsialiseerumispraktika jaguneb kolme tegevuslikku ossa ja eneseanalüüsiks ning kirjalikuks aruandluseks. \n1.\tVaatluspraktika: Tutvuda, määrata ja kirjeldada vaatlustulemuste põhjal elamuspedagoogilise sündmuse, - projekti või - organisatsiooni töökorraldust ja tööiseloomu\n2.\t Osaluspraktika: praktiseerida seiklustegevusi erinevate sündmuste käigus, osaleda meeskonna liikmena ja vastutada konkreetse töölõigu korraldamise eest\n3.\t Korralduspraktika: korraldada mitmepäevane seiklustegevus, osaleda ja vastutada tööprotsessis algusest lõpuni, koordineerida meeskonnaliikmete tööd ja viia läbi refleksioon\nAruandlus ja reflektsioon: analüüsida osalejate, meeskonna ja oma tegevust seikluspraktika raames ning hinnata oma arengut seiklusjuhina\nAnalüüsida, vormistada aruandlus: esitleda ja kaitsta oma seisukohti."}, "objectives": [{"en": "The main goal is to connect pre-acquired theoretical knowledge with practice.  Acquisition of hands-on experience with activities used in youth work.", "et": "Kogemuste saamine praktiliste elamuspedagoogiliste tegevustes osalemise ja korraldamise kaudu."}], "learning_outcomes": [{"en": "The student is able to:\na) plan various experiential-learning activities considering the requirements set by real environment and educational objectives.\nb) facilitate the learning process of different youth-work target groups.\nc) notice and classify main group processes and react adequately to them.\nd) analyse activities of experiential learning from the viewpoint of  group-processes; notice manifestations of individual problems and conduct self-reflection.\ne) to facilitate teamwork and serve as team-leader.", "et": "Kursuse läbinud üliõpilane\n- valmistab iseseisval ette ja viib läbi ning analüüsib erinevaid tegevus- ja/või aktiivõppel põhinevaid sündmusi;\n- osaleb meeskonnakaaslaste poolt korraldatud sündmustel ning suudab neid analüüsida ja hinnata;\n- demonstreerib oskust planeerida erinevaid seikluskasvatuslikke tegevusi reaalset keskkonda arvestades;\n- on võimeline suunama erinevate noorte sihtrühmade kogemusõppe protsessi seiklustegevuste käigus;\n- oskab märgata sündmuste käigus toimuvat ja reageerida vastavalt õpitud teooriatest lähtuvalt;\n- oskab analüüsida seiklussündmust, osalejate tegutsemist, meeskonda ja iseennast erinevates situatsioonides;\n- oskab tegutseda meeskonnas ja meeskonda juhtida."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}