{"uuid": "d6856d72-fbde-e15c-fbf3-f6f6de334a2e", "code": "HVVK.02.028", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Relative Solfeggio", "et": "Relatiivne noodiõpetusmeetod"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "To give an overview of score reading system relative progress through the centuries.\nZ. Kodaly concept of music education and his views on music education key issues.\nDeveloping relative thinking and hearing through the grade insignia.\nRelative and absolute system in cooperation- keys, intervals, chords.\nThe role of folk songs in musical education.\nThe use of folk music in the relative system doctrine.", "et": "Ülevaade relatiivse noodilugemissüsteemi  arengust läbi sajandite. \nZ.Kodaly muusikahariduse kontseptsioon, tema seisukohad muusikalise kasvatuse põhiküsimustes. \nRelatiivse mõtlemise kujundamine ning kuulmise arendamine läbi astmesümboolika. \nRelatiivse ning absoluutse süsteemi koostöö- helistikud, intervallid, akordid. \nRahvalaulu roll muusikaõpetuses.\nRahvamuusika kasutamine relatiivse süsteemi õpetuses."}, "objectives": [{"en": "To introduce the basic principles of music teaching, methodology and basic techniques used to achieve its musical skills. Learn about folk music elements contained in the doctrinal and use them in pedagogical work with children.", "et": "Tutvustada relatiivse noodiõpetuse põhiprintsiipe, metoodikat ja põhivõtteid, saavutada nende kasutamise oskus rakendamiseks muusikaõpetuses. Õppida tundma rahvamuusikas sisalduvaid õpetuslikke elemente kasutamaks neid pedagoogilises töös lastega."}], "learning_outcomes": [{"en": "Student:\nKnows grade teaching methodology, is able to address Key Control, styles, chords, intervals based on the relativity system.\nIs able to Prima Vista solfege steps.\nCan analyze folk songs, games and dancing to music, to find these tasks in accordance with the musical elements of teaching and consolidate what they have learned.\nKnows the types of songs, and is able to carry out practical tasks on the basis of their pupils' musical skills and  is able to open their creativity.\nCan teach children music listening skills via differentiation musical characteristics.", "et": "Tunneb astmeõpetuse metoodikat, oskab käsitleda helistikke, laade, akorde, intervalle relatiivsest süsteemist lähtuvalt.\nOskab noodist prima vista solfedžeerida astmetega. \nOskab analüüsida rahvalaule, -mänge ja -tantsumuusikat, leida neist ülesandeid vastavate muusikaliste elementide õpetamiseks ja õpitu kinnistamiseks.\nTunneb ahellaulude tüüpe ja oskab nende põhjal läbi viia praktilisi ülesandeid õpilaste muusikaliste oskuste arendamiseks ja loovuse avamiseks.\nOskab muusikaliste tunnuste eristamise kaudu suunata ja õpetada muusikakuulamisoskust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}