{"uuid": "815dfda4-97c5-bc85-a994-52e33efc6dd1", "code": "HVVK.00.088", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Taxation and Accounting in Culture Management", "et": "Maksundus ja raamatupidamine kultuuriettevõtluses"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course, the students get acquainted with the main aspects of managing accounting, main accounting models, reading balance sheets and income statements, making charts of accounts, and asset accounting is practiced.\nThe course also deals with the following taxes: VAT, the reduced rate of VAT in some areas of cultural entrepreneurship;\nincome tax and in-depth taxation of scholarships (including the Estonian Cultural Endowment), rewards and subsidies, as well as the conditions for entering the list of non-profit organizations and foundations with income tax concessions based on §11 of the Income Tax Act, and based on these provisions for NGOs and foundations expanding tax incentives; calculation of social tax and unemployment insurance contributions; the nature of local taxes.", "et": "Kursuse käigus tutvutakse raamatupidamise korraldamise aspektidega, raamatupidamistehingute põhimudelitega, harjutatakse bilansi- ja kasumiaruande lugemist, kontoplaanide tegemist ja varade arvestamist.\nKursus käsitleb alljärgnevaid makse: käibemaksu (maksu olemust, arvutamise põhimõtteid, EV Käibemaksuseadust), sisendkäibemaksu mõistet ja olemust ning süvendatumalt käibemaksu soodusmäära rakendamist mõnedes kultuuriettevõtluse valdkondades; \ntulumaksu (üksikisiku tulumaksu ja juriidilise isiku tulumaksude olemust, EV Tulumaksuseadust, maksu arvutamise põhimõtteid) ning süvendatult stipendiumite (sh Eesti Kultuurkapitali), preemiate ja toetuste maksustamist, samuti Tulumaksuseaduse §11 alusel Tulumaksusoodustusega mittetulundusühingute ja sihtasutuste nimekirja kandmise tingimusi ning antud sätete alusel MTÜdele ja SAdele laienevaid maksusoodustusi; sotsiaalmaksu ja töötuskindlustusmaksete arvutamist; \nkohalike maksude olemust, lähemalt teede- ja tänavate sulgemismaksu ja reklaamimaksu kehtestamise tingimusi kohaliku omavalitsuses."}, "objectives": [{"en": "The purpose of the course is to provide knowledge of the essentials of accounting, as well as an overview of the Estonian tax system from the point of view of cultural entrepreneurship, as well as introduce the basics of calculating VAT and payroll taxes, give practical tips for preparing invoices and calculating payroll taxes in employment contracts.", "et": "Kursuse eesmärk on anda teadmised raamatupidamise põhialustest, samuti ülevaade Eesti maksusüsteemist kultuuriettevõtluse seisukohast lähtudes, samuti tutvustada käibe- ja palgafondimaksude arvestamise põhitõdesid ning anda praktilisi näpunäiteid arvete ja sularahakviitungite koostamiseks ning palgafondimaksude arvestamiseks töölepingutel."}], "learning_outcomes": [{"en": "The student has acquired knowledge in the:", "et": "Tudeng on omandanud teadmised"}, {"en": "- managing accounting", "et": "- raamatupidamise korraldamisest;"}, {"en": "- the main accounting models", "et": "- raamatupidamistehingute põhimudelitest;"}, {"en": "- principles of balance sheet and income statement", "et": "- bilansi- ja kasumiaruande põhimõtetest;"}, {"en": "- chart of accounts", "et": "- kontoplaanidest;"}, {"en": "- main principles of asset accounting", "et": "- varade arvestuse üldpõhimõtetest;"}, {"en": "- knows the Estonian tax system from the point of view of cultural entrepreneurship", "et": "- tunneb Eesti maksusüsteemi kultuuriettevõtluse seisukohast;"}, {"en": "- has an overview of the calculation of VAT and payroll taxes", "et": "- omab ülevaadet käibe- ja palgafondi maksude arvestamisest;"}, {"en": "- can prepare invoices and cash receipts", "et": "- oskab koostada arveid ja sularahakviitungeid;"}, {"en": "- can calculate payroll taxes and take them into account in an organization or project budgets", "et": "- oskab arvestada palgafondi makse ja kajastada neid töö- või võlaõiguslikes lepingutes ja arvestada nendega organisatsiooni või projekti eelarvetes;"}, {"en": "- knows and has an overview of local taxes related to cultural organization.", "et": "- teab ja omab ülevaadet kultuurikorraldust puudutavatest kohalikest maksudest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}