{"uuid": "1454d97c-d236-dec6-1ae0-65faef9bde01", "code": "HVVK.03.063", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T14:35:30", "title": {"en": "Introduction to Applied Theatre", "et": "Sissejuhatus rakendusteatrisse"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The purpose of the introductory course is to provide an overview of the history and classification of applied theatre based on its goals: therapeutic (psychodrama, drama therapy, hospital clown), pedagogical (role play, drama pedagogy), contemplation and analysis of social issues and problems (sociodrama, process drama, forum theatre), uniting the community ( Playback Theatre, improvisation theatre), making sense of history and human destinies (theatre of memories, ritual). Focusing more thoroughly on methodologies that are used in community work and on how to create and maintain contact with the community during the applied theatre process.", "et": "Sissejuhatava aine eesmärk on anda ülevaade erinevatest rakendusteatri  suundadest ning nende kujunemise loost ning rakendusvõimalusest kogukonnatöös: teraapiline (psühhodraama, draamateraapia, haiglakloun), pedagoogiline (rollimäng, draamapedagoogika), kogukonda liitev (luguteater, improteater), sotsiaalsete teemade ja probleemide mõtestamine ning analüüs (sotsiodraama, protsessdraama, foorumteater), ajaloo ja inimsaatuste mõtestamine (mälestusteteater, rituaal). Mõtestada, kuidas rakendada erinevaid metoodikaid töös kogukondadega ning kuidas luua ja hoida kogukonnaga kontakti rakendusteatri protsessi vältel."}, "objectives": [{"en": "The aim is to give an overview of the history of applied theatre and to take a closer look on how and why to use applied theatre in community work.", "et": "Eesmärk on anda ülevaade rakendusteatri ajaloost ning vaadelda põhjalikumalt suundi, mida \nrakendatakse kogukonna töös. Ülevaade sellest, kuidas ja milleks alustada rakendusteatri protsessi \nkogukonnas."}], "learning_outcomes": [{"en": "Understands comprehensively the history of applied theatre.", "et": "Mõistab ülevaatlikult rakendusteatri ajalugu."}, {"en": "Understands the use of applied theatre in community work.", "et": "Mõistab rakendusteatri kasutamise võimalusi kogukonnatöös.  "}, {"en": "Knows how to make contact with the community to get started with applied theatre.", "et": "Oskab  luua kontakti kogukonnaga rakendusteatriga alustamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}