{"uuid": "f5eaa7ca-3303-39fc-bdff-8068b2b923c5", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-28T14:49:55", "title": {"en": "BIP House of Europe (Viljandi)", "et": "BIP House of Europe (Viljandi)"}, "credits": 1, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 1, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A regular part 1 1 CP HV", "et": "24/25 S PÕ 1. osa 1 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "During the introductory course, learning and teaching methods will involve interactive online lectures with discussions in small groups, facilitated through video conference call software. The course structure incorporates independent homework assignments to be submitted via an online platform. In total, four online seminars will cover various topics, enabling students to acquire knowledge in areas such as music copyright, contractual issues, music business practices, music pitching and artist  public relations  as well as the fundamental tools and methods of songwriting.\nDuring the intensive week, instruction takes place on-site, with the focus on peer-to-peer learning which is on the sideline coached by the teachers. While the project's working language is English, participants are encouraged to incorporate lyrics in their native languages. The resulting songs will be showcased in a public performance at the conclusion of the intensive week.\nDuring the post-production period, the work will be conducted remotely, utilising the required software (including tools for online meetings) for recording, and producing songs. Teams, with members in different locations, will collaborate on refining and enhancing their compositions. This post-production phase comprises three online sessions where a professional music producer provides feedback on the songs. Between these online sessions, students will continue to collaborate from a distance with their respective songwriting teams.\n\nAs the main outcome, new songs will be created telling the stories of all different cultures gathered in the project.", "et": "Sissejuhatava kursuse käigus toimuvad interaktiivseid veebiloengud. Loengute käigus toimuvad videokonverentsi tarkvara abil muuhulgas arutelud väikestes töögruppides. Kursus sisaldab iseseisvaid kodutöid, mis tuleb esitada veebipõhise platvormi kaudu. Kokku katavad neli veebiseminari mitmeid teemasid, võimaldades õpilastel omandada teadmisi valdkondades nagu muusika autoriõigus, lepingulised küsimused, muusikaäri tavad, laulude esitlemine ja artistide suhtekorraldus, samuti laulukirjutamise põhitõed, töövahendid ja meetodid.\nProjekti teise osa, (Intensiivnädala) raames toimub töö kohapeal, fookuses on koostöö kaastudengitega ja selle läbi üksteiselt õppimine, juhendajateks on projektis osalevad partnerülikoolide õppejõud. Kuigi projekti töökeel on inglise keel, julgustatakse osalejaid kirjutama laulusõnu ka oma emakeeles. Intensiivnädala jooksul valminud muusika tuleb esitlusele avalikul kontserdil nädala lõpus.\nProjekti kolmas osa, Postproduktsiooni Periood toimub kaugtööna ja selle läbiviimiseks kasutatakse vajalikku tarkvara (sh programmid veebi kohtumisteks), laulude salvestamiseks ja produtseerimiseks. Erinevates riikides asuvad meeskonnaliikmed teevad omavahel koostööd, et täiustada ja parendada projekti käigus kirjutatud muusikat. Järelproduktsiooni perioodil toimub kolm veebiloengut, mille raames tudengid saavad tagasisidet enda loomingule ja ideid edasiseks tööks professionaalselt muusikaprodutsendilt. Periood hõlmab kolme veebiseanssi, kus professionaalne muusikaprodutsent annab tagasisidet lauludele. Nende veebiseansside vahel jätkavad õpilased omavahel koostööd,et muusika saaks viimase lihvi. \nProjekti tulemusena valmib uut muusikat. Kuuleme erineva kultuurilise tausta ja kogemustega inimeste lugusid."}, "objectives": [{"en": "House of Europe is a project that offers a model to support interaction between music students and guest musicians (with immigrant backgrounds) by songwriting and creating new music in live situations. The core of the programme is made up of participatory workshops for the students and guest musicians where through facilitation they tell their stories and share their own musical traditions, and together turn them into music.", "et": "House of Europe on projekt, mis pakub võimalust toetada koostööd muusikaüliõpilaste ja külalisartistide (migratsioonitaustaga) vahel. Seda tehakse laulude kirjutamise ja uue muusika loomise kaudu. Programmi raames toimuvad töötoad tudengitele ja külalisartistidele, kus suunamise abil saavad nad võimaluse rääkida oma lugusid, jagada oma muusikatraditsioone ning üheskoos muuta see muusikaks."}, {"en": "The physical workshops are preceded by an introductory online course, the aim of which is to introduce the participants to the basic tools and methods of songwriting, music business practices, pitching one's songs and copyright. ", "et": "Füüsilistele töötubadele eelneb sissejuhatav veebikursus, mille eesmärk on tutvustada osalejatele laulukirjutamise põhitõdesid ja meetodeid, muusikaäri tavasid ja autoriõigust."}, {"en": "As a mobility programme, House of Europe brings together students and teachers from six higher music education institutions from different European countries to spend a week in the host institution along with guest musicians, participating in an intensive course. The week includes songwriting (music and lyrics) in teams, improvising, producing, recording and performance.", "et": "House of Europe'i mobiilsusprogramm toob kokku õpilased ja õpetajad kuuest erinevast Euroopa riigist, kes veedavad koos külalisartistidega nädala võõrustava institutsiooni juures intensiivkursusel. Intensiivnädal hõlmab meeskonnatööna laulukirjutamist (muusikat ja sõnu), improvisatsiooni, produtseerimist, salvestamist ja esinemist."}, {"en": "The intensive week culminates in a final public event where the musical outcome of the course is performed, and where the students and guest musicians - who have taken part in the course as sources of music, stories, and experiences - meet. The intensive workshops are followed by a remote post-production period, where the participants produce their songs further using musical and communication applications suitable for online working, aiming for digital release and distribution of the songs.", "et": "Intensiivnädal kulmineerub kontserdiga, kus kursuse muusikaline tulemus esitatakse, ja kus õpilased ning külalisartistid - kes on kursusel osalenud muusika, lugude ja kogemuste allikana - kohtuvad. Töötubade nädalale Võõrustavas ülikoolis, järgneb kaugtöö periood, kus osalejad arendavad oma laule edasi, kasutades selleks muusika- ja suhtlusrakendusi, mis sobivad veebitööks, eesmärgiga saada lood digitaalselt valmis."}], "learning_outcomes": [{"en": "At the end of the project the students are expected to have improved their skills to:", "et": "Projekti lõpuks eeldatakse, et õpilased on suutnud parandada oma oskusi järgmistes valdkondades:"}, {"en": "*\tunderstand the principles of international music copyright, contractual practices, and the general differences between various copyright conventions;", "et": "Mõista rahvusvahelist muusika autoriõiguse põhimõtteid, lepingupraktikaid ja üldisi erinevusi erinevate autoriõiguse konventsioonide vahel."}, {"en": "*\tcomprehend the operating methods of the music industry and be able to communicate their musical competences and visions in a productive manner;", "et": "Mõista muusikatööstuse töömeetodeid ja on võimelised oma muusikalisi oskusi turundama ja müüma."}, {"en": "*\twrite their songs to reach the desired audiences, both individually and as a member of a songwriting team, utilising creative tools, methods and models of operation created and supported by the songwriting community and the music business;", "et": "Kirjutada laule individuaalselt ja meeskonnas, et jõuda soovitud sihtrühmadeni, kasutades loomingulisi tööriistu, meetodeid ja töömudeleid, mis on loodud ja toetatud valdkonna spetsialistide poolt."}, {"en": "*\tengage with individuals and groups, demonstrating sensitivity to diverse and intercultural views and perspectives and evidencing skills in teamwork, (leadership), project development and organisation as required.", "et": "Oskus suhelda erinevate indiviidide ja gruppide vahel. Kasvanud on tundlikkus mõista erineva kultuuritausta ja kogemustega inimesi. Kasvanud on teadmised meeskonnatöös, (juhtimises), projektide arendamises ja korraldamises."}], "notes": {"et": "Online Introductory course will take place on four Fridays from 13:00 to 16:00 (Central European Time (CET))."}}, "grading": {"independent_work": {}, "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=4358", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "262dc1ca-eb31-78d2-3d43-cc7413377acc", "person_name": "Marko Mägi", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "2c14b59e-c176-6df1-9262-04699a148c08", "person_name": "Liina Tralla", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2024-03-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "\"Music, Money and Rights: Tuning into Copyright in the Music Business\" - Mati Kaalep (Estonian Author's Society)"}}, {"time": "2024-02-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "\"Artist PR Playbook\" - Ingrid Kohtla (Shiftworks)"}}, {"time": "2024-03-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "\"Entrepreneurship, Team Building and Self Management\" - Juko-Mart Kõlar (University of Tartu Viljandi Culture Academy)"}}, {"time": "2024-04-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "\"Basic Tools and Methods of Songwriting\" - Jere Laukkanen (Metropolia University of Applied Sciences"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "c53f4eae-3ee2-37f8-78d8-c7269313155b", "parent_code": "HVVK.00.100", "parent_credits": 5, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}