{"uuid": "a31b4a76-5c16-5a7f-8c96-43a0b4f6bfc7", "code": "HVVK.01.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Marketing Practice", "et": "Turunduspraktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The practice consists of observation and analysis of exhibitions/fairs in folk art and crafts fields, analysis of craftshops in a chosen area, personal proposals of possible and necessary changes of the existing situation; organizing and setting up a sales event. Analysis of the results and feedback of the event.", "et": "Praktika koosneb erinevate müügiürituste, veebikeskkondade jms vaatlemisest ja analüüsist; valitud paikkonnas asuvate käsitööesemete müügikohtade analüüsist, isiklikest ettepanekutest situatsiooni võimalikeks ja vajalikeks muutusteks; konkreetse müügiürituse või tooteturunduse  kavandamisest ja läbiviimisest. Tulemuste ja tagasiside analüüs."}, "objectives": [{"en": "The professional practice consists of general part (1.5 ECTS) and a product presentation part (1.5 ECTS). The general part means organising and setting up trade fair booths and exhibits introducing the curriculum field. The general goal of the practice is to offer the students basic experience in the field of organising sales events and/or the sales environment.", "et": "Turunduspraktika koosneb laatadel-messidel oma eriala esitlemise praktikast (1,5 EAP) ja tootearenduspraktika II raames valminud toote (või tooteseeria) turundamise praktikast (1,5 EAP). Üldeesmärgiks on pakkuda tudengile konkreetsete müügiürituste ning/või müügikeskkondade korraldamise esmaseid kogemusi."}], "learning_outcomes": [{"en": "The student\n- knows the general handicraft market situation and is able to related to it;\n- knows the specifics and event target group;\n- knows how to prepare the event concept, structure, select the supplies that will be needed and prepare exhibits based on the target group and set them up at the venue in line with composition rules and aesthetic requirements.", "et": "Üliõpilane\n- teab üldist käsitööesemete turusituatsiooni ja oskab sellega suhestuda;\n- tunneb käsitöötoodete spetsiifikat, ürituse või oma toote sihtgruppi;\n- oskab valida oma toote turundamiseks sobiva turunduskanali,\n- oskab koostada erialase müügiürituse kontseptsiooni, ülesehitust, valida vajaminevat inventari ning koostada reklaammaterjale,\n- on võimeline analüüsima turundusest saadud kogemusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}