{"uuid": "b3ee3a37-a0b3-8af9-e60a-f0e3ad96c323", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-30T20:44:45", "title": {"en": "Natural Substances", "et": "Looduslike abimaterjalide õpetus"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 4, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S regular part 2 4 CP HV", "et": "24/25 K PÕ 2. osa 4 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 44, "seminar": 4, "independent_work": 56, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The subject provides a brief overview of the most common natural and synthetic substances in the world. The development of natural substances, processing technologies and areas of use. A comprehensive overview and introduction to natural substances in Estonia such as resins, waxes, tlub, tar, kliester, ash, ash alkali, coal, soot, pitch, manure, natural dyes, pigments, colored earths, raw clay, sand, alcohol, salt, resins, shellac, adhesives, fats.\nField trips in the subject:\nLime kilns\nBirch tar and \"tökat\" in Livonia\nBeeswax candles\nMaking incense in Hiiumaa\nClay house\nPainting with plants with ash alkali\nIn the practical course in the subject, participants can mix waxes and pigments, make resins, paints and incense. As an independent work, experiment with melting and mixing waxes and resins at different temperatures. Describe and analyze the work process. Safety requirements have been developed in seminars and workshops and waste disposal requirements have been familiarized with.\nDraw the life cycles and cycles of natural and synthetic substances!", "et": "Õppeaines antakse lühiülevaade maailmas levinumatest looduslikest ja sünteetilistest abimaterjalidest. Looduslike abimaterjalide kujunemisest, töötlemistehnoloogiatest ja kasutusvaldkondadest. Põhjalik ülevaade ja tutvustus looduslikud abimaterjalidest Eestis nagu vaigud, vahad, tlubi, tõrv, kliister, tuhk, tuhaleelis, süsi, nõgi, pigi, sõnnik, looduslikud värvained, pigmendid, värvimullad, toorsavi, liiv, piiritus, sool, vaigud, šellak, liimained, tökat, rasvad.\nÕppeaines toimuvad väljasõidud:\nLubiahjud\nLiivimaa Kasetõrv ja tökat\nMesilasvahast küünlad\nViiruki valmistamine Hiiumaal\nSaviukumaja\nTaimedega värvimine tuhaleelisega\nÕppeaines toimuval praktikal saavad osalejad segada vahasid ja pigmente, valmistada vaike, värve ja viirukeid. Iseseisva tööna katsetada vahade ja vaikude kokkusulatamist ja segamist erinevatel temperatuuridel. Kirjeldada ja analüüsida tööprotsessi. Eelnevalt on seminarides ja praktikumides väljatöötatud ohutusnõuded ja tutvutud jääkide utiliseerimisnõuetega.\nJoonistada looduslike ja sünteetiliste abimaterjalide elukaared ja eluringid!"}, "objectives": [{"en": "The aim of the subject is to provide an overview of natural and synthetic substances in the world and to focus in more detail on the methods of production and areas of use of natural substances in Estonia. Conduct practical exercises to introduce, produce and find ways of applying different materials. Field trips to nature and various companies provide a snapshot of the natural substances produced and used in Estonia.", "et": "Õppeaine eesmärgiks on anda ülevaade looduslikest ja sünteetilistest abimaterjalidest maailmas ning üksikasjalikumalt keskenduda looduslike abivahendite valmistamisviisidele ja kasutusvaldkondadele Eestis. Viia läbi praktikume erinevate materjalide tutvustamiseks, valmistamiseks ja rakendusviiside leidmiseks. Väljasõidud loodusesse ja erinevatesse ettevõtetesse annavad hetkepildi Eestis valmistavatest ja kasutatavatest looduslikest abimaterjalidest."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "- knows the most common natural aids in the world, is generally familiar with their production technologies and main areas of use;\n- can distinguish natural substances from chemical ones according to their composition and area of use;\n- can find raw materials for natural substances in Estonia and can collect and use them as renewable natural materials;\n- can use natural resources such as water, sun, wind and air with materials;\n- knows and is familiar with safety requirements when collecting, producing and using materials;\n- can prepare and use at least three natural substances and is familiar with their starting materials and compatibility with other natural materials;\n- is aware of the minimization and disposal of residues of natural substances.", "et": "- teab levinumaid looduslike abivahendeid maailmas, tunneb üldiselt nende valmistamise tehnoloogiaid ja peamise kasutusvaldkondi;\n- oskab eristada looduslikke abimaterjale keemilistest nende koostise ja kasutusvaldkonna järgi;\n- oskab leida Eestist looduslike abimaterjalide toormaterjale ja oskab neid koguda ja kasutada, kui taastuvaid loodusmaterjale;\n- oskab kasutada materjalide juures loodusressursse nagu vesi, päike, tuul ja õhk;\n- teab ja tunneb ohutusnõudeid materjalide kogumisel, valmistamisel ja kasutamisel;\n- oskab valmistada ja kasutada vähemalt kolme loodusliku ablimaterjali ja tunneb nende algmaterjale ning kokkusobivust teiste looduslike materjalidega;\n- on teadlik looduslike abimaterjalide jääkide minimeerimisest ja utiliseerimisest."}], "notes": {}}, "grading": {"independent_work": {"et": "Üliõpilane valib looduslikest abimaterjalidest ühe materjali, uurib selle saamise võimalusi looduses, kasutamisvõimalusi, taastumisprotsesse ja ohutust ning utiliseerimist."}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Üliõpilane esitab miniuurimuse enda poolt valitud loodusliku abimaterjali kohta. Teoreetilisele tööle lisandub praktiline eksperiment, mille etapilise läbiviimise kirjelduse ja tulemuste analüüsi esitab lisades."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "Hinnatakse nii etteantud ülesannete sooritust, valminud uurimuse ja praktilise töö esteetilist ja tehnilist kvaliteeti, aga ka loengutest, seminaridest ja väljasõitudest osavõtmist."}, "grade_conditions": {"A": {"et": "Ainekava mahust on omandatud 100%. Seminarides ja praktikumides on aktiivselt osaletud ja näidatud motiveeritud suhtumist. Ülesanded on silmapaistvalt sooritatud ja õnnestunud. Üliõpilane on omandanud suurepärase ülevaate ja oskused aine tööprotsessidest. Heal tasemel on iseseisva töötamise kogemus ja praktilise töö ülestähenduse analüüsimisvõime."}, "B": {"et": "Ainekava mahust on omandatud 90%. Üliõpilane on tundides, seminarides ja väljasõitudel aktiivselt osalenud.\nKõik etteantud tööd on sooritatud ja kvaliteet korralik. Üliõpilane on ainest aru saanud ja oskab tööprotsessides süsteemselt toimida ja saab hakkama iseseisva töö ja praktika ülestähendustega."}, "C": {"et": "Ainekava mahust on omandatud 80%. Üliõpilane on praktikumides osalenud ja näidanud välja huvitatust. Ülesanded on sooriatud. kuid esineb puudujääke. Vajadusel tuleb toime iseseisvate ülesannetega, praktikumides on abivajav."}, "D": {"et": "Ainekava mahust on omandatud 70%. Üliõpilane on passiivne, puudub, Etteantud töödes on puudujäägid."}, "E": {"et": "Ainekava mahust on omandatud 60%. Üliõpilane on passiivne. Tööprotsessides osalemine ebaregulaarne, tööd teostatud hooletult. Arusaamine ainest kesine. Väga vähene tahe iseseisvalt töötada ja praktikaga tegeleda."}, "F": {"et": "Üliõpilane on omandanud teadmised ja oskused õppeainest miinimumtasemest madalamal tasemel või on puudunud enamusest tundidest."}, "mi": {"et": "Üliõpilane ei ole ilmunud õppetööle."}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "f0d6118d-c936-e8ae-6548-c094cc463a01", "person_name": "Diana Tuulik", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": false}, {"person_uuid": "afb1a967-a619-0d54-2663-27ae770c88b5", "person_name": "Monika Hint", "structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {"et": "PTR1, PTR2"}}, "confirmation_process": {"confirmation_uuid": "9cffcb53-210b-9e8a-9ca8-d5a874fff55a", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "85ade730-92a9-358e-f783-94e0331d5f0e", "parent_code": "HVVK.01.217", "parent_credits": 7, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}