{"uuid": "fc6fca94-0087-7870-9cb3-622dd1fd3041", "code": "HVVK.00.045", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Audio Production II", "et": "Helisalvestus II"}, "credits": 7, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "3b268e3a-e81b-a40f-3975-7d54baf5b685", "code": "HVVK.00.044", "title": {"en": "Audio Production I", "et": "Helisalvestus I"}, "credits": 8, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Gives thorough knowledge about recording equipment and their tuning and set up. Modern software solutions used in sound recording are being taught, computer's op-system and hardware are being taught to organize. Different digital sound editing softwares are learned. Also sound and picture synchronization is being introduced.", "et": "Annab põhjalikud teadmised oskused digiteerimise ja salvestamise seadmetest ning nende seadistamisest ja komplekteerimisest. Õpitakse häälestama ja komplekteerima kaasagses helisalvestuses kasutatavaid tarkvaralahendusi, arvuti opratsioonisüsteemi ja raudvara. Õpitakse kasutama digitaalse helitöötluse programmide platvorme ja võimalusi. Vaadeldakse pildi ja heli sünkroniseerimise seadmeid ja koostöötamise protsesse."}, "objectives": [{"en": "Aims of the subject:", "et": "Õppeaine eesmärgiks on: "}, {"en": "*to give knowledge for digital sound recording and about systems, their installation, build-up and tuning", "et": "*\tAnda põhjalikud teadmised ja oskused digitaalseks helisalvestuseks vajalike süsteemide ülesehituseks, installeerimiseks ja seadistamiseks"}, {"en": "*to give knowledge for putting together sound recording studio equipment list and to tune it", "et": "*\tAnda oskused helistuudio tehniliseks komplekteerimiseks ja häälestamiseks"}, {"en": "*to give an overview and to introduce digital sound recording systems in different software platforms", "et": "*\tAnda ülevaade ja tutvuda eri platvormide ja tootjate digitaalsete helisalvestussüsteemidega"}, {"en": "*to teach how to use put together sound and picture editing equipment and formats.", "et": "*\tÕppida ühildama ja ühendama heli- ja pilditöötluse sedameid ja formaate"}], "learning_outcomes": [{"en": "By the end of the course students should:\n* have deep knowledge about sound recording systems\n* knows, how to set up sound recording system, how to use and maintain it\n* is able to use possibilities of digital sound recording system", "et": "Aine läbinud üliõpilane:\n*\tOmab põhjalikke  teadmisi helisalvestussüsteemide, vahendite ja võimaluste  kohta\n*\tOmab teadmisi ja oskusi süsteemide ülesehitamiseks, seadistamiseks ja käigushoidmiseks\n*\tTeab ja oskab kasutada digitaalse helisalvestussüsteemi võimalusi \n*\tTunneb eri salvestusprogrammide vahelisi metadata kasutamise võimalusi \n*\tOskab hinnata stuudiote ja seadmete seisundit ning teostada ahela komponentide vahetust"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}