{"uuid": "96dc0e29-ffe6-f297-068c-027b44b90fa2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-30T12:46:48", "title": {"en": "Didactics of Art Teaching", "et": "Kunstiõpetuse didaktika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode part 2 3 CP HV", "et": "24/25 K SÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Part 1\nPhilosophical background and history of teaching arts in western culture\nThe distinction between visual art and crafts, reasons and functions\nTeaching drawing: different methods\nPsychology and art education, changes in educational systems in general\nTeaching visual arts in general, higher, state-controlled, private and alternative education\nArt education in Estonian general and higher education before the 2nd World War\nBauhaus. Expressive and reconstructive art education. DBAE and ARTS Propel\nThe role of International organisations in enhancing and developing art education in general education\n\nPart 2\nTheoretical orientations and actual problems of arts educaton\nThe stages of children  artistic development\nThe individual differences and ability in arts education\nCreativity \nB. Edwards. Drawing on the Right Side of the Brain\nSetting a goal and planning the learning process in arts\nDesigning the learning environment. Motivation\nAssessment and feedback.", "et": "I osa\nKunstide õpetamise filosoofilised alused ja ajalugu Lääne kultuuriruumis. \nPatronaat ja ligipääsetavus kunstiõppele, seosed ühiskondlike ideoloogiate ja süsteemidega.\nKunstiõpetuse rolli ja funktsioonide muutumised erinevatel ajalooperioodidel ja ühiskonnakordades.\nKunsti ja käsitöö lahknemine; põhjused ja funktsioonid.\nJoonistamisõpe, erinevad joonistamise õpetamise süsteemid.\nKunsti populariseerimine ja rahvaharidus. Psühholoogia tekkimine ja mõju kunstiharidusele.\nVisuaalsete kunstide õpetamine üld- ja kõrghariduses, riiklikus, era- ja alternatiivhariduses.\nKunstiõpetus Eesti kõrg- ja üldhariduses enne II Maailmasõda.\nBauhaus. Ekspressiivne ja rekontstruktsiooniline vool kunstiõpetuses. DBAE ja ARTS Propel.\nRahvusvaheliste suurorganisatsioonide  roll kunstiõpetuse edendamisel ja arendamisel üldhariduses.\n\n\nII osa\nKunstiõpetuse teoreetilised arengusuunad ja aktuaalsed probleemid.\nLaste kujutava tegevuse arenguetapid.\nH. Gardneri multiintelligentsuse teooria. Õpilaste individuaalsed iseärasused ja võimekus.\nLoovus ja selle arendamise võimalused koolis.\nB. Edwards;Drawing on the Right Side of the Brain.\nÕppeprotsessi eesmärgistamine ja kavandamine.\nÕpikeskkonna kujundamine. Motivatsioon. \nHindamine ja tagasiside."}, "objectives": [{"en": "The aim of the course is to give:\n- a systematic overview of the philosophical basis, history, aims and functions of teaching visual arts in western culture \n- comprehensive knowledge about the relationship between historical and societal changes, arts and art teaching practices \n- ability find the teaching methods which anable to gain both general and art educational aims \n-knowledge of arts teaching methods used in professional and general education and abilty to analyse the effectiveness of these methods \n- theoretical knowledge and practical skills in art didactics necessary for planning and conducting the learning process", "et": "Anda:\n- süsteemne ülevaade visuaalsete kunstide õpetamise filosoofilistest alustest, ajaloost, eesmärkidest ja funktsioonist Lääne kultuuriruumis; \n- teadmised ajaloolistest ja ühiskondlikest muudatustest  ning nende sostest kunsti- ja hariduspraktikaga:\n- üld- ja  kunstihariduse eesmärkide ning nende saavutamiseks rakendatavate õppemetoodikate vahelise seostamise oskus;\n- teadmised patronaadisüsteemi olemusest ja rakendumisest hariduse ajaloo vältel:\n- teadmised professionaalses ja üldhariduslikus kunstiõppes rakendatud metoodikatest, oskus analüüsida metoodikate efektiivsust õppijatest ning õppe-eesmärkidest lähtuvalt:\n- teoreetilised teadmised kunstiõpetuse didaktikast õpiprotsessi kavandamiseks ja läbiviimiseks õppepraktikas ning oskus tehtut süsteemselt analüüsida."}], "learning_outcomes": [{"en": "After passing this course the student\n-\thas a systematic overview and comprehensive knowlede about the history of teaching visual arts\n-\tunderstands the relationships between the aims of arts education and philosophical background of era, historical and societal conditions and changes in technological development \n-\tis able to plan and conduct learning process in arts according to the needs, interests  and individual differences of the learners\n-\tis familiar with theoretical orientations and actual problems of arts educaton\n-\tknows the stages of children artistic development\n-\tcan give the grounded feedback to learning process and product", "et": "Õppeaine edukal läbimisel üliõpilane:\n-\tomab süsteemset ülevaadet ja laiapõhjalisi teadmisi visuaalsete kunstide õpetamise ajaloost.\n-\tseostab kunstihariduse eesmärke ajastule iseloomulike filosoofiliste vaadetega, tunneb ära ja selgitab põhjuslikke seoseid ühiskonnakorra, olude, tehnoloogia arengu ja visuaalsete kunstide ning kunstniku staatuse vahel.\n-\tkirjeldab süsteemselt patronaadi ja haridusele ligipääsetavuse problemaatikat eri ajastute  ja ühiskondade ning kunstiõpetuse näitel.\n-\tseostab arenguid kunstiajaloos muudatustega professionaalses ja üldharivas kunstiõppes.\n-\tsaab aru kunsti ja käsitöö ning professionaalse ja üldhariva kunstiõppe protsessi ja eesmärkide erinevustest.\n-\tEesmärgistab õppeprotsessi ja ehitab selle üles õppijate arengut ja teadmiste taset arvestades. \n-\tTeab, mis on erinevate kunstiõppesüsteemide eesmärk ja väljundtasand ning oskab protsessi vastavalt tagasisidestada.\n-\tTunneb kunstiõpetuse teoreetilisi arengusuundi ja aktuaalseid probleeme.\n-\tTeab laste kujutava tegevuse arenguetappe.\n-\tOskab õppeprotsessi eesmärgistada, kavandada ja ellu viia.\n-\tOskab omandatud teoreetilisi teadmisi õpetamispraktikas kasutada arvestades seejuures õpilaste arengutaseme, vajaduste ja individuaalsete iseärsustega.\n-\tTagasisidestab õpiprotsessi ja -tulemust vastavalt püstitatud õppe-eesmärkidele.\n-\tMääratleb enda rolli õpetajana ja teab selle mitmekesisust, on võimeline oma tegevuse kavandamiseks, analüüsimiseks ja parendamiseks."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Kunstihariduse teemalise eestikeelse artikli läbitöötamine ja selle tutvustamine seminaris.\n2. Kunstihariduse teemalise inglisekeelse teadusartikli läbitöötamine ja selle tutvustamine seminaris."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A ehk \"suurepärane\" - oskab kunstiõpetuse teoreetiliste arengusuundade, laste kujutava tegevuse arenguetappide, õpilaste motiveerimise, juhendamise ja tagasisidestamise alaseid teoreetilisi teadmisi õppetegevust eesmärgistades ja planeerides vabalt, isikupäraselt ja loovalt rakendada \nB ehk \"väga hea\" - oskab kunstiõpetuse teoreetiliste arengusuundade, laste kujutava tegevuse arenguetappide, õpilaste motiveerimise, juhendamise ja tagasisidestamise alaseid teoreetilisi teadmisi õppetegevust planeerides eesmärgipäraselt rakendada\nC ehk \"hea\" - oskab õpilaste motiveerimise, juhendamise ja tagasisidestamise alaseid teoreetilisi teadmisi õppetegevust planeerides rakendada. Lähtumise osas kunstiõpetuse teoreetilistest arengusuundadest ning kunstididaktika põhiprintsiipidest esineb ebakindlust\nD ehk \"rahuldav\" - oskab õpilaste motiveerimise, juhendamise ja tagasisidestamise alaseid teoreetilisi teadmisi õppetegevust planeerides rakendada. Lähtumise osas kunstiõpetuse teoreetilistest arengusuundadest ning kunstididaktika põhiprintsiipidest esineb puudujääke ja ebakindlust\nE ehk \"kasin\" - oskab omandatud teadmisi õppetegevust planeerides rakendada. Lähtumise osas kunstiõpetuse teoreetilistest arengusuundadest ning kunstididaktika põhiprintsiipidest esineb olulisi puudujääke ning ebakindlust\nF ehk \"puudulik\" - ilmnevad olulised puudujäägid nii teoreetilistes teadmistes kunstiõpetuse teooria osas kui teoreetiliste teadmiste rakendamisel õppetegevuse planeerimisel"}}], "grade_preconditions": {"et": "Eksamile pääsemise tingimuseks on, et üliõpilane on sooritanud kõik iseseisvad tööd."}, "grade_evaluation": {"et": "Õppeaine edukaks läbimiseks peab üliõpilane.\nTeadma kunstiõpetuse teoreetilisi arengusuundi.\nTeadma  laste kujutava tegevuse arenguetappe, oskama neid kirjeldada ja olema võimeline õppetegevuse planeerimisel nendega arvestama.\nOskama õppetegevust eesmärgistada ja planeerida.\nTeadma õpilaste motiveerimise, juhendamise ja tagasiside admise teooriaid ja meetodeid."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "20351a34-ce1f-4b4b-9abc-bc11c2d89c39", "type": "MOODLE", "code": "HVVK.03.019_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Kirjandus:\n1. Põhikooli riiklik õppekava, gümnaasiumi riiklik õppekava\n2. Bates, J.  Becoming an Art Teacher. 2000.\n3. Day. M., Eisner, E. Handbook of Research and Policy in Art Education. 2004.\n4. Edwards, B.  Drawing on the Right Side of the Brain. 2001.\n4. Krull, E. Pedagoogilise psühholoogia käsiraamat. 2018..", "recommended_materials": "1. Addison, N., Burgess, L. (2000). Learning to teach art and design in the secondary school.\n2. Bates, J. (2000). Becoming an art teacher.\n3. Day. M., Eisner, E. (2004). Handbook of research and policy in art education. \n4. Edwards, B. (2001). The new drawing on the right side of the brain.\n5. Eisner, E. W. (2002). The arts and the creation of mind.\n6. Juske, A. (2004). Joonistav laps. Onto- ja fülogeneetilised paralleelid. \n7. Krull, E. (2018). Pedagoogilise psühholoogia käsiraamat. \n8. Matthews, J. (1999). The art of childhood and adolescence.\n9. Raunam, O. (1963). Joonistamise ja maalimise õpik.\n10. Rockman, D. A. (2000). The art of teaching art.\n11. Sternberg, R. J. (1999).  Handbook of creativity.\n12. Tammert, M. (2006). Värviõpetus.\n13. Vikat, M., Treier, H., Raudsepp, I. (2005). Muusika ja kunsti õpetamisest. \nAjakirjad:\nArt Education\nStudies in Art Education"}, "participants": {"lecturers": [{"person_uuid": "e84e8cfb-9e3c-c0c0-7edc-bf7c5104259d", "person_name": "Piret Viirpalu", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"time": "2025-02-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus. Hariduse eesmärgid ja sisu. Kunstiõpetuse koht ja eesmärgid tänapäeva koolis."}}, {"time": "2025-03-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Õppekava. Õppekavade tüüpstruktuurid. Põhikooli ja gümnaasiumi õppekava; struktuur ja sisu, selle kasutamine. Kunstiõpetuse ainekava. Õpetaja töökava. Tunnikonspekt."}}, {"time": "2025-03-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Laste kujutava tegevuse arenguetapid, nendest lähtumine õppe-eesmärkide püstitamisel. B.Edwards \"Drawing on the Right Side of the Brain\""}}, {"time": "2025-04-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Õpikeskkonna kujundamine, kunstiõpetuse õpetaja, kunstiõpetuse klassi osa selles. Loovus, selle toetamise võimalused. Õpilastööde hindamine."}}, {"time": "2025-04-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Üliõpilaste poolt läbitöötatud eestikeelsete ning inglisekeelsete kunstihariduse teemaliste artiklite arutelu."}}, {"time": "2024-05-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Üliõpilaste poolt läbitöötatud eestikeelsete ning inglisekeelsete kunstihariduse teemaliste artiklite arutelu."}}, {"time": "2025-06-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Õppekirjandus, erialane teaduskirjandus, aktuaalsed uurimisteemad. Kursuse kokkuvõte."}}]}, "registration_info": {"audience": {"et": "Kunstide ja tehnoloogia õpetaja magistrikava üliõpilased"}, "min_students": 5, "max_students": 16}, "parent_uuid": "a4bcf33c-6386-9aca-cc74-2a30e0d7e156", "parent_code": "HVVK.03.019", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}