{"uuid": "99b13864-cdaf-42af-8c86-28030c9801ed", "code": "HVVK.01.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Specialty Report: Writing Practice", "et": "Akadeemilise kirjutamise praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Reinforcement  of skills acquired during the Academic Writing course. Writing practice in different academic genres, adaptation of texts prior to article publishing, communication with the editor. Preparation of article manuscript for translation. The academic article will be published in the Department of Native Crafts' series Studia vernacula or elsewhere. The article can be based on previous research work or a master's thesis in the making. \nThe students should keep a diary according to the rules of the practice course and present a written practice report  where they comment and reflect on the practice as a whole as well as the manuscript creation, technical and cooperation aspects and time consumption.", "et": "Kinnistatakse aines Akadeemiline kirjutamine omandatu. Harjutatakse erinevates akadeemilistes žanrites valminud tekstide kohandamist avaldatavaks artikliks, suheldakse toimetajaga, valmistatakse artikli käsikiri või selle osa ette tõlkimiseks. Valmib ja ilmub teadusartikkel mõnes eelretsenseeritavas teadusajakirjas vm (nt Studia Vernacula jne).  Artikkel võib valmida varem sooritatud uurimustöö või teoksil magistriprojekti põhjal.\nÜliõpilane peab praktikapäevikut vastavalt praktikajuhendis määratletud korrale ning esitab kirjaliku praktikaaruande, kus kommenteerib ja reflekteerib üldist praktikakogemust ja käsikirja loomise protsessi, tehnilisi ja koostööaspekte ning ajakulu."}, "objectives": [{"en": "The aim of the course is to provide students with efficient and authoritative skills in academic writing.", "et": "Kursuse eesmärgiks on omandada efektiivse ja autoriteetse akadeemilise kirjutamise oskus."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the students should", "et": "Aine edukal läbimisel üliõpilane "}, {"en": "1) be able to express themselves in an academically correct manner in questions relating to their specialty;", "et": "1) oskab end erialastes küsimustes teaduslikult väljendada;"}, {"en": "2) be able to efficiently and correctly refer to their chosen system of reference;  ", "et": "2) oskab efektiivselt ja korrektselt viidata vastavalt valitud viitesüsteemile;"}, {"en": "3) be able to adapt their academic texts to the article to be published and cooperate with the editor; ", "et": "3) oskab oma akadeemilist teksti kohandada avaldatavaks artikliks ja teha toimetajaga toetavat koostööd;"}, {"en": "4) be able to review the research work of other students;", "et": "4) oskab retsenseerida üliõpilaste uurimistöid;"}, {"en": "5) be able to prepare Estonian texts for translation and supportively cooperate with the translator.", "et": "5) oskab emakeelset teadusteksti tõlkimiseks ette valmistada ning tõlkijaga toetavat koostööd teha."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}