{"uuid": "6d0a12c7-107d-aa2e-3e38-5b7bccb6783e", "code": "HVVK.00.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Traditional Music", "et": "Eesti pärimusmuusika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Introduction of Estonian folk music through its functions as musical mother tongue. Analysis of folk music collection, research, expression and popularization as different periodical strata constituting parts of general cultural lore. The historical background of major Estonian folk instruments, their development and usage. Contemporary use and styles of folk music in Estonia and elsewhere.", "et": "Tutvutakse eesti rahvamuusikaga läbi tema funktsioonide muusikalise emakeelena. Analüüsitakse rahvamuusika kogumise, uurimise, väljaandmise ja populariseerimise erinevaid ajalisi kihistusi üldise kultuuriloo arengu osana.\nTutvutakse eesti põhiliste rahvapillide ajaloolise tausta, ehituse, repertuaari ja mängijatega."}, "objectives": [{"en": "Provide an overview of the historical strata and functions of Estonian folk music as musical mother tongue, and analyze the strata against a variety of backgrounds.", "et": "Ainekursuse eesmärgiks on anda ülevaade eesti rahvamuusika ajaloolistest kihistustest ja funktsioonidest ning analüüsida neid erinevate taustsüsteemide suhtes.\nLisaks süvenetakse eesti rahvapillide ajaloo, ehituse, repertuaari ja mängijate teemadesse"}], "learning_outcomes": [{"en": "Knows, how musical traditions work and is able to find them in surrounding cultural environment.\nKnows the musical instruments that have been traditionally used in Estonian areas.\nKnows the most important publications and sources concerning Estonian traditional music.", "et": "Õpiväljundid\n*\tüliõpilane oskab määratleda enda positsiooni isiklikul muusikalise pärimuse maastikul, teadvustab selle kujunemislugu;\n*\toskab leida muusikalise pärimuse toimemehhanisme ümbritseva ühiskonna kultuuriloomes;\n*\torienteerub Eesti aladel kasutuses olnud pärimuslikes instrumentides, tunneb nende ehitust ja kujunemise ajalugu;\n*\ttunneb eesti pärimusmuusikaga seotud olulisimaid allikaid, publikatsioone ja institutsioone."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}