{"uuid": "05d98d2a-09e8-869e-102b-ccca1ea324a1", "code": "HVVK.12.044", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basic Course for Creative Entrepreneur", "et": "Loovettevõtja baaskursus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course consists of classroom lectures and group work, which covers the following topics:\n*basic entrepreneurship terminology;\n*finding, analysing, developing, and communicating project and business ideas; \n*the nature of a business process, its prerequisites and key components; \n*basic principles of budgeting, finding financiers to implement project and business ideas; \n*collecting and analysing background information (e.g. competition analysis) about project and business ideas;\n*business model as a concept and a tool for analysis;\n*the specifics of creative, social, and community entrepreneurship;\n*the fundamentals of marketing and communication;\n*factors impacting the business environment, such as legislation, taxation, organizing accounting, protecting intellectual property;\n*the nature of innovation process and managing innovation;\n*roles in teams and effective team management;\n*creating, formulating and presenting a project or busines plan.", "et": "Kursus koosneb auditoorsetest loengutest ja grupitöödest, mille raames kaetakse järgmised teemad: \n*ettevõtlusalane baasterminoloogia;\n*äri- ja projektiideede leidmine, analüüsimine, arendamine ja kommunikeerimine;\n*ettevõtlusprotsessi olemus, eeldused ja komponendid;\n*eelarvestamise põhialused, rahastajate leidmine;\n*äri- või projektiidee jaoks taustainformatsiooni kogumine ja analüüsimine (konkurentsianalüüs jne);\n*ärimudel kui kontseptsioon ja ärianalüüsi tööriist;\n*loomeettevõtluse, sotsiaalse ettevõtluse ja kogukondliku ettevõtluse eripärad;\n*turunduse ja kommunikatsiooni põhitõed;\n*ettevõtluskeskkonda kujundavad tegurid, sh seadusandlus, maksundus, raamatupidamise korraldamine, intellektuaalomand ja selle kaitse;\n*innovatsiooniprotsessi olemus ja innovatsiooni juhtimine;\n*rollid meeskonnas ja efektiivne meeskonnatöö korraldamine;\n*äriplaani või projekti koostamine, vormistamine ja esitlemine."}, "objectives": [{"en": "The aim of the course is to develop an entrepreneurial mindset, gain knowledge about entrepreneurship and use this knowledge to develop a business idea into business plan. During the course, students will obtain basic knowledge and practical skills to formulate and start implementing a business plan. The course ends with defending a business plan.", "et": "Kursuse eesmärk on arendada ettevõtlushoiakut, omandada ettevõtlusalaseid teadmisi ning rakendada need oma idee vormimisel äriplaaniks. Õppijad omandavad kursuse käigus põhiteadmised ning praktilised oskused (äri)plaani kavandamiseks, käivitamiseks. Kursus lõppeb äriplaanide esitlemisega."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students:", "et": "Kursuse edukal läbimisel üliõpilane:"}, {"en": "* recognize important social, cultural and economic trends and business opportunities arising from these trends, strategically select and develop business ideas into business models; ", "et": "* teab olulisemaid sotsiaalseid, kultuurilisi ja majanduslikke trende ning nendest tulenevaid ettevõtlusvõimalusi, valib strateegiliselt sobiva idee arendamiseks ning mudeldab seda;"}, {"en": "* understand the basics of team management, understand their role in the team and how to align their personal goals with the team's goals; ", "et": "* tunneb meeskonnatöö põhialuseid, tajub enda rolli meeskonnas, oskab seostada isiklikke eesmärke meeskonna eesmärkidega;"}, {"en": "* understand the concept of brand and the underlying principles of marketing and communication; ", "et": "* mõistab brändi olemust ning turunduse ja kommunikatsiooni põhialuseid;"}, {"en": "* understand different forms of entrepreneurship, business laws and regulations, and basic principles of taxation and budgeting;", "et": "* tunneb erinevaid ettevõtlusvorme (FIE, OÜ, MTÜ) ning on teadlik ettevõtlust reguleerivatest olulisematest seadustest, tunneb maksunduse ja eelarvestamise põhiprintsiipe;"}, {"en": "* understand the basic processes of procuct development, quality and risk management; ", "et": "* omab ülevaadet toote või teenuse arendamise põhiprotsessidest, kvaliteedi- ja riskijuhtimisest;"}, {"en": "* write a thorough business plan and know the basic presentation techniques.", "et": "* oskab vormistada äriplaani ning tunneb olulisemaid esitlustehnikaid."}, {"en": "In addition to that, upon successful completion of the \"Creative Entrepreneur\" micro-degree, the participants:", "et": "Loovettevõtja mikrokraadi edukalt läbinu oskab lisaks eelnevale:"}, {"en": "* know how to verify business hypotheses and test business models in the market situation; ", "et": "* püstitada sobivaid hüpoteese äriidee ja ärimudeli testimiseks turusituatsioonis;"}, {"en": "* know how to develop business ideas and business models based on the evidence collected from the market; ", "et": "* turusituatsioonis kogutud andmetele tuginedes enda äriideed ja ärimudelit edasi arendada;"}, {"en": "* know how to pitch business ideas to potential investors.", "et": "* ideed investoritele esitleda."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}