{"uuid": "dac7c3bb-f85f-f374-38e4-a90cfe66e9bf", "code": "HVVK.00.092", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-19T17:08:05", "title": {"en": "Marketing Strategies and Brand Communication", "et": "Turundusstrateegiad ja brändi kommunikatsioon"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The subject focuses on the understanding and practical application of marketing strategies and brand communication in various business environments. Students learn to analyze marketing and communication problems and develop solutions that meet their needs. The course also covers various marketing tactics, such as advertising, sales promotion, public relations and social media, and teaches how to apply these tactics effectively. At the end of the course, students develop a marketing and communication strategy suitable for their idea.", "et": "Aine keskendub turundusstrateegiate ja brändi kommunikatsiooni mõistmisele ja praktilisele rakendamisele erinevates ärikeskkondades.  Õpilased õpivad analüüsima turundus- ja kommunikatsiooniprobleeme ning töötama välja lahendusi, mis vastavad nende vajadustele. Aine käigus käsitletakse ka turunduse erinevaid taktikaid, nagu näiteks reklaam, müügiedendus, avalikud suhted ja sotsiaalmeedia, ning õpetatakse, kuidas neid taktikaid tõhusalt rakendada. Aine lõpuks töötavad tudengid välja oma ideele sobiva turundus- ja kommunikatsioonistrateegia."}, "objectives": [{"en": "The purpose of the subject is to introduce the fundamentals of marketing and brand communication and to provide an overview of various strategies and tactics that can be used in the planning and implementation of marketing activities and brand communication.", "et": "Õppeaine eesmärk on tutvustada turunduse ja brändi kommunikatsiooni põhialuseid ning anda ülevaade erinevatest strateegiatest ja taktikatest, mida saab kasutada turundustegevuste ja brändi kommunikatsiooni kavandamisel ja rakendamisel."}], "learning_outcomes": [{"en": "The student: *understands the nature and importance of marketing strategies and communication in a business environment; *analyzes marketing and communication problems and solves them effectively; *creates a marketing and communication strategy suitable for their idea, presents it and implements it in their creative project.", "et": "Üliõpilane: *mõistab turundusstrateegiate ja  kommunikatsiooni olemust ja tähtsust ärikeskkonnas; *analüüsib turundus- ja kommunikatsiooniprobleeme ning lahendab neid tulemuslikult; *loob oma ideele sobiva turundus- ja kommunikatsioonistrateegia, esitleb seda ning rakendab oma loovprojektis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}