{"uuid": "f4dd6315-1445-2903-d431-1191efbc3cda", "code": "HVVK.04.099", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sound Design", "et": "Helikujundus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In the first part different types of microphones and recording equipment is introduced. This part is dedicated to different software meant to work with sound files. Second part consists of practical assingment, where student makes sound for one piece of video.", "et": "Esimeses osas tutvustatakse ja toimub töö erinevat tüüpi mikrofonidega, salvestustehnikaga ning toimub töö helimontaažiks mõeldud tarkvaraga. Teises osas läbitakse praktiline ülesanne, kus helindatakse video- või filmilõiku."}, "objectives": [{"en": "The course aims at providing an overview of sound recording, sound processing in digital environment and problems connected to it.", "et": "Kursuse eesmärgiks on anda tudengitele põhiteadmised helisalvestusest, montaazhist ja helindamisest."}], "learning_outcomes": [{"en": "In the first part of the course, the student gets an overview, theoretical knowledge and practical skills to work with different type of recording equipment. Student is acquianted with how to work with digital sound files and use different effects. In the second part student learns how to put together music and video files. Graduates of this course will be able to record music and sounds, to work with them and to apply special effects on the recorded material. He/she also has an overview of the possibilities to make sound and soundtracks for films and videos.", "et": "Kursuse esimeses osas omandab üliõpilane ülevaate, teoreetilised teadmised ja praktilised oskused tööks erinevat tüüpi helisalvestustehnikaga ning omandab teadmised digitaalsete helifailide montaazhist, erinevatest efektidest ja failitöötluse võimalustest. Kursuse teises osas omandab üliõpilane teoreetilised ja praktilised teadmised video ja filmi helindamisest. Kursuse edukalt lõpetanu orienteerub erinevates helisalvestusvõimalustes, oskab kvaliteetselt heli salvestada, seda monteerida ja kasutada eriefekte. Samuti on tal ülevaade filmi helindamistehnikatest ja võimalustest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}