{"uuid": "873b4753-2616-e95e-4df1-b2d9797002d1", "code": "HVVK.04.116", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Dance Composition", "et": "Tantsukompositsioon"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 3, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students analytical and selective skills are enhanced together with concrete working skills. \nStudents also learn to adjust their individualities to concrete situation and to finalise their inspiration in a finished piece.\nStudents create larger dance works, learn to develope their own original dance language, and work with a scenario. \nTroughout the course students analytical skills are developed. The course prepares students for their graduation work.", "et": "Tegeletakse kehaga erinevatesse kontekstidesse paigutatuna ja kehaga erinevate kunstiliikide kompositsioonis.\nOskuste suurendamine teadvustatud valikute tegemisel kompositsiooni loomisel.\nArendatakse oskust rakendada oma loovust ja fantaasiat läbi tantsuliste väljendusvahendite, oskust tantsijaga koostööd teha ja julgust eksperimenteerida.\nKoreograafiliste jadade loomine, sooritamine, uurimine, arvestades liikumiskvaliteete, ruumi, partnerit, aega, valgust ja heli. Liikumismaterjali komponeerimisel ettetulevate valikute teadvustamine.\nArendatakse analüüsivõimet ja selekteerimisoskust; omandatakse repetiitori töökogemust; töö stilistikaga; konkreetsete töövõtete tutvustamine ja individuaalne kohandamine; abistavate kunstide kaasamine; töö lõplik vormistamine; ettevalmistus ja kasvamine praktiliseks lõputööks - lavastuseks.\nTegeletakse pre- ja postperformatiivsuse mõistetega."}, "objectives": [{"en": "The aims of the subject:", "et": "- Anda teadmised tantsukompositsiooni reeglitest, meetoditest ja erinevatest ideelistest väljunditest; "}, {"en": "- Knowledge about the rules, methods and different conceptual outputs of dance composition; ability to apply this knowledge in practical works;", "et": "- Oskused teadmisi rakendada praktilistes töödes, "}, {"en": "- Designing a suitable ground for shaping students; courage for creation and personal working skills;", "et": "- Tudengi loomisjulguse ja isiklike töövõtete kujundamiseks sobiva pinnase kujundamine;"}, {"en": "-The development into a creative person and the implementation of individual creativeness.", "et": "- Loovisiksuseks kasvamine ja individuaalse loovuse rakendamine."}], "learning_outcomes": [{"en": "-Demonstrates different alternatives for finding and selecting movements\n\n-Is able to use choreographic material to carry out her/his idea for performance.\n\n-Carries out the finalization of a dance with a dancer/dancers for a public performance (repetitor work)\n\n-Composes and presents dance performace.", "et": "-Demonstreerib erinevaid liigutuste leidmise, selekteerimise võimalusi.\n\n-Oskab liigustuslikku materjali kasutada oma lavastusliku idee teostamiseks.\n\n-Teostab viimistlustöö tantsija(te)ga lavastuse avalikuks esituseks (repetiitoritöö)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}