{"uuid": "2ed2a7d1-2c58-f729-9c68-80b69ba38522", "code": "HVVK.04.088", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Dance Teacher Project", "et": "Tantsuõpetaja projekt"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 3, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In this course, all formerly learnt material from throughout the course, is outlined. To solve tasks, practical and theoretical pedagogical knowledge acquired from different courses, are used. To deal with research questions in dance pedagogy and dance art different professionals-practitioners are involved in the process. Discussions, themes and questions are guided to support the master project to be completed. Taking part in dance and art education projects. Gathering materials, presenting them and getting/giving feedback. Treating the interdisciplinary in dance and art education. Presenting of problems arising from practical works.", "et": "Kursusel võetakse kokku kogu eelnevas õppeprotsessis omandatu. Kasutatakse teoreetilisi ja erinevate ainete raames omandatud praktilisi pedagoogilisi teadmisi püstitatud ülesannete lahendamiseks. Kaasatud on erinevad professionaalid-praktikud tantsupedagoogiliste ja tantsukunsti uurimisküsimustele vastuste otsimiseks. Arutelud, teemapüstitused, küsimused ja diskussioonid on suunatud toetuseks valmivale magistritööle.\nOsaletakse jooksvates tantsukunsti- ja kunstiharidusprojektides.\nEsitatakse kogutud materjale ja antakse tagasisidet.\nKäsitletakse interdistsiplinaarust tantsu- ja kunstiõpetuses.\nEsitletakse praktiliste tööde valmistamisega seotud probleeme."}, "objectives": [{"en": "Create premises for understanding, creating and teaching interdisciplinary dance art. Give reviews and create conditions for using a versatile teaching methods in schools and the professional practice of a teacher. Through practical creative and collaborative tasks develop teachers different competences. Include learners in a professional learning community to support their self-development as a teacher. To support the students development to ripen their master project.", "et": "Luua eeldused interdistsiplinaarse tantsukunsti mõistmiseks, loomiseks ja õpetamiseks.\nAnda ülevaade ja luua tingimused mitmekülgse õppemetoodika kasutamise võimalustest koolis ja õpetaja professionaalses praktikas. Arendada läbi praktiliste loov- ja koostööülesannete erinevaid õpetaja pädevusi. Kaasata õppijad professionaalse õpikogukonna tegevustesse toetamaks nende enesearengut õpetajana. Toetada õppija arengut magistritöö valmimise suunas."}], "learning_outcomes": [{"en": "1. Is familiar with the term 'interdisciplinary dance as an art form';", "et": "1. Tunneb interdistsiplinaarse tantsukunsti mõistet;"}, {"en": "2. is able to verbalise and justify their ideas;", "et": "2. oskab oma ideid sõnaliselt väljendada ja põhjendada;"}, {"en": "3. gets a practical experience from a long term working process in working out an idea and its form:", "et": "3. saab praktilise kogemuse pikemaajalisest tööprotsessist idee ja vormi väljatöötamisel;"}, {"en": "4. is acquainted with different age-, theme- and goal specific teaching methods and begins to create their own individual method;", "et": "4. on tutvunud erinevate ea-, teema- ja eesmärgikohaste õppemeetoditega ning alustab oma isikupärase metoodika loomist;"}, {"en": "5. understands the effect of creative activities on pupils age specific and developmental differences and knows how to take them into account in organising the study.", "et": "5. mõistab loova tegevuse mõju õpilaste ealistele ja arenguliste erisustele ning teab, kuidas nendega arvestada õppetöö korraldamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}