{"uuid": "ccbcd421-5a01-d11d-1d82-d689bf45fc81", "code": "HVVK.00.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Culture Management Seminar", "et": "Kultuurikorralduse seminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 4, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The main axis of the course are seminars that consist various discussions, group assignments and presentations. Every seminar is divided into several tasks (e.g. reflections of cultural calendar, specifics of certain knowledge or experiences, drafting or preparation of projects or other formats). The course also involves written tasks and individual assignments.", "et": "Aine koosneb seminaridest, mille käigus toimuvad erinevad arutelud, rühmatööd ja esitlused. Iga seminar jaguneb mitmeks põhiosaks või ülesandeks (nt hetkel kultuuri- või ühiskonnaelus toimuva reflekteerimine või analüüsimine, teatud teadmiste või oskuste olulisuse või spetsiifika kirjeldamine, erinevate arendustegevuste või projektide ettevalmistamine jmt). Lisaks koostatakse aine raames erinevaid kirjalikke ülesandeid ja iseseisvaid töid, mis aitavad seminarideks valmistuda."}, "objectives": [{"en": "The aim of the seminar is to discuss:\n1. What are the most important events and trends of regular culture calendar?\n2. How these impacts influence the role of culture management?\n3. How are these impacts related to the studies of culture management?\n4. What are the most important preconditions or challenges when studying culture management?", "et": "Seminaris osalemise eesmärgiks on lahti mõtestada:\n1. Millised on igapäevases kultuurielus toimuvad olulisemad sündmused või neid mõjutavad trendid?\n2. Kuidas need mõjutavad kultuurikorraldaja rolli ja selle ajas muutumist?\n3. Mida peaks oma õpingute juures sellega seoses silmas pidama?\n4. Millised on kultuurikorralduse eriala üliõpilasele vajalikud eeldused või olulisemad takistused õpitaval erialal professionaaliks kujunemisel?\nLisaks on õppeaine eesmärgiks pakkuda üliõpilastele võimalus neil teemadel omavahel arutada, tutvustada erinevaid vaateid, seniseid kogemusi ja seisukohti."}], "learning_outcomes": [{"en": "Expected results of the seminar:\n- the student has basic understanding of the toolkit of analysing cultural life and its various expressions;\n- the student is able to analyse the role of culture manager;\n- the student has an overview about various expectations that a professional culture manager has to meet.\nSisu lühikirjeldus", "et": "Õppeaine läbimise tulemusena üliõpilane:\n- omab esmaseid kogemusi ja oskusi kultuurielus toimuva anlüüsimiseks;\n- suudab analüüsida ja mõtestada kultuurikorraldaja rolli olemust ja kujunemist;\n- oskab lahti mõtestada eeldusi, mille täitmine on vajalik, et tegutseda tulevikus valdkonna professionaalina."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}