{"uuid": "640912fe-f0a6-47f1-5ade-34da06f184e4", "code": "HVVK.01.215", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-02T11:56:57", "title": {"en": "Artificial materials", "et": "Tehismaterjalide õpetus"}, "credits": 8, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Plastics in everyday life. Properties and areas of use of plastics. Production, utilization and recycling of plastics. Processing of plastics. Bending and shaping of plastics. Creation of plastic objects from sheet plastic. Processing, recycling, reprocessing of materials based on wood fiber and wood composites. Creating a product from recycled materials. Testing and analysis of materials. Industrial examples. Prototyping.", "et": "Plastid igapäevaelus. Plastide omadused ning kasutusalad. Plastide valmistamine, utiliseerimine ja taaskasutamine. Plastide töötlemine. Plastide painutamine ja vormimine. Lehtplastist plastesemete loomine. Puidukiul ja puidukeemial põhinevate materjalide töötlemine, taaskasutamine, ümbertöötlemine. Ringlussevõetud materjalidest toote loomine. Materjalide katsetamine ja analüüs. Tööstuslikud näited. Prototüüpide valmistamine. "}, "objectives": [{"en": "Knowledge of the properties of artificial materials and traditional and new processing technologies. Materials evaluation and their systematic collection, processing, recycling, reuse, disposal.", "et": "Tehismaterjalide omaduste ja nii traditsiooniliste kui uute töötlemisprotsesside tundmine. Materjalide väärtuse hindamine ja nende süsteemne kogumine, töötlemine, ümbertöötlemine, taaskasutamine, utiliseerimine."}], "learning_outcomes": [{"en": "After passing the course student\nAfter passing the course student\n- has knowledge of the properties of plastic materials, areas of use, sorting as waste, recycling, reuse; can distinguish different types of plastics;\n- is aware of the dangers associated with plastics;\n- can process plastic materials manually;\n- has general knowledge of the types, properties, areas of use, sorting as waste, recycling, reuse of materials based on wood fiber and wood chemistry;\n- can distinguish different materials based on wood fiber and composites.", "et": "Õppeaine läbinud õppija:\n- omab teadmisi plastmaterjalide omadustest, kasutusaladest, jäätmena sorteerimisest, ümbertöötlemisest, taaskasutamisest; oskab eristada erinevaid plastiliike markeeringu järgi;\n- on teadlik plastidega kaasnevatest ohtudest;\n- oskab plastmaterjale käsitsi töödelda;\n- omab üldteadmisi puidukiul ja puidukeemial põhinevate materjalide liikidest, omadustest, kasutusaladest, jäätmena sorteerimisest, ümbertöötlemisest, taaskasutamisest;\n- oskab eristada erinevaid puidukiul ja puidukeemial põhinevaid materjale. "}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}