{"uuid": "2d62ce1e-bc7d-0ff5-f943-a182fd7fb1b0", "code": "HVVK.01.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-10T09:56:46", "title": {"en": "Self-management and Teamwork", "et": "Enesejuhtimine ja meeskonnatöö"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "- Introduction: the essence of the course and its goals. \n- Setting goals and clarifying the goal with coaching. Methods for reaching consensus.\n- Self-analysis using DISC personality profiles and other similar methods.\n- Meeting formats according to Patrick Lencioni. Group coaching methods by Marshall Goldsmith for enhancing teamwork.\n- Key motivators according to Susan Weinschenk.\n- Mapping personal and team actions and setting priorities. Planning skills in Google Calendar, Trello and planner.\n- Handling unexpected events, distractions and obstacles. Avoiding procrastination. Pomodoro technique.\n- Natural planning of the projects according to David Allen. Using mind map in planning.\n- Filing basics.\n- Difference between group and team. Main stags in team development. Key skills in conflict management. \n- Team work features in global, cross-cultural, virtual and self-regulatory teams.", "et": "- Sissejuhatus ajajuhtimisse. Eesmärgi püstitamine ja selle täpsustamine coachinguga. Konsensusliku otsuseni viivad tehnikad.\n- Enda analüüs DISC-isiksuseprofiili jt teiste sarnaste meetodite abil.\n- Koosolekute formaadid Patrick Lencioni järgi. Marshall Goldsmithi meeskonna arengut järgmisele tasemele tõstvad rühmacoachingu meetodid.\n- Inimeste motivaatorid Susan Weinschenki järgi.\n- Oma tegevuste kaardistamine ja prioriteetide paikapanek. Google Calendari, Trello ja märkmiku otstarbekas kasutamine. \n- Ootamatuste ja takistustega toimetulek. Venitamise vältimine. Pomodoro tehnika.\n- Projekti loomulik planeerimine. Mõttekaardi koostamine.\n- Arhiveerimise põhitõed.\n- Rühma ja meeskonna vahe. Rühma arenguprotsessi põhistaadiumid. Konfliktijuhtimise põhivõtted.\n- Meeskonnatöö iseärasused globaalsetes, kultuuridevahelistes, virtuaalsetes ja isereguleeruvates meeskondades."}, "objectives": [{"en": "Develop understanding of teamwork principles.", "et": "Kujundada arusaam meeskonnatöö ning isikliku ja meeskondliku tegevuste juhtimise põhimõtetest."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "- set personal and team goals and are able to create a plan for reaching the goal;\n- can analyse their strengths and weaknesses as a member of the team;\n- understands the key processes in internal communication of the team;\n- understands the key motivators for the team members;\n- can map ja prioritise tasks in the smaller projects;\n- understands the natural planning principles in case of smaller projects and can implement those principles as well as draft the project mind map; \n- can use Google Calendar, Trello and planner for planning personal and team tasks;\n- understands the reasons for procrastination and can find out the causes for dealing with distractions, unexpected events and obstacles;\n- understands the basics of filing and can implement those methods in their personal archive;\n- differentiates between a group and team;\n- can explain the establishing of a group and its development model;\n- understands the dynamics of the roles and standards in a team;\n- can differentiate between global, intercultural; virtual and self-regulatory teams; \n- know what issue may arise while working in a team.", "et": "Kursuse edukalt läbinud üliõpilane \n- oskab püstitada enda ja meeskonna eesmärke ning suudab välja selgitada neist eesmärkidest lähtuva tegevuskava;\n- oskab analüüsida enda kui meeskonna liikme tugevusi ja nõrkusi;\n- tunneb peamisi meeskonnasisese suhtluse põhimõtteid;\n- mõistab meeskonnaliikmete peamisi motivaatoreid;\n- suudab kaardistada ja prioritiseerida lihtsamate projektide tegevusi;\n- mõistab projekti loomuliku planeerimise põhimõtteid, oskab neid lihtsamate projektide puhul rakendada ning koostada vastavat mõttekaarti;\n- oskab otstarbekalt kasutada Google Calendari, Trellot ja märkmikku;\n- teadvustab venitamiste peamisi põhjuseid ja oskab selgitada ootamatuste ja takistuste ületamise võtteid; \n- tunneb arhiveerimise põhitõdesid ja oskab neid isikliku arhiivi kujunduse või kujundusplaani näitel selgitada;\n- teeb vahet rühmal ja meeskonnal;\n- oskab selgitada rühma rajamise ja selle arendamise mudelit;\n- mõistab rühma käitumise dünaamikat;\n- oskab tea valet globaalsel, kultuuridevahelisel, virtuaalsel ja isereguleeruval meeskonnal ning teab, millised probleemid võivad erinevates tiimides kerkida."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}