{"uuid": "b800c3c2-bcde-c6de-90e6-e5edb1e3c5df", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-16T14:41:58", "title": {"en": "Estonian Traditional Music", "et": "Eesti pärimusmuusika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode part 2 3 CP HV", "et": "24/25 K SÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Introduction of Estonian folk music through its functions as musical mother tongue. Analysis of folk music collection, research, expression and popularization as different periodical strata constituting parts of general cultural lore. The historical background of major Estonian folk instruments, their development and usage. Contemporary use and styles of folk music in Estonia and elsewhere.", "et": "Tutvutakse eesti rahvamuusikaga läbi tema funktsioonide muusikalise emakeelena. Analüüsitakse rahvamuusika kogumise, uurimise, väljaandmise ja populariseerimise erinevaid ajalisi kihistusi üldise kultuuriloo arengu osana.\nTutvutakse eesti põhiliste rahvapillide ajaloolise tausta, ehituse, repertuaari ja mängijatega."}, "objectives": [{"en": "Provide an overview of the historical strata and functions of Estonian folk music as musical mother tongue, and analyze the strata against a variety of backgrounds.", "et": "Ainekursuse eesmärgiks on anda ülevaade eesti rahvamuusika ajaloolistest kihistustest ja funktsioonidest ning analüüsida neid erinevate taustsüsteemide suhtes.\nLisaks süvenetakse eesti rahvapillide ajaloo, ehituse, repertuaari ja mängijate teemadesse"}], "learning_outcomes": [{"en": "Knows, how musical traditions work and is able to find them in surrounding cultural environment.\nKnows the musical instruments that have been traditionally used in Estonian areas.\nKnows the most important publications and sources concerning Estonian traditional music.", "et": "Õpiväljundid\n*\tüliõpilane oskab määratleda enda positsiooni isiklikul muusikalise pärimuse maastikul, teadvustab selle kujunemislugu;\n*\toskab leida muusikalise pärimuse toimemehhanisme ümbritseva ühiskonna kultuuriloomes;\n*\torienteerub Eesti aladel kasutuses olnud pärimuslikes instrumentides, tunneb nende ehitust ja kujunemise ajalugu;\n*\ttunneb eesti pärimusmuusikaga seotud olulisimaid allikaid, publikatsioone ja institutsioone."}], "notes": {}}, "grading": {"independent_work": {"et": "Regilaulude kuulamine, noodistamine, salvestise põhine harjutamine\nKodulugemine, kirjalike kokkuvõtete koostamine\nRegilaulude kuulamine: www.folklore.ee/pubte/eraamat/rahvamuusika\nUuemate rahvalaulude kuulamine Moodle keskkonnas: ERA salvestised: Eesti rahvalaule ja pillilugusid II. Tartu 1974. Salvestised ja tekstiraamat.\n2) Artiklite lugemine: semestri jooksul 2 artiklit, mille kohta koostada kirjalikud kokkuvõtted (1-2 lk) ja esitada see vastavalt tähtajaks.\n* Artikleid ja arutlusi eesti kirikumuusikast. EELK Kirikumuusika Liit. Tallinn 2003. - Urve Lippus, Rahvapärased koraalivariandid Eestis.\n* I. Rüütel. Eesti uuema rahvalaulu kujunemine. Eesti Kirjandusmuuseumi Teaduskirjastus, 2012. Lk 21-34 ja 351-375.\n3) Välitöö: oma suguvõsa laulutraditsiooni uurimine. Läbi viia küsitlused ja intervjuu, mille põhjal koostada kokkuvõtlik aruanne."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "A - küsimustikus on õigete vastuste protsent vähemalt 95%, keelekasutus on korrektne;\nB - küsimustikus on õigete vastuste protsent vähemalt 85%, keelekasutus on korrektne;\nC - küsimustikus on õigete vastuste protsent vähemalt 75%, keelekasutus on korrektne;\nD - küsimustikus on õigete vastuste protsent vähemalt 65%, keelekasutus on üldiselt korrektne, esineb üksikuid vigu;\nE - küsimustikus on õigete vastuste protsent vähemalt 60%, keelekasutuses esineb vigu;\nF - küsimustikus on õigete vastuste protsent vähemalt 49%, keelekasutus on vigane."}}, {"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "praktiline osa: kava koostamine ja laulude esitamine (kavas kokku 5 laulu, sh vähemalt 1 regilaul, 1 uuem rahvalaul; laulude esitamine peast; laulude õppimine soovituslikult arhiivisalvestiste järgi). Hindamisel lähtutakse üliõpilase individuaalsest arengust."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "A - laulude kava on õigeaegselt esitatud, laulude esitamisel on tunda sisulist süvenemist ja ehedat lähenemist, esitused on kaasahaaravad, igati on arvestatud rahvapärase esitusstiili tunnustega.\nB - laulude kava on õigeaegselt esitatud, laulude esitamine on kaasahaarav ja rahvapärase esitusstiili tunnuseid arvestav.\nC - laulude kava on esitatud õigeaegselt, laulude esitamine on ladus ja üldiselt on rahvapärase esitusstiili tunnuseid arvestav.\nD - laulude kava on esitatud õigeaegselt, laulude esitamisel esineb üksikuid takistusi, esitusel on kuulda taotlusi rahvapärase esituststiili tunnuste kasutamiseks.\nE - laulude kava on esitatud tähtajast hiljem, laulude esitamisel esineb mõningaid takistusi, esitusel kasutatakse üksikuid rahvapärase esitusstiili tunnuseid.\nF - laulude kava on esitatud tähtajast hiljem, laulude esitamisel kasutatakse abimaterjale, esituses esineb suuri takistusi, rahvapärase esitusstiili tunnuseid pole üldse arvestatud."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Esitatud kirjalikud lühikokkuvõtted"}}], "grade_preconditions": {"et": "Osalemine auditoorses töös 75%. Noodistuste esitamine."}, "grade_evaluation": {"et": "Regilaulude, uuemate rahvalaulude ja rahvakoraalide esitamine rakendades traditsioonilise esitusstiili tunnuseid"}, "debt_elimination": {"et": "kokkuleppel aine õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Eesti rahvamuusika antoloogia. Tartu, 2003.\nRegilaul - keel, muusika, poeetika. Toim. T. Jaago, M. Sarv. Eesti Kirjandusmuuseum. Tartu, 2001.\nRegilaul - loodud või saadud. Toim. M. Sarv. Eesti Kirjandusmuuseum. Tartu, 2004.\nRegilaul - esitus ja tõlgendus. Toim. A. Lintrop. Eesti Kirjandusmuuseum. Tartu, 2006.\nRegilaulu müüdid ja ideoloogiad. Toim. M. Sarv. Eesti Kirjandusmuuseum. Tartu, 2012.\nRegilaulu kohandamine ja kohandajad. Toim. J. Oras, A. Kalkun, M. Sarv. Eesti Kirjandusmuuseum. Tartu, 2014.\nEesti rahvalaule ja pillilugusid II. Teaduslik antoloogia. Koostanud I. Rüütel, H. Tampere, E. Tampere. Tartu, 1974.\nI. Rüütel. Eesti uuema rahvalaulu kujunemine. Eesti Kirjandusmuuseumi Teaduskirjastus, 2012.\nNB! Lk 21-34 ja NB! 351-375.\nI. Rüütel. Eesti uuemad laulumängud I. Tallinn 1980. Lk 9-38.\nEesti rahvamuusika antoloogia. Koostanud H. Tampere, E. Tampere, O. Kõiva. Veebiväljaanne www.folklore.ee/pubte/eraamat/rahvamuusika", "recommended_materials": "Ü. Tedre, V. Tormis. Uus regilaulik. SP Muusika.\nC. Roose. Kooli folkloorikogumik. AS BIT, 2003.\nI. Rüütel. Eesti uuemad laulumängud. I ja II osa. Tallinn, 1980.\nPärimuslikud laulumängud lastele. Koostanud J. Suits. Viljandi, 2014.\nC. Roose. Kooli folkloorikogumik. AS BIT, 2003.\nVHK käsikirjaline väljaanne - Rahvakoraalid"}, "participants": {"lecturers": [{"person_uuid": "7df22d63-2ade-b91d-2b3f-f6487f175eb7", "person_name": "Celia Roose", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus ainesse. Rahvalaulu õppimise põhimeetodid. Tänapäevaste esituste ja arhiivisalvestiste kuulamine ning analüüs"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Rahvapärase esituse stiilitunnused: varieerimine, rütm (välted), meetrum, hingamine, toon, rõhud."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Rahvalaulude ajaloolised kihistused. Regilaulude liigitamine. Regilaulu teksti tunnused (riim, vorm, värsimõõt)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Regilaulu viisi tunnused (vorm, laad, ulatus jne)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Eesti uuema laulustiili kujunemine. Uuema rahvalaulu tunnused. Uuema rahvalaulu käsitlused XX sajandil. Uuema rahvalaulu liigitamine. Välitöö metoodika põhimõtted."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Siirdevormiliste laulude liigid. Rahvalaulude esitusstiili analüüs. Regilaulud esitusstiili oluliste tunnuste analüüs ja praktiseerimine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Rahvakoraalide kujunemise põhjused, ajalooline ülevaade. Rahvakoraalide tekstid ja viisid, ülevaade piirkondlikest iseärasustest, viisi varieerimise põhimõtted."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Välitööde esitlused, analüüs, kokkuvõte. Rahvalaulude tänapäevaste esituste analüüs."}}]}, "registration_info": {"audience": {"et": "Muusika õppekava koolimuusika suuna SÕ üliõpilased"}, "min_students": 1}, "parent_uuid": "6d0a12c7-107d-aa2e-3e38-5b7bccb6783e", "parent_code": "HVVK.00.037", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}