{"uuid": "e335c388-e2cd-f88b-6d14-79e514c17062", "code": "HVVK.04.136", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Studies of Form and Plastic Anatomy Basics", "et": "Vormiõpetus ja plastilise anatoomia alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 4, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of trends in studys of forms.\nImprove sculptoral sens of form by modelling human figure. The course provides an overview of casting in plaster, bronze or something else permanent material.", "et": "Kursus annab ülevaate vormiõpetuse suundadest ja juhib tähelepanu selle aine õppimise vajalikkusele butafoori tööks. Õpetab modelleerimist klassikaliste skulptuuride kipsdetailide järgi nii 1:1-le kui suurendades. Lisaks kasutatakse lihtsamaid tehnoloogilisi nippe. Tutvutakse elava modelli järgi voolimisega. Silmaringi laiendamiseks vaadatakse VKA-sse tellitud ajakirja \"SCULPTURE\".\nSkulptuurse vormitunde arendamine inimfiguuri voolimise teel. Kipsivalamise või mingisse muusse püsimaterjali viimise õpetamine."}, "objectives": [{"en": "Introduce knowledges and skills about sculptures to the prop-makers. To teach technological approaches and the observance of form.\nPurpose of study: teach to use Plastic Anatomy elementary knowledge in sculping the figure. Practisise to observe main criteriors of sculptural form teaching.", "et": "Tutvustada butafoori kutsetööks vajalikke skulptuuriga seotud teadmisi ja oskusi. Õpetada tehnoloogilisi võtteid, vormi jälgimist ja käelist mõtlemist. Õpetamine toimub lihtsamalt keerulisemale. Õpetada modelleerimisel kasutama plastilise anatoomia algteadmisi. Harjutada skulptuurse vormiõpetuse põhikriteeriumite järgimist."}], "learning_outcomes": [{"en": "Can use the simplest practical techniques of sculpture: modeling in clay, using and prepearing the frame. Student is able to copy the simplest natural forms, have image about sculpture as the kind of art.\nCan model the human body all by itself; both fully three- dimensional and relief sculpture;\nIs able to turn attention to fundamental characters of form: proportions, trends, volumes, space, etc; In the end of course is master of modelling as well technological skills.", "et": "Õppeaine läbides üliõpilane:\n- oskab kasutada esmaseid skulptuuri praktilisi võtteid: modelleerimine savis või mõnes teises pehmes materjalis;\n- oskab teostada lihtsamat kipsivalu, karkasside (aluste) kasutamine ja valmistamine;\n- on võimeline iseseisvalt kopeerima algelisemaid loodusvorme, modelleerima kipsmudeli järgi;\n- suudab mingil määral kasutada elavat modelli;\n- omab üldistatud ettekujutust skulptuurist kui kunstiliigist.\nOskab iseseisvalt inimkeha modelleerida, nii ümarplastiliselt kui ka reljeefina. On võimeline tähelepanu pöörama peamistele vormitunnustele: proportsioonid, mahud, suunad, ruum, jne. Valdab kursuse lõpuks modellerimist, kui tehnilist oskust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}