{"uuid": "9dd12ced-a0ca-6114-3b54-415278cc10f2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-21T08:42:54", "title": {"en": "Folk Adornment I", "et": "Etnograafiline ehe I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode part 2 3 CP HV", "et": "24/25 K SÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "28f4d406-1225-bf8d-0c52-b14beed91591", "code": "HVVK.01.168", "title": {"en": "Basics of Jewellery Making", "et": "Ehtevalmistamise algkursus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": false, "uuid": "bc9a5fe6-421b-b85b-1629-628aa6176e0b", "code": "P2VK.01.364", "title": {"en": "Introduction of Speciality", "et": "Sissejuhatus erialasse"}, "credits": 3, "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36"}, {"required": false, "uuid": "ea25ac40-e681-62e4-9e43-80d77bdc0acd", "code": "P2VK.01.370", "title": {"en": "Basics of Jewellery I", "et": "Ehtevalmistamise algkursus I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "To give an overview of the etnographical metal accessories and jewellery  like belts, buckles, main ornaments, tin ornaments, copper ornaments, knife sheaths, needle stands,pins, sleigh bells, rings, chest adornments, silver plate-beads for necklaces (krõllid), chains, bands, pendants, engagement brooches, flat brooches with stones. To teach how to design and make them. The choice between different items will be made by the lecturer.", "et": "Antakse ülevaade etnograafilistest metalldetailidest ja ehetest, nagu näiteks vööd, pandlad, malid, tinulised, vaselised, noatuped, nõelakojad, naastud, kuljused, rõhud, sõrmused, rinnaehted, krõllid, ketid, keed, ripatsid, kihlasõled, silmadega preesid jm. Õpetatakse neid kujundama ja valmistama. Valiku valmivatest esemetest teeb õppejõud."}, "objectives": [{"en": "To introduce the design and techniques of making etnographical jewellery and costume details.", "et": "Etnograafiliste ehete ja rõivadetailide kujundamise ning valmistamise võtete tutvustamine."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "Upon successful completion of the course,the students should have an overview, can design and make the etnographical metal jewellery and costume accessories.", "et": "Aine edukal läbimisel üliõpilane omab ülevaadet, oskab kujundada ja valmistada erinevaid etnograafilisi metallehteid ja rõivadetaile."}], "notes": {"et": "Ajakava on kirjas rahvusliku metallitöö tunniplaanis\nHindab õppejõududest ja erialaspetsialistidest koosnev komisjon.\nHindamine toimub tunniplaanis ettenähtud hindamispäeval. \nValminud töödest tehakse valik rahvusliku metalli eriala õppetööde fondi. Valiku teeb hindamiskomisjon või õppejõud.\n\n\n\nThe schedule is included in the national metalwork schedule\nEvaluated by a committee of lecturers and specialists.\nThe assessment will take place on the assessment date specified in the lesson plan.\nA selection of the completed works will be made to the Study Fund. The selection is made by the evaluation committee or the lecturer"}}, "grading": {"independent_work": {"et": "1. Kavandid etteantud ehetele. Kavandid on omaloomingulised kuid põhinevad etnograafilistel (18.-19. saj.) näidetel mida on võimalik vaadata erinevates Eesti muuseumites.\n2. Praktikumides alustaud ehte iseseisev lõpetamine."}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Aine hindamise aluseks on õpiväljundites esitatud teadmiste ja oskuste omandamine. Hindamisele kuuluvad: etteantud ülesannete sooritamiste hulka ja kvaliteet, õppetööst osavõtmise aktiivsus, töökoha korrashoid ja töövahendite otstarbekas kasutamine, juhendaja poolt ettenäidatud töövõtete ja soovituste järgimine, loominguline suhtumine antud ülesannetesse, valminud tööde korrektne viimistlus ja eksponeerimine esitlusel.\n\nÜliõpilase õpiväljundite hindamine toimub kuuepallisüsteemis järgmiselt:\nA ehk \"suurepärane\"- ainekava mahust on omandatud 100%. Üliõpilane on tundides aktiivselt osalenud ja näidanud välja motiveeritud suhtumist. Kõik etteantud tööd on sooritatud ja tulemus silmapaistvalt hea. Üliõpilane suudab ka iseseisvalt töötada. Töövõtted on omandatud eeskujulikul tasemel. Valminud esemete tehniline teostus ja viimistlus on silmapaistvalt väga hea, terviklik ja laitmatu.\n\nB ehk \"väga hea\"- ainekava mahust on omandatud 90%. Üliõpilane on tundides aktiivselt osalenud ja näidanud välja motiveeritud suhtumist. Kõik etteantud tööd on sooritatud ja kvaliteet korralik. Üliõpilane suudab ka iseseisvalt töötada. Töövõtted on omandatud väga heal tasemel. Valminud tööde tehniline teostus ja viimistlus on väga hea ja korrektne.\n\nC ehk \"hea\" - ainekava mahust on omandatud 80%. Üliõpilane on tundides osalenud ja näidanud välja huvitatust. Kõik etteantud tööd on sooritatud, kuigi töödes esineb tehnilisi või kompositsioonilisi vajakajäämisi. Üliõpilane oskab hästi kasutada tehnoloogia baasoskusi, kuid mõne töövõtte teostamisel esineb veidi ebatäpsusi ja küsitavust. Valminud tööde tehniline teostus ja viimistlus on hea ja üldjoontes korrektne.\n\nD ehk \"rahuldav\" - ainekava mahust on omandatud 70%. Üliõpilane on õppeprotsessis passiivne. Kõik etteantud tööd on sooritatud, kuid teostamise korrektsuses esineb ilmselgeid puudujääke. Üliõpilane oskab kasutada tehnoloogia baasoskusi, kuid töövõtete teostamisel esineb olulisi puudujääke ja küsitavusi. Valminud esemete tehniline teostus ja viimistlus on rahuldav.\n\nE ehk \"kasin\" - ainekava mahust on omandatud 60%. Üliõpilane on õppeprotsessis passiivne. Kõik etteantud tööd on sooritatud, Arusaamine töövõtetest on väga kesine. Tunneb minimaalselt ehtevalmistamise baasoskusi, töövõtete kasutuses esineb olulisi ebatäpsusi ja puudujääke. Esemete tehniline teostus ja viimistlus kasin ja ebakorrektne.\n\nF ehk \"puudulik\" - üliõpilane on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel või on puudunud veenva põhjuseta  rohkem kui 25 % praktikumidest."}}], "grade_preconditions": {"et": "Osalemine loengutes ja vähemalt 80% praktikumidel. Hindamisele tuleb esitada kavandid, tööproovid ja valmisesemed. Lisaks vabas vormis koostatud õpimapp.\n\nParticipation in lectures and at least 80% of practicums. Designs, work samples and finished items must be submitted for assessment. In addition, a free-form study folder."}, "grade_evaluation": {"et": "Tulemus kujuneb erinevate õppeülesannete täitmisel ülesnäidatud loovusest ja aktiivsest suhtumisest.\n\nThe result is the creativity and active attitude shown in performing various learning tasks."}, "grade_conditions": {"A": {"et": "A ehk \"suurepärane\" - silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine;"}, "B": {"et": "B ehk \"väga hea\" - õpiväljundite saavutamine väga heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused;"}, "C": {"et": "C ehk \"hea\" - õpiväljundite saavutamine heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes avaldub ebakindlus ja ebatäpsus;"}, "D": {"et": "D ehk \"rahuldav\" - õpiväljundite saavutamine piisaval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus;"}, "E": {"et": "E ehk \"kasin\" - olulisemate õpiväljundite saavutamine minimaalselt lubataval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisil, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus;"}, "F": {"et": "F ehk \"puudulik\" - õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel."}, "mi": {"et": "Üliõpilane pole hindamisele esitanud nõutud esemeid"}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga jooksva semestri ajal"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee  ja Microsoft Teams vastava nimega kursus", "is_moodle_connected": true, "learning_environments": [{"uuid": "b898def2-5ebc-46ee-a2b7-5553ce0bac3f", "type": "MOODLE", "code": "HVVK.01.128_SO", "base_url": "undefined", "linked_to_groups": ["5a9d1348-a57b-dc87-1d49-da5e4c2f5d77", "28d2b4c3-9f04-d970-11cc-9ac07f65a53d"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Eesti rahvariiete ajalugu. Ilmari Manninen,Tartu 2009\nEesti rahvarõivad. Koostanud Melanie Kaarma, Mari Sumera ja Aino Voolmaa. Eesti Raamat, Tallinn 1981\nEesti ehted. Aino Voomaa. Kunst, Tallinn 1970\nEesti ehtekultuur muinasajast uusajani. Jana Reidla. Schenkenber, Tallinn 2012\nEesti rahvapärased ehted. Kaalu Kirme. Eesti Entsüklopeediakirjastus, Tallinn 2002", "recommended_materials": "Jewelry: Concepts And Technology. Oppi Untracht. Doubleday, 1982\nTheory and Practice of Goldsmithing. Erhard Brepohl. Brynmorgen Pr, 2011"}, "participants": {"lecturers": [{"person_uuid": "f6ee7f6b-e62c-35ea-95a5-00537f7f1619", "person_name": "Indrek Ikkonen", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"B rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}, "A rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "28d2b4c3-9f04-d970-11cc-9ac07f65a53d", "code": "B rühm", "max_size": 7}, {"uuid": "5a9d1348-a57b-dc87-1d49-da5e4c2f5d77", "code": "A rühm", "max_size": 7}]}, "schedule": {"weeks": {"et": "20- 42"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Loengus tutvustatakse etnograafiliste ehte kandmise traditsiooni Eesti rahvariiete juures ja praktikumis läbitavad teemasid. Räägitakse kavandite joonistamisest - kõik järgnevad ehted peavad põhinema kvanditel ja tööjoonistel\n\nThe lecture introduces the tradition of wearing ethnographic jewelry in Estonian folk clothes and the topics covered in the practicum. We are talking about drawing blueprints - all subsequent jewelry must be based on blueprints and working drawings"}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {}, "description": {"et": "Setu pöördkee - keti valemid ja tehnoloogilised katsetused. Pöördkeed kasutades valmib kujundatud ehe praktikumi lõpus.\n\nSetu rope chain - chain formulas and technological tests. Using a rope chain, the finished jewelry is completed at the end of the practicum."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {}, "description": {"et": "Setu pitsiline kett - erinevas mõõdus tööproovid, praktikumi lõpus peab olema esitatud vähemalt kümme lõpuni viimistletud ja ühendatud pitsilist lüli \n\nSetu lace chain - work samples in different sizes, at the end of the workshop at least ten finished and connected lace links must be presented"}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {}, "description": {"et": "Karplukk - vaatame läbi kolm erinevat tüüpi karplukku. Praktikumi lõpus valmib ehe, kus on kasutatud karplukku koos keega. Karplukk on kaunistatud.\n\nBox clasp - Three different types of box clasps. At the end of the internship, a piece of jewelry is made, which uses a box clasp with a chain. The box clasp is decorated."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 5, "topic": {}, "description": {"et": "Krõllid - erinevad tüübid ja valmistamise tehnoloogia, tegemist on lisaülesandega, mis ei ole kohustusli\n\n\nSilver beads - different types and manufacturing technology"}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 6, "topic": {"et": "Müntidest valmistatud rinnanõel"}, "description": {"et": "Praktikumis tutvustatakse müntidest valmistatud traditsioonilist setude rinnanõela - kolmest kuni viiest mündist koosnev rinnaehe, šarniirnõelaga kinnitusega, tegemist on lisaülesandega, mis ei ole kohustuslik\n\nThe workshop will introduce the traditional setu brooch made of coins - a brooch consisting of three to five coins, fastened with a hinged pin."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 7, "topic": {}, "description": {"et": "Tööde ülevaatus enne hindamist - individuaalsed konsultatsioonid\n\nInspection of works before assessment - individual consultations"}}]}, "registration_info": {"audience": {"et": "PTM 2"}, "min_students": 2, "max_students": 14}, "confirmation_process": {"confirmation_uuid": "5393f229-6e3d-aa62-76af-48cc6829c552", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "bd53b4bb-89b7-8870-8baa-741e02160d01", "parent_code": "HVVK.01.128", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}