{"uuid": "e65c0177-3b37-c1a4-fc22-bb787d611be7", "code": "HVVK.01.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Handicraft Didactics", "et": "Käsitöö didaktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Short overview of the didactics history and its different methods. History of teaching handicraft skills in Estonia and in rest of the world. Intergenerational learning method. Lehrplan versus curriculum in Estonian school, introduction to the valid state curricula. Possibilities how to teach native crafts in school and outside of it. Impacts of manual activities on human physical, spiritual and social level. Motivation in doing and learning handicraft, learner-focused study. Plan and application of teaching. Visit and analyse of lesson.", "et": "Lühiülevaade didaktika ajaloost ja õpikäsitustest. Käsitööoskuste õpetamise ajaloost Eestis ja mujal maailmas. Pärandtehnoloogiline õppimisviis. Lehrplan versus curriculum Eesti koolis, tutvumine kehtivate riiklike õppekavadega. Rahvusliku käsitöö kui pärandkultuuri osa õpetamise võimalused koolis ja väljaspool kooli. Käelise tegevuse mõju inimesele füüsilisel, vaimsel ja sotsiaalsel tasandil. Motivatsioon käsitöö tegemisel ja õppimisel, tööprotsessi väärtustav õppijakeskne käsitööõpe. Õpetuse planeerimine ja läbiviimine. Õppetunni külastus ja analüüs."}, "objectives": [{"en": "To aqcuire knowledge on didactics and realise craft education as a multidisciplinary field.", "et": "Didaktika alaste teadmiste omandamine ja käsitööõppe kui multidistsiplinaarse valdkonna tajumine."}], "learning_outcomes": [{"en": "Upon successful completion of the course student:", "et": "Õppeaine läbinud üliõpilane:  "}, {"en": "- has an overview of teaching theories and the history of teaching handicraft;", "et": "-\tOmab ülevaadet õpetamisteooriatest ja käsitöö õpetamise ajaloost;"}, {"en": "- sees the regularities of the development of the handicraft skills, and is able to consider these during the planning process of the studies;", "et": "-\tNäeb seaduspärasusi käsitööoskuste arendamisel ja oskab nendega arvestada õppetöö planeerimisel;"}, {"en": "- knows the aims and content of the skill subjects in state educational curricula;", "et": "-\tTunneb oskusainete üldeesmärke ja õppesisu üldhariduskoolide ja kutseõppeasutuste riiklikes õppekavades;"}, {"en": "- analyses the motives of acquireing handicraft skills and their dynamics in different age groups and learning situations;", "et": "-\tAnalüüsib käsitööoskuste õppimise motiive ja nende muutumist erinevates vanuserühmades ja õpisituatsioonides; "}, {"en": " - is able to see and analyse learning environment and process.", "et": "-\tOskab vaadelda ja analüüsida õppekeskkonda ja õppeprotsessi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}