{"uuid": "1b24c7e4-f86f-d4f1-6949-d05bcef1d82a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-02T16:30:45", "title": {"en": "Notation", "et": "Noodistamine"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S regular part 1 3 CP HV", "et": "24/25 K PÕ 1. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 12, "seminar": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "3421f219-24aa-26fc-3c97-70e72b7271ba", "code": "P2VK.02.668", "title": {"en": "Main Instrument I", "et": "Põhipill I"}, "credits": 9, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course provides an overview of the history of transcribing and transcription practices both in Estonia and worldwide. We address the specific challenges of transcribing traditional music, covering both vocal and instrumental traditions. The course explores transcription as a key tool in ethnomusicology and analyzes its practical applications. Additionally, it includes practical exercises that enhance musical hearing, attention, and memory. Through these tasks, students will develop the ability to accurately and systematically transcribe various types of folk music.", "et": "Kursus annab ülevaate noodistamise ajaloost ning noodistamise tavadest nii Eestis kui ka mujal maailmas. Käsitleme folkloorse muusika noodistamise spetsiifilisi väljakutseid nii vokaal- kui ka instrumentaalmuusika puhul. Uurime transkriptsiooni kui etnomusikoloogia olulist vahendit ja analüüsime selle rakendusvõimalusi. Kursus sisaldab ka praktilisi harjutusi, mis arendavad muusikalist kuulmist, tähelepanu ja mälu. Läbiviidavate ülesannete kaudu omandavad tudengid oskuse täpselt ja metoodiliselt noodistada erinevat tüüpi pärimusmuusikat."}, "objectives": [{"en": "* To develop musical literacy and analytical skills.", "et": "* Arendada muusikalist kirjaoskust ja analüüsivõimet."}, {"en": "* To teach the perception, notation, and fundamental theoretical concepts of Estonian folk music.", "et": "* Õpetada muusika tajumist, ülesmärkimist ja põhilisi teoreetilisi mõisteid eesti pärimusmuusika põhjal."}, {"en": "* To provide practical skills for playing folk tunes and notating them.", "et": "* Anda praktilisi oskusi pillilugude mängimiseks ning noodistamiseks."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students will acquire the following skills and knowledge:", "et": "Kursuse edukal läbimisel omandab tudeng järgmised oskused ja teadmised:"}, {"en": "The student understands the basic principles of folk music transkription.", "et": "Tudeng tunneb pärimusmuusika noodistamise aluspõhimõtteid."}, {"en": "Can transkribe both simple and complex folk music examples.", "et": "Oskab noodistada lihtsamaid ja keerukamaid pärimusmuusika näiteid."}, {"en": "Recognizes different transkription methods and can choose the appropriate approach.", "et": "Eristab erinevaid noodistamisviise ja oskab valida sobiva lähenemise"}, {"en": "Is able to analyze the transkribed material and its accuracy.", "et": "Suudab analüüsida noodistatud materjali ja selle täpsust."}], "notes": {}}, "grading": {"independent_work": {"et": "Kursuse hindamine põhineb loengutes osalemisel, praktilistel noodistamistöödel ja ettekandel."}, "grade_preconditions": {"et": "1. Loengutes osalemine\nOsalemine vähemalt 80% loengutest ja praktilistest tundidest on kohustuslik.\nOsalemine annab ülevaate noodistamise teoreetilistest ja praktilistest aspektidest ning toetab iseseisvate tööde tegemist.\n\n2. Noodistamistööd\nAine läbimiseks tuleb esitada 7 noodistust, mis hõlmavad erinevaid pärimusmuusika stiile ja instrumente:\nRegilaul, Parmupill, Väikekannel, Torupill, Hiiu kannel, Viiul, Lõõts või kannel (omal valikul).\n* Vähemalt üks seitsmest noodistusest peab olema tehtud Sibeliuse noodiprogrammis.\n* Tööde puhul hinnatakse täpsust, vormistust, noodistamismeetodi sobivust ning üldist arusaamist noodistamise põhimõtetest.\n* Noodistused tuleb esitada tähtaegselt ning vastavalt kursusel läbitud juhistele.\n\n3. Ettekanne\n* Iga üliõpilane peab tegema ettekande, mis põhineb tema poolt valitud uurimistööl, pillimehel, pillil või artiklil.\n* Ettekande eesmärk on analüüsida ja esitada kriitiline ülevaade teemast, seostades seda kursusel käsitletud noodistamise põhimõtetega.\n* Ettekande pikkus: 10–15 minutit.\n* Hindamisel arvestatakse teema valikut, sisu selgust, analüüsivõimet ning esitusoskust."}, "grade_evaluation": {"et": "Lõplik hinne kujuneb järgmiselt:\n\nNoodistamistööd – 60%\nEttekanne – 20%\nOsalemine loengutes ja praktilistes tundides – 20%\nKõik hindamisosad peavad olema sooritatud positiivsele tulemusele, et kursus arvestada."}, "grade_conditions": {"A": {"et": "* Kõik 7 noodistamistööd on esitatud õigeaegselt ja vastavad kõrgetele kvaliteedistandarditele.\n* Noodistused on täpsed, selged ja õigesti vormistatud, kajastades stiilispetsiifilisi detaile ja interpretatsiooni eripärasid.\n* Vähemalt üks noodistus Sibeliuse noodiprogrammis on korrektselt ja professionaalselt vormistatud.\n* Ettekanne on sisukas, hästi ette valmistatud ja ladusalt esitatud, sisaldab sügavuti analüüsi ja viiteid kursusel käsitletud teemadele.\n* Osalemine loengutes vähemalt 90%, aktiivne kaasarääkimine aruteludes ja praktilistes tundides."}, "B": {"et": "* Kõik 7 noodistamistööd on esitatud, kuid võib esineda väiksemaid ebatäpsusi noodikirjas või vormistuses.\n* Noodistused on üldiselt korrektsed ja kajastavad pillide või laulustiilide eripärasid.\n* Sibeliuse noodistustöö on tehtud, kuid võib sisaldada väikseid tehnilisi puudusi.\n* Ettekanne on hästi ette valmistatud, kuid võib jääda analüüsilt pinnapealseks või sisaldada ebatäpsusi.\n* Osalemine loengutes vähemalt 80%, aktiivne kaasarääkimine vähemalt osades aruteludes ja praktilistes tundides."}, "C": {"et": "* Kõik 7 noodistamistööd on esitatud, kuid mõned sisaldavad märgatavaid ebatäpsusi või vajavad parandusi.\n* Noodistused on üldiselt arusaadavad, kuid ei pruugi alati kajastada kõiki stiilispetsiifilisi detaile.\n* Sibeliuse noodistus on tehtud, kuid selles võib esineda vormistus- või süntaksivigu.\n* Ettekanne on esitatud ja arusaadav, kuid puudub sügavam analüüs või seosed kursuse teemadega.\n* Osalemine loengutes vähemalt 75%, mõningane aktiivsus aruteludes."}, "D": {"et": "* Kõik 7 noodistamistööd on esitatud, kuid sisaldavad märgatavaid vigu või vajavad olulisi parandusi.\n* Sibeliuse noodistus on tehtud, kuid sisaldab mitmeid tehnilisi või noodistamisalaseid ebatäpsusi.\n* Ettekanne on esitatud, kuid on pinnapealne ja ei sisalda analüüsi ega seoseid kursuse teemadega.\n* Osalemine loengutes vähemalt 70%, vähene aktiivsus aruteludes ja praktilistes ülesannetes."}, "E": {"et": "* Mõned noodistamistööd on esitamata või tehtud ebapiisava kvaliteediga.\n* Noodistustes on olulisi ebatäpsusi, mis mõjutavad nende kasutatavust ja arusaadavust.\n* Sibeliuse noodistus on puudulik või sisaldab märkimisväärseid vormistusvigu.\n* Ettekanne on esitatud, kuid väga lühike, pinnapealne ja ilma selge sisulise väärtuseta.\n* Osalemine loengutes vähemalt 60%, väga vähene osalus aruteludes ja praktilistes ülesannetes."}, "F": {"et": "* Mitu noodistamistööd on esitamata või nende kvaliteet ei vasta miinimumnõuetele.\n* Sibeliuse noodistus on kas puudu või väga ebatäpne ja kasutuskõlbmatu.\n* Ettekanne on esitamata või ei sisalda vajalikku sisu.\n* Osalemine loengutes alla 60%, puudub aktiivne osalemine.\n* Üldine sooritus on alla nõutud taseme, mistõttu kursust ei arvestata."}, "mi": {"et": "* Üliõpilane pole esitanud piisavalt töid ega täitnud hindamise miinimumnõudeid.\n* Osalemine loengutes alla 50%.\n* Ettekanne on esitamata.\n* Noodistamised on kas esitamata või ei vasta akadeemilistele nõuetele."}}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": true, "learning_environments": [{"uuid": "92807ed4-12a7-4c29-9166-ae82a542ace7", "type": "MOODLE", "code": "HVVK.00.052", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "7d836f7f-a75e-b030-4f44-fbb0e4c65451", "person_name": "Cätlin Mägi", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-43"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Sissejuhatus ainesse"}, "description": {"et": "Selles tunnis anname ülevaate kursuse sisust, eesmärkidest ja metoodikast. Räägime, miks noodistamine on pärimusmuusika uurimisel ja edasiandmisel oluline ning milliseid oskusi ja teadmisi kursuse jooksul arendatakse. Tutvume erinevate noodistamismeetoditega ning arutleme, millised väljakutsed ja võimalused kaasnevad pärimusmuusika ülesmärkimisega. Samuti selgitame hindamispõhimõtteid ja kursuse ülesehitust. Tund sisaldab ka praktilist osa, kus kuulame ja analüüsime erinevaid pärimusmuusika näiteid, et mõista noodistamise tähtsust ja mitmekesisust."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Noodistamise märgid ja vormianalüüs enne noodistamist"}, "description": {"et": "Selles tunnis tutvume erinevate noodistamise märkide ja sümbolitega, mis aitavad täpselt jäädvustada pärimusmuusikat. Analüüsime, kuidas noodistamise protsessis on oluline mõista muusika vormilist ülesehitust enne, kui meloodia ja rütm noodikirja pannakse. Arutleme erinevate noodistamismeetodite üle ning võrdleme, kuidas vormianalüüs aitab parandada transkriptsiooni täpsust. Tund sisaldab ka praktilisi harjutusi, kus tudengid õpivad muusikalist vormi määratlema ning ette valmistama materjali süsteemseks noodistamiseks."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {"et": "Koosnoodistamine: Regilaul"}, "description": {"et": "Selles tunnis keskendume regilaulu noodistamisele ning selle eripäradele. Tutvume regilaulu meloodilise ja rütmilise ülesehitusega ning arutleme, milliseid väljakutseid see esitab noodistamisel. Ühiselt praktiseerime regilaulu kuulmise järgi noodistamist, pöörates tähelepanu variatsioonidele, rütmilisele vabadusele ja sõna-meloodia suhtele. Samuti võrdleme erinevaid noodistamisviise, et mõista, kuidas need mõjutavad muusika edasiandmist ja analüüsi. Tund arendab kuulamisoskust, täpsust ning koostööoskust grupis."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"et": "Väikekannel – noodistamise spetsiifika ja ajalugu"}, "description": {"et": "Selles tunnis uurime väikekandle kui traditsioonilise Eesti pilliga seotud noodistamisvõtteid ja selle ajaloolist tausta. Arutleme väikekandle mängutehnika eripärade ning nende kajastamise üle noodikirjas. Vaatleme, kuidas erinevad noodistamismeetodid mõjutavad väikekandle muusika edasiandmist ja analüüsi. Tund sisaldab ka praktilist osa, kus kuulame ja proovime noodistada väikekandle palasid, pöörates tähelepanu ornamentikale, mänguvõtetele."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"et": "Parmupill – skaala, astmed, ajalugu"}, "description": {"et": "Selles tunnis tutvume parmupilli kui traditsioonilise rahvapilliga, selle ehituse, mängutehnika ja ajaloolise taustaga. Uurime parmupilli helisüsteemi, skaala ülesehitust ning astmete omavahelist suhet. Arutleme, kuidas parmupilli spetsiifilised helilised omadused mõjutavad noodistamist ja transkriptsiooni. Lisaks teoreetilisele osale keskendume praktilisele tegevusele – õpime mängima parmupilli, katsetame erinevaid mänguvõtteid ja kuulame, kuidas erinevad tehnikad mõjutavad meloodiat ja rütmi. Tund arendab nii noodistamisoskust kui ka praktilist tunnetust parmupilli mängimise kohta."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 6, "topic": {"et": "Sissejuhatus Sibeliuse noodiprogrammi"}, "description": {"et": "Selles tunnis tutvume Sibelius-nooditarkvara põhifunktsioonidega ja selle kasutusvõimalustega pärimusmuusika noodistamisel. Õpime, kuidas luua uut nooti, sisestada meloodiaid ja rütme, kasutada dünaamika- ja artikulatsioonimärke ning kohandada noodigraafikat. Vaatleme, kuidas tarkvara aitab transkribeerimisprotsessi kiirendada ja täpsemaks muuta. Tund sisaldab ka praktilist osa, kus tudengid harjutavad noodistamist Sibeliuses, katsetavad erinevaid tööriistu ja koostavad lühikese noodinäite, et omandada esmane kindlus tarkvara kasutamisel."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {"et": "Erinevate varasemate uurimuste tutvustus ning ettekannete teemade valimine"}, "description": {"et": "Selles tunnis tutvume varasemate uurimustega, mis käsitlevad pärimusmuusika noodistamist ja transkriptsiooni. Analüüsime erinevaid lähenemisviise, metoodikaid ja tulemusi, et mõista, kuidas teadlased on käsitlenud noodistamise väljakutseid nii Eestis kui ka mujal maailmas. Arutleme, millised küsimused on olnud uurijate fookuses ja kuidas nende tööd saaks rakendada meie enda noodistamispraktikas.\n\nTunni teises pooles toimub ettekannete teemade valimine. Tudengid saavad valida endale huvipakkuva teema, mille kohta nad kursuse jooksul esitavad lühiettekande. Teemade valikul arvestame nii individuaalseid huvisid kui ka kursuse üldist fookust. Tund annab hea taustateadmise teaduslikest lähenemisviisidest ning suunab iseseisvaks uurimistööks."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {"et": "Torupill – noodistamise spetsiifika ja ajalugu, ettekannete kuulamine"}, "description": {"et": "Selles tunnis keskendume torupilli kui traditsioonilise rahvapilli ajaloolisele taustale, selle mängutehnikale ning noodistamise eripäradele. Uurime, kuidas torupilli pidev õhuvoog ja piiratud dünaamilised võimalused mõjutavad meloodia ülesehitust ning noodistamise protsessi. Arutleme, millised meetodid sobivad kõige paremini torupillilugude ülesmärkimiseks ning kuidas erinevad transkriptsioonivõtted mõjutavad muusika edasiandmist.\n\nTunni teises osas kuulame üliõpilaste ettekandeid, mis käsitlevad varasemalt valitud uurimusteemadega seotud aspekte. Ettekannete eesmärk on süvendada arusaama pärimusmuusika noodistamise teoreetilistest ja praktilistest küsimustest ning toetada diskussiooni erinevate noodistamisvõtete ja analüüsimeetodite üle."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {"et": "Hiiu kannel – noodistamise spetsiifika ja ajalugu, ettekannete kuulamine"}, "description": {"et": "Selles tunnis uurime Hiiu kannelt kui traditsioonilist keelpilli, selle mängutehnilisi eripärasid ja ajaloolist tausta. Arutleme, kuidas Hiiu kandle drone’il põhinev heli, mänguvõtted ja arhailine intonatsioon mõjutavad noodistamisprotsessi. Vaatleme erinevaid transkriptsioonimeetodeid ja nende sobivust Hiiu kandle muusika ülesmärkimisel ning analüüsime võimalikke probleeme täpsuse ja interpretatsiooni edasiandmisel.\n\nTunni teises pooles kuulame üliõpilaste ettekandeid varasemalt valitud teemadel, mis käsitlevad pärimusmuusika noodistamise ja analüüsi erinevaid aspekte. Ettekannete eesmärk on süvendada arusaama sellest, kuidas noodistamise protsess mõjutab pärimusmuusika uurimist ja esitust ning julgustada kriitilist mõtlemist erinevate transkriptsioonivõtete ja noodikirjalise esitusviisi osas."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {"et": "Viiul – noodistamise spetsiifika ja ajalugu"}, "description": {"et": "Selles tunnis keskendume viiuli kui pärimusmuusikas laialdaselt kasutatava keelpilli noodistamise eripäradele ja ajaloolisele taustale. Arutleme, kuidas viiulitehnika, sealhulgas kaunistused, liuglemised ja rütmilised variatsioonid, mõjutavad noodistamisprotsessi. Uurime, milliseid meetodeid on kasutatud viiulimuusika ülesmärkimisel ning kuidas erinevad noodistamissüsteemid aitavad jäädvustada mängustiili ja fraasikujundust.\n\nLisaks tutvume viiuliga seotud varasemate uurimuste ja transkriptsioonipraktikatega, et mõista, kuidas need on mõjutanud pärimusmuusika uurimist ja esitust. Tund sisaldab ka praktilist osa, kus kuulame ja analüüsime erinevaid viiulilugusid ning proovime neid noodistada, pöörates tähelepanu rütmilistele ja meloodilistele eripäradele."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {"et": "Kannel/Lõõts – noodistamise spetsiifika  ja ajalugu, ettekannete kuulamine"}, "description": {"et": "Selles tunnis uurime kandle ja lõõtspilli kui traditsiooniliste rahvapillide noodistamise eripärasid ja ajaloolist tausta. Arutleme, kuidas nende pillide mängutehnilised ja helilised omadused mõjutavad noodistamist ning millised on peamised väljakutsed nende muusika ülesmärkimisel. Keskendume eri noodistamismeetoditele, sealhulgas rütmilise ja meloodilise varieeruvuse ning harmoonilise struktuuri edasiandmisele.\n\nTunni teises pooles kuulame üliõpilaste ettekandeid varasemalt valitud teemadel, mis käsitlevad pärimusmuusika noodistamise, interpretatsiooni ja analüüsi erinevaid aspekte. Ettekannete eesmärk on süvendada arusaama pärimusmuusika noodistamise võimalustest ja piirangutest ning toetada diskussiooni transkriptsioonitehnikate täpsuse ja praktilise kasutatavuse üle."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 12, "topic": {"et": "Kokkuvõte ja esitatud tööde tagasisidestamine"}, "description": {"et": "Selles tunnis võtame kokku kursuse jooksul käsitletud teemad ja arutleme õpitulemuste üle. Kordame üle olulisemad põhimõtted pärimusmuusika noodistamisel ning reflekteerime erinevate transkriptsioonimeetodite ja -võtete praktilise rakendamise üle.\n\nTunni teine pool keskendub üliõpilaste esitatud tööde tagasisidestamisele. Analüüsime ja arutame üliõpilaste loodud noodistusi, pöörates tähelepanu täpsusele, vormistusele ning valitud noodistamistehnikate sobivusele. Tagasiside eesmärk on anda tudengitele praktilisi soovitusi nende oskuste edasiseks arendamiseks ning innustada kriitilist mõtlemist noodistamise kui uurimismeetodi ja edasiandmisvahendi suhtes. Tund lõpeb avatud aruteluga, kus tudengid saavad jagada oma kogemusi ja mõtteid kursuse jooksul omandatud teadmiste kohta."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "4ae788e1-9325-3b62-03ae-bdb110190473", "parent_code": "HVVK.00.052", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}