{"uuid": "88338aa4-b829-3912-7d3d-86b2e548bce5", "code": "HVVK.01.133", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of Architecture", "et": "Arhitektuuri ajalugu"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Architecture from the period of Great Migrations to classicist architecture (Roman, Gothic, Renaissance, Mannerism, Baroque, Rococo, Classicism). Historicism (neostyles). The early period of development of modern architecture. Urbanization, utilitarian architecture. Stylistics issues at the end of the 19th /at the beginning of the 20th century (Jugendstil, Arts and Crafts Movement). Modernism of the beginning of the 20th century (Expressionism, Functionalism, de Stijl, Bauhaus, Le Corbusier, Russian Constructivism, Traditionalism, Classicism of the Nordic countries). Post-war rebuilding (International style). Wooden architecture. Estonian architecture from Middle Age to 21. century.", "et": "Arhitektuur rahvaste rändamise perioodist klassitsistliku arhitektuurini (romaanika, gootika, renessanss, manerism, barokk, rokokoo, klassitsism). Historitsism (neostiilid). Moodsa arhitektuuri varane arengujärk. Linnastumine, utilitaararhitektuur. Stiiliküsimused 19. sajandi lõpul/20. sajandi algul  (juugend,  Arts and Crafts Movement). 20. sajandi alguse modernism (ekspressionism, funktsionalism, de Stijl, Bauhaus, Le Corbusier, vene konstruktivism, traditsionalism, Põhjamaade klassitsism). Sõjajärgne ülesehitustöö (internatsionaalne stiil). Puitarhitektuur. Eesti arhitektuur keskajast 21. sajandini."}, "objectives": [{"en": "Students get an overview of the history of architecture since the medieval period until today, both in Estonia and around the world.", "et": "Üliõpilane saab ülevaate ehituskunsti ajaloost alates keskajast kuni tänapäevani maailmas ja Eestis."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:", "et": "Kursuse edukalt läbinud üliõpilane"}, {"en": "-\tdifferentiate between historical styles of architecture;", "et": "- eristab ajaloolisi arhitektuuristiilide peamisi välejndusviise Euroopas ja Eestis "}, {"en": "-\tknow and distinguish between different styles in architecture according to regions;", "et": "- tunneb ja eristab eri arhitektuuristiile piirkondlikel alustel;"}, {"en": "-\tcan name the types of buildings;", "et": "- oskab nimetada hoonetüüpe;"}, {"en": "-\tknow the influences of industry, urbanization and globalization to the architecture in the 20th century;", "et": "- tunneb tööstuse, linnastumise ja üleilmastumise mõju arhitektuurile XX sajandil;"}, {"en": "-\tcan search for and use relevant reference materials.", "et": "- oskab otsida ja kasutada vastavaid teatmeallikaid"}, {"en": "-       understands the links between socioeconomic changes and changes in the architectural environment", "et": "- tunneb ühiskondlik-majanduslike muutuste ja arhitektuurse keskkonna omavahelisi seoseid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}