{"uuid": "32b44209-0c46-7ebd-6dca-580eabd07c58", "code": "HVVK.00.058", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Internship (Studio Project)", "et": "Helitehnoloogi praktika"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 3, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Practice takes place at the events organized by organizations that have entered into a relevant contract with the UT VCA. Practice aims at making students flexible in adapting to different situations and different recording possibilities.", "et": "Annab praktilise võimaluse töötada helitehnoloogia valdkonna praktikabaasis, jälgides juhendaja tööd ning osaledes erinevates protsessides. Kinnistab omandatud laiapõhjalised helitehnoloogia-alased teadmised, seob õppeprotsessis õpitu praktiliste situatsioonide ja vajadustega. Praktika toimub TÜ VKA praktikabaasides nagu Viljandi Pärimusmuusika Ait, TÜ VKA heli- ja multimeediastuudio, Teater Ugala, ERR jne"}, "objectives": [{"en": "Develop the student's skills, on the basis of their prior theoretical knowledge, to record groups performing a variety of music styles in the recording studio as well as in live concerts. ", "et": "Õppeaine eesmärgiks on: "}, {"en": "Explaining the work and application principles of the equipment and recording devices needed for sound engineer, acquiring major working methods. Establishing theoretical base for practical courses in the program.", "et": "pakkuda võimalust kinnistada omandatud helitehnoloogia-alaseid teadmisi ja oskusi praktikabaasi keskkonnas, jälgides juhendaja tööd ja töömeetodeid. Samuti täiustada oskusi töötamisel ja suhtlemisel kollektiivi või artistidega ning kinnistada individuaalseid oskusi töötamaks erinevate projektidega, leides optimaalseid lahendusi nende läbiviimiseks."}], "learning_outcomes": [{"en": "By the end of the course students should:\nknows basic structure, working principles and sequence of the equipment needed for the live sound mixing, knows block schema,\nknows main mixing consoles (both analogue and digital), is able to plan independently live sound mixing, considering the type and size of the event; can do live sound mixing in concerts for music department of TÜ VKA.", "et": "Aine läbinud üliõpilane:\n*\tomab kogemusi iseseisvaks tööks väiksemate projektidega helistuudios \n*\tomab põhjalikke teadmisi heli edastamisest ja võimendamisest, helisalvestusest ja -töötlusest\n*\ttunneb hästi erinevate helisalvestussüsteemide spetsiifikat ning oskab seda rakendada erinevates salvestus-situatsioonides;\n*\tomab kogemust ja oskab juhtida helisalvestusprotsessi, on võimeline seda algusest lõpuni läbi viima \n*\tomab teadmisi ja oskusi kontsertide ja etenduste helindamisest \n*\tomab teadmisi ja oskusi kontserdiks või etenduseks vajamineva helitehnilise lahenduse väljatöötamiseks ning on võimeline protsessi juhtima ning teostama helirežii"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}