{"uuid": "a97ffe0b-5052-110d-e750-3ff875b239fa", "code": "HVVK.00.089", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Ideas, Ideation & Design Thinking", "et": "Ideed, ideede arendamine ja disainmõtlemine"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Students enter the subject with your own idea or concept design. The principles of design thinking and service design are introduced and the opportunity to apply them is given. The subject teaches students to develop your ideas using creative thinking techniques and design thinking principles. During the course, the original idea becomes a developed and structured idea, which is thoroughly thought out and presented to others. In addition, students learn to present their ideas convincingly", "et": "Ainesse sisenetakse oma ideega või ideekavandiga.  Tutvustatakse disainmõtlemise ning teenusdisaini põhimõtteid ning antakse võimalus nende rakendamiseks. Aine õpetab oma ideed arendama kasutades loovmõtlemise tehnikaid ning disaimõtlemise printsiipe. Aine jooksul saab algsest ideest arendatud ning struktureeritud idee, mis on igakülgselt läbi mõeldud ning ka teistele esitletud.  Lisaks õpitakse oma ideid veenvalt esitlema"}, "objectives": [{"en": "The purpose of the subject is to give the participant an in-depth understanding of the idea development process and techniques. The subject develops creative problem-solving skills and introduces various tools for idea generation and development.", "et": "Õppeaine eesmärk on anda osalejale süvitsi minev arusaam ideede arendamise protsessist ning tehnikatest. Aine arendab  loovat probleemilahendamise oskust ning tutvustab ideede genereerimise ning arendamise erinevaid tööriistu."}], "learning_outcomes": [{"en": "The student: *has an overview of the concepts of idea development and applies them in the context of design thinking; *uses creative thinking techniques for problem solving and knows how to generate ideas; *applies creative thinking in solving practical problems and finds innovative solutions; * can present his/her/their ideas convincingly", "et": "Üliõpilane: *omab ülevaadet ideede arendamise kontseptsioonidest ja rakendab neid disainmõtlemise kontekstis; *kasutab probleemilahendusel loova mõtlemise tehnikaid ja valdab ideede genereeerimise võtteid; *rakendab loovat mõtlemist praktiliste probleemide lahendamisel ning leiab selleks innovatiivseid lahendusi; * oskab oma ideid veenvalt esitleda"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}