{"uuid": "1f1f2f1d-aa1f-9581-70c9-67275c2fa95e", "code": "HVVK.01.036", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Enterprise Practice I", "et": "Ettevõttepraktika I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "ENTERPRISE PRACTICE\nGetting acquainted with practice enterprise (legal form of the enterprise, aims of the activities, major competitors, and customers). Getting to know the organization of production, division of work and products. The student participates as a member of the team and provides their individual contribution to the functioning of the enterprise. Fulfilling assignments requiring independent decision-making skills, responsibility and productivity in the practice enterprise. Learning about the occupational guidelines of the job, work regulations and work safety rules. Enhancing the log building and team work skills, preparing for graduation.\nStudents keep a practice diary during the work period according to the regulations provided by the Estonian Native Construction practice guidelines (https://www.is.ut.ee/pls/ois_sso/tere.tulemast?viit=2120006) and submit a proper written practice report.", "et": "ETTEVÕTTEPRAKTIKA\nTutvumine praktikaettevõttega (ettevõtte õiguslik vorm, tegevuseesmärgid, tegevused, põhilised konkurendid, kliendid jms). Tutvumine töö korralduse ning toodangu ja/või teenustega: ametijuhendid, töösisekorra ja tööohutuse eeskirjad jms. Meeskonna liikmena töötades organisatsiooni tegevusest ülevaate omandamine.\n\nPraktikavorm: küsitlemine, tegevuse jälgimine töövarjuna, käskjalana, üksikülesannete täitjana vms vastavalt olukorrale ja asutusele. Vähemalt poole praktika ulatuses eeldatakse iseseisvat otsustus- ja vastutusvõimet ning tulemuslikkust eeldavate ülesannete täitmist õppija poolt.\n\nÜliõpilane peab tööperioodil praktikapäevikut vastavalt RE praktikajuhendis määratletud korrale ning esitab korrakohase (https://www.is.ut.ee/pls/ois_sso/tere.tulemast?viit=2120006) kirjaliku praktikaaruande."}, "objectives": [{"en": "Provide sufficient self-reliance and experience in order to fulfil assignments of responsibility in the log building field.", "et": "Anda piisav eneseusaldus ja kogemuspagas erialases valdkonnas vastutavate ülesannete täitmiseks."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:\n- know the production of the enterprise, the basics and market of their functioning;\n- know the regulations and work safety requirements at the enterprise;\n- know the organization and distribution of work assignments;\n- know the regulations of business conduct at the enterprise;\n- know the devices and technology used at the enterprise;\n- can work according to a positive routine;\n- can work independently as a team member;\n- can run errands at the enterprise;\n- can adequately interpret the job description of an employee;\n- can assess independently the quality and general results of their work;\n- can work at different stages of work in changing situations;\n- can observe independently the quality of their own work and that of the whole building under construction;\n- perceive and distinguish the area of personal and group responsibility.", "et": "Kursuse edukal läbimisel üliõpilane\n* tunneb ettevõtte toodangut/teenuseid, tegutsemise aluseid ja turgu;\n* tunneb ettevõtte sisekorda ja tööohutuse nõudeid;\n* tunneb töökorraldust, tööjaotust ja tunneb asjaajamise korda asutuses;\n* tunneb ettevõttes kasutatavaid seadmeid ja tehnoloogiat;\n* oskab töötada positiivse rutiini alusel;\n* oskab meeskonna liikmena iseseisvalt töötada;\n* oskab ettevõttes asju ajada;\n* oskab adekvaatselt tõlgendada töötaja ametikirjeldust;\n* oskab iseseisvalt hinnata oma tööde kvaliteeti ja üldisi töötulemusi;\n* oskab töötada erinevatel töölõikudel vahelduvates olukordades;\n* oskab jälgida iseseisvalt nii enese töö kui tervikprotsessi kvaliteeti;\n* tajuda ning eristada isiklikku ja kollektiivset vastutusala."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}