{"uuid": "db9c127d-bc2d-409a-2199-e144787ac6df", "code": "HVVK.00.108", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-26T15:09:13", "title": {"en": "Critical Digital Literacies", "et": "Kriitiline digikirjaoskus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The learning occurs as a combined study, where e-learning assignments and materials are available in the Moodle environment. In-person learning is conducted in seminars and practicals. The seminars will cover the principles of digital literacy, as well as the topics of cyber security and cyber hygiene. Internships focus on creating digital content with copyright issues.", "et": "Õppeaine toimub kombineeritud õppena, kus e-õppe ülesanded ja materjalid on kättesaadavad Moodle keskkonnas. Lähiõpe viiakse läbi seminaride ja praktikumide formaadis. Seminarides käsitletakse kriitilise digikirjaoskuse põhimõtteid, samuti küberturvalisuse ja küberhügieeni teemasid. Praktikumides keskendutakse digitaalse sisu loomisele koos autorikaitse teemadega."}, "objectives": [{"en": "The objective of the course is to create the conditions to bring students knowledge and skills about the role of the digital world in today's education, including explaining the principles of critical digital literacies, providing practical experience in creating digital content with compliance with copyright rules and developing an understanding of the importance of digital safety. This includes implementing strategies to protect your and others' digital identities and managing your digital footprint.", "et": "Kursuse eesmärk on tuua üliõpilasteni teadmised ja oskused digimaailma rollist tänapäeva hariduses, sealhulgas selgitada kriitilise digikirjaoskuse põhimõtteid, anda praktiline kogemus digitaalse sisu loomisel koos autoriõiguse reeglite järgimisega ning arendada arusaamist digitaalse ohutuse olulisusest. See hõlmab enda ja teiste digiidentiteetide kaitsmise strateegiate rakendamist ning digitaalse jalajälje haldamist."}], "learning_outcomes": [{"en": "*\tto expalin the concept of critical digital literacies and its relation to other related literacies, demonstrating the ability to apply critical thinking in information search and assessment;", "et": "*\toskab kirjeldada kriitilise digikirjaoskuse põhimõtteid;"}, {"en": "*\tapply theoretical knowledge and practical examples to create digital content while adhering to copyright rules;", "et": "*\toskab rakendada teoreetilisi teadmisi ja praktilisi näiteid digitaalse sisu loomisel, järgides autoriõiguse reegleid; "}, {"en": "*\texpalin the importance of digital safety for protecting digital identities and tools and managing digital footprints;", "et": "*\tmõistab digitaalse ohutuse tähtsust enda ja teiste digiidentiteetide kaitsmisel ning digitaalse jalajälje haldamisel;"}, {"en": "*\timplement preventative activities for digital safety, including strategies for protecting digital identities, securing digital tools through proactive measures and awareness, and managing their digital footprint effectively.", "et": "*\toskab rakendada ennetavaid tegevusi digitaalse ohutuse tagamiseks, sealhulgas strateegiaid digitaalse identiteedi ja tööriistade kaitsmiseks ning digitaalse jalajälje tõhusaks haldamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}