{"uuid": "163fb169-123b-30f1-eda9-f61c38a4df99", "code": "HVVK.00.060", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Mixing", "et": "Miksimine"}, "credits": 8, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Deepens knowledge about sound frequence and dynamics processors, room emulators and their use in mixing. Different computer-based mixing techniques are used, different level projects are being done. Analogue and digital equipment are being taught to understand their role in best end result.", "et": "Süvendab teadmisi helisageduste- ja dünaamikaprotsessorite ning ruumiemulaatorite ja  protsessorite kasutamisest miksimisprotsessis. Käsitletakse erinevaid arvutipõhise kokkumängu tehnikaid ja programme. Teostatakse erineva raskusastme ja mahuga projektide kokkumängud. Omandatakse ja süvendatatske oskusi erinevate miksimisvõtete ja -vahendite kasutamisel nii stereo- kui surroundtehnikas. Õpitakse kasutama erinevaid analoog ja digitaalseid lisasedmeid parima lõpptulemi saavutamiseks."}, "objectives": [{"en": "*To enlarge knowledge in mixing", "et": "*\tSüvendada teadmisi ja oskusi helisalvestuse valmimisprotsessi ühe olulisima osa - miksimise - teostamisel"}, {"en": "*To use different means and techniques needed in mixing process", "et": "*\tÕpetada praktikas kasutama erinevaid miksimiseks vajalikke vahendeid ja tehnikaid"}, {"en": "*To give knowledge about stereo and surround mixing", "et": "*\tAnda teadmised ja oskused stereo- ja surroundmiksmise eripäradest ning läbiviimiseks"}, {"en": "*To teach how to mix music in different styles both artistically and technically.", "et": "*\tÕpetada kunstiliselt ja tehniliselt läbi viima erinevate muusikastiilide suuremahulisi kokkumänge"}], "learning_outcomes": [{"en": "*Knows and can explain the importance of mixing\n*Knows how to mix different music styles\n*Is able to use different mixing techniques and methods\n*Knows stereo- and surround mixing\n*Knows most common end-use file formats and is able to make the final product on CD/DVD format.", "et": "*\tMõistab ja oskab selgitada miksimise olulisust ja tähtsust helisalvestuse valmimise protsessis\n*\tOskab teostada nii tehniliselt kui kunstiliselt erinevate muusikastiilide eripära arvestavad kokkumängud\n*\tOskab kasutada kokkumängude teostamiseks kaasaegseid tehnilisi vahendeid ja lahendusi\n*\tTunneb ja oskab kasutada erinevaid kokkumängutehnikaid ja meetodeid\n*\tTunneb stereo- ja surround kokkumängu võimalusi ja eripära\n*\tTunneb käibelolevaid lõpptarbija failiformaate ja -parameetreid ning oskab oma kokkumängud vormistada CD/DVD'l"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}