{"uuid": "cf829b13-76be-cd5b-f22e-e2855e9bf6da", "code": "HVVK.00.091", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-19T16:26:33", "title": {"en": "Global Trends in the Culture and Creative Sectors and Industries", "et": "Globaalsed trendid kultuuris ning loovsektorites"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Within the scope of the subject, developments and trends in the fields of culture and creative economy are studied, their connections with global trends are analyzed, and intercultural cooperation and cultural diplomacy are discussed in the context of culture and creative economy. The student prepares an analysis of the trend or impact related to his/her/their idea and places his/her/their idea in a wider context.", "et": "Aine raames uuritakse kultuuri- ja loomemajanduse valdkondade arenguid ja suundumusi, analüüsitakse nende seoseid ülemaailmsete trendidega ning käsitletakse kultuuridevahelist koostööd ja kultuuridiplomaatiat kultuuri- ja loomemajanduse kontekstis. Üliõpilane koostab analüüsi enda ideega seonduva trendi või mõju kohta ning paigutab enda idee laiemasse konteksti."}, "objectives": [{"en": "The aim of the subject is to study trends and trends in the field of cultural and creative industries in the world, to understand their connections with global developments, and to be able to reflect and discuss these trends. In the subject, the principles of sustainable development in the creative sector are discussed and the results of the discussion are applied in one's own creative project.", "et": "Õppeaine eesmärk on uurida kultuuri- ja loomemajanduse valdkonna trende ja suundumusi maailmas, mõista nende seoseid ülemaailmsete arengutega ning osata nende trendide üle reflekteerida ning arutleda. Õppeaines arutletakse kestliku arengu printsiipide üle loovsektoris ning rakendatakse arutelu tulemusi oma loovprojektis."}], "learning_outcomes": [{"en": "The student: *understands the cultural and creative economy and its interrelationships with global trends; *identifies, analyzes and evaluates developments and trends in the fields of culture and creative economy in the world; *critically evaluates the impact of cultural and creative economy policies, strategies and measures on the promotion of cultural diversity, innovation and sustainability. *analyzes his/her/their creative project based on the principles of sustainable development", "et": "Üliõpilane: *saab aru kultuuri- ja loomemajandusest ning selle vastastikustest seostest ülemaailmsete trendidega; *tuvastab, analüüsib ja hindab kultuuri- ja loomemajanduse valdkondade arenguid ja suundumusi maailmas; *hindab kriitiliselt kultuuri ja loomemajanduse poliitikate, strateegiate ja meetmete mõju kultuurilise mitmekesisuse, innovatsiooni ja jätkusuutlikkuse edendamisele. *analüüsib oma loovprojekti lähtudes kestliku arengu põhimõtetest"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}