{"uuid": "55fbf302-1047-01dc-89e2-7691478b34b5", "code": "HVVK.01.052", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Folk Art", "et": "Rahvakunsti alused"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": ".", "et": "Tutvustatakse eesti rahvakunstiga esemeliikide, nende valmistamisviiside, ornamendi ja värvikasutuse kaudu. Esemeid seostatakse kultuurilooga ning antakse ülevaade piirkondlikest eripäradest. \nPõhjalikumalt tutvustatakse eesti rahvarõivaid ja valikuliselt nende üksikosade valmistamist. \nTutvutakse erialase kirjandusega, kirjeldatakse muuseumieset ja koostatakse kirjalike allikate põhjal referaat. \nKujundatakse rahvakunsti alased õppevahendid ja nende kaudu esitletakse õpitud teadmiste kasutamisvõimalusi käsitöö tundides."}, "objectives": [{"en": "To give an overview of Estonian folk art.", "et": "Kujundada üliõpilastel arusaam rahvakunsti olemusest ja kujunemisest kultuuriloo taustal. \nToetudes teoreetilisele käsitusele ja praktilisele rahvarõiva üksikosade valmistamisoskusele, üliõpilane rakendab käsitööõpetajana rahvakunsti alaseid teadmisi."}], "learning_outcomes": [{"en": "After completing the course students\n1.\thas an overview of the concept of folk art, folk clothing Estonian parishes and their development trends of the general background the history of costume and fundamentals of ornament; \n2.\tprepare a survey of the literature and museum objects a single parish folk Costumes  overview of Estonia; \n3.\tfeels and knows how to prepare the costumes for the contractor and prepare them for methodological study material and analyze the acquired knowledge into options II and III stage craft classes;", "et": "Õppeaine läbinud üliõpilane:\n1. omab üldist ülevaadet rahvakunsti mõistest, eesti traditsioonilisest esemelisest kultuurist, käsitööliikidest, värvi- ja ornamendi kasutusest ning piirkondlikest eripäradest\n2. oskab kirjeldada muuseumiesemeid, orienteerub rahvakunsti käsitlevas kirjanduses \n3. tunneb ja oskab kasutada rahvarõivaste valmistamiseks tehtavaid töövõtteid\n4. hindab rahvakunsti alaste teadmiste rakendamise võimalusi II ja III kooliastme käsitöötundides ning koostab metoodilised õppevahendid"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}