{"uuid": "22c61f13-8b80-339b-4f05-89cb3ee40155", "code": "HVVK.04.130", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "General Composition", "et": "Kompositsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 3, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Learning the base knowledge of color study and composition. Solving assignments in color study and composition Learning the principles of depicting items with the help of modeling with\nlight and shade (coating colors). Color circle, different types of harmony, contrasting colors.", "et": "Üldkompositsioon on vaatlusoskust, analüüsivõimet, visuaalset mõtlemist ja kompositsioonitaju arendav õppeaine. Kursuse käigus läbitakse järgmised teemad:\nrütm; fookus; dünaamika; sümmeetria; kontrast; kolme- ja kahemõõtmelise ruumi erinevused; asukoha-, proportsiooni- ja värvisuhted. Värviõpetuse- ja kompositsioonialaste baasteadmistega tutvumine.\nVärviõpetuse- ja kompositsioonialaste ülesannete lahendamine.\nValguse ja varju abil modelleerides esemete kujutamise alustega tutvumine (kattevärvid).\nVärviring, erinevad kontrastharmooniad. Ruumikompositsiooni mõistetega tutvumine, ruumilised harjutused ning ruumi loomine maketina."}, "objectives": [{"en": "To create the conditions for learning the usable principles of color studies and to become familiar with the main expression tools of painting (color qualities, line, surface, texture). We also deal with the principles of composition like balance, contrast, rhythm, symmetry. The goal is to also be able to depict objects and to learn the primary tools of creating an abstract whole of painting.", "et": "Arendada vaatlusoskust, visuaalset analüüsivõimet ja kompositsioonitaju. Luua tingimused värviõpetuse rakenduslike põhitõdede omandamiseks ja maalikunsti tähtsamate väljendusvahenditega (koloriit, joon, pind, tekstuur) tutvumiseks. Seejuures ei unustata ka kompositsiooniprintsiipe nagu tasakaal, kontrast, rütm, sümmeetria. Eesmärgiks on samuti esemete kujutamise ning maaliterviku loomise esmaste oskuste omandamine. Anda üliõpilasele teadmisi ruumikompositsiooni loomise alustest, arendada välja iga üliõpilase isikupärane väljenduslaad ja kompositsioonitaju."}], "learning_outcomes": [{"en": "Upon successful completion of the course the student:\n- know the principles of creative composition and respective terms - golden rule, rhythm, contrast, balance, harmony, symmetry - and are able to use them in solving creative tasks\n- know the main principles of the color theory, painting and composition and use them creatively\n- can on the primary level see the and be aware of the color qualities, tonalities, brightness, saturation, air perspective, the tonal relationships of light and shade of the surrounding environment and items\n- can independently motivate themselves, analyze their work and the working process and to evaluate the result\n- know how to properly present their work", "et": "Aine edukalt läbinud üliõpilane:\n- mõistab visuaalse kompositsiooni olemust ja tunneb erinevaid kompositsiooni kategooriaid ning nende osa töö ülesehituses;\n- suudab visuaalselt mõelda; oskab oma töödes pildiliselt veenva ja tervikliku tulemuseni jõuda;\n- tunneb kompositsiooni seaduspärasusi ja vastavaid mõisteid - kuldlõige, rütm, kontrast, tasakaal, kooskõla, sümmeetria ning kasutab neid loominguliste ülesannete lahendamisel;\n- tunneb värviõpetuse maalimise ja kompositsiooni seisukohast olulisi põhimõtteid ning rakendab neid loovalt;\n- oskab esmasel tasandil näha ja teadvustada ümbritseva keskkonna ning esemete värvikvaliteete, tooni, koloriiti, heletumedust, küllastatust, õhuperspektiivi, valguse ja varju toonisuhteid;\n- oskab end iseseisvalt motiveerida, oma tegevust analüüsida ja oma tööprotsessi ning selle tulemust hinnata;\n- oskab oma töid esitleda ja vormistada."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}