{"uuid": "7d28e396-bf9d-3dee-c0e7-1cf650685d27", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-11T14:57:40", "title": {"en": "Integrated Product", "et": "Lõimitud toode"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 5, "practice": 15, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 79, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "1813c71c-f5d7-9304-61c2-60e8b1743a1f", "code": "HVVK.01.051", "title": {"en": "Human and Technology", "et": "Inimene ja tehnoloogia"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "08307766-267d-426f-9514-e2c43b4d151a", "code": "HVVK.01.058", "title": {"en": "Processing of Materials", "et": "Materjalid ja nende töötlemine"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Creating a design process for a device with a variety of materials and techniques. Subjects of the previously studied specialty are integrated. Completed with a larger product with a portfolio.", "et": "Erinevatest materjalidest ja tehnikatest töötava seadme loov disainiprotsess. Lõimitakse eelnevalt õpitud eriala õppeaineid. Valmib suurem toode koos õpimapiga.\nÕppeaines \"Lõimitud toode\" peab lisaks reaalsele töötavale tootele lisanduma ka kirjalikult vormistatud (nn kaante vahel) (õpi)materjal ja esitlus.\n\nReaalne töötav toode peab sisaldama mikrokontrollerit, elektroonika komponente, 3D printimise ja/või cnc freesimise ning teisi õpitud eriala õppeainete materjale ja nende töötlemist. Soovitav on kasutada uuemaid materjale ja töötlusviise.\n\nÕpimapp koosneb järgmistest osadest:\n\nTiitelleht.\nSisukord.\nSissejuhatus (kirjeldada, millise tööga on tegemist, mis põhjuselt on see valitud, kes seda kasutama hakkavad, miks see vajalik on jne).\nToote kirjeldus (millistest osadest koosneb, kuidas see üldiselt töötab, soovitused kasutamiseks jne).\nMaterjalide loetelu (koos mõõtudega, kustkohast hangitud ja hinnad, lisada pildid algmaterjalidest).\nToote tehnilised lahendused  ja tööpõhimõte (sh liited, konkreetne tööpõhimõte, viimistlus jne).\nJoonised (sh mõõdud ja 3D modelleerimine) ja pildid (sh tööprotsessist). \nJäreldused (tööprotsessist ja tootest tulenevalt) ja soovitused edaspidiseks (mida silmas pidada ka seda, kui teha uus sarnane toode). Kuidas jäite tööprotsessiga rahule, hinnang oma tööle. \nKasutatud kirjandus.\nIga magistrant esitleb (nt PowerPoint vahendusel (vajadusel lisatud videod), lisatud pildid) oma toodet ja reaalselt toote toimimist (ca 10 + 5 min).\nPeale magistrandi esitlust saavad teised (sh magistrandid) esitada esitlejale küsimusi (kuni 5 min).\n\nHinne kujuneb kaitsmise, reaalse toimiva toote ja kirjaliku materjali (õpimapi) põhjal. Kirjalik materjal (õpimapp/fail) ja esitluse fail jäävad peale kaitsmist vastutava õppejõu kätte, toode jääb magistrandile.\nKaitsmine toimub  TÜ Viljandi kultuuriakadeemias."}, "objectives": [{"en": "The aim of the subject is to enable the student to acquire a self-contained, practical-oriented, technological-creative product. Teaching through subject is to achieve the student's willingness to implement creatively acquired professional knowledge and skills at which the working device will be created. Students will be taught to work with relevant sources, analyze the necessary materials and techniques, and find suitable solutions. A portfolio is created from the integrated product.", "et": "Õppeaine eesmärgiks on võimaldada üliõpilasel omandada iseseisev praktilise suunitlusega tehnoloogiline-loominguline toode. Õppeaine õpetamise vahendusel saavutatakse üliõpilase valmisolek rakendada loovalt omandatud erialaseid teadmisi ja oskusi, mille najal valmib töötav seade. Õpitakse töötama teemakohaste allikatega, analüüsitakse vajalikke materjale ja tehnikaid ning leitakse sobivad lahendused. Lõimitud tootest koostatakse õpimapp."}], "learning_outcomes": [{"en": "1.\t1.\tHas the ability to integrate the knowledge and skills acquired in various specialties;", "et": "1.\toskab lõimida erinevates eriala õppeainetes omandatud teadmisi ja oskusi;"}, {"en": "2.\tCan solve tasks related to product creation and find and solve problems; ", "et": "2.\tsuudab lahendada toote loomisega seotud ülesandeid ja leida ning lahendada probleeme; "}, {"en": "3.\tCan analyze and synthesize new creative solutions for product design process. ", "et": "3.\toskab toote disainiprotsessi analüüsida ja sünteesida uusi loovaid lahendusi; "}, {"en": "4.\tHas the ability to correctly compile the portfolio;", "et": "4.\toskab korrektselt koostada õpimappi;"}, {"en": "5.\tCan present and defend the product.", "et": "5.\toskab toodet esitleda ja kaitsta."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Lõimitud toote ideeprojekti koostamine, sh eskiis.\n2. Osaliselt iseseisvalt koostada reaalne lõimitud toode.\n3. Koostada ja kirjalikult vormistada õpimapp/toote tehniline spetsifikatsioon, sisaldab sisukorda, sissejuhatust, toote kirjeldust, materjalide loetelu, tehnilisi lahendusi, jooniseid (pilte), järeldusi ja kokkuvõtet ning kasutatud kirjanduse loetelu.\n4. Lõimitud toote kaitsmiseks esitluse koostamine.\n5. Lõimitud toote esitluse kaitsmiseks ettevalmistamine."}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Hinne kujuneb reaalse lõimitud toote, esitluse kaitsmise ja kirjaliku materjali (õpimapp) põhjal. Kirjalik materjal (õpimapp) ja esitluse kaitsmise fail jääb peale kaitsmist vastutava õppejõu kätte, lõimitud toode jääb magistrandile.\n\nHinnatakse:\n-\tesitlemise korrektsus;\n-       terminoloogiast kinnipidamine;\n-\tPowerPoint esitluse terviklikkus;\n-      küsimustele vastamise oskus\n\nEsituse kaitsmise hindamiskriteeriumid: \nE - esitlemise korrektsus  kohati ebapiisaval tasemel, terminoloogiast kinnipidamine kohati ebapiisaval tasemel, PowerPoint esitluse terviklikkus kohati ebatasemel, küsimustele vastamise oskus kohati ebapiisaval tasemel.\nD - esitlemise korrektsus piisaval tasemel, terminoloogiast kinnipidamine piisaval tasemel, PowerPoint esitluse terviklikkus piisaval tasemel, küsimustele vastamise oskus piisaval tasemel.\nC - esitlemise korrektsus heal tasemel, terminoloogiast kinnipidamine heal tasemel, PowerPoint esitluse terviklikkus heal tasemel, küsimustele vastamise oskus heal tasemel.\nB - esitlemise korrektsus väga heal tasemel, terminoloogiast kinnipidamine väga heal tasemel, PowerPoint esitluse terviklikkus väga heal tasemel, küsimustele vastamise oskus väga heal tasemel.\nA -  esitlemise korrektsus eeskujulik, terminoloogiast kinnipidamine eeskujulik, PowerPoint esitluse terviklikkus eeskujulik, küsimustele vastamise oskus eeskujulik."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Lõimitud toote hindamiskriteeriumid:  \n-\tmikrokontrolleri kasutamine;\n-\t3D printimise ja/või cnc freesimise kasutamine;\n-\telektroonika komponentide kasutamine;\n-\tõpitud eriala õppeainete materjalide ja nende töötlusviiside kasutamine;\n-\tuuemate materjalide töötlus- ja kinnitusviiside kasutamine;\n-\toriginaalsus ja innovaatilisus;\n-\ttoote dünaamilisus;\n-\tkasutamiskõlblikkus;\n-\tkvaliteetsus ja viimistlus;\n\nE - mikrokontrolleri kasutamine kohati ebapiisaval tasemel, 3D printimise ja/või cnc freesimise kasutamine kohati ebapiisaval tasemel; elektroonika komponentide kasutamine kohati ebapiisaval tasemel, õpitud eriala õppeainete materjalide ja nende töötlusviiside kasutamine kohati ebapiisaval tasemel; uuemate materjalide töötlus- ja kinnitusviiside kasutamine kohati ebapiisaval tasemel, originaalsus ja innovaatilisus kohati ebapiisaval tasemel, toote dünaamilisus kohati ebapiisaval tasemel; toote dünaamilisus kohati ebapiisaval tasemel, kvaliteetsus ja viimistlus kohati ebapiisaval tasemel.\nD - mikrokontrolleri kasutamine piisaval tasemel, 3D printimise ja/või cnc freesimise kasutamine piisaval tasemel; elektroonika komponentide kasutamine piisaval tasemel, õpitud eriala õppeainete materjalide ja nende töötlusviiside kasutamine piisaval tasemel; uuemate materjalide töötlus- ja kinnitusviiside kasutamine piisaval tasemel, originaalsus ja innovaatilisus piisaval tasemel, toote dünaamilisus piisaval tasemel; toote dünaamilisus piisaval tasemel, kvaliteetsus ja viimistlus piisaval tasemel\nC - mikrokontrolleri kasutamine heal tasemel, 3D printimise ja/või cnc freesimise kasutamine heal tasemel; elektroonika komponentide kasutamine heal tasemel, õpitud eriala õppeainete materjalide ja nende töötlusviiside kasutamine heal tasemel; uuemate materjalide töötlus- ja kinnitusviiside kasutamine heal tasemel, originaalsus ja innovaatilisus heal tasemel, toote dünaamilisus heal tasemel; toote dünaamilisus heal tasemel, kvaliteetsus ja viimistlus heal tasemel.\nB- mikrokontrolleri kasutamine väga heal tasemel, 3D printimise ja/või cnc freesimise kasutamine väga heal tasemel; elektroonika komponentide kasutamine väga heal tasemel, õpitud eriala õppeainete materjalide ja nende töötlusviiside kasutamine väga heal tasemel; uuemate materjalide töötlus- ja kinnitusviiside kasutamine väga heal tasemel, originaalsus ja innovaatilisus väga heal tasemel, toote dünaamilisus väga heal tasemel; toote dünaamilisus väga heal tasemel, kvaliteetsus ja viimistlus väga heal tasemel.\nA -  mikrokontrolleri kasutamine eeskujulikul tasemel, 3D printimise ja/või cnc freesimise kasutamine eeskujulikul tasemel; elektroonika komponentide kasutamine eeskujulikul tasemel, õpitud eriala õppeainete materjalide ja nende töötlusviiside kasutamine eeskujulikul tasemel; uuemate materjalide töötlus- ja kinnitusviiside kasutamine eeskujulikul tasemel, originaalsus ja innovaatilisus eeskujulikul tasemel, toote dünaamilisus eeskujulikul tasemel; toote dünaamilisus eeskujulikul tasemel, kvaliteetsus ja viimistlus eeskujulikul tasemel."}}, {"work_type": {"code": "portfolio", "et": "Õpimapp", "en": "portfolio"}, "description": {"et": "Hindamiskriteeriumid:\n-\tõpimapi vormistuse korrektsus;\n-\tsisu ja struktuuri nõuetele vastavus;\n-\ttehniliste lahenduste ja tööpõhimõtte esitlemise korrektsus;\n-\tviidete asjakohasus ja ulatus;\n-\tjooniste ja piltide vastavus ning korrektsus; \n-\tjärelduste tegemise oskus;\n-\tteemakäsituse uudsus, loomingulisus, loogilisus;\n-\tterminoloogiast kinnipidamine.\nE - õpimapi vormistus üldjoontes nõuetekohane, sisu ja struktuur kohati ebapiisav, tehniliste lahenduste ja tööpõhimõtte esitlemise korrektsuses kohati ebapiisav, viidete asjakohasus ja ulatus ning seostamine tekstiga minimaalne ja kohati mittepiisav, jooniste ja piltide kvaliteet ja korrektsus kohati ebapiisav, järelduste tegemise oskus kohati ebapiisav, teemakäsituse uudsuses, loomingulisuses, loogilisuses esinevad nõrgad kohad, terminoloogias esinevad kohati ebatäpsused.                        \nD - õpimapi vormistus üldjoontes korrektne, sisu ja struktuur piisav, tehniliste lahenduste ja tööpõhimõtte esitlemise korrektsuses kohati ebapiisav, viidete asjakohasus ja ulatus ning seostamine tekstiga minimaalne, jooniste ja piltide kvaliteet ja korrektsus kohati ebapiisva, järelduste tegemise oskus kohati ebapiisav, teemakäsituse uudsuses,                        \nloomingulisuses, loogilisuses esinevad nõrgad kohad, terminoloogias esinevad mõned ebatäpsused.\nC - õpimapi vormistus korrektne, sisu ja struktuur piisavad, tehniliste lahenduste ja tööpõhimõtte esitlemise korrektsus piisavad, viidete asjakohasus ja ulatus ning seostamine tekstiga piisav, jooniste ja piltide kvaliteet ja korrektsus piisav, järelduste tegemise oskus piisav, teemakäsituse uudsuses, loomingulisuses, loogilisuses esinevad mõned nõrgad kohad, terminoloogias esinevad mõned üksikud ebatäpsused.\nB - õpimapi vormistus väga heal tasemel, sisu ja struktuur väga hea, tehniliste lahenduste ja tööpõhimõtte esitlemise korrektsus väga hea, viidete asjakohasus ja ulatus ning seostamine tekstiga väga hea, jooniste ja piltide kvaliteet ja korrektsus väga hea, järelduste tegemise oskus väga hea, teemakäsituse uudsus, loomingulisus ja loogilisus on väga heal tasemel, terminoloogia üldiselt korrektne.\nA - õpimapi vormistus eeskujulik, sisu ja struktuur eeskujulik, tehniliste lahenduste ja tööpõhimõtte esitlemise korrektsus eeskujulik, viidete asjakohasus ja ulatus ning seostamine tekstiga eeskujulik, jooniste ja piltide kvaliteet ja korrektsus eeskujulik, järelduste tegemise oskus eeskujulik, teemakäsituse uudsus, loomingulisus ja loogilisus on silmapaistev saavutus, terminoloogia eeskujulik."}}], "grade_preconditions": {"et": "Kaks nädalat enne kaitsmist lõimitud toote ja õpimapi esitamine."}, "grade_evaluation": {"et": "Hinne kujuneb lõimitud toote, kaitsmise ja õpimapi hinnangute tulemusena. \nLõpphinne kujuneb järgmiselt: 50% reaalne lõimitud toode, 25% kaitsmine ja 25% õpimapp."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "http://tehnoloogia.ee/", "is_moodle_connected": false, "mandatory_materials": "1. Tehnoloogia ja loovus. (2011). Koostanud ja toimetanud \nM. Soobik. Tallinn: MTÜ Eesti Tehnoloogiakasvatuse Liit.\n2.  Rihvk, E., Soobik, M. (2007). Metallitööd. Tööõpetus. V-IX klassile. Kirjastus Koolibri.\n3. Rihvk, E. (2005). Puidutööd. Tööõpetus. V-IX klassile. Kirjastus Koolibri.\n4. 3D-printimise käsiraamat. (2015). Büroomaailm.\nftp://post.byroomaailm.ee/Tootejuhendid/Prusa%203D/Prusa%203Dprinteri%20kasutusjuhend.pdf\n5. Kivi, K., Lüiste. A., Lips. A., Hunt, T., Annuka, H., Letunovitš, S. (2010). 3D modelleerimine. CNC pink. Joonestamine.   Tiigrihüppe Sihtasutus.\n6. Lips, A. (2012). CNC freespink tehnoloogiatunnis. MTÜ Eesti Tehnoloogiakasvatuse Liit.\n7. Kogermann, E., Tapper, V., Tihase, K. (1990). Joonestamine üldhariduskoolidele. Tallinn Valgus.\n8. Peedisson, M., Rihvk, E., Soobik, M. (2005). Käsitöö, kodunduse, töö- ja tehnoloogiaõpetuse mõisted 7.- 9. klassile. Eesti-vene-eesti sõnastik. Tartu: Tartu Ülikooli Kirjastus.\n9. Rihvk, E., Soobik, M., Peedisson, M. (2005). Käsitöö, kodunduse, töö- ja tehnoloogiaõpetuse mõisted 7.- 9. klassile. Tartu: Tartu Ülikooli Kirjastus", "recommended_materials": "1. Riives, J., Teaste, A., Mägi, R. (1996). Tehniline joonis. Tallinn Valgus..\n2. Riives, J., Tihase, K. (1983). Joonestamine. Õpik tehnikumidele. Tallinn Valgus."}, "participants": {"lecturers": [{"person_uuid": "416d8b98-cbff-4ac8-231b-3b4664fa0790", "person_name": "Mart Soobik", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "4-22"}, "entries": [{"time": "2024-09-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus õppeainesse. 3D modelleerimine ja 3D printimine."}}, {"time": "2024-10-27", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Cnc freesimine. Erinevatest materjalidest ja tehnikatest töötava seadme loov disainiprotsess. Töötamine teemakohaste allikatega, vajalike materjalide ja tehnikate valimine, analüüsimine ning sobivate lahenduste leidmine ja toote valmistamine."}}, {"time": "2024-11-24", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Arduino mikrokontrollerid. Erinevatest materjalidest ja tehnikatest töötava seadme loov disainiprotsess. Töötamine teemakohaste allikatega, vajalike materjalide ja tehnikate valimine, analüüsimine ning sobivate lahenduste leidmine ja toote valmistamine"}}, {"time": "2025-01-05", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Õpimapi koostamine.  Lõimitud toote esitlemiseks ja kaitsmiseks ettevalmistamine."}}, {"time": "2025-02-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "EKSAM. Kaitsmine."}}]}, "registration_info": {"audience": {"et": "Kunstide ja tehnoloogia õpetaja"}}, "parent_uuid": "eac7addd-e1eb-9d4a-ac10-dc48d5011a91", "parent_code": "HVVK.01.055", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}