{"uuid": "7a38b409-4e0c-5ecf-a366-05db3db9c88d", "code": "HVVK.04.076", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Improvisation", "et": "Improvisatsioon"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 4, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The class promotes continuous self development and willingness to discover, experiment, play, form and create with movement. In classes we learn the parallelism and connections of movement and thinking, paying attention to our own complicity or simplicity. We deal with processes and choices between live imagination and human body which lead to immediate image imitation without thinking about movement sequence. I invite students for intuitive choices, using conscious control and decision during movement.\nWe discover origins of movement, try to enter different roles and thereby find ourselves in new activities - all which lead to the expansion of imagination. We become more aware and skilled, working in group.\n.", "et": "Tundides uurime ja avastame kehatunnetusliku mõtlemise ja improvisatsioonilise liikumiskeele kokkupuute punktide seotust ja erinevust, pöörates tähelepanu omaenda keha keerukusele ja/ või lihtsusele. Avastame liikumise päritolu, proovime minna erinevatesse suundadesse, laiendades iseenese arusaamist liikumisest enda sees kui ka ümber, leides uusi võimalusi ja avastades end nii uutes tegevusvaldkondades ning saades seeläbi teadlikumaks eneseväljendamise võimalustest tantsuliikumiste kaudu.\nTegeleme inimkehas toimuvate protsesside ja valikutega, mis viivad idee jäljendamisele momentaalselt, mõtlemata liigutuste järjekorrale.\nImprovisatsioon on kui vaba loovuse väljendus ning vabaduse tunnetamine meie enda piiritletud võimalustest.\nImprovisatsiooni tunnis on tähtis avastada oma mina tõeline tuum, tunde-emotsioonid, tahtmised- väljendamised, fantaasia, meeleolud, soovid, unelmad, kehakeele tunnetus, refleksid, zestid jne.\nTegeleme kujutlusvõime ja inimkeha vahel toimuvate protsesside ja valikutega, mis viivad kujutluse jäljendamisele momentaalselt, mõtlemata liigutuste järjekorrale."}, "objectives": [{"en": "The course introduces the essence and possibilities of improvisation, encouraging students to move freely and improvise spontaneously. Much of the work is based on personal experience and prefers intuitive, emotional, intellectual and physical experiments in order to reach each person's individual way of expression. The goal of improvisation as an academic discipline is to develop students' creativity, fantasy, body awareness and movement sensibility.", "et": "Aine eesmärgiks on arendada üliôpilase loomingulist môtlemist ja liikumise tundlikust, kehatunnetust ning konsentratsiooni ning tutvustada keha anatoomiast lähtuvaid improvisatsioonilisi liikumisideid. \nTutvustada improvisatsioonilise kehatunnetusliku liikumiskeele olemust ja kasutamisvõimalusi, julgustades tudengeid vabalt liikuma ning looma spontaanselt uusi liikumismaterjale. Seejuures kasutatakse isiklikku informatsiooni ning kogemust, (intuitiivseid, emotsionaalseid, intellektuaalseid ) füüsiliste katsetuste tulemusena jõutakse välja igaühe originaalse ja individuaalse väljendusviisini."}], "learning_outcomes": [{"en": "1. Student is able to use inner rhythm and silence instead of musical rhythm.\n2. Is ready to move in space, time and moment without preparation, both individually as well as in a group situation.\n3. Is ready to create different personal movement patterns derived from spontaneous inspiration.\n4. Is able to find stimuli for movement, using sporadic influences of every moment; experiences group perception through collective improvisation.\n5. Discovers one's self; feelings-emotions; desires-expressions; fantasies; moods; wishes; dreams; body language and its perception,\nreflexes, gestures etc.\n6. Is able to experience and use impulse, inertia, gravitation.\n7. Is able to notice one's own movement patterns, dares to analyse them and give them an opportunity to develop through various exercises.\n8. Acquires the ability to use spontaneous expressions of will through various movements of the body; by feeling creative energy, by using\ninstinctive information and relying on oneself and others in space and time.\n9. Understands the journey into self-pursuit, self-discovery, self-realization, development.\n10. Has the wish and confidence to improvise on stage.", "et": "1. Oskab kasutada muusikalise rütmi asemel sisemist rütmi ja vaikust\n2.On valmis ettevalmistamata liikuma ruumis, ajas, hetkes, nii individuaalselt kui ka grupi situatsioonis\n3.On valmis looma spontaanse inspiratsiooni ajel erinevaid isiklikke liikumiskujundeid\n4. Oskab leida liikumisstiimulit, kasutades igat momenti juhuslikkuse mõjutajana, kogeb ansamblitaju läbi ühisimproviseerimise\n5. Avastab oma mina, tunde - emotsioonid, tahtmised - väljendamised, fantaasiad, meeleolud, soovid, unelmad, kehakeele ja selle tunnetuse,\nrefleksid, zestid jne.\n6. Oskab kogeda, kasutada impulssi, inertsi, gravitatsioonijõudu\n7. Oskab märgata enda liikumismustreid, julgeb neid analüüsida ning anda neile võimaluse arenguks läbi erinevate harjutuste.\n8. Omandab spontaanse tahteväljenduse kasutamise oskuse erinevate kehaliikumiste kaudu, tunnetades loovat energiat.\n9. Mõistab teekonda eneseotsingusse, -leidmisse, -teostusse, arengusse\n10.Omab soovi ja julgust improviseerida laval"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}