{"uuid": "7cb9b98c-5652-fd24-51f2-32fb53dacc8b", "code": "HVVK.00.072", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sound Reinforcement I", "et": "Kontsertide helindamine I"}, "credits": 8, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Subject \"Live Sound Mixing\" gives an overview of the equipment and systems needed for live mixing, their basic structure, classification, working principles and main use. Practice takes place at the events organized by organizations that have entered into a relevant contract with the UT VCA.", "et": "Tutvustab ja õpetab kasutama kaasagseid kontsertide helindamise vahendeid nagu erinevad mikserpuldid ja võimendussüsteemid. Annab praktilise võimaluse töötada praktikabaasis, jälgides juhendaja tegevusi ning teostades praktikuna erinevaid protsesse ja ülesandeid. Õpe toimub koostöös TÜ VKA praktikabaasidega nagu Viljandi Pärimusmuusika Ait, Viljandi Kultuurimaja, Viljandi Jazzklubi jne"}, "objectives": [{"en": "Aims of the subject:\nExplaining the work and application principles of the equipment and recording devices needed for live sound mixing, acquiring major working methods. Establishing theoretical base for practical courses in the program.", "et": "Õppeaine eesmärgiks on õpetada kasutama tänapäevast üristuste helindamise tehnikat ning võimaldada jälgida juhendaja tööd ning osaleda praktikabaasi tööprotsessides läbi reaalsete situatsioonide. Eesmärgiks on pakkuda võimalust omandada oskused töötamisel ja suhtlemisel kollektiivi või artistidega ning kaasaegse helitehnikaga."}], "learning_outcomes": [{"en": "By the end of the course student:\nknows basic structure, working principles and sequence of the equipment needed for the live sound mixing, knows block schema,\nknows main mixing consoles (both analogue and digital), is able to plan independently live sound mixing, considering the type and size of the event", "et": "Aine läbinud üliõpilane:\n* omab teadmisi ja oskusi tööks kontserdi helirežissöörina\n* omab teadmisi heli edastamisest ja võimendamisest \n* tunneb hästi erinevate helivõimendussüsteemide spetsiifikat\n* oskab juhtida helindusprotsessi, on võimeline seda läbi viima \n* omab teadmisi ja oskusi kontserdiks või etenduseks vajamineva helitehnilise lahenduse väljapakkumiseks"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}