{"uuid": "cacb8ee9-f346-0ed7-8c43-14bd31492c0b", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-26T12:36:30", "title": {"en": "Master's Thesis (Teacher of Arts and Technology)", "et": "Magistritöö (kunstide ja tehnoloogia õpetaja)"}, "credits": 5, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "4", "et": "4. osa", "en": "part 4"}, "part_credits": 5, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode part 4 5 CP HV", "et": "24/25 K SÕ 4. osa 5 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 115, "individual_work": 15, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Master thesis is a study in the field of general pedagogy or subject didactic of art, handycraft and home economics, music, or technology which treates studied problem in compehensive way.", "et": "Magistritöö on üldpedagoogiline või ainedidaktiline uurimuslik töö või rakendusliku iseloomuga projekt, mis annab tervikliku lahenduse valitud probleemile ning vastab teadustöö nõuetele."}, "objectives": [{"en": "Apply the knowledge and skills acquired throughout the curriculum to address a research problem within the field of study.", "et": "Rakendada õppekava läbimisel omandatud teadmisi ja oskusi erialase uurimisprobleemi lahendamisel."}], "learning_outcomes": [{"en": "A student who successfully defends their thesis will be able to:", "et": "Magistritöö edukalt kaitsnud üliõpilane:"}, {"en": "1) Identify the research problem, formulate the research aim, and develop research questions;", "et": "1) määratleb erialase uurimisprobleemi, seab eesmärgi ja sõnastab uurimisküsimused;"}, {"en": "2) Utilize appropriate sources to elaborate on the research topic;", "et": "2) kasutab teema käsitlemiseks asjakohaseid allikaid;"}, {"en": "3) Apply relevant research methods to achieve the research objective and describe the process;", "et": "3) kasutab eesmärgi saavutamiseks sobivaid uurimismeetodeid ja kirjeldab protsessi;"}, {"en": "4) Present, interpret, and analyze the study results within the disciplinary context;", "et": "4) esitab uurimistöö tulemused, tõlgendab ja analüüsib neid erialases kontekstis;"}, {"en": "5) Format the written thesis appropriately, cite sources correctly, express ideas clearly, and adhere to orthographic rules;", "et": "5) vormistab lõputöö kirjaliku osa nõuetekohaselt, viitab allikatele, väljendab end arusaadavalt ja järgib õigekirja norme;"}, {"en": "6) Present the outcomes of their thesis in an understandable manner during the defense and discuss related issues;", "et": "6) esitleb oma töö tulemusi kaitsmisel arusaadavalt ja arutleb tööga seonduvatel teemadel;"}, {"en": "7) Follow ethical principles throughout the research process.", "et": "7) järgib kogu protsessi vältel eetikapõhimõtteid."}], "notes": {"et": "Magistritöö kaitsmine Viljandis"}}, "grading": {"independent_work": {"et": "Üliõpilane kirjutab juhendaja juhendamisel magistritööd vastavalt kokkulepitud ajakavale"}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Esitab valminud magistritöö, mis nii sisuliselt kui vormistuslikult vastab TÜVKA juhendi nõuetele. Kaitseb magistritöö avalikul kaitsmisel, kus vastab retsensendi ja kaitsmiskomisjoni küsimustele."}}], "grade_preconditions": {"et": "Valmis magistritöö esitamine"}, "grade_evaluation": {"et": "Lõpphinne kujuneb magistritöö sisulise ja vormistusliku poole, magistritöö kaitsmise ning retsensendi ja kaitsmiskomisjoni küsimustele vastamise tulemusel."}, "grade_conditions": {"A": {"et": "Tööl on uudne, teaduslikult oluline probleemiasetus ning seda on igakülgselt põhjendatud ja piiritletud. Meetod(id) on valitud lähtuvalt eesmärgist ja uurimisküsimustest ja võimaldavad neid saavutada. Allikad on valitud teemakohaselt, need on mitmekesised ja piisavad. Ülevaade varasematest uuringutest on esitatud läbimõeldult ja mitmekülgselt, teema on põhjendatult paigutatud erialasesse konteksti. Teemakohaseid allikaid on kasutatud otstarbekalt ja eesmärgipäraselt, demonstreerides nende põhjalikku tundmist. Autor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt omapoolse originaalse panuse. Töö on loogiliselt struktureeritud. Argumentatsioon on elegantne ja erudeeritud, tulemuste tõlgendamine ja omavaheline seostamine silmapaistev ja süntees erialase kirjandusega läbimõeldud ja isikupärane. Töö maht vastab nõuetele. Vormistus vastab kehtivale Juhendile. Viitamine on korrektne. Töö on kirjutatud suurepärases eesti keeles, väljendusviis on akadeemiline, stiililiselt ja grammatiliselt laitmatu. Üliõpilane annab kaitsmiskõnes asjakohase ja kontekstualiseeriva ülevaate töö uurimisprobleemist /eesmärgist, uurimisküsimustest, meetoditest ja peamistest tulemustest.  Vastab põhjendatult ja vajaliku üldistusega esitatud küsimustele. Uurimistöö on kooskõlas teaduseetika nõuetega."}, "B": {"et": "Tööl on teaduslikult oluline probleemiasetus on igakülgselt põhjendatud ja piiritletud. Meetod(id) on valitud lähtuvalt eesmärgist ja võimaldavad seda saavutada. Allikad on teemakohased ja need on piisavad. Ülevaade varasematest uuringutest on esitatud läbimõeldult, teema on põhjendatult paigutatud erialasesse konteksti. Teemakohaseid allikaid on kasutatud otstarbekalt ja eesmärgipäraselt, demonstreerides nende väga head tundmist. Autor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt töö tulemused. Töö on loogiliselt struktureeritud. Argumentatsioon on põhjendatud ja sidus, tulemuste tõlgendamine ja omavaheline seostamine põhjalik ja süntees erialase kirjandusega läbimõeldud. Töö maht vastab üldjoontes nõuetele. Vormistus vastab kehtivale juhendile, üksikute väikeste puudustega. Töö on kirjutatud väga heas eesti keeles, stiil on grammatiliselt korrektne. Viitamine ja väljendusviis on korrektsed. Üliõpilane annab kaitsmiskõnes asjakohase ja kontekstualiseeriva ülevaate töö uurimisprobleemist / eesmärgist, uurimisküsimustest meetoditest ja peamistest tulemustest. Esineb ja väitleb ladusalt. Vastab põhjendatult ja vajaliku üldistusega esitatud küsimustele. Uurimistöö on kooskõlas teaduseetika nõuetega."}, "C": {"et": "Tööl on teaduslikult oluline probleemiasetus ja/või eesmärgipüstitus, seda on põhjendatud ja piisava selgusega piiritletud. Meetod(id) on osaliselt valitud lähtuvalt eesmärgist ning võimaldavad seda saavutada. Allikad on valitud teemakohaselt, aga neis esineb puudujääke. Varasem uurimislugu on esitatud, teema on paigutatud erialasesse konteksti. Teemakohaseid allikaid/materjale on kasutatud otstarbekalt ja eesmärgipäraselt. Autor viib ettevõetud ülesande lahendamise lõpule, esitades selgelt töö tulemused. Töö on üldjoontes loogiliselt struktureeritud. Argumentatsioon on sidus, tulemuste tõlgendamine ja omavaheline seostamine piisav ja süntees erialase kirjandusega üldjoontes läbimõeldud. Töö maht vastab üldjoontes nõuetele. Vormistus vastab kehtivale juhendile, üksikute puudustega. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb ebatäpsusi, kuid viitamissüsteem on ühtne. Üliõpilane annab kaitsmiskõnes asjakohase ülevaate töö uurisprobleemist /eesmärgist ja uurimisküsimustest, meetoditest ja peamistest tulemustest. Esineb ja väitleb ladusalt. Vastab põhjendatult esitatud küsimustele."}, "D": {"et": "Tööl on teaduslikult oluline probleemiasetus, kuid see on ebapiisavalt põhjendatud ja ebaselgelt piiritletud. Meetod(id) on osaliselt valitud lähtuvalt eesmärgist. Allikad on valitud teemakohaselt, aga neis esineb olulisi puudujääke. Varasem uurimislugu on esitatud osaliselt, teema on osaliselt paigutatud erialasesse konteksti. Teemakohaste allikate/materjalide kasutuses on märgatavaid puudujääke. Autor viib ettevõetud ülesande lahendamise lõpule, esitades töö tulemused. Töö struktuuris on küsitavusi. Argumentatsioon on kohati katkendlik, tulemuste tõlgendamine ja omavaheline seostamine laialivalguv ja süntees erialase kirjandusega juhuslik. Töö maht ületab või jääb oluliselt allapoole nõutud piiri. Vormistus vastab kehtivale juhendile, kuid esineb ka puudusi. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb mitmeid ebatäpsusi ja kohatist ebajärjekindlust. Üliõpilane annab kaitsmiskõnes ülevaade töö uurimisprobleemist /eesmärgist ja uurimisküsimustest, meetoditest ja peamistest tulemustest. Vastab esitatud küsimustele üldjoontes veenvalt."}, "E": {"et": "Tööl on teaduslik probleemiasetus, kuid see ei ole põhjendatud ja selgelt piiritletud. On küsitavusi valitud meetod(it)e sobivuses töö eesmärgi saavutamiseks. Allikad/materjalid on osaliselt valitud teemakohaselt, aga neis esineb olulisi puudujääke. Ülevaade varasematest uuringutest on esitatud kasinalt, teema paigutamine erialasesse konteksti jääb pinnapealseks. Teemakohaste allikate/materjalide kasutuses on olulisi puudujääke. Autor viib ettevõetud ülesande lahendamise lõpule, kuid tulemused jäävad ebaselgeks. Töö struktuuris on märkimisväärseid küsitavusi. Argumentatsioon on katkendlik, tulemuste tõlgendamine ja omavaheline seostamine pealiskaudne ja süntees erialase kirjandusega napp ja juhuslik. Töö maht ületab või jääb oluliselt allapoole nõutud piiri. Vormistus vastab üldjoontes kehtivale juhendile, kuid esineb ka märkimisväärseid puudusi. Töö on kirjutatud heas eesti keeles, stiil on grammatiliselt korrektne. Viitamises esineb olulisi ebatäpsusi ja ebajärjekindlust. Üliõpilane kirjeldab kaitsmiskõnes töö uurimisprobleemi / eesmärki ja uurimisküsimusi, meetodeid ja tulemusi, kuid on laialivalguv; vastab esitatud küsimustele ebaselgelt ja mitteveenvalt."}, "F": {"et": "Magistritöö ja selle kaitsmise tulemus jääb allapoole hindele E seatud tingimusi."}, "mi": {"et": "Üliõpilane ei ilmu kaitsmisele kohale"}}, "debt_elimination": {"et": "Vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "6173bc9a-a5eb-423d-ab95-d7a000f5dfcd", "type": "MOODLE", "code": "HVVK.03.004_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "TÜ VKA lõputööde juhend https://viljandi.ut.ee/sites/default/files/2024-12/T%C3%9C%20VKA%20l%C3%B5put%C3%B6%C3%B6de%20juhend%202024_0.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "eea99e92-3ea1-e342-d26e-06fa65e80fdb", "person_name": "Marvi Remmik", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "time": "2025-05-30", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 3, "topic": {"et": "Magistritööde kaitsmine"}, "description": {"et": "Üliõpilane tutvustab kaitsmisel 12 min jooksul oma magistritööd ning vastab retsensendi ja kaitsmiskomisjoni küsimustele."}}, {"course_week": 1, "time": "2025-05-29", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 2, "topic": {"et": "Magistritööde kaitsmine"}, "description": {"et": "Üliõpilane tutvustab kaitsmisel 12 min jooksul oma magistritööd ning vastab retsensendi ja kaitsmiskomisjoni küsimustele."}}, {"course_week": 1, "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {"et": "Magistritöö kirjutamine juhendaja juhendamisel vastavalt kokkulepitud ajakavale"}, "description": {"et": "Magistritöö kirjutamine juhendaja juhendamisel vastavalt kokkulepitud ajakavale."}}]}, "registration_info": {"audience": {"et": "Kunstide ja tehnoloogia õpetaja magistriõpe"}}, "parent_uuid": "009173cb-7a3a-8fde-1e09-1a975b0f6a2d", "parent_code": "HVVK.03.004", "parent_credits": 15, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}