{"uuid": "1b42d0be-3bd2-3cac-fc0f-d59e446a569a", "code": "HVVK.03.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Analysis of Artwork", "et": "Kunstiteose analüüs"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will give an overview of different theoretical approaches and possibilities of describing, analysing, interpreting, evaluating and understandig artworks. The role of art in developing students' critical thinking skills will be discussed. The homework consists of visiting exhibitions, reading literature, preparing and presenting presentations.", "et": "Kursus annab ülevaate nii kaasaegse- kui minevikukunsti tõlgendamise võimalustest ning kunstiteoste vaatlemiseks, kirjeldamiseks ja mõistmiseks vajalike teadmiste ja oskuste kujunemisest. Käsitletakse kunsti osa kriitilise mõtlemise arendamises.\nÕppetöö toimub loengute ja seminaride vormis. Kohustuslikud on jooksvad näitusekülastused, millele järgneb seminarides toimuv ühine muljete jagamine ja analüüs; iseseisev töö kirjandusega ja ettekanded."}, "objectives": [{"en": "To give an overview of\n- the possibilities to interpret both contemporary and historical art\n- the role of art in developing critical thinking skills\nTo develop participants' communication and self expression skills through talking and writing about art", "et": "Kursus annab ülevaate nii kaasaegse- kui minevikukunsti tõlgendamise võimalustest ning kunstiteoste vaatlemiseks, kirjeldamiseks ja mõistmiseks vajalike teadmiste ja oskuste kujunemisest. Käsitletakse kunsti osa kriitilise mõtlemise arendamises. Praktilise tegevuse käigus luuakse eeldused  üliõpilaste suhtlus- ja eneseväljendusoskuse arenguks."}], "learning_outcomes": [{"en": "-\tKnows different theoretical approaches of understanding and evaluating art", "et": "Tunneb kunsti mõistmise ja hindamise erinevaid teoreetilisi seisukohti."}, {"en": "-\tKnows the stages of aesthetic development", "et": "Tunneb esteetilise arengu etappe."}, {"en": "-\tIs able to describe, analyse and critically evaluate both contemorary and historical artworks", "et": "On võimeline nii kaasaja kui mineviku kunstiteoseid kirjeldama, analüüsima ja kriitiliselt hindama."}, {"en": "-\tKnows different schemes used for organising pictorial space", "et": "Oskab analüüsida kunstiteose vormi, ainest, meediumi ja konteksti."}, {"en": "-\tCan prepare and conduct the art discussions based on age, interests and needs", "et": "Tunneb pildipinna organiseerimise erinevaid skeeme."}, {"en": "of participants", "et": "Oskab kunstivestlusi ette valmistada ja läbi viia arvestades seejuures osalejate vanuse, huvide ja vajadustega ."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}