{"uuid": "33df8023-b258-0ed3-4226-0390f92a5445", "code": "HVVK.01.226", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-30T08:52:55", "title": {"en": "History of Design", "et": "Disaini ajalugu"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK01", "structural_unit_name": {"en": "Department of Estonian Native Crafts", "et": "rahvusliku käsitöö osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK01", "name": {"en": "Department of Estonian Native Crafts", "et": "rahvusliku käsitöö osakond"}, "address": "Turu 7\n71020 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Turu 7", "zip": "71020", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVVK", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of the historical development of design, starting with the Arts and Crafts movement at the end of the 19th century. Design styles in this context are inseparable from the general beliefs and aesthetic values of the given era. The aim of the course is to highlight the different historical schools that influence our artificial environment to this day (Bauhaus, De Stijl, Art Nouveau, Streamline, etc.). Through historical changes in man's artificial environment, the course participant learns to see the connections between craft, design and technology.", "et": "Kursus annab ülevaate disaini ajaloolisest arengust alustades Arts and Crafts liikumisest 19. sajandi lõpus. Disaini stiilid on antud kontekstis lahutamatud antud ajastu üldistest tõekspidamistest ning esteetilistest väärtustest. Kursuse eesmärk on tuua välja erinevad ajaloolised koolkonnad, mis mõjutavad meie meie tehiskeskkonda tänapäevani (Bauhaus, De Stijl, Art Nouveau, Streamline, jne). Läbi ajalooliste muutuste inimese tehiskeskkonnas õpib kursusel osalenu nägema seoseid käsitöö, disaini ja tehnoloogia vahel."}, "objectives": [{"en": "The purpose of the course is to provide a historical overview of the changes in design styles throughout the 20th century and to examine the role of technology and craft in design.", "et": "Kursuse eesmärk on anda ajalooline ülevaade disaini stiilide muutumisest läbi 20. sajandi ja vaadelda tehnoloogia ning käsitöö rolli disainis."}], "learning_outcomes": [{"en": "After passing the course student\nUpon successful completion of the subject, the students should\n- Can distinguish between different design styles and schools\n- Can relate the design style to the broader cultural background system of the given era\n- Understands the connections between historical craft technology and modern mass production.\n- Understands the role of the industrial revolution in changing design and the general artificial environment.", "et": "Aine edukal läbimisel üliõpilane\n- Oskab eristada erinevaid disaini stiile ja koolkondi\n- Oskab disaini stiili seostada antud ajastu laiema kultuurilise taustsüsteemiga\n- Mõistab seoseid ajaloolise käsitöö tehnoloogia ja moodsa masstootmise vahel.\n- Saab aru tööstusrevolutsiooni rollist disaini ja üldise tehiskeskkonna muutumises."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}