{"uuid": "aa5397ef-fdd3-5243-9b4c-63fcaaa8e33f", "code": "HVVK.01.070", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Presentation Practice", "et": "Esitluspraktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Practical training consists of taking part in an exhibition, fair, sales event and/or specialised presentation of the student's free choice and/or planning of and/or carrying out an event either individually or as a member of a team. In the course of practical training the student keeps a practice journal that states:\n- the general description of the events in which the student participated or that he/she organised;\n- timetable of practical training;\n- the work description that defines the tasks in the student's work segment together with results thereof;\n- comparison of the materialisation of the budget and costs;\n- other materials that characterise the content and environment of practical training, as deemed necessary.\n\nPraktika aruanne koostatakse vastavalt rahvusliku metallitöö eriala praktika aruannete koostamise juhendile.\n\nAs an additional task, the student visits and describes exhibitions and sales events according to the instructions in Moodle.", "et": "Praktika koosneb vabalt valitud näitusel, messil, müügiüritusel ja/või erialasel esitlusel osalemisest ja/või ürituse kavandamisest ja/või läbiviimisest individuaal- või meeskonnatööna. Üliõpilane peab praktika käigus praktikapäevikut, kus on kirjas:\n- osaletud ja organiseeritud ürituste üldkirjeldus;\n- praktika ajakava;\n- oma töölõigu ülesandeid määratlev töökirjeldus koos tulemustega;\n- eelarve ja kulude teostumise võrdlus;\n- muud praktika sisu ja keskkonda iseloomustavad materjalid vastavalt juhtumile.\nPraktika aruanne koostatakse vastavalt rahvusliku metallitöö eriala praktika aruannete koostamise juhendile.\nLisaülesandena külastab ja kirjeldab üliõpilane erialaseid näituseid ja müügiüritusi vastavalt Moodle'is olevale juhisele."}, "objectives": [{"en": "The purpose of the subject is to provide the student the chance to present the speciality of traditional metalwork and/or specialised techniques at an event or learning environment", "et": "Anda üliõpilasele rahvusliku metallitöö eriala ja/või erialaste töövõtete tutvustamise kogemus vabalt valitud üritustel või õppekeskkonnas. Tutvuda valdkonna näituste ja müügiürituste väljaga laiemalt."}], "learning_outcomes": [{"en": "According to the chosen practice, the student:", "et": "Vastavalt valitud praktikateemale üliõpilane "}, {"en": "- is able to assess the market situation of specialised handmade products and his/her own position on the market;", "et": "- oskab hinnata erialast käsitöötoodete turusituatsiooni ja enda positsiooni selles;"}, {"en": "- is able to evaluate the specific nature and the target group of the organised event;", "et": "- oskab hinnata läbiviidava ürituse spetsiifikat ja ürituse sihtgruppi;"}, {"en": "- is introduced how to draft the conception of an event and the action plan for the organising team, how to select the necessary inventory and how to prepare advertising materials; ", "et": "- on tutvunud ürituse kontseptsiooni koostamisega, korraldusmeeskonna tegevuskavaga, osalenud vajamineva inventari valimisel ning reklaammaterjalide koostamisel;"}, {"en": "- is capable of selecting and preparing the exhibits of the event and arranging these at the site of the event taking into account the compositional rules and aesthetic requirements;", "et": "- on võimeline välja valima ning ette valmistama ürituse eksponaadid ning need üritusekohas kompositsioonireegleid ja esteetilisi nõudeid arvestades üles seadma;"}, {"en": "- knows how to give an overview of the speciality of traditional metalwork;", "et": "- oskab tutvustada rahvusliku metallitöö eriala;"}, {"en": "- is aware of the personal and collective scope of responsibility", "et": "- tajub isiklikku ja kollektiivset vastutusala"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}