{"uuid": "75c7f3a7-c441-60a5-001f-d7f7bd469eff", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-09T13:17:17", "title": {"en": "Master's Project", "et": "Magistriprojekt"}, "credits": 24, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode HV", "et": "24/25 K SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 8, "independent_work": 612, "individual_work": 4, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Carrying out, preparing and defending a Master's project that meets the requirements. \nA Master's project is a research-based thesis with a practical orientation, aiming at solving a specific problem or topic by means of specialised knowledge and with an applied outcome. The Master's project consists of three parts: a) the practical part, b) the theoretical/methodological framework, c) the documentation of the project's working process. The practical part is a self-contained whole, the form and scope of which are consistent with the objectives of the Master's project. The main text of the theoretical/methodological part shall be approximately 20 to 30 standard pages (36 000 to 54 000 characters in single quotation marks).\n\nA master's thesis project is defined as a creative design, artistic, development or research project based on practical performance and experiments in the field of traditional music, technology or other cultural heritage, and a written reflection on the project. The project may be a work of art, a patented invention, an exhibition, a database, a concert (30-35 minutes), a film, a tutorial, a manuscript, teaching material, a database, etc.; in the case of an object or technology research project, the project may consist in the large-scale realisation of a practical experiment; the project may also be a business or institutional development project or a product development project that is intrinsically linked to the field of cultural heritage.", "et": "Nõuetele vastava magistriprojekti teostamine, vormistamine ja kaitsmine. \nMagistriprojekt on praktilise kallakuga uurimuslik lõputöö, mille eesmärk on teatud probleemi või teema lahendamine erialaste teadmiste abil ning millega kaasneb rakenduslik tulemus. Magistriprojekt koosneb kolmest osast: a) praktiline osa, b) teoreetilis/metodoloogiline raamistus, c) projekti tööprotsessi dokumentatsioon. Praktiline osa on iseseisev tervik, mille vorm ja maht on vastavuses magistriprojekti eesmärkidega. Teoreetilis/metodoloogilise osa põhiteksti maht on orienteeruvalt 20–30 standardlehekülge (36 000–54000 tähemärki koostühikutega).\n\nMagistritöö projektiks loetakse praktilisel sooritusel ja eksperimentidel põhinevat pärimusmuusikalist, pärandtehnoloogilist vm kultuuripärandi loovrakenduslikku disaini-, kunsti-, arendus- või uurimisprojekti ning seda reflekteerivat kirjalikku osa. Projekt võib olla teos, patentne leiutis, näitus, andmebaas, kontsert (30-35 minutit), film, juhend, käsikiri,  õppematerjal, andmebaas vmt; eseme- või tehnoloogiauurimuse puhul võib projekt seisneda praktilise eksperimendi suuremahulises teostamises; projekt võib olla ka ettevõtte või asutuse arendusprojekt või tootearendusprojekt, mis on olemuslikult seotud kultuuripärandi valdkonnaga."}, "objectives": [{"en": "Combine acquired theoretical knowledge and practical skills for a large-scale creative project in the field of cultural heritage.", "et": "Ühendada omandatud teoreetilised teadmised ja praktilised oskused kultuuripärandi alaseks suuremahuliseks loovprojektiks."}], "learning_outcomes": [{"en": "A student having passed the course:", "et": "Aine läbinud üliõpilane:"}, {"en": "- is able to carry out a creative project independently or as a team, document the project and present its results in both written and visual/auditory form;", "et": "- oskab läbi viia loomingulist projekti iseseisvalt või meeskonnatööna, projekti dokumenteerida ja selle tulemusi esitada nii kirjalikus kui ka visuaalses/kuuldelises vormis;"}, {"en": "- is able to critically use professional literature and other sources;", "et": "- oskab kriitiliselt kasutada erialast kirjandust ja teisi allikaid;"}, {"en": "- is able to demonstrate his/her comprehensive knowledge of professional skills and knowledge;", "et": "- on suuteline demonstreerima erialaste oskuste ja teadmiste terviklikku tundmist;"}, {"en": "- has applied awareness of the ethical aspects of his/her activities and their role in society.", "et": "- on rakendanud teadlikkust oma tegevuse eetilistest aspektidest ja ühiskondlikust rollist."}], "notes": {"et": "Magistriprojekt ja selle kirjalik osa peavad olema vormistatud vastavalt Tartu Ülikooli Viljandi kultuuriakadeemia lõputööde juhendile"}}, "grading": {"independent_work": {"et": "Töö juhendajaga. Võimalus saada eriala õppejõududelt (veebi)konsultatsioone.\nMagistriprojekti juures mitte unustada kirjaliku osa lõppu lisada lihtlitsents!"}, "independent_work_assessments": [{"work_type": {"code": "performance", "et": "Etendus", "en": "performance"}, "description": {"et": "Pärimusmuusika kontserdi puhul hinnatakse:\npillimängu tehnilist taset\nisikupärast mängustiili\noriginaalsust\nkava terviklikkust\nlavakultuuri\nkirjaliku töö vastavust magistriprojektile esitatud nõuetele\neneseanalüüsi oskust oma projekti kaitsmisel\nkirjalikus töös välja toodud eesmärgistatud kontseptsiooni läbiviimist kontsertkava esitamisel.\nKirjalikku osa kaitstakse hiljem komisjoni ees, lisades suulisse ettekandesse kontserdi reflektsiooni. \n\nKriteeriumid: \nLoovprojekti osakaal hindest on 70%.\nA (suurepärane) - Muusikaline esitus on laitmatu, omanäoline ja artistlik. Muusikaprojekt on läbiviidud silmapaistva tehnilise meisterlikkuse, hea stiilitundmise ja muusikalise maitsega.\nB (väga hea) - Muusikaline esitus on veenev, keskendunud ja omanäoline. Muusikaprojekt on läbiviidud ilma silmatorkavate vajakajäämiste ja ebaõnnestumisteta.\nC (hea) - Muusikaline esitus on üldiselt sujuv, ilma suuremate tekstiliste ja muusikaliste ebaõnnestumisteta, kuid ilma artistliku sära ja omanäolisuseta. Keskendumine musitseerimisprotsessis on kõikuv.\nD (rahuldav) - Muusikalises esituses esineb tehnilist ja muusikalist juhuslikkust. Muusikaprojekt on tehniliselt ja kunstiliselt tagasihoidlikul tasemel, ilma erilise veenvuseta.\nE (kasin) - Muusikalises esituses on vigu, tervik väheveenev."}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "Pärandtehnoloogia projekti puhul hinnatakse:\nteostuse tehnilist kvaliteeti (nt video, näitus jne)\nsisulist kvaliteeti ja vastavust eesmärkidele\nmeisterlikku teemakäsitlust (paistab välja koostaja oskuste kõrge tase ja vaataja jaoks metoodiliselt/sisuliselt selge struktuur)\n\nHindamiskriteeriumid: \nLoovprojekti osakaal hindest on 70%.\nA (suurepärane) - Projekti vorm ja sisu vorm on teostatud laitmatult ja meisterlikult (õppematerjal on õppija jaoks väga arusaadavalt koostatud, rikastatud näidetega jms). \nB (väga hea) - Projekti vorm ja sisu vorm on teostatud õnnestunult. Esineb pisipuudusi sisus või vormis. (õppematerjal on õppija jaoks arusaadavalt koostatud, rikastatud näidetega jms, võib esineda pisivigu).\nC (hea) - Projekti vorm ja sisu vorm on teostatud keskpäraselt. Esineb puudusi sisus või vormis. (õppematerjal on õppija jaoks suhteliselt arusaadavalt koostatud).\nD (rahuldav) - Projekti vorm ja sisu vorm on teostatud küsitavustega. Esineb märkimisväärseid puudusi sisus või vormis.(õppematerjal on õppija jaoks segane).\nE (kasin) - Projekti vormis ja sisus on suuri küsitavusi, tehniline esitus nõrk, metoodika ebajärjekindel ja ei vasta kirjaliku töö eesmärkidele. (õppematerjal on õppija jaoks rasekesti arusaadav)"}}], "grade_preconditions": {"et": "Õppekava täitmine täies mahus.\nKohustuslik osalemine eelkaitsmisel aprillis.\nLõpetatud nõuetele vastav magistritöö laadida Moodlesse 2 nädalat enne kaitsmist\nÕppekorralduseeskirja punkti 78 kohaselt hinnatakse lõputööd avalikul kaitsmisel.\nIsikuandmete, riigi-, ärisaladuse või tehnoloogilise lahenduse saladuse kaitseks võib\nõppeprodekaan kaitsja põhjendatud taotluse alusel kuulutada kaitsmise kinniseks."}, "grade_evaluation": {"et": "Lõpphinne kujuneb avalikul kaitsmisel kui mõjuvatel põhjustel pole otsustatud teisti. Lõpliku hinde lõputööle annab kaitsmiskomisjon, kes võtab arvesse retsensendi\nhindeettepanekut, kaitsmiskomisjoni liikmete hinnangut tööle ja kaitsmisele ning\njuhendaja(te) arvamust."}, "grade_conditions": {"A": {"et": "suurepärane - Projekti vorm ja sisu vorm on teostatud laitmatult ja meisterlikult"}, "B": {"et": "väga hea - Projekti vorm ja sisu vorm on teostatud õnnestunult. Esineb pisipuudusi sisus või vormis."}, "C": {"et": "hea - Projekti vorm ja sisu vorm on teostatud keskpäraselt. Esineb puudusi sisus või vormis."}, "D": {"et": "rahuldav - Projekti vorm ja sisu vorm on teostatud küsitavustega. Esineb märkimisväärseid puudusi sisus või vormis."}, "E": {"et": "kasin - Projekti vormis ja sisus on suuri küsitavusi, tehniline esitus nõrk, metoodika ebajärjekindel ja ei vasta kirjaliku töö eesmärkidele."}, "F": {"et": "puudulik - Projekti sisu ja vorm ei vasta miinimumnõetele. Magistriprojekti sisu ja vorm ei moodusta tervikut"}, "mi": {"et": "mitteilmunud"}}, "debt_elimination": {"et": "Ümbertöötatud, täiendatud magistritööd on võimalik kaitsta järgmisel aastal korralisel kaitsmisel"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "f6ee7f6b-e62c-35ea-95a5-00537f7f1619", "person_name": "Indrek Ikkonen", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "time": "2025-03-26", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {"et": "Eelkaitsmisele minevate tööde esitamine"}, "description": {"et": "Vähemalt 80% ulatuses valminud magistriprojekti ja selle kirjaliku osa esitamine eelkaitsmiseks Moode keskkonnas"}}, {"course_week": 1, "time": "2025-04-04", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "Eelkaitsmine"}, "description": {"et": "Vähemalt 80% ulatuses valminud magistriprojekti esitamine eelkaitsmiseks, arutelu millest võtavad osa esimese kursuse magistrandid ja eriala õppejõududest koostatud komisjon."}}, {"course_week": 1, "time": "2025-05-12", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 1, "topic": {"et": "Magistritöö esitamine"}, "description": {"et": "Valminud magistriprojekti esitamine - esitada tuleb nii kirjalikud kui praktilised osad"}}, {"course_week": 1, "time": "2025-05-26", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 2, "topic": {"et": "Magistritööde/projektide kaitsmine"}, "description": {"et": "Esitatud magistritööde ja -projektide avalik kaitsmine"}}, {"course_week": 1, "time": "2025-05-27", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 3, "topic": {"et": "Magistritööde/projektide kaitsmine"}, "description": {"et": "Esitatud magistritööde ja -projektide avalik kaitsmine"}}]}, "registration_info": {"audience": {"et": "KULO 2"}}, "parent_uuid": "fb02b591-3e47-eda5-6030-900844b97fb7", "parent_code": "HVVK.01.151", "parent_credits": 24, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}