{"uuid": "9b24aae9-1573-72ff-20ca-d1fa0242664d", "code": "HVVK.01.209", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-05T10:47:53", "title": {"en": "Matter Circulation in Nature and Culture", "et": "Aineringe looduses ja kultuuris"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "XXX", "et": "Planeet Maa kui süsteem. Planeedi allsüsteemid. Aineringed ja energiavood looduses. Aineringed ja energiavood tehnosfääris, läbilase ja majanduse suursüsteemid. Kasvu piirid; piiride olemus (nafta, mulla jne tipud [peak oil, peak soil], planetaarsete piiride kontseptsioon). Mis on teispool piire? Lühiülevaade peamistest planeedi tuleviku teaduslikest mudeldustest. Lühiülevaade ökoloogilise kriisiga kohanemise teooriatest ja strateegiatest. Erinevate teadmusvormide (teaduslik-ratsionaalne, kohalik, pärimuslik jne) ja strateegiate võimalused ja piirid kohanemisel. Elurikkus maal ja linnas, muld ja teised kohalikud loodusvarad ning ökosüsteemiteenused, nende seosed planetaarsete süsteemide ja globaalsete riskidega. Aineringete, energiavoogude ja sesoonsusega arvestamine elamise ja väiketöönduse kavandamisel. Permakultuuri põhimõtted. Igaühe looduskaitse. Taastav majandamine. Hoole ja rahulejätmise eetika ja praktika. Postfossiilne esteetika ja hügieen. Konkreetse tegevuskeskkonna, materjalide, kliendisuhete ja tehnoloogiliste lahenduste hindamine; rajasõltuvused; säilenõtkuse kasvatamine. Süntroopiliste süsteemide kujundamise praktilisi võtteid (taime- ja loomakasvatuse, komposteerimise, põletamise [downcycling], vee talletamise jne kaasamine töönduslikesse protsessidesse). Mitterahalised varad majandamisel: tuvastamine, kasvatamine ja kaitse. Ringse kavandamise ülesanded."}, "objectives": [{"en": "XXX", "et": "Õppeaine eesmärk on anda lühiülevaade Maa kui süsteemi toimimisest ning peamistest majanduskasvu piire ning piiride ületamist käsitletavatest mudelitest, et aidata teadlikult kavandada isiklikku ja tööelu ning väiketöönduslikku majandamist süveneva ökoloogilise kriisi ja energiavaesuse tingimustes."}], "learning_outcomes": [{"en": "XXX", "et": "- oskab selgitada peamiste looduslike ja antropogeensete aine- ja energiavoogude toimimist;\n- oskab selgitada olulisemaid majanduskasvu piire ning piiride ületamist käsitletavate mudelite olemust ja tähendust;\n- oskab arutleda selle üle, millised on looduslike ja inimtekkeliste ainevoogude olemusest ja majanduskasvu piiridest tulenevad järeldused praktiliseks keskkonnamuutustega kohanemiseks ning kohalike säilenõtkete toimemudelite arendamiseks;\n- oskab süveneva ökoloogilise kriisi ja energiavaesuse tõsiasjadest teha järeldusi isikliku ja tööelu ning väiketööndusliku majandamise ja ettevõtluse kohta, suudab neil teemadel järjekindlalt ja elulähedaselt arutleda."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}