{"uuid": "550d20e1-d65a-f2ea-2454-c76cdc7a2925", "code": "HVVK.01.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Photography", "et": "Fotograafia alused"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "A brief overview of the history of photography. Learning to choose the right numerical aperture, exposure time and focal length. Learning how to take into account natural light both outdoors and indoors, photo composition, focal points, perspective, etc. when taking photos. Practical courses include taking photos of detailed and general views. Learning the basic techniques of photo-processing and preparing photos for print.", "et": "Antakse lühiülevaade fotograafia ajaloost. Õpitakse tundma fotokaamera ehitust, tööpõhimõtet ja erinevaid fototehnilisi abivahendeid. Õpitakse kasutama  erineva fookuskaugusega objektiive, erinevat avaarvu ja säriaega, ISO-tundlikkuse ja valge-tasakaalu määramist. Õpitakse kasutama erinevat valgustust, foto kadreerimise, kaadriplaanide, võttenurkade, perspektiivi põhimõtteid. Õpitakse esmaseid digitaalsete fotode töötlemise ja trükiks ettevalmistamise võtteid."}, "objectives": [{"en": "To learn the principles of photography and how to take photos of satisfactory quality.", "et": "Tutvuda fotograafia põhitõdedega ja õppida rahuldava kvaliteediga pildistama."}], "learning_outcomes": [{"en": "Students who have completed the course:", "et": "Aine läbinud üliõpilane:"}, {"en": "- are familiar with the principles of photography and know how to take those principles into account in practice;", "et": "- tunneb fotograafia põhitõdesid ja oskab neid praktikas kasutada;"}, {"en": "- know how to use different photography settings on cameras;", "et": "- oskab kasutada fotoaparaadi erinevaid pildistamise režiime;"}, {"en": "- are familiar with the aesthetic and technical possibilities of photo composition;", "et": "- tunneb foto komponeerimise esteetilisi ja tehnilisi võimalusi;"}, {"en": "- are familiar with the specifics of product photos and photos describing the work process;", "et": "- tunneb tootefoto ja tööprotsessi kirjeldava foto spetsiifikat;"}, {"en": "- know how to read and interpret information in photos and pick photos according to their informational properties and function;", "et": "- oskab fotol olevat infot lugeda ja tõlgendada, valida fotosid vastavalt informatiivsusele ja kasutusotstarbele;"}, {"en": "- are capable of taking photos of their works and work processes.", "et": "- on võimeline enda loomingut ja tööprotsesse pildistama."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}