{"uuid": "6b8c5572-486e-307d-4cb9-f457878cef1c", "code": "HVVK.04.139", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Video Script", "et": "Video režii"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course consists of regular classes, where wer learn to use different video equipment and software. It is followed by theoretical part which is parallel with daily tasks that we will watch and feedback in the next class. The course ends with a larger scale video production process that will have a public screening as an exam in the end of the semester.", "et": "Aine koosneb regulaarsetest praktikumidest, kus õpime tundma erinevat videotehnikat ning tarkvara. Sellele järgneb teoreetiline osa, millega paralleelselt on igapäevased ülesanded, mida vaatame ning tagasisidestame järgmises tunnis. Aine lõppeb ühe suurema video tootmisprotsessi läbimisega, mille avalik linastus ja eksam toimub semestri lõpus."}, "objectives": [{"en": "The aim of the course is to learn the main principles of a professional camera and editing as a tool for a specialist to create different mediums. While creating different mediums, we will thoroughly learn the preproduction process for creating film or video (idea, script, preparation, shooting, post-production).", "et": "Aine eesmärgiks on õppida tundma professionaalset kaamerat ja montaaži kui spetsialisti töövahendit erinevate vormide loomisel. Erinevate vormide loomisel õpib põhjalikult tundma filmi ja video eeltootmisprotsessi (idee, stsenaarium, ettevalmistus, võtteperiood, järeltöötlus)."}], "learning_outcomes": [{"en": "The student who has finished the course", "et": "Aine läbinu"}, {"en": "-is familiar with the principles of using a camera and its technical aspects", "et": "- on tuttav kaamera kasutamise põhimõtete ning tehniliste eripäradega"}, {"en": "- can use editing software for editing personal footage", "et": "- oskab kasutada montaažitarkvara enda filmitud materjali kokkulõikamiseks"}, {"en": "- has experienced the preproduction process for atleast two video formats", "et": "- on läbinud vähemalt kahe erineva videomeediumi eeltootmisprotsessi"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}