{"uuid": "a52e7e0c-c0b2-519d-cb9a-c8124a5deb70", "code": "HVVK.00.107", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-17T09:50:27", "title": {"en": "DAWs", "et": "Audioprogrammid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Introduce the history of synthesizers and different sound recording systems. Teaches to use analogue synthesizers. Introduces software-based synthesizers and samplers and gives a knowledge, how to use them. Teaches the possibilites for using MIDI technology and the conversion into scoring software to make proper scores and parts.", "et": "Annab teadmised süntesaatorite ja salvestussüsteemide ajaloost ning arengust. Tutvustab ja õpetab kasutama analoogsüntesaatori heli tekitamise printsiipi ja võimalusi. Annab ülevaate ja tutvustab tarkvaralisi süntesaatoried ja sämplereid ning näitab nende ühildumisvõimalusi. Annab teadmised ja oskused MIDI kasutamiseks erinevate seadmete programmide vahel. Õpetab MIDI informatsiooni konverteerimist noodistusprogrammi ning partiide väljaprintimist."}, "objectives": [{"en": "Aims of the subject:", "et": "Õppeaine eesmärgiks on: "}, {"en": "* introduce the history of synthesizers;", "et": "*\tAnda teadmised süntesaatorite ajaloo ja kasutuselevõtu kohta"}, {"en": "* give an overview of the different synthesizers;", "et": "*\tAnda ülevaade eri tüüpi süntesaatoritest"}, {"en": "* give an overview of the different sound editing programmes, their history, differences and possibilities;", "et": "*\tAnda ülevaade ja teadmised erinevate heliprogrammide ajaloo, iseärasute ja võimaluste kohta"}, {"en": "* learn, how to use analogue and digital and software-based synthesizers and samplers;", "et": "*\tÕpetada kasutama nii analoog kui digitaalseid ja tarkvaralisi süntesaatoreid ning sämplereid"}, {"en": "* introduce and learn MIDI technology;", "et": "*\tAnda ülevaade ja õpetada kasutama MIDI formaadi võimalusi"}, {"en": "* learn, how to connect MIDI technology with notation software programs.", "et": "*\tAnda oskused MIDI informatsiooni ühildamiseks notatsiooniprogrammidega"}], "learning_outcomes": [{"en": "By the end of the course students should:", "et": "Aine läbinud üliõpilane:"}, {"en": "* be able to explain the history and possibilities of the different sound editing programmes;", "et": "*\tOmab teadmisi ja arusaamist erinevate heliprogrammide ajaloost, tööpõhimõtetest ja erisustest ning võimalustest"}, {"en": "* knows different synthesizers and is able to connect them;", "et": "*\tTunneb erinevaid süntesaatoreid ja nende kasutamise ja ühildamise võimalusi"}, {"en": "* knows and can use MIDI systems and connect different software or hardware based equipment;", "et": "*\tTunneb ja oskab kasutada MIDI süsteeme ning ühildada tarkvaralisi ning raudvaralisi seadmeid"}, {"en": "* can program MIDI information and to set up different hardware based on MIDI technogoly;", "et": "*\tOskab programmeerida MIDI informatsiooni ning seadistada erinevat tüüpi MIDI-ühilduvad seadmed "}, {"en": " * knows, how to use sound generator on analogue synthesizers;", "et": "*\tTunneb ja oskab kasutada analoogsüntesaatori heligeneraatori võimalusi"}, {"en": "* knows different MIDI formats and can produce correct score from MIDI information.", "et": "*\tTuuneb MIDI formaate ning oskab MIDI informatsioonist luua tavakasutuse noodimaterjali"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}