{"uuid": "0c101302-56ec-c66a-864c-4b06d381f174", "code": "HVVK.00.070", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-25T14:23:46", "title": {"en": "Studio Project", "et": "Stuudioprojekt"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Studio Project is a practical course during which musical pieces are recorded in the studio, selection is made from the recorded material, the musical piece is edited and mixed. The student is the sound engineer, sound director, arranging artist and producer of the project to be recorded.", "et": "Õpetab kasutama helistuudio erinevaid seadmeid. Õpetab koostööd helitehniku, produtsendi/plaadifirma ja artisti vahel kõrgetasemelise salvestuse loomisel ja kujunemisel. Õpetab suhtlema, analüüsima ja andma kohest tagasisidet salvestavale muusikule või ansamblile. Tutvustab ja õpetab praktilist töökorraldust helistuudios - eelregistreerimine, päevaraamatu jms täitmine. Õpetab teostama suuremaid salvestusprotsesse."}, "objectives": [{"en": "Develop the students' skills, on the basis of their prior theoretical knowledge, to record groups performing a variety of music styles in the recording studio. Teach the student to communicate with musician or actor as producer. Give the practical skills for recording demanding projects.", "et": "Õppeaine eesmärgiks on: \n*\tAnda teadmised ja oskused helistuudio iseseisvaks kasutamiseks \n*\tÕpetada suhtlust ja erialaste terminite kasutamist helitehniku ja salvestatava persooni või ansambli vahel\n*\tAnda oskused ja kogemused õigete salvestusseadmete- ja tehnikate valikul\n*\tÕpetada kasutama helistuudio vahendeid suuremate koosseisude salvestamiseks"}], "learning_outcomes": [{"en": "Student having passed Studio Project:\nknows recording studio working operations, can use recording studio equipment,\nhas a practical skills to do recording process in studio incl. preproduction, recording, postproduction, mixing, studio communication.", "et": "Aine läbinud üliõpilane:\n*\tMõistab ja tunneb helistuudio töövõtteid ja meetodeid\n*\tTunneb ja oskab kasutada helistuudio tehnilisi võimalusi\n*\tOmab ülevaadet stuudiotöö erinevate protsesside ja salvestusetappide läbiviimisest\n*\tMõistab helitehniku rolli salvestusprotsessi läbiviimisel ning tunneb koostöö ja suhtlemise printsiipe\n*\tOskab salvestada akustilisi ja elektroonilisi instrumente sisaldavaid koosseise"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}