{"uuid": "c866953b-68e6-5f46-62d2-c39f101460df", "code": "HVVK.00.093", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-19T17:09:06", "title": {"en": "Project Life Cycle", "et": "Projekti elutsükkel"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the course, students learn the basics of project management. Students gain knowledge of how project goals and plans are linked to the project life cycle and how different methods and techniques are used to successfully carry out different phases. The subject includes topics such as goal definition, planning, project execution, evaluation of results and changes, and risk management in different phases of the project. Various project management software and tools are introduced. The subject finds a practical application in the subject of the master's project, which takes place in parallel, where the learned can be tested and applied immediately.", "et": "Õppeaine käigus õpivad õpilased projektijuhtimise põhitõdesid. Õpilased saavad teadmised sellest, kuidas projekti eesmärgid ja plaanid seotakse projekti elutsükliga ning kuidas erinevate faaside edukaks läbiviimiseks kasutatakse erinevaid meetodeid ja tehnikaid. Aine sisaldab teemasid nagu eesmärgi määratlemine, planeerimine, projekti läbiviimine, tulemuste hindamine ja muudatused, ning riskijuhtimine projekti erinevates faasides. Tutvustatakse  erinevaid projektijuhtimise tarkvarasid ja töövahendeid. Aine leiab praktilise rakenduse paralleelselt toimuvas magistrprojekti aines, kus saab õpitut kohesel ka testida ning rakendada."}, "objectives": [{"en": "The purpose of the subject is to provide an overview of the project management process and its various phases. In the course of the subject, student will learn to understand how project goals and plans are linked to the project life cycle and how different methods and techniques are used to successfully carry out different phases. What is learned in theory is put into practice when managing one's own creative project.", "et": "Aine eesmärk on anda ülevaade projektijuhtimise protsessist ja selle erinevatest faasidest. Õppeaine käigus õpitakse mõistma, kuidas projekti eesmärgid ja plaanid seotakse projekti elutsükliga ning kuidas erinevate faaside edukaks läbiviimiseks kasutatakse erinevaid meetodeid ja tehnikaid. Teoreetiliselt õpitut rakendatakse praktikasse oma loovprojekti juhtimise juures."}], "learning_outcomes": [{"en": "The student: *analyzes the different phases of the project and carries out activities related to them; *can define project goals and prepare a suitable plan for their implementation. *leads projects through various phases and knows the principles of risk management; *evaluates the effectiveness of projects and plans follow-up activities; *knows the most common project management software and digital tools.*is aware of the ethical issues associated with digital work.", "et": "Üliõpilane: *analüüsib projekti erinevaid faase ja viib ellu nendega seotud tegevusi; *oskab määratleda projekti eesmärgid ja koostab nende elluviimiseks sobiva plaani. *juhib projekte läbi erinevate faaside ning teab riskijuhtimise põhimõtteid; *hindab projektide tulemuslikkust ning kavandab jätkutegevusi; *tunneb enamlevinud projektijuhtimise tarkvarasid ning digitööriistu.*on teadlik digitööga kaasnevatest eetilistest küsimustest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}