{"uuid": "44db23ef-7f83-39f2-59de-09546b5a4171", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-11T09:36:45", "title": {"en": "Sculpture", "et": "Skulptuur"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode part 2 3 CP HV", "et": "24/25 K SÕ 2. osa 3 EAP HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Introduction of specifics and details of sculpting  (miniature sculpture, relief, figure, portrait, decorative and  monumental sculpture, sculpture in interiors and exteriors). Measurement and comparison techniques of the specialty, marking of  horisontal, vertical and diagonal axes,  hand-eye coordination. The construction and modelling of different three-dimensional shapes, reliefs, nature shapes, shapes of the human body, figures and portraits  in clay. The preparation and usage of hand tools, wire frame and other improvised tools.", "et": "Õpetatakse tundma skulptuuri spetsiifikat ja eriliike (pisiplastika, reljeef, figuur, portree, dekoratiiv ja monumentaalskulptuur, skulptuur interjööris ja eksterjööris). Õpetatakse erialale omast mõõtmise ja võrdlemise tehnikaid, horisontaal, vertikaal- ja diagonaaltelgede markeerimist, käte ja silmade töö koordineerimist. Õpetatakse konstrueerima ja modelleerima savist erinevaid kolmemõõtmelisi vorme, reljeefe, loodusvorme, inimkeha vorme, figuure, portreed.\nÕpetatakse valmistama ja kasutama voolimise tööriistu, traatkasrkassi, pöörlevat alust ja muid improviseeritud abivahendeid. Õpetatakse mastaabilt väiksemate, kuid keerulisemate vormide valmistamist modelleerimisvahast. Õpetatakse valmistama ja kasutama vahamodelleerimiseks ja -lõikamiseks vajalikke abivahendeid, puidust ja metallist stekasid, skalpelle, nõelu. Õpitakse tundma vahamodelleerimise spetsiifikat, erinevate vahasegude omadusi ja vahamodelleerimise tehnikaid. Kursuse raames õpitakse vahamudelite ettevalmistamist valamiseks, valuvormide tegemist ning erinevatest esemetest vormide ja jäljendite võtmise meetode."}, "objectives": [{"en": "To provide students with techniques for modelling and shaping plastic-volumetric clay, and skills and knowledge for using work tools.", "et": "Anda plastilis-mahulise savi modelleerimise ja konstrueerimise võtete ning töövahendite kasutamise oskusi ja teadmisi.\nTutvustada modellerimisvaha mahulise modelleerimise ja konstrueerimise võtteid ning arendada abivahendite kasutamise oskusi.\nÕpiväljundid"}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "Upon successful completion of the course, the students should: know   different kinds of sculpture ; be able to measure and compare, mark horisontal, vertical- and diagonal axes; have eye-hand co-ordination; be able to portray and shape different three-dimensional objects, reliefs, nature shapes, figures and the human body in clay; be  able to use sculpting tools, turn-table, wire frame, and improvised tools.", "et": "Aine edukal läbimisel üliõpilane teab skulptuuri eriliike; oskab mõõtmist ja võrdlemist, horisontaal-, vertikaal- ja diagonaaltelgede markeerimist; oskab silmade ja käte tööd koordineerida; oskab konstrueerida ja modelleerida savist erinevaid kolmemõõtmelisi vorme, reljeefe, loodusvorme, figuure, inimkeha; oskab kasutada voolimise tööriistu, pöörlevat alust, traatkarkassi ja improviseeritud abivahendeid.\nTunneb erinevaid vaha modelleerimise tehnikaid, vahasegude omadusi ja modelleerimise põhilisi abivahendeid; oskab reljeefide, figuuride, portreede, pisiplastika, etnograafiliste ehete ja esemete replikatsioonide modelleerimist; oskab reljeefset ja ümarplastilist skulptuurset vormi tajuda, modelleerida ja vormistada; oskab vahamudeleid valuks ette valmistada; tunneb valuvormide tegemise põhimõtteid ja erinevatest esemetest vormide ja jäljendite võtmise tehnikaid."}], "notes": {"et": "Hindest teatamise tähtaeg 30. juuni"}}, "grading": {"independent_work": {"et": "Tunnis alustatud tööde lõpetamine"}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Aine hindamise aluseks on õpiväljundites esitatud teadmiste ja oskuste omandamine. Hindamisele kuuluvad: etteantud ülesannete sooritamiste hulka ja kvaliteet, õppetööst osavõtmise aktiivsus, töökoha korrashoid ja töövahendite otstarbekas kasutamine, juhendaja poolt ettenäidatud töövõtete ja soovituste järgimine, loominguline suhtumine antud ülesannetesse, valminud tööde korrektne viimistlus ja eksponeerimine esitlusel.\n\nÜliõpilase õpiväljundite hindamine toimub kuuepallisüsteemis järgmiselt:\n\nA ehk \"suurepärane\"- ainekava mahust on omandatud 100%. Üliõpilane on tundides aktiivselt osalenud ja näidanud välja motiveeritud suhtumist. Kõik etteantud tööd on sooritatud ja tulemus silmapaistvalt hea. Üliõpilane suudab ka iseseisvalt töötada. Töövõtted on omandatud eeskujulikul tasemel. Valminud esemete tehniline teostus ja viimistlus on silmapaistvalt väga hea, terviklik ja laitmatu\n\nB ehk \"väga hea\"- ainekava mahust on omandatud 90%. Üliõpilane on tundides aktiivselt osalenud ja näidanud välja motiveeritud suhtumist. Kõik etteantud tööd on sooritatud ja kvaliteet korralik. Üliõpilane suudab ka iseseisvalt töötada. Töövõtted on omandatud väga heal tasemel. Valminud tööde tehniline teostus ja viimistlus on väga hea ja korrektne.\n\nC ehk \"hea\" - ainekava mahust on omandatud 80%. Üliõpilane on tundides osalenud ja näidanud välja huvitatust. Kõik etteantud tööd on sooritatud, kuigi töödes esineb tehnilisi või kompositsioonilisi vajakajäämisi. Üliõpilane oskab hästi kasutada tehnoloogia baasoskusi, kuid mõne töövõtte teostamisel esineb veidi ebatäpsusi ja küsitavust. Valminud tööde tehniline teostus ja viimistlus on hea ja üldjoontes korrektne.\n\nD ehk \"rahuldav\" - ainekava mahust on omandatud 70%. Üliõpilane on õppeprotsessis passiivne. Kõik etteantud tööd on sooritatud, kuid teostamise korrektsuses esineb ilmselgeid puudujääke. Üliõpilane oskab kasutada tehnoloogia baasoskusi, kuid töövõtete teostamisel esineb olulisi puudujääke ja küsitavusi. Valminud esemete tehniline teostus ja viimistlus on rahuldav.\n\nE ehk \"kasin\" - ainekava mahust on omandatud 60%. Üliõpilane on õppeprotsessis passiivne. Kõik etteantud tööd on sooritatud, Arusaamine töövõtetest on väga kesine. Tunneb minimaalselt ehtevalmistamise baasoskusi, töövõtete kasutuses esineb olulisi ebatäpsusi ja puudujääke. Esemete tehniline teostus ja viimistlus kasin ja ebakorrektne.\n\nF ehk \"puudulik\" - üliõpilane on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel või on puudunud veenva põhjuseta  rohkem kui 25 % praktikumidest."}}], "grade_preconditions": {"et": "Osalemine praktikumil\nParticipation in practical training"}, "grade_evaluation": {"et": "Osalemine praktikumil\nParticipation in practical training"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga\nUpon agreement with the lecturer"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Puuduvad", "recommended_materials": "Puuduvad"}, "participants": {"lecturers": [{"person_uuid": "ba5ef3df-09df-1a5f-91df-9dab905f39db", "person_name": "Indrek Jets", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "659534e8-978b-0bc9-b134-660f5be05309", "person_name": "Eilve Manglus", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": false}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Tutvumine valutöö mudelite valmistamise tehnoloogia ja vaenditega. Vahatöö vahendite valmistamine"}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Ümarplastilise pisiplastika modelleerimine"}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Valutööks ettevalmistumine"}}]}, "registration_info": {"audience": {"et": "PTM 2"}, "min_students": 2, "max_students": 12}, "confirmation_process": {"confirmation_uuid": "04c302f9-1f5b-7069-413d-45dd174088fb", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "b19f9968-cd50-bf07-e1dd-3ef98fd3fb13", "parent_code": "HVVK.01.201", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}