{"uuid": "3b95a8e7-79ac-35a0-418b-84bf2169e5fd", "code": "HVVK.01.152", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Photography in Native Crafts", "et": "Pärandtehnoloogia fotograafia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Introduction to photography. Exposure time. The logical sequence of exposure times. Aperture. The logical sequence of apertures. Depth of field. The relationship between light sensitivity and photographic parametres. Measuring light and compensating exposure. Exposure meters. Sharpening. Focus. Lenses. Maintenance of camera lenses. Deviations, distortions and correcting them using a computer program. Shutters and synchronisation time. Taking photos using a flash. Fast exposure times. Materials used in analogue photography - films, papers. Development and scanning.\nLight temperature, balancing the white. Filters and inserts. Different camera types. Computer-aided photo processing and archiving. Information carriers and external harddrives.\nRepetition. Listing of example photos. Practice.", "et": "Sissejuhatus fototehnoloogiasse. Säriaeg. Säriaegade loogiline jada. Ava. Avaarvude loogiline jada. Sügavusteravus. Valgustundlikkus ja fotograafiliste parameetrite omavaheline seotus. Valguse mõõtmine ja särituse kompenseerimine. Särimõõdikud. Teravustamine. Fokusseerimisrežiimid. Objektiivid. Objektiivide hooldamine. Aberratsioonid, objektiivide moonutuste korrigeerimine arvutis. Katikud ja sünkroonaeg. Välguga pildistamine. Ülikiired säriajad. Analoogfotograafia materjalid - filmid, paberid. Ilmutamine ja skänneerimine.\nValgustemperatuur, valge tasakaal. Filtrid ja vaherõngad. Erinevad kaamerate liigid. Foto töötlemine ja arhiveerimine arvutis. Andmekandjad ja välised kõvakettad.\nKordamine. Näidispiltide arutelu. Praktikumid."}, "objectives": [{"en": "To provide an overview of different methods of photography and basic knowledge in using photographic equipment", "et": "Anda ülevaade fotograafia meetoditest ning esmased teadmised ja oskused fotoaparatuuri kasutamiseks."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students should:", "et": "Õppeaine edukal läbimisel üliõpilane"}, {"en": "- know the terminology used in photography;", "et": "- tunneb fotograafiaalast terminoloogiat;"}, {"en": "- understand the technical aspects of photographic processes;", "et": "- mõistab fototehnilisi protsesse;"}, {"en": "- have an overview of photographic techniques and the equipment used;", "et": "- omab ülevaadet fotograafia tehnoloogiatest ja pildistamise seadmetest;"}, {"en": "- have an overview of the optical laws relating to photography ;", "et": "- omab ülevaadet pildistamisega seotud optilistest seaduspärasustest;"}, {"en": "- be able to achieve their photographic aims;", "et": "- oskab saavutada soovitud fotokujutise;"}, {"en": "- be able to independently use the more common types of camera.", "et": "- oskab iseseisvalt kasutada levinumat tüüpi fotoaparaate."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}