{"uuid": "308fe570-1c79-1932-2eb8-fd43835b81c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T18:15:17", "title": {"en": "History of Estonia 1700-1918", "et": "Eesti ajalugu 1700-1918"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The subject deals with the history of Estonia in the 18th-19th century. The subject examines the social, everyday, economic and cultural conditions of Estonia and examines the most important persons and events that influenced the development of Estonian history during the observed period.", "et": "Aine käsitleb Eesti ajalugu 18.-19. sajandil. Aines vaadeldakse Eesti ühiskondlikke-, olmelisi-, majanduslikke- ja kultuurilisi olusid ning tutvutakse olulisemate isikute ja sündmustega, mis mõjutasid Eesti ajaloo arengut vaadeldavalt perioodil."}, "objectives": [{"en": "The aim of the course is to introduce Estonian history in the 18th - 19th centuries through social, economic and historical circumstances.", "et": "Kursuse eesmärk on tutvustada Eesti ajalugu 18.-19. sajandil läbi sotsiaalsete, majanduslike ja ajalooliste olude."}], "learning_outcomes": [{"en": "Student who has completed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- has basic knowledge of the background of Estonian history 18-19. century", "et": "- omab põhiteadmisi Eesti ajaloo taustast 18.-19. sajandil"}, {"en": "- knows the historiography of Estonian history", "et": "- tunneb eesti ajaloo historiograafiat"}, {"en": "- knows the most important events, persons and dates in Estonian history", "et": "- teab Eesti ajaloo olulisemaid sündmuseid-, isikuid ja daatumeid"}, {"en": "- can characterize the development of Estonian history in the observed period", "et": "- oskab iseloomustada eesti ajaloo arengut vaadeldaval perioodil"}], "notes": {}}, "grading": {"independent_work": {"et": "Eesti ajaloo teemalise artikli või käsitluse retsensioon - teema lepitakse eenevalt õppejõuga kokku\n\nReview of an article or publication on Estonian history - the topic is agreed upon with the lecturer in advance"}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "A - suurepärasel tasemel a) teadmised eksamil käsitletavate teemade kohta ja b) ajalooliste seoste nägemine ja c) analüüs ning argumentatsioon, ei esine olulisi faktivigu\nB - väga heal tasemel a) teadmised eksamil käsitletavate teemade kohta ja b) ajalooliste seoste nägemine ja c) analüüs ning argumentatsioon, ei esine olulisi faktivigu\nC - heal tasemel a) teadmised eksamil käsitletavate teemade kohta ja b) ajalooliste seoste nägemine\nD - rahuldaval tasemel a) teadmised eksamil käsitletavate teemade kohta ja b) ajalooliste seoste nägemine\nE - minimaalselt piisaval tasemel a) teadmised eksamil käsitletavate teemade kohta ja b) ajalooliste seoste nägemine\nF - kohustusliku retsensiooni esitamata jätmine / ebapiisavad teadmised aines\n\nA -(a) knowledge of the subjects covered by the examination and (b) seeing historical connections and (c) analysis and argumentation, there are no material errors of fact\nB - very good a) knowledge of the topics covered in the exam and b) seeing historical connections and c) analysis and argumentation, there are no significant factual errors\nC - a good level of a) knowledge of the subjects covered by the examination and b) seeing historical connections\nD - a satisfactory level of (a) knowledge of the subjects covered by the examination; and (b) seeing historical connections\nE - at least a sufficient level of a) knowledge of the subjects covered by the examination and b) seeing historical connections\nF - failure to submit a mandatory review / insufficient knowledge of the subject"}}], "grade_preconditions": {"et": "Osalemine loengutes ja kohustusliku retsensiooni esitamine enne eksamit\n\nParticipation in lectures and submission of a mandatory review before the exam"}, "grade_evaluation": {}, "grade_conditions": {"A": {"et": "\"suurepärane\" - silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine"}, "B": {"et": "\"väga hea\" - õpiväljundite saavutamine väga heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused"}, "C": {"et": "\"hea\" - õpiväljundite saavutamine heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes avaldub ebakindlus ja ebatäpsus"}, "D": {"et": "\"rahuldav\" - õpiväljundite saavutamine piisaval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus"}, "E": {"et": "\"kasin\" - olulisemate õpiväljundite saavutamine minimaalselt lubataval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisil, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus"}, "F": {"et": "\"puudulik\" - õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel"}, "mi": {"et": "õppija pole ilmunud suulisele eksamile"}}, "debt_elimination": {"et": "Semestri jooksul kokkuleppel õppejõuga\n\nDuring the semester in agreement with the lecturer"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "5c5ce468-0a66-4303-bc2a-98d2bef0fbeb", "type": "MOODLE", "code": "HVVK.01.188_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Eesti ajalugu IV, Eesti ajalugu V, Eesti ajalugu VI"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "f6ee7f6b-e62c-35ea-95a5-00537f7f1619", "person_name": "Indrek Ikkonen", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. Sissejuhatus ainesse. Aine läbimise tingimused. Ülevaade historograafiast ja perioodi uurmisseisust.\n\n1. Introduction to the subject. Conditions for passing the substance. An overview of the history and research status of the period."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "2. Millised olud valitsesid Rootsi aja. Põhjasõda 1700- 1721.1710. aasta võimuvahetus. Vene ülemvõimu kehtestamine ja kapitulatsioonid.\nVõimukorraldus Eesti alal pärast 1710. aastat. Haldusjaotus. Riiklik võimuaparaat. Rüütelkondade omavalitsus. Linnad 18. sajandil. Asehalduskord. Muutused rüütelkondade ja linnade omavalitsuskorralduses. Uus halduskorraldus, politsei- ja kohtusüsteem\n\n2. What conditions prevailed in Swedish time. The Great Northern War 1700-1721.1710. change of power. Establishment of Russian supremacy and capitulations.\nOrganization of power in Estonia after 1710. Administrative division. State power apparatus. Self - government of knights. Cities in the 18th century. Deputy management procedure. Changes in the self - government of knights and cities. New administration, police and judiciary"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "3. Rahvastik 18. sajandil. Suur katk. Rahvaarvu muutumine, rahvastiku rahvuslik ja sotsiaalne koosseis. Asustuse põhijooned.\nMõis ja talu 18. sajandil. Mõisate liigitus. Talumajandus. Talurahva koormised\nTalurahva õiguslik olukord. Olukord eramõisates ja kroonumõisates. Roseni deklaratsioon 1739. Sunnismaisuse küsimus. 1765. aasta positiivsed määrused.\n\n3. Population in the 18th century. Great plague. Population change, national and social composition of the population. Main features of the settlement.\nManor and farm in the 18th century. Classification of manors. Agriculture. Peasants' burdens\nLegal situation of the peasantry. Situation in private manors and crown manors. Rosen Declaration 1739. The issue of coercion. Positive Regulations of 1765."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {"et": "4. Haridus- ja kultuurielu 18. sajandil ja 19. sajandi algul. Rahvaharidus. Õiguskorraldus. \nKubermangude valitsemine 19. sajandil. Kindralkuberner. Kubernerid ja kubermanguvalitsused. Kubermanguasutused. Linna- ja maaomavalitsus. Kohtuvõim. Politsei. Maksukorraldus\n19. sajandi algupoole agraarreformid. Reforme mõjutanud tegurid. 1802./1804. aasta talurahvaseadused. Pärisorjuse kaotamine (1816-19) ja talurahva uued õigused ning vabadused. \nRahvastik 19. sajandil. Demograafiliste muutuste põhijooned. Rahvaarvu ja rahvastiku koostise põhijooned. Rahvastiku loomulik liikumine. Kohalik ränne. Väljaränne\nSotsiaalne käärimine. Talurahva vastuhakud 1840. aastate algul. Usuvahetusliikumine\n\n4. Educational and cultural life in the 18th century and early 19th century. Public education. Organization of justice.\nGovernorate of the provinces in the 19th century. Governor General. Governors and Governorate Governments. Provincial authorities. City and county government. Judiciary. The police. Taxation\nAgrarian reforms in the early 19th century. Factors influencing reforms. 1802./1804. Peasants' Acts of. The abolition of serfdom (1816-19) and the new rights and freedoms of the peasantry.\nPopulation in the 19th century. Main features of demographic change. Main features of population and population composition. Natural movement of the population. Local migration. Emigration\nSocial fermentation. Peasant uprisings in the early 1840s. Religious conversion movement"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {"et": "5. Agraarküsimus 19. saj. keskpaiku. 1860. aastate reformid\nTalude päriseksostmine\nPõllumajanduse arengu põhijooned 19. saj. Teoorjuslik mõisamajandus. Mõisamajanduse ratsionaliseerimine. Arengusuunad 19. saj. lõpupoolel. Põllumajandusseltsid ja ühistegevus\nMuutused maaühiskonnas. Talude kruntimine. Maarahvastiku sotsiaalne koosseis. Murrang elu-olus. Vallakogukond.\n\n5. Agrarian issue of the 19th century. in the middle. Reforms of the 1860s\nPurchase of farms\nMain features of agricultural development in the 19th century. Manor economy. Rationalization of manor economy. Development directions of the 19th century towards the end. Agricultural associations and joint activities\nChanges in rural society. Priming of farms. Social composition of the rural population. A change in living conditions. Municipal community."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {}, "description": {"et": "6. Tööstus ja käsitöö. Tööstusliku pöörde algus. Tööstus 19. sajandi lõpupoolel. Käsitöö\nLinnastumine ja linnarahvastik. Linnade kasv. Maa-asulate kasv. Linnarahvastiku koosseisu muutumine\n\n6. Industry and crafts. The beginning of the industrial revolution. Industry in the late 19th century. Crafts.\nUrbanization and urban population. Urban growth. Growth of rural settlements. Changes in the composition of the urban population"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {}, "description": {"et": "7. Eelärkamisaeg. Estofiilid. Faehlmann ja Õpetatud Eesti Selts. Kreutzwald ja \"Kalevipoeg\". Rahvusliku ärkamise tingimused\nRahvuslik ärkamine. Jannsen ja \"Perno Postimees\". Rahvusliku liikumise keskused ja esimesed suurüritused. \"Eesti Postimees\" ja seltsid. Uus põlvkond. Esimene üldlaulupidu. Jakob Hurda kultuurirahvuslus. Jakobson ja \"Sakala\". Rahvusliku liikumise haripunkt. 1881. aasta suurmärgukiri. Lõhe rahvuslikus liikumises.\n\n7. Awakening time. Estophiles. Faehlmann and the Learned Estonian Society. Kreutzwald and \"Kalevipoeg\". Conditions for national awakening\nNational Awakening. Jannsen and \"Perno Postimees\". National movement centers and the first major events. \"Eesti Postimees\" and societies. The new generation. The first general song festival. Jakob Hurd's cultural nationality. Jakobson and \"Sakala\". The pinnacle of the national movement. Grand Memorandum of 1881. The gap in the national movement."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {}, "description": {"et": "8. Venestamisaeg. Venestamise motiivid ja algus. Haldusreformid. Kultuuriline venestamine. \nKool ja haridus. Alghariduskoolid. Õpetajad ja õpikud. Keskhariduskoolid. Tartu ülikool. Saksa ja eesti haritlaskond\nKirik ja religioon. Luteri usu kirik. Vennastekogudusliikumine. Usuvahetus. Kirik ja usuelu ärkamisajal. Eesti soost vaimulikud. Vaba rahvakiriku idee 19. sajandi lõpupoolel\n\n\n8. Russification time. Motives and beginning of Russification. Administrative reforms. Cultural Russification.\nSchool and education. Primary schools. Teachers and textbooks. Secondary schools. University of Tartu. German and Estonian intellectuals.\nChurch and religion. Lutheran Church. The fraternal movement. Conversion. Church and religious life in the awakening. Estonian clergy. The idea of a free folk church in the late 19th century"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {}, "description": {"et": "9. Ühiskondlikud olud 20. saj. alguses. Kultuuri- ja seltsielu. Majanduslik- ja poliitiline areng.\n\n9. Social conditions in the 20th century. at the beginning. Cultural and social life. Economic and political development."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 10, "topic": {}, "description": {"et": "10. Võtame kokku läbitud teemad. Küsimuste ring.\n\n10. Let's summarize the topics covered. Circle of questions."}}]}, "registration_info": {"audience": {"et": "KULO 1"}}, "confirmation_process": {"confirmation_uuid": "b3d02055-6485-40ac-2e89-ab338fe3c64b", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "a6fa3d11-8313-c936-ffc7-a7b34f932897", "parent_code": "HVVK.01.188", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}