{"uuid": "1f3dc56f-e4a3-4451-c7c4-8ff79af28c38", "code": "HVVK.01.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Specialty", "et": "Sissejuhatus erialasse"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Introduction to the study programme, professional information systems, craft unions and the professional standard of heritage technology. An overview of professional safety equipment. Introduction and signing of internal procedural rules. An overview of the possibilities of studying and practising abroad. Students who have chosen the specialty of metal work or construction undergo first aid training.", "et": "Tutvutakse pärandtehnoloogia õppekava, erialaste infosüsteemide, erialaorganisatsioonide ja kutsestandardiga. Antakse ülevaade erialasest ohutustehnikast, tutvustatakse ja allkirjastatakse sisekorra eeskirjad. Antakse ülevaade välisriikides õppimise ja praktiseerimise võimalustest. Metallitöö või ehituse spetsialiseerumissuuna valinud üliõpilased osalevad esmaabi koolitusel."}, "objectives": [{"en": "Introduction to the study program, order of studies, main information systems, and professional organizations of heritage technology. Learning about the possibilities of studying and practicing abroad. Support students to plan their studies and career. Basic knowledge of safety equipment and first aid principles related to the speciality of metal work or construction.", "et": "Tutvustada pärandtehnoloogia õppekava, õppetöö korraldust, olulisemaid infosüsteeme ning erialaorganisatsioone. Tutvustatakse välisriikides õppimise ja praktiseerimise võimalusi. Toetada üliõpilasi oma erialaste õpingute ja karjääritee kavandamisel. Metallitöö või ehituse eriala üliõpilastele anda ohutustehnika ja esmaabi alusteadmised."}], "learning_outcomes": [{"en": "Upon successful completion of the course the student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- is familiar with the objectives and structure of the heritage technology study program;", "et": "- tunneb pärandtehnoloogia õppekava eesmärke ja ülesehitust;"}, {"en": "- knows the structure and house rules of the academy and the Estonian Native Crafts Department;", "et": "- tunneb akadeemia ja rahvusliku käsitöö osakonna struktuuri ning kodukordi;"}, {"en": "- knows how to use the school information systems necessary for everyday studies;", "et": "- oskab kasutada igapäevaseks õppetööks vajalikke kooli infosüsteeme;"}, {"en": "- is familiar with the main craft unions, their goals, and work order;", "et": "- tunneb olulisemaid erialaorganisatsioone, nende eesmärke ja töökorraldust;"}, {"en": "- is familiar with professional standards;", "et": "- tunneb erialast kutsestandardit;"}, {"en": "- knows about opportunities to study and practice abroad; ", "et": "- on informeeritud välisriikides õppimise ja praktika võimalustest; "}, {"en": "- aims at his / her professional studies and career choices.", "et": "- mõtestab ja eesmärgistab oma erialaseid õpinguid ning karjäärivalikuid.  "}, {"en": "Students who have chosen the specialty of metal work or construction:", "et": "Metallitöö või ehituse spetsialiseerumissuuna valinud üliõpilane:"}, {"en": "- are familiar with appropriate professional safety equipment;", "et": "- tunneb erialast ohutustehnikat; "}, {"en": "- know how to give first aid.", "et": "- oskab osutada esmaabi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}