{"uuid": "91db0747-0003-aa23-3cbd-dba632712dfa", "code": "KKSB.05.117", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Physiotherapy", "et": "Sissejuhatus füsioteraapiasse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview of physiotherapy, its various fields, job opportunities, and the rehabilitation and health care system in Estonia. It offers initial information on the use of the International Classification of Functioning, Disability, and Health (ICF) and the work of professional organizations in the field in Estonia and around the world. As part of the course, various institutions providing physiotherapy services will be visited to gain a deeper understanding of the daily work of a physiotherapist. The course also covers current professional requirements (laws), data protection, and ethical principles related to the field.", "et": "Antakse ülevaade füsioteraapia olemusest, selle eri valdkondadest, töötamisvõimalustest ning rehabilitatsiooni- ja taastusravisüsteemist Eestis. Kursus annab esmase info Rahvusvahelise funktsioneerimisvõime, vaeguste ja tervise klassifikatsiooni (RFK) kasutamise ja eriala puudutavate kutseorganisatsioonide töö kohta Eestis ja mujal maailmas. Kursuse raames külastatakse erinevaid füsioteraapiat pakkuvaid asutusi, et saada sügavam arusaam füsioterapeudi igapäevatööst. Kursus annab ka ülevaate kehtivatest eriala puudutavatest nõuetest (seadustest), andmekaitse- ja eetikaprintsiipidest."}, "objectives": [{"en": "Provide an overview of physiotherapy, its various fields, employment opportunities, and the rehabilitation and health care system in Estonia. Familiarize with the International Classification of Functioning, Disability, and Health.", "et": "Anda ülevaade füsioteraapia olemusest, selle eri valdkondadest, töötamisvõimalustest ning rehabilitatsiooni- ja taastusravisüsteemist Eestis. Tutvuda Rahvusvahelise funktsioneerimisvõime, vaeguste ja tervise klassifikatsiooniga."}], "learning_outcomes": [{"en": "Student:", "et": "Üliõpilane:"}, {"en": "- Describes the essence of physiotherapy and rehabilitation system in Estonia.", "et": "- kirjeldab füsioteraapia ja rehabilitatsioonisüsteemi olemust Eestis."}, {"en": "- Knows and understands the ethical requirements and key principles related to personal data protection in physiotherapy, as well as comprehends the principles of protecting personal data within the framework of healthcare services.", "et": "- teab ja saab aru füsioteraapia valdkonnas kehtivatest eetikanõuetest ja olulisematest andmekaitsega seotud põhimõistetest ning mõistab isikuandmete kaitse põhimõtteid tervishoiuteenuste raames."}, {"en": "- Analyzes the necessity of teamwork in the rehabilitation system.", "et": "- analüüsib meeskonnatöö vajalikkust rehabilitatsioonisüsteemis."}, {"en": "- Describes the roles of different team members in the rehabilitation team.", "et": "- kirjeldab erinevate meeskonnaliikmete rolli rehabilitatsioonimeeskonnas."}, {"en": "- Knows the structure and basis of the International Classification of Functioning, Disability, and Health (ICF) used in the healthcare system.", "et": "- teab tervishoiuvaldkonnas kasutuses olevat Rahvusvahelise funktsioneerimisvõime, vaeguste ja tervise klassifikatsiooni (RFK) ülesehitust ja olemust."}, {"en": "- Is able to use databases for searching scientific physiotherapy literature, summarize articles, and present essential information to listeners.", "et": "- oskab otsida andmebaasidest erialast teaduskirjandust, teha artiklitest kokkuvõte ning esitada olulisem info kuulajatele."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}