{"uuid": "fcf7bbd5-42b7-b632-b4c7-86d868e70d09", "code": "KKSB.05.033", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Physiotherapy in Paediatrics I", "et": "Laste füsioteraapia I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "63c3c8cd-6d89-1af6-397b-2943e471e9e6", "code": "ARAN.01.028", "title": {"en": "Anatomy", "et": "Anatoomia"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-16T09:10:28"}, {"required": true, "uuid": "d049e574-9fe9-98c0-af02-5cc268eb4a28", "code": "KKSB.02.046", "title": {"en": "Physiology", "et": "Füsioloogia"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-16T10:25:39"}, {"required": true, "uuid": "5938dc28-d714-9d65-da97-afd49c5f96b9", "code": "ARNR.01.028", "title": {"en": "Principles of Neurology", "et": "Neuroloogia alused"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-28T12:16:49"}, {"required": true, "uuid": "ba28abb0-d9a5-1273-8a22-8b008e27385a", "code": "KKSB.05.027", "title": {"en": "Therapeutic Exercise", "et": "Terapeutiline harjutus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "e32bab7f-c681-9b7f-90e3-a2b0e79bb621", "code": "KKSB.05.028", "title": {"en": "Assessment in Physiotherapy", "et": "Füsioterapeutiline hindamine"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "During this course students will acquire theoretical knowledge and practical skills at the university and in real-life working environment to perform physiotherapeutic assessment and intervention for treatment and/or prevention of  most common illnesses and sensorimotor deficits, developmental and functional limitations in pediatric patients. Clinical practice is a part of this course, during which students will experience and analyse work in real-life working environment. Students self-reflect based on their experience in the working environment.", "et": "Aine käigus omandatakse teoreetilised teadmised ja praktilised oskused ülikoolis ja reaalses töökeskkonnas füsioterapeutilise hindamis- ja sekkumismeetodite läbiviimiseks imiku- ja lapseeas sagedamini esinevate haiguslike seisundite puhul. Käsitletakse tõenduspõhiseid füsioteraapia meetodeid lastel sagedamini esinevate sensomotoorsete defitsiitide ning arenguliste ja funktsionaalsete häirete ravis ning ennetuses. Toimub kliiniline praktika, mille käigus kogetakse ja analüüsitakse töömaailmas toimuvat. Üliõpilane teostab eneseanalüüsi töökeskkonnas kogetu põhjal."}, "objectives": [{"en": "The aim of the course is to provide students with theoretical knowledge and practical skills for evidence-based physiotherapeutic assessment and management of sensorimotor deficits, developmental disorders and functional limitations related to most common diseases in infancy and childhood. The course also includes practice in the real-life working environment, during which the student self-reflects on the experience and achievements obtained during the practice.", "et": "Aine õpetamise eesmärgiks on teoreetiliste teadmiste ja praktiliste oskuste andmine lastel sagedamini esinevate sensomotoorsete defitsiitide ning arengu- ja funktsioonihäirete tõendupõhiseks füsioterapeutiliseks hindamiseks ning käsitlemiseks. Selle saavutamiseks läbitakse  aine raames lisaks auditoorele õppetööle ka praktika reaalses töökeskkonnas. Praktika ajal teostab üliõpilane kogetu ja tehtu põhjal eneseanalüüsi, et hinnata praktikabaasis omandatud erialasi teadmisi ja oskusi ning praktikasoorituse tulemuslikkust."}], "learning_outcomes": [{"en": "Student:", "et": "Üliõpilane:"}, {"en": "- knows the principles of psycho-motor development and can detect abnormalities;", "et": "- teab lapse psühhomotoorse arengu printsiipe ja sagedaseimaid kõrvalekaldeid;"}, {"en": "- detects physiotherapeutic key problems in most common sensorimotor, developmental and functional disorders in children by analyzing the results of medical history and physiotherapeutic assessment; sets relevant therapy goals, composes a therapy plan to achieve these goals based on the needs of the patient. Chooses appropriate physiotherapeutic interventions, depending on the conditions and requirements of the practice base;", "et": "- tuvastab anamneesile ja füsioterapeutilise hindamise tulemustele tuginedes pediaatrilisel patsiendil sagedamini esinevate sensomotoorsete, arengu- ning funktsionaalsete häiretega kaasnevad füsioterapeutilised probleemid, püstitab teraapiaeesmärgid, koostab nende saavutamiseks patsiendi vajadustest lähtuva teraapiaplaani. Valib selle elluviimiseks sobivad teraapiavõtted, lähtudes samaaegselt praktikabaasi võimalustest ja nõuetest;"}, {"en": "- uses their theoretical knowledge while instructing a patient in the real-life working environment, carries out a full therapy session independently", "et": "- rakendab patsiendi juhendamisel teoreetilisi teadmisi praktilises tegevuses, viib reaalses töökeskkonnas iseseisvalt läbi teraapiatunni."}, {"en": "- sets up the room, the therapy session and the therapy plan according to the condition, age, diagnosis of the child;", "et": "- korrigeerib ja kohandab teraapiaruumi, -tunni ja -plaani sisu vastavalt lapse seisundile, vanusele, diagnoosile või muudele mõjuritele;"}, {"en": "- finds relevant scientific literature and independently analyses its scientific level, then uses the acquired knowledge in the real-life working environment;", "et": "- otsib iseseisvalt erialast teaduskirjandust ning analüüsib selle teaduslikku taset ja rakendab saadud teadmisi reaalses töökeskkonnas; "}, {"en": "- fills out a patient's report in the real-life working environment and analyses the therapy process and its progress;", "et": "- täidab iseseisvalt reaalses töökeskkonnas patsiendi füsioteraapia dokumentatsiooni ning analüüsib teraapiaprotsessi ja selle tulemuslikkust;"}, {"en": "- has acquired vocational working experience and can successfully work in a team;", "et": "- on omandanud erialase praktilise töökogemuse ning oskab töötada meeskonnas;"}, {"en": "- sets individual goals for practice in the real-life work environment and analyses achievement of these goals after practice; self-reflects on using the acquired theoretical knowledge in a practical setting and on getting new practical skills;", "et": "- püstitab praktikaks individuaalsed eesmärgid ning analüüsib nende saavutamist praktika käigus; teostab eneseanalüüsi mõtestades audtitoorsel õppetööl omandatud teoreetiliste teadmiste rakendamist reaalses töökeskonnas ning uute praktiliste oskuste omandamist;"}, {"en": "- acknowledges career opportunities in this specialty.", "et": "- mõtestab karjääri võimalusi antud füsioteraapia valdkonnas."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}