{"uuid": "c835221d-3d0b-0d21-3d9b-a93faa342e38", "code": "KKSB.01.034", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Physical Activity for Health", "et": "Tervislik liikumisharrastus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The aim of the course is to give the student the possibility to be physically active to promote health. The chosen discipline is free to choose. The course is fully web-based. During the course the student has to collect training/workout related data and to record them into the chosen web software. The data can be entered manually or using different smart devices (preferred). Additionally, the summaries about the workouts must be compiled. In Moodle the learning materials must be analysed and a written test must be done related to the impact of physical load and physical activity to human body.", "et": "Kursuse eesmärgiks on anda tudengile võimalus, olla kehaliselt aktiivne sellisel tasemel (keskmiselt 2,5-3 tundi nädalas), mis tagab positiivse efekti tervisele. Spordiala valik on vaba. Kursus on veebipõhine. Kursuse käigus peab tudeng koguma andmeid oma treeningute kohta (kokku 50 tunni ulatuses) ning salvestama need enda poolt valitud veebitarkvara  keskkonda. Treeningute andmeid võib keskkonda sisestada käsitsi või kasutades erinevaid nutiseadmeid. Lisaks tuleb treeningutest teha kokkuvõtted ning esitada need kursusel vastutavale õppejõule. Samuti tuleb kursuse raames läbitöötada Moodle keskkonnas etteantud materjalid ja sooritada kirjalik test, mis käsitleb kehalise aktiivsuse ja koormuse mõju inimese organismile."}, "objectives": [{"en": "The aim of the course is to acknowledge through practical movement (physical activity) the impact of physical exercises on human body and to analyse the workouts and self-condition using the appropriate software", "et": "Õppeaine eesmärgiks on läbi praktilise liigutustegevuse teadvustada kehaliste harjutuste mõju organismile ning õppida analüüsima treenininguid ning jälgima iseenda seisundit, kasutades selleks loodud tarkvara"}], "learning_outcomes": [{"en": "1) Has been physically active at the minimal level that has health promoting effect;", "et": "1) On olnud kehaliselt aktiivne minimaalsel tasemel, mis annab tervist toetava efekti; "}, {"en": "2) Knows how to use the software in order to monitor and analyse the workouts;", "et": "2) Oskab kasutada tarkvara oma liikumise jälgimiseks ja analüüsimiseks;"}, {"en": "3) Knows possibilities how to handle with limitations to be physically active.", "et": "3) Teab võimalusi toimetulekuks takistustega, mis segavad olemaks kehaliselt aktiivne."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}