{"uuid": "f96359f6-2c4e-2495-9bec-51b937abab04", "code": "KKSB.05.107", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Systemic Disorders and Geriatric Physiotherapy", "et": "Süsteemsete haiguste ja vanemaealiste füsioteraapia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course deals with the whole physiotherapy process (including assessment, possible therapeutic intervention, etc) of various conditions. The effects of aging changes, concomitant diseases and drug treatment on the implementation of the physiotherapy process are introduced. The role of the physiotherapist in the treatment of burns, osteoporosis, sexual dysfunction, amputation and other conditions is discussed.", "et": "Aines käsitletakse füsioteraapiaprotsessi (sh hindamine, võimalik terapeutiline sekkumine jms) erinevate seisundite korral. Kursusel tutvustatakse vananemismuutuste, kaasuvate haiguste ning medikamentoosse ravi mõju füsioteraapiaprotsessi läbiviimisele. Käsitletakse füsioterapeudi rolli põletuse, osteoporoosi, seksuaalse düsfunktsiooni, amputatsiooni jt seisundite käsitluses."}, "objectives": [{"en": "The aim of the course is to provide students with in-depth knowledge and practical skills in geriatric physiotherapy and physiotherapy of different conditions with systemic influence.", "et": "Aine õpetamise eesmärgiks on anda süvendatud teadmised ja praktilised oskused vanemaealiste patsientide ning erinevate süsteemsete haiguste tulemuslikuks füsioterapeutiliseks käsitluseks."}], "learning_outcomes": [{"en": "Upon passing the course, the student:", "et": "Aine läbimisel üliõpilane:"}, {"en": "1. Analyzes the effect of medical treatment of an elderly patient (including cancer treatment and complications) and co-morbidities on physiotherapeutic assessment and intervention", "et": "1. Analüüsib vanemaealise patsiendi medikamentoosse ravi (sh vähiravi ja vähiravi kompliktsioonide) ning kaasuvate haiguste mõju füsioterapeutilisele hindamisele sekkumisele"}, {"en": "2. Finds relevant information, analyzes both in oral and writen form its relevance and applicability in work with patients.", "et": "2. Leiab asjakohast erialast infot, analüüsib suuliselt ja kirjalikult info asjakohasust ning rakendatavust töös patsientidega "}, {"en": "3. Identifies the physiotherapeutic problems and documents them in professional terms and as presented with RFK codes and qualifiers. Analyzes strengths and weaknesses of a pre-written hysiotherapeutic documentation", "et": "3. Identifitseerib patsiendi füsioterapeutilised probleemid ning oskab neid dokumenteerida nii erialases sõnastuses kui ka RFK koodide ja määrajatega esitatult. Analüüsib varem koostatud erialase dokumentatsiooni puudujääke ning tugevusi."}, {"en": "4. Knows age-related anatomical and physiological changes affecting physiotherapy and describes their impact on the physiotherapy process.", "et": "4. Tunneb füsioteraapiat mõjutavaid erinevaid vananemisega kaasnevaid anatoomilisi ja füsioloogilisi muutusi ning kirjeldab, nende mõju füsioteraapia protsessile."}, {"en": "5. Knows the general principles of physiotherapeutic treatment for various conditions with a systemic effect (e.g. amputations, oncological conditions, obesity etc)", "et": "5. Teab füsioterapeutilise käsitluse üldisi printsiipe erinevate süsteemset mõju omavate seisundite (nt amputatsioonide, onkoloogiliste seisundite, rasvumise jt) korral"}, {"en": "6. Knows the principles of physiotherapeutic treatment of burns and scars.", "et": "6. Teab põletuste ning armide füsioterapeutilise käsitluse põhimõtteid"}, {"en": "7. Knows the principles of physiotherapy for sexual dysfunction and alleviating indigestion problems;", "et": "7. Tunneb füsioteraapia põhimõtteid seksuaalse düsfunktsiooni ja seedehäirete leevendamiseks;"}, {"en": "8.  Assesses  risk of falling and knows the principles of physiotherapy in the case of osteoporosis and traumatic fractures", "et": "8. Hindab kukkumisriski ja teab füsioteraapia põhimõtteid osteoporoosi ja traumaatiliste luumurdude korral."}, {"en": "9. Cooperates in a virtual environment;", "et": "9. Teeb koostööd virtuaalses keskkonnas;"}, {"en": "10. Knows the principles of physiotherapy in terminal and palliative care.", "et": "10. Teab ravi eripärasid palliatiiv- ja terminaalravil viibivate patsientidega."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}