{"uuid": "3fad352d-0f16-ec3b-de61-477c7f9598d2", "code": "KKSB.05.099", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Functional Movement Analysis", "et": "Põhiliikumise funktsionaalne analüüs"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides theoretical and practical knowledge about basic basic movement and the principles of assessment of movement. Students will know how to analyse basic movements and they will know how to apply functional anatomy and the principles of normal movement.", "et": "Kursus annab teoreetilised ja praktilised teadmised põhiliikumise aspektidest ning hindamise põhimõtetest."}, "objectives": [{"en": "The goal is to teach the student to analyse basic human movements and provide the student with the knowledge about different phases of the movement and the normal movement patterns required to peform basic movements.", "et": "Aine eesmärgiks on põhiliigutustegevuste ja liigutusmustrite analüüsioskus lähtudes liigutuste järjestusest, erinevatest tasapindadest ning normliigutuse printsiipidest."}], "learning_outcomes": [{"en": "Student:\n- understands the terminology used for describing human positions and movements.\n- knows the principles of functional anatomy and normal human movement.\n- evaluates human positions in different planes, distinguishing misalignement from normal alignment.\n-divides basic human movements (eg transfers, gait and grasping) into phases.\n- is able to describe main components of each phase and distinguish pathological movement patterns from the norm and is  able to document all of the beforementioned using correct professional language.\n- searches for scientific literature and is able to generalize different characteristics of the movement (mobility range required, muscle activation, phase division, etc.) both in oral and written form.", "et": "Üliõpilane:\n- mõistab asendite ja liigutuste kirjeldamisel kasutatatvat erialast terminoloogiat.\n- teab funktsionaalanatoomia ja inimese normliigutuse põhimõtteid.\n- hindab inimese (põhi)asendeid erinevates tasapindades, eristades patoloogilist teljelisust normist.\n- jaotab inimese põhiliikumise (nt siirdumised, kõnni- ja haaramisfunktsioon) faasilisteks komponentideks ja koostab põhiasendite ja põhiliikumiste kirjeldusi, osates eristada normliigutust patoloogiast, sealhulgas oskab eeltoodut dokumenteerida korrektses erialases keeles.\n- otsib teaduskirjandusest ning üldistab erinevat vastavale liigutustegevusele iseloomulikku (vajalik liikuvusulatus, lihasaktivatsioon, faasideks jaotumine jms), seda nii kirjalikult kui ka suuliselt."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}