{"uuid": "9b5f38ab-ff53-d2ef-545e-24ff21251070", "code": "KKSB.05.096", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Clinical Practice in Physiotherapy Master's Study", "et": "Füsioteraapia magistriõppe praktika"}, "credits": 18, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The practice in physiotherapy Masters`cufrricula at the University of Tartu (UT) helps to deepen theoretical knowledge and diversify professional skills and competencies (according to the requirements of Estonian professional qualification level VII of physiotherapists and the European Higher Education Network for Physiotherapy) through practical, comprehensive analysis. The Master's internship helps to develop scientific analysis and clinical reasoning skills in the field of physiotherapy.", "et": "Tartu Ülikooli (TÜ) füsioteraapia eriala magistriõppe praktika aitab süvendada teoreetilisi teadmisi ja mitmekesistada professionaalsed oskusi ning pädevusi (vastavalt füsioterapeudi kutsestandardi VII kutsekvalifikatsioonitaseme nõuetele ja Euroopa füsioteraapia-alase kõrghariduse võrgustiku pädevusloendile) läbi praktilise, mitmekülgselt analüüsitava kogemuse. Magistriõppe praktika aitab arendada füsioteraapia-alaste probleemide teaduslikku ning kliinilist analüüsioskust."}, "objectives": [{"en": "The aim of the subject is to deepen the knowledge and skills acquired in the subjects of the curriculum through practical activities, thereby helping the student to achieve the learning outcomes set by the educational institution. Latter is achieved by practicing as a physiotherapist in a real work environment. During the internship, the student performs self-reflection (including the analysis of physiotherapy-related and general competencies), develops skills of clinical reasoning through case studies and the preparation and analysis of physiotherapeutic documentation.", "et": "Aine eesmärgiks on läbi praktilise tegevuse kinnistada ja süvendada õppekava õppeainetes omandatud teadmisi ja oskusi, aidates seeläbi praktikandil saavutada õppeasutuse poolt seatud õpiväljundeid. Praktika ajal teostab üliõpilane enesereflektsiooni, sh analüüsides füsioteraapia-alaseid kui ka üldpädevusi, arendab kliinilise arutluse oskust läbi juhtumianalüüside ning füsioterapeutilise dokumentatsiooni koostamise."}], "learning_outcomes": [{"en": "Student:", "et": "Üliõpilane:"}, {"en": "- is able to plan working hours;", "et": "- oskab planeerida tööaega;"}, {"en": "- has professional practical work experience;", "et": "- omab erialast praktilise töökogemust;"}, {"en": "- can work in a team;", "et": "- oskab töötada meeskonnas;"}, {"en": "- is able to plan the entire physiotherapy process and constructively analyzes the specific aspects of the physiotherapy process;", "et": "- oskab planeerida kogu füsioteraapia protsessi ning analüüsib sellega seonduvat konstruktruktiivselt;"}, {"en": "- carries out evidence-based therapy for variety of patients independently;", "et": "- viib iseseisvalt läbi erinevate patsiendite teraapia, lähtuvalt tõenduspõhisusest;"}, {"en": "- compiles appropriate physiotherapeutic documentation and analyzes its strengths and weaknesses;", "et": "- koostab iseseisvalt nõuetekohase füsioterapeutilise dokumentatsiooni ning analüüsib selle tugevusi ning puudujääke;"}, {"en": "- evaluates and analyzes the level of one's professional and general competencies;", "et": "- hindab ja analüüsib oma erialaste ning üldpädevuste taset; "}, {"en": "- sets individual goals for practice based on compentence level;", "et": "- püstitab pädevuste tasemest lähtuvalt individuaalsed eesmärgid praktikaks; "}, {"en": "- evaluates the development of competencies during practice.", "et": "- hindab erialaste ja üldpädevuste arengut praktika käigus."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}