{"uuid": "3d5931d6-a7b7-f209-da02-0488545f0e90", "code": "KKSB.05.105", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Innovation and Technology in Physiotherapy", "et": "Areng ja tehnoloogia füsioteraapias"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course gives an overview of patient-centered interdisciplinary and safe physiotherapy service provision. The financing options of the healthcare system and rehabilitation service availability, as well as specifics of private practice, are discussed. Modern technological assistive and rehabilitation devices are introduced. During the course, the student's digital competence, teamwork and presentation skills are developed, including the ability to create and present new ideas.", "et": "Aine käigus antakse ülevaade patsiendikesksest interdistsiplinaarsest ja ohutust füsioteraapia teenuse pakkumisest. Arutletakse tervishoiusüsteemi rahastusvõimaluste ja teenuse kättesaadavuse kui ka erapraksise eripärade üle. Tutvutakse kaasaegsete tehnoloogiliste abi- ja rehabilitatsioonivahenditega. Arendatakse üliõpilase digipädevust, meeskonnatöö ja esinemisoskust, sh oskust luua uusi ideed ning neid tutvustada."}, "objectives": [{"en": "The aim of this course is to provide an overview of development possibilities in physiotherapy and rehabilitation, including technological methods, innovative and patient centered approaches and career opportunities.", "et": "Aine õpetamise eesmärk on anda ülevaade füsioteraapia, taastusravi ja rehabilitatsiooni valdkonna arenguvõimalustest, sh erinevatest tehnoloogilistest meetoditest, innovaatilistest ja patsiendikesksetest lähenemistest ning karjäärivõimalustest."}], "learning_outcomes": [{"en": "After this course the student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. determines whether the physiotherapy service offered by them is patient-centered and safe;", "et": "1. määratleb, kas tema poolt pakutav füsioteraapia teenus on patsiendikeskne ja ohutu;"}, {"en": "2. analyzes the influence of local and global factors on the physiotherapy service provided by them", "et": "2. analüüsib kohalike ja globaalsete tegurite mõju tema poolt pakutavale füsioteraapia teenusele"}, {"en": "3. knows general and professional healthcare system financing options;", "et": "3.  teab üldisi ja erialaseid tervishoiusüsteemi rahastusvõimalusi;"}, {"en": "4. has an overview of the availability of physiotherapy and rehabilitation services, and of telerehabilitation", "et": "4. omab ülevaadet taastusravi ja rehabilitatsiooni teenuste kättesaadavusest ja telerehabilitatsioonist"}, {"en": "5. understands various aspects of working in private practice, including digital solutions used in private practices", "et": "5. mõistab erapraksises töötamise erinevaid aspekte, sh teab erapraksises kasutatavaid digilahendusi"}, {"en": "6. is familiar with modern technological rehabilitation and assistive devices", "et": "6. on kursis kaasaegsete tehnoloogiliste rehabilitatsiooni- ja abivahendiga"}, {"en": "7. demonstrates innovativeness and can create new ideas", "et": "7. demonstreerib innovatiivsust ning oskab luua uusi ideid"}, {"en": "8. knows how to use digital tools and environments in both academic and professional work, including content creation", "et": "8. oskab kasutada digivahendeid ja keskkondi nii õppetöös kui ka erialases töös, sh sisuloomeks"}, {"en": "9. has teamwork skills and knows how to create strategic partnerships", "et": "9. omab meeskonnatöö oskust ning oskab luua strateegilisi partnerlusi"}, {"en": "10. considers career opportunities in the field of physiotherapy", "et": "10. mõtestab karjäärivõimalusi füsioteraapia valdkonnas"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}