{"uuid": "4c7e75e9-7cd0-6512-1d89-230361527772", "code": "KKSB.01.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Motor Learning and Development of Locomotory Apparatus", "et": "Liigutusõpetus ja liikumisaparaadi areng"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Knowledge of the pedagogical and psychological basics of acquiring and teaching of motor skills. Psychomotor abilities of schoolchildren, different teaching methods, age-related aspects of acquiring motor skills.\nSurvey of the dynamics of changes in the locomotory apparatus depending on age-related features and adaptation to functional activity.", "et": "Antakse teadmisi liigutusvilumuste omandamise pedagoogilistest ja psühholoogilistest alustest. Käsitlemist leiavad õpilaste psühhomotoorsed võimed ning erinevad õpetamise meetodid ning liigutusvilumuste omandamise ealised aspektid.\nKursus annab ülevaate liikumisaparaadis toimuvatest ealiste muutuste dünaamikast ning kohanemisest erineva iseloomuga funktsionaalsele aktiivsusele ealistest aspektist lähtudes."}, "objectives": [{"en": "The aim of the course is to give an overview of motor control and learning. During the study course, theoretical foundations of motor control and motor learning will be analyzed.And to handle the relations between functional activity and development of locomotory apparatus", "et": "Aine eesmärgiks on anda ülevaade liigutustegevuste juhtimise alustest ning liigutusvilumuste omandamisest. Kursuse käigus käsitletakse liigutuskontrolli aluseid, liigutuste juhtimise neuraalseid mehhanisme ning liigutusliku õppimise didaktikat. Aine eesmärk on käsitleda liikumisaparaadi arengulisi protsesse ja seosied kehalise aktiivsusega."}], "learning_outcomes": [{"en": "Knowledge related to theoretical basis and practical application of motor learning and motor control.", "et": "Üliõpilane omab ülevaadet liigutuste juhtimise ning liigutusvilumuste omandamise teoreetilistest alustest ja praktilistest rakendusvõimalustest."}, {"en": "Student can apply theoretical knowledge for the planning and applying motor learning process.", "et": "Üliöpilane oskab kasutada teoreetilisi teadmisi liigutusvilumuste õpetamisel."}, {"en": "Student is able to assess the process and stages of skill acquisition.", "et": "Üliõpilane oskab hinnata õpilaste arengut ja liigutusliku õppimise protsessi planeerida."}, {"en": "The student understand: 1) relations between functional activity and development of locomotory apparatus; 2) the dynamics of changes in locomotory apparatus depending on age-related features and adaptation to functional activity", "et": "Üliõpilane mõistab liikumisaparaadi arengulisi protsesse seostada kehalise aktiivsusega ja saab aru liikumisapraadis toimuvatest ealiste muutuste dünaamikast kohanemisel erineva iseloomuga kehalisele aktiivsusele"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}