{"uuid": "93715bce-0aed-64a6-6a44-b96d9acf546d", "code": "KKSP.05.316", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching Methods in Sport", "et": "Sportliku eriala õpetamise metoodika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Course provides knowledge and skills of teaching methods in chosen sport speciality field. The course gives overview of teaching physical abilities and physical training to conduct effective training process. Composing training plans in chosen sport speciality field are examined.", "et": "Aine annab teadmisi ja oskusi valitud valdkonna spordialade õpetamise metoodikast. Kursus annab põhjaliku ülevaate liigutustegevuste ja kehalise ettevalmistuse õpetamiseks efektiivse treeningprotsessi läbiviimiseks. Käsitletakse valitud valdkonna spordialade treeningplaanide koostamist."}, "objectives": [{"en": "Basic knowledge and skills of teaching methods in chosen sport speciality field. The course provide fundamental knowledge of teaching sports and conducting effective training process.", "et": "Baasteadmiste ja põhioskuste omandamine valitud valdkonna spordialade õpetamise metoodikast ning süvendatud teadmised spordialade õpetamiseks ja efektiivse treeningprotsessi läbiviimiseks."}], "learning_outcomes": [{"en": "After course student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1) has knowledge and practical skills of teaching  physical abilities in chosen sport speciality field;", "et": "1) omab teadmisi ja praktilisi oskusi valitud valdkonna spordialade liigutuslike tegevuste õpetamiseks;"}, {"en": "2) has knowledge and practical skills of teaching general and specific physical training in chosen sport speciality field;", "et": "2) omab teadmisi ja praktilisi oskusi valitud valdkonna spordialade kehalise ettevalmistuse õpetamiseks;"}, {"en": "3) has knowledge and practical skills of conducting effective process of training in chosen sport speciality field;", "et": "3) omab teadmisi ja praktilisi oskusi valitud valdkonna spordialade efektiivse treeningprotsessi läbiviimiseks;"}, {"en": "4) is capable to compose training plans in annual and perennial training process of chosen sport speciality field.", "et": "4) oskab koostada valitud valdkonna spordialade treeningplaane aastases ja mitmeaastases treeningus."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}