{"uuid": "20b3f335-656f-dc2b-2130-abe41e36b119", "code": "KKSP.05.314", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sport Speciality Course", "et": "Sportlik eriala"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Basic principles and skills of sport speciality field for organizing valid training process are introduced. The course teaches to understand chosen sport speciality field and its relationships with forming and developing of movement activity. The course gives overview of sport speciality field terminology and competition regulations and how these are related with the development of the sport disciplines.", "et": "Aines tutvustatakse erineva valdkonna spordialade baasteadmisi ja põhioskusi, mis on aluseks põhjendatud treeningprotsessi läbiviimiseks. Kursus õpetab mõistma valitud valdkonna spordialade spetsiifikat ning selle seoseid liigutustegevuse kujunemise ja arenguga. Kursus annab ülevaate spordialade terminoloogia ja võistlusmäärustiku kujunemisest ning nende seostest spordialade arenguga."}, "objectives": [{"en": "Basic knowledge and skills in chosen sport speciality field. The course provide related knowledge of teaching sports and organizing valid training process.", "et": "Baasteadmiste ja põhioskuste omandamine valitud valdkonna spordialadel ning seostatud teadmised spordialade õpetamiseks ja põhjendatud treeningprotsessi organiseerimiseks."}], "learning_outcomes": [{"en": "After course student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1) is capable to associate knowledge of the influence in chosen sport speciality field to physical abilities and physiological conditions of the body;", "et": "1) oskab seostada teadmisi valitud valdkonna spordialade liigutustegevuse mõjust kehaliste võimete arendamisele ja organismi füsioloogilisele seisundile;"}, {"en": "2) knows competition regulations and evaluation of chosen sport speciality field and understands the relationship between regulations and the development of the sport;", "et": "2) tunneb valitud valdkonna spordialade võistlusmäärusi ja hindamispõhimõtteid ning võistlusmääruste ja spordialade arengu vahelisi seoseid;"}, {"en": "3) knows the influence of biomechanics and development of regulations to chosen sport speciality field movement activity formation and growth;", "et": "3) tunneb biomehaanika seaduspärasuste ja võistlusmääruste arengu seostatud mõju valitud valdkonna spordialade liigutustegevuse kujunemisele ja arengule;"}, {"en": "4) knows movement activity classification and formation principles of terminology in chosen sport speciality field;", "et": "4) tunneb liigutustegevuse klassifitseerimise ja süstematiseerimise ning valitud valdkonna spordialade terminoloogia kujunemise põhimõtteid;"}, {"en": "5) is capable to demonstrate basic movement activities in chosen sport speciality field and understands the cinematic relationship between body position and movements.", "et": "5) oskab demonstreerida valitud valdkonna spordialade põhilisi liigutustegevusi ja mõistab kehaasendite ning liigutuste vahelisi kinemaatilisi seoseid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}