{"uuid": "b294bb94-24e0-9dea-3545-a2402fbeca84", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-03T13:29:48", "title": {"en": "Basic Practice for Physical Education Teacher", "et": "Liikumisõpetuse õpetaja põhipraktika"}, "credits": 7, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 7, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVSF", "name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "email": "kkdek@ut.ee", "phone": "+372 737 5360", "webpage_url": "https://sporditeadused.ut.ee", "address": "Ujula 4\n51008 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ujula 4", "zip": "51008", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "label": {"en": "25/26 S block mode part 2 7 CP MV", "et": "25/26 K SÕ 2. osa 7 EAP MV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVSF", "structural_unit_name": {"en": "Institute of Sport Sciences and Physiotherapy", "et": "sporditeaduste ja füsioteraapia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 2, "internship": 92}, "prerequisites": [{"required": true, "uuid": "d81996fd-94d2-1ed3-1be6-a19af62a5b21", "code": "KKSP.02.021", "title": {"en": "Sport Pedagogy", "et": "Spordipedagoogika"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-11T08:26:32"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Acquisition of practical experience necessary for working as a teacher of physical education  and health education. Work as a class teacher.", "et": "Omandatakse praktilisi töö kogemusi likumisõpetuse tunni andmisel. Tutvutakse ja osaletakse kooli spordialases töös."}, "objectives": [{"en": "The course has three main goals that should be achieved jointly with other courses of teacher training:", "et": "Õppeainel on kolm üldeesmärki, mille saavutamine on kavandatud koos õpetaja kutseõpingute teiste ainetega:"}, {"en": "1)\tto support student's improvement to be a physical education  teacher by creating opportunities to associate previously undergone theoretical studies with practical teacher's activities in an educational institution;", "et": "1)\ttoetada üliõpilase kujunemist liikumisõpetuse õpetajaks, luues võimalused eelnevalt läbitud teoreetiliste õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses;"}, {"en": "2)\tto create opportunities to explore the educational process as a whole and to acquire management skills in physical education;", "et": "2)\tluua võimalused õppe- ja kasvatusprotsessi kui terviku tundmaõppimiseks ning õppetöö korraldamise oskuste omandamiseks liikumisõpetuses;"}, {"en": "3)\tto enable to practice subject specific didactic principles.", "et": "3)\tvõimaldada ainedidaktiliste printsiipide praktiseerimist."}], "learning_outcomes": [{"en": "1)\tis able to plan, implement, analyze and evaluate  subject and education related activities in physical education;", "et": "1)\toskab planeerida, läbi viia, analüüsida ja hinnata liikumisõpetuse õppe- ja kasvatustöö alaseid tegevusi;"}, {"en": "2)\tis able to take into account students' speciality, prior knowledge, needs (including educational needs) and interests while planning teaching and supporting students;", "et": "2)\toskab õpet kavandades ja läbi viies ning õpilasi/lapsi toetades arvestada nende eripära, eelteadmiste, vajaduste (sh hariduslike erivajaduste) ning huvidega;"}, {"en": "3)\tis able to put into practice the main ideas of motivational theories while organizing teaching process and ensuring discipline;", "et": "3)\toskab rakendada motivatsiooniteooriate põhiseisukohti õppeprotsessi organiseerimise ja õppedistsipliini kindlustamisel;"}, {"en": "4)\tarranges teaching systematically, based on evidence and creatively, originating from national basic documents, speciality of the educational institution, level of education, subject and the needs and interests of students;", "et": "4)\tkavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja õppeaine eripärast ning õppijate vajadustest ja huvidest;"}, {"en": "5)\tintegrates successfully the knowledge, skills and attitudes acquired in different domain- and subject-courses.", "et": "5)\tintegreerib tulemuslikult erinevates valdkonna- ja ainedidaktika ainetes omandatud teadmisi, oskusi ja hoiakuid praktilises õpetamissituatsioonis."}], "notes": {"et": "Tartu Ülikooli õpetajakoolituse praktikate koostööpartnerite juurde suundumisel peab üliõpilane koostööpartneri nõudmisel tõendama, et on COVID-19 vaktsineerimiskuuri läbinud või haiguse läbi põdenud."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "E - Rakendab tunni ülesehituse osasid tunni andmisel ja lähtub tegevuste valikul tunni eesmärgist; oskab organiseerida õpilased tegevusse ohutult; kasutab erinevaid  õpetamise meetodeid; õpetab õpilastele õpiülesannet ja näitab harjutusi ette; oskab nimetada läbi viidud tunni kordaminekuid ja puudujääke.\nD - Seostab tunni osad ja nende tegevused üheks tervikuks; tegevused on valitud vastavalt tunni eesmärgile; kasutab organiseerimisel ja õpetamisel erinevaid meetodeid ja järgib ohutusnõudeid; õpetab ja näitab harjutusi ette, teeb ennast seejuures arusaadavaks ja paneb ennast kuulama; toob välja lahendusi puudujääkide parandamiseks arutelu käigus juhendajaga.\nC - Tunni osad ja sinna planeeritud tegevused on loogiliselt seotud ja vastavad tunni eesmärgile.; oskab organiseerimisel arvestada grupi suuruse, aja, harjutamiskohtade arvu, ala suuruse mõju õpitulemusele ja ohutusega. Valib üldiselt sobivad meetodid olenevalt eesmärgist, teemast ja õpilaste individuaalsetest iseärasustest. Õpetab õpiülesannet ja näitab harjutusi ette nii, et kõik õpilased näevad, kuulevad. Kasutab eneseanalüüsi tundide planeerimisel ja läbiviimisel.\nB - Esineb detailne sidusus tunni eesmärgi, tunni osade ja tegevuste  vahel.  Harjutamistingimuste loomisele ja tegevuse reorganiseerimisele kulutatakse minimaalselt aega. Järgitakse ohutusnõudeid. Oskab muuta planeeritud  õpetamismeetodit  vastavalt  olukorrale, arvestades seejuures õpilaste individuaalsete iseärasustega. Õpiülesande õpetamise ja ettenäitamise ning harjutamise tulemusel enamus õpilastest omandavad õpiülesande. Õpilased saavad tagasisidet oma sooritusele. Rakendab välja pakutud lahendused praktikas ja võrdleb tunde ja nende efektiivsust.\nA - Tunni osad on detailselt omavahel seostatud, järgitud on tunni kui terviku ja eriosade eesmärke ja valitud tegevused kannavad neid.  Tunni efektiivse organiseerimisega tagatakse maksimaalne õpilaste harjutamine ja ohutu õpikeskkond. Kohandutakse ja organiseerutakse kiiresti ümber vastavalt olukorrale. On õppeprotsessi läbiviimisel paindlik ja oskab maksimaalselt arvestada õpilaste individuaalseid iseärasusi. Õpilastele antud juhised on alati arusaadavad. Õpilased saavad tagasisidet oma sooritusele. Toob välja lahendused tunni efektiivsemaks muutmiseks, on analüüsinud juhendajaga oma tunde ja selle kaudu jõudnud lahendusteni, mis on taganud kvaliteetse kehalise kasvatuse tunni läbiviimise. Oskab võrrelda praktikaperioodi jooksul toimunud arengut."}}, {"work_type": {"code": "portfolio", "et": "Õpimapp", "en": "portfolio"}, "description": {"et": "Praktika 2. osa õpimapp peab koosnema (mitteeristav):\n1. Tunnikonspektid\n2. Enesenalüüsivormid\n3. Spordivõistluste ja -ürituste loetelu koos lühikirjelduse ja analüüsiga\n4. Juhendaja-õpetaja hinnang"}}], "grade_preconditions": {"et": "Praktika sooritamine vastavalt juhendile"}, "grade_evaluation": {"et": "Arvestatakse: a) juhendaja-õpetaja hinnangut; b) ülikooli poolse juhendaja hinnangut; c) õpimappi"}, "debt_elimination": {"et": "Kokkuleppel vastutava õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "4f2fda38-d91e-5d5d-2e57-035a4ba9de0f", "person_name": "Andre Koka", "structural_unit": {"code": "MVSF02", "name": {"en": "Department of Physical Education and Sport", "et": "kehalise kasvatuse ja spordididaktika osakond"}, "address": "EST", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "MVSF"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2025-01-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Praktika 2. osa sissejuhatav seminar"}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {"et": "Praktika toimub individuaalse tööplaani järgi Tartu Ülikooliga koostöölepingu sõlminud praktikaasutustes. Praktika toimub ajavahemikus jaanuar - märts."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Praktika 2. osa kokkuvõttev seminar (seminar toimub aprilli kuu õppesessioonil, aeg ja koht täpsustub)."}}]}, "registration_info": {"audience": {}, "max_students": 15}, "parent_uuid": "ccc8b376-3108-76ca-7eae-d1c993f241fd", "parent_code": "KKSP.02.047", "parent_credits": 11, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}