{"uuid": "112cb6e4-250d-05b5-3211-391776610caa", "code": "lt-2018-spring-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Physics and Engineering", "et": "Füüsika ja tehnika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "18/19 S regular LT", "et": "18/19 K PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is targeted to the quick and efficient introduction of the main principles of the current physics (matter and field, fermions and bosons, absolute speed, energy minimum, etc.), whereas the previous knowledge in physics is not required. In most important cases, the examples are illustrated considering the application of the mathematical methods in physics (differentiation, integration, complex numbers). The students also learn to explain the operating principles of selected technical devices applying physical terminology in a correct way.", "et": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse vastavalt vajadusele markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud), taotlemata käsitluse üldist matemaatilist rangust. Üliõpilased õpivad ka seletama valitud tehniliste seadmete tööpõhimõtet, kasutades korrektselt füüsika termineid."}, "objectives": [{"en": "The main goal of the course is to introduce the role of physics in the generation of the individual's personal concept of the world and to explain the fundamental physical principles of modern technologies.", "et": "Tutvustada füüsika rolli indiviidi isikliku maailmapildi kujundamisel ja kaasaegse tehnoloogia füüsikalisi alusprintsiipe."}], "learning_outcomes": [{"en": "Upon completion of this course, the student should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Express the basic principles of the physical concept of the world (such as atomistic principle, energetic minimum, absolute speed, wave-particle dualism, uncertainty principle), and refer to their exertion;", "et": "1. Oskab väljendada füüsikalise maailmapildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;"}, {"en": "2. Use the vocabulary introduced at the lectures to explain the basic principles of some high-tech devices applying physical terminology in a correct way;", "et": "2. Oskab loengute kavas toodud mahus selgitada valitud kõrgtehnoloogiliste seadmete tööpõhimõtet, kasutades korrektselt füüsika termineid;"}, {"en": "3. Possess the knowledge considering the mathematical background and calculus necessary for the description of physical processes (e.g., graphical representations, differentiation and integration, application of complex numbers), and recognize the main attributes and occurrence conditions of main functions present in physics (e.g., linear, power, exponent, harmonic);", "et": "3. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);"}, {"en": "4. Calculate the current values in the different parts of AC and DC circuits, the voltage values on the certain components of these circuits and the power values generated in those components; draw the phasors of the AC circuits with the given parameters;", "et": "4. Oskab arvutada voolutugevusi hargnevate alalis- ja vahelduvvooluahelate eri osades, arvutada pingeid nende ahelate konkreetsetel komponentidel ja neis komponentides eralduvaid võimsusi; oskab joonistada etteantud parameetritega vahelduvvooluahela faasor-diagrammi;"}, {"en": "5. Know the basic definitions belonging to the modern physical and technological concept of the world within the limits of the vocabulary (30 pages of A4 format) available on the web page of the course;", "et": "5. Tunneb kaasaegse füüsikalis-tehnoloogilise maailmapildi põhimõisteid aineveebis toodud põhivaraga (30 A4 lehekülge) määratletud tasemel;"}, {"en": "6. Solve the physical problems within the limits of example exercises available via the web support of the course.", "et": "6. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Nelja kontrolltöö positiivne sooritus"}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Kirjalik eksam. Eksami suulist osa võivad taotleda üliõpilased, kes kirjalikes kontrollivormides on kogunud üle 70% punktidest."}}], "min_points_from_tests": 35, "grade_preconditions": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest. Kuni 30% annab eksamitöö. Eksamile lubatakse kõik, kes on kogunud kontrolltöödega üle 35% punktidest (pool või enam kontrolltööde eest saadavast 70%-st). Kõigi kontrolltööde positiivne sooritus (vähemasti poolte võimalike punktide saamine iga töö eest) eksamile pääsemiseks veel vajalik ei ole, kuid see on nõutav lõpptulemuse saamisel. Esimene kontrolltöö mõõdab väljundi 1 saavutatust ja kolm viimast kontrollivad väljundi 6 olemasolu. Eksamitöös on eraldi nõutavad väljundite 2, 3, 4 ja 5 saavutatust kontrollivate ülesannete positiivsed sooritused. Eksami täiendavat osa võivad taotleda üliõpilased, kes kirjalikes kontrollivormides on kogunud üle 70% punktidest. Eksami tehnikaülesanne (teist õpiväljundit kontrolliv ülesanne) on võimalik sooritada enne eksami toimumist referaadi koostamise teel. Referaat tuleb esitada kõige hiljemalt 7. juuniks. Pärast seda kuupäeva on üliõpilasel võimalik teise õpiväljundi saavutatust demonstreerida vaid eksami tehnikaülesande sooritamise teel. Mistahes kirjaliku kontrollivormi sooritamisel on lubatud kasutada ise valmistatud valemite lehte, mis tohib sisaldada ainult valemeid, mitte seletavaid sõnu ega jooniseid. Nõutav on selline materjalis orienteerumise oskus, mis võimaldab vajalikku valemit ilma lisaselgitusteta ära tunda. Peast tuleb teada valemites sisalduvate märkide tähendust, mitte valemeid endid."}, "grade_evaluation": {"et": "4 positiivselt sooritatud kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest. Kuni 30% annab eksamitöö."}, "debt_elimination": {"et": "Mistahes kontrolltöö tegemiseks on enne eksamit kaks võimalust, sõltumatult soorituskatse toimumise ajast. Positiivse lõpphinde saamine eeldab väljundite 2, 3, 4 ja 5 saavutatust kontrollivate ülesannete (kõigi!) positiivseid sooritusi eksamitöös ja kõigi nelja kontrolltöö positiivseid sooritusi. Korduseksamil võib piirduda vaid nende ülesannete tegemisega, mille osas eelmise eksami tulemus oli negatiivne. Eksami kõigi väljundite osas positiivselt sooritanud üliõpilased saavad ühekordse lisavõimaluse seni negatiivse tulemusega kontrolltööde kordussoorituseks. Kogu teadmiste kontrolli protseduur lõpeb enne järgmise semestri algust ja mingi väljundi osas ikka veel negatiivse tulemusega üliõpilased saavad puuduliku lõpphinde. Nad on oodatud aines osalema selle järgmisel toimumisel."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/fjt/", "is_moodle_connected": false, "mandatory_materials": "1. I.Peil, K.Tarkpea. Füüsikalise looduskäsitluse alused. Kirjastus Maurus ja EFS, 2014. \n2. Veebi <a href=\"https://sisu.ut.ee/fjt/\">https://sisu.ut.ee/fjt/</a> linkidest avanevad allikad.", "recommended_materials": "1. Madis Reemann. Energia. Kirjastus Maurus ja EFS, 2014.\n2. Robert H. March. Füüsika võlu (Physics for Poets). Ilmamaa, 2000. \n3. D. Halliday, R. Resnick, J. Walker. Füüsika põhikursus. 8. väljaande (Wiley, 2008) tõlge eesti keelde, kahes köites. Eesti Füüsika Selts (EFS), 2011, 2012."}, "participants": {"lecturers": [{"person_uuid": "6b898bfb-c911-e064-07a8-4572a9a0ea6f", "person_name": "Agu Anijalg", "structural_unit": {"code": "LTFY03KS", "name": {"en": "Laboratory of Physical Optics", "et": "füüsikalise optika labor"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY03", "is_expired": true}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"informaatika 1": {"code": "1", "et": "Lektor", "en": "lecturer"}, "arvutitehnika 1": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "c2cc339d-636c-f784-9b0a-f2a35d52ce7f", "code": "informaatika 1"}, {"uuid": "a844849a-8ba2-bcf2-7321-bc5f95c9295e", "code": "arvutitehnika 1"}]}, "schedule": {"weeks": {"et": "24.-27.n. 4L n-s; 28.-39.n. 4L, 2S n-s, 4 knt => E"}, "entries": [{"time": "2019-02-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>1. Sissejuhatus. </B> Aine läbimise tingimused. Füüsika loodus- ja täppisteadusena. Loodus ja vaatleja. Vaatleja tunnused: tahe, aisting, mälu ja mõistus. Süllogism. Loodusteaduslik meetod (probleem-hüpotees-kontroll-järeldus). Eksperiment ja teooria. Induktsioon ja deduktsioon. Mudelid füüsikas, seaduspärasused ja seadused. Mõõtmine ja mõõtühikud."}}, {"time": "2019-02-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>2. Füüsika üldmudelid. </B> Füüsika keel, selles kasutatavad lühendid. Füüsikalised suurused. Skalaarid ja vektorid. Füüsika seos matemaatikaga. Astme-, eksponent- ja harmooniline funktsioon. Keha suurus, asukoht, asend ja kuju. Liikumisvormid: translatsioon, rotatsioon, deformatsioon, ostsillatsioon. Vastastikmõjud, aine ja väli, laeng ja spinn. Newtoni seadused. Jõud, mass ja impulss. Töö, energia ja võimsus. Kasutegur."}}, {"time": "2019-03-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>3. Füüsika üldprintsiibid. </B> Atomistika ja energia minimiseerumine. Tõrjutusprintsiip, absoluutkiiruse printsiip, dualismiprintsiip, lõtkuprintsiip. Põhivastastikmõjud. Alusosakesed. Standardmudel. Fermionid ja bosonid. Leptonid ja kvargid. Füüsikalise maailmapildi arengufaasid."}}, {"time": "2019-03-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>4. Mehaanika. </B> Koordinaadid. Taustsüsteem. Liikumisvõrrandid. Diferentseerimine ja integreerimine. Graafilised meetodid liikumise kirjeldamiseks. Kesktõmbekiirendus ja tsentrifugaaljõud. Jõumoment, inertsimoment, impulsimoment. Impulsi, impulsimomendi ja energia jäävus. Elastsusjõud. Elastsusmoodul ja nihkemoodul. Hõõrdejõud ja hõõrdetegur. Triboloogia. Keskkonna takistusjõud."}}, {"time": "2019-04-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>5. Võnkumised ja lained. </B> Perioodilised liikumised. Tasakaaluasend. Hälve, amplituud ja faas. Lained looduses. Lainefunktsioon. Lainete intensiivsus. Piki- ja ristlained. Interferents ja difraktsioon. Heli valjus, kõrgus ja tämber. Füüsikaliste suuruste mõõtmine detsibellides. Seisulained ja kvantarvud. Võnkumiste liitumine, harmooniline analüüs. Sumbuv võnkumine, sundvõnkumine ja isevõnkumine.  Võnkumiste diferentsiaalvõrrand ja selle lahendamine harmoonilise, sumbuva ning sundvõnkumise korral. Eksponentfunktsioon füüsikas. Sumbetegur ja ajategur. Kompleksmeetod võnkumiste kirjeldamiseks."}}, {"time": "2019-04-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>6. Elektromagnetismi teooria. </B> Elektrilaeng ja voolutugevus. Elektrostaatiline väli. Ampere'i seadus ja magnetväli. Väljatugevused E ja B. Potentsiaal ja pinge. Väljavektori voog. Elektromagnetiline induktsioon. Väljavektori tsirkulatsioon. Elektromotoorjõud. Maxwelli võrrandid (induktsiooniseadus, magnetvälja pööriselisus, koguvooluseadus, Gaussi teoreem). Elektrivool ja selle mehaanilised mudelid. Keha takistus, aine eritakistus. Mahtuvus ja induktiivsus."}}, {"time": "2019-05-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Mikromaailma füüsika. </B> Elektromagnetlainete tekkimine. Elektromagnetlainete skaala. Spektraalparameetrid. Aatomimudelid. Elektroni leiulained. Valguse kiirgumine ja neeldumine Bohri aatomimudeli kohaselt. Spektraalseeriad. Kaasaegne aatomimudel. Orbitaalid, kvantarvud ja valikureeglid. Molekuli dipoolmoment ja magnetmoment. Aatom, tuum, nukleon ja kvark. Tahkiste tsooniteooria alused. Juhid, mittejuhid ja pooljuhid. Pooljuhi oma- ja lisandjuhtivus, pn-siire. Tuumareaktsioonid. Tuumakiirgused ja nende toime. Tuumatehnoloogia alused."}}, {"time": "2019-05-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>8. Optika ja kvantmehaanika. </B> Valguse teke, levik ja neeldumine. Valguse peegeldumine ja murdumine. Aine optiliste omaduste tulenevus elektrilistest. Valguse interferents, difraktsioon ja polarisatsioon. Valguse vastastikmõju ainega. Fotoefekt. Soojuskiirgus ja luminestsents. Laseri tööpõhimõte, laserite kasutamine tehnikas. Kvantmehaanika alused. Määramatuse seosed. Lainefunktsioon kvantmehaanikas, Schrödingeri võrrand. Kvantarvuti ja kvantkrüptograafia alused."}}, {"time": "2019-05-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>9. Elektromagnetismi rakendused. </B> Kehade süsteemi mahtuvus ja induktiivsus. Vahelduvvool. Aktiiv- induktiiv- ja mahtuvustakistus. Vahelduvvooluahela faasorid ja faasinihked suuruste vahel. Elektriahelad ja magnetahelad. Elektrimootorid, generaatorid ja trafod. Elektromagnetilised info salvestamise ja edastamise süsteemid."}}, {"time": "2019-05-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>10. Molekulaarfüüsika ja termodünaamika. </B> Temperatuur ja soojus. Aine agregaatolekud ja siirded nende vahel. Molekulaarjõud. Termodünaamilised mikro- ja makroparameetrid. Termodünaamika printsiibid. Soojusmasinad."}}, {"time": "2019-03-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Seminarides </B> (24 h) vastab õppejõud mistahes ainessepuutuvatele küsimustele ja harjutatakse probleemide lahendamist. Tehakse 4 kontrolltööd, mis kontrollivad teadmisi:\n1. Teemade 1-3 osas (üldine füüsikaline maailmapilt) - esmakordselt 26.03;\n2. Teemade 4 ja 5 osas (mehaanika, võnkumised ja lained) - esmakordselt 16.04;\n3. Teema 6 osas (elektromagnetism, alalisvoolu seadused) - esmakordselt 07.05;\n4. Teemade 7-8 osas (mikromaailma füüsika, optika, kvantmehaanika) - esmakordselt 21.05."}}]}, "registration_info": {"audience": {"et": "arvutitehnika ja informaatika erialade kohustuslik aine"}, "min_students": 5}, "parent_uuid": "d9c042dc-c235-4ed6-9c9a-9ba4e3ba4056", "parent_code": "LOFY.01.121", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}