{"uuid": "e00ce68d-2829-86cd-2891-ed745de03ae9", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-16T14:25:28", "title": {"en": "Laser Physics", "et": "Laserite füüsika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "24/25 A regular LT", "et": "24/25 S PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "69de5d1a-9e16-46ec-cd4b-4857df95e3e1", "code": "LOFY.01.008", "title": {"en": "Optics", "et": "Optika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The principle of laser operation and related parameters (like gain, lasing threshold, saturation intensity)  are illustrated by the analysis of  mathematical models (for example a four-level system). Gaussian beam as a base model of a laser beam is treated in detail. The generation of an ultrashort (pico- and femtosecond)  pulse train by mode locking and the generation of high-energy pulses by Q-switching  as well as nonlinear conversion of  laser radiation (second harmonic generation, optical parametric amplification) is also covered. A variety of laser types are reviewed, by introducing  their design and operating parameters. The subject is intended mostly for the master students specializing in applied physics and fundamental physics.", "et": "Matemaatiliste mudelite (näiteks neljanivooline süsteem) analüüsi teel selgitatalse laseri tööp­himõtet ja sellega seotud parameetreid (nagu võimendus,  genereerimise lävi, küllastusintensiivus). Detailselt käsitletakse Gaussi kimpu kui laserikiire baasmudelit. Käsitletakse ka ülilühikeste (piko- ja femtosekund) impulsside jada saamist  moodlukustuse abil ja suure energiaga impulsside saamist Q-lukustuse abil ning laseri kiirguse mittelineaarset muundamist (kahekordistamine, optiline parameetriline generatsioon). Antakse ülevaade mitmeterest erinevatest laseritüüpe tutvustades nende ehitust ja tööparameetreid. Õppeaine on  mõeldud peamiselt  rakendusfüüsika ja fundamentaalfüüsika suuna magistrantidele."}, "objectives": [{"en": "To understand the physics, describing the operation and the control of a laser and the properties of a laser beam. ", "et": "Mõista füüsikat, mis kirjeldab laseri töötamist, laseri juhtimist ning laseri kiire omadusi. "}, {"en": "To get an idea about a diversity of  laser designs and about a wide variety of laser applications.", "et": "Saada ettekujutus laserite tehnilise realisatsiooni ning rakendusvõimaluste mitmekesisusest."}, {"en": "To comprehend laser-related and laser-application-related issues and to cope with them more efficiently.", "et": "Üldiselt: paremini orienteeruda ning hakkama saada laseritega ja nende rakendustega seotud küsimustes."}], "learning_outcomes": [{"en": "A student who pass the course will", "et": "Kursust läbinud üliõpilane"}, {"en": "know  the design, the operating principle, the order of output parameters, and the possibilities for application of the most important types of laser and is able to search for additional information,", "et": "teab olulisemate laseritüüpide konstruktsiooni, tööpõhimõtet, väljundparameetrite suurusjärku ja rakendusvõimalusi ning oskab otsida täiendavat infot,"}, {"en": "know the basic terms, concepts and principles of laser physics and is able to formulate and  explain them,", "et": "teab laserite füüsika põhilisi termineid, mõisteid ja printsiipe ning oskab neid sõnastada ja selgitada,"}, {"en": "understand mathematical models describing various aspects of laser functioning and the properties of laser light and is able to solve simpler problems of laser physics.", "et": "saab aru laseri töötamise erinevaid aspekte ning laserivalguse omadusi kirjeldavatest matemaatilistest mudelitest ja oskab lahendada lihtsamaid laserite füüsika ülesandeid."}], "notes": {"et": "<B>Ainet loetakse üle aasta!</B>"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Ülesannete lahendamine (kuni 30% lõpphindest)"}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Eksami lõpphinne moodustub ülesannete lahendamise ja suulise eksami hindest."}}], "grade_preconditions": {"et": "Eksamile saamiseks tuleb esitada loengutel antud ülesannete lahendused."}, "grade_evaluation": {"et": "Igal loengul antakse paar ülesannet koduseks lahendamiseks. Eksami lõpphinne moodustub ülesannete lahendamise (kaal 30 %) ja eksami hindest. Eksam on suuline, kasutada saab loenguga kaasnevaid abimaterjale. Põhirõhk on põhiseoste analüüsil ja nende rakendamisel konkreetsete laseritüüpide puhul."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne semestri lõppu."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a4d97c1a-b5c0-458a-b0ce-147dd19faa9e", "type": "MOODLE", "code": "LOFY.01.033", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Loengumaterjalid ja ülesanded: aine kodulehel klõpsa viitele \"Kursuse failid\", klõpsa loengu kaustale, allalaadimiseks klõpsa failile.\n (https://moodle.ut.ee/enrol/index.php?id=6465)\nPõhiline õpperaamat:  P. W. Milonni, J. H. Eberly, Laser Physics, Wiley, 2010", "recommended_materials": "Kirjanduse saab õppejõult e-raamatutena."}, "participants": {"lecturers": [{"person_uuid": "c68ef446-cd63-e66a-caa2-9d733530e500", "person_name": "Erko Jalviste", "structural_unit": {"code": "LTFY05SK", "name": {"en": "Laboratory of Biophysics", "et": "biofüüsika labor"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY05", "is_expired": true}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1. - 8. nädal,  4 loengut nädalas   => Eksam "}, "entries": [{"time": "2022-08-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Laseri põhikomponendid, ajaloost, laserfüüsika seos teise füüsika harudega, arengutendentsid, laserifüüsika põhimõisted: tasakaaluline asustatus, inversioon, nõrga signaali võimendus, küllastus, lävi,  2-nivooline skeem 3-nivooline skeem, 4-nivooline skeem, näiteid laserite kohta."}}, {"time": "2022-09-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Musta keha kiirguse spektraalne ruumtihedus, Plancki valem, Einsteini koefitsiendid, kiirgusega tasakaalus kahenivooline süsteem, spektrijoone lõpliku laiuse arvestamine kujuteguriga, neeldumise ja stimuleeritud kiirguse ristlõige, homogeenne ja mittehomogeene laienemine"}}, {"time": "2022-09-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Normeeritud Gaussi, Lorentzi kontuur, Voigti kontuur, T1 ja T2 relaksatsiooni ajad, Doppleri laienemine, põrkelaienemine, laienemise rõhusõltuvus, võimenduse spektraallaius, 2-nivoolise süsteemi neeldumise küllastumine, küllastusintensiivsus, võimenduse küllastumine 4-nivoolises süsteemis, nõrga signaali võimendus, võimenduse küllastumine impulssvõimendis, küllastusenergia, Franz-Nodwick'i võrrand, küllasumine mittehomogeense laienemise korral, ruumiline augu põletamine"}}, {"time": "2022-09-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Moodi mõiste, resonaatori hüvetegur,  seisulained kinnises  resonaatoris, lahtise resonaatori  moodid ja nende sagedused Schawlow-Townes'i teooria järgi, TEM tähistus, tasaparalleelse (Fabry-Perot) resonaatori spekter, paraksiaalne Helmholzi võrrand, Gaussi kimbu võrrand, Gaussi kimbu omandused (kimbu raadius, lainefrondi kõverusraadius, lahknemisnurk, Gouy faas, Rayleigh ulatus ja fookuse sügavus), amplituud ja intensiivsus piki kimpu ja risti kimbuga"}}, {"time": "2022-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Resonaatori footonite arvu dünaamika võrrand, footoni eluiga ja logaritmilised kaotegurid, generatsioonivõimsus, hüvetegur ja ta seos spektraallaiusega, inversiooni ja footonite võrrandid 4-nivoolise laseri jaoks, pumpamisvõimsus lävel, asustatused ja väljundvõimsuse sõltuvus pumpamiskiirusest,  kasutegur tõusukõvera järgi, sisemised kasutegurid, väljundpeegli optimaalne peegeldustegur, pikikoordinaadist sõltuv intensiivsus resonaatoris, mitmemoodine ja ühemoodine generatsioon, võimendatud spontaanne kiirgus (ASE) ja selle omadused, ASE spektraallaiuse sõltuvus võimendusest ja võimenduskeskonna geomeetriast"}}, {"time": "2022-09-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Energia kogumise võimalused võimsa impulsi saamiseks (impulsspumpamine, resonaatori tühjendamine ja Q-lukustus), aktiivse Q -lukustuse teooria  (inversiooni ja footonite arvu võrrandid ning võimenduse ja resonaatorisisese võimsuse võrrandid), Q-lukustatud impulsi piikvõisus, energia, ja viivis, inversiooni kasutamise efektiivsus, passiivne Q-lukustuse tööpõhimõte, tingimused küllastuva neelaja jaoks, Q-lukustuse jaoks sobivad laserid, Q-lukustuse ebastabiilsused"}}, {"time": "2022-09-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Optikateooriate klassifikatsioon (kiirte, laine ja kvantopika, skalaarne ja elektromagnetiline optika), maatriksmeetod kiirteoptikas, resonaatori g1 ja g2 parameetrid, stabiilsuse tingimus, stabiilsuse diagramm,  stabiilsete resonaatorite tüübid, Fresneli arv ja tema kasutamist selgitavad näited, \nresonaatorite kirjeldamine laineoptika järgi, Huygensi (Fresnel-Kirchhoffi) integraal üldjuhul ja Fresnel'i lähenduses,  paraksiaalne lainevõrrand, iseühilduv väli resonaatoris"}}, {"time": "2022-09-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ristmoodide arvutamine Fox-Li ja omaväärtuste meetodil, Gaussi kimbule vastav sümmeetriline resonaator, Gouy faasinihe, ristmoodide sagedused, kõrgemat järgu ristmoodid, difraktsioonikaod stabiilses resonaatoris, suvalisele stabiilsele resonaatorile vastav Gaussi kimp, kimbu laius kaelakohas ja peeglitel üldjuhul ning sümeetrilise ja poolsümmeetrilise resonaatori juhul. Konfokaalne resonaator, tema praktiline tähtsus. Tasaparalleelselähedase, kontsentriliselähedase ning poolkontsentriliselähedase resonaatori omadused."}}, {"time": "2022-09-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ristmoodide selektsioon stabiilsetes resonaatorites, ebastabiilsed reonaatorid (konstruktsioon, omadused eelised, puudused, väljundikadu), konfokaalne ebastabiilne resonaator, resonaatori disaini kriteeriumid, stabiilsustsoonid, difraktsioonvõrega häälestatav resonaator (Littrow'i, ja Littman-Metcalf'i  konstruktsioon), lainepikkuste valiku tingimus sõltuvalt võre pöördenurgast, difraktsioonijärk, siinusmehhanism, läbilaskeriba ja piirnurk, prismatelskoop ja selle mõju läbilaskeribale, resonaatorisisene etalon ja selle läbilaskvusspekter ning läbilaskvuse nurksõltuvus. Vaba dispersiooni ulatus ning interferentsijärk. Pidev ühemoodine ring-värvlaser."}}, {"time": "2022-09-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ajaline koherents (lainefrondi faasi määramatus lõpliku sagedusribaga korral, ribade kontrast Michelsoni interferomeetris, koherentsi aeg ja pikkus), ruumiline koherents (omadused, kontrast Youngi interferomeetris, näited, koherentsi pindala), vastastikuse koherentsi funktsiooni ja kompleksse koherentsi astme valemid, nende suuruste omadused, koherentsi aja ja pindala range definitsioon, seos interferentsiribade nähtavusega kvaasimonokromaatsel juhul Youngi katses, juhusliku suuruse keskmine ja dispersioon, koherentsi aja ja spektraallaiuse standardhälbepõhine määratlus, Wiener-Khinchini teoreem ning spektraallaiuse ja koherentsi aja määramatuste korrutis."}}, {"time": "2022-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Näited laserikiirguse ja spontaanse kiirguse ajalise ruumiline koherentsi kohta, ruumiline filtreerimine, kaks meetodit lahknemisnurga mõõtmine,  lahknemisnurga võrdlus tasalaine ja Gaussi kimbu korral, lahknemisnurk osalise ruumilise koherentsi korral, kimbu parameetrite korrutis (BPP) ja M2 tegur, kimbu kaelakoha raadiuse ja lahknemisnurga standardhälbepõhine määratlus, näited M2 teguri rakendusest (multimoodlaseri kimbu valem ja servast kiirgava dioodlaseri elliptiline valguskimp), heleduse ja BPP seos, laseri ja Hg-lambi heledus"}}, {"time": "2022-10-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mittelineaarse muundamise kasutusvõimalused, süsteemi lineaarne ja mittelineaarne reaktsioon, mittelineaarse polarisatsioon ja vastuvõtlikkused, inversioonisümmeetria efekt, mittelineaarse optika protsessid (teise harmoonilise genereerimine SHG, summaarse sageduse genereerimine SFG, diferentssageduse genereerimine DFG, optiline allamuundamine, kolme laine segunemine), faasisünkronismi seos energia ja impulsi jäävusega, faasisünkronism SHG jaoks üheteljelise kaksikmurdava kristalli  korral, I ja II tüüpi faasisünkronism, nurgaga ja temperatuuriga häälestamine SHG jaoks, mittekolllineaarne ja kvaasi-faasisünkronism, sageduse kolme ja neljakordistami, parameetriline allamuundamine, optilised parameetriline ostsillaator, optiline parameetriline võimendi"}}, {"time": "2022-10-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mittelineaarsete kristallide parameetrid (sümmeetriarühm, mittelineaarsustegur,  läbipaistvuse spektraalpiirkond, purustuslävi),  \n kolme samas suunas leviva laine mittelineaarse vastastikmõju mudel , Manley-Rowe seosed,  mudeli rakendamine OPO generatsiooni läve arvutamiseks\n kaksikresonantsel juhul ja üksikresonantsel juhul täieliku faasisünkronismi korral, \n mudeli rakendamine SHG jaoks,  SH intensiivsuse sõltuvuse arvutamiseks kaugusest kristallis (faasisünkronismi puudumisel, täieliku faasisünkronismi korral ja üldjuhul)."}}, {"time": "2022-10-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Pidevad värvlaserid ja impulss-värvlaserid, konstruktsioon, häälestamistehnika, värvained ja lahustid, elektronüleminekud värvaines. Optiliselt pumbatavad tahkiselaserid, pidevad, impulss ja moodlukustatud,  aktiivkeskkonna materjalid, lambiga ja dioodidega pumpamise võrdlus, mitmesuguseid konstruktsioone. Dioodlaserid (pooljuhtlaserid), tööpõhimõte, Fermi nivoo, inversioon ja kvaasi-Fermi nivood, pooljuhtmaterjalid,  homo- ja heterosiire, elektroonne piiramine, optiline piiramine, pumpamise ja murdumisnäitajaga piiritletud aktiivkeskkond, dioodlaserite tüübid (servalt kiirgavad, laiapinnalised, dioodide rivi ja maatriks, VCSEL, välise resonaatoriga, kvantkaskaadlaser), konstruktsioone, jaotatud tagasiside, Braggi reflektorid,  generatsiooni temperatuurisõltuvus ja spekter."}}, {"time": "2022-10-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Gaaslaserite üldised omadused, He-Ne laser, ioonlaserid, CO2 laser (madalrõhu, keskõhu, atmosfäärse rõhuga), CO2 võnke-pöörlemisnivood , eksimerlaserid, energianivoode skeemid, põhilised energia ülekande ja muundumise protsessid, tüüpilised aktiivkeskkonna rõhud, gaasisegu koostised, mõõtmed, kasutegurid, kiirgusvõisused ja impulsi energiad.  Muud gaaslaserid (lämmastiklaser, metalliaurulaserid, keemilised laserid)."}}, {"time": "2022-10-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kiuoptikast: numbriline apertuur ja V-arv, ühemoodi ja multimoodkiud, levimiskaod, dispersioon. Kiulaseritest: (jaotatud) tagasiside kiulaserites, footonkristallkiud,  olulisemad kiulaserite materjalid, ülesmuundavad kiulaserid, kiulaserite eelised ja puudused võrreldes tavaliste (maht)laseritega. Superkontiinuum laserid. Moodlukustuse teooria, amplituudi aegsõltuvus. Moodlukustuse tekitamine, passiivne ja aktiivne moodlukustus. Näiteid moodlukustatud laserite kohta. Heisenbergi määramatusseosed valguskimbu ja valgusimpulsi jaoks."}}]}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 15}, "parent_uuid": "3161a131-d9da-9d85-7112-04fa080c0f78", "parent_code": "LOFY.01.033", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}