{"uuid": "6fc79476-d710-adab-fde9-885f02646d45", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T19:20:12", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is targeted to the quick and efficient introduction of the main principles of the current physics (matter and field, fermions and bosons, absolute speed, energy minimum, etc.), whereas the previous knowledge in physics is not required. The main goal is to create the mental constructs to envision physical processes. In most important cases, the examples are illustrated considering the application of the mathematical methods in physics. It is also important to note that the absolute mathematic formalness is not pursued.", "et": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Kuulajate teadvuses püütakse eelkõige tekitada füüsikalisi protsesse peegeldavaid kujutluspilte. Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud). Käsitluse üldist matemaatilist rangust ei taotleta."}, "objectives": [{"en": "The main goal of the course is to introduce the physics as the integrity, and the role of physics in the generation of the observer's personal understanding of the Nature.", "et": "Tutvustada füüsikat kui tervikut ja füüsika rolli indiviidi kui vaatleja isikliku looduspildi kujundamisel."}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to:\n1. Cognize physics as a science that investigates the most general causal relationships, generates the models of natural phenomena and broadens the internal and external limits of vision;\n2. Express the basic principles of the physical concept of the nature (such as atomistic principle, energetic minimum, absolute speed, wave-particle dualism, uncertainty principle), and refer to their exertion;\n3. Use the vocabulary introduced at the lectures during the scientific discussions, make difference between important and unimportant information, and apply physical terminology in a correct way;\n4. Possess the knowledge considering the mathematical background and calculus necessary for the description of physical processes (e.g., graphical representations, differentiation and integration, application of complex numbers), and recognize the main attributes and occurrence conditions of main functions present in physics (e.g., linear, power, exponent, harmonic); 5. Know the basic definitions belonging to the current physical concept of the world within the limits of the vocabulary (30 pages of A4 format) available on the web page of the course;\n6. Solve the physical problems within the limits of example exercises available via the web support of the course.", "et": "Aine läbinud üliõpilane:\n1. Mõistab füüsikat kui kõige üldisemaid põhjuslikke seoseid uurivat, loodusnähtuste mudeleid loovat ja nii sisemist kui välist nähtavushorisonti edasi nihutavat teadust;\n2. Oskab väljendada füüsikalise maailmapildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;\n3. Oskab loengute kavas toodud märksõnade raames füüsikaliselt arutleda, eristades olulist ebaolulisest ja kasutades korrektselt füüsika termineid;\n4. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);\n5. Tunneb kaasaegse füüsikalise maailmapildi põhimõisteid aineveebis toodud põhivaraga (30 A4 lehekülge) määratletud tasemel;\n6. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel."}], "notes": {"et": "Aine toimumiskava kehtib esialgse orientiirina."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest. Kontrolltööde ja eksamitöö kirjutamisel on lubatud kasutada valemite lehte, mis tohib sisaldada ainult valemeid, mitte sõnu. Nõutav on materjalis orienteerumise oskus, mis võimaldab vajalikku valemit ka kommentaaride puudumisel ära tunda."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksamitöö (annab kuni 30% hindest)."}}], "grade_preconditions": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest. Kuni 30% annab eksamitöö. Eksamile lubatakse kõik, kes on kogunud kontrolltöödega üle 35% punktidest (pool või enam kontrolltööde eest saadavast 70%-st)."}, "grade_evaluation": {"et": "Kõigi kontrolltööde positiivne sooritus (rohkem kui poolte võimalike punktide saamine iga töö eest) eksamile pääsemiseks veel vajalik ei ole, kuid see on nõutav lõpptulemuse saamisel. Esimene kontrolltöö mõõdab väljundi 2 saavutatust ja kolm viimast kontrollivad väljundi 6 olemasolu. Eksamitöös on eraldi nõutavad väljundite 1, 2, 3, 4 ja 5 saavutatust kontrollivate ülesannete positiivsed sooritused. Kõrgeimale hindele (A) pretendeerijate teadmisi võidakse täiendavalt kontrollida eksami suulises osas. Lõpphinde tõstmist eksami suulises osas võivad taotleda kõik üliõpilased, kes on kirjalikes kontrollivormides kogunud üle 70% punktidest. Aktiivne osalemine auditoorses töös formuleeritud probleemide lahendamisel võimaldab üliõpilastel koguda lisapunkte, mis tõstavad lõpphinnet."}, "debt_elimination": {"et": "Mistahes kontrolltöö tegemiseks on enne eksamit kaks võimalust, sõltumatult soorituskatse toimumise ajast. Arvesse läheb parem tulemus, seega on üks kord lubatud parandada ka juba positiivset kontrolltöö hinnet. Positiivse lõpphinde saamine aines eeldab väljundite 1 kuni 5 saavutatust kontrollivate ülesannete (kõigi!) positiivseid sooritusi eksamitöös ja kõigi kontrolltööde positiivseid sooritusi. Korduseksamil võib piirduda vaid nende ülesannete tegemisega, mille osas eelmise eksami tulemus oli negatiivne. Eksami kõigi väljundite (1-5) osas positiivselt sooritanud üliõpilased saavad ühekordse lisavõimaluse seni negatiivse tulemusega kontrolltööde kordussoorituseks. Kogu teadmiste kontrolli protseduur lõpeb enne järgmise semestri algust ja mingi väljundi osas ikka veel negatiivse tulemusega üliõpilased saavad puuduliku lõpphinde (F). Nad on oodatud aines osalema selle järgmisel toimumisel."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/fmp/", "is_moodle_connected": false, "mandatory_materials": "1. I.Peil, K.Tarkpea.  Füüsikalise looduskäsitluse alused. Õpik gümnaasiumidele, Tartu, Eesti Füüsika Selts (EFS), 2014\n2. Veebi <a href=\"https://sisu.ut.ee/fmp/\">https://sisu.ut.ee/fmp/</a> linkidest avanevad allikad.", "recommended_materials": "1. K.Tarkpea, H.Voolaid. Füüsika käsiraamat. Koolibri, 2002.\n2. D. Halliday, R. Resnick, Jearl Walker. Füüsika üldkursus. Tartu, EFS, 2012\n3. J. Lõhmus, R. Veskimäe (toim.). Universumi mikromaailm. 2003.  \n4. Robert H. March. Füüsika võlu (Physics for Poets). Ilmamaa, 2000."}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "2769514b-4c15-d124-2428-49f971ab38f6", "person_name": "Veera Krasnenko", "structural_unit": {"code": "LTFY08", "name": {"en": "Laboratory of Laser Spectroscopy", "et": "laserspektroskoopia labor"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.- 4.n. 4L n-s; 5.-16.n. 4L, 2S n-s, 4 knt  => E"}, "entries": [{"time": "2024-09-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Aine läbimise tingimused. Maailmapildi mõiste.</B> Aine läbimise tingimused ja hindamine. Maailm, loodus, füüsika ja teised loodusteadused. Füüsika erinevad tõlgendused. Vaatleja ning tema omadused."}}, {"time": "2024-09-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Vaatleja ning füüsika.</B> Sündmused ja protsessid, aeg ja ruum, aine ja väli. Nähtavushorisondid looduses. Füüsikalised objektid ja füüsikalised suurused."}}, {"time": "2024-09-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Füüsika uurimismeetodid.</B> Loodusteaduslik meetod. Eksperiment ja teooria. Seaduspärasused ja seadused. Mõõtmine ja mõõtühikud. SI süsteem. Mõõtemääramatus."}}, {"time": "2024-09-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Füüsikalised mudelid.</B> Mudeli loomine. Keha suurus, asukoht, asend ja kuju. Liikumisvormid: translatsioon, rotatsioon, deformatsioon, ostsillatsioon. Vastastikmõjud, jõud ja laeng. \nTeisipäeviti (alates 10.09) kell 10-12 loeng ja kell 12-14 seminar."}}, {"time": "2024-09-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Füüsikalised suurused kui mudelid.</B> Skalaarsed ja vektoriaalsed suurused. Kiirus, kiirendus, mass ja impulss. Impulsimoment. Töö, energia ja võimsus."}}, {"time": "2024-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Füüsika seos matemaatikaga.</B> Põhjuslikkus looduses ja funktsioonid matemaatikas. Ajalise tuletise operaator. Kompleksarvude kasutamine füüsikas."}}, {"time": "2024-09-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Füüsika üldprintsiibid.</B> Atomistika ja energia minimiseerumine. Tõrjutusprintsiip, absoluutkiiruse printsiip, dualismiprintsiip, lõtkuprintsiip. Põhivastastikmõjud. \nKell 10-12 loeng ja kell 12-14 seminar."}}, {"time": "2024-09-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Alusosakeste Standardmudel.</B> Fermionid ja bosonid. Spinn ja selle mudelid. Poolarvuline ja täisarvuline spinn. Näide: vesiniku 21 cm kiirgus."}}, {"time": "2024-09-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Standardmudeli osakesed.</B> Leptonid ja kvargid. Elektrilaeng, leptonlaeng ja värvus. Barüonid ja mesonid. Antiosakesed. Füüsikalise maailmapildi arengufaasid."}}, {"time": "2024-09-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Mehaanika.</B> Kulg- ja pöördliikumise kinemaatika ning dünaamika. .\nKell 10-12 loeng ja kell 12-14 seminar. Seminari teema: füüsika üldprintsiibid, ühikute teisendamine ja füüsikalised suurused."}}, {"time": "2024-09-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Valmistumine kontrolltööks.</B> Pöördliikumist kirjeldavad füüsikalised suurused. Jõumoment ja inertsimoment. Impulsi ja impulsimomendi jäävus."}}, {"time": "2024-09-26", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>1. kontrolltöö </B> teemal  Füüsika üldmudelid ja üldprintsiibid. Füüsikalised suurused mehaanikas.   Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud Moodle'i proovitestid 1.1 kuni 1.4."}}, {"time": "2024-10-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Jõud looduses.</B> Kuu ja õun Newtoni käsitluses. Taevakehade orbitaalne liikumine. Kepleri seadused. Gravitatsiooniseadus. Raskusjõud, toereaktsioon ja keha kaal."}}, {"time": "2024-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Võnkumised.</B> Elastsusjõud. Harmooniline võnkumine ja selle kirjeldamine pöörlemise kaudu. Võnkumiste diferentsiaalvõrrand ja selle lahendamine."}}, {"time": "2024-10-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Sumbuvad ja sundvõnkumised. </B> Eksponentfunktsioon füüsikas. Sumbetegur ja ajategur. Kompleksmeetod võnkumiste kirjeldamiseks."}}, {"time": "2024-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Lained. </B> Laine kui võnkumise levimine ruumis. Ristlained ja pikilained. Lainefunktsioon. Ajaline ja ruumiline faasiosa lainefunktsioonis."}}, {"time": "2024-10-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Mehaanika, võnkumised ja lained. </B> Arvutusülesannete lahendamine. Ajaline diferentseerimine ja integreerimine."}}, {"time": "2024-10-17", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>2. kontrolltöö </B> teemal  Arvutusülesanded mehaanikas. Võnkumised ja lained. \n Osalema on oodatud üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud proovitestid 2.1 kuni 2.4."}}, {"time": "2024-10-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Seisulained ja helilained. </B> Lainete levimiskiirus. Seisulained ja kvantarvud. Ajaesitus ja sagedusesitus. Fourier' teisendus. Heli valjus, kõrgus ja tämber."}}, {"time": "2024-10-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Relativistlik füüsika. </B> Ruum ja aeg kui vaatleja kujutlused. Aja aeglustumine, pikkuste lühenemine, massi suurenemine. Keha omapikkus, tegelik pikkus ja näiv pikkus."}}, {"time": "2024-10-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Elektromagnetismi põhimõisted. </B> Elektrilaeng ja voolutugevus. Ühikud amper ja kulon. Elektrivälja tugevus ja pinge. Ühikud volt ja volt meetri kohta (1 V/m). Coulomb'i seadus."}}, {"time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Vooluringi talitlemine. </B> Ohmi seadus. Takistus ja eritakistus. Elektriline võimsus. Allika elektromotoorjõud (EMJ) ja sisetakistus. Takistuse sõltuvus temperatuurist."}}, {"time": "2024-11-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Magnetvälja kirjeldamine. </B> Püsimagnet ja vooluga juhe. Ampere'i seadus. Suurused B ja H. Magnetvoog. Ühikud tesla ja veeber. Elektrivälja ning magnetvälja võrdlus. Homogeenne väli kondensaatoris ja juhtmepoolis."}}, {"time": "2024-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Elektromagnetiline induktsioon. </B> Lorentzi jõud. Faraday induktsiooniseadus. Elektrimootori ja generaatori tööpõhimõte. Maxwelli võrrandid (ainult sõnalised formuleeringud)."}}, {"time": "2024-11-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Elektromagnetism ja relativistlik füüsika.</B> Arvutusülesannete lahendamine ja valmistumine kontrolltööks antud teemal. Võimalus esitada küsimusi seni õpitu kohta."}}, {"time": "2024-11-14", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>3. kontrolltöö </B> teemal  Elektromagnetism ja relativistlik füüsika. Osalema on oodatud üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud proovitestid 3.1 kuni 3.4. \n<B>Kontrolltööde hilisema kirjutamise võimalus:</B> Alates 08. novembrist igal reedel kell 8.15 kuni 10.00 Physicumi ruumis A101 või A106 (kui A101 ei mahuta ära) saab kirjutada mistahes kontrolltööd."}}, {"time": "2024-11-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Elektromagnetlained.</B>  Elektromagnetvõnkumised. Elektromagnetlainete tekkimine. Elektromagnetlainete skaala. Spektraalparameetrid ja teisendused nende vahel."}}, {"time": "2024-11-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Aatomimudelid.</B> Kullalehe katse. Planetaarne aatomimudel. Bohri mudel. Elektroni energia sõltuvus kvantarvust. Elektroni kiiruse, orbiidi raadiuse, impulsimomendi ja võnkesageduse sõltuvus kvantarvust."}}, {"time": "2024-11-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Aatomi- ja tuumafüüsika.</B> Kaasaegne aatomimudel. Kvantarvud ja valikureeglid.  Tuumareaktsioonid: lõhustumine ja süntees. Tuumakiirgused."}}, {"time": "2024-11-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Optika üldprintsiibid.</B> Valguse teke, levik ja neeldumine. Valguse peegeldumine ja murdumine. Aine optiliste omaduste tulenevus elektrilistest."}}, {"time": "2024-12-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Laineoptika.</B> Valguse interferents, difraktsioon ja polarisatsioon. Valguse vastastikmõju ainega. Difraktsioonivõre. Valguse neeldumine ja hajumine."}}, {"time": "2024-12-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Kvantoptika ja kvantmehaanika.</B> Fotoefekt. Soojuskiirgus ja luminestsents. Laseri tööpõhimõte. Määramatuse seosed. Lainefunktsioon kvantmehaanikas, Schrödingeri võrrand. Osakeste tunnelleerumine."}}, {"time": "2024-12-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Optika ja kvantmehaanika.</B> Ülesannete lahendamine antud teemal."}}, {"time": "2024-12-12", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>4. kontrolltöö </B> teemal   Optika, aatomifüüsika, kvantmehaanika. Osalema on oodatud üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud proovitestid 4.1 kuni 4.4."}}, {"time": "2024-12-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Molekulaarfüüsika.</B> Temperatuur ja soojus. Soojusülekandeprotsessid. Aine agregaatolekud ja siirded nende vahel. Molekulaarkineetilise teooria alused."}}, {"time": "2024-12-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Termodünaamika.</B> Ideaalgaas ja reaalgaas. Termodünaamilised olekuparameetrid ja termodünaamika printsiibid. Isoprotsessid."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "5809cd50-bdef-d0b1-1e75-4209c5564c99", "parent_code": "LOFY.01.002", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}