{"uuid": "d5944862-b806-d7fb-e634-da4569a29165", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-30T11:48:50", "title": {"en": "Thin Film Technology I", "et": "Kiletehnoloogia I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "24/25 S regular LT Eng", "et": "24/25 K PÕ LT Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": false, "uuid": "29ae55a7-a6ab-2c36-244b-406f3e2007bf", "code": "LOFY.02.025", "title": {"en": "Physics of Solid Materials", "et": "Tahkismaterjalide füüsika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The lecture course will give a review of application and contemporary methods for processing and characterization of thin solid films. In the lecture course, most significant differences of thin films and thin-film structures from bulk materials will be described. The physical and chemical methods for deposition of thin films will be characterized in more detail whereas especial attention will be paid on methods allowing reproducible deposition of nanostructured thin films. Application of thin-film deposition methods will be briefly reviewed. The lecture course will also introduce methods for process control and post-growth characterization of thin films. Application of thin-film processing methods for fabrication of electronic and nanotechnological devices will be described.", "et": "Kursus annab ülevaate tahkisekilede kasutusaladest ning valmistamise, töötlemise ja analüüsi meetoditest. Selles kirjeldatakse kilematerjalide ja -struktuuride omaduste olulisemaid erinevusi nn. ruumiliste materjalide omadustest. Üksikasjalikumalt käsitletakse füüsikalisi ja keemilisi meetodeid tahkisekilede saamiseks. Seejuures vaadeldakse nanostruktuursete kilede saamise iseärasusi ja kiletehnoloogiliste meetodite rakendusi. Tutvustatakse tahkisekilede kasvujärgse töötlemise võimalusi. Kirjeldatakse meetodeid kilede kasvu reaalajaliseks jälgimiseks ning kilede olulisimate omaduste kasvujärgseks analüüsiks. Tuuakse näiteid kiletehnoloogia rakendustest elektroonikas ja nanotehnoloogias."}, "objectives": [{"en": "The aim of the lecture course is to introduce application areas, processing methods and specific properties of thin solid films and thin-film structures.", "et": "Kursuse eesmärgiks on anda ülevaade tahkisekilede ja kilestruktuuride kasutusaladest, valmistamise meetoditest ning iseloomulikest omadustest."}], "learning_outcomes": [{"en": "The students who have passed the lecture course ", "et": "Kursuse edukalt läbinud üliõpilased "}, {"en": "* know application possibilities of thin solid films,", "et": "* tunnevad tahkisekilede rakendusvõimalusi,"}, {"en": "* are able to explain operation principles of thin-film preparation methods,", "et": "* on võimelised selgitatama tahkisekilede valmistamise meetodite tööpõhimõtteid, "}, {"en": "* know methods for real-time and post-growth characterization of thin solid films,", "et": "* tunnevad tahkisekilede reaalajaliseks ja kasvujärgseks karakteriseerimiseks sobivaid meetodeid,"}, {"en": "* are able to select appropriate methods for preparation and characterization of thin films for different applications.", "et": "* oskavad valida konkreetseteks rakendusteks sobivaid tahkisekilede valmistamise ja karakteriseerimise meetodeid."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "A (outstanding): A student has gained detailed knowledge on the application possibilities of thin solid films. He/she  is capable to thoroughly explain the principles of thin film deposition methods and knows basic physical phenomena behind their functioning. He/she is well aware of the principles of characterization of thin solid films. He/she is also capable to predict most appropriate thin film synthesis methods for particular applications.\nB (very good):  Student knows thoroughly the application possibilities of thin solid films, is capable to explain the principles of film deposition methods in detail. He/she is able to to select appropriate methods for preparation of solid films for particular applications.\nC (good): A student knows the most important applications of thin solid films. He/she is able to explqin woerking principles of thin film deposition methods. He/she is also able to select suitable deposition and characterization methods of thin solid films for particular applications.\nD(satisfactory):   A student is able to recall and recognize the main application fields for thin films. He/she can explain the working principles of some main thin film deposition techniques. He/she also knows some main characterization methods of thin solid films and is able to explain the necessity of the evaluation of film quality.\nE(unsatisfactory): A student is able to define some application areas of thin films. He/she can explain the working principles and applications of some common thin film deposition techniques. He/she is aware of the main requirements for the characterization methods of thin solid films."}}], "grade_preconditions": {"et": "registration to the course, participation in the lectures, registration to the evaluation (examination)."}, "grade_evaluation": {"et": "Hinne kujuneb suulisel eksamil saadavate punktide põhjal. The student will be evaluated (The marks will be granted) on the basis of the results of the oral examination."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne semestri lõppu. \nKorduseksami peab sooritama hiljemalt järgneva semestri alguseks.\nKorduseksami tähtaega võib dekaan õppejõu taotlusel pikendada kuni 2 nädala võrra."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Lecture notes and slides, Kaupo Kukli/Jaan Aarik (the material will be sent to the students, registered to the course, by e-mail).", "recommended_materials": "1. Handbook of Thin Film Process Technology, Eds.: D.A. Clocker, S.I. Shah, Institute of Physics Publishing, Bristol - Philadelphia, 1995.  \n2. Handbook of Thin Film Materials, Vol. 1: Deposition and Processing of Thin Films, Ed.: H.S. Nalwa, Academic Press, 2002.  \n3. C.P. Poole, F.J. Owens, Introduction to nanotechnology, John Wiley & Sons, Hoboke - New Jersey, 2003.  \nNanoelectronics and Information Technology, Ed.: R. Waser, Wiley-VCH, Weinheim, 2003.   \n4. Handbook of sol-gel science and technology : processing, characterization and applications. Volume I-3, Sol-gel processing"}, "participants": {"lecturers": [{"person_uuid": "af72b6d5-651c-e42d-e9db-a402974684ae", "person_name": "Kaupo Kukli", "structural_unit": {"code": "LTFY17", "name": {"en": "Laboratory of Thin Film Technology", "et": "kiletehnoloogia labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-39. n. 2 L n-s => E"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. Introduction. Definition of thin films. Classification of thin films and their application areas."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2. Application of thin solid films and artificially layered structures in electronics and other fields of technology."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. Overview of crucial factors influencing the properties of thin solid films. Nucleation issues."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. Thin film deposition methods: thermal evaporation, ion sputtering"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. Thin film deposition methods: pulsed laser deposition, molecular beam epitaxy"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6. Thin film deposition methods:  spray pyrolysis, chemical vapor deposition"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7. Atomic layer deposition, conformal deposition on porous and other 3D substrates."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. Effect of nanocrystallinity on physical properties of solid layers."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9. Precursor chemistry for inorganic solid films, about selection criteria"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10. Substrate preparation, post-deposition treatment of solid films. Necessity and effects."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "11. Thin film evaluation methods ex situ - compositional, structural measurements"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "12. Basic electrical measurements."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "13. Thin film growth monitoring in situ"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14. Examples of applications for different deposition methods. Some technological trends. Graphene and other advanced nanolayered materials."}}]}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 25}, "parent_uuid": "48228258-67c6-c63c-dc4e-b2e2db22aead", "parent_code": "LOFY.02.013", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}