{"uuid": "c4b6bdf7-f806-f40b-0371-86adfc66948a", "code": "LOFY.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Experiences in Physics", "et": "Menetluspraktika füüsikas"}, "credits": 12, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY", "structural_unit_name": {"en": "Institute of Physics", "et": "füüsika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTFY", "name": {"en": "Institute of Physics", "et": "füüsika instituut"}, "webpage_url": "https://fi.ut.ee", "address": "W. Ostwaldi 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "W. Ostwaldi 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the internship, the student becomes acquainted with various aspects of the physicists professional work (work organization, technology, quality control, etc.). He or she selects the place for the internship himself or herself, preferably with the help of the supervisor of the Masters thesis and confirms the suitability of the subject with the responsible lecturer. Practicing outside the home university is preferred. If the internship is about carrying out a specific innovative project, it is also allowed to conduct the internship in your own research group.\n\nDuring the internship, the student performs tasks requiring a physicist qualification and gets an overview of the production, research, development or teaching work done at the internship.\n\nFinally, the student submits a written report outlining the activities and problems he or she encountered during the internship. The template of the report is provided in Moodle course and must be submitted by email at least two weeks before the expected time of defense. The defense must take place before the official end of the semester. The internship ends with an oral presentation at a related institute's seminar. The student organizes the seminar by contacting the organizer of the specific seminar. The student also contacts the responsible lecturer to arrange suitable times for everybody.\n\nIn order to pass the subject, the student must pass both the practice report and the defense.\n\nYou can register for the Moodle course with the key \"LOFY.00.007240\"", "et": "Menetluspraktika käigus tutvub magistrant füüsiku erialase töö erinevate aspektidega (töökorraldus, tehnoloogia, kvaliteedikontroll jt.). Praktika toimumiskoha valib ta endale välja ise, soovitatavalt magistritöö juhendaja abiga ja kinnitab teema sobivuse vastutava õppejõuga. Eelistatud on praktika sooritamine väljaspool koduülikooli. Kui praktika sisuks on konkreetse innovatiivse projekti teostamine, siis on lubatud sooritada praktikat ka omaenda uurimisrühmas. \n\nPraktika ajal täidab üliõpilane füüsiku kvalifikatsiooni nõudvaid ülesandeid ning saab ettekujutuse praktika toimumiskohas tehtavast tootmis-, teadus-, arendus- või õppetööst. \n\nLõpuks esitab üliõpilane kirjaliku aruande, milles ta annab ülevaate nendest tegevustest ja probleemidest, millega ta praktika ajal kokku puutus. Aruanne peab olema vormistatud Moodles oleva näidise alusel ja olema esitatud vähemalt kaks nädalat enne eeldatavat kaitsmise aega. Kaitsmine peab toimuma enne semestri arvestuslikku lõppu. Menetluspraktika lõpeb praktika kohta suulise ettekande esitamisega erialases seminaris. Erialase seminari toimumise organiseerib tudeng iseseisvalt kontakteerudes vastava seminari korraldajaga. Sellele lisaks kontakteerub tudeng vastutava õppejõuga, et leppida kokku kõigile osapooltele sobiv ettekande aeg.\n\nÕppeaine läbimiseks peab tudeng saama arvestuse nii menetluspraktika aruandes kui menetluspraktika kaitsmisel.\n\nMoodle kursusele võib registreeruda võtmega \"LOFY.00.007240\""}, "objectives": [{"en": "The goal of the course is to give MSc students the practical experience of work in industrial, research or teaching environment and to help with future career choises.", "et": "Anda füüsika magistriõppe üliõpilasele võimalus saada praktilise töö kogemus kas füüsikalisi tehnoloogiaid rakendavas tootmisettevõttes või siis füüsikaga tegelevas teadus- ja/või õppeasutuses ja selle abil planeerida oma tulevasi karjäärivalikuid."}], "learning_outcomes": [{"en": "The student who has finished the course:", "et": "Menetluspraktika läbinud üliõpilane: "}, {"en": "1. is familiar with physics related manufacturing, scientific or educational practical work aspects;", "et": "1.\tOn tutvunud füüsika-alase tootmis-, teadus- või haridustöö praktiliste aspektidega;"}, {"en": "2. can use necessary equipment for performing this type of work;", "et": "2.\tOskab kasutada selle töö tegemisel vajalikku aparatuuri;"}, {"en": "3. can plan and perform basic operations;", "et": "3.\tOskab teostada ja planeerida ettetulevaid tööoperatsioone;"}, {"en": "4. is familiar with the quality norms and standards applicable in the field;", "et": "4.\tTunneb vastavas valdkonnas kehtivaid kvaliteedinorme ja standardeid;"}, {"en": "5. is familiar with the legal and ethical aspects of professional work;", "et": "5.\tTunneb erialase töö juriidilisi ja eetilisi aspekte; "}, {"en": "6. is able to analyze the work done and prepare a proper report on it and defend it before the commission.", "et": "6.\tOskab analüüsida oma tehtud tööd ja koostada sellest nõuetekohase aruande ja kaitsta seda komisjoni ees"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}