{"uuid": "8f65a1be-c336-1bd0-b6b5-8fa6ada15bea", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-12T11:40:30", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is targeted to the quick and efficient introduction of the main principles of the current physics (matter and field, fermions and bosons, absolute speed, energy minimum, etc.), whereas the previous knowledge in physics is not required. The main goal is to create the mental constructs to envision physical processes. In most important cases, the examples are illustrated considering the application of the mathematical methods in physics. It is also important to note that the absolute mathematic formalness is not pursued.", "et": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Kuulajate teadvuses püütakse eelkõige tekitada füüsikalisi protsesse peegeldavaid kujutluspilte. Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud). Käsitluse üldist matemaatilist rangust ei taotleta."}, "objectives": [{"en": "The main goal of the course is to introduce the physics as the integrity, and the role of physics in the generation of the observer's personal understanding of the Nature.", "et": "Tutvustada füüsikat kui tervikut ja füüsika rolli indiviidi kui vaatleja isikliku looduspildi kujundamisel."}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to:\n1. Cognize physics as a science that investigates the most general causal relationships, generates the models of natural phenomena and broadens the internal and external limits of vision;\n2. Express the basic principles of the physical concept of the nature (such as atomistic principle, energetic minimum, absolute speed, wave-particle dualism, uncertainty principle), and refer to their exertion;\n3. Use the vocabulary introduced at the lectures during the scientific discussions, make difference between important and unimportant information, and apply physical terminology in a correct way;\n4. Possess the knowledge considering the mathematical background and calculus necessary for the description of physical processes (e.g., graphical representations, differentiation and integration, application of complex numbers), and recognize the main attributes and occurrence conditions of main functions present in physics (e.g., linear, power, exponent, harmonic); 5. Know the basic definitions belonging to the current physical concept of the world within the limits of the vocabulary (30 pages of A4 format) available on the web page of the course;\n6. Solve the physical problems within the limits of example exercises available via the web support of the course.", "et": "Aine läbinud üliõpilane:\n1. Mõistab füüsikat kui kõige üldisemaid põhjuslikke seoseid uurivat, loodusnähtuste mudeleid loovat ja nii sisemist kui välist nähtavushorisonti edasi nihutavat teadust;\n2. Oskab väljendada füüsikalise maailmapildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;\n3. Oskab loengute kavas toodud märksõnade raames füüsikaliselt arutleda, eristades olulist ebaolulisest ja kasutades korrektselt füüsika termineid;\n4. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);\n5. Tunneb kaasaegse füüsikalise maailmapildi põhimõisteid aineveebis toodud põhivaraga (30 A4 lehekülge) määratletud tasemel;\n6. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksamitöö (annab kuni 30% hindest)."}}], "grade_preconditions": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest. Kuni 30% annab eksamitöö. Eksamile lubatakse kõik, kes on kogunud kontrolltöödega üle 35% punktidest (pool või enam kontrolltööde eest saadavast 70%-st)."}, "grade_evaluation": {"et": "Kõigi kontrolltööde positiivne sooritus (rohkem kui poolte võimalike punktide saamine iga töö eest) eksamile pääsemiseks veel vajalik ei ole, kuid see on nõutav lõpptulemuse saamisel. Esimene kontrolltöö mõõdab väljundi 2 saavutatust ja kolm viimast kontrollivad väljundi 6 (arvutusülesannete lahendamise oskus) olemasolu. Eksamitöös on eraldi nõutavad väljundite 1, 3 ja 5 saavutatust kontrollivate ülesannete positiivsed sooritused. Väljundi 4 (matemaatilsed meetodid füüsikas) saavutatus on vajalik kõrge hinde (A või B) saamiseks. Lisavastamist varasemast kõrgema lõpphinde saamiseks võivad taotleda üliõpilased, kes kirjalikes kontrollivormides on kogunud üle 70% punktidest. Mistahes kirjaliku kontrollivormi sooritamisel on lubatud kasutada ise valmistatud valemite lehte, mis tohib sisaldada ainult valemeid, mitte seletavaid sõnu ega jooniseid. Nõutav on selline materjalis orienteerumise oskus, mis võimaldab vajalikku valemit ilma lisaselgitusteta ära tunda. Peast tuleb teada valemites sisalduvate märkide tähendust, mitte valemeid endid."}, "debt_elimination": {"et": "Mistahes kontrolltöö tegemiseks on enne eksamit kaks võimalust, sõltumatult soorituskatse toimumise ajast. Positiivse lõpphinde saamine eeldab väljundite 1, 3 ja 5 saavutatust kontrollivate ülesannete (kõigi!) positiivseid sooritusi eksamitöös ja kõigi kontrolltööde positiivseid sooritusi. Korduseksamil võib piirduda vaid nende ülesannete tegemisega, mille osas eelmise eksami tulemus oli negatiivne. Eksami positiivselt sooritanud üliõpilased saavad ühekordse lisavõimaluse seni negatiivse tulemusega kontrolltööde kordussoorituseks. Kogu teadmiste kontrolli protseduur lõpeb enne järgmise semestri algust ja mingi väljundi osas ikka veel negatiivse tulemusega üliõpilased saavad puuduliku lõpphinde (F)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/fmp/", "is_moodle_connected": true, "learning_environments": [{"uuid": "c726ec42-3b00-4029-978e-937635c6953d", "type": "MOODLE", "code": "LOFY.01.091", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1. I.Peil, K.Tarkpea.  Füüsikalise looduskäsitluse alused. Õpik gümnaasiumidele, Tartu, Eesti Füüsika Selts (EFS), 2014\n2. Veebi <a href=\"https://sisu.ut.ee/fmp/\">https://sisu.ut.ee/fmp/</a> linkidest avanevad allikad.", "recommended_materials": "1. Robert H. March. Füüsika võlu (Physics for Poets). Ilmamaa, 2000.\n2. J. Lõhmus, R. Veskimäe (toim.). Universumi mikromaailm. 2003.  \n3. P. Hewitt. Conceptual Physics. Little, Brown and Company, Boston, Toronto, fifth edition, 1999 jt aastakäigud."}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-27. n. 4L n-s, 28.-39. n. 4L, 2S n-s, 4 knt => E"}, "entries": [{"time": "2025-02-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>1. Aine läbimise tingimused. Maailmapildi mõiste.</B> Aine läbimise tingimused. Inimene ja maailm. Loodus, füüsika ja teised loodusteadused. Füüsika erinevad tõlgendused. Vaatleja tahe, aistingud, mälu ja mõistus. Süllogism. Looduse struktuuritasandid ja nähtavushorisondid. Mikro-, makro- ja megamaailm. Füüsika ja põhjuslikkus. (4 h)"}}, {"time": "2025-02-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>2. Füüsika uurimismeetodid.</B>  Loodusteaduslik meetod ja mõõtmised. Mõõtühikute süsteem SI. Mõõtemääramatus. Mudelite loomine füüsikas. Füüsikalised objektid ja füüsikalised suurused. Skalaarid ja vektorid. Induktsioon ja deduktsioon. Seaduspärasused ja seadused. Loodusteaduslik ja täppisteaduslik käsitlus. Füüsika seos matemaatikaga. (6 h)"}}, {"time": "2025-03-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>3. Füüsika üldmudelid ja üldprintsiibid.</B>  Kehad, liikumine, vastastikmõjud, aine ja väli, laeng, energia, atomism, spinn. Liikumisvormid: translatsioon, rotatsioon, deformatsioon ja ostsillatsioon. Energia miinimumi printsiip, tõrjutusprintsiip, absoluutkiiruse printsiip, dualismiprintsiip, lõtkuprintsiip. Põhivastastikmõjud ja neist tingitud jõud. Standardmudel. Fermionid ja bosonid. Leptonid ja kvargid. Füüsikalise maailmapildi arengufaasid. (6 h)"}}, {"time": "2025-03-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Algavad seminarid </B>, mis toimuvad kuni semestri lõpuni igal teisipäeval kell 8-10. Seminarides vastab õppejõud mistahes küsimustele aine teemal, lahendatakse ülesandeid ja valmistutakse kontrolltöödeks. Eriti on oodatud küsimused eksami arutlusülesande teemal."}}, {"time": "2025-03-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>4. Mehaanika kui füüsikaliste mudelite alus.</B>  Koordinaadid. Taustsüsteem. Matemaatilised meetodid liikumise kirjeldamiseks. Diferentseerimine ja integreerimine. Liikumisvõrrandid. Graafilised meetodid liikumise kirjeldamiseks. Kulg- ja pöördliikumise kinemaatika ning dünaamika. Newtoni seadused. Hõõrdejõud ja takistusjõud. Inertsjõud. Jõumoment, inertsimoment, impulsimoment. Töö, energia ja võimsus. Gravitatsiooniseadus. Taevakehade liikumine. (10 h)"}}, {"time": "2025-04-01", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>1. kontrolltöö </B> teemal  Füüsika üldmudelid ja üldprintsiibid, füüsikalised suurused mehaanikas. Siin ja edaspidi on ära toodud vastava kontrolltöö esimene toimumisaeg. Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud Moodle'i proovikontrolltööd 1.1 kuni 1.4. Kui veel ei oska, ära tule!  Aga kunagi tulema peab, kui on soov aine läbida."}}, {"time": "2025-03-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>5. Võnkumised ja lained.</B>  Elastsusjõud. Harmooniline võnkumine, selle kirjeldamise viisid. Sumbuv võnkumine ja sundvõnkumine. Resonants. Sumbetegur ja ajategur. Laine kui võnkumise levimine ruumis. Lainefunktsioon. Seisulained ja kvantarvud. Piki- ja ristlained. Heli valjus, kõrgus ja tämber. (6 h)"}}, {"time": "2025-04-15", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B> 2. kontrolltöö </B> teemal  Arvutusülesanded mehaanikas, võnkumised ja lained.  Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud Moodle'i proovikontrolltööd 2.1 kuni 2.4."}}, {"time": "2025-04-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>6. Elektromagnetism.</B>  Elektrilaeng ja voolutugevus. Coulomb'i seadus ja elektrostaatiline väli. Väljatugevus, pinge ja potentsiaal. Keha takistus ja aine eritakistus. Vooluallika elektromotoorjõud ja sisetakistus. Ampere'i seadus ja magnetväli. Väljavektori voog. Elektromagnetiline induktsioon. Maxwelli võrrandid (vaid sõnalised formuleeringud). Kehade süsteemi mahtuvus ja induktiivsus. Elektri- ja magnetvälja energia. Elektromagnetvõnkumised. Elektromagnetlainete tekkimine. (8 h)"}}, {"time": "2025-05-06", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B> 3. kontrolltöö </B> teemal  Elektromagnetism.  Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud Moodle'i proovikontrolltööd 3.1 kuni 3.4."}}, {"time": "2025-05-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Mikromaailma füüsika.</B>  Elektromagnetlainete skaala. Spektraalparameetrid. Planetaarne aatomimudel. Bohri mudel. Elektroni kiiruse, orbiidi raadiuse, impulsimomendi ja energia sõltuvus kvantarvust. Elektroni de Broglie lained. Valguse kiirgumine ja neeldumine Bohri mudeli kohaselt. Spektraalseeriad. Kaasaegne aatomimudel. Kvantarvud ja valikureeglid. Tuumareaktsioonid: lõhustumine ja süntees. Tuumakiirgused ja nende bioloogiline toime. (6 h)"}}, {"time": "2025-05-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>8. Optika ja kvantmehaanika põhijooned.</B>  Valguse teke, levik ja neeldumine. Valguse peegeldumine, hajumine ja murdumine. Aine optiliste omaduste tulenevus elektrilistest. Valguse interferents, difraktsioon ja polarisatsioon. Valguse vastastikmõju ainega. Fotoefekt. Soojuskiirgus ja luminestsents. Laseri tööpõhimõte. Kvantmehaanika alused. Määramatuse seosed. Lainefunktsioon kvantmehaanikas. Osakeste tunnelleerumine. Kvantmehaanika tõlgendused. (6 h)"}}, {"time": "2025-05-27", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B> 4. kontrolltöö </B> teemal Optika, aatomifüüsika ja kvantmehaanika. Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud kõik Moodle'i proovikontrolltööd 4.1 kuni 4.4."}}, {"time": "2025-05-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>9. Molekulaarfüüsika ja termodünaamika.</B>  Temperatuur ja soojus. Soojusülekandeprotsessid. Aine agregaatolekud ja siirded nende vahel. Molekulaarkineetilise teooria alused. Ideaalgaas ja reaalgaas.  Termodünaamilised olekuparameetrid (p, V, T, S) ja energiad, seosed nende vahel. Termodünaamika printsiibid."}}]}, "registration_info": {"audience": {"et": "bak: loodus- ja reaalainete õpetamine põhikoolis, 1.a"}, "min_students": 5}, "parent_uuid": "d8d6267d-49b7-25bc-cdb2-31249425aaf0", "parent_code": "LOFY.01.091", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}