{"uuid": "d41209e2-2b9d-b4be-d1b6-d823a1e739eb", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-01T10:18:59", "title": {"en": "Management of Air Quality Monitoring", "et": "Õhu saasteseire korraldamine"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY05", "name": {"en": "Department of Bio and Environmental Physics", "et": "bio- ja keskkonnafüüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY05", "structural_unit_name": {"en": "Department of Bio and Environmental Physics", "et": "bio- ja keskkonnafüüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": false, "uuid": "6ca913be-e846-3e9c-3d23-59388413cdea", "code": "LOFY.05.024", "title": {"en": "Fundamentals of the Environmental Physics I", "et": "Keskkonnafüüsika alused I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-06T11:19:19"}, {"required": false, "uuid": "cee12330-4adc-57ae-1a5f-d507d77f0d18", "code": "LOFY.05.025", "title": {"en": "Fundamentals of the Environmental Physics II", "et": "Keskkonnafüüsika alused II"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Course: 1) gives overview of air pollution generation, classification and abatement tools, 2) deals with processes determining pollution distribution in atmosphere and pollution distribution modelling, 3) describes main methods for measurements of air pollution, 4) gives basic for creation of reasonable monitoring program.", "et": "Loengukursus annab ülevaate õhusaaste tekkimise, klassifitseerimise ja piiramise vahendite kohta; käsitleb saaste leviku protsesse atmosfääris, saastelevi modelleerimist; kirjeldab peamisi õhusaaste mõõtemeetodeid; annab alused otstarbeka seireprogrammi loomiseks."}, "objectives": [{"en": "Familiarize people with specific issues arising during management of air pollution, teach tools of monitoring air quality, prevention and mitigation of air pollution.", "et": "Keskkonna korraldamisel õhusaastega tekkivate spetsiifiliste probleemide tutvustamine, saaste jälgimiseks,\nennetamiseks ja vältimiseks vajalikke vahendeid valdavate inimeste koolitamine."}], "learning_outcomes": [{"en": "The student understands the difference of monitoring from scientific and other types of measurements. She/he knows the principal methods of measurement and modelling in air pollution monitoring and specific aspects of main pollutants and pollution source types; knows, how the weather conditions affect the air pollution transport. She/he has an overview on mechanisms and ways of reduction of anthropogenic air pollution.", "et": "Üliõpilane teab, mis eristab seiret teaduslikest ja muud liiki mõõtmistest. Tunneb mõõtmise ja mudelarvutuse põhimeetodeid õhu saasteseires, sh. erinevate põhiliste saasteainete ja saasteallika tüüpide käsitlemise spetsiifikat. Teab, kuidas ilmastikuolud mõjutavad õhusaaste levikut. Omab ülevaadet inimtekkelise õhusaaste  põhilistest tekkemehhanismidest ja vähendamise meetoditest."}], "notes": {"et": "E-õppeaine graafikus muudatusi ei ole. Juhul kui suuline eksam ettenähtud ajal ei ole võimalik, siis loon selleks kirjaliku võimaluse Moodle'is. Eksam seisneb jutustavates vastustes kahele küsimusele, sarnanedes põhiolemuselt testide B-osaga, kuid eksami sooritamisel Moodle'is tuleb üks katse ja  ajapiirang."}}, "grading": {"independent_work": {"et": "Referaat kas mingi Eesti asula/piirkonna õhusaaste olukorrast või teadusartikli põhjal, vt. https://moodle.ut.ee/course/view.php?id=1032"}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Suuline eksam ettevalmistusajaga (u. 1 tund), mille jooksul võib abimaterjale kasutada. Vastata kahele küsimusele ja vajadusel lisaküsimustele."}}], "grade_preconditions": {"et": "Kõigi testide ja iseseisva töö sooritamine, vt https://moodle.ut.ee/course/view.php?id=1032"}, "grade_evaluation": {"et": "Suulise eksami põhjal."}, "debt_elimination": {"et": "Eksami kordussooritus (mille põhjuseks võib olla kas mittepositiivne hinne või eksamile mitteilmumine) on võimalik üks kord enne semestri lõppu.\nKorduseksam tuleb sooritada hiljemalt järgmise semestri alguseks."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=1032", "is_moodle_connected": true, "learning_environments": [{"uuid": "e5328695-4b89-4a78-bfc5-e91f2bbd3915", "type": "MOODLE", "code": "LOFY.05.032", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "https://moodle.ut.ee/course/view.php?id=1032", "recommended_materials": "Vt. konspektis (https://moodle.ut.ee/course/view.php?id=1032) viidatud materjale!"}, "participants": {"lecturers": [{"person_uuid": "a73b4e44-5bd5-4501-b166-ec3eb53966c8", "person_name": "Marko Kaasik", "structural_unit": {"code": "LTFY20", "name": {"en": "Centre for Climate Research", "et": "kliimauuringute keskus"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "27.-34. n."}, "entries": [{"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Sissejuhatus<BR>\n Õhk - oluline keskkond ainete ringkäigus. Atmosfäär - ehitus, koostis, tähtsus maakerale, areng. Arengut mõjutanud tegurid - temperatuur, eluta looduse protsessid (vulkaanid, maavärinad), elu teke ja evolutsioon, inimühiskonna teke ja evolutsioon. Protsessid atmosfääris (kiirgusülekanne, keemilised muutused, tsirkulatsioon), inimese mõju nendele protsessidele. Üksikute atmosfääri koostisosade toime elusloodusele (eeskätt inimesele).\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Õhusaaste<BR>\nLooduslikud ja antropogeensed tekkemehanismid. Energia tootmine - peamiseid õhusaaste allikaid. Inimühiskonna areng - energiatarviduse kasvu rahuldamine fossiilkütuste abil. Alternatiivsed energiatarbe rahuldamise teed. Ökoenergia - uus võimalus inimkonna täitmatu energiaisu rahuldamiseks maakera stabiilsust ohustamata kompleksse säästliku lahenduse abil. Saastest põhjustatud regionaalsed ja lokaalsed probleemid - happevihmad, õhu saastatus inimasulais ja tööstuspiirkondades. Rahvusvahelised initsiatiivid õhusaastega võitlemiseks - kaugsaaste konventsioon ja selle osad (EMEP), saasteallikate inventariseerimine (CORINAIR), võitlus saaste vähendamiseks. Piirnormid saasteallikaile ja tekkivatele saastetasemetele. Paiksed ja liikuvad allikad. Inventariseerimise abil leitud erinevate inimtegevuste osakaalud õhusaastes. Transport - peamine õhusaaste allikas linnades. Puhastusseadmed - tsüklon, skraber, filtrid, elektriline sadestamine. Tehnoloogia muutmine kui olulisim saaste vähendamise võimalus.\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Õhusaaste levik<BR>\nAdvektsioon, turbulents, voolujooned, konvergents, divergents, tuule fluktuatsioonid, vaba atmosfäär, konvektsioonivoolud, konvektiivne turbulents, planetaarne piirkiht, pinnakiht, vertikaalne stratifikatsioon, piirkihi seisundi iseloomustamine - labiilne, neutraalne, stabiilne e. temperatuuriinversioon, turbulentse difusiooni koefitsient, gradient-ülekandeteooria, ülekandekiirus, Gaussi jaotusega saastelehvik, hajumisparameetrid.\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Saasteleviku modelleerimine<BR>\nSaaste leviku modelleerimise alused, põhimõtted, eesmärgid, vahendid, tulemused. Modelleerimise tulemuste kontroll, vastuvõtjale (receptor-oriented) ja allikale orienteeritud (source-oriented) mudelid, allika signatuur, vahendid mudelitele - faktor- ja klasteranalüüs. Kohaliku levi ja kauglevi mudelid, mikroskaala mudelid, õhuosakese trajektoor, meteoroloogiline prognoos, numbrilised meetodid, ajasammud, integreerimine, numbrilised häired. Järeldused modelleerimisest planeerimisse, igapäevatöödese. Saasteleviku soodustamise võimalused.\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Õhusaaste mõõtmise meetodid<BR>\nPidevatoimelised monitorid, aktiivne ja passiivne proovivõtt. Pidevatoimeliste optiliste mõõtemeetodite tutvustus näidete varal. Passiivsed kogujad - alternatiiv pidevale seirele? Aerosoolsaaste proovivõtt ja proovide laboratoorne analüüs. Mõõtemeetodi valik lähtuvalt saaste olekust (gaas, aerosool) ja saastetasemest. Mõõtmiste tundlikkus, võrreldavus, interkalibreerimised, mõõtemääramatus. Rahvusvahelised nõuded mõõtmiste kvaliteedile. Kvaliteedi tagamise programm.\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Kokkuvõte<BR>\nSeire - miks, mida, kuidas? Sotsiaalne ja poliitiline tellimus. Riskihinnang. Rahvusvahelised ja Eesti nõuded õhusaaste seirele. Eesmärkide selgitamine - NB! oluliseim osa. Pidev ja pisteline seire. Seiratavate parameetrite kasv teadmiste avardumisega. Algandmete analüüs enne seireprogrammi koostamist - emissioonid, meteoväljad, saastelevi. Eelnevate valdkondade süntees otstarbeka seireprogrammi koostamisel - praktiline skeem. Mõõtekohtade ja -parameetrite valik lähtuvalt algtingimustest. Piiravad tegurid - finantseerimine, mõõtepaikade valik, mõõtevahendite olemasolu.\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Teatada iseseisve töö (teema 7) foorumi kaudu referaadi teema: piirkonna nimi või artikli pealkiri.\nReferaat<BR>\nOma koduvalla, kodulinnaosa seireprogrammi koostamine referaadi vormis kasutades loengu, seminaride jm. materjale.<BR>\nVÕI<BR>\nKursuse veebilehele üleslaetud teadusartiklite hulgast vabalt valitud ühe refereerimine<BR>\nGrupeerumine lubatud, näidates selgelt iga inimese osa.\n<BR>"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Laadida teema 7 foorumi postituse lisana üles referaat.\nReferaat<BR>\nOma koduvalla, kodulinnaosa seireprogrammi koostamine referaadi vormis kasutades loengu, seminaride jm. materjale.<BR>\nVÕI<BR>\nKursuse veebilehele üleslaetud teadusartiklite hulgast vabalt valitud ühe refereerimine<BR>\nGrupeerumine lubatud, näidates selgelt iga inimese osa.\n<BR>"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "2fb393ab-3a07-e414-92b5-fd685c764c6c", "parent_code": "LOFY.05.032", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}