{"uuid": "5b59569d-7a47-9f69-134f-6664af1e00af", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T17:51:10", "title": {"en": "Electric Circuits", "et": "Elektriahelad"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY03", "name": {"en": "Department of Experimental Physics", "et": "eksperimentaalfüüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY03", "structural_unit_name": {"en": "Department of Experimental Physics", "et": "eksperimentaalfüüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 48, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 76, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course introduces the methods of describing of the linear DC and AC circuits. The following topics are covered: a) basic concepts of the theory of electric and magnetic circuits; b) design methods of the series-parallel electric circuits (Kirchhoff laws, superposition theorem, Norton and Thevenin equivalent circuits); c) methods for calculation of the parameters of series-parallel AC circuits; d) the frequency responses and quality factors of RLC-circuits; circuit coupling methods.", "et": "Aine tutvustab lineaarsete alalis- ja vahelduvvooluahelate kirjeldamise meetodeid. Käsitletakse elektri- ja magnetahelate teooria üldpõhimõtteid, hargneva elektriahela kirjeldamise meetodeid (Kirchhoffi seadused, voolude superpositsioon, Nortoni ja Thevenini ekvivalentskeemid), vahelduvvoolu jada- ning rööpahelate parameetrite arvutamist, RLC-ahela sageduskoste ja hüveteguri leidmist ning ahelate omavahelist sidestamist."}, "objectives": [{"en": "The course aims to bring the knowledge and practical experience of the computer engineering bachelor students to the level required for the completion of the electronics courses.", "et": "Viia arvutitehnika bakalaureuseõppe üliõpilaste teadmised ja oskused vooluringide talitluse valdkonnas elektroonika kursuste läbimiseks piisavale tasemele."}], "learning_outcomes": [{"en": "Upon completion of this course, the student should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Calculate the voltage, current, resistance and dissipated power on the series-parallel connected resistors in the DC networks using the voltage and current divider principles, equivalent circuit method and the concepts of electromotive force, internal resistance, load line and operating conditions.", "et": "1.\tOskab arvutada hargneva alalisvooluahela osade takistusi, neid läbivate voolude tugevusi, neil tekkivaid pingesid ja neil eralduvaid võimsusi, kasutades seejuures mõisteid pinge- ja voolujagur, ekvivalentne takistus, allika elektromotoorjõud ja sisetakistus, koormussirge, tööpunkt. "}, {"en": "2. Calculate the functional parameters in the series-parallel DC circuits which possess independent sources in several branches using various formalisms (Kirchhoff laws, superposition theorem, Norton and Thevenin equivalent sources); choose the most effective way of problem solving according to the geometry of the given circuit (number of nodes and branches) and the required goal of calculations (analysis of either the circuit in detail, or the dependence of the functioning of DC circuit on the load conditions).", "et": "2.\tOskab arvutada funktsionaalseid parameetreid hargnevates ahelates, millel on sõltumatud allikad mitmes harus, kasutades selleks erinevaid formalisme (Kirchhoffi seadused, voolude superpositsioon, Nortoni ja Thevenini ekvivalentskeemid), oskab valida tõhusaimat arvutusviisi tulenevalt ahela geomeetriast (sõlmede ja harude arv) ning arvutuse eesmärgist (detailne ahela analüüs või ahela toimimine koormuse suhtes)."}, {"en": "3.  Calculate the values of current in the different parts of the series-parallel AC circuits consisting of up to 4 components (R, L or C), calculate the voltage values on the certain components of these circuits and the power values dissipated in those components; draw the phasors of the AC circuits for which the complex impedance is given.", "et": "3.\tOskab arvutada voolutugevusi ja pingesid kuni nelja komponenti (R, L või C) sisaldava hargneva vahelduvvooluahela eri osades, oskab arvutada komponentides eralduvaid võimsusi, oskab joonistada etteantud komplekstakistusega vahelduvvooluahela faasordiagrammi."}, {"en": "4. Calculate the frequency responses and quality factors of series-parallel AC circuits; design the passive frequency filters (low-pass, high-pass and band-pass filters).", "et": "4.\tOskab leida vahelduvvoolu RLC jada- ning rööpahelate sageduskostet ja hüvetegurit, oskab koostada passiivseid sagedusfiltreid (madalpääs-, kõrgpääs- ning ribafiltreid)."}, {"en": "5. Optimize the AC circuit to reach the maximum power transfer (compensation of the reactance, use of the matching transformers etc)", "et": "5.\tOskab vahelduvvooluahelat koormuse kasuliku võimsuse suhtes optimeerida (reaktantsi kompensatsioon, koormuse sobitamine trafo abil)."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2025-03-12", "description": {"et": "Kontrolltöö toimumiskava teemade 1, 2 ja 3 osas (laeng, voolutugevus, pinge, takistus, juhtivus, aine eritakistus, selle sõltuvus temperatuurist, takistite jada- ning rööpühendus, pingejagur, voolujagur, vooluallikad, allika tühiseis ja lühis, elektrivoolu võimsus, allika kasulik võimsus, kasutegur, koormussirge, tööpunkt, maksimaalne võimsusülekanne). On võimalik saada kuni 15 punkti aine koguarvestuse 100-st, kontrolltöö soorituspiir on 7 punkti."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2025-04-02", "description": {"et": "Kontrolltöö toimumiskava teemade 4 ja 5 osas (Kirchhoffi seadused, pingegeneraator, voolugeneraator, kontuurvoolude meetod, sõlmpotentsiaalide meetod, superpositsiooniteoreem, Thevenin'i teoreem, Nortoni teoreem, täht- ja kolmnurklülitus, siire nende vahel alalisvoolu korral). On võimalik saada kuni 15 punkti aine koguarvestuse 100-st, kontrolltöö soorituspiir on 7 punkti."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2025-04-23", "description": {"et": "Kontrolltöö toimumiskava teemade 7, 8 ja 9 osas (mahtuvus ja induktiivsus, RC- ja RL-ahelad, vahelduvvoolu kirjeldamine, faasorid, impedants jada- ning rööpahela korral, vahelduvvoolu võimsus aktiiv ja reaktiivtakistuse üheaegsel esinemisel, võimsuskolmnurk ja võimsustegur). On võimalik saada kuni 15 punkti aine koguarvestuse 100-st, kontrolltöö soorituspiir on 7 punkti."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2025-05-21", "description": {"et": "Kontrolltöö toimumiskava teemade 10 ja 11 osas (pingeresonants, vooluresonants, hüvetegur, RC-, RL- ning RCL-ahelate sageduskoste, sidestatud vahelduvvooluahelad, trafo erinevates koormusrežiimides). On võimalik saada kuni 15 punkti aine koguarvestuse 100-st, kontrolltöö soorituspiir on 7 punkti."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "due_date": "2025-05-30", "description": {"et": "Esimene võimalus kirjutada eksamitööd, mis annab kuni 40 punkti aine koguarvestuse 100-st. Eksami positiivne hinne eeldab kõigi kolme väljundilise ülesande positiivset sooritust (poolte punktide saamist maksimaalsest võimalikust). Eksamitöö kui terviku soorituspiiri ei ole."}}], "grade_preconditions": {"et": "Kõigi nelja praktikumitöö sooritamine."}, "grade_evaluation": {"et": "Positiivse hinde saamiseks tuleb:\na) sooritada eraldi positiivsele hindele kõik neli kontrolltööd (saada vähemasti  7 punkti maksimaalselt võimalikust 15 punktist)  ja  \nb) sooritada eraldi positiivsele hindele eksamitöö kolm esimest väljundilist ülesannet:  RLCR-ülesanne, võimsusteguri parandamise ülesanne ja sobitustrafo ülesanne. Positiivse hinde piiriks neis ülesannetes on vähemasti poolte punktide saamine maksimaalsest võimalikust. \nLõpphinde taseme (A, B, C, D või E) määrab kõigi kontrolltööde ja eksamitöö üldine punktisumma, millele lisanduvad aktiivsuspunktid õppejõu poolt loengus antud lisaülesannete iseseisva lahendamise eest."}, "debt_elimination": {"et": "Kuni semestri arvestusliku lõpuni."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "0d7a7c3d-4a45-4219-8d8c-894645600a34", "type": "MOODLE", "code": "LOFY.03.007", "base_url": "undefined", "linked_to_groups": ["b1a58fb0-5730-7f36-8423-ea1e6d98435f", "2a29e07e-309e-8f28-8ea0-111a67a149bd", "aa9a0d12-2acf-77e6-bbcc-568a170b0c0d", "c3734ca7-b4f0-300c-c03c-49bc4c1e9197"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1. Introduction to Electric Circuits. 8th ed. Herbert W. Jackson, Dale Temple, Brian E. Kelly. Oxford University Press, 2008. (põhiõpik)", "recommended_materials": "2. Elektromagnetism. Õpik gümnaasiumidele. K.Tarkpea, H.Voolaid. EFS ja kirjastus Maurus, 2012.  http://kirjastusmaurus.ee/oppematerjalid/elektromagnetism/\n3. C.R.Robertson. Fundamental Electrical & Electronic Principles. Newnes, 2001.\n4. Elektrotehnika I, Alalisvooluahelad / Lars Bengtson, Lars Bergström, Ingemar Ewaldz, Ewa Milthon, Lars Nordlund, Evald Soomägi; tõlkinud Evald Soomägi / Partille : Natura Läromedel; Tallinn: Natura-E, 1993\n5. Füüsika põhikursus. Teine köide. 8. väljaanne, David Halliday, Robert Resnick (koostaja: Jearl Walker)  (Originaalpealkiri: Fundamentals of physics.) Eesti Füüsika Seltsi Kirjastus 2012."}, "participants": {"lecturers": [{"person_uuid": "6b898bfb-c911-e064-07a8-4572a9a0ea6f", "person_name": "Agu Anijalg", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"Reede II": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "Esmasp": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "Reede I": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "Kolmap": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"Reede II": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "Esmasp": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "Reede I": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "Kolmap": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}], "study_groups": [{"uuid": "b1a58fb0-5730-7f36-8423-ea1e6d98435f", "code": "Esmasp", "max_size": 14}, {"uuid": "c3734ca7-b4f0-300c-c03c-49bc4c1e9197", "code": "Kolmap", "max_size": 14}, {"uuid": "aa9a0d12-2acf-77e6-bbcc-568a170b0c0d", "code": "Reede I", "max_size": 15}, {"uuid": "2a29e07e-309e-8f28-8ea0-111a67a149bd", "code": "Reede II", "max_size": 14}]}, "schedule": {"weeks": {"et": "24.-39.n. 4L, 2S n-s => E"}, "entries": [{"time": "2025-02-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>NB!</B> Kuna põhiõpik on ingliskeelne, siis on eestikeelsete terminite taga ümarsulgudes ära toodud ingliskeelsed vasted. \n<B>1. Sissejuhatus. </B> Elektrilaeng (charge) ja voolutugevus (current). Ühikud: amper ja kulon.  Potentsiaal ja pinge (voltage). Elektromotoorjõud (EMJ, electromotive force, EMF). Ühik volt. Elektrivoolu suund. Juhid (conductors), dielektrikud ehk mittejuhid (insulators) ja pooljuhid (semiconductors). Elemendid (cells), patareid (batteries) ja teised pingeallikad (voltage sources). Pingeallika/vooluallika mahutavus. Ühik ampertund [Ah]."}}, {"time": "2025-02-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>2. Ohmi seadus ja takistus. Elektrivoolu töö ja võimsus. </B> \nTakistuse (resistance) sõltuvus juhi pikkusest ja ristlõikepindalast. Eritakistus (resistivity).  Takistuse sõltuvus temperatuurist. Takistuse temperatuuritegur. Lineaarsed ja mittelineaarsed takistid (resistors). Takistite värvikood. Muudetavad takistid (variable resistors). Voltamperkarakteristikud (voltage-current characteristics). Töö ja energia. Võimsus (power). Ühik kilovatt-tund [kWh]. Elektrivoolu soojuslik toime. Allika sisetakistus (internal resistance). Pingeallika tühiseis ja lühis. Pingejagur (voltage-divider) ning voolujagur (current-divider). Maksimaalne võimsusülekanne."}}, {"time": "2025-02-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>3. Jada- ja rööpahelad </B> (series and parallel circuits). <B> Segaahelad </B> (series-parallel circuits). Takistite jadaühendus. Pingelangud takistitel. Kirchhoffi pingeseadus (voltage law). Elemendid jadamisi.  Takistid rööbiti. Juhtivus (conductance) ja aine erijuhtivus (conductivity). Rööpahela karakteristikud. Elemendid rööbiti. Takistite segaühendus. Ekvivalentvoolude meetod. Kirchhoffi seaduste meetod. Elementide segaühendus."}}, {"time": "2025-03-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>4. Alalisvoolu takistusvõrgud </B> (resistance networks). Täht- ja kolmnurklülitus, siire nende vahel (delta-wye transformation). Pingegeneraatorid (constant-voltage sources) ja voolugeneraatorid (constant-current sources). Kirchhoffi vooluseadus ja pingeseadus. Superpositsiooniteoreem."}}, {"time": "2025-03-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B> 5. Ekvivalentahelate teoreemid. </B> Thevenin'i teoreem. Nortoni teoreem. Pinge- ja voolugeneraatori omavaheline vahetatavus. Kontuuride meetod (loop procedure). Mitme allikaga ahelad (multisource networks). Kontuurvoolude meetod (mesh analysis). Sõlmpotentsiaalide meetod (nodal analysis). Ettevalmistus kontrolltööks ekvivalentahelal baseeruvate arvutusvõtete kasutamise peale (2. kontrolltöö)."}}, {"time": "2025-03-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>6. Magnetväli ja magnetahelad. </B> Magnetväli juhtme ümber. Magnetvoog (magnetic flux) ja magnetomotoorjõud (magnetomotive force, MMF). Magnetiline takistus ehk relaktants (reluctance). Magnetiline juhtivus ehk permeants (permeance). Aine magnetiline läbitavus (permeability). Magnetinduktsioon B ehk magnetvoo tihedus (magnetic flux density). Magnetvälja tugevus H.  Puistevoog (leakage flux). Magnetilised jada- ja rööpahelad. Õhuvahed (air gaps)."}}, {"time": "2025-04-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Mahtuvus ja induktiivsus. </B> Elektriväli ja dielektrikud. Mahtuvus C (capacitance). Kondensaatorid (capacitors). Kondensaatori mahtuvust määravad suurused.  Faraday induktsiooniseadus. Lenzi reegel. Endainduktsioon ja induktiivsus L (inductance). Induktiivsust määravad suurused. Elektrivälja energia kondensaatoris. Voolu sisse- ja väljalülitamine induktoris. Magnetvälja energia induktoris."}}, {"time": "2025-04-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>8. Vahelduvvool ja faasorid. </B> Vahelduvpinge sinusoidaalne muutumine. Pinge amplituudväärtus (peak value) ja hetkväärtus (instantaneous value). Voolutugevuse ja võimsuse hetkväärtused takisti korral, nende ajalised keskmised. Pinge ja voolutugevuse efektiivväärtused (RMS values). Reaktiivtakistus ehk reaktants (reactance). Induktiivtakistus (inductive reactance) ja mahtuvustakistus (capacitive reactance), neid mõjutavad suurused. Faasinihked. Hetkväärtuste liitmine. Vahelduvvoolu kirjeldamine faasorite (phasors) abil. Faasorsuuruste geomeetriline liitmine. Kompleksmeetod opereerimiseks faasorsuurustega. Faasorsuuruste omavaheline lahutamine, korrutamine ning jagamine."}}, {"time": "2025-04-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>9. Impedants ja vahelduvvoolu võimsus. </B> Aktiiv-, induktiiv- ja mahtuvustakistus jadamisi ning rööbiti. Vahelduvvvooluahela kogutakistus ehk impedants (impedance). Impedants jada- ning rööpahela korral. Võimsus aktiivtakistuse korral. Võimsus ideaalses induktoris ja kondensaatoris. Võimsus aktiiv ja reaktiivtakistuse üheaegsel esinemisel. Võimsuskolmnurk ja võimsustegur (power factor, cos 'fii'). RLCR eksamiülesande versioonid. Eksamiülesande näidislahendus."}}, {"time": "2025-04-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>10. Vahelduvvool resonantsetes vooluahelates. </B> Pingeresonants RLC-jadaahelas (series resonance). Resonantskõver, hüvetegur (quality factor), ahela sageduskoste (selectivity). Vooluresonants RLC-rööpahelas (parallel resonance)."}}, {"time": "2025-04-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>11. Resonantsete vooluahelate kirjeldamine. </B> (resonant circuits). Ahela piirsagedused ja läbilaskeriba. Hüvetegur kahe pinge, kahe takistuse ja kahe sageduse suhtena. Ahela lainetakistus. Trafo (transformer) üldine tööpõhimõte."}}, {"time": "2025-05-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>11. Sidestatud vahelduvvooluahelad </B> (coupled circuits). Trafo ülekandearv (transformation ratio). Trafo kasutegur (efficiency). Koormamata trafo (open-circuit), koormatud (loaded) trafo ja lühistatud trafo (short-circuit). AC/DC adapteri trafo eksamiülesanne. Trafosidestus."}}, {"time": "2025-05-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>12. Reaktantsi kompensatsioon. </B> Võimsusteguri parandamise demokatse. Reaktantsi kompensatsiooni eksamiülesande näide. Täiendava kondensaatori ühendamine induktoriga rööbiti ning jadamisi."}}, {"time": "2025-05-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>13. Ahelateoreemid vahelduvvooluahelates </B> Impedantsete koormuste jada-, rööp- ja segaühendus vahelduvvooluahelas. Kirchhoffi seadused vahelduvvooluahelas. Thevenin'i teoreem. Nortoni teoreem. Täht- ja kolmnurklülitus, siire nende vahel (delta-wye transformation)."}}, {"time": "2025-05-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Eksamitöö konsultatsioon. </B> Viimane loenguaeg sisustatakse seminariga eksamitöö ülesannete teemal."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Seminarid. </B> Seminarides (tahvlipraktikumides) igal kolmapäeval kell 14-16 lahendatakse ülesandeid juba läbitud materjali ulatuses. Seminaride ajal tehakse ka kontrolltöid."}}]}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 57}, "parent_uuid": "e29a64ac-ff31-e8f8-c095-4c34fd8214b4", "parent_code": "LOFY.03.007", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}