{"uuid": "ae10998f-5225-225d-2f29-28b3342e430a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-03T15:26:53", "title": {"en": "Dosimetric and Scintillation Materials", "et": "Dosimeetrilised ja stsintillatsioonmaterjalid"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The evolution of energetic and radiation technologies, the increased requests for radiation safety as well as the handling of fundamental physical problems demand the improvement of the existing and the elaboration of new dosimetric and scintillation materials. General concepts of the detection and dosimetry of various types of radiation with the implementation of solid-state materials are considered. Optical and electrical processes in wide-gap materials and the interaction mechanisms of materials with photons and heavy or light particles are considered on the basis of quantum-mechanical models of solids. Using the best concrete dosimetric and scintillation materials as an example, the function mechanisms and the main applications of these materials in various fields of technology, medicine and ecology are analyzed. Several unsolved problems and promising elaborations of novel materials are discussed.", "et": "Energeetika ja uute kiiritustehnoloogiate areng, kiiritusohutuse nõuete kasv, füüsika fundamentaalprobleemide lahendamine jms. nõuavad olemasolevate dosimeetrite ja stsintillatsioonmaterjalide täiustamist ning uute väljatöötamist. Käsitletakse mitmete kiiritustüüpide tahkismaterjalide abil detekteerimise ja dosimeetria üldpõhimõtteid. Tuginedes tahkiste kvantmehaanilistele mudelitele vaadeldakse optilisi ja elektrilisi protsesse laia keelutsooniga materjalides, samuti footonite, kergete ja raskete osakeste vastastikmõju (interaktsiooni) mehhanisme materjalidega. Parimate konkreetsete dosimeetrite ja stsintillaatorite näidetel analüüsitakse nende funktsioneerimise mehhanisme ja põhilisi kasutusi tehnika, meditsiini ning ökoloogia valdkonnas. Vaadeldakse aktuaalseid veel lahendamata küsimusi ja uute materjalide väljatöötamise perspektiive."}, "objectives": [{"en": "The present lecture course concerns an important and rapidly developing division of modern material science. For a long time a search for and the elaboration of novel scintillation and dosimetric materials, needed for the applications in energetics, medicine, ecology, geology etc., have been performed in Estonia (Institute of Physics, University of Tartu) in close collaboration with German, Czech and Russian scientists.", "et": "Käesolev loengukursus puudutab kaasaegse materjaliteaduse uut ja kiireltarenevat haru. Juba pikka aega on Eestis (Tartu Ülikooli Füüsika Instituudis) tihedas koostöös saksa, tšehhi ja vene teadlastega toimunud uute stsintillatsioon- ja dosimeetriliste materjalide otsing ja väljatöötamine energeetika, meditsiini, ökoloogia, geoloogia jpt rakenduste tarbeks."}], "learning_outcomes": [{"en": "Output (minimal level for a positive mark).\n\nThe student who has passed the course:\n- knows the optical phenomena of solids (with the stress on different types of luminescence), energy structure of wide-gap dielectrics, structural lattice defects (mainly, nanosize/point defects); \n- knows optical characteristics of luminescence centres in solids and reasons of their difference from the case of a free atom, processes of energy transfer to luminescence centres by excitons and electron-hole pairs;\n- knows the processes of electron, proton/neutron or heavy ion interaction with solids, general evolution scheme of electronic excitations at the detection of high-energy particles/quanta;\n- knows the function principles of classic (NaI:Tl) and novel fast scintillators, their main characteristics and applications for high-energy physics, medicine etc.;\n- knows the principles of highly sensitive TSL and PSL dosimetry and dosimrtry of heavy ion tracks, the applications of these dosimeters for the detection of alpha-, beta- and gamma-rays, thermal and fast neutrons;\n- the obtained knowledge allows to participate at the investigation, elaboration and improvement of novel scintillators (fast and ultra-fast) and dosimetrs (incl. for selective detection of fast (~MeV) neutrons).", "et": "Kursuse positiivsele hindele läbinud üliõpilane:\n- tunneb optilisi nähtusi tahkistes (rõhuasetusega luminestsentsi eritüüpidele); laia keelutsooniga dielektrikute energeetilist struktuuri; kristallstruktuuri defekte (põhiliselt nanomõõtmelisi/punktdefekte);\n- tunneb luminestsentsitsentrite optilisi karakteristikuid laia keelutsooniga kristallides ning mõistab, miks nad erinevad vabade aatomite omadest; teab eksitonide ja elektron-aukpaaride poolt luminestsentsitsentritele energia ülekandmise protsesse; \n- teab elektronide, neutronite/prootonite ja raske ioonide ning tahkise vastasmõju protsesse; teab suurte energiatega osakeste ja kvantide detekteerimisel toimuva elektronergastuste evolutsiooni üldskeemi;\n- teab klassikaliste (NaI:Tl) ning uute kiirete stsintillaatorite tööprintsiipe, nende peamisi karakteristikuid ning nende kasutamist kõrgete energiate füüsikas, meditsiinis jm;\n- tunneb tundliku TSL ja PSL dosimeetria ning raskete osakeste trekidosimeetria põhimõtteid, teab nende dosimeetrite rakendusi alfa-, beta- ja gamma-kiirte ning soojuslike ja kiirte neutronite detekteerimisel.\n- on omandanud teadmised, mis lubavad osaleda uute kiirete ja ülikiirete stsintillaatorite ja dosimeetrite (k.a. kiirete ~MeV neutronite detekteerimiseks mõeldud) uurimisel, väljatöötamisel ja täiustamisel."}], "notes": {"et": "Ainet loetakse üle aasta!"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Suuline eksam kogu loengukursuse ulatuses. Vastuste täpsus ja korrektsus."}}], "grade_preconditions": {"et": "Registreerumine kursuse kuulajaks."}, "grade_evaluation": {"et": "Hinne kujuneb suulisel eksamil saadavate punktide põhjal."}, "debt_elimination": {"et": "Korduseksami peab sooritama hiljemalt järgneva semestri alguseks.\nKorduseksami tähtaega võib dekaan õppejõu taotlusel pikendada kuni 2 nädala võrra - vastavalt TÜ Õppekorralduseeskirjale\n\nEnd of the semester or in the beginning of next semester durig the first two weeks."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Elektroonoiline loengukonsekt, A.  Luštšik", "recommended_materials": "Õppejõu poolt loengus pakutud materjalid"}, "participants": {"lecturers": [{"person_uuid": "d342cf33-36ef-f025-e218-7f0b23068e28", "person_name": "Aleksandr Luštšik", "structural_unit": {"code": "LTFY06", "name": {"en": "Laboratory of Physics of Ionic Crystals", "et": "ioonkristallide füüsika labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-31.n. 4 L n-s  = E"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {"et": "materjaliteadus: mag, dokt; füüsika: mag, dokt"}, "min_students": 5, "max_students": 25}, "parent_uuid": "e2fb083b-b14f-ff41-4c67-3198fb2cc2ea", "parent_code": "LOFY.02.023", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}