{"uuid": "b3c731ae-aa0a-7a8c-fe79-dcc188146f95", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T22:29:24", "title": {"en": "Physics and Engineering", "et": "Füüsika ja tehnika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 3, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "25/26 A regular part 1 3 CP LT", "et": "25/26 S PÕ 1. osa 3 EAP LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 34, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is targeted to the quick and efficient introduction of the main principles of the current physics (matter and field, fermions and bosons, absolute speed, energy minimum, etc.), whereas the previous knowledge in physics is not required. In most important cases, the examples are illustrated considering the application of the mathematical methods in physics (differentiation, integration, complex numbers). The students also learn to explain the operating principles of selected technical devices applying physical terminology in a correct way.", "et": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse vastavalt vajadusele markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud), taotlemata käsitluse üldist matemaatilist rangust. Üliõpilased õpivad ka seletama valitud tehniliste seadmete tööpõhimõtet, kasutades korrektselt füüsika termineid."}, "objectives": [{"en": "The main goal of the course is to introduce the role of physics in the generation of the individual's personal concept of the world and to explain the fundamental physical principles of modern technologies.", "et": "Tutvustada füüsika rolli indiviidi isikliku maailmapildi kujundamisel ja kaasaegse tehnoloogia füüsikalisi alusprintsiipe."}], "learning_outcomes": [{"en": "Upon completion of this course, the student should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Express the basic principles of the physical concept of the world (such as atomistic principle, energetic minimum, absolute speed, wave-particle dualism, uncertainty principle), and refer to their exertion;", "et": "1. Oskab väljendada füüsikalise maailmapildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;"}, {"en": "2. Use the vocabulary introduced at the lectures to explain the basic principles of some high-tech devices applying physical terminology in a correct way;", "et": "2. Oskab loengute kavas toodud mahus selgitada valitud kõrgtehnoloogiliste seadmete tööpõhimõtet, kasutades korrektselt füüsika termineid;"}, {"en": "3. Possess the knowledge considering the mathematical background and calculus necessary for the description of physical processes (e.g., graphical representations, differentiation and integration, application of complex numbers), and recognize the main attributes and occurrence conditions of main functions present in physics (e.g., linear, power, exponent, harmonic);", "et": "3. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);"}, {"en": "4. Calculate the current values in the different parts of AC and DC circuits, the voltage values on the certain components of these circuits and the power values generated in those components; draw the phasors of the AC circuits with the given parameters;", "et": "4. Oskab arvutada voolutugevusi hargnevate alalis- ja vahelduvvooluahelate eri osades, arvutada pingeid nende ahelate konkreetsetel komponentidel ja neis komponentides eralduvaid võimsusi; oskab joonistada etteantud parameetritega vahelduvvooluahela faasor-diagrammi;"}, {"en": "5. Know the basic definitions belonging to the modern physical and technological concept of the world within the limits of the vocabulary (30 pages of A4 format) available on the web page of the course;", "et": "5. Tunneb kaasaegse füüsikalis-tehnoloogilise maailmapildi põhimõisteid aineveebis toodud põhivaraga (30 A4 lehekülge) määratletud tasemel;"}, {"en": "6. Solve the physical problems within the limits of example exercises available via the web support of the course.", "et": "6. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel."}], "notes": {"et": "Täiendavaid võimalusi kontrolltööde ja arvestustöö sooritamiseks pakutakse jaanuaris 2025."}}, "grading": {"independent_work": {"et": "Sisalduvad aine Moodle'i pesas https://moodle.ut.ee/course/view.php?id=13788"}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kahe kontrolltöö positiivne sooritus (saadud vähemasti pooled punktid maksimaalsest võimalikust)."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik arvestustöö: põhivara tundmise test ja vahelduvvooluahela (RLC) ülesanne."}}], "grade_preconditions": {"et": "Tehakse 2 kontrolltööd ja arvestustöö, mille hinded summeeruvad aine 2. osa lõpul saadavasse koondhindesse. Esimene kontrolltöö annab kuni 15% ja teine kuni 20% aine koondhindest. Kuni 10% annab arvestustöö, mis koosneb elektromagnetismi põhivara testist ja vahelduvvooluahela (RLC) ülesandest. Aktsepteeritakse samas aines kahel varasemal aastal sooritatud kontrolltööde tulemusi (varasema tervikliku aine 1. ja 3. kontrolltöö). Siiski kehtib kõigile aine 1. osa läbijatele arvestustöö positiivse soorituse nõue (5 või enama punkti saamine kümnest). \nMistahes kirjaliku kontrollivormi sooritamisel on lubatud kasutada ise valmistatud valemite lehte, mis tohib sisaldada ainult valemeid, mitte seletavaid sõnu ega jooniseid. Nõutav on selline materjalis orienteerumise oskus, mis võimaldab vajalikku valemit ilma lisaselgitusteta ära tunda. Peast tuleb teada valemites sisalduvate märkide tähendust, mitte valemeid endid."}, "grade_evaluation": {"et": "Kaks positiivselt sooritatud kontrolltööd ja arvestustöö aine 1. osa lõpul. Esimest kontrolltööd hinnatakse maksimaalse 15 punkti ja teist kontrolltööd 20 punkti süsteemis. Kuni 10 punkti annab arvestustöö. Arvestuse saamiseks aine 1. osa eest on vajalik mõlema kontrolltöö ja arvestustöö positiivne tulemus ehk vähemasti poolte punktide saamine maksimaalsest võimalikust."}, "debt_elimination": {"et": "Lisaks ametlikele toimumisaegadele (N, 07.11 ja N, 05.12) on kontrolltöid võimalik sooritada 9.-16. nädalal reedeti kell 8.15 kuni 10.00 Physicumi ruumis A101 või A106 (kui ruumis A101 jääb kitsaks). Sügisel 2024 on vastavad päevad 01.11, 08.11, 15.11, 22.11, 29.11, 06.12, 13.12 ja 20.12. Kontrolltöö toimumise tingimused ja hindamine ei sõltu soorituskatse toimumise ajast."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/fjt/", "is_moodle_connected": false, "mandatory_materials": "1. I.Peil, K.Tarkpea. Füüsikalise looduskäsitluse alused.  https://opik.fyysika.ee/index.php/book/view/17\n2. Veebi <a href=\"https://sisu.ut.ee/fjt/\">https://sisu.ut.ee/fjt/</a> linkidest avanevad allikad.", "recommended_materials": "1. K.Tarkpea, H.Voolaid. Elektromagnetism. https://opik.fyysika.ee/index.php/book/view/15\n2. M. Reemann. Energia. Kirjastus Maurus ja EFS, 2014. https://opik.fyysika.ee/index.php/book/view/40"}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "fada9680-e099-a791-1a27-6d7199fa1c6d", "person_name": "Kuno Kooser", "structural_unit": {"code": "LTFY15", "name": {"en": "Laboratory of Atmospheric and Environmental Sciences", "et": "atmosfääri- ja keskkonnateaduste labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "6-16. 2L ja/või 2S (vt ajakava) n-s, 2 knt => A"}, "entries": [{"time": "2024-10-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>1. Sissejuhatus. </B> Aine läbimise tingimused ja hindamine. Maailm, loodus ja füüsika. Füüsika, teised loodusteadused ja insenerikoolitus."}}, {"time": "2024-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>2. Vaatleja ning füüsika. </B> Sündmused ja protsessid, aeg ja ruum, aine ja väli. Nähtavushorisondid looduses. Füüsikalised objektid ja füüsikalised suurused. Keha asukoht, asend ja kuju. Liikumisvormid: translatsioon, rotatsioon, deformatsioon, ostsillatsioon. Vastastikmõjud, jõud ja laeng."}}, {"time": "2024-10-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>3. Füüsika uurimismeetodid. </B> Loodusteaduslik meetod. Eksperiment ja teooria. Seaduspärasused ja seadused. Mõõtmine ja mõõtühikud. SI süsteem. Mõõtemääramatus. Füüsikalised mudelid."}}, {"time": "2024-10-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>4. Füüsikalised suurused kui mudelid. </B> Skalaarsed ja vektoriaalsed suurused. Kiirus, kiirendus, mass ja impulss. Töö, energia ja võimsus."}}, {"time": "2024-10-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>5. Füüsika seos matemaatikaga. </B> Põhjuslikkus looduses ja funktsioonid matemaatikas. Ajaline tuletis ja integraal. Ajalise tuletise operaator."}}, {"time": "2024-10-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>6. Füüsika üldprintsiibid. </B> Atomistika ja energia minimiseerumine. Süsteemi seoseenergia. Tõrjutusprintsiip, absoluutkiiruse printsiip, dualismiprintsiip, lõtkuprintsiip."}}, {"time": "2024-10-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Alusosakeste Standardmudel. </B> Plancki konstant. Põhivastastikmõjud. Massi ja energia samaväärsus. Fermionid ja bosonid, kvargid ja leptonid."}}, {"time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Alusosakeste Standardmudel. </B> Impulsimoment. Poolarvuline ja täisarvuline spinn. Bosoni kiirgamine ja neelamine fermioni poolt. Newtoni seadused pöördliikumisel. Jõumoment ja inertsimoment."}}, {"time": "2024-11-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Seminarid. </B> Valmistumine kontrolltööks teemal \"Füüsika üldmudelid ja üldprintsiibid, ühikute teisendamine ja füüsikalised suurused.\""}}, {"time": "2024-11-07", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B> 1. kontrolltöö </B> Füüsika üldmudelid ja üldprintsiibid, ühikute teisendamine ja füüsikalised suurused. Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud kõik Moodle'i proovitestid 1.1 kuni 1.4."}}, {"time": "2024-11-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>8. Elektromagnetismi põhimõisted. </B> Elektrilaeng ja voolutugevus. Ühikud amper ja kulon. Elektrivälja tugevus ja pinge. Ühikud volt ja volt meetri kohta (1 V/m). Coulomb'i seadus."}}, {"time": "2024-11-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>9. Vooluringi talitlemine. </B> Ohmi seadus. Takistus ja eritakistus. Elektriline võimsus. Allika elektromotoorjõud (EMJ) ja sisetakistus. Takistuse sõltuvus temperatuurist."}}, {"time": "2024-11-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Seminar vooluringide teemal. </B> Keemilise vooluallika tööpõhimõte. Laetavad ja mittelaetavad allikad. Maksimaalne energiaülekanne vooluringis. Koormussirge."}}, {"time": "2024-11-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>10. Magnetvälja kirjeldamine. </B> Püsimagnet ja vooluga juhe. Ampere'i seadus. Suurused B ja H. Magnetvoog. Ühikud tesla ja veeber. Homogeenne väli kondensaatoris ja juhtmepoolis."}}, {"time": "2024-11-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>11. Elektromagnetiline induktsioon. </B> Lorentzi jõud. Faraday induktsiooniseadus. Endainduktsioon. Maxwelli võrrandid (ainult sõnalised formuleeringud)."}}, {"time": "2024-11-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>12. Elektrivälja ja magnetvälja võrdlus. </B> Mahtuvus ja induktiivsus. Ühikud farad ja henri. Elektromagnetvõnkumised. Elektromagnetlained."}}, {"time": "2024-12-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Seminar. </B> Valmistumine kontrolltööks teemal \"Elektromagnetism\". Võimalus esitada küsimusi seni õpitu kohta."}}, {"time": "2024-12-05", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B> 2. kontrolltöö </B> Elektromagnetism. Osalema on oodatud vaid üliõpilased, kes on kontrolltööks piisavalt valmistunud, see tähendab - läbi teinud kõik Moodle'i proovitestid 2.1 kuni 2.4."}}, {"time": "2024-12-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>13. Vahelduvvoolu kirjeldamine. </B> Vahelduvvool kui laengukandjate võnkumine. Voolutugevuse ja pinge efektiivväärtused. Aktiiv- induktiiv- ja mahtuvustakistus. Faasorid ja faasinihked suuruste vahel."}}, {"time": "2024-12-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>14. Vahelduvvoolu võimsus. </B> Vahelduvvoolu võimsuskolmnurk ja võimsustegur. Vahelduvvoolu demokatse ja selle analüüs."}}, {"time": "2024-12-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B> Seminar. </B> Vahelduvvooluahela (RLC) arvestusliku ülesande lahendamise harjutamine. ."}}, {"time": "2024-12-19", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>Teadmiste ja oskuste kontroll. </B> Esimene võimalus sooritada arvestustööd, mis koosneb elektromagnetismi põhimõistete tundmise testist ja vahelduvvooluahela (RLC) ülesandest. Sama tööd on võimalik sooritada ka 20.12 hommikul."}}]}, "registration_info": {"audience": {"et": "arvutitehnika eriala kohustuslik aine"}, "min_students": 5}, "parent_uuid": "d9c042dc-c235-4ed6-9c9a-9ba4e3ba4056", "parent_code": "LOFY.01.121", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}