{"uuid": "5c297742-65a3-b9c4-bb17-e4b41fbd7996", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-30T11:50:24", "title": {"en": "Physics of Solid Materials", "et": "Tahkismaterjalide füüsika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Optical, electrical and magnetic phenomena have been considered in various types of solids: dielectrics, semiconductors, metals, glasses and nanostructures. General overview of electronic excitations, vibration spectra as well as point, one-dimensional and surface lattice defects has been given. Particulat attention is given to: peculiarities of neutral and charged quasi-particles in wide-gap solids; processes of the migration, self-trapping and multiplication of quasi-particles; decay of electronic ecxitations with the creation of lattice defects in ionic crystals. The modern marcoscopic and atomic-scale investigation methods of material structure; the methods of growing of single crystals, ceramics, epitaxial layers and needle-shape crystals have been considered. The concepts of material modification by means of mechanical, thermal, laser and radiation techniques have been discussed. The usage of wide-gap materials for various medical, ecological technical applications as laser materials, spectral transformers for luminescent lamps and devices, electronics components, radiation-resistant materials, detectors and dosimeters of various kinds of radiation, memory devices, various sensors and catalytic agents have been considered.", "et": "Kursuses vaadeldakse optilisi, elektrilisi ja magnetilisi nähtusi dielektrikutes, pooljuhtides, metallides, ülijuhtides, klaasides ja nanostruktuurides. Antakse ülevaade elektronergastustest, võnkespektritest, punkt- joon- ja pinnadefektidest. Vaadeldakse tänapäevaseid materjalide struktuuri uurimise meetodeid makroskoopilisel ja aatomite tasemel, kristallide kasvatamise mehhanisme, keraamikate ja epitaksiaalkilede valmistamist, niitkristalle. Tutvustatakse materjalide modifitseerimise aluseid mehaaniliste, soojus-, laser- ja kiirgustehnoloogiate abil, materjalide rakendamist lasertehnikas, valgusallikates, optilistes sidekanalites, kiirguse detekteerimisel ja dosimeetrias, ökoloogilises seires, meditsiinis jne. Kursus põhineb tahkiste teoorial, kuid jääb poolkvantitatiivseks. Aine on mõeldud fundamentaalfüüsika ja rakendusfüüsika suuna üliõpilastele."}, "objectives": [{"en": "The main goal of the present course is the training of specialists with the background in the variety of physical phenomena and their applications in solids of different types   rapidly developing division of modern material science.", "et": "Antud kursuse põhieesmärgiks on vaadelda mitmesuguseid füüsikalisi nähtusi ja nende rakendusi erinevat tüüpi tahkismaterjalides ning kaasaegse kiirelt areneva materjaliteaduse spetsialistide koolitamine."}], "learning_outcomes": [{"en": "Upon completion of the course the student will have general notion about: ", "et": "Peale kursuse materjalidega tutvumist on tudengil põhiline ettekujutus:"}, {"en": "*\tcrystal structure and experimental methods of its determination; types of close packing; main types of crystal binding;", "et": "*\tkristallistruktuurist ja selle uurimise meetodeist, tihedaima pakenduse tüüpidest, kristallide seoste põhitüüpides;"}, {"en": "*\tintrinsic and impurity point defects; dislocations and their investigation methods; main methods of crystal growing;", "et": "*\tvõre oma- ja lisand-punktdefektidest, dislokatsioonidest ja nende vaatlemise meetodeist, laia keelutsooniga materjalide kasvatamise meetodeist;"}, {"en": "*\tvibration spectrum for mono- and multiatomic chains, different experimental methods for detection of phonon spectra; ", "et": "*\tühemõõtmeliste ühe- ja mitmeaatomiliste ahelate võnkespektrist, kristallide võnkespektrite registreerimise eksperimentaalmeetodeist;"}, {"en": "*\toptical characteristics of impurity luminescence centres in wide-gap materials, Franck-Condon approximation, thermal quenching and nonradiative transition, zero-phonon lines and hot luminescence, the use of impurity luminescence for applications;", "et": "*\tluminestsentsitsentrite optilistest karakteristikutest laia keelutsooniga kristallides, Franck-Condoni lähendusest, termilisest kustumisest ja kiirguseta üleminekuist, foononvabadest joontest ja kuumast luminestsentsist, lisandluminestsentsi rakendustest;"}, {"en": "*\tenergy (band) structure of dielectrics, spectra of fundamental absorption/reflection, different types of intrinsic luminescence (recombination, cross- and intraband luminescence), excitons and their possible self-trapping, the use of synchrotron radiation for the investigation of solids;", "et": "*\tdielektrikute tsoonistruktuurist, fundamentaalneeldumise spektritest, omaluminestsentsi erinevatest tüüpidest (rekombinatsiooniline, eksiton-, kross- ja tsoonisisene), eksitonidest ja iselõksustumise (autolokalisatsiooni) nähtusest, sünkrotronkiirguse kasutamisest tahkiste uurimisel;"}, {"en": "*\tphenomenon of multiplication of electronic excitatios in semiconductors or wide-gap materials, main mechanisms of multiplication and their use in spectral transformers, operation principles of solid-state scintillation detectors, mechanism of electrical breakdown;", "et": "*\telektronergastuste kordistumisest pooljuhtides ja dielektrikuis, kordistumise peamistest mehhanismidest ning nende kasutamisest spektraaltransformaatoreis, tahkiste stsintillatsioondetektorite töö põhimõtetest, dielektrilise läbilöögi mehhanismist;"}, {"en": "*\tknock-out and ionization mechanisms of structural defects under irradiation of different types, radiation resistance and prospects of its increasing, principles of personal dosimetry and methods of thermoactivation spectroscopy;", "et": "*\tstruktuuridefektide tekitamise põhilistest löök- ja ionisatsioonimehhanismidest erinevate kiiritustüüpide toimel, materjalide kiirituskindluse tõstmise meetoditest ning perspektiividest; tuuma- ja termotuumaenergeetika materjalidest, individuaaldosimeetria printsiipidest ja termoaktivatsioonspektroskoopia meetodeist; "}, {"en": "*\tphenomenon of low-temperature superconductivity in metals and alloys, features of high-temperature superconductivity, basic concepts of optics and electronics in semiconductors.", "et": "*\tmetallide ja sulamite madalatemperatuursest ülijuhtivusest, kõrgtemperatuurse ülijuhtivuse spetsiifikast, pooljuhtoptika ja -elektroonika põhimõisteist."}], "notes": {"et": "Ainet loetakse vajaduspõhiselt."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Suuline eksam kogu loengukursuse ulatuses. Vastuste täpsus ja korrektsus."}}], "grade_preconditions": {"et": "Registreerumine kursuse kuulajaks."}, "grade_evaluation": {"et": "Hinne kujuneb suulisel eksamil saadavate punktide põhjal."}, "debt_elimination": {"et": "Korduseksami peab sooritama hiljemalt järgneva semestri alguseks.\nKorduseksami tähtaega võib dekaan õppejõu taotlusel pikendada kuni 2 nädala võrra - vastavalt TÜ Õppekorralduseeskirjale\n\nEnd of the semester or in the beginning of next semester durig the first two weeks."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "1.\tC. Kittel, Introduction to Solid State Physics, New York, Willey, 1988, 1996. \nC. Kittel, Vvedenije v fiziku tvjordogo tela. M., Nauka, 1978.", "recommended_materials": "2.\tM.A.Elango, Elementary inelastic radiation-induced processes, New York, AIP, 1991.\nM.A. Elango, Elementarnõje neuprugije radiatsionnõje protsessõ. M., Nauka 1988.\n 3.\tK.K. Rebane, Impurity spectra of solids: Elementary theory of vibrational structure.\" Plenum  Press, New York-London, 1970.  \nK.K. Rebane, Elementarnaja teorija kolebatelnoj strukturõ spektrov primesnõh tsentrov kristallov. M.,  Nauka, 1968..\n4. Ch.B. Lushchik and A.Ch.Lushchik, Decay of electronis excitations with defect formation in solids, Moscow, Nauka, 1989 (in Russian).\nCh.B. Lushchik i A.Ch. Lushchik, Raspad elektronnõh vozbuzhdenij s obrazovanijem defektov v tvjordõh telah. M., Nauka, 1989.\n5.A.A. Kancel'son, Introduction to solid state physics, Moscow University, 1984 (In Russian).\n A.A. Kantselson, Vvedenije v fiziku tvjordogo tela.M., Izd. MGU, 1984."}, "participants": {"lecturers": [{"person_uuid": "d342cf33-36ef-f025-e218-7f0b23068e28", "person_name": "Aleksandr Luštšik", "structural_unit": {"code": "LTFY06", "name": {"en": "Laboratory of Physics of Ionic Crystals", "et": "ioonkristallide füüsika labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-39. n. 4 L n-s => E"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. <B>Tahkismaterjalide kristallstruktuur. </B>Kristallilised ja mittekristallilised kondenseeritud keskkonnad. Kristallograafia ja kristallokeemia alused. Kristallvõre. Aine struktuuri uurimise eksperimentaalsed difraktsioonmeetodid. Kristallide füüsikalised ja geomeetrilised mudelid. Tihedaim pakendus (tarindus).  Seoste tüübid kristallides: van der Waalsi, ioon-, kovalentne, metalliline. Binaarsete ioonkristallide tüübid. Polümorfismi nähtus.\n\n1. <B>Crystal structure of solid state materials.</B>\nCrystalline and noncrystalline condensed media. Principles of crystallography and crystallo-chemistry. Crystal lattice. Physical and geometric crystal models. Close packings. Experimental  diffraction methods for the investigation of matter structure. Types of crystal binding: Van der Waals, ionic, covalent, metallic. Types of binary ionic crystals. Polymorphism.<P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2. <B>Kristallstruktuuri defektid.</B> Defektide liigitamine. Schottky ja Frenkeli punktdefektid, nende kontsentratsioon ja difusioon. Kaasaegsete materjalide puhtusastmed. Lisandiioonide tahked lahused kristallides. Lineaarsed (dislokatsioonid), kahemõõtmelised (pinna-) ja kolmemõõtmelised defektid. Tahkiste nanomõõtmeliste defektide otsese vaatlemise meetodid. Kristallide süvapuhastuse põhimeetodid. Tahkete lahuste faasidiagramm. Monokristallide kasvatamise meetodid vedelest ja gaasifaasist.\n \n2. <B>Defects of crystal structure.</B>\nDefect classification. Intrinsic point Schottky and Frenkel defects, their concentration and diffusion. Purity levels of modern materials. Solid solutions of impurity ions in crystals. Linear (dislocations), two-dimensional (surface) and three-dimensional defects. Direct investigation methods of nano-scale defects in solids. Main methods of deep purification of solids. Phase diagram of solid solutions. Growing methods of single crystals from fluid and gaseous phases. <P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. <B>Kristallide võnkeergastused. </B>Ideaalse kristallvõre võnkumised. Ühe- ja mitmeaatomiliste ahelate võnkumised. Akustilised ja optilised võnkumised. Foononid. Lokaalsed ja kvaasilokaalsed võnkumised. Kristallvõre võnkumiste ilmingud infrapunase neeldumise ja peegeldumise spektrites, Ramani spektrites, neutronite koherentses ja mittekoherentses hajumises. Kristallide soojusjuhtivus. Foononite genereerimine, levimine ja relakseerumine.\n \n3. <B>Vibronic (vibrational) excitations of crystals.</B>\nVibrations of ideal crystal lattice. Vibration in monoatomic and multiatomic chains. Optical and acoustical vibrations. Local and quasi-local vibrations. Phonons. Experimental manifestations of vibrations in IR absorption and reflection spectra, Raman spectra, coherent and noncoherent scattering spectra of neutrons in solids. Thermal conductivity of crystals. Generation, propagation and relaxation of phonons.<P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. <B>Lisanditsentrite luminestsentsi elektronergastused (EE) dielektrikutes. </B>Luminestsentsi nähtus. Lisandiiooni elektronnivoode muutumine tema paigutamisel kristallvõresse. Lisanditsentrite neeldumis- ja luminestsentsi spektrid. Francki-Condoni lähend. Elektron-foonon vastasmõju. Võnkerelaksatsioon. Kiirguseta barjääriülesed ja tunnel-üleminekud. Soojuslik ja optiline kustutamine. Kuum luminestsents. Foononvabad jooned. s<sup>2</sup>-lisandiioonide spektroskoopia. Spektraaltransformaatorid luminestsentslampides. Tahkislaserite põhitüübid.\n \n4. <B>Electronic excitations of impurity luminescence centres in dielectrics.</B>\nLuminescence phenomenon. The change of electronic levels of an impurity ion due to its introduction into a crystal lattice. Absorption and emission spectra of impurity centres. Frank-Condon approximation. Electron-phonon interaction. Vibronic relaxation. Above-barrier and tunnel nonradiative transitions. Thermal and optical quenching. Hot luminescence. Zero-phonon lines. Spectroscopy of s<sup>2</sup> impurity ions. Spectral transformers in luminescent lamps. Main types of solid state lasers. \n<P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. <B> Dielektrikute oma-elektronergastused (EE). </B>Põhineeldumise ja -peegeldumise spektrid. Elektronide energiaspekter kondenseeritud süsteemides. Dielektrikute energeetiline tsoonistruktuur. Dielektrikute omaluminestsents (eksitonkiirgus, tsoonisisene luminestsents, valents-rümp luminestsents). Elektron-aukprotsessid. Vooluta liikuvad EE - eksitonid. Eksitonide, elektronide ja aukude relakseerumine, migreerumine ja autolokaliseerumine. Optiliste konstantide spektrid. Sünkrotronkiirgus kui elektronergastuste (EE) uurimise kaasaegne vahend. Sünkrotronkiirguse mõjuspektrid optilistele ja elektrilistele karakteristikutele. Tahkiste pinnal asuvate EE iseärasused.\n \n5. <B>Intrinsic electronic excitations of dielectrics.</B>\nSpectra of fundamental absorption and reflection. Energy spectrum of electrons in condensed matter. Energy (band) structure of dielectrics. Intrinsic luminescence of dielectrics (emission of excitons, intra-band luminescence, crossluminescence. Electron-hole (e-h) processes. Currentless mobile electronic excitations - excitons. Relaxation, migration and self-trapping of excitons, electrons and holes. Spectra of optical constants. Synchrotron radiation - novel investigation method of electronic excitations. Spectra of synchrotron radiation action on optical and electrical characteristics. Peculiarities of electronic excitations at the surface of solids.\n<P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6. <B>Elektronergastuste kordistumine (EEK). </B>EEK universaalne elektron-auk (e-h) mehhanism pooljuhtides. EEK elektron-auk ja eksitonmehhanismid dielektrikutes ja nende avaldumine optilistes ja fotoelektrilistes nähtustes. Francki-Hertzi efekti tahkisanaloog. Ühest suurema kvantsaagisega QY>1 spektraaltransformaatorid valgusallikates ja gaaslahenduskuvarites. Tahkismaterjalid kui suure energiaga osakeste ja kvantide stsintillatsioondetektorid. Dielektriline läbilöök, elektronlaviinid. Dimensiooniefektid. Elektroluminestsentsi nähtus. \n\n6. <B>Multiplication of electronic excitations (MEE).</B>\nUniversal e-h mechanism of MEE in semiconductors. Electron-hole and excitonic mechanisms of MEE in dielectrics and their manifestations in optical and photo-electrical phenomena. Solid state analogue of the Frank-Hertz effect. Spectral transformers with the quantum yield of emission above unity for luminescent lamps and plasma display panels. Solid state materials as scintillation detectors of high-energy particles and quanta. Electric breakdown, electron avalanche. Electroluminescence. <P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7. <B>Tahkise kiiritusfüüsika. </B>Tuuma- ja termotuumaenergia ning materjalide kiiritustaluvuse probleem. Metallide elementaarsed kiiritusdefektid. Interstitsiaalide ja vakantside tekitamise löökmehhanismid. Defektide mõju kristallide mehaanilistele omadustele.\nElementaarsed kiiritusdefektid dielektrikutes. Ioonkristallide ruumalas ja pinnal defektide tekitamise löök- ja ionisatsioonmehhanismid. Laia keelutsooniga materjalide EE defektitekkega lagunemine. Lühilainelise (sünkrotron-) kiirgusega defektide tekitamise spektrid. Defektitekke eksiton ja elektron-aukmehhanismid. Defektide stabiliseerimine nende agregatiseerimisel.\nMaterjalide kiirituskindlust määravad tegurid. Defektitekke iseärasused elektronergastuste ülikõrge tiheduse tingimustes. Dielektrilised materjalid osakeste ja kvantide individuaaldosimeetriaks. Neutronide selektiivne dosimeetria. Kiiritatud kristallide termoaktivatsioonspektroskoopia. \n\n7. <B>Radiation physics of solids.</B>\nNuclear and thermonuclear energetics and the problem of radiation resistance of materials. Elementary radiation defects in metals. Knock-on creation mechanisms of interstitials and vacancies. Influence of defects on mechanical properties of crystals. \nElementary radiation defects in dielectrics. Impact (knock-on) and ionization mechanisms of defect creation in a bulk and at the surface of ionic crystals. Decay of electronic excitations with the creation of Frenkel defects in wide-gap materials. Creation spectra of Frenkel defects by short-wavelength (synchrotron) radiation. Excitonic and electron-hole mechanisms of defect creation. Defect stabilization due to their aggregation. \nThe decisive factors of radiation resistance of materials. Peculiarities of the defect creation under conditions of superhigh density of electronic excitations. \nDielectric materials for personal dosimetry of particles and quanta. Selective dosimetry of neutrons. Thermoactivation spectroscopy of irradiated crystals. <P>"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. <B>Ülijuhtivad materjalid. </B> Metallide madalatemperatuuriline ülijuhtivus. Meissneri efekt. Isotoopefekt. Bardeeni-Cooperi-Schriefferi elektron-foononmehhanism. Ülijuhtiva kollektiivi püsivus. Oksiidide ja boraatide kõrgtemperatuurne ülijuhtivus (KTÜJ). KTÜJ põhimehhanismid. Ülijuhtivate materjalide kasutamine kaasaegses tehnikas.\n\n8. <B>Superconducting materials. </B>\nLow-temperature superconductivity of metals. Meissner effect. Isotopic effect. Electron-phonon mechanism by Bardeen, Cooper and Schrieffer. Stability of the superconducting association. High-temperature superconductivity of metal oxides and borates. Main mechanisms of HTSP. The usage of HTSP materials for applications."}}]}, "registration_info": {"audience": {}, "min_students": 1, "max_students": 25}, "parent_uuid": "29ae55a7-a6ab-2c36-244b-406f3e2007bf", "parent_code": "LOFY.02.025", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}