{"uuid": "180da0b1-ec2f-ffd8-4f67-6e21b3797b26", "code": "lt-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Physics and Engineering", "et": "Füüsika ja tehnika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The fundamental physical principles of modern technologies are introduced. The potential teachers acquire an ability to teach the elective course \"Physics and engineering\" at the high school (gymnasium) level.", "et": "Tutvustatakse kaasaegse tehnoloogia füüsikalisi alusprintsiipe põhirõhuga elektromagnetismile. Tulevased gümnaasiumi füüsikaõpetajad omandavad oskuse õpetada valikkursust \"Füüsika ja tehnika\"."}, "objectives": [{"en": "The main goal of the course is to explain the fundamental physical principles of modern technologies and provide potential teachers with the skills to teach the elective course \"Physics and Engineering\" at the secondary school level.", "et": "Tutvustada kaasaegse tehnoloogia füüsikalisi alusprintsiipe ning anda tulevasele gümnaasiumi füüsikaõpetajale oskus õpetada valikkursust \"Füüsika ja tehnika\"."}], "learning_outcomes": [{"en": "Upon completion of this course, the student should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Know the basic definitions in the field of the modern physical and technological concept of the world within the limits of the vocabulary available via the web support of the course;", "et": "1. Tunneb kaasaegse füüsikalis-tehnoloogilise maailmapildi põhimõisteid aine veebitoes toodud sõnastikuga määratletud tasemel;"}, {"en": "2. Explain the functional principles of some technological materials and devices within the limits of the program of the elective course \"Physics and Engineering\", applying physical terminology in a correct way;", "et": "2. Oskab valikkursuse \"Füüsika ja tehnika\" kavas toodud mahus selgitada valitud tehnoloogiliste materjalide ning seadmete funktsioneerimist, kasutades korrektselt füüsika termineid;"}, {"en": "3. Compile an overview representing the functional principles of an important technological material or device, and make a public presentation of this overview.", "et": "3. Suudab iseseisvalt koostada ja ette kanda referaadi, mis ammendavalt käsitleb mingi olulise tehnoloogilise materjali või seadme funktsioneerimist."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Üliõpilased peavad  tegema neid personaalselt huvitava tehnilise seadme teemal referaadi, mis annab kuni 50% lõpphindest. Referaat peab sisaldama ca 10 lk teksti ja jooniseid ning vähemasti 5 viidet. Referaati tuleb kas auditoorse töö käigus kõigile aines osalejatele presenteerida või siis vähemasti vastata õppejõu küsimustele referaadi teemal."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Teise 50% lõpphindest annab kirjalik eksamitöö. See sisaldab juhuvalikul kümme näidet nendest tehnilistest seadmetest, mille tööpõhimõtet üliõpilane aines tundma õppis. Eksamitöö näidisformaat on leitav aine õppematerjalidest"}}], "min_points_from_tests": 25, "grade_preconditions": {"et": "Referaadi õigeaegne esitamine"}, "grade_evaluation": {"et": "Eksamihinde määravad: kuni 50% referaat, teine 50% kirjalik eksamitöö. \nLõpphindamisele pääsemise eelduseks on esitatud referaadi kvalifitseerumine (vähemasti 25 punkti saamine 50-st võimalikust)."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne semestri lõppu (väljaspool ordinaarset õppetööd).\nKorduseksami peab sooritama hiljemalt järgneva semestri alguseks.\nKorduseksami tähtaega võib dekaan õppejõu taotlusel pikendada kuni 2 nädala võrra."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "877ebbb7-79ef-4354-8ba8-6fb0ee2bbfea", "type": "MOODLE", "code": "LOFY.01.115", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "failid (õppematerjalide all):\nFJT-eksamiylesanne.pdf,\nFJT-LOFY-01-115-s6nastik.pdf", "recommended_materials": "vt. https://moodle.ut.ee/course/search.php?search=lofy.01.115.\n1. Indrek Peil. Mehaanika. Füüsika õpik gümnaasiumile. Maurus ja EFS, 2012.\n2. Kalev Tarkpea, Henn Voolaid. Elektromagnetism. Maurus ja EFS, 2013.\n3. Madis Reemann. Energia. Füüsika õpik gümnaasiumile. Maurus ja EFS, 2014.\n4. Tehnikaraamat. Eesti Entsüklopeediakirjastus.Tallinn, 2001. (originaal: How Things Work\nToday. Editors: Michael Wright, Mukul Patel. Marshall Publishing Ltd. London, 2000)."}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-16.n. 2L n-s -> E, toimub koos AÜ õppetööga"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. Aero- ja hüdrodünaamika. \nKeskkonna takistusjõud. Teised õhusõidukile mõjuvad jõud. Vedelike voolamine torudes. Inimese ja looma vereringe, diastoolne ja süstoolne vererõhk. Hüdroturbiin."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2. Elastsuslained. \nElastse deformatsiooni energia. Võnkumiste ja lainete energia. Võnkumiste liitumine. Võnkumiste spekter. Doppleri efekt helilainete korral. Helitugevus. Detsibell. Müra ja mürakaitse."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. Ebatavalised faasid ja faasisiirded. \nGaaside veeldamine. Madalate temperatuuride saamine. Krüovedelikud ja krüogeenika. Allajahutatud ja ülekuumendatud vedelikud. Härmatumine (sublimatsioon), aine sulamistemperatuuri sõltuvus rõhust. Süsihappelumi ja teised mitte-H2O jääd. Lahused ja faasisiirded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. Soojusmasinad ja energiamajandus.\nTermodünaamika I printsiibi ilmnemine isoprotsessides. Adiabaatiline protsess. Ideaalne soojusmasin. Soojusmasina kasutegur. Ringprotsess. Pööratavad ja mittepööratavad protsessid. Reaalsed soojusmasinad (auruturbiin, ottomootor, diiselmootor, stirlingmootor) ja nende kasutegurid. Energiaallikad, energia muundamine, transport ja salvestamine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. Entroopia ja negentroopia. \nEntroopia mõiste käsitlused. Info, energia ja aine entroopiliselt seisukohalt. Maa ja Universumi entroopia ning negentroopia. Mittetasakaalulised protsessid. Rakendused: külmuti ja soojuspump."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6. Kondensaator ja induktiivpool. Plaatkondensaatori mahtuvus. Kondensaatorite ehitus ja liigid. Laetud kondensaatori energia. Kondensaatorite kasutusnäited. Pika ja peenikese pooli induktiivsus. Vooluga induktiivpooli energia. Ülijuhtiva mähisega elektromagnetid ja nende kasutamine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7. Juhid ja dielektrikud. \nDielektrikute polarisatsioon. Varjestamine. Aine dielektriline läbitavus. Piesoelektrikud ja ferroelektrikud. Rakendused: piesoelektrilised andurid ja täiturid, elektronkaal, kvartskell."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. Ainete magnetilised omadused. \nAine magnetiline läbitavus. Dia- ja paramagneetikud. Kõvad ja pehmed ferromagneetikud. Ferromagneetiku domeenstruktuur ja hüsterees. Rakendused: elektromagnetid ja magnetiline infosalvestus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9. Elektrivool vedelikes ja gaasides. Elektrolüüs. Faraday I seadus elektrolüüsi kohta.\nElektrolüüsi rakendusnäiteid. Sõltuv ja sõltumatu gaaslahendus. Kasutusnäited."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10. Pooljuhtelektroonika. \nJuhi, pooljuhi ja mittejuhi erinevused tsooniteoorias. Pooljuhtide omajuhtivus ja selle rakendused: termotakisti, fototakisti, pooljuht-kiirgusdetektor. Pooljuhtide legeerimine. Elektronjuhtivus ja aukjuhtivus. pn-siire. Alaldi, fotodiood, valgusdiood, dioodmaatriks, CCD-maatriks, pooljuhtlaser. Päikesepaneelid. Bipolaar- ja väljatransistor. Kiip, selle kasutamine analoog- ja digitaallülitustes."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "11. Vahelduvvoolu kasutamine. \nVahelduvvoolu iseloomustavad suurused. Elektriohutus. Kaitsemaandus. Kaitsmed. Aktiiv-, induktiiv- ja mahtuvustakistus vahelduvvooluahelas. Näivtakistus. Kogutakistus. Ohmi seadus vahelduvvooluahela kohta."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "12. Vahelduvvoolumasinad. \nAlalisvoolumootor ja -generaator. Trafo talitlus, trafode kasutamine. Vahelduvvoolugeneraator ja asünkroonmootor. Vahelduvvoolu võimsustegur. Kolmefaasiline vool. Elektrienergia tootmine, ülekanne ja jaotamine Eesti näitel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "13. Elektromagnetvõnkumised ja -lained. \nVõnkering. Elektromagnetlainete tekitamine. Elektromagnetlainete skaala. Raadiolained ja nende levimine. Raadioside põhialused. Raadiolokatsioon ja GPS. Nüüdisaegsed sidevahendid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14. Optilised seadmed. \nValguskiir. Valguse sirgjooneline levimine. Valguse täielik peegeldumine. Valgusjuhid ja nende kasutamine. Optilised süsteemid (objektiiv, teleskoop, mikroskoop), nende lahutusvõime. Polariseeritud valgus ja selle saamine. Rakendused: polaroidprillid ja vedelkristallekraan."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "15. Fotomeetria. \nInimsilma valgustundlikkus. Valgustugevus ja valgusvoog. Valgustatus. Ruuminurk. Ühikud: kandela, luumen ja luks. Luksmeeter. Erinevate valgusallikate valgusviljakused."}}]}, "registration_info": {"audience": {"et": "mag: füüsika; Gümnaasiumi loodusteaduste õpetaja: mag (gümnaasiumi füüsikaõpetaja aineõppe moodul) 2.a"}, "min_students": 5}, "parent_uuid": "c50a0f61-2a0a-2e7b-10af-66c51ae3f4c1", "parent_code": "LOFY.01.115", "parent_credits": 3, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}