{"uuid": "a98ac1c7-ee86-99a1-241a-ff87db39ebb8", "code": "lt-2017-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Nanoelectronic Materials", "et": "Nanoelektroonilised materjalid"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2017", "et": "2017/2018", "en": "2017/2018"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "17/18 A regular LT", "et": "17/18 S PÕ LT"}}, "general": {"year": {"code": "2017", "et": "2017/2018", "en": "2017/2018"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "An introductory overview will be given, related to the fabrication methods of nanoelectronic device components including the classification of their constituent materials and substrates as well as the roadmaps before the development and scale-up of industrial device production. Problems related to the choice of suitable materials, methods of synthesis of materials an precursor chemistry will be described. Role of the substrate and surface reactions in the formation of nanostructures will be treated, in conjunction with the process-related physical and chemical quality of the devices. The audience will be introduced to the principles of the electrical characterization of device prototypes, underlining the importance of conduction, leakage currents, capacitance as well as interrelationships between electronic charge trap densities, composition and processing history of the materials analysed. Connections between fundamental and application-oriented studies or between research and development will be highlighted.", "et": "Loengukursuse alguses antakse ülevaade elektroonikaseadmete komponentide valmistamismeetoditest, komponenttahkiskihtide ja nende erinevate substraatide klassifikatsioonist ning teekaartidest seadmete arendusel. Kirjeldatakse nanomeetrilistes dimensioonides tahkiskihtide, nanokristallide ja nanotorude saamismeetodeid. Samuti kirjeldatakse seadmete erinevate koostismaterjalide valikukriteeriume, materjalide sünteesimeetodeid ja lähteainekeemiat. Käsitletakse ka pinna ning reaktsioonide rolle elektroonse seadise aluseks olevate nanostruktuuride moodustumisel ning protsessiga seotud füüsikalist ja keemilist kvaliteeti. Kursuse jooksul tutvustatakse seadmete prototüüpide elektrilise evaluatsiooni põhimõtteid ning elektroonse defektsuse kriteeriume rõhuga selliste elektriliste karakteristikute nagu pindjuhtivus, juhtivus, mahtuvus, laengulõksude tihedus, jt. sõltuvustel seadme eripäradest. Käsitletakse fundamentaaluuringute ja rakendusuuringute ning teadustöö ja arendustöö vahelist sidestatust."}, "objectives": [{"en": "The purpose of the lecture course is to introduce the master and postgraduate students to the technology and measurements of thin solid films as the basis of nanoelectronics. Nanodimensional devices, such as contemporary and future transistors as well as dynamic and non-volatile memory concepts, will be described together with the basics of their electronic characterization.", "et": "Eesmärgiks on selgitada magistriõppe ja doktoriõppe tasemel nanoelektroonsete seadmete aluseks olevate tahkiskihtide valmistamise tehnoloogiaid ning mõõtmismeetodeid. Kirjeldatakse nanodimensionaalseid seadmeid peamiselt transistoride ja dünaamiliste- ning püsimälude baasil, samuti nende elektroonseid põhikarakteristikuid."}], "learning_outcomes": [{"en": "Upon the completion of the course the participants will become educated in the following:", "et": "Kursuse lõpuks osalejad"}, {"en": "1) They will be familiar with the working principles of contemporary and advanced nanoelectronic devices, such as three-dimensional memory cells and transistors, flash memories, phase change memories, nanosensorics.", "et": "1. On tutvunud kaasaaegsete ja arendatavate nanoelektroonikaseadmete - kolmedimensionaalsete mälurakkude, transistoride, välkmälude, faasimuutmälude, nanosensorite jt. -tööpõhimõtetega."}, {"en": "2) They will be introduced to the the main fabrication methods and configurations of the nanoelectronic devices.", "et": "2. On viidud kurssi elektroonikaseadiste põhiliste fabritseerimismeetodite ja konfiguratsioonidega."}, {"en": "3) They will have knowledge concerning the constituent materials of the devices as well as the material analysis methods.", "et": "3. On tutvunud nende seadmete koostismaterjalidega ja analüüsimeetoditega."}, {"en": "4) They will know the concepts and possibilities of the development of industrially relevant devices based on nanorods, nanotubes, nanodots, graphene.", "et": "4. Tunnevad nanoseadmete edasise arengu aluseks peetavaid põhikontseptsioone: seadmed nanovarrastel, nanotorudel, nanopunktidel, grafeenil."}], "notes": {"et": "Kirjalik referaat või suuline seminariettekanne.\n\nToimub üle aasta!"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Suuline ettekanne või kirjalik referaat nanoelektroonikaga seonduval teemal"}}], "grade_preconditions": {"et": "Osalemine loengutes ja ettekanne või referaat valitud allikamaterjali alusel."}, "grade_evaluation": {"et": "Loengukursus lõpeb eksamiga. See sooritatakse loengus esitatud materjalide alusel. Lisaks loengutele tuleb eksaminandil eelnevalt esitada kas suuline ettekanne valitud ja nanoelektroonikaga seonduval teemal seminaris või alternatiivse võimalusena esitada kirjalik referaat samal teemal."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne uue semestri algust.\nKorduseksami peab sooritama hiljemalt järgneva semestri alguseks.\nKorduseksami tähtaega võib dekaan õppejõu taotlusel pikendada kuni 2 nädala võrra."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "af72b6d5-651c-e42d-e9db-a402974684ae", "person_name": "Kaupo Kukli", "structural_unit": {"code": "LTFY02KT", "name": {"en": "Laboratory of Thin Film Technology", "et": "kiletehnoloogia labor"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY02", "is_expired": true}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "9.-16.n. n. 4L n-s, ref => E"}, "entries": [{"time": "2017-11-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatav loeng. Kursusel käsitletava materjali kokkuvõtlik ülevaade, iseseisva töö ja kursuse läbimise tingimuste selgitamine. Mõiste \"nanotehnoloogia\" avamine ja määratlemine elektroonikaseadmete ja materjaliteaduse ühiskontekstis. Nanoelektroonika arengu visualiseerimine."}}, {"time": "2017-11-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrooniline signaalilüliti/võimendi - transistor kui elektroonika põhiehitusdetail. Transistori ehitus ja ehitusmaterjalid. Dimensioonid. Moore'i seadus. Litograafia."}}, {"time": "2017-11-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mäluseadmed - kondensaator. Kondensaatori materjalid. Värskendatavad muutmälud ja püsimälud. Kolmedimensionaalsed seadmed. Sobilike materjalisünteesimeetodite esmasest valikust."}}, {"time": "2017-11-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Paralleelselt toodetavate ja arendatavate maatriksmäluseadmete tööpõhimõtetest ja ehitusmaterjalidest - dünaamiline muutmälu (DRAM), välkmälu (flash), ferroelektriline mälu (FeRAM), faasimuutmälu (PRAM), magnetmuutmälu (MRAM), takistuslülituslik mälu (ReRAM). Probleemid mäletamisega."}}, {"time": "2017-11-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Nanomaterjalide sadestusmeetodite ülevaade - termiline aurustamine, elektronkiiraurustamine (EBE), katoodtolmustamine, laseraurustamine (PLD), molekulaarjugaepitaksia (MBE), keemiline aurufaassadestamine (CVD), aatomkihtsadestamine (ALD). Nukleatsioon. Nanotahkiskihtide kasvurezhiimid."}}, {"time": "2017-11-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Nukleatsiooniprotsessi tulemustest. Nanokristalli tekkimine ja selle kasulikud (di)elektrilised omadused. Metastabiilsed korrastatud faasid. Õhukeste tahkiskihtide faasikoostise võimalikest iseärasustest sõltuvalt sünteesimeetodist."}}, {"time": "2017-11-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Süsinikupõhisest elektroonikast. Süsiniknanotorud (CNT). CNT-transistor. CNT-kiip. Grafeentransistor. Grafeenkiip. Teisi ränile alternatiivseid laenguid juhtivaid või pooljuhtivaid materjale."}}, {"time": "2017-11-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "\"Top-down\" ja \"bottom-up\" arengusuunad nanoelektroonikas. Molekulaartransistor, üheelektronitransistor ja nanopunktmälud. Aatomjõumikroskoobi võimalikke rakendusi nanoelektroonikaseadmete kokkupanekul."}}, {"time": "2017-11-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Nanoelektroonikamaterjalide esmane evalueerimine. Materjali puhtus ja koostise analüüs jääkelementide determineerimiseks. Tahkismaterjali sünteesijärgsest töötlemisest."}}, {"time": "2017-12-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Defektid nanomaterjalis ja nende mõju elektrilistele karakteristikutele. Mahtuvusliku kihtstruktuuri ettevalmistus mõõtmisteks."}}, {"time": "2017-12-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sondijaam volt-amper ja volt-farad karakteristikute mõõtmiseks. Kondensaator kahes rollis: transistori süda ja mälurakk."}}, {"time": "2017-12-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Metall-oksiid-pooljuht(MOS)-kondensaatori tsooniskeem. Volt-farad-karakteristiku (C-V kõvera) väljajoonestumine mõõtmisprotsessis. Materjali defektsuse mõju tema mahtuvuslikule käitumisele."}}, {"time": "2017-12-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Materjali eritakistuse/juhtivuse mõõtmised nelipunktsondiga. Lekkevool materjalis ja selle sõltuvus materjali kvaliteedist. Juhtivusmehhanismid tahkiskihtides."}}, {"time": "2017-12-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Siirdpindade roll dielektrikkihi karakteristlikus käitumises. Ekvivalentne dielektrikkihi paksus."}}, {"time": "2017-12-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kokkuvõte tähtsamatest tahkisnanoelektroonika arengusuundadest. Illustratiivseid lisanäiteid tahkiskihtide füüsika ja keemia ning nanoelektroonikaseadme töökindluse vahelistest võimalikest seostest. Teekaardid teadusuuringutes ja arendusprotsessis.\n18. 12. Seminariettekanded."}}, {"time": "2017-12-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminariettekanded ja nende arutelu."}}]}, "registration_info": {"audience": {"et": "füüsika, keemia, materjaliteadus, infotehnoloogia"}, "min_students": 5, "max_students": 100}, "parent_uuid": "9e087282-aff7-fa43-5460-6f1862735296", "parent_code": "LOFY.02.045", "parent_credits": 3, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}