{"uuid": "5e9995a1-126e-22cb-3f30-7334708de6c8", "code": "lt-2018-autumn-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is targeted to the quick and efficient introduction of the main principles of the current physics (matter and field, fermions and bosons, absolute speed, energy minimum, etc.), whereas the previous knowledge in physics is not required. The main goal is to create the mental constructs to envision physical processes. In most important cases, the examples are illustrated considering the application of the mathematical methods in physics. It is also important to note that the absolute mathematic formalness is not pursued.", "et": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Kuulajate teadvuses püütakse eelkõige tekitada füüsikalisi protsesse peegeldavaid kujutluspilte. Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud). Käsitluse üldist matemaatilist rangust ei taotleta."}, "objectives": [{"en": "The main goal of the course is to introduce the physics as the integrity, and the role of physics in the generation of the observer's personal understanding of the Nature.", "et": "Tutvustada füüsikat kui tervikut ja füüsika rolli indiviidi kui vaatleja isikliku looduspildi kujundamisel."}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to:\n1. Cognize physics as a science that investigates the most general causal relationships, generates the models of natural phenomena and broadens the internal and external limits of vision;\n2. Express the basic principles of the physical concept of the nature (such as atomistic principle, energetic minimum, absolute speed, wave-particle dualism, uncertainty principle), and refer to their exertion;\n3. Use the vocabulary introduced at the lectures during the scientific discussions, make difference between important and unimportant information, and apply physical terminology in a correct way;\n4. Possess the knowledge considering the mathematical background and calculus necessary for the description of physical processes (e.g., graphical representations, differentiation and integration, application of complex numbers), and recognize the main attributes and occurrence conditions of main functions present in physics (e.g., linear, power, exponent, harmonic); 5. Know the basic definitions belonging to the current physical concept of the world within the limits of the vocabulary (30 pages of A4 format) available on the web page of the course;\n6. Solve the physical problems within the limits of example exercises available via the web support of the course.", "et": "Aine läbinud üliõpilane:\n1. Mõistab füüsikat kui kõige üldisemaid põhjuslikke seoseid uurivat, loodusnähtuste mudeleid loovat ja nii sisemist kui välist nähtavushorisonti edasi nihutavat teadust;\n2. Oskab väljendada füüsikalise maailmapildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;\n3. Oskab loengute kavas toodud märksõnade raames füüsikaliselt arutleda, eristades olulist ebaolulisest ja kasutades korrektselt füüsika termineid;\n4. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);\n5. Tunneb kaasaegse füüsikalise maailmapildi põhimõisteid aineveebis toodud põhivaraga (30 A4 lehekülge) määratletud tasemel;\n6. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksamitöö (annab kuni 30% hindest)."}}], "min_points_from_tests": 35, "grade_preconditions": {"et": "Tehakse 4 kontrolltööd, millest kaks esimest annavad kuni 15% ja kaks ülejäänut kuni 20% eksamihindest. Kuni 30% annab eksamitöö. Eksamile lubatakse kõik, kes on kogunud kontrolltöödega üle 35% punktidest (pool või enam kontrolltööde eest saadavast 70%-st)."}, "grade_evaluation": {"et": "Kõigi kontrolltööde positiivne sooritus (rohkem kui poolte võimalike punktide saamine iga töö eest) eksamile pääsemiseks veel vajalik ei ole, kuid see on nõutav lõpptulemuse saamisel. Esimene kontrolltöö mõõdab väljundi 2 saavutatust ja kolm viimast kontrollivad väljundi 6 olemasolu. Eksamitöös on eraldi nõutavad väljundite 1, 2, 3, 4 ja 5 saavutatust kontrollivate ülesannete positiivsed sooritused. Kõrgeimale hindele (A) pretendeerijate teadmisi kontrollitakse täiendavalt eksami suulises osas. Eksami suulist osa võivad taotleda üliõpilased, kes kirjalikes kontrollivormides on kogunud üle 70% punktidest."}, "debt_elimination": {"et": "Mistahes kontrolltöö tegemiseks on enne eksamit kaks võimalust, sõltumatult soorituskatse toimumise ajast. Positiivse lõpphinde saamine eeldab väljundite 1 kuni 5 saavutatust kontrollivate ülesannete (kõigi!) positiivseid sooritusi eksamitöös ja kõigi kontrolltööde positiivseid sooritusi. Korduseksamil võib piirduda vaid nende ülesannete tegemisega, mille osas eelmise eksami tulemus oli negatiivne. Eksami kõigi väljundite (1-5) osas positiivselt sooritanud üliõpilased saavad ühekordse lisavõimaluse seni negatiivse tulemusega kontrolltööde kordussoorituseks. Kogu teadmiste kontrolli protseduur lõpeb enne järgmise semestri algust ja mingi väljundi osas ikka veel negatiivse tulemusega üliõpilased saavad puuduliku lõpphinde (F)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/fmp/", "is_moodle_connected": false, "mandatory_materials": "1. I.Peil, K.Tarkpea.  Füüsikalise looduskäsitluse alused. Õpik gümnaasiumidele, Tartu, Eesti Füüsika Selts (EFS), 2014\n2. Veebi <a href=\"https://sisu.ut.ee/fmp/\">https://sisu.ut.ee/fmp/</a> linkidest avanevad allikad.", "recommended_materials": "1. K.Tarkpea, H.Voolaid. Füüsika käsiraamat. Koolibri, 2002.\n2. D. Halliday, R. Resnick, Jearl Walker. Füüsika üldkursus. Tartu, EFS, 2012\n3. J. Lõhmus, R. Veskimäe (toim.). Universumi mikromaailm. 2003.  \n4. Robert H. March. Füüsika võlu (Physics for Poets). Ilmamaa, 2000."}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"matemaatika 2": {"code": "1", "et": "Lektor", "en": "lecturer"}, "füüsika, keemia ja materjalitead 1": {"code": "1", "et": "Lektor", "en": "lecturer"}, "geograafia 1": {"code": "1", "et": "Lektor", "en": "lecturer"}, "geoloogia ja kktehn 1": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "eea1e161-3b03-5367-2065-93989346ffd4", "person_name": "Helle Kaasik", "structural_unit": {"code": "LTFY04TT", "name": {"en": "Laboratory of Solid State Theory", "et": "tahkiseteooria labor"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY04", "is_expired": true}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "48a2c811-eddb-6b72-5eab-74c6a39d3a57", "person_name": "Valter Reedo", "structural_unit": {"code": "LTFY02LS", "name": {"en": "Laboratory of Laser Spectroscopy", "et": "laserspektroskoopia labor"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY02", "is_expired": true}, "is_responsible": false, "is_teaching": true}], "study_groups": [{"uuid": "d3076c9f-0792-01e8-9996-6a809baac98b", "code": "füüsika, keemia ja materjalitead 1"}, {"uuid": "a8796d8f-09df-61e8-8f89-4470d2fb4455", "code": "geograafia 1"}, {"uuid": "98f6dae1-3b62-609c-e3eb-9dc6ffc4ff54", "code": "geoloogia ja kktehn 1"}, {"uuid": "7d85538b-2ae4-8392-97e2-40e392bac192", "code": "matemaatika 2"}]}, "schedule": {"weeks": {"et": "1.- 4.n. 4L n-s; 5.-16.n. 4L, 2S n-s, 4 knt  => E"}, "entries": [{"time": "2018-09-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. <B>Aine läbimise tingimused. Maailmapildi mõiste.</B> Aine läbimise tingimused. Inimene ja maailm. Loodus, füüsika ja teised loodusteadused. Füüsika erinevad tõlgendused. Vaatleja tahe, aistingud, mälu ja mõistus. Süllogism. Looduse struktuuritasandid ja nähtavushorisondid. Mikro-, makro- ja megamaailm. Füüsika ja põhjuslikkus. Fatalistlik, juhuslik, kaootiline ja tahtlik põhjuslikkus. Ruumiline ja ajaline põhjuslikkus. (6 h)"}}, {"time": "2018-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2. <B>Füüsika uurimismeetodid.</B> Loodusteaduslik meetod ja mõõtmised. Mõõtühikute süsteem SI. Mõõtemääramatus. Mudelite loomine füüsikas. Füüsikalised objektid ja füüsikalised suurused. Skalaarid ja vektorid. Induktsioon ja deduktsioon. Seaduspärasused ja seadused. Loodusteaduslik ja täppisteaduslik käsitlus. Füüsika seos matemaatikaga. Lineaarne, astme-, eksponent- ja harmooniline funktsioon. (6 h)"}}, {"time": "2018-09-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. <B>Füüsika üldmudelid ja üldprintsiibid.</B> Kehad, liikumine, vastastikmõjud, aine ja väli, laeng, energia, atomism, spinn. Energia miinimumi printsiip, tõrjutusprintsiip, absoluutkiiruse printsiip, dualismiprintsiip, lõtkuprintsiip. Põhivastastikmõjud ja neist tingitud jõud. Elementaarosakesed. Standardmudel. Fermionid ja bosonid. Leptonid ja kvargid. Füüsikalise maailmapildi arengufaasid. (6 h)"}}, {"time": "2018-10-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. <B>Mehaanika kui füüsikaliste mudelite alus.</B> Keha suurus, asukoht, asend ja kuju. Koordinaadid. Taustsüsteem. Liikumisvormid: translatsioon, rotatsioon, deformatsioon ja ostsillatsioon. Matemaatilised meetodid liikumise kirjeldamiseks. Diferentseerimine ja integreerimine. Liikumisvõrrandid. Graafilised meetodid liikumise kirjeldamiseks. Kulg- ja pöördliikumise kinemaatika ning dünaamika. Newtoni seadused. Hõõrdejõud ja takistusjõud. Inertsjõud. Jõumoment, inertsimoment, impulsimoment. Töö, energia ja võimsus. Kuu ja õun Newtoni käsitluses. Gravitatsiooniseadus. Taevakehade liikumine. Kepleri seaduste tulenevus dünaamika põhiseadustest. (12 h)"}}, {"time": "2018-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. <B>Võnkumised ja lained. </B> Elastsusjõud. Harmooniline võnkumine, selle kirjeldamise viisid. Võnkumiste diferentsiaalvõrrand ja selle lahendamine sumbumatu, sumbuva ning sundvõnkumise korral. Eksponentfunktsioon füüsikas. Sumbetegur ja ajategur. Kompleksarvude kasutamine füüsikas. Kompleksmeetod võnkumiste kirjeldamiseks. Laine kui võnkumise levimine ruumis. Lainefunktsioon. Seisulained ja kvantarvud. Võnkumiste liitumine, harmooniline analüüs, Fourier teisenduse füüsikaline olemus. Piki- ja ristlained. Heli valjus, kõrgus ja tämber. Interferents ja difraktsioon. Doppleri efekt. (6 h)"}}, {"time": "2018-11-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6. <B>Relativistlik füüsika. </B> Ruum ja aeg kui vaatleja kujutlused. Aja aeglustumine, pikkuste lühenemine, massi suurenemine. Keha omapikkus, tegelik pikkus ja näiv pikkus. Massi ja energia samaväärsus. Seisumass ja seisuenergia. (2 h)"}}, {"time": "2018-11-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7. <B>Elektromagnetism.</B> Coulomb'i seadus ja elektrostaatiline väli. Ampere'i seadus ja magnetväli. Väljavektorid E ja B. Potentsiaal ja pinge. Väljavektorid D ja H. Väljavektori voog. Elektromagnetiline induktsioon. Väljavektori tsirkulatsioon. Elektromotoorjõud. Maxwelli võrrandid (induktsiooniseadus, magnetvälja pööriselisus, koguvooluseadus, Gaussi teoreem). Elektrivool ja selle mehaanilised mudelid. Keha takistus, aine eritakistus. Kehade süsteemi mahtuvus ja induktiivsus. Elektri- ja magnetvälja energia. Elektromagnetvõnkumised. Elektromagnetlainete tekkimine. (10 h)"}}, {"time": "2018-11-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. <B>Mikromaailma füüsika.</B> Elektromagnetlainete skaala. Spektraalparameetrid. Planetaarne aatomimudel. Bohri mudel. Elektroni kiiruse, orbiidi raadiuse, impulsimomendi ja energia sõltuvus kvantarvust. Elektroni de Broglie lained. Valguse kiirgumine ja neeldumine Bohri mudeli kohaselt. Spektraalseeriad. Kaasaegne aatomimudel. Kvantarvud ja valikureeglid. Aatom, tuum, nukleon, kvark. Tuumareaktsioonid: lõhustumine ja süntees. Tuumakiirgused ja nende bioloogiline toime. (6 h)"}}, {"time": "2018-12-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9. <B>Optika ja kvantmehaanika põhijooned.</B> Valguse teke, levik ja neeldumine. Valguse peegeldumine ja murdumine. Aine optiliste omaduste tulenevus elektrilistest. Valguse interferents, difraktsioon ja polarisatsioon. Valguse vastastikmõju ainega. Fotoefekt. Soojuskiirgus ja luminestsents. Laseri tööpõhimõte. Kvantmehaanika alused. Määramatuse seosed. Lainefunktsioon kvantmehaanikas, Schrödingeri võrrand. Osakeste tunnelleerumine. Kvantmehaanika tõlgendused. (6 h)"}}, {"time": "2018-12-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10. <B>Molekulaarfüüsika ja termodünaamika.</B> Temperatuur ja soojus. Soojusülekandeprotsessid. Aine agregaatolekud ja siirded nende vahel. Molekulaarkineetilise teooria alused. Ideaalgaas ja reaalgaas. Jaotusseadused. Statistilise füüsika vajalikkus. Termodünaamilised olekuparameetrid (p, V, T, S) ja termodünaamilised potentsiaalid, seosed nende vahel. Termodünaamika printsiibid. (4 h)"}}, {"time": "2018-10-01", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Seminarides</B> (24 h) vastab õppejõud mistahes ainessepuutuvatele küsimustele, harjutatakse probleemide lahendamist ja tehakse kontrolltöid. Toimub 4 kontrolltööd, järgmistel teemadel:\n1. Füüsika üldmudelid ja üldprintsiibid - toimub esmakordselt füüsika-keemia-materjaliteaduse ja matemaatika erialadel (FKM) neljapäeval, 25.10 ning geograafia, geoloogia ja keskkonnatehnoloogia erialadel (GGK) esmaspäeval, 29.10.\n2. Mehaanika, võnkumised, lained (esmakordselt FKM 15.11. ja GGK 19.11.);\n3. Elektromagnetism, relativistlik füüsika (esmakordselt FKM 29.11. ja GGK 03.12.);\n4. Optika, aatomifüüsika, kvantmehaanika (esmakordselt FKM 13.12. ja GGK 17.12.).\n<B>Kontrolltööde hilisema kirjutamise võimalus:</B> alates 11. nädalast igal reedel kell 8.15 kuni 10.00 Physicumi ruumis A106, seega 16.11, 23.11, 30.11, 07.12, 14.12 ja 21.12 saab kirjutada mistahes kontrolltööd."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "5809cd50-bdef-d0b1-1e75-4209c5564c99", "parent_code": "LOFY.01.002", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}