{"uuid": "27874ce8-2b02-d696-27d4-e4384c3a1fab", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-08T13:12:25", "title": {"en": "Modern Physics", "et": "Kaasaegne füüsika"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 48, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course starts with the dicsussion of differences between classical, relativistic and quantum physics. Subsequently, students acquire skills to explain preferentially en clair the basics of relativistic and quantum physics, and to calculate the most important quantities used in relativistic and quantum physics. Finally, students take analogical insight into basics of thermodynamics and statistical physics.", "et": "Kursuse alguses käsitletakse relativistliku füüsika ja kvantfüüsika peamisi erinevusi klassikalisest füüsikast. Seejärel omandavad üliõpilased oskuse selgitada eelistatult tavakeele sõnadega relativistliku füüsika ja kvantfüüsika põhimõisteid ning õpivad arvutama tähtsamaid relativistlikus füüsikas ja kvantfüüsikas kasutatavaid suurusi. Lõpuks tutvuvad üliõpilased analoogiliselt ka termodünaamika ja statistilise füüsika põhimõistetega."}, "objectives": [{"en": "Provide potential teachers with the skills to explain the necessity of relativistic physics, quantum physics, thermodynamics and statistical physics when describing the nature, and with ability to use appropriate (according to the age of school pupils) examples about the application of the previously mentioned descriptions.", "et": "Anda tulevasele õpetajale oskus seletada looduse kirjeldamisel tekkivat vajadust relativistliku füüsika, kvantfüüsika ning termodünaamika ja statistilise füüsika järele, aga ka oskus tuua õppetöös eakohaseid näiteid nende kirjeldusvõtete rakendamise kohta."}], "learning_outcomes": [{"en": "After the course, the students are expected to:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1. Know main differences between classical, relativistic and quantum physics;", "et": "1. Teab relativistliku füüsika ja kvantfüüsika peamisi erinevusi klassikalisest füüsikast;"}, {"en": "2. Be able to calculate the apparent and real relativistic lengths of bodies, the durations of processes, the intervals between events, relativistic momenta and energies;", "et": "2. Oskab relativistlikult arvutada kehade näivaid ja tegelikke pikkusi, protsesside kestusi, sündmustevahelisi intervalle ning relativistlikke impulsse ja energiaid;"}, {"en": "3. Be able to explain the following concepts: de Broglie waves, uncertainty relation, probability density, operator, expectation value, quantum state, eigenfunction, eigenvalue;", "et": "3. Oskab selgitada mõisteid de Broglie lained, määramatusseos, tõenäosustihedus, operaator, ooteväärtus, kvantolek, omafunktsioon, omaväärtusülesanne;"}, {"en": "4. Know the thermodynamic parameters, thermodynamic potentials and correlations between those;", "et": "4. Tunneb termodünaamilisi parameetreid, termodünaamilisi energiaid ja nendevahelisi seoseid;"}, {"en": "5. Be able to explain the concept of distribution function;", "et": "5. Oskab selgitada mõistet jaotusfunktsioon;"}, {"en": "6. Know the Maxwell-Boltzmann, Fermi-Dirac and Bose-Einstein distribution functions and to be able to use them in the simplest cases.", "et": "6. Tunneb Maxwell-Boltzmanni, Fermi-Dirac'i ja Bose-Einsteini jaotusfunktsioone ja oskab neid lihtsamatel juhtudel praktikas kasutada."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltööde  positiivne sooritus"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik eksamitöö"}}], "grade_preconditions": {"et": "Eritingimused puuduvad"}, "grade_evaluation": {"et": "Üliõpilasel tuleb teadmiste ja oskuste kontrolli käigus sooritada kokku 6 hindelist harjutust.\nNeed on:\n1) Relativistliku füüsika (RF) põhideede esitamine õpilasele arusaadavas sõnastuses (kuni 15 p);\n2) Relativistliku füüsika (RF) ülesannete lahendamine (kuni 20 p);\n4) Kvantfüüsika ülesannete kontrolltöö (kuni 20 p); \nKvantfüüsika kontrolltööd on võimalik aine Moodle'i pesas harjutada. \n5) Kvantfüüsika põhideede esitamine õpilasele arusaadavas sõnastuses (kuni 25 p);\n6) Termodünaamilise protsessi graafikute teisendamine Vp-teljestikust TV- ja TS-teljestikesse (10 p);\n7) Statistilise füüsika (SF) põhideede esitamine õpilasele arusaadavas sõnastuses (kuni 10 p).\nKokku 15 + 20 + 20 + 25 + 10 + 10 = 100 punkti.\n\nJuhul kui õppeaine läbitakse kontaktõppes, on lisaks üks nõutavatest ülesannetest aine põhivara tundmise lünktest (kuni 15 p).\nSel juhul väheneb kvantfüüsika osakaal 10 p võrra ja relativistliku füüsika osakaal 5 p võrra, võrreldes eelkirjeldatuga.\nPositiivse koondhinde saamiseks tuleb koguda üle 50 punkti. Samuti tuleb kõik harjutused sooritada positiivsele hindele, st saades vähemasti pooled punktid maksimaalsest võimalikust. Hindeliste harjutuste sooritamise järjestus pole oluline. Niipea, kui on tekkinud valmisolek midagi sooritada, tuleb sellest õppejõule teada anda ning soorituskatse aeg kokku leppida."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne semestri lõppu või uue semestri esimese kahe nädala jooksul (väljaspool ordinaarset õppetööd)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/enrol/index.php?id=2171", "is_moodle_connected": true, "learning_environments": [{"uuid": "23b5ef58-4729-4b0e-a617-121c1662bc6c", "type": "MOODLE", "code": "LOFY.01.114", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1.\tI.Peil, K.Tarkpea. Füüsikalise looduskäsitluse alused. Tartu, EFS, 2014. \n2.\tJ. Lõhmus, R. Veskimäe (toim.). Universumi mikromaailm. 2003.  \n3.\tR. March. Füüsika võlu (Physics for Poets). Ilmamaa, 2000. \n4.\tD. Halliday, R. Resnick, J. Walker. Füüsika põhikursus. 1. ja 2. osa. Tartu, EFS, 2012; originaal: Fundamentals of Physics. Extended version. 8-th ed. Wiley.", "recommended_materials": "Loengute materjalid ÕIS-is ja Moodle's"}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "18d3c48a-4daa-36d6-3378-5e62c582bb8a", "person_name": "Kristjan Kalam", "structural_unit": {"code": "LTFY17", "name": {"en": "Laboratory of Thin Film Technology", "et": "kiletehnoloogia labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-39.n"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1.\t<B>Aine läbimise tingimused. Kaasaegse füüsika eripärad.</B>  Õpiväljundid ja hinde kujunemine aines. Füüsika, vaatleja  ja põhjuslikkus. Looduse struktuuritasandid ja nähtavushorisondid. Mikro-, makro- ja megamaailm. Kehad, liikumine, vastastikmõjud, aine ja väli, laeng, energia, atomism, spinn. Energia miinimumi printsiip, tõrjutusprintsiip, absoluutkiiruse printsiip, dualismiprintsiip, lõtkuprintsiip. Kaasaegse füüsika komponendid: a) relativistlik füüsika (RF), b) kvantfüüsika (KF), c) termodünaamika ja statistiline füüsika (TD ja SF)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.\t<B>Liikumise kirjeldamine.</B> Koordinaadid. Taustsüsteem. Matemaatilised meetodid liikumise kirjeldamiseks. Diferentseerimine ja integreerimine. Liikumisvõrrandid. Kulg- ja pöördliikumise kinemaatika ning dünaamika. Newtoni seadused. Jõumoment, inertsimoment, impulsimoment. Inertsjõud. Töö, energia ja võimsus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3.\t<B>Relativistlik füüsika.</B> Ruum ja aeg kui vaatleja kujutlused. Aja aeglustumine, pikkuste lühenemine, massi suurenemine. Lorentzi tegur. Keha omapikkus, tegelik pikkus ja näiv pikkus. Invariantsusprobleem. Lorentzi teisendused. Massi ja energia samaväärsus. Seisumass ja seisuenergia. Relativistlik impulss ja kineetiline energia. Neljamõõtmeline aegruum. Intervall kahe sündmuse vahel. Üldrelatiivsusteooria eripärad."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4.\t<B>Kvantfüüsika.</B> Elektromagnetlainete skaala. Spektraalparameetrid. Soojuskiirguse seadused. Rayleigh-Jeansi valem. Kvanthüpotees ja Plancki valem. Fotoefekt. Einsteini valem fotoefekti kohta. Vesinikuaatomi  Bohri mudel. Elektroni kiiruse, orbiidi raadiuse, impulsimomendi ja energia sõltuvus kvantarvust. Valguse kiirgumine ja neeldumine Bohri mudeli kohaselt. Spektraalseeriad. Kaasaegne aatomimudel. Kvantarvud ja valikureeglid. Määramatuse seosed. Lainefunktsioon kvantmehaanikas. Operaatorid ja omaväärtusprobleem.  Schrödingeri võrrand. Osakeste tunnelleerumine. Kvantmehaanika tõlgendused. Aatom, tuum, nukleon, kvark. Radioaktiivsus. Tuumareaktsioonid: lõhustumine ja süntees. Tuumakiirgused ja nende bioloogiline toime."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5.\t<B>Termodünaamika ja statistiline füüsika.</B> Temperatuur ja soojus. Soojusülekandeprotsessid. Aine agregaatolekud ja siirded nende vahel. Molekulaarkineetilise teooria alused. Ideaalgaas ja reaalgaas. Termodünaamilised olekuparameetrid (p, V, T, S) ja termodünaamilised potentsiaalid, seosed nende vahel. Termodünaamika printsiibid. Jaotusseadused ja statistiline füüsika. Osakese oleku mõiste. Olekute tihedus. Maxwell-Boltzmanni, Fermi-Diraci  ja Bose-Einsteini jaotusseadused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6.\t<B>Elementaarosakeste füüsika.</B>  Fermionid ja bosonid. Leptonid ja kvargid. Neli peamist vastastikmõju: gravitatsiooniline, elektromagnetiline, nõrk ja tugev. Vastastikmõjud ja atomistlik printsiip."}}]}, "registration_info": {"audience": {"et": "Gümnaasiumi loodusteaduste õpetaja: mag (gümnaasiumi füüsikaõpetaja aineõppe moodul) 2.a"}, "min_students": 3}, "parent_uuid": "fbab0d43-b23e-8395-e331-08fb020ee6e1", "parent_code": "LOFY.01.114", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}