{"uuid": "b3a6dd59-3c48-d939-b613-6568e9572811", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-03T11:13:11", "title": {"en": "Master's Course in Quantum Mechanics", "et": "Kvantmehaanika magistrikursus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "f8698140-7448-36ae-2636-549c9108bdb8", "code": "LOFY.04.073", "title": {"en": "Quantum Mechanics", "et": "Kvantmehaanika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "b299ac20-d3a5-b71c-a781-da8b30df0f9f", "code": "LTFY.04.001", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Quantum Mechanics", "et": "Kvantmehaanika"}, "credits": 5, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Part One: main principles and postulates of quantum mechanics; Planck hypothesis; photoelectronic effect; Millikan experiments; Compton scattering; Schrödinger, Heisenberg and Dirac pictures; coordinate, momentum and energy representations.\nPart Two: quantum theory of scattering (Dyson series, Dirac-Schiff-Fermi golden rule, summation and visualization of Born series); tunnelling and resonance effects; basics of inverse scattering; relationship between reflectionless potentials and solitons.\nPart Three: general eigenvalue problem of angular momentum (solved by Elie Cartan in 1913); spinn momentum and magnetic moment; Stern-Gerlach experiments; Larmor precession; nuclear magnetic resonance; hyper-fine spin-spin interaction and 21 cm line of hydrogen; identical particles and Pauli principle; basics of quantum statistics: fermion and boson systems at low temperatures; Bose-Einstein condensation; general principles of zone theory: Brillouin zone, metals, semiconductors and dielectrics.", "et": "Loengukursuse esimene osa sisaldab arutlusi kvantmehaanika põhiprintsiipide ja -postulaatide sisu ja tähenduse üle, ülevaadet kvantteooria teket enim mõjutanud eksperimentidest (Plancki kvanthüpotees, fotoefekt, Millikani katsed, Comptoni hajumine), näiteid kvantmehaanika deduktiivse ülesehituse erinevatest ekvivalentsetest variantidest (Schrödingeri, Heisenbergi ja Diraci esituste põhivõrrandite tuletamine; koordinaadi-, impulsi- ja energiaesituste eripära).\nTeises osas omandatakse teadmisi hajumise kvantteooriast. Detailsemalt käsitletakse osalainete meetodit ja häiritusest põhjustatud kvantsiirete teooriat (Dysoni rida, Diraci-Schiffi-Fermi kuldreegel, Borni rea summeerimine ja visualiseerimine), samuti mitmesuguseid tunnel- ning resonantsnähtusi. Põgusalt tutvutakse ka pöördhajumisteooria alustega ning selgitatakse mittepeegeldavate potentsiaalide vahetut seost mittelineaarsete evolutsioonivõrrandite kuju säilitavate püsilahendite ehk solitonidega.\nKolmandas osas võetakse vaatluse alla üldine momendi operaatori omaväärtusprobleem (mis lahendati enne kvantmehaanika teket!). Uuritakse spinn-momendi ja spinn-magnetmomendi mõistete füüsikalist sisu ning osakeste spinniga seotud eksperimente ja rakendusi (Stern-Gerlachi katsetulemuste tõlgendamine, Larmori pretsessioon ja tuumamagnetresonants, ülipeen-vastasmõju ja vesiniku 21-cm joon). Analüüsitakse osakeste eristamatuse printsiibist tulenevaid järeldusi (Pauli keeluprintsiip), spinni otsest mõju kvantansamblite omadustele (Maxwell-Bolzmanni, Fermi-Diraci ja Bose-Einsteini jaotusseadused), selgitatakse elektronide tsooniteooria üldprintsiipe, Brillouini tsooni mõistet, tahkiste klassifikatsiooni elektrijuhtivuse alusel (metallid, pooljuhid, dielektrikud), Bose-Einsteini kondensatsiooni olemust jne.\nLisainfo: vt Õppematerjale."}, "objectives": [{"en": "The goal of the lecture course is to deepen and increase the knowledge in these topics of the standard course of quantum mechanics, which form the theoretical basis of material science, optics and spectroscopy, bio- and radiation physics, quantum infotechnology and other fields of experimental physics. Theoretical support to the students specializing in these directions, their preparation for the individual professional work and self-education, improving their skills to solve practical problems are the objectives of this course.", "et": "Loengukursuse eesmärk on süvendada ja täiendada teadmisi neis kvantmehaanika standardse kursuse teemades, mis moodustavad materjaliteaduse, optika ja spektroskoopia, bio- ja kiirgusfüüsika, kvant-infotehnoloogia jt tänapäeva eksperimentaalfüüsika suundade teoreetilise lähtealuse. Soovitakse anda neis suundades spetsialiseeruvatele üliõpilastele teooria-alast tuge, praktiliste probleemide lahendamise oskusi ning ettevalmistust edaspidiseks tööks ning iseseisvaks enesetäienduseks oma erialal.."}], "learning_outcomes": [{"en": "After completing this Master course a student", "et": "Selle magistrikursuse lõpetanud üliõpilane"}, {"en": "- can describe the most important experimental and theoretical achievements that contributed to the birth of quantum mechanics (years 1887-1926);", "et": "- teab, miks üldse, mismoodi ja tänu kellele kvantmehaanika tekkis: oskab kirjeldada tähtsamaid eksperimentaalseid ja teoreetilisi saavutusi aastatel 1887-1926;"}, {"en": "- can describe different formalisms and representations of quantum mechanics, explain physical contents and mathematical background of basic postulates;", "et": "- tunneb kvantmehaanika erinevaid formalisme ja esitusi, oskab selgitada põhipostulaatide füüsikalist sisu ja matemaatilist tagapõhja;"}, {"en": "- has an adequate understanding of the relationship between classical analytical mechanics and quantum mechanics (Poisson brackets and commutation rules, trajectories in Hamilton phase space and quasiclassical approximation, momentum eigenvalue problem and the spin);", "et": "- omab adekvaatset arusaamist klassikalise analüütilise mehaanika ja kvantmehaanika vahekorrast (Poissoni sulud ja kommutatsioonireeglid, trajektoorid Hamiltoni faasiruumis ja kvaasiklassikaline lähendus, momendi omaväärtusprobleem ja spinn);"}, {"en": "- understands the difference between macroscopic and microscopic states of a statistical assembly, and the connection between the indistinguishability principle and Pauli exclusion principle, can derive Maxwell-Boltzmann, Fermi-Diraci anda Bose-Einstein distributions, and explain the phenomenon of Bose-Einstein condensation;", "et": "- oskab eristada statistilise ansambli makroskoopilisi ja mikroskoopilisi seisundeid, seostada osakeste eristamatuse printsiipi ja Pauli keeluprintsiipi, tuletada Maxwell-Boltzmanni, Fermi-Diraci ja Bose-Einsteini jaotusseadusi, selgitada Bose-Einsteini kondensatsiooni teket;"}, {"en": "- knows the basic terms of the scattering theory - scattering matrix, phase shift, scattering amplitude and cross-section, Levinson theorem, scattering length, Born approximation; ", "et": "- tunneb hajumisteooria põhimõisteid - hajumismaatriks, faasinihe, hajumise amplituud ja ristlõige, Levinsoni teoreem, hajumise pikkus, Borni lähendus;"}, {"en": "- can describe tunnel and resonance effects, calculate transparency and reflectivity of a potential barrier, apply transfer matrix method;", "et": "- oskab kirjeldada tunnel- ja resonantsefekte, arvutada potentsiaalibarjääri läbilaskvus- ja peegelduskoefitsienti, kasutada ülekandemaatriksi meetodit;"}, {"en": "- has an idea of the methods of solution of the inverse Schrödinger problem (or the inverse scattering problem), and the related applications, knows what is soliton.", "et": "- omab ettekujutust ühemõõtmelise Schrödingeri võrrandi pöördülesande (ehk hajumisteooria pöördülesande) lahendusmeetoditest ja rakendustest, teab, misasi on soliton."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Igale kodutööle seatakse konkreetne tähtaeg ning tähtajaks esitatud lahendusi arvestatakse koefitsiendiga 1.0. Kodutööde lahendusi ja parandusi võib esitada ka pärast tähtaega: neid arvestatakse koefitsiendiga 0.7. Järelikult, kui te tähtajaks ühtki lahendust ei esita, võite kodutööde eest koguda maksimaalselt 21 punkti (0.7*30=21). Samas võite teenida mõne lisapunkti originaalsuse, põhjalikkuse vms eest."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Eksamihinne moodustub järgmistest komponentidest:\nkodutööd kokku - 30 punkti;\nkontrolltöö nr 1  - 30 punkti;\nkontrolltöö nr 2  - 30 punkti;\nsuuline vestlus  - 10 punkti.\nPunktid summeeritakse ja kogusumma määrabki eksamihinde.\nLävendid: hinne A - 90 punkti; B - 80 punkti; C - 70 punkti; D - 60 punkti; E - 50 punkti; F - 1 punkt."}}], "grade_preconditions": {"et": "Kodutööde õigeaegne esitamine, mõlema kontrolltöö positiivne sooritus"}, "grade_evaluation": {"et": "Kontrolltööde ja kodutööde ning suulise vestluse eest saadud punktide kogusumma määrab eksamihinde."}, "debt_elimination": {"et": "Korduseksami peab sooritama hiljemalt järgneva semestri alguseks.\nKorduseksami tähtaega võib dekaan õppejõu taotlusel pikendada kuni 2 nädala võrra."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a0a81209-8b48-44a5-8d49-3af94335c4c9", "type": "MOODLE", "code": "LOFY.01.045", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Matti Selg, Sissejuhatus hajumise kvantteooriasse (Tartu Ülikooli kirjastus, 2015) (saadaval FI raamatukogus ja TÜ raamatukogus).\nNB! Kohustuslikuks õppematerjaliks on selle õpiku peatükid, mida toetavad vastavad loengumaterjalid (vt kataloogi \"Õppematerjalide haldamine\").", "recommended_materials": "David J. Griffiths, Introduction to quantum mechanics, 2nd edn (Harlow: Pearson, 2014) (http://www.ester.ee/record=b3517064*est).\nJean-Louis Basdevant, Jean Dalibard, The quantum mechanics solver: how to apply quantum theory to modern physics (Springer, 2000) (http://www.ester.ee/record=b1384785*est).\nMatti Selg, Sissejuhatus hajumise kvantteooriasse [Võrguteavik], I osa: Kvantmehaanika põhiprintsiibid, hajumine tsentraalsümmeetrilises väljas, resonants- ja tunnelefektid, spinn ja statistika (http://dspace.ut.ee/handle/10062/58906).\nMatti Selg, Sissejuhatus hajumise kvantteooriasse [Võrguteavik], II osa: Pöördhajumisteooria elemente: supersümmeetriline kvantmehaanika, läbipaistvad potentsiaalid, solitonid\n(http://dspace.ut.ee/handle/10062/58907)."}, "participants": {"lecturers": [{"person_uuid": "b7ba7f7e-2d64-0938-10dd-aabb0a3130b4", "person_name": "Matti Selg", "structural_unit": {"code": "LTFY19", "name": {"en": "Laboratory of Theoretical Physics", "et": "teoreetilise füüsika labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-39. näd. 4L nädalas -> E"}, "entries": [{"time": "2022-02-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Miks, mismoodi ja tänu kellele kvantmehaanika tekkis\nKVANTMEHAANIKA SEOSTEST ANALÜÜTILISE MEHAANIKAGA:\nOsakese-laine dualism - järeldus Hamiltoni printsiibist? Ajast sõltumatu Schrödingeri võrrandi \"tuletamine\""}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "KVANTMEHAANIKA SEOSTEST ANALÜÜTILISE MEHAANIKAGA:\nfaasiruumi trajektoorid ja kvaasiklassikaline lähendus; Poissoni sulud ja operaatorite kommutatsioonireeglid"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "b4b74158-9901-dec7-9d8a-fab8085d608a", "parent_code": "LOFY.01.045", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}