{"uuid": "f5b7f543-4d43-af0f-f82d-41deeacc1ac6", "code": "lt-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Magnetic Materials", "et": "Magnetmaterjalid"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": false, "uuid": "5809cd50-bdef-d0b1-1e75-4209c5564c99", "code": "LOFY.01.002", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course starts up with the introduction of the electromagnetic field in terms of the effect on the potentially current-based performance of the device prototypes, as well as the physical quantities and units describing the field. Classification of the materials related to their diamagnetic, paramagnetic and ferromagnetic behavior will be given. The importance of the main parameters of the magnetic hysteresis curve - remnant induction, saturation and coercive force - will be emphasized. Temperature- and synthesis-dependent magnetization of the materials will be overviewed, as well as the problems connected to the scaling down the dimensions of the layered magnetic materials and improvement of their chemical purity. Principles of the magnetic information storage, memories and magnetic writing heads will be presented. Anisotropic and giant magnetic resistance will be characterized. Attention will be paid to the spintronics and its prospectives. Magnetic semiconducting materials will be briefed. The audience will become aware of some issues related to the deposition and technology of magnetic solid state materials and devices. Problems related to the reproducibility and reliability in terms of the preparation of nanodimensional materials demonstrating adequate magnetic behavior when grown over large areas or on nanoporous substrates in the form of nanorods or nanotubes will be addressed.", "et": "Kursuse alguses kirjeldatakse elektri- ja magnetvälja voolupõhiselt ja poolusepõhiselt, samuti magnetvälja iseloomustamisel vajalikke füüsikalisi suurusi ja ühikuid. Magnetmaterjale klassifitseeritakse vastavalt nende dia-, para- ja ferromagnetilistele omadustele. Tutvustatakse magnetilise hüstereesisilmuse parameetreid: jääkinduktsiooni, küllastust ja koertsitiivsust. Samuti tutvustatakse magneetumuse temperatuurisõltuvusi ja sõltuvust reaalse materjali sünteesiprotsessi parameetritest ning sünteesitud magnetilise tahkise dimensioonidest ja keemilisest koostisest. Kirjeldatakse magnetilise infosalvestuse, mälukeskkondade ja magnetpeade tööpõhimõtteid või struktuuri. Kirjeldatakse magnetotakistuslikke nähtusi nagu anisotroopne magnetotakistus (AMR) ja hiiglaslik magnetotakistus (GMR) ning magnetpäid, samuti magnetilisi muutmälusid. Tähelepanu pööratakse spintroonikale ja kirjeldatakse magnetilisi pooljuhte. Tutvutakse materjalide saamisprotsesside ja tehnoloogiaga, kaasa arvatud võimalused sünteesida rahuldavaid magnetilisi karakteristikuid näitavaid materjale suurtel pindaladel ja madalatel temperatuuridel nanomeetrite suurusjärgus mõõdetavate paksusega kihtidena. Kirjeldatakse ferriitstruktuuride kolmedimensionaalse sadestamise meetodeid nanopoorsel substraadil nanotorude või - varrastena."}, "objectives": [{"en": "Physics behind the electromagnetic field as well as physical units used to describe the magnetic phenomena will be treated. The nomenclature of the magnetic materials will be given. Properties and applications of the magnetic materials will be described, with emphasis on the build-up and construction of the contemporary magnetoelectronic devices. Prospective materials allowing the creation of nanodimensional devices will be dealt with, as well as the problems related to the processing of such materials.", "et": "Käsitletakse magnetvälja kirjeldavaid füüsikalisi suurusi ning ühikuid, ainete magnetiliste omaduste füüsikalisi aluseid ja magnetmaterjalide nomenklatuuri. Vaadeldakse magnetmaterjalide omadusi ja rakendamise iseärasusi ning nende arvestamist kaasaaegsete seadmete konstruktsioonis. Käsitletakse nanodimensionaalsete magnetseadmete arendusperspektiive ja probleeme."}], "learning_outcomes": [{"en": "In the end, the students will become introduced to the following:", "et": "Kursuse lõpuks üliõpilased"}, {"en": "1)\tknowing the physical units and measurement methods relevant to the magnetic materials;", "et": "1. Tunnevad magnetmaterjalide iseloomustamiseks vajalikke füüsikalisi mõõtühikuid ja mõõtemeetodeid."}, {"en": "2)\tchemical compounds and materials as constituents of the contemporary and advanced magnetic devices, as well as some of the fabrication methods of these materials;", "et": "2. On tutvunud magnetiliste seadmete väljatöötamisel kasutatavate keemiliste ühendite ja materjalidega, samuti mõningatega nende fabritseerimise viisidest."}, {"en": "3)\tawareness of the configuration and working principles of devices based on magnetic information storage;", "et": "3. On kursis magnetiliste infosalvestusseadmete konfiguratsiooni ja tööpõhimõtetega."}, {"en": "4)\tknowledge on the current concepts of the development of devices based on the magnetic phenomena: scaling-down the dimensions of the planar devices, three-dimensional structures based on nanotubes and nanorods.", "et": "4. On tutvunud seadmete arendustöös oluliseks peetavaid põhikontseptsioone: nt. seadmed nanomeetriliste paksustega tahkiskihtidel, kolmedimensionaalsed struktuurid nanotorudel ja nanovarrastel."}], "notes": {"et": "Ainet loetakse üle aasta!"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Kirjalik referaat ja suuline seminariettekanne."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik eksam loengumaterjalide alusel"}}], "grade_preconditions": {"et": "Osalemine loengutes ja ettekanne või referaat valitud allikamaterjali alusel."}, "grade_evaluation": {"et": "Loengukursus lõpeb eksamiga. See sooritatakse loengus esitatud materjalide alusel. Lisaks loengutele tuleb eksaminandil eelnevalt esitada suuline ettekanne valitud ja magnetiliste materjalidega seonduval teemal seminaris ja esitada kirjalik referaat samal teemal."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne uue semestri algust."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "1. Nicola A. Spaldin, Magnetic Materials: Fundamentals and Device Applications, Cambridge 2006, (eestikeelne tõlgitud ja laiendatud konspekt, saadaval kursuse jooksul lektorilt).\n2. D. Halliday, R. Resnick, J. Walker, Füüsika põhikursus, II köide, Magnetväljad alates lk. 735, Elektrivoolu magnetväljad lk. 764, Induktsioon ja induktiivsus lk 791. (Eestikeelse tõlgitud köite eksemplarid saadaval Physicum'i raamatukogus)", "recommended_materials": "1. Materials Science and Technology. A comprehensive treatment. Eds. R. W. Cahn, P. Haasen, E. J. Kramer, Volume 3, A and B \"Electronic and magnetic properties of metals and ceramics\", Volume editor K.H. J. Buschow. (inglise keeles, koopia saadaval Physicum'i raamatukogus).\n2. Fundamentals of nanotechnoloy,  G. L. Hornyak, J. J. Moore, H. F. Tibbals, J. Dutta,  \nChapter 5:  Nanomagnetism, pp. 203-236  (2009) Taylor & Francis Group, LLC (elektroonne koopia vajadusel lektorilt)"}, "participants": {"lecturers": [{"person_uuid": "af72b6d5-651c-e42d-e9db-a402974684ae", "person_name": "Kaupo Kukli", "structural_unit": {"code": "LTFY02KT", "name": {"en": "Laboratory of Thin Film Technology", "et": "kiletehnoloogia labor"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY02", "is_expired": true}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "9.-16. n. 4 L n-s, ref => E"}, "entries": [{"time": "2018-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 1\nSissejuhatav loeng. Loenguprogrammi tutvustus. Kursuse läbimise tingimuste tutvustamine. Magnetiliste salvestuskeskkondade üldine tutvustus ja selle sidestamine nanotehnoloogia teekaartide ja arenguga. Magnetmaterjalide klassifitseerimise alused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 2\nÜhikute ja mõõdetavate suurustega tutvumine. Magnetvälja tugevus. Magnetmoment. Magnetiline dipool. Magnetiline induktsioon. Magneetumine. Magnetvoog. Voo tihedus. Magnetilised vastuvõtlikkus ja läbitavus. Magnetiline hüsterees. SI ühikud ja cgs ühikud."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 3\nMagnetismi atomaarsed põhjused. Kvantarvude tähendusest. Harilik Zeemani efekt. Elektroni spinn. Pauli printsiip. Spinn-orbitaal vastasmõju. Hundi reeglid orbitaalide täituvusel elektronidega."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 4 \nDomeenid ferromagnetilises materjalis. Domeenide visualiseerimisest. Domeenide tekkepõhjustest. Magnetostaatiline energia. Magnetokristalliline energia. Magnettõkisenergia. Demagneetiv väli. Domeeniseinad. Hüstereesi tekkepõhjused ja domeeniseinte liikumine. Hüstereesikõvera põhiparameetrid ja magnetmaterjalide - tugevate ja pehmete - klassifitseerimine nendepõhiselt."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 5\nMagnetokristalliline anisotroopia materjalis, sümmeetria ja tekkepõhjused. Kujuanisotroopia ja demagneetiva välja mõju. Anisotroopse materjali saamise traditsioonilisi võimalusi."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 6\nMagnetilised salvestuskeskkonnad - magnetlint, kõvaketas. Salvestus- ja lugemispea. Õhukesekileline salvestuskeskkond. Osakeseline salvestuskeskkond. Ferromagnetiline hüsterees ja informatsioonisalvestus. Väikeste materjaliosakeste magnetilised omadused. Ühedomeenilised osakesed. Osakestevaheline magnetiline vastasmõju ja magneetumise mehhanism. Superparamagnetism. Superparamagnetiline piir andmesalvestusel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 7\nKõvaketta ehitus. Salvestuskeskkondade ettevalmistusest kettal. Piki- ja ristsalvestus. Katoodtolmustamise kui sadestusmeetodi parameetrite mõjust salvestuskeskkonna kvaliteedile. Musterdatud andmesalvestuskeskkond."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 8\nKirjutamis- ja lugemispead, nende arengust ja probleemid. Soojuslikust magnetsalvestusest. Magnetotakistus tavametallides ja ferromagnetilistes metallides. Anisotroopne magnetotakistus. Magnetiline tunnelsiire. Suur magnetotakistus. Spinnventiil. Magnetotakistuslikud lugemispead. Kolossaalne magnetotakistus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 9\nMagnetferriitsüdamikud. Magnetilised suvapöördmälud (MRAM) kui magnetiline kiiptehnoloogia. Spinnelektroonika."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 10\nTunnelmagnetotakistuslike mälupesade ja spinnventiilide ehitusmaterjalidest. Magnettakistuslike mälukiipide võrdlusest teiste arvutimälutehnoloogiatega."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 11\nMagnetoptika. Kerri efekt. Faraday efekt. Magnetoptiliste efektide füüsikalistest alustest. Magnetoptiline materjalipinna evalueerimine. Magnetoptiline andmesalvestus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 12\nMagnetjõumikroskoopia. Andmete salvestamine magnetjõumikroskoobiga. Musterdatud magnetsalvestuskeskkonna tulevikuväljavaadetest."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 13\nMagnetomeetria. Vibreeriva testobjektiga magnetomeetria. Optiline magnetomeetria. Magnetotakistuslik sondeerimine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 14\nMagnetmaterjalide kasvatusmeetodid võrdlevalt. Magnetiliste nanostruktuuride kontrollitud sünteesi võimalustest. Musterdatud salvestuskeskkondade ehitamisest."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "LOENG 15\nKonkureerivad mälumaterjalid ja -kontseptsioonid võrdluses magnetmaterjalide ja magnetsalvestuskeskkondadega."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "LOENG 16\nSeminariettekanded. Ref Volume 3, A and B Volume 3, A and B eratiivse iseseisva töö arutelu ja/või teemade jagamine ning täpsustamine. Kordamisküsimused."}}]}, "registration_info": {"audience": {"et": "füüsika, keemia, materjaliteadus, infotehnoloogia"}, "min_students": 5}, "parent_uuid": "09738b7b-d911-8a4b-817c-1ffa1fb3d64c", "parent_code": "LOFY.02.047", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}