{"uuid": "31407780-9081-d1bc-9714-41cf4dd82118", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T19:21:15", "title": {"en": "Electricity and Magnetism", "et": "Elekter ja magnetism"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 48, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 76, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "d9c042dc-c235-4ed6-9c9a-9ba4e3ba4056", "code": "LOFY.01.121", "title": {"en": "Physics and Engineering", "et": "Füüsika ja tehnika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "5809cd50-bdef-d0b1-1e75-4209c5564c99", "code": "LOFY.01.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "d8d6267d-49b7-25bc-cdb2-31249425aaf0", "code": "LOFY.01.091", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course begins with the brief introduction into the basics of electromagnetic phenomena. The discussion on the direct and alternating currents, the electrostatics, magnetostatics and dynamic electromagnetic field follows. Next, the following topics are in the main focus of attention of the given course: the polarization and magnetization of the matter and finally the specific electromagnetic materials and devices.", "et": "Aine algab ülevaatega elektromagnetismi põhimõistetest. Seejärel käsitletakse alalis- ja vahelduvvoolu, elektro- ja magnetostaatikat ning muutuvat elektromagnetvälja. Vaadeldakse aine polariseerumist ja magneetumist ning kõige lõpuks eriotstarbelisi elektromagnetilisi materjale ja -seadmeid."}, "objectives": [{"en": "The main goal of the course is to give the systematic overview considering the description of electromagnetic phenomena using four field vectors (E, D, B, H). This overview is based on the methods of mathematical physics. The static electric, magnetic and dynamic electromagnetic fields, as well as their interaction with the matter are considered. Finally, the most important applications of electromagnetic phenomena in physics and technology are introduced.", "et": "Anda matemaatilise füüsika meetoditele tuginev süstemaatiline ülevaade elektromagnetnähtuste kirjeldamisest nelja väljavektori (E, D, B, H) abil, käsitledes elektromagnetvälja staatilisi ja dünaamilisi avaldumisvorme ning vastastikmõju ainega. Tutvustada elektromagnetismi olulisemaid füüsikalis-tehnilisi rakendusi."}], "learning_outcomes": [{"en": "Upon completion of this course, the student should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Possess the knowledge considering the vocabulary and definitions necessary for the characterization of electromagnetic field in vacuum as well as in matter (i.e., vectors E, D, P, B, H and M, their functions and mutual relationships, potentials of the electric and magnetic field, the permeabilities and susceptibilities of the matter);", "et": "1. Valdab elektromagnetvälja karakteriseerimiseks vaakumis ja aines vajalike mõistete aparaati (vektorid E, D, P, B, H ja M, nende otstarve ning omavahelised seosed, elektri- ja magnetvälja potentsiaalid, aine läbitavused ning vastuvõtlikkused);"}, {"en": "2. Describe the electric or magnetic field (with the aid of field lines) generated by field sources possessing up to three dimensions and different geometry (i.e., point, straight line, round, plane, sphere), and characterize the dependence of field vectors (E or B) on the system parameters;", "et": "2. Oskab kuni kolmemõõtmeliste ja erineva geomeetriaga väljatekitajate (punkt, sirglõik, ring, tasand, sfäär) korral kirjeldada tekkivat elektri- või magnetvälja jõujoonte abil; oskab iseloomustada väljavektori (E või B) sõltuvust süsteemi parameetritest;"}, {"en": "3.  Formulate the Maxwell equations in their integral or differential form and explain the corresponding mathematical representations (e.g., the linear, surface and volume densities of quantities, linear and surface integrals, gradient, flux, divergence, circulation, curl), as well as correlate the Maxwell equations with the certain electromagnetic phenomena;", "et": "3. Suudab formuleerida Maxwelli võrrandeid integraal- ja diferentsiaalkujul, oskab selgitada seejuures kasutatavaid matemaatilisi võtteid (suuruste joon-, pind- ja ruumtihedused, joon- ja pindintegraalid, gradient, voog, divergents, tsirkulatsioon, rootor) ning seostada Maxwelli võrrandeid konkreetsete elektromagnetnähtustega;"}, {"en": "4. Calculate the current values in the different parts of AC and DC circuits, the voltage values on the certain components of these circuits and the power values generated in those components; draw the phasors of the AC circuits with the given parameters;", "et": "4. Oskab arvutada voolutugevusi hargnevate alalis- ja vahelduvvooluahelate eri osades, arvutada pingeid nende ahelate konkreetsetel komponentidel ja neis komponentides eralduvaid võimsusi; oskab joonistada etteantud parameetritega vahelduvvooluahela faasordiagrammi;"}, {"en": "5. Explain the functioning principles of the widely applied electromagnetic materials (metals, dielectrics, piezoelectrics, ferromagnetics, electrolytes, semiconductors, superconductors, gas discharge plasma) and devices (capacitor, inductive coil, electromagnet, resonance circuit, transformer, electric motor, generator, thermocouple, piezoelectric sensors and actuators, Hall sensor, mass spectrometer, electro-optical lens, semiconducting devices, magnetic memory devices);", "et": "5. Suudab selgitada rakenduslikult oluliste elektromagnetiliste materjalide (elektrotehnilised metallid, dielektrikud, piesoelektrikud, ferromagneetikud, elektrolüüdid, pooljuhid, ülijuhid, gaaslahendusplasma) ning seadmete (kondensaator, induktiivpool, elektromagnet, võnkering, trafo, elektrimootor, generaator, termopaar, piesoandurid ja -täiturid, Halli andur, massispektromeeter, elektronlääts, pooljuhtlülitused, mäluseadmed) funktsioneerimist;"}, {"en": "6. Solve the problems considering the electromagnetic phenomena (within the level of examples presented during the seminars).", "et": "6. Suudab lahendada elektromagnetismi-alaseid ülesandeid aine seminariõppuste kavaga määratud tasemel."}], "notes": {"et": "Aine toimumiskava kehtib esialgse orientiirina. Kui peaks järsult suurenema viiruseohu tõenäosus, siis asutakse loengutel eelkõige demonstreerima katseid ning faktoloogilisi teadmisi tuleb üliõpilastel omandada õppematerjalide abiga iseseisvalt."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Peamine hindamismeetod on ülesannete lahendamise oskust kontrolliv kirjalik test, mille positiivseks soorituseks loetakse vähemasti poolte punktide saamist maksimaalsest võimalikust. Seminariõppuste 1. kontrolltöös tuleb: a) täita elektromagnetismi põhimõistete alane lünktest või joonistada ühele A4 lehele vastav skeem ja b) sooritada eeldusaine LOFY.01.002 Füüsikaline maailmapilt standardne elektritest, mida saab eelnevalt veebipõhiselt harjutada. Seejuures osad (a) ja (b) annavad võrdselt punkte, kontrolltöö positiivne tulemus eeldab mõlema poole positiivset sooritust. Seminariõppuste 2., 3. ja 4. kontrolltöös tuleb lahendada ülesandeid, mis on seminarides lahendatud ja koduseks iseseisvaks lahendamiseks antud ülesannete analoogid. Seega eeldab toimetulek piisavat tegelemist iseseisva tööga. Väljundeid 1-5 kontrollivate kirjalike eksamiülesannete lahendamisel tuleb reeglina täiendada mingit joonist või graafikut viisil, millest ilmneb väljundi saavutatus. Aktiivne osalemine auditoorses töös formuleeritud probleemide lahendamisel võimaldab üliõpilastel koguda lisapunkte, mis tõstavad lõpphinnet. Eksamitöö kirjutamisel on lubatud kasutada valemite lehte, mis tohib sisaldada ainult valemeid, mitte sõnu. Nõutav on materjalis orienteerumise oskus, mis võimaldab vajalikku valemit ka kommentaaride puudumisel ära tunda."}}], "grade_preconditions": {"et": "Lõpphinnet mõjutavad punktid akumuleeruvad aine läbimise käigus ja formaalsed kriteeriumid eksamile pääsemiseks puuduvad. Siiski on ülimalt ebareaalne jõuda positiivse tulemuseni, alustades õppimist alles vahetult enne eksamit. \n\nEksamitööd kirjutama lubatakse üliõpilased, kes on positiivselt sooritanud esimese  kontrolltöö (elektromagnetismi põhimõisted) mõlemad osad (a ja b). Formaalselt tähendab see 5 kuni 10 punkti saamist lõpphinnet määravast sajast punktist."}, "grade_evaluation": {"et": "Toimub neli kontrolltööd. \nNeist esimene kontrollib elektromagnetismi põhimõistete (teema 2) omandatust ja annab kuni 10% lõpphindest. Kolm ülejäänud kontrolltööd mõõdavad ülesannete lahendamise oskust teemade 3-10 osas ja annavad kokku kuni 40% lõpphindest. Kuni 50% lõpphindest annab eksamitöö. Sellele lisanduvad aktiivsuspunktid, mida antakse peamiselt neile, kes demonstreerivad teistele üliõpilastele koduülesannete või eksamiülesannete õiget lahendamist. Eksamile pääsemise eeltingimuseks on esimese kontrolltöö positiivne sooritus. 2., 3. ja 4. kontrolltöö sooritamiseks antakse üks võimalus seminariõppuste käigus ja selle kasutamata jäämisel (mitteosalemise või negatiivse tulemuse korral) üks lisavõimalus seminariõppuste lõpul. Ülesannete kontrolltööde positiivne tulemus (üle 20 punkti saamine maksimaalsest võimalikust 40-st lõpphinnet määravast punktist) on kohustuslik aine läbimiseks (õpiväljund 6). Eksami positiivne sooritus eeldab väljundeid 1-5 kontrollivate ülesannete (kõigi!) positiivseid tulemusi eksamitöös. Korduseksamil võib piirduda vaid nende väljundiliste ülesannete lahendamisega, mille osas eelmise eksami tulemus oli negatiivne. Aktiivsus nii seminariõppustes kui loengutel annab lisapunkte lõpphinde arvestusse (kuni 5 + 5 punkti summaarsest 100-st). Hinnetele A ja B pretendeerijate teadmisi võidakse täiendavalt kontrollida eksami suulises osas. Õigus taotleda eksami suulist osa on kõigil üliõpilastel, kes kirjalikes kontrollivormides on kogunud üle 70% võimalikest punktidest. Hinne võib langeda, kui eksami suulises osas selguvad olulised puudujäägid väljundilistes oskustes."}, "debt_elimination": {"et": "1. kontrolltöö tegemiseks saab iga üliõpilane kaks võimalust, sõltumatult nende kasutamise ajast. 2., 3. ja 4. kontrolltöö sooritamiseks antakse üks võimalus seminariõppuste käigus ja selle kasutamata jäämisel (mitteosalemise või negatiivse tulemuse korral) üks lisavõimalus seminariõppuste lõpul. Kui selle tulemus on negatiivne, siis tuleb positiivselt sooritada eksam, mispeale üliõpilane saab veel ühe lisavõimaluse ülesannete kontrolltööde tegemiseks enne uue semestri algust. Eksami positiivne sooritus eeldab õpiväljundeid 1-5 kontrollivate ülesannete (kokku 5) positiivseid tulemusi eksamitöös. Korduseksamil võib piirduda vaid nende väljundiliste ülesannete lahendamisega, mille osas eelmise eksami tulemus oli negatiivne. Üliõpilased, kel on järgmise semestri esimeseks päevaks säilinud mingi võlgnevus (õpiväljundit kontrolliva ülesande või seminariülesannete koondtesti tulemus ikka veel negatiivne) - saavad puuduliku lõpphinde ja on oodatud aines uuesti osalema alles selle järgmisel toimumisel."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/elmag/", "is_moodle_connected": false, "mandatory_materials": "1. W.Duffin, Electricity and Magnetism.  4-th ed. McGraw-Hill, 1990 - põhiõpik. \n2. Halliday, Resnick & Jearl Walker. Füüsika põhikursus. 2. osa. Tartu, EFS, 2012; originaal: Fundamentals of Physics. Extended version. 8-th ed. Wiley, 2008. Õpik nüüd ka eesti keeles saadaval; füüsikaraamatukogus olemas mitmekümnes eksemplaris; hästi illustreeritud ning aine omandamist mitmel moel toetav, kuid käsitleb elektromagnetvälja lihtsustatult - piirdudes nelja asemel vaid kahe vektorväljaga E ja B. \n3. K.Kudu, Üldfüüsika ülesannete kogu. Elekter ja magnetism, TÜ, Tartu 1981. \n4. Veebi <a href=\"https://sisu.ut.ee/elmag/\">https://sisu.ut.ee/elmag/</a> linkidest avanevad allikad.", "recommended_materials": "1. M.Alonso, E.Finn, Fundamental University Physics, v.2, Fields and Waves, Addison-Wesley, 2-nd edition, 1983.  \n2. M.Alonso, E.Finn, Physics, Addison-Wesley, 1995.\n3. J.Jackson, Classical Electrodynamics, John Wiley & Sons, 3rd edition, New York, etc., 1998. \n4. S.G.Kalashnikov, Elektrichestvo, Nauka, Moskva 1985. \n5. K.Tarkpea, Füüsika XI klassile, I osa: Elekter ja magnetism, Koolibri, Tallinn 2003. \n6. K.Tarkpea, Füüsika XI klassile, II osa: Elektromagnetism, Koolibri, Tallinn 2008. \n7. K.Kudu, Elektripraktikumi tööjuhendid, TÜ, Tartu 1982 (koos hilisemate täiendustega). \n8. O.Mankin, Elektrostaatika üldfüüsika kursuses, TÜ, Tartu 1976, Alalisvool üldfüüsika kursuses, TÜ, Tartu 1976, Elekter ja magnetism, TÜ, Tartu 1985."}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "7d629cdb-15f7-3bad-c76e-d4a3dfd438e6", "person_name": "Indrek Jõgi", "structural_unit": {"code": "LTLT01", "name": {"en": "Centre of Doctoral Studies", "et": "doktoriõppe keskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTLT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "ce25b679-6468-3324-28f9-fa83a6a0f801", "person_name": "Jasper Ristkok", "structural_unit": {"code": "LTFY18", "name": {"en": "Laboratory of Plasma Physics", "et": "plasmafüüsika labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-12.n. 4L n-s; 1.-16.n. 2S n-S; 4 knt => E"}, "entries": [{"time": "2024-09-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>Loengud (48 h): </B>\n<B>1. Ülevaade töökorraldusest (4 h) </B>\nAines esitatavad nõudmised. Eksamitöö struktuur. Kolmest tarvitist koosneva, nii jada- kui rööpühendust sisaldava vooluahela ülesanne põhikooli tasemel (eeldades takistuste konstantsust), gümnaasiumi tasemel (arvestades takistuse sõltuvust temperatuurist) ja ülikooli tasemel (arvestades võimalikke faasinihkeid)."}}, {"time": "2024-09-03", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "<B>2. Elektromagnetismi põhimõisted (iseseisev töö e-õppes)</B>\nLaengu mõiste. Kahte liiki elektrilaengud.  Elementaarlaeng. Laengu jäävus. Indutseeritud laengud. Elektrivool, voolutugevus, ühikud amper ja kulon. Voolu suuna sõltumatus laengukandjate märgist. Coulomb'i seadus. Punktlaeng. Elektrostaatiline väli. Püsimagnetite ja voolude vastastikmõjud. Ampere'i seadus. Elektrivälja tugevus E  ja magnetinduktsioon B. Punktlaengu väljatugevus ja sirgjuhtme magnetinduktsioon. Välja jõujooned. Töö elektriväljas, pinge ja potentsiaal. Jõu, vooluelemendi ning E- ja B-vektorite suunad. Elektrostaatilise välja konservatiivsus ja potentsiaalsus ning magnetvälja solenoidaalsus, selle põhjused. Võrdetegurid Coulomb'i ja Ampere'i seadustes. Elektrikonstant ja magnetkonstant. Elektrinihe D  ja magnetvälja tugevus H. Lorentzi jõud. Pinge magnetväljas liikuva juhtmelõigu otstel. Pööriselektriväli. Mõisted: elektromotoorjõud, elektrimahtuvus, magnetvoog ja induktiivsus. \n<B> Esimene võimalus läbida vastavate teadmiste kontroll avaneb kolmapäeval, 25.09.2024 </B> (FMP taseme kontrolltöö)"}}, {"time": "2024-09-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>3. Alalisvool ja elektriahelad (4 h) </B>\nJuhid, pooljuhid ja mittejuhid. Laengukandjate triivi kiirus ja liikuvus. Elektrivool juhtides. Ohmi seadus. Takistuse sõltuvus juhi mõõtmetest ja temperatuurist. Aine eritakistus ja erijuhtivus. Juhtide jada- ning rööpühendus. Elektrivoolu töö ja võimsus. Vooluallika elektromotoorjõud ja sisetakistus. Vooluallika tühiseis ja lühis. Pingegeneraator ja voolugeneraator. Thevenin'i ja Norton'i generaatorid. Kirchhoffi reeglid ja superpositsiooniteoreem."}}, {"time": "2024-09-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>4. Vahelduvvool elektriahelates (4 h) </B>\nAmplituud- hetk- ja efektiivväärtused. Aktiiv-, induktiiv- ja mahtuvustakistus. Faasinihked pinge ja voolutugevuse vahel. Faasordiagrammi meetod ja kompleksmeetod. RLC-ahela kogutakistus. Vahelduvvoolu võimsus ja võimsustegur. Pingeresonants ja vooluresonants. Magnetahelad. Trafo."}}, {"time": "2024-09-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>5. Elektrostaatika (8 h) </B>\nMõõtühikute süsteem CGSE. Coulomb'i seadus vektorkujul. Elektrivälja tugevuste vektoriaalne superpositsioon. Laengu joon-, pind- ja ruumtihedused. Ühtlaselt laetud ketta ja lõpmatu tasandi elektriväli. Väli kahe laetud tasandi vahel. Radiaalne elektriväli silindrilises süsteemis. Elektrostaatiline induktsioon. Varjestus. Potentsiaali skalaarne superpositsioon. Nabla-vektor. Potentsiaali gradient. Gaussi teoreem  E- ja D-vektorite kohta, selle rakendused. Pind- ja ruumlaenguga kera väli, elektriväli teravike ümber. Van de Graaffi generaator. Peegelkujutiste meetod. Kondensaatori mahtuvus. Kondensaatorite jada- ning rööpühendus. Elektrofoor. Irdjuhi potentsiaal ja mahtuvus. Elektrivälja energia ja selle ruumtihedus."}}, {"time": "2024-10-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>6. Magnetostaatika (8 h) </B>\nVooluelemendi magnetväli üldjuhul. Biot'-Savart'i seadus. Vektorite B ja H vektoriaalne superpositsioon. Ringjuhtme, sirgjuhtme ja solenoidi magnetväljad. Vektorite B ja H tsirkulatsioon. Tsirkulatsiooniteoreem. Homogeenne magnetväli pikas solenoidis ja toroidis. Divergents ja rootor. Voolutugevus kui voolutiheduse vektori voog. Pidevuse võrrand. Magnetvälja vektorpotentsiaal."}}, {"time": "2024-10-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Elektromagnetväli (8 h) </B>\n Lorentzi jõud ja pööriselektrivälja tugevus. Magnetvoog ja induktsiooni elektromotoorjõud. Faraday-Henry induktsiooniseadus. Lenzi reegel. Pöörisvoolud. Endainduktsioon ja induktiivsus. Pinge ja voolutugevuse ajalised sõltuvused RC- ja RL-ahelates. Vastastikune induktiivsus. Magnetvälja energia ja selle ruumtihedus. Nihkevoolu läbiminek kondensaatorist. Maxwelli võrrandid lõplikul integraal- ja. diferentsiaalkujul. Maxwelli võrrandite seostamine konkreetsete elektromagnetnähtustega. Võnkering. Hertzi dipool. Elektromagnetlainete tekkimine. Lainevõrrand ja selle tasalaine-lahend. Väljavektorite paigutus elektromagnetlaines. Elektromagnetvälja energiavoog ja Poynting'i vektor. EM välja mass, impulss ja kiirgusrõhk."}}, {"time": "2024-11-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>8. Dielektrilised materjalid (4 h) </B>\nDielektrik elektriväljas. Dipoolide elektriväljad, neist moodustuv aine väli. Dipoolmoment. Dipooli pöörav jõumoment. Dipooli energia elektriväljas. Polaarsed ja mittepolaarsed molekulid. Polarisatsioonivektor. Molekuli polariseeritavus. Aine dielektriline vastuvõtlikkus. Piesoelektrikud ja ferroelektrikud."}}, {"time": "2024-11-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>9. Üksikute laengukandjate liikumine elektromagnetväljas (2 h)</B>  \nElektrivälja ning magnetvälja mõju laengukandja liikumisele. Laengukandjate võimalikud trajektoorid. Magnetilised läätsed. Mass-spektromeetria. Magnetron-generaator. Halli efekt. Maa magnetväli."}}, {"time": "2024-11-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>10. Magnetmaterjalid (4 h) </B> \nAine magneetumine magnetväljas. Demagneetimistegur. Aine magnetiliste omaduste voolupõhine (SI) ja poolusepõhine (CGSM) käsitlus. Voolukontuuri magnetmoment. Aineosakese magnetmoment ja seda pöörav jõumoment. Osakese energia magnetväljas. Magneetumusvektor, magnetiline vastuvõtlikkus. Bohri magneton. Güromagnetiline kordaja. Tsüklotron-liikumine. Dia-, para- ja ferromagneetikud. Ferromagneetiku hüstereesisilmus. Küllastus, jääkinduktsioon ja koertsitiivsus. Magnetmälu omavad ja mitteomavad materjalid. Jõujoonte murdumine dielektriku või magneetiku ja väliskeskkonna lahutuspinnal."}}, {"time": "2024-11-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>11. Elektrivool ja elektromagnetlained aines (4 h) </B>\nLaengukandjate Fermi lainevektor, kiirus ja energia. Ülijuhtivus. Ülijuht magnetväljas, ülijuhtide liigid. Aine vahelduvvoolu-aseskeem. Juhtivusvool ja nihkevool aines. Aine dielektrilise läbitavuse sõltuvus sagedusest. Elektromagnetlainete dispersioon ja neeldumine. Kõrgsageduslik vahelduvvool ja skin-efekt. Kaabli pikkusühiku lainetakistus. Lainejuhid ja nende omamoodid."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "<B>12. Eriotstarbelised elektrimaterjalid ja -seadmed (iseseisev töö) </B>\nElektrimootorid ja generaatorid. Elektrienergia jaotusvõrk. Väljumistöö ja kontaktpotentsiaalide vahe. Termoelektrilised nähtused. Termopaar. Tahkiste tsooniteooria alused. Pooljuhi elektron- ja aukjuhtivus. pn-siire, selle tsooniskeem ja voltampertunnusjoon. Päri- ja vastupinge. Alaldi, fotodiood, solaarrakk, valgusdiood ja pooljuhtlaser. Bipolaartransistor, väljatransistor ja MOP-transistor. Elektrivool gaasides. Huum-, kaar-, säde- ja koroonalahendus, nende rakendused. Elektrivool vedelikes. Elektrolüüs ja selle rakendused."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Seminarid (32 h): </B>\nSeminariõppuste käigus omandatakse elektromagnetismi-alaste ülesannete lahendamise oskus. Ülesannete kontrolltööd toimuvad enamasti loengutele reserveeritud tunniplaaniaegadel (vt ülalpool)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>Lisaseminarid (8 h): </B>\nMittekohustuslikes lisaseminarides 10.12, 11.12, 17.12 ja 18.12 presenteeritakse rühmatöid, mis on pühendatud eksami väljundiliste ülesannete lahendamise oskuse omandamisele ning annavad osalejatele lisapunkte."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "da0f0b54-8952-7d7a-be4a-1e512b1b5e94", "parent_code": "LOFY.01.007", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}