{"uuid": "a6c23c4e-6583-0eb1-bec5-169b1ff65569", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-29T08:29:47", "title": {"en": "Astronomy at Lower Secondary School", "et": "Astronoomia õpetamine põhikoolis"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY04", "name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY04", "structural_unit_name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course will provide a general introduction to astronomy. Topics will include: apparent and true motion of celestial bodies, time determination, physical structure of the solar system and its constituents, structure and evolution of stars and stellar systems and of the built-up and evolution of our Universe and it's objects..", "et": "Kursuses käsitletakse taevakehade näivat liikumist ja aja määramist. Vaadeldakse Päikesesüsteemi üldisi seaduspärasusi ja tema koosseisu kuuluvate kehade füüsikat. Antakse ülevaade tähtedest ja tähesüsteemidest ning ka meie Universumi koostisosadest ja tekkest."}, "objectives": [{"en": "-  To give basic knowledges in astronomy for teachers of natural sciences", "et": "-  Anda alusteadmised astronoomias, mis oleksid vastavuses loodusteaduste õpetaja vajadustega"}, {"en": "-  To create a whole picture of the world we live in by introducing the built-up and evolution of our Universe", "et": "-  Tervikpildi tekitamine maailmast kus me elame, meie Universumi arengu ja koostisosade tutvustamise abil"}, {"en": "-  To present main applications of different specific branches of astrophysics", "et": "-  Astrofüüsika ja selle rakenduste tutvustamine ning populariseerimine"}], "learning_outcomes": [{"en": "A student successfully passed the course knows the structure of our Solar system and is able to explain motion of planets and other simple phenomena resulting from gravitational interaction of celestial bodies. A student is familiar with the construction and working principles of telescopes and understands main research methods in astrophysics. A student is able to explain formation of different celestial bodies and table to solve problems of gymnasium level. A student knows most prominent Estonian astronomers and their contribution to astronomy.", "et": "Kursuse läbinud üliõpilane teab meie Päikesesüsteemi ehitust ning oskab seletada planeetide liikumist ning teisi lihtsamaid nähtusi, mis tulenevad taevakehade omavahelisest vastastikmõjust. Tudeng mõistab, kuidas toimib teleskoop ning saab aru astrofüüsika uurimismeetodeist. Tudeng oskab seletada eri taevakehade teket ning suudab lahendada keskkoolitasemel astronoomiaalaseid ülesandeid. Tudeng teab tähtsamaid Eesti astronoome ja nende saavutusi."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö annab kuni 40% lõpphinde punktidest. \nKontrolltöö on kirjalik. Abimaterjale kasutada ei või, võib kasutada kalkulaatorit ja joonlauda."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö annab kuni 40% lõpphinde punktidest. \nKontrolltöö on kirjalik. Abimaterjale kasutada ei või, võib kasutada kalkulaatorit ja joonlauda."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Praktiline töö annab kuni 20% lõpphinde punktidest.\nPraktiline ülesanne on kooli sobiva astronoomia õppematerjali koostamine ja (kaasõppuritel) rakendamine."}}], "grade_preconditions": {"et": "Positiivse lõpphinde saamiseks peab olema saadud iga hinnatava tegevuse eest vähemalt 50% selle punktidest ja kõikide tegevuste eest kokku vähemalt 51 punkti 100 võimalikust.\nKuna praktiline töö eeldab kaasõppurite kohalolu, tuleks see sooritada enne auditoorse õppetöö lõppu."}, "grade_evaluation": {"et": "Hinne kujuneb kontrolltööde ja praktilise ülesande eest saadavate punktide põhjal.\n2 kontrolltööd 40 punkti + 40 punkti + 1 praktiline töö 20 punkti\nKokku on võimalik saada 100 punkti.\n\nLõpphinne kujuneb järgmiselt:\n91 - 100p \"A\"\n81 - 90p \"B\"\n71 - 80p \"C\"\n61 - 70p \"D\"\n51 - 60p \"E\"\n0 - 50p \"F\""}, "debt_elimination": {"et": "Iga hinnatavat tegevust on võimalik uuesti sooritada üks kord enne semestri lõppu. Aeg lepitakse õppejõuga kokku."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Loengute konspekt.\nSoopalu T., 2000, \"Kooliastronoomia põhivara\", Koolibri\nReemann M., 2000, \"Füüsika põhimõisted ja valemid gümnaasiumile\", Koolibri", "recommended_materials": "Chaisson E.J., McMillan S., 1996, \"Astronomy today\", 2nd ed., Prentice Hall. \nVeskimae R. (Toim.), 1998, \"Universum\", EE kirjastus. \nPasachoff J.M., 1995, \"Astronomy. From the Earth to the Universe\", 4th ed., Saunders College Publ. \nZeilik M., 1991, \"Astronomy: the evolving Universe\", 6th ed., J.Wiley & Sons."}, "participants": {"lecturers": [{"person_uuid": "2b6c4efe-69fb-4c9c-79d5-d6e4b83038af", "person_name": "Kaido Reivelt", "structural_unit": {"code": "LTFY01KF", "name": {"en": "Centre for School Physics", "et": "koolifüüsika keskus"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "32.-39. n.  4L n-s"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus -- õppeaine tutvustus\n\nAntakse ülevaade aine eesmärkidest, korraldusest ja hindamiskriteeriumitest. Samuti tutvustatakse loengukursuse ülesehitust, tutvustatakse mida astronoomia inimkonnale on andnud minevikus, olevikus ning mis on tema tulevikuperspektiivid. Lühike test tudengite taseme teada saamiseks (testi tulemused on õppejõule informatiivse eesmärgiga ning kvalitatiivset hindamist ei toimu) (20 min)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Universumi lühilugu -  Suurest paugust tänaseni\n\nTutvustatakse meie Universumi tekkimist Suure Pauguga ning meie Universumi senise elu jooksul toimunud protsesse. Kirjeldatakse, kuidas toimus Suur Pauk ning millised protsessid seal toimusid. Kirjeldatakse aine koondumist üksikutest molekulidest tähtedeks ja galaktikateks. tutvustatakse, millised objektid meie Universumis üleüldse olemas on. Koduülesanne ühe lehekülje pikkune essee teemal \"Mida ma meie Universumi kohta uut teada sain\"."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Astrofüüsika uurimismeetodid ja silmaga nähtav astronoomia -  Mida öösel taevas näha saab, teleskoobid ja sealt edasi\n\nTutvustatakse sfäärilist astronoomiat ja Maa pinnalt nähtavaid astronoomilisi objekte. Antakse ülevaade, mis toimub öötaevas, seletatakse tähtede ja kuu liikumist meie öötaevas. Näidatakse,  kus asume meie. Tutvume astrofüüsika uurimismeetoditega. Põhilised teleskoopide tüübid ja nende tööpõhimõtteid. Võimalik praktiliselt tutvuda Gallileoskoobiga (üks odavamaid ja lihtsamaid teleskoope, mis hetkel levikus on). Lisaks Maa peal olevatele teleskoopidele tutvustame ka kosmosemissioonidega tehtavate vaatluste iseärasusi. Seletatakse, mis on kiirgus ning kuidas selle abil saab infot objektide kohta, mille juurde me kunagi minna ei saa elik mis on spektroskoopia. Samuti tutvustatakse erinevaid mudeleid ning kuidas nende abil meid ümbritsevat maailma uuritakse. Koduülesanded sfäärilise astronoomia, teleskoopide ja spektroskoopia kohta."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Päikesesüsteem\n\nAnname ülevaate Päikesesüsteemist. Tutvume, millistest objektidest Päikesesüsteem koosneb ning nende liikumist kirjeldavate Kepleri seadustega. Päikesesüsteemi jagunemine: Päike, Maa-tüüpi planeedid, asteroidide vöö, hiidplaneedid, väikeplaneedid, Kuipieri vöö, Öpik-Oorti pilv. Koduülesanded Kepleri seaduste ja Päikesesüsteemi kohta."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "AHHAA-keskuse planetaariumi külastus\n\nKülastame Tartu AHHAA keskuse planetaariumi etendust."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Maa ja Kuu\n\nAntakse ülevaade Maa geoloogiast ning Maad mõjutavatest astronoomilistest protsessidest, näiteks Maa magnetvälja mõjust. Vaatame Maa aastaringi ja tema pöörlemist ning tiirlemist . Samuti tutvustatakse meie ainsat looduslikku kaaslast Kuud, tema tekkimist ning mõju meie koduplaneedile (looded, pöörlemise aeglustumine)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Teised siseplaneedid -- Merkuur, Veenus, Mars\n\nTutvustatakse meie Päikesesüsteemi neljast väiksemast planeedist kolme ülejäänut: Merkuuri, Veenust ja Marssi. Nende planeetide põhilised omadused: tiirlemis- ja pöörlemisperiood, geoloogia ning atmosfäär ja selle koostis, samuti Marsi kaaslased. Räägitakse ka nende planeetide juurde tehtud missioone."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Välisplaneedid -- Jupiter, Saturn, Uraan, Neptuun\n\nTutvustame meie Päikesesüsteemi hiide. Gaasilisi Jupiteri ja Saturni ning jäiseid Uraani ja Neptuuni. Nende planeetide põhilised omadused: tiirlemis- ja pöörlemisperiood, geoloogia ning atmosfäär ja selle koostis, kaaslased ning neile tehtud missioone."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Päikesesüsteemi väikekehad\n\nRäägitakse kõigest sellest, mis leidub meie Päikesesüsteemis, kuid pole ei planeet ega Päike. Elik juttu tuleb väikeplaneetidest, kellest kõige tuntum on Pluuto ja miks ta ikkagi enam planeet ei ole. Samuti asteroidide vöö, asteroidid, meteoroidid, meteoorid ja meteoriidid. Samuti Kuipieri vööst ning Öpik-Oorti pilv."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Astronoomiaalased arvutiprogrammid/õpiabivahendid\n\nVaatleme erinevaid astronoomia õpetamist abistavaid ja astronoomiat piltlikustavaid arvutiprogramme nagu Stellaarium, Celestia ja teised; võimalusel vaatame ka teadustöös kasutatavaid programme nagu Topcat ja Aladin (loeng toimub arvutiklassis)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Tähed\n\nTutvume erinevate tähtede tüüpidega ja nende klassifikatsiooniga. Räägitakse, mis on Hertzburg-Russeli diagramm. Erilise tähelepanu all on meie kodutäht Päike."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Tähtede (süsteemide) evolutsioon ja areng\n\nTähe elutsükkel, tähtedevaheline gaas, planeetide teke, tähe surm."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Galaktikad\n\nTutvustame meie kodugalaktikat Linnuteed ja ka teisi galaktikaid, mis jagunevad spiraalseteks ja elliptilisteks. Galaktikate tekkemehanismid ja areng."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Aktiivne ja kummaline universum\n\nSelles loengus räägime meie Universumi eksootilistest, kummalistest ja teistest huvitavatest objektidest nagu mustad augud, kvasarid, (super)noovad, neutrontähed."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Eesti astronoomia -- Struve, Öpik, Einasto\n\n(loeng toimub Toomel Tähetornis) Lühiülevaade tähelepanuväärsetest Eestis töötanud ja eestlastest astronoomide (mitte ainult loengu nimes olnud astronoomid) tööst ja nende rollist maailma astronoomias."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Moodne astrofüüsika ja kosmosemissioonid\n\nLoengus tutvustame astrofüüsika uuemaid suundi nagu astrobioloogiat, kosmoloogiat, käimasolevaid uurimismissioone, seni vastamata küsimusi ning samuti kosmosereise, -missioone jpm.\n\n    ** Detsembris külastame öisel ajal Tartu Observatooriumit, vaatame Põhja Euroopa suurimat peegelteleskoopi ja võimaluse korral teostame tähevaatlust või külastame Observatooriumi stellaariumit. (Külastus on vabatahtlik)"}}]}, "registration_info": {"audience": {"et": "bak: loodus- ja reaalainete õpetamine põhikoolis, 1.a, 2.a"}, "min_students": 5}, "parent_uuid": "8175698b-53b3-9844-ad2a-88fddc45a35b", "parent_code": "LOFY.04.023", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}