{"uuid": "1798cf3d-0ece-bff1-4fa5-6a5eebf16777", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-17T13:28:27", "title": {"en": "Doctoral Thesis", "et": "Doktoritöö"}, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "5", "et": "5. osa", "en": "part 5"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT", "name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "email": "chemistry@ut.ee", "phone": "+372 737 5261", "webpage_url": "https://chem.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "label": {"en": "24/25 A regular part 5 LT", "et": "24/25 S PÕ 5. osa LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT", "structural_unit_name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 520, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Research must lead to completion of independent study project proposing a reasoned original solution to a substantial problem in a particular research field, which presupposes the publication of at least three research papers in leading international journals of the speciality and corresponds to the university's requirements on doctoral thesis. In conducting their research PhD students follow the individual plan drawn up with the supervisor. The defense of PhD thesis is in form of public scientific discussion at the meeting of the Council of the Institute of Chemistry.", "et": "Teadustöö tulemusena valmib iseseisev uurimus, milles on esitatud konkreetse teadusvaldkonna olulise probleemi argumenteeritud originaalne lahendus ja mis eeldab vähemalt kolme uurimusliku artikli avaldamist oma eriala juhtivates rahvusvahelise levikuga väljaannetes ning vastab muudele TÜ poolt kehtestatud doktoritöö nõuetele. Doktorandi teadustöö toimub individuaalplaani alusel, mis on koostatud koostöös juhendajaga. Doktoritöö kaitsmine toimub keemia instituudi nõukogu koosolekul avaliku akadeemilise diskussioonina."}, "objectives": [{"en": "PhD students' research aims at acquiring the skills and technical competence necessary for planning and conducting research and present his/her results of study . Research must lead to completion of independent study project proposing a reasoned original solution to a substantial problem in a particular research field, which presupposes the publication of at least three research papers in leading international journals of the speciality.", "et": "Doktorandi teadustöö eesmärgiks on omandada uurimistöö planeerimise, läbiviimise ja tulemuste esitamise oskused ja tehnikad oma erialal. Teadustöö tulemusena valmib iseseisev uurimistöö, milles on esitatud konkreetse teadusliku probleemi argumenteeritud originaalne lahendus ja mis eeldab vähemalt kolme uurimusliku artikli avaldamist oma eriala juhtivates rahvusvahelise levikuga väljaannetes."}], "learning_outcomes": [{"en": "PhD student who had succesfully completed the course:\n-knows different research methods in field of chemistry\n-has deep knowledge in his/her field of study, is well informed about new developments of research\n-is capable of creatively identifying and formulating research problems\n-is capable of designing and initiating projects for research and development, that lead to new knowledges and solutions\n-is able to analyse and synthesize information found in the process of reasearch and known before\n-is able to evaluate results of his/her research in broader background and integrate these with other subject fields\n-is able to formulate results of research into the form of internationally accepted publication\n-is well informed about the process of publishing scientific articles in international pre-reviewed journals\n-is able to critically evaluate and analyse the results of scientific work\n-is able to give judgements taking into account the aspect of ethics, understands the responsibility in creating and using the results of research\n-is able to estimate the impact of scientific achievements in the broader background of society\n-is able to make strategic desicions independently\n-is able to operate in complicated circumstances, to work in international working and studying environment\n-is able to argue and present his/her results of study in international scientific events\n-is able to estimate his/her own need for additional education and to plan it\n-has good communication, management and public speaking skills.", "et": "Kursuse edukalt läbinud doktorant:\n- valdab erinevaid keemia valdkonna uurimismetoodikaid,\n- omab põhjalikke teadmisi oma erialal, on kursis uuemate uurimissuundadega\n- on võimeline loovalt identifitseerima ja formuleerima uurimisküsimusi\n- on võimeline kavandama ja algatama uurimis- ja arendusprojekte, mis viivad uute teadmiste\nja lahendusteni\n- suudab analüüsida ja sünteesida uurimistöö käigus saadud ning varem teadaolevat infot,\n- oskab hinnata oma uurimisvaldkonna teadustulemusi laiemas kontekstis ja neid teiste\nvaldkondadega lõimida\n- oskab formuleerida uurimistöö tulemused rahvusvahelisel tasemel artikliks\n-on kursis rahvusvahelistes eelretsenseeritavates ajakirjades teadusartiklite avaldamise protsessiga\n- oskab teadustulemusi kriitiliselt hinnata ja analüüsida\n- oskab anda teaduseetilisi hinnanguid, saab aru vastutusest teadustulemuste loomisel ja\nkasutamisel\n- on võimeline hindama teadussaavutuste mõju laiemas ühiskondlikus kontekstis\n- on suuteline iseseisvalt langetama strateegilisi otsuseid,\n- on võimeline tegutsema keerulistes olukordades, töötama rahvusvahelises töö- ja\nõpikeskkonnas\n- oskab argumenteerida ja esitada oma teadustulemusi rahvusvahelistel teadusüritustel\n- oskab hinnata oma vajadust täiendkoolituse järele ja seda planeerida\n- omab häid suhtlemis-, juhtimis- ja koostööoskuseid"}], "notes": {}}, "grading": {"independent_work": {"et": "vastavalt individuaalsele kokkuleppele"}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Doktoritööd ja selle kaitsmist hinnatakse järgmiste kriteeriumide alusel:\n\n1. Oskus esitada oma uurimistulemusi lühidalt, arusaadavalt ja huvitavalt. Suuline eneseväljendusoskus, esituse loogilisus ja keelekasutuse selgus.\n\n2. Oma valdkonna ja eriala olulisemate paradigmade tundmine.\n\n3. Tulemuste interpreteerimise oskus (näha puude taga metsa).\n\n4. Oma teadustulemuste paigutamine laiemasse konteksti (the impact of your work).\n\n5. Akadeemilise diskussiooni arendamise oskus; oskus läbi diskussiooni vastata küsimustele ka siis kui vastust ei tea."}}], "grade_preconditions": {"et": "Õppekava täitmine, nõutava tasemega teaduspublikatsioonide (Doktorikraadi andmise kord, p 16) olemasolu."}, "grade_evaluation": {"et": "Doktoritööd ja selle kaitsmist hinnatakse:\n\n'+' Väitekirja kaitsmine oli edukas (hinne \"kaitstud\"). Anda doktorikraadi taotlejale doktorikraad.\n'-' Väitekirja kaitsmine ei olnud edukas (hinne \"mittekaitstud). Mitte anda doktorikraadi taotlejale doktorikraadi."}, "debt_elimination": {"et": "Üks kord sama väitekirja korduskaitsmine (Doktoritööde kaitsmise kord, p 39)."}, "assessment_scale": {"code": "defence", "et": "Kaitsmine", "en": "defence"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "vastavalt individuaalsele kokkuleppele", "recommended_materials": "vastavalt individuaalsele kokkuleppele"}, "participants": {"lecturers": [{"person_uuid": "aa7ec13e-9fdc-c91a-968f-c6633ac54c03", "person_name": "Heili Kasuk", "structural_unit": {"code": "LTKT", "name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "email": "chemistry@ut.ee", "phone": "+372 737 5261", "webpage_url": "https://chem.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}}, "parent_uuid": "ae16c966-0061-c8e5-bdd0-03ecfbb58828", "parent_code": "LOKT.00.014", "parent_credits": 180, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}