{"uuid": "6e45e70c-4444-bb5d-8500-2b40d1f317b2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-26T10:37:23", "title": {"en": "Organic Chemistry I", "et": "Orgaaniline keemia I"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT09", "structural_unit_name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Basic course of organic chemistry, dealing with structure, naming and important reactions of organic compounds. This lecture course is accompanied by seminars.", "et": "Loengukursus orgaanilise keemia alustest, kus käsitletakse orgaaniliste ühendite struktuuri, nimetamist ja nendega toimuvaid reaktsioone. Kursusega kaasnevad seminarid."}, "objectives": [{"en": "Course gives an overview of basic organic chemistry, nomenclature of organic compound and their classification, and reactions and mechanisms of the traditional functional groups.", "et": "Kursuse eesmärk on anda alusteadmised orgaaniliste ühendite peamistest aineklassidest, nende nimetamisest ning füüsikalistest ja keemilisest ja omadustest."}], "learning_outcomes": [{"en": "Student who has completed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "* recognizes the main classes of organic compounds,", "et": "* tunneb ja eristab orgaaniliste ühendite põhilisi aineklasse,"}, {"en": "* understands the principles of naming of organic compounds and is able to apply them,", "et": "* teab orgaaniliste ühendite nimetamise põhimõtteid ja oskab neid rakendada,"}, {"en": "* knows characteristic reactions of main classes of organic compounds and can explain their occurrence,", "et": "* teab orgaanilistele ühenditele erinevate aineklassidele iseloomulikke ja olulisi reaktsioone ja oskab nende toimumist selgitada,"}, {"en": "* predicts the chemical and physical properties of an organic compound proceeding from structure of the molecule,", "et": "* oskab prognoosida orgaanilise ühendi keemilisi ja füüsikalisi omadusi lähtudes molekuli struktuurist,"}, {"en": "* recognizes the important natural compounds: saccharides, peptides, nucleic acids and lipids", "et": "* tunneb ära oluliste looduslike ühendite liike: sahhariidid, peptiidid, nukleiinhapped ja lipiidid"}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Hinnatakse ülesannete lahendamise oskust"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Hinnatakse ülesannete lahendamise oskust"}}], "grade_preconditions": {"et": "Kontrolltöö on sooritatud. Selle tulemused moodustavad 30% lõpphindest."}, "grade_evaluation": {"et": "Lõpphinde moodustavad kontrolltöö tulemus (30%) ja kirjaliku eksamitöö tulemus (70%)"}, "debt_elimination": {"et": "Järeleksam, kui lõpptulemus on mitterahuldav (alla 51% selle õppeaasta parimast tulemusest)"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "1. Keemia alused: teekond teadmiste jurde, P. Atkins, L. Jones, L. Laverman, tõlke toimetaja P.Burk, 2021, Tartu Ülikooli Kirjastus, ISBN/ISSN: 9789949036264\n2. Orgaaniline keemia: õpik kõrgkoolidele. F.A.Carey, R.M.Guiliano,tõlke toimetaja T.Kanger,2014,Tallinna TehnikaülikooliKirjastus", "recommended_materials": "1. Gregory Roos, Cathryn Roos Organic chemistry concepts: an EFL approach 2015 \n2. Carey, F.A., Organic Chemistry (5th ed), 2003\n3.Ege, S., Organic Chemistry (second ed.) Toronto 1989.\n4.Solomons T. W. G., Fryhle C. B., Organic Chemistry. (7-th ed) John Wiley & Sons, Toronto 2002."}, "participants": {"lecturers": [{"person_uuid": "74113171-2a97-da8c-cf93-8b4af9625e6c", "person_name": "Erki Enkvist", "structural_unit": {"code": "LTKT10", "name": {"en": "Chair of Bioorganic Chemistry", "et": "bioorgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"1. rühm geenitehnoloogia, keskkonnatehnoloogia": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "8be20471-3a69-77f9-a78f-e9578f1a47ed", "person_name": "Siim Salmar", "structural_unit": {"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "3942428c-edc5-ab16-af40-5eea8e2c363f", "person_name": "Anu Ploom", "structural_unit": {"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "6142389f-cdc7-0e3a-6783-2cb9407d0729", "person_name": "Anton Mastitski", "structural_unit": {"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm bioloogia": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}], "study_groups": [{"uuid": "5d03cb59-f19d-fd01-0b12-0d548cc8530b", "code": "1. rühm geenitehnoloogia, keskkonnatehnoloogia"}, {"uuid": "1b7da4f6-7248-1a6e-2f57-5a0d8396d332", "code": "2. rühm bioloogia"}]}, "schedule": {"weeks": {"et": "1. - 16. n.  2L, 2S n-s  => E; "}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. Orgaaniliste ühendite molekulid. Orgaanilise keemia nimetuse päritolust, ajaloost ja olulisematest arengu etappidest. Orgaanilised ühend koosnevad peamiselt neljast elemendist: C, H, N ja O. Süsiniku aatomi unikaalsus: ahelate moodustumine.  Orgaaniliste ühendite molekulide graafiline kujutamine, struktuurivalemite liigid. Molekulide mudelid. Organiliste ühendite klassifikatsioon: põhiklassid ja neid määravad funktsionaalrühmad. Peahel ja kõrvalahelad. Orgaaniliste ühendite nimetamise (nomenklatuuri) alused + näited.\n"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Orgaaniliste molekulide struktuur \nKeemilise sideme definitsioon kahe aatomi ühise elektronpaari kaudu. Sidemete omadused: pikkus, polaarsus, energia. C-aatomi valentselektronide hübridisatsioon ja sellest tulenev keemiliste sidemete ruumiline paiknemine: s - side ja p - side, nende erinevus. Molekulide ruumiline struktuur (topoloogia). Isomeeria nähtus ja liigid: struktuuriisomeerid ja stereoisomeerid, sh geomeetrilised isomeerid ja optilised isomeerid. "}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": " Orgaaniliste ühendite tähtsaimad füüsikalised omadused (tihedus, keemis- ja sulamistemperatuur jne) ning nende sõluvus aine struktuurist ja koostisest. Tähtsaimad vastastikmõjud molekulide vahel. Ioonilised, van der Waalsi vastastikmõjud ning H-side. Orgaaniliste ainete lahustuvus vees. Näited erinevate aineklasside kohta. \n\nReaktsioonide klassifikatsioon: asendus, liitumine, lagunemine, isomerisatsioon. Reaktsiooni lähteained, saadused ning vaheühendid. Reaktsioonitsenter, asendusrühmad orgaanilise ühendi molekulis, aktivatsioonienergia, keemiline tasakaal, reaktsiooni pöörduvus ja muud tähtsaimad mõisted. Reaktsiooni kulgemise kirjeldus (molekulaarne mehhanism): struktuuri muutuste järjekord, vaheühendid, reaktsiooni energiadiagrammid ühe ja mitmeetapilise reaktsiooni puhul, reaktsiooni kiirust määrav etapp ja katalüüsi olemus. Kokkupõrgete teooria ja temperatuuri mõju reaktsioonile. Reaktsiooni suuna iseloomustamine energia muutuse kaudu: keto-enoolse tautomeeria näide. "}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Keemilise sideme katkemise homolüütiline ja heterolüütiline mehhanism: radikaalide või ioonide teke vaheühendis. Radikaalse või ioonse reaktsioonimehhanismi olenevus sideme polaarsusest ja reaktsiooni keskkonnast. Reagentide klassifikatsioon: radikaalid, nukleofiilid ja elektrofiilid. Reaktsiooni tasakaalu ja kiiruse sõltuvus reagendi struktuurist. Ühendites esinevad elekronefektid: resonants- ja induktsioonefekt. Valentselektronide delokalisatsiooni võimalused molekulis ja selle mõju molekuli energiale. Resonants ja selle nähtuse graafiline kujutamine. Radikaali ja iooni stabilisatsioon resonantsi poolt. Hüperkonjugatsiooni nähtus ja selle arvestamine. Ainete stabiilsuse hindamine reaktsiooni soojusefekti kaudu: alkeenide hüdrogeenimise soojuse võrdlus.  Aromaatsus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Happe tugevuse iseloomustamine reaktsiooni tasakaalu abil ja pKa tabelites toodud andmete interpretatsioon. Happe tugevuse sõltuvus happe struktuurist: H-X sideme omadused, lähteaine ja konjugeeritud aluse stabilisatsioon. C-H happed ja nende omapära. Karbonüülrühmaga ühendite C-H happelisus. Lewisi hape kui elektronpaari aktseptor (vaba orbitaaliga osakene). Katalüsaatorite AlCl3 ja FeCl3 toime näited."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Radikaalmehhanismiga reaktsioonide toimumine (initsieerimine, ahelreaktsioon ja terminatsioon). Sideme homolüüsi soodustavad tegurid. Reaktsiooni initsieerimise võimalused (UV, temperatuur). Näited: metaani ning lihtsamate alkaanide reaktsioonid halogeenidega ja põlemine hapnikus. Reaktsiooniprodukti struktuuri määrab vaheoleku stabilisatsioon. \n\nIoonmehhanismiga reaktsioonid. Sideme heterolüüsi soodustavad tegurid: sideme polaarsus ja reaktsiooni keskkond (dielektriline läbitavus). Vaheühendi struktuur eristab SN1 ning SN2 mehhanisme ja sellest tulenevad reaktsioonide stereokeemilised erinevused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elimineerimisreaktsioon kui nukleofiilse asendusreaktsiooni alternatiiv. Nukleofiili ja aluse sarnasus aga erinev käitumine reaktsioonis. Mõned reeglid E1 ja SN1 ning E2 ja SN2 reaktsioonimehhanismide eristamiseks. Reaktsioonide paralleelse kulgemise võimalus ja selle mõju reaktsiooni saadustele."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sigma- ja pi-sidemete energiate võrdlus kaksiksidemes ja järeldused reaktsioonide kulgemise kohta. Mittepolaarsed pi-sidemed alkeenides (>C=C<) ja nendega toimuvad liitumisreaktsioonid. Radikaalse mehhanismiga reaktsioonid ja nende toimumise eeldused. Reaktsiooni mehhanism ja selle poolt määratud reaktsiooni saaduste struktuur. Radikaalne polümerisatsioon ja selle kasutusalad. Elektrofiili liitumine pi-sidemele ja sigma-kompleksi teke. Reaktsiooni saaduse struktuuri sõltuvus vaheühendi stabiilsusest. Elektrofiili liitumine dieenile. Iooniline polümerisatsioon. pi-sidemete reaktsioonid alküünides."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Aromaatsed pi-sidemed ja aromaatsuse definitsioon. Elektrofiilne asendusreaktsioon benseenis. Whealandi vahekompleksi teke. Vahekompleksi suunav mõju reaktsiooni toimumisele, kui molekulis on juba üks asendusrühm. Nulkeofiilne asenduse võimalikkus aromaatses tuumas (Sanger'i reaktsiooni näitel)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Reaktsioonitsentrid polaarsete pi-sidemetega ühendites  >C=O ja >C=NH näitel.  Nukleofiili (sh Mg-orgaaniliste ühendite ja komplekshüdriidide) liitumine polaarsele pi -sidemele ja tetraeedrilise vahekompleksi teke. Reaktsiooni tulemuse sõltuvus lähteühendi struktuurist: liitumine või asendus. Nukleofiili liitumine ketoonile või aldehüüdile. Sisemolekulaarse poolatsetaali või poolketaali teke. "}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Nulkeofiilne asendusreaktsioon karboksüülhapete ja nende derivaatide korral. Karboksüülhapete derivaatide reaktsioonivõimelisuse rida, mille määrab lähteühendi stabilisatsioon. Karbonüülrühma mõju a-CH sideme happelisusele ja karbonüülühendite kondensatsioon. Ristkondensatsioon ja \"keemiliste raamatukogude\" mõiste. Mõned näited nitriilide reaktsioonidest."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "\nLihtsate heterotsükliliste ühendite näited, tsüklite stabiilsus ja tähtsus looduses.\nSuhkrud e. sahhariidid kui polühüdroksüaldehüüdid ja polühüdroksüketoonid, mis esinevad monomeeridena või glükosiidsidemetega seotud polümeeridena. Peamised looduslikud mono- ja disahhariidid. Sahhariidide isomeeria kui selle ainete klassi mitmekesisuse alus. Näited reaktsioonidest."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Nukleiinhapped kui fosforhappe ja pentoosi või desoksüpentoosi estri jääkidest koosnevad polümeerid, kus suhkru jääkidega on seotud lämmastikku sisaldavad heterotsüklid (lämmastikalused). Nende heterotsüklite järjestus nukleiinhappe ahelas kodeerib elusraku jaoks olulist informatsiooni. Nukleosiidid ja nukleotiidid.\n\nAminohapete struktuuri iseärsused ja molekulide asümmeetria. Peptiidid kui aminohapete polüamiidid. Valgud kui kahekümne erineva loodusliku 2-aminokarboksüülhappe polümeerid, kus aminohapete jääkide järjestus polümeeri ahelas kodeerib informatsiooni valgumolekuli ruumilise struktuuri ja funktsioneerimise kohta. Peptiidsideme keemilised omadused ja struktuur.\n\nLipiidid kui glütserooli ja rasvhapete estrid, mille füüsikalised omadused määrab rasvhapete struktuur. Peamised looduslikud rasvhapped. Lipiidide roll eluslooduses. "}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Vaadeldud reaktsioonid võimaldavad üleminekuid orgaaniliuste ühendite aineklasside vahel. See on sünteetilise orgaanilise keemia metodoloogiliseks aluseks."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "24486b8a-142f-c540-781e-1f889d9cea3a", "parent_code": "LOKT.09.004", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}