{"uuid": "fd775f27-aacf-fa0c-7399-5a7152a985b2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-05T14:27:30", "title": {"en": "Selected Topics on Electrochemistry", "et": "Valitud peatükke elektrokeemiast"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT02", "name": {"en": "Chair of Physical Chemistry", "et": "füüsikalise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "label": {"en": "25/26 S regular LT", "et": "25/26 K PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT02", "structural_unit_name": {"en": "Chair of Physical Chemistry", "et": "füüsikalise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 60, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Some more hot topics of modern electrochemistry will be discussed. Influence of the potential drop in the thin surface layer (i.e influence of the metal phase characteristics: effective mass of electrons, Fermi screening length, density of charge carriers etc.) on the electrochemical kinetics of various processes (adsorption, electro-reduction of various ions) will be given. Also the corrosion processes and theory of voltametric studies will be discussed. Also the quantum chemical models for the electrical double layer structure, adsorption of organic molecules and ions as well as for electrochemical kinetics will be analyzed. Influence of the electrical double layer structure as well as of the nature of reagents and products on the charge transfer kinetics will be demonstrated. The basic principles of various fuel cells (polymer electrolyte, phosphoric acid, molten carbonate and solid oxide fuel cells) will be given.", "et": "Käsitletakse kaasaegse elektrokeemia aktuaalseid probleeme. Vaadeldakse metalli pindkihis aset leidva potentsiaalilanguse (nn. metallifaasi karakteristikute, nagu elektronide efektiivse massi, Fermi ekraneerimispikkuse ja laengukandjate tiheduse) mõju adsorptsiooniprotsessi ja elektrokeemilise kineetika seaduspärasustele. Antakse ülevaade voltamperomeetrilistest analüüsimeetoditest, korrosioonist ja galvaanilistest protsessidest. Samuti analüüsitakse elektrilise kaksikkihi, orgaaniliste ühendite ja ioonide adsorptsiooni ja elektrokeemilise kineetika kvantkeemilisi mudeleid. Käsitletakse elektrilise kaksikkihi ehituse ning reagentide ja produktide loomuse mõju laenguülekande-kineetikale. Analüüsitakse erinevate kütuseelementide (polümeerelektrolüüdil, fosforhappel, sulatatud karbonaadil, tahketel oksiididel põhinevad kütuseelemendid) tööprintsiipe."}, "objectives": [{"en": "Modern conceptions of the electrical double layer, adsorption of ions and molecules as well as the influence of the electrical double layer on the kinetics of heterogeneous charge transfer reactions will be studied. Also the corrosion processes and theory of voltametric studies will be discussed. The subject also supports the development of entrepreneurial competence by solving real-life problems.", "et": "Antud kursusel käsitletakse elektrilise kaksikkihi moodustumise kaasaegseid seisukohti ning analüüsitakse faasidevahelise piirpinna ehituse mõju heterogeense laenguülekande kineetikale; korrosiooninähtusi, elektrokeemilise analüüsi teooriat ja sellega seonduvat. Aine toetab ka ettevõtluspädevuse arengut päriselu probleemide lahendamise kaudu."}], "learning_outcomes": [{"en": "Graduates have acquired adequate knowledge of planning and organization of  conceptions of the electrical double layer and corrosion processes, engineer's profession and career prospects in the labour market. ", "et": "Lõpetajatel on piisavad teadmised elektrilise kaksikkihi moodustumise kaasaegsete seisukohtade vallas, samuti   korrosiooninähtuste ja elektrokeemilise analüüsi teooria valdkonnas toimuvatest tööturu väljavaadetest oma ametialal. Suudab analüüsida, hinnata ja pakkuda innovatiivseid lahendusi eriala tehnilistele ja tehnoloogilistele probleemidele. Oskab koguda teaduslik-tehnoloogiaalast informatsiooni, seda loovalt tõlgendada ning kasutada probleemide lahendamisel ja enesetäiendamiseks. Oskab näha erinevate protsesside vahelisi seoseid ja oskab rakendada teoreetilisi teadmisi autentsete protsesside planeerimisel ja kasutamisel kujundada õiged hoiakud erialaliseks loominguliseks tegutsemiseks, vastutuse kandmiseks ja elukestvaks enesetäiendamiseks. "}, {"en": "Graduates are able to analyze, assess and offer innovative solutions to technical and technological problems in their speciality. Graduates are able to collect scientific and technological information, interpret and use the data in problem-solving and further training. Graduates are able to understand connections between different processes and to apply theoretical knowledge in authentic process planning and use as well as form proper attitudes to encourage creative activities in their speciality, sense of responsibility and life-long learning. Graduates have been prepared to work in the field of the electrical double layer and corrosion processes or in other specialized areas, demonstrating initiative and sense of responsibility. Graduates have acquired and are able to assess problems and role of the electrical double layer, corrosion processes and theory of voltametric studies in the development of society.", "et": "On ettevalmistatud töötamiseks elektrilise kaksikkihi protsesside ja korrosiooninähtuste  vallas või muul kvalifitseeritud tegevusalal,  näidates seejuures algatusvõimet ja vastutustunnet. Tunneb ja oskab hinnata elektrilise kaksikihi protsesside ja korrosiooninähtuste probleeme, elektrokeemilist analüüsi ja kohta jätkusuutliku ühiskonna arengus."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksamihinde kujunemisest:\n* Määratud on 3 eksami kuupäeva, millest viimane on korduseksami aeg.\n* Nende kahe esimese päeva seast vabalt valitud päeval tuleb tudengil sooritada eksam.\n* Kui eksami hinne on A, B, C, D, või E, siis eksamit uuesti teha ei saa.\n* Kui eksami hinne on F, saab tudeng sooritada järeleksami määratud kuupäeval.\n\nTööde hindamisest:\n* Kordamisküsimused eksami kohta leiab õppematerjalide hulgast.\n* Kordamisküsimuste seast valib õppejõud eksamisse 5 küsimust.\n* Iga küsimuse eest saab tudeng maksimaalselt 10 punkti.\n* Eksami peale on tudengil võimalik saada 50 punkti.\n\nKui tudengi punktisumma on:\n* < 50% on hindeks F\n* 50% ... 60% hindeks E\n* 61% ... 70% hindeks D\n* 71% ... 80% hindeks C\n* 81% ... 90% hindeks B\n* 91% ... 100% hindeks A\n\nKüsimustele vastates on oluline:\n* Panna kirja (vastavalt küsimusele) materjalide, meetodite põhilised omadused, eelised/puudused jms.\n* Küsimusele vastava näite olemasolul tuleb kindlasti kirja panna ka näide. Toodud näidet tuleb loengus käsitletud ulatuses lahti seletada.\n* Jooniste puhul tuleb kindlasti lisada, mida on joonisel kujutatud ja lisada objekti kirjeldus.\n* Kui küsimuse vastust saab illustreerida mõne graafikuga, on oluline joonistada ka see graafik. Graafikule telgedele tuleb kindlasti lisada ka suurused, mida see telg iseloomustab. Graafikul ilmnevad sõltuvused tuleb loengus käsitletud mahus ka lahti seletada.\n\nKüsimustele vastates ei ole oluline:\n* Jälgida loengukonspektide täpset sõnastust.\n* Küsimusele vastates ei ole oluline teksti pikkus vaid sisukus.\n* Jooniste puhul ei hinnata tudengi kunstiannet - oluline on see, mis on joonisel ja kuidas see joonis on lahti seletatud.\n* Graafiku telgede kujutamise korral ei ole vaja teada kõiki numbrilisi väärtusi. Oluline oleks meelde jätta, millises suurusjärgus või vahemikus kujutatav muutus toimub. Meelde tuleks jätta ka kirjeldamiseks olulisemad numbrilised suurused."}}], "grade_preconditions": {"et": "Kõik loengukursusele registreerunud üliõpilased pääsevad eksamit sooritama."}, "grade_evaluation": {"et": "Kirjaliku eksami sooritamine"}, "debt_elimination": {"et": "kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "1.P. Atkins, Physical Chemistry, Oxford, Oxford University Press, 1994.\n2.B.E.Conway, Electrochemical Supercapacitors: Scientific Fundamentals and Technological Applications, Kluwer Academic/Plenum Publishers, New York, 1999.\n3.Y.Gogotsi (Ed), Nanomaterials Handbook, Taylor&Francis, Boca Raton, FL, 2006.\n4.S.J. Gregg, K.S.W. Sing, Adsorption. Surface Area and Porosity, Academic Press, London, 1982.\n5.J.O&acute;M. Bockris, A.K.N. Reddy, Modern Electrochemistry 1, Ionics, Plenum press, New York, 1998.\n6.J.O&acute;M. Bockris, A.K.N. Reddy, Modern Electrochemistry 2, Fundamentals of Electrodics, Plenum Press, New York, 1998.", "recommended_materials": "1.J.R. MacDonald (Ed.), Impedance Spectroscopy. Emphasizing Solid Materials and Systems, Wiley, New York, 1987.\n2.H. Ohno (Ed), Electrochemical Aspects of Ionic Liquids, Wiley Interscience, Hoboven, New Jersey, 2005.\n3.G.-A. Nazri, G. Pistoia (Eds.), Lithium batteries, Science and Technology, Kluver, New York, 2004.\n4.V.Barsukov, F.Beck, New Promising Electrochemical Systems for Rechargeable Batteries, Kluwer Academic Publishers, Nordrecht, Bastin, London, 1995."}, "participants": {"lecturers": [{"person_uuid": "bc8bdf10-e3f8-d026-bb83-a73c7882cf6c", "person_name": "Alar Jänes", "structural_unit": {"code": "LTKT05", "name": {"en": "Chair of Applied Electrochemistry", "et": "rakenduselektrokeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-36. n."}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus. Laetud piirpindade üldised omadused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Potentsiaalihüpped faasidevahelisel piirpinnal."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Põhilisi mudelettekujutusi elektrilise kaksikkihi struktuurist I."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Põhilisi mudelettekujutusi elektrilise kaksikkihi struktuurist II."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrilise kaksikkihi uurimise meetodid I."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrilise kaksikkihi uurimise meetodid II."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrilise kaksikkihi uurimise meetodid III."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poorsed materjalid ja nende karakteriseerimine I. Brunauer-Emmett-Telleri meetod.\nPoorsed materjalid ja nende karakteriseerimine II. XRD, Raman spektroskoopia, SEM ja TEM meetodid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Nanopoorse süsiniku saamine (lähteained, meetodid, kloreerimismeetod) ja selle pinna modifitseerimise võimalustest. De Levie mudel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrokeemiliste vooluallikate üldprintsiibid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrilise kaksikkihi kondensaatorid ehk superkondensaatorid I. \nElektroodimaterjalide, solventide ja soolade valik.\nIoonsed vedelikud."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Elektrilise kaksikkihi kondensaatorid ehk superkondensaatorid II.\nElektrokeemilised meetodid  (tsükliline voltamperomeetria, konstantse voolu meetod, elektrokeemiline impedantsspektroskoopia) superkondensaatorite karakteriseerimiseks.\nKompleksmahtuvus ja kompleksvõimsus. Energia - võimsustiheduse graafikud (Ragone graafikud)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Hübriidkondensaatorid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Primaarsed patareid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sekundaarsed (laetavad) patareid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Liitium-ioon patareid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kütuseelementide tööprintsiibid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Tahked ioonjuhid ja tahkeoksiidsed kütuseelemendid (SOFC)."}}]}, "registration_info": {"audience": {}, "min_students": 5, "max_students": 64}, "parent_uuid": "35293f5a-33bc-3600-83d9-3463768ec092", "parent_code": "LOKT.02.020", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}