{"uuid": "17a8b11d-2fa8-a492-4ea4-fddf6c0b0c65", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-27T15:39:33", "title": {"en": "Measurements and the Law", "et": "Mõõtmised ja seadus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT06", "name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "label": {"en": "25/26 S regular LT Eng", "et": "25/26 K PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT06", "structural_unit_name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The presentation gives an overview of legal framework on measurements (Metrology Act with supportive legislation) and legal acts implementation of which is based on measurements (various normative limits, requested values etc). The presentation addresses also connections with the respective EU legislative acts and possibilities for assurance of reliability of measurements and analyses (assessment of competence of measurers, interlaboratory comparisons).", "et": "Loeng annab ülevaate mõõtmisi käsitlevast seadusandlusest (mõõteseadus ja selle rakendusaktid) ja õigusaktidest, mille rakendamine baseerub mõõtmistel (mitmesugused lubatud piirnormid, nõutavad väärtused jne). Tuuakse välja seosed EL vastavate aktidega ning käsitletakse mõõtmiste ja analüüside usaldusväärsuse tagamise võimalusi (mõõtja pädevuse hindamine, võrdlusmõõtmised)."}, "objectives": [{"en": "To give overview of the interrelations between measurements and legislation (Legal measures for ensuring reliability of measurement results, Technical measures for ensuring reliability of measurement results, Measurement results and legal limits).", "et": "Anda ülevaade mõõtmisi käsitlevast seadusandlusest (mõõteseadus) ja seadusandlusest, mille rakendamine baseerub mõõtmistel (mitmesugused lubatud piirnormid, nõutavad väärtused jne). Tuuakse välja seosed EL vastavate aktidega ning käsitletakse mõõtmiste ja analüüsidega seotud seadusloome trende (uued monitooritavad ained, madalamad avastamispiirid jne)."}], "learning_outcomes": [{"en": "Student has systemic understanding of: \n-- interrelations between measurements and legislation (especially EU legislation). \n-- legal and technical measures for ensuring reliability of measurement results. \n-- trends in legislation related to measurements (new monitored substances, lower detection limits, etc.) \nStudent is able \n-- explain the main concepts of metrology, legal metrology, law and legal systems.\n-- describe the infrastructure and main documents related to measurement system.\n-- in real life situations identify the aspects related to measurements and law and apply the\nknowledge learned on the course to take a correct action in these situations.\n-- describe the metrology system of your home country and distinguish differences between\ndifferent metrology systems.\n-- design and create a presentation for your knowledge or scientific work in a clear and\n efficient manner.", "et": "Tudengil on süsteemne arusaamine: \n-- mõõtmisi käsitlevast seadusandlusest (eeskätt EL seadusandlus) ja seadusandlusest, mille rakendamine baseerub mõõtmistel (mitmesugused lubatud piirnormid, nõutavad väärtused jne). \n-- juriidilistest hoobadest kindlustamaks mõõtetulemuste usaldusväärsust. \n-- mõõtmiste ja analüüsidega seotud seadusloome trendidest (uued monitooritavad ained, madalamad avastamispiirid jne). \nTudeng oskab: \n-- oskab selgitada metroloogia, legaalmetroloogia, seaduste ja juriidiliste süsteemide põhimõisteid;\n-- kirjeldada seotud organisatsioone ja põhilisi dokumente, mis on seotud metroloogiaga;\n-- reaalelu olukordades tunda ära asjaolud, mis on seotud mõõtmistega ja seadustega ning rakendada kursusel omandatud teadmisi nendes olukorades käitumiseks;\n-- kirjeldada oma koduriigi metroloogia süsteemi ja eristada erinevate riikide süsteeme;\n-- koostada ja disainida oma uurimistöö või muu teadusliku töö esitust selgel ja efektiivsel moel."}], "notes": {}}, "grading": {"independent_work": {"et": "-- Homework for a seminar in a form of an essay or equivalent.\n-- Poster and presentation. More instructions in the Syllabus for the current semester."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Homework consists of two parts. Both parts are prerequisites for the exam.\nPart I. Prepare a short review (no more than 500 words) on the metrology system of your home country (with graphs, figures etc). Send to instructor.\nPart II. Work through all observations and by 27th of March send your thoughts and reflections. Prepare at least 3 similarities and 3 differences you noticed between different metrology systems (observations don't have to cover all the countries, but the majority, depending on the systems).\nHomework is 10 points if all the parts are presented in time."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Prepare an academic poster on your topic, as you might present at the scientific conference. Format so that your posters would be approximately A0 size (ca. 841 x 1189 mm) in portrait orientation. Posters are presented in the seminar with 5 min presentation.\nEverybody has to give feedback to all of the posters for peer evaluation.\nPoster by each student on a topic of choice related to measurements and possible legal issues related. Posters can be made in groups maximum of two people who must both present.\nPoster and presentation gives 30 points (15 points from peer evaluation and 15 from the course instructor)."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Final exam will cover the material from the lectures and presentation discussions. Two scheduled times will be available and a later revealed date for the make-up exam. Exam is 60 points and 31 is needed for passing."}}], "grade_preconditions": {"et": "Homework and poster with presentation are prerequisite for the exam."}, "grade_evaluation": {"et": "The final score is formed from three components:\n-- Homework. See instructions in the Syllabus (maximum 10 points)\n\n-- Poster with presentation. See instructions in the Syllabus for the current semester (maximum 30 points)\n\n-- Final exam (maximum 60 points, 31 points are required to pass)\n\nThe final score forms from adding the scores of the above three assignments.\nThe scores are converted to grade followingly: 50-60 E; 60-70 D; 70-80 C;\n80-90 B; 90-100 A. If the result is between two grades, the higher grade\nwill be awarded."}, "debt_elimination": {"et": "To be agreed with supervisor."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "The study materials of the course are available in Moodle", "recommended_materials": "The study materials of the course are available in Moodle"}, "participants": {"lecturers": [{"person_uuid": "0da1eb8e-142d-01cb-1f8b-83d27e450575", "person_name": "Ivo Leito", "structural_unit": {"code": "LTKT06", "name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "b4d892e8-f7ae-ee5a-94aa-029116604e71", "person_name": "Riin Rebane", "structural_unit": {"code": "LTKT06", "name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-33"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Timetable is attached as a syllabus in study materials."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "e6d35c37-9fdb-45cb-bdff-1e2b12da60c4", "parent_code": "LOKT.06.034", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}