{"uuid": "54e65046-31e4-3384-bace-4f1745d70d83", "code": "LOKT.09.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Structural Analysis I", "et": "Struktuuranalüüs I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT09", "structural_unit_name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The goal of the course is to give an overview of spectroscopic and spectrometric methods utilized for determination of structure of organic compounds (MS, IR and NMR). Different techniques of measurement, materials and instrumentation will be introduced. The students will develop their skills of scientific data search and critical thinking via interpretation of numerous spectra, IR-spectroscopy practical work and preparation of individually written report.", "et": "Kursuse eesmärgiks on tutvustada orgaaniliste ühendite struktuuri määramise spektroskoopilisi ja spektromeetrilisi meetodeid (MS, IP ja TMR). Tutvustatakse erinevaid mõõtmistehnikaid, materjale ja aparatuuri. Kursuse käigus arendab õppija oma teadusinfo otsimise ja kriitilise mõtlemise oskust läbi erinevate spektrite interpreteerimise, IP-spektroskoopia praktilise töö ning iseseisvalt koostatava aruande."}, "objectives": [{"en": "The goal of the course is to give an overview of spectroscopic and spectrometric methods utilized for determination of structure of organic compounds (MS, IR and NMR), to introduce the most important techniques of measurement, utilized materials and instrumentation. Additionally the course develops students  skills of spectra interpretation, scientific data search, critical thinking and allows to obtain  the first practical experience in IR-spectroscopy.", "et": "Kursuse eesmärgiks on tutvustada orgaaniliste ühendite struktuuri määramise spektroskoopilisi ja spektromeetrilisi meetodeid (MS, IP ja TMR), tähtsaimaid mõõtmistehnikaid, kasutatavaid materjale ja aparatuuri. Lisaks arendab kursus õppija spektrite interpreteerimise, teadusinfo otsimise ja kriitilise mõtlemise oskust ning võimaldab omandada esmase praktilise kogemuse IP-spektroskoopias."}], "learning_outcomes": [{"en": "The student, who has passed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1. Understands basic IR-spectroscopy theory.", "et": "1.\tMõistab põhilist IP-spektroskoopia teooriat."}, {"en": "2. Knows the most important measurement techniques and properties of optical materials.", "et": "2.\tTeab tähtsaimaid mõõtmistehnikaid ja optiliste materjalide omadusi."}, {"en": "3. Has an overview of NMR spectroscopy and Mass-spectrometry (MS) basic theory and the simplest practical applications.", "et": "3.\tOmab ülevaadet TMR spektroskoopia ja mass-spektromeetria (MS) baasteooriat ning lihtsamaid praktilisi rakendusi."}, {"en": "4. Interprets IR spectra of alkanes, alkenes, alkynes, aromatic compounds, alcohols, phenols, ethers, ketones, aldehydes, carboxylic acids, esters, anhydrides, amides, amines, nitriles, nitro compounds, alkyl and aryl halides.", "et": "4.     Interpreteerib alkaanide, alkeenide, alküünide, aromaatsete ühendite, alkoholide, fenoolide, eetrite, ketoonide, aldehüüdide, karboksüülhapete, estrite, anhüdriidide, amiidide, amiinide, nitriilide, nitroühendite, alküül- ja arüülhalogeniidide IP-spektreid."}, {"en": "5. Interprets 13C and 1H NMR-spectra of simple organic compounds.", "et": "5. Interpreteerib lihtsamate orgaaniliste ühendite 13C ja 1H TMR-spektreid."}, {"en": "6. Uses spectral databases and is able to search for the required information in scientific literature in order to estimate correctness of conducted measurement.", "et": "6. Kasutab spektriandmebaase ja otsib vajalikku informatsiooni teadusartiklitest oma mõõtmistulemuste korrektsuse hindamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}