{"uuid": "0dc36830-b1b6-a406-a177-e1d73478242e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-28T11:44:31", "title": {"en": "Structural Analysis I", "et": "Struktuuranalüüs I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "label": {"en": "25/26 A regular LT Eng", "et": "25/26 S PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT09", "structural_unit_name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 24, "practice": 8, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The goal of the course is to give an overview of spectroscopic and spectrometric methods utilized for determination of structure of organic compounds (MS, IR and NMR). Different techniques of measurement, materials and instrumentation will be introduced. The students will develop their skills of scientific data search and critical thinking via interpretation of numerous spectra, IR-spectroscopy practical work and preparation of individually written report.", "et": "Kursuse eesmärgiks on tutvustada orgaaniliste ühendite struktuuri määramise spektroskoopilisi ja spektromeetrilisi meetodeid (MS, IP ja TMR). Tutvustatakse erinevaid mõõtmistehnikaid, materjale ja aparatuuri. Kursuse käigus arendab õppija oma teadusinfo otsimise ja kriitilise mõtlemise oskust läbi erinevate spektrite interpreteerimise, IP-spektroskoopia praktilise töö ning iseseisvalt koostatava aruande."}, "objectives": [{"en": "The goal of the course is to give an overview of spectroscopic and spectrometric methods utilized for determination of structure of organic compounds (MS, IR and NMR), to introduce the most important techniques of measurement, utilized materials and instrumentation. Additionally the course develops students  skills of spectra interpretation, scientific data search, critical thinking and allows to obtain  the first practical experience in IR-spectroscopy.", "et": "Kursuse eesmärgiks on tutvustada orgaaniliste ühendite struktuuri määramise spektroskoopilisi ja spektromeetrilisi meetodeid (MS, IP ja TMR), tähtsaimaid mõõtmistehnikaid, kasutatavaid materjale ja aparatuuri. Lisaks arendab kursus õppija spektrite interpreteerimise, teadusinfo otsimise ja kriitilise mõtlemise oskust ning võimaldab omandada esmase praktilise kogemuse IP-spektroskoopias."}], "learning_outcomes": [{"en": "The student, who has passed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1. Understands basic IR-spectroscopy theory.", "et": "1.\tMõistab põhilist IP-spektroskoopia teooriat."}, {"en": "2. Knows the most important measurement techniques and properties of optical materials.", "et": "2.\tTeab tähtsaimaid mõõtmistehnikaid ja optiliste materjalide omadusi."}, {"en": "3. Has an overview of NMR spectroscopy and Mass-spectrometry (MS) basic theory and the simplest practical applications.", "et": "3.\tOmab ülevaadet TMR spektroskoopia ja mass-spektromeetria (MS) baasteooriat ning lihtsamaid praktilisi rakendusi."}, {"en": "4. Interprets IR spectra of alkanes, alkenes, alkynes, aromatic compounds, alcohols, phenols, ethers, ketones, aldehydes, carboxylic acids, esters, anhydrides, amides, amines, nitriles, nitro compounds, alkyl and aryl halides.", "et": "4.     Interpreteerib alkaanide, alkeenide, alküünide, aromaatsete ühendite, alkoholide, fenoolide, eetrite, ketoonide, aldehüüdide, karboksüülhapete, estrite, anhüdriidide, amiidide, amiinide, nitriilide, nitroühendite, alküül- ja arüülhalogeniidide IP-spektreid."}, {"en": "5. Interprets 13C and 1H NMR-spectra of simple organic compounds.", "et": "5. Interpreteerib lihtsamate orgaaniliste ühendite 13C ja 1H TMR-spektreid."}, {"en": "6. Uses spectral databases and is able to search for the required information in scientific literature in order to estimate correctness of conducted measurement.", "et": "6. Kasutab spektriandmebaase ja otsib vajalikku informatsiooni teadusartiklitest oma mõõtmistulemuste korrektsuse hindamiseks."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "1. ÜLESANDED \t\n\nSemestri jooksul, eristav hindamine. Annab kuni 5% boonuspunkte. \n\nOrgaaniliste ühendite struktuuri määramine IP-spektrite (jt spektrite) abil, kasutades korrelatsioonitabeleid ja loengumaterjale. \n\nLävendikriteerium:\n·\tKõik interpreteerimisülesanded peavad olema lahendatud ja esitatud.\n\n\n1. EXERCISES\n\nIn the course of the semester,  graded. Gives up to 5% bonus points.\n\nDetermination of the structure of organic compounds by IR (and other) spectra, using correlation charts and lecture materials.\n\nPassing criteria:\n·\tAll interpretation exercises must be solved and presented."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "PRAKTILINE TÖÖ :\n\nSemestri teises pooles, eristav. Annab 10% lõpphindest.\n\n1) tahkete, vedelate, gaasiliste ainete, ms polümeersete materjalide IP-spektrite mõõtmine kasutades erinevaid mõõtmistehnikaid ja interpreteerimine.\n\n2) lihtsate orgaaniliste ühendite IP spektrite otsimine andmebaasidest, nende võrdlus eksperimentaalselt saadud spektritega eesmärgiga hinnata ainete identsust ja puhtust.\n\n3) Tundmatu polümeerse materjali struktuuri ja liigi määramine IP spektri põhjal.\n\nHindamise kriteeriumid: \n\t\n·\tKõik praktilised tööd peavad olema tehtud. \n\n·\tMõõdetud IP-spektrid peavad olema õieti interpreteeritud ja võrreldud spektriandmebaasides olevate spektritega.\n\n·\tKõikide praktiliste tööde nõuetekohased aruanded peavad olema esitatud.\n\n·\tIP-spektrite mõõtmiste aruanne peab sisaldama kasutatud mõõtmistehnikate lühikirjeldusi, mõõtmistingimusi, mõõdetud ja andmebaasidest  saadud spektreid ja järeldusi analüüsitud aine struktuuri ja puhtuse kohta.\n\n\nPRACTICAL WORK:\n\nIn the second part of the semester, graded. Gives 10% of the final grade.\n\n1) obtaining (measurement) and interpretation of IR spectra of solids, liquids, gases and various polymers by using various measurement techniques.\n\n2) database search for IR spectra of simple organic compounds, their comparison with recorded spectra in order to check compound identity and purity. \n\n3) Recording IR spectrum of unknown polymeric material, determination of material structure and type.\n\nAssessment criteria: \n\t\n·\tAll required practical measurements of the IR spectra must be carried out.\n\n·\tExperimental IR-spectra must be correctly interpreted and compared with reference spectra in spectral databases.\n\n·\tProperly made protocols (reports) of all practical works must be presented. \n\n·\tThe report must contain short descriptions and specification of the used techniques, obtained spectra and from spectral databases, conclusions about the structure and purity of the sample."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksamile saamiseks peavad olema esitatud ÜLESANNETE lahendused ja PRAKTILISE TÖÖ aruanded.\n\nEksam on struktureeritud  kirjalik töö, mis koosneb kolmest osast. Annab 90% lõpphindest.\n\nI\tLühivastusega küsimused molekulide võnkliikumist ja IP-spektri teket kirjeldava teooria kohta + lühiküsimused MS ja TMR kohta. Esseevastusega küsimus mõõtmistehnikate (sealhulgas peegeldustehnikate) kasutamise, nende eeliste ja puuduste kohta erinevate materjalide analüüsil.\n\nII\tIP-spektrite interpreteerimine (kasutades korrelatsioontabeleid).\n\nIII\tKompleksülesanne. Ühe lihtsama orgaanilise ühendi struktuuri määramine IP, TMR, MS spektrite järgi (kasutades korrelatsioontabeleid).\n\nHindamiskriteeriumid:\n\nE\tTunneb rahuldavalt molekulide võnkliikumise ja IP-spektri tekke põhilisi teoreetilisi aspekte. Teab IP-spektrite mõõtmiste tehnikate olulisemaid aspekte, esineb ebatäpsusi. Interpreteerimisülesannete lahendamisel esineb ebatäpsusi ja puudusi.\n\nD\tTunneb rahuldavalt molekulide võnkliikumist ja IP-spektri teket kirjeldavat teooriat. Teab IP-spektrite mõõtmiste tehnikate olulisemaid aspekte. Interpreteerimisülesannete lahendamisel esineb ebatäpsusi ja puudusi.\n\n\nC\tTunneb hästi molekulide võnkliikumist ja IP-spektri teket kirjeldavat teooriat. Teab piisavalt erinevaid IP-spektrite mõõtmiste tehnikaid. Enamus interpreteerimisülesandeid on lahendatud õieti, esineb ebatäpsusi ja puudusi.\n\nB\tTunneb väga hästi molekulide võnkliikumist ja IP-spektri teket kirjeldavat teooriat. Teab põhjalikult erinevaid IP-spektrite mõõtmiste tehnikaid. Kõik interpreteerimisülesanded on lahendatud õieti, esineb väheolulisi ebatäpsusi.\n\n\nA\tTunneb suurepäraselt molekulide võnkliikumist ja IP-spektri teket kirjeldavat teooriat. Teab üksikasjalikult ja põhjalikult erinevaid IP-spektrite mõõtmiste tehnikaid. Kõik interpreteerimisülesanded on lahendatud õieti.\n\n\n\n\n\nCriterion: \nINTERPRETATION  EXERCISES and PRACTICAL WORK report must be submitted.\n\n\nExam is a written work comprising three parts. Gives 90% of the final grade.\n\nI\tShort-answer-questions about the theory of vibration motion of molecules and formation of IR spectrum + brief questions about MS and NMR. Essay-answer-question concerning practical aspects, advantages and disadvantages of the techniques of the measurement of IR spectra (including reflectance techniques) used by analysis of various materials.\n\nII\tInterpretation of IR spectra (using correlation tables).\n \t\nIII Complex task.\nDetermination of the structure of one simple organic compound by IR, NMR and MS spectra (using correlation tables).\n\nAssessment criteria:\n\nE\tThe student knows satisfactorily main theoretical aspects of the theory of vibrational motion of molecules and formation of IR spectrum; knows main aspects of the techniques of measurement of IR spectra with inaccuracy(ies). The interpretation exercises are solved with shortcomings and inaccuracy(ies).\n\nD\tThe student knows satisfactorily the theory of vibrational motion of molecules and formation of IR spectrum; knows main aspects of the techniques of measurement of IR spectra. The interpretation exercises are solved with shortcomings and inaccuracy (ies).\n\nC\tThe student knows well the theory of vibrational motion of molecules and formation of IR spectrum; knows sufficiently the various techniques of measurement of IR spectra. Most interpretation exercises (problems) are solved, some shortcomings and inaccuracy(ies) occur.\n\nB\tThe student knows very well the theory of vibrational motion of molecules and formation of IR spectrum; knows in detail various techniques of measurement of IR spectra.  All interpretation exercises (problems) are solved, there are some insignificant inaccuracies.\n\n\nA\tThe student knows perfectly the theory of vibrational motion of molecules and formation of IR spectrum; knows in detail various techniques of measurement of IR spectra.  All interpretation exercises (problems) are perfectly solved."}}], "grade_preconditions": {"et": "Eksamile saamiseks peavad olema esitatud ÜLESANNETE lahendused ja PRAKTILISE TÖÖ aruanded.\nINTERPRETATION  EXERCISES and PRACTICAL WORK report must be submitted."}, "grade_evaluation": {"et": "Exam is a written work comprising three parts."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "6142389f-cdc7-0e3a-6783-2cb9407d0729", "person_name": "Anton Mastitski", "structural_unit": {"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-12n. 2L n-s.; 13-16n. 2P n-s.   E"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1.; 2.1 <B> Introduction. Infrared spectroscopy </B> Survey of the course and methods of chemical analysis.  Methods of spectroscopy in structure analysis of organic compounds. Basic theory of infrared spectroscopy. Absorption of infrared radiation and formation of spectra. Modes of vibrations and interactions.\n<BR>\n1.; 2.1 <B> Sissejuhatus.  Infrapunane spektroskoopia </B> Ülevaade kursusest ja analüüsi meetoditest. Elektromagnetkiirgus ja spektroskoopia meetodid. Orgaaniliste ühendite struktuuranalüüsil kasutatavamad spektroskoopia meetodid ja nende võrdlus. Infrapunase spektroskoopia alused. Kiirguse neeldumine ja spektri teke. Võnkumiste tüübid ja interaktsioonid. "}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.2 <B> Instrumentation and optical materials in infrared spectroscopy.</B> Spectrophotometers. Properties of optical materials, sample cells.\n<BR>\n2.2 <B> Infrapunase spektroskoopia aparatuur ja optilised materjalid. </B> Spektrofotomeetrite töö põhimõte. Optiliste materjalide omadused, küvetid ja nende kasutamine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.3 <B> Sampling techniques in infrared spectroscopy. </B> Advantages and drawbacks. Reflection techniques and their use in analysis of different materials.\n<BR>\n2.3 <B> Infrapunaste spektrite mõõtmiste tehnikad, </B> nende eelised ja puudused.  Peegeldustehnikate kasutamine erinevate materjalide analüüsil."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.4 <B> Interpretation of infrared spectra.</B>\n<BR>\n2.4.1 Location of absorption in spectrum and influencing factors. Identification of compounds by infrared spectra. Alkanes, alkenes. Exercises of interpretation.\n<BR>\n2.4 <B> Infrapunaste spektrite interpreteerimine.</B>\n\n2.4.1 Neeldumismaksimumi asukoht spektris ja seda mõjutavad faktorid. Ainete identifitseerimine infrapunaste spektrite abil. Alkaanid, alkeenid. Harjutusülesanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.4.2 Alkynes, aromatic compounds. Exercises of interpretation.\n<BR>\n2.4.2 Alküünid, aromaatsed ühendid. Harjutusülesanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.4.3 Alcohols, phenols, ethers, epoxides. Exercises of interpretation.\n<BR>\n2.4.3 Alkoholid, fenoolid, eetrid, epoksiidid. Harjutusülesanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.4.4 Ketones, aldehydes, carboxylic acids, and esters. Exercises of interpretation.\n<BR>\n2.4.4 Ketoonid, aldehüüdid, karboksüülhapped, estrid. Harjutusülesanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.4.4 Acid halides, anhydrides, amides, amines, nitriles. Exercises of interpretation.\n<BR>\n2.4.4 Happehalogeniidid, anhüdriidid, amiidid, amiinid, nitriilid. Harjutusülesanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.4.5 Imides, isocyanates, nitro compounds, sulfur compounds, alkyl- and aryl halides. Exercises of interpretation.\n<BR>\n2.4.5 Imiinid, isotsüanaadid, nitroühendid, väävliühendid, alküül- ja arüülhalogeniidid. Harjutusülesanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.5 <B> Methods of calculation of vibrational spectra. Spectral databases. </B> Comparison and correlations of calculated and experimental spectra.\n<BR>\n2.5 <B> Võnkespektrite arvutamine. Spektriandmebaaside kasutamine. </B> Arvutatud ja eksperimentaalsete spektrite võrdlus.\n<BR>\n3.<B> Introduction to mass-spectrometry. </B> Methods of ionization. Fragmentation pattern of organic compounds.\n<BR>\n3. <B> Massispektromeetria </B> kasutamine struktuuranalüüsil. Ionisatsioonimeetodid. Põhiliste orgaaniliste ühendite fragmenteerumisrajad."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3.<B> Introduction to mass-spectrometry. </B> Methods of ionization. Fragmentation pattern of organic compounds.\n<BR>\n3. <B> Massispektromeetria </B> kasutamine struktuuranalüüsil. Ionisatsioonimeetodid. Põhiliste orgaaniliste ühendite fragmenteerumisrajad."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. <B> Introduction to NMR-spectroscopy.</B> Basic principles of using NMR in structure analysis. Interpretation of proton and carbon NMR spectra.\n<BR>\n4. <B> TMR spektroskoopia </B> kasutamine struktuuranalüüsil. Prooton- ja süsinikspektrite interpreteerimine."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "4. <B> Introduction to NMR-spectroscopy.</B> Basic principles of using NMR in structure analysis. Interpretation of proton and carbon NMR spectra.\n<BR>\n4. <B> TMR spektroskoopia </B> kasutamine struktuuranalüüsil. Prooton- ja süsinikspektrite interpreteerimine.\n\n5. <B> Solving of complex tasks. </B>\n<BR>\n5. <B> Kompleksülesannete lahendamine. </B>"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "5. <B> Solving of complex tasks. </B>\n<BR>\n5. <B> Kompleksülesannete lahendamine. </B>"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "5. <B> Solving of complex tasks. </B>\n<BR>\n5. <B> Kompleksülesannete lahendamine. </B>"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "54e65046-31e4-3384-bace-4f1745d70d83", "parent_code": "LOKT.09.022", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}