{"uuid": "98726a2b-b39b-c7a5-d3b2-74d6aba4284e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-07T14:21:36", "title": {"en": "School Biology I", "et": "Koolibioloogia I"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "25/26 A block mode LT", "et": "25/26 S SÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 7, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 97, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "In the course on school biology will be given  a systematic and simplified overview of different disciplines of biology  ( anatomy and physiology, botany, zoology)  and  basic  biological processes (respiration, metabolism, reproduction, dispersal, movement, adaptation)  Attention will be especially given to typical misconceptions and the way how topics of biology are related to everyday life. The students  are taught to apply their knowledge of biology to problem solving, reasoning and decision-making, and to recognize and convincingly refute pseudo-scientific views.", "et": "Koolibioloogia kursuses antakse seostatud ja lihtsustatud ülevaade erinevatest bioloogiateadusharudest (anatoomia ja füsioloogia, botaanika, zooloogia) ja põhilistest bioloogilistest protsessidest (hingamine, ainevahetus, paljunemine, levimine, liikumine, kohastumine). Pööratakse tähelepanu tüüpiliste väärarusaamadele ning  bioloogia teemade seostamisele igapäevaeluga. Õpetatakse oma bioloogia-alaseid teadmisi rakendama lprobleemide lahendamisel, põhjendamisel ning otsuste vastuvõtmisel ning ära tundma pseudoteaduslikke seisukohti ning neid veenvalt ümber lükkama."}, "objectives": [{"en": "To give an overview of main problems of teaching biology at basic school level. The aim of studying school biology is to use problem-solving to gain a comprehensive overview of the diversity of life, the structures and functions of organisms, heredity, evolution and ecology, as well as main principles of environmental protection and introduce the uniqueness of humans and health lifestyles.  At the same time, the students gain overview of most important laws, theories, practical outputs and future trends in biology and professions in this field. In addition to academic knowledge, critical thinking and analytical skills are developed, which enables the application of biological knowledge in solving, justifying and making decisions in both scientific and everyday problems, and excludes acceptance of pseudo-scientific views.", "et": "Anda ülevaade koolibioloogia põhiprobleemidest põhikoolis. Probleemide lahendamise  kaudu  tervikülevaate  saamine elu mitmekesisuse, organismide ehituse ja talitluse seaduspärasustest, pärilikkuse, evolutsiooni  ja ökoloogia ning keskkonnakaitse printsiipidest, inimese eripärast ning tervislikest eluviisidest.  Ülevaate saamine  bioloogiateaduste  põhilistest seaduspärasustest, teooriatest, praktilistest väljunditest, tulevikusuundumustest ning nendega seotud rakendustest ja elukutsetest. Lisaks akadeemilstele teadmistele kujundatakse kriitilist mõtlemist ning analüüsivõimet, mis võimaldab bioloogia-alaseid teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning välistab pseudoteaduslike seisukohtadega nõustumise."}], "learning_outcomes": [{"en": "The graduate student:\n1. knows the content and theoretical fundamentals of the courses of biology in basic school;\n2. knows the main goals of the biology teaching and the knowledge acquired in school biology;\n3. is able to apply his knowledge in the explanation of biology problems and to compose problem exercises for students and exploratory study of biological processes used in teaching;\n4. are familiar with the most common misconceptions in the field of biology and the school is able to teach the students to organize any advance;\n5. is able to connect the problems of school biology with the problems of everyday life and of other natural sciences;\n6. is able to apply his / her knowledge in solving, substantiating and making decisions of both scientific and everyday problems and is able to critically analyze and refute various pseudo-scientific views.", "et": "1. tunneb põhikooli  bioloogiakursuste sisu ja teoreetilisi põhialuseid;\n2. teab bioloogiaõpetuse eesmärke  põhikoolis ja põhilisi nõutavaid õpitulemusi;\n3. oskab rakendada oma teadmisi koolibioloogia  probleemide selgitamisel ja koostada vastavaid probleemülesandeid õpilastele ning kasutada uurimuslikku õpet bioloogiliste protsesside  õpetamisel;\n4. on tuttav enam levinud väärarusaamadega koolibioloogia valdkonnas ja suudab oma õppetööd korraldada vastavalt õpilaste eelteadmistele;\n5.oskab seostada koolibioloogias käsitletavaid probleeme argielu ning teiste loodusteaduste probleemidega;\n6. oskab oma teadmisi rakendada nii  teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning on võimeline  kriitiliselt analüüsima erinevaid pseudoteaduslikke seisukohti ning neid ümber lükkama."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Tunnikava koostamine ühe põhikooli teema kohta.\n2. Töölehe koostamine ühe põhikooli teema kohta.\n3. Kontrolltöö koostamine ühe põhikooli teema kohta."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "100 - 85 % - A\n84 - 70% - B\n69 - 56 % - C\n55 - 43% - D\n42 - 31 % - E\n30 - 0 % - F"}}], "grade_preconditions": {"et": "Loengutel osalemine (50 %)"}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb vastavalt eksami hindele"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "1.\tRelve, K., Kirk, A., Tuvikene, A.,  Pappel, P.,  Hain, E., Mägi, E., Randveer, A. ja Kollist, Ü. (2017).  Bioloogia õpik 7. klassile. Avita.\n2.\tToom, M. Tedersoo, T. ja Relve. K. (2017).Bioloogia õpik 8. klassile, I osa. Avita.\n3.\tRelve, K., Kokassaar, U., Martin, M., Vanatoa, A., Rammul, Ü. ja  I., Ivask, M., Toom, M., Kalamees-Pani, K. ja Kollist,  Ü. (2017). Bioloogia õpik 8. klassile, II osa. Avita.\n4.\tKokassaar, U. ja  Relve, K. Bioloogia õpik 9. klassile, I osa. Avita.\n5.\tKokassaar, U., Martin, M. ja Relve, K. (2017). Bioloogia õpik 9. klassile, II osa. Avita.", "recommended_materials": "Avita kirjastuse bioloogia töövihikud 7., 8. (I ja II) ja 9. klassile (I ja II)"}, "participants": {"lecturers": [{"person_uuid": "605668cf-5227-371d-419d-ea0f32a84402", "person_name": "Anne Laius", "structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-20"}, "entries": [{"time": "2024-09-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatus põhikooli bioloogiasse.\nElu tunnused. organismide rühmad ja nende eluavaldused. Evolutsioon (looma- ja taimeriigi)."}}, {"time": "2024-09-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Loomade jaotamine selgrootuteks ja selgroogseteks. Selgroogsete loomade välistunnuste seos elukeskkonnaga. \nAine- ja energiavahetuse põhiprotsessid. Selgroogsete loomade toitumisviisid ja seedeelundkond,  hingamiselundite ehituse ja talitluse mitmekesisus (püsi- ja kõigusoojasus). Selgroogsete loomade eri rühmade südame ja vereringe võrdlus ning ebasoodsate aastaaegade üleelamise viisid. Selgroogsete loomade paljunemist ja arengut mõjutavad tegurid (kehasisene ja kehaväline viljastumine, moondeline ja moondeta areng, lõimetishoole). Selgroogsete ohustatus."}}, {"time": "2024-10-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Taimed. Eri taimerühmade ehitus ja paljunemine:\nVetikad. Sammaltaimed. Sõnajalgtaimed. Katteseemnetaimed ehk õistaimed. Õistaimede organid. Tõusev ja laskuv vool. Fotosüntees. Eri taimerühmade paljunemine."}}, {"time": "2024-10-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seened ja nende jaotus ja eluviis. Samblikud, nende ehituslikud iseärasused ja paljunemine. Selgrootute loomade üldiseloomustus ja võrdlus selgroogsetega. Käsnade, ainuõõssete, usside, limuste, lülijalgsete ja okasnahksete peamised välistunnused, paljunemine, levik ning tähtsus looduses ja inimese elus."}}, {"time": "2024-11-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Eluslooduse evolutsioon. Bioloogilise evolutsiooni olemus ning näited evolutsiooni tõendite kohta looma- ja\ntaimeriigis; olelusvõitluse tekkepõhjused ja nende seosed olelusvõitluse loodusliku valikuga; liikide teke ja suuremate\norganismirühmade evolutsiooni põhisuunad; inimese evolutsiooni olulisemad etapid.\nÖkoloogia ja keskkonnakaitse. Rohetehnoloogia vajalikkus. Bioloogiline mitmekesisus."}}, {"time": "2024-11-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Mikroorganismid: algloomad, bakterid ja viirused. Bakterite, algloomade ja viiruste põhitunnuste eripära võrreldes taimede ja loomadega; bakterite ja algloomade levik eri elupaikades, sh aeroobses ning anaeroobses keskkonnas;  kiire paljunemise ja püsieoste\nmoodustumise olulisus bakterite levikus;  bakterite ja algloomade tähtsus looduses ning inimtegevuses;  toidu kaismine bakteriaalse riknemise eest; inimese sagedasemad bakteritest, viirustest ja algloomadest põhjustatud haigused ja nende levikuviisid ning nende vältimine."}}, {"time": "2024-12-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Inimene kui tervik, inimese elundkonnad, inimese talitluse regulatsioon, paljunemine ja areng."}}, {"time": "2024-12-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kokkuvõttev hindamine"}}]}, "registration_info": {"audience": {"et": "Gümnaasiumi loodusteaduste õpetaja"}, "min_students": 5}, "parent_uuid": "4f6a01d5-7a5b-4e82-02bf-c5670dbe047f", "parent_code": "LOLO.00.076", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}