{"uuid": "8d957973-2b55-af36-c20f-88e3b936152f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-13T11:15:57", "title": {"en": "Science Didactics I", "et": "Loodusteaduste didaktika I"}, "credits": 2, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S block mode LT", "et": "24/25 K SÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 6, "internship": 0}, "prerequisites": [{"required": true, "uuid": "5ebb1a80-f626-ba35-4157-00803d4e2b97", "code": "SVHI.01.092", "title": {"en": "Teaching for Learning", "et": "Õppimist toetav õpetamine"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course promotes understanding about the nature of science education and direction of its future developments in the framework of international comparative studies. The meaning of scientific literacy, its levels and relationship with competencies stated in school science curricula will be discussed. Evidence of students` understandings about science will be collected and didactical suggestions based on those drawn. Students` s relevant teaching strategies towards developing higher order thinking skills among students will be promoted.  Students will develop  test in electronic environment  measuring levels of scientific literacy", "et": "Õppeaine annab ülevaate loodusteadusliku hariduse olemusest ning paradigmaatilistest suundumustest rahvusvaheliste võrdlusuuringute taustal. Omandatakse teadmised ja oskused loodusteadusliku kirjaoskuse tasemete hindamiseks ning loodusvaldkonna õppekava tõlgendamiseks ja rakendamiseks. Kogutakse tõendusmaterjali õpilaste arusaamade kujunemisest  ning koostatakse selle alusel metoodilisis soovitusi.  Käistletakse relevantse õpetamise strateegiaid, mis on suunatud kõrgemat järku mõtlemist nõudvate oskuste kujundamisele. Omandatakse oskus koostada loodusteadsuliku kirjaoskuse tasmeeid hindav test elektroonses keskkonnas."}, "objectives": [{"en": "To promote understanding of the nature of science education and  about about paradigmatic changes in science education  and skills to analyze  those critically at international and local level. To acquire skills to  interpret  collectively results of international studies  and plan student relevant teaching and assessment in science class:", "et": "Omandada  teadmised  loodusteaduste õpetamise paradigmaatilisetest muutustest  ning oskused neid muutusi koostöös teiste üliõpilastega kriitiliselt analüüsida  nii rahvusvahelisel kui kohalikul tasandil, samuti  interpreteerida rahvusvaheliste võrdlusuuringute tulemusi ja selle alusel kavandada nii  õpilastele relevantset õpetamist kui hindamist:"}, {"en": "- to promote skills to recognize and solve problems in everyday situations;", "et": "- arendada oskust tunda ara ja lahendada probleeme igapäevaeluslistes  situatsioonides; "}, {"en": "- to promote digital competencies  though  developing test in an electronic environment  for evaluating  students` levels of scientific literacy", "et": "- arendada digipädevusi läbi  loodusteadusliku kirjaoskuse taset hindava  testi koostamise  elektroonses keskkonnas;"}, {"en": "-  to develop competencies to promote science related career awareness", "et": "- omandada oskused loodusteadustega seotud karjääriteadlikkuse kujundamiseks "}, {"en": "-  to  develop skills to reflect acquired  knowledge and skills", "et": "- kujundada oskused omandatud  teadmisi ja oskusi reflekteerida"}], "learning_outcomes": [{"en": "A graduate student:\n1. Understands the nature of science education and is able to present teaching-learning  goals and learning outcomes.\n2. Understands the meaning of scientific literacy, its levels and relationship with competencies stated  in  school curriculum document.\n3. Understands the nature and direction of paradigmatic changes in teaching science, is capable to analyse and evaluate problems in science education locally and worldwide and predict the direction of future changes. \n4. Holds an overview of international comparative studies and is able to give critical evaluation on the interpretation of the outcomes.\n6. Holds an overview about students understandings about science, is able to collect evidence and draw collectively didactical suggestions based on those.\n7. Holds competence to develop test items  in an electronic environment to measure scientific literacy.\n8.  Identifies scientific problems in everyday situations and plans student relevant teaching\n9. Compiles reflective portfolio.", "et": "1. Saab aru loodusteadusliku hariduse olemusest, oskab sõnastada õpetamise eesmärke ning õpitulemusi.\n2. Oskab selgitada loodusteadusliku kirjaoskuse tähendust, selle erinevaid tasandeid ja seotust üldhariduskooli õppekavas esitatud kompetentsustega.\n3. Omab ülevaadet paradigmaatilistest muutustest loodusainete õpetamisel ning oskab analüüsida ja  hinnata loodusainete õpetamisega seonduvaid probleeme Eestis ja rahvusvaheliselt ning prognoosida edasiste muutuste suunda.\n4. Omab ülevaadete rahsvusvahelistest võrdlusuuringutest ning oskab  anda neile põhjendatud  kriitilise hinnangu ning kavandada hindamist.\n6. Omab ülevaadet õpilaste arusaamade kujunemisest, oskab koguda selle kohta  koostöös teistega tõendusmaterjali  ja  koostada  meeskonnatöös metoodilisi soovitusi õpetamiseks aj õppetöö kavandamiseks\n7. Oskab koostada loodusteadusliku kirjaoskuse tasemeid hindava  testi  ülesandeid  elektroonses keskkonnas ja interpreteerida  nende tulemusi.\n8. Tunneb ära probleeme igapäevaelulistes situatsioonides ja kavandab nende alsuel õpilastele relevantset õpet\n9. Koostab refelekteeriva portfolio ."}], "notes": {}}, "grading": {"independent_work": {"et": "I Koostada  ja esitada seminari ettekanne etteantud  teemade valikust  (arvestuslik).\nII  Lahendada LGüm test,\nIII Koostada paaristööna kontekstipõhise  LK testi osa (2x 4ülesannet  kõik kahele tasemele vastavalt)) + põhjendada ülesannete sobivust multidimensionaalse LK hindamiseks (hindeline)."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Interaktiivne uue teema esitlus   arvestuslik"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "LK testi koostamine .  Testi kontekst ja kusimused vastavad (põhjendusega)  etteantud tasemetele , ainealaseidi vigu ei esine, vastused küsimustele  esitatud A\n                                   Testi kontekst ja küsimustest  5 vastavad ( põhjendusega) etteantud tasemetele, esineb üksik ainealane viga, vastused küsimusetele esitatud B\nTesti kontekst ja 4 kusimust vastavad ( põhjendusega) tasemetele , esineb üksik ainealane viga, vastused küsimustele esitataud C\nTesti kontekst  vajab korrigeerimist ,  minimaalselt 3 kusimust vastavad ( põhjendusega) tasemetele, esineb üksik ainealane viga, vastused küsimustele esitataud D\nTesti kontekst vajab korrigeerimist minimalselt  3 kusimust vastavad ( põhjendusega) tasemetele , esineb üksik ainealane viga, vastuseid  kõigile küsimustele  ei ole lisatud E \n Testi kontekst ei vasta nõuetele küsimused ei vasta tasemetele või ei ole põhjendatud , test sisaldab aienalaseid vigu, vastuseid koigile kuisimustele antud ei ole F"}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Interaktiivne slaidide esitlus, metoodiliste soovituste esitamine  arvestuslik"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Eelneva kolme kodutöö põhjal kujuneb hinne:\n   A  tööd 1,2, 3  esitatud tähtaegselt ,  töö 3 hinne on A või B\n   B  üks kodutöö on hilinenud, töö 3 hinne on B või  koik kodutööd esitatud tähtaegselt, töö 3 hinne C\n   C  üks kodutöö on hilinenud, töö 3 hinne on C või  koik kodutööd esitatud tähtaegselt, töö 3 hinne D\n   D   rohkem kui uks kodutöö on hilinenud, töö 3 hinne on C või D"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Avatud materjalidega eksam:\nA terminoloogia korrektne kasutus,  kodutööde konseptualiseerimine, põhjendamine\nB üksikud vead  terminoloogia korrektses kasutuses,  kodutööde konseptualiseerimine  osaline, põhjendamine ühest aspektist lähtudes\nC vead terminoloogia kasutuses  või kodutööde konseptualiseerimisel vead , põhjendamine ühest aspektist lähtudes\nD  vead terminoloogia kasutuses, kodutööd  osaliselt konseptualiseeritud, põhjendamine ja selgitamine ei ole ersitatavad\nE  vead terminoloogia kasutuses, kodutööd osaliselt kontseptualiseeritud,  ei pohjenda \nF  vead terminoloogia kasutuses, kodutööd konseptualiseerimata,  ei põhjenda\n\n Lõpphinne moodusatub 50 % kodutööde hindest ja 50%  eksamitöö hindest ( võrdsete panuste korral kujuneb hinne kõrgema hinde järgi)"}}], "grade_preconditions": {"et": "Kõik kodutööd peavad olema esitatud ja  seminari ettekanded tehtud"}, "grade_evaluation": {"et": "Eksam avatud materjalidega.\nHindest 50% moodustavad kodused tööd ja seminaridel esinemised, 50% avatud materjalidega eksam\nEksamil hinnatakse  valdkondliku terminoloogia korrektset kasutamist, kodutööde kontseptualieerimist ja põhjendamise oskust. Ainealaste vigade esinemine alandab hinnet."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga ( kodutööde põhjendatud hilisem esitamine) .  Seminari ettekandeid saab teha  ainult seni kuni kursus toimub ja on kuulajad."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Õpik: Rannikmäe, M. ja Soobard, R. (Toim.). (2014) Paradigmaatilised suundumused loodusainete\nõpetamisel üldhariduskoolis. EÜK.\n\nVeebikeskond www.oppekava.ee\nLoodusvaldkond:\nLoodusteaduste- ja tehnoloogiaalase kirjaoskuse kujundamine - Miia Rannikmäe\nLoodusvaldkonna seostest õppekava üldosaga - Imbi Henno\nOtsustamisprotsess loodusainete õpetamisel - Anne Laius, Miia Rannikmäe\nÕpilaste arusaamade arvestamine loodusainete õpetamisel - Miia Rannikmäe, Moonika Teppo\nKuidas suurendada õpilaste huvitatust loodusteaduste õppimise vastu, huvi õpingute jätkamise ning ainega seotud elukutsete vastu?- Moonika Teppo, Miia Rannikmäe\nTeaduse olemus ja loodusainete õpetamine - Miia Rannikmäe ja Arne Rannikmäe\n\n\n\nVideoloengud\nJack Holbrook Impact of research in science education.\nhttps://www.youtube.com/watch?v=_bxTOCbzqEE", "recommended_materials": "Ingliskeelsed õppematerjalid\nAAAS Atlas of Scientific Literacy http://www.project2061.org/publications/atlas/default.htm?PHPSESSID=eb2126dc157ece2f01eaf3ff338d27da\nDriver,R., Leach,J., Millar,R.&Scott,P. (1997) Young Peoples Images of Science. Open Univeristy Press. Buckingham-Philadelphia\nMcComas,A.( 1998) The Nature of Science in Science Education. Kluwer Academic Publishers. Dordrecht-Boston- London\n\"Science Education for Now\" (www.ec.europa.eu/research/science-society/document_library/pdf_06/report-rocard-on-science-education_en.pdf)"}, "participants": {"lecturers": [{"person_uuid": "b2c63882-3959-05ca-0710-b37c83a3afe8", "person_name": "Miia Rannikmäe", "structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-42"}, "entries": [{"time": "2024-02-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "\n\n Loodusteadusliku hariduse olemus. Paradigmaatilised muutused loodusteaduste õpetamisel.  LoteGum testile vastamine"}}, {"time": "2024-03-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "\n\nLoodusteaduslik kirjaoskus, selle tasemed ja kujundamine. Loodusteadusliku kirjaoskuse uuringud, nende tulemuste tõlgendamine ja kriitiline analüüs. Kõrgemat järku mõtlemist sisaldavad tegevused (probleemide lahendamine, otsuste tegemine, põhjendamine jne) \nKodus videoloengu vaatamine: https://www.youtube.com/watch?v=_bxTOCbzqEE Milline oleks jargmine paradigmaatiline muutus loodusteaduslikus hariduses "}}, {"time": "2023-04-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Loodusteadusliku kirjaoskuse hindamine. PISA. e- tasemetööde kontseptsioon"}}, {"time": "2024-04-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Tasemetoode kontseptsioon.Relevantsed kontekstid.Teaduslikud ja sotsiaalteaduslikud probleemid loodusainete tundides"}}, {"time": "2024-04-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Õpilaste arusaamad loodusteadustest. Näiteid õpilaste arusaamadest (sh väärarusaamade probleem) ja metoodilised soovitused\n\nRaamideede kontseptsioon"}}, {"time": "2024-05-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kontekstipõhiste ülesannete koostamine ja tutvustamine"}}, {"time": "2024-05-23", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Teadus ja pseudoteadus.   Loodusteadused ja sotsiaalteadused. "}}, {"time": "2024-06-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kontekstipõhiste ülesannete koostamine ja tutvustamine"}}, {"time": "2023-06-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kontekstipõhiste ülesannete koostamine ja tutvustamine, lahendamine"}}, {"time": "2024-06-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {"et": "Gümnaasiumi loodusteaduste õpetaja"}, "min_students": 5}, "parent_uuid": "cdfb2559-528e-06e0-9657-3e9300128d62", "parent_code": "LOLO.00.074", "parent_credits": 2, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}