{"uuid": "0eb48dfa-b479-b6c3-3d6a-d5d39d4a8ec8", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-04T10:30:34", "title": {"en": "School Biology II", "et": "Koolibioloogia II"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S block mode LT", "et": "24/25 K SÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "4f6a01d5-7a5b-4e82-02bf-c5670dbe047f", "code": "LOLO.00.076", "title": {"en": "School Biology I", "et": "Koolibioloogia I"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "In the course on school biology a systematic and summative overview of different disciplines of biology will be given. Attention will be especially given to typical misconceptions and the way how topics of general biology are related to problems of everyday life. The field of biology, scientific methods, composition of organisms,   cell diversity,  energy needs of organisms, development of organisms, regulatory mechanisms in humans, principles of molecular biology, viruses and bacteria, heredity and mutation,  biological evolution, ecology and environmental protection. In addition to academic knowledge, critical thinking and analytical skills are developed, which enables the application of biological knowledge in solving, substantiating and making decisions in both scientific and everyday problems, and excludes acceptance of pseudoscientific positions.", "et": "Gümnaasiumi koolibioloogia kursuses antakse seostatud ja kokkuvõtlik ülevaade erinevatest bioloogiateadusharudest. Pööratakse tähelepanu tüüpiliste väärarusaamadele ning üldbioloogia teemade seostamisele igapäevaeluliste probleemidega. Elu omadused ja organiseerituse tasemed. Teaduslik uurimismeetod. Organismide koostis. Raku ehitus ja talitlus. Bakterid ja viirused. Aine- ja energiavahetus. Organismide paljunemine ja areng.  Molekulaarbioloogilised põhiprotsessid. Pärilikkus. Evolutsioon. Ökoloogia ja keskkonnakaitse. Rakendusbioloogia. Inimese talitluse regulatsioon. Lisaks akadeemilstele teadmistele kujundatakse kriitilist mõtlemist ning analüüsivõimet, mis võimaldab bioloogia-alaseid teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning välistab pseudoteaduslike seisukohtadega nõustumise."}, "objectives": [{"en": "To give an overview of knowledge and theoretical basis of biology courses at secondary level. To gain a comprehensive overview of the diversity of life, the structures and functions of organisms, heredity, evolution and ecology, as well as main principles of environmental protection. At the same time, the students gain overview of most important laws, theories, practical outputs and future trends in biology and professions in this field. In addition to academic knowledge, critical thinking and analytical skills are developed, which enables the application of biological knowledge in solving, substantiating and making decisions in both scientific and everyday problems, and excludes acceptance of pseudoscientific positions.", "et": "Anda süvendatud ülevaade gümnaasiumi bioloogiakursuste sisust ja teoreetilistest põhialustest.   Tervikülevaate kujundamine elu mitmekesisuse, organismide ehituse ja talitluse, pärilikkuse, evolutsiooni  ja ökoloogia ning keskkonnakaitse  põhiprintsiipidest. Ülevaate saamine  bioloogiateaduste  põhilistest seaduspärasustest, teooriatest, praktilistest väljunditest, tulevikusuundumustest ning nendega seotud rakendustest ja elukutsetest.  Lisaks akadeemilstele teadmistele kujundatakse kriitilist mõtlemist ning analüüsivõimet, mis võimaldab bioloogia-alaseid teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning välistab pseudoteaduslike seisukohtadega nõustumise."}], "learning_outcomes": [{"en": "The graduate student:\n1. knows the content and theoretical fundamentals of the courses of biology in gymnasium;\n2. knows the main goals of the biology teaching and the knowledge acquired in school biology;\n3. is able to apply his knowledge in the explanation of biology problems and to compose problem exercises for students and  exploratory study of biological processes used in teaching;\n4. is able to connect the problems of school biology with the problems of everyday life and of other natural sciences;\n5.is able to apply his / her knowledge in solving, substantiating and making decisions of both scientific and everyday problems and is able to critically analyze and refute various pseudo-scientific views.", "et": "1. tunneb gümnaasiumi  bioloogiakursuste sisu ja teoreetilisi põhialuseid;\n2. teab bioloogiaõpetuse eesmärke gümnaasiumis ja põhilisi nõutavaid õpitulemusi;\n3. oskab rakendada oma teadmisi koolibioloogia probleemide selgitamisel ja koostada vastavaid probleemülesandeid õpilastele ning kasutada uurimuslikku õpet bioloogiliste protsesside  õpetamisel;\n4. oskab seostada koolibioloogias käsitletavaid probleeme argielu ning teiste loodusteaduste probleemidega.av enam levinud väärarusaamadega koolibioloogia valdkonnas;\n5. oskab oma teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning on võimeline kriitiliselt analüüsima erinevaid pseudoteaduslikke seisukohti ning neid ümber lükkama."}], "notes": {}}, "grading": {"independent_work": {"et": "Ühe valitud gümnaasiumi bioloogia teema esitlemine."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Ette teatatud teema kohane kollokvium"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Viiakse läbi vastavalt teemale"}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Kokkuleppel üliõpilastega jagatakse teemad, mida ette valmistada"}}], "grade_preconditions": {"et": "Loengutel ja seminaridel osalemine (75 %)."}, "grade_evaluation": {"et": "100 - 85 % - A\n84 - 70% - B\n69 - 56 % - C\n55 - 43% - D\n42 - 31 % - E\n30 - 0 % - F"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "c21c2888-d444-43ae-92a4-6faee026e1a1", "type": "MOODLE", "code": "LOLO.00.077_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1. Tenhunen jt (2012). Bioloogia õpik gümnaasiumile, I kursus. Bioloogia kui teadus. Organismid. Rakuõpetus. Kirjastus AVITA.\n2.Tenhunen jt. (2012). Bioloogia õpik gümnaasiumile, II kursus. Organismide energiavajadus, areng ja regulatsioon. Kirjastus AVITA.\n3.Tenson jt. (2013).  Bioloogia õpik gümnaasiumile, III kursus. Molekulaarbioloogia. Viirused ja bakterid. Pärilikkus. Kirjastus AVITA.\n4. Happonenn jt. (2013). Bioloogia õpik gümnaasiumile, IV kursus. Evolutsioon. Ökoloogia. Keskkonnakaitse. Kirjastus AVITA.", "recommended_materials": "1. Gümnaasiumi bioloogia digimaterjalid: Gümnaasiumibioloogia 2. http://www.biodigi.edu.ee\n2. Sarapuu, T. (2003). Bioloogia gümnaasiumile I osa. Kirjastus LOODUSFOTO\n3. Viikmaa, M. ja Tartes, U. (2010). Bioloogia gümnaasiumile. II osa, 3. kursus. Rakendusbioloogia. Inimene. Kirjastus LOODUSFOTO.\n4. Alamäe jt. (2000). Bioloogia gümnaasiumile. II osa. Kirjastus LOODUSFOTO.\n5. Sarapuu, T.; Viikmaa, M.; Puura, I. (2006). Bioloogia gümnaasiumile II osa 4. kursus.  Eesti Loodusfoto.\n6. Järvalt, H. (2013). Bioloogia lühikursus gümnaasiumile.Kirjastus LOODUSFOTO."}, "participants": {"lecturers": [{"person_uuid": "605668cf-5227-371d-419d-ea0f32a84402", "person_name": "Anne Laius", "structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}, "entries": [{"course_week": 1, "time": "2025-02-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Bioloogia uurimisvaldkonnad. Pärilikkus ja evolutsioon"}, "description": {"et": "Elu tunnused, elusa ja eluta looduse võrdlus. Eluslooduse organiseerituse tasemed ning nendega seotud bioloogia haruteadused ja vastavad elukutsed. Eluslooduse molekulaarset, rakulist, organismilist, populatsioonilist ja ökosüsteemilist organiseerituse taset iseloomustavad elu tunnused.\nLoodusteadusliku uuringu kavandamine ja tegemine ning tulemuste analüüsimine ja esitamine. Loodusteadusliku meetodi rakendamine, lahendades bioloogiaalaseid ja igapäevaelu probleeme.\n\nPärilikkuse ja muutlikkuse avalduminekohta eri organismirühmadel. Mutatsioonilise ja kombinatiivse muutlikkuse tekkepõhjused ning tulemused. Modifikatsioonilise muutlikkuse graafikute analüüs. Mendeli katsetes ilmnenud fenotüübiliste suhete seostamine genotüüpide rekombineerumisega. Geneetikaülesanded Mendeli seadustest, AB0- ja reesussüsteemi vererühmadest ning suguliitelisest pärandumisest. Vastutustundlik suhtumine keskkonnategurite rolli inimese puuete ja haiguste tekkes. \n\nDarwini evolutsioonikäsitlus.  Loodusteaduste uuringud , mis tõestavad bioevolutsiooni. Erinevad seisukohad elu päritolu kohta Maal. Loodusliku valiku vormid, nende toimumise tingimused ja tulemused ning näited nende kohta. Eri tegurite osa uute liikide tekkes, näited selle kohta. Evolutsioonilise mitmekesistumise, täiustumise ja väljasuremise tekkemehhanismid ning avaldumisvormid. Inimese eripära inimahvidega võrreldes ning bioloogiliste ja sotsiaalsete tegurite osa nüüdisinimese evolutsioonis.\nBioevolutsiooni pseudoteaduslikud käsitlused. \n"}}, {"course_week": 2, "time": "2025-03-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "Organismide koostis"}, "description": {"et": "Elus- ja eluta looduse keemilise koostise võrdlus. Vee omaduste seos organismide elutalitlusega. Peamiste katioonide ja anioonide esinemine ning tähtsus rakkudes ja organismides. Biomolekulide üldine ehitus ja ülesanded. Organismides esinevate peamiste biomolekulide - süsivesikute, lipiidide, valkude ja nukleiinhapete - ehituslikud ning talitluslikud seosed. DNA ja RNA ehituse ning ülesannete võrdlus. Vee, mineraalainete ja biomolekulide osa tervislikus toitumises."}}, {"course_week": 3, "time": "2025-03-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"et": "Eukarüootsed rakud"}, "description": {"et": "Rakk. Rakuteooria põhiseisukohad, selle olulisus eluslooduse ühtsuse mõistmisel. Rakkude ehituse ja talitluse omavaheline vastavus peamiste inimkudede näitel. Päristuumse raku ehituse seos bioloogiliste protsessidega loomaraku põhjal. Rakutuuma ja selles sisalduvate kromosoomide tähtsus. Rakumembraani peamised ülesanded, ainete passiivne ja aktiivne transport. Ribosoomide, lüsosoomide, Golgi kompleksi ja mitokondrite osa bioloogilistes protsessides. Tsütoplasmavõrgustiku ja tsütoskeleti talitlus.\nRaku ehituse ja talitluse terviklikkus, organellide omavaheline koostöö.\nRakkude mitmekesisus\nTaimerakule iseloomulike plastiidide, vakuoolide ja rakukesta seos taimede elutegevusega. Seeneraku ehituse ja talitluse erinevused võrreldes teiste päristuumsete rakkudega. Seente roll looduses ja inimtegevuses, nende rakendusbioloogiline tähtsus. Inimese nakatumine seenhaigustesse ning selle vältimine. "}}, {"course_week": 4, "time": "2025-04-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "Organismide areng"}, "description": {"et": "Rakutsükkel ja mitoos. Meioos. \nRaku muutused rakutsükli eri faasides. Kromosoomistiku muutused mitoosis ja meioosis ning nende tähtsus. Mehe ja naise sugurakkude arengu võrdlus ning nende arengut mõjutavad tegurid. \nJärglaste saamine on bioloogiline elu eesmärk.\nMunaraku viljastumine naise organismis. Erinevate rasestumisvastaste vahendite toime ja tulemuslikkuse võrdlus. \nInimese sünnieelses arengus toimuvad muutused, sünnitus.\nLootejärgse arengu etapid selgroogsetel loomadel. Organismide eluiga mõjutavad tegurid. Inimese vananemisega kaasnevad muutused ja surm. Suguhaigustesse nakatumise viisid ning haiguste ning soovimatu rasedduse vältimine.\nSelgroogsete loomade lootejärgsed arenguetapid ja inmes areng. \n\n\n"}}, {"course_week": 5, "time": "2025-04-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"et": "Organismide energiavajadus"}, "description": {"et": "Organismide energiavajadus, energia saamise viisid autotroofsetel ja heterotroofsetel organismidel. Organismi üldine aine- ja energiavahetus. ATP universaalsus energia salvestamises ja ülekandes. Fotosünteesi tähtsus taimedele, teistele organismidele ning biosfäärile. Hingamine kui organismi varustamine energiaga.keskkonnategurite osa hingamisetappide toimumises ning energia salvestamises. Aeroobne ja anaeroobne hingamine. Käärimine kui anaeroobne hingamine, selle rakenduslik tähtsus. "}}, {"course_week": 6, "time": "2025-04-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {"et": "Molekulaargeneetilised põhiprotsessid. Viirused ja bakterid"}, "description": {"et": "Pärilikkuse ja keskkonnategurite osa organismi tunnuste kujunemisel. DNA, RNA ja valkude osa päriliku info avaldumises.   Geneetilise koodi omadused ning nende avaldumine valgusünteesis. Geeniregulatsiooni osa inimese ontogeneesi eri etappidel ning  elukeskkonna mõju geeniregulatsioonile. Inimese haigused, mis seostuvad geeniregulatsiooni häiretega. \n\nViiruste levik ja paljunemine ning nende organismisisene toime.  Bakteriraku ehituse ja talitluse võrdlus päristuumsete rakkudega. Inimesel levinumate viirus- ja bakterhaiguste seos nende vältimise võimalustega ning tervislikud eluviisid ja vaktsineerimise tähtsus; Geenitehnoloogiliste rakenduste dilemmaprobleemide lahendamine, arvestades teaduslikke, majanduslikke, eetilisi ja seadusandlikke seisukohti. Näited bakterite ja viiruste geenitehnoloogiliste kasutusvõimaluste, sellega seotud teadusharude ning elukutsete kohta. "}}, {"course_week": 7, "time": "2025-05-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"et": "Inimese talitluse regulatsioon "}, "description": {"et": "Inimese närvisüsteemi osad ja nende talitlus. Eri tegurite mõju närviimpulsi tekkes ja levikus. Närvisüsteemiga seotud levinumad puuded ja haigused ning nende põhjused ja välised ilmingud. Sisesekretsiooninäärmete ja nende eritatavate hormoonide roll inimese talitluste regulatsioonis ning nende seos neuraalse regulatsiooniga. Inimorganismi kaitsesüsteemid ja vaktsineerimise tähtsu. Vere püsiva koostise tagamise mehhanismid ja selle tähtsus. Inimese energiavajaduse ning termoregulatsiooni mehhanismid. "}}, {"course_week": 8, "time": "2025-05-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 8, "topic": {"et": "Ökoloogia ja keskkonnakaitse"}, "description": {"et": "Abiootiliste ja biootiliste keskkonnategurite mõju graafikud ning  näited nende rakendusvõimaluste kohta. Skemaatilisi joonisei ja mõistekaardid toitumissuhete kohta ökosüsteemis. Iseregulatsiooni kujunemineökosüsteemis ja seda ohustavad tegurid. Organismide kooseluvormid ja nende toimimine.Ökosüsteemi (nt biosfääri jt) läbiva energiavoo skemaatilised joonised ning  ökopüramiidi reegli ülesanded. \n\nInimtegevuse osa liikide hävimises ning  vastutustundlik suhtumine enda tegevusesse looduskeskkonnas. Elurikkuse kaitse olulisus ning iga inimese vastutus selle eest, näidates üles ühiskondlikku aktiivsust, mis tugineb loodusteaduslikel teadmistel. Looduse, tehnoloogia ja ühiskonna vastastikused seosed ning kestliku arengu tähtsus isiklikul, kohalikul, riiklikul ja rahvusvahelisel tasandil, teadvustades rohepöörde olulisust. Eesti looduskaitseseaduses esitatud kaitstavate loodusobjektide jaotus ning näited kohta näiteid. Kohalikele näidetele tuginevad keskkonna dilemmaprobleemid, arvestades teaduslikke, majanduslikke, eetilisi ja seadusandlikke seisukohti. "}}]}, "registration_info": {"audience": {"et": "Gümnaasiumi loodusteaduste õpetaja"}, "min_students": 5}, "parent_uuid": "eb1d5b21-5f1b-6353-1545-1664335d084a", "parent_code": "LOLO.00.077", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}