{"uuid": "776d4f90-c885-f2d9-c163-61494222e30f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-14T10:24:22", "title": {"en": "Microbiology I", "et": "Mikrobioloogia I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR03", "structural_unit_name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 24, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The following subjects will be covered during the course: archaea and bacteria as two prokaryotic domains of life; the contemporary classification of prokaryotes; comparison of eukaryotic and prokaryotic cell types; specific features of archaea; important milestones and achievements of microbiology. Detailed characterization of the prokaryotic cell: membranes, cell wall, pili and flagella, intracellular inclusions, organelles, storage compounds, endospores. Overview of proliferation of bacteria, relationships of the microbial cells with the environment (including the effects of temperature, pressure, pH, conservants and desinfectants, irradiation and oxygen) and the roles of prokaryotes in nature.", "et": "Käsitletakse prokarüootide (arhede ja bakterite) kohta eluslooduse kolmedomeenses süsteemis, kaasaegse bakterisüstemaatika põhialuseid, võrreldakse prokarüootset rakku eukarüootsega, tuuakse välja arhede iseärasused, käsitletakse mikrobioloogia ajalugu ja suurkujusid. Esitletakse prokarüootse raku siseehitust: iseloomustatakse membraane, rakukesta, kapsleid, organelle, varuaineid, vibureid, piilisid, endospoore. Käsitletakse prokarüootide paljunemist, liikumisviise, suhteid ümbritseva keskkonnaga (sh temperatuuri, rõhu, kiirguse, desinfitseerivate ainete ja konservantide, hapniku ja pH toimet mikroorganismidele) ja mikroobide rolli looduses."}, "objectives": [{"en": "The main goal is to obtain basic knowledge on prokaryotes (archaea and bacteria), their diversity and classification, their structuctural and functional features and their relationships with the environmental factors. In addition, the history of microbiology research and the most important achievements will be briefly introduced.", "et": "Põhieesmärgiks on ülevaatlikult tutvuda prokarüootidega (arhed ja bakterd), nende mitmekesisuse ja kohaga eluslooduse süsteemis, nende sise- ja välisehituse ja funktsioneerimise ning nende suhestumisega erinevate keskkonnatingimustega. Lisaks antakse lühiülevaade mikroobide uurimise ajaloo ja olulisemate avastuste kohta."}], "learning_outcomes": [{"en": "After the course, the students have obtained basic knowledge on bacteria and archaea, their size, classification and main groups. The students can name the main achievements in microbiology research and the most famous microbiologists. The students are able to name the main elemens in microbial cell and explain their composition, functions and importance, can explain the movement and proliferation strategies of microbial cells and understand how the environmental factors affect the cells. The students are able to connect the main microbial processes to the aspects of everyday life and cycles of nature. The students are experienced in finding suitable study materials (videos) for microbiology, are able to compose a short analysis and conduct primary evaluation on the suitability of the video in studies.", "et": "Kursuse läbimisel on õppijal teadmised sellest, mis on bakterid ja arhed, kuidas neid kirjeldatakse, kui suured nad on ja millised on nende põhirühmad. Õppijad oskavad nimetada mikrobioloogia suurkujusid ja nende olulisimaid avastusi. Õppijad oskavad nimetada prokarüootse raku koostise ja siseehituse elemente ning selgitada nende koostist, funktsioone ja olulisust, oskavad selgitada rakkude liikumisviide ja paljunemist ning mõistavad, kuidas keskkonnatingimused mõjutavad mikroobe. Üliõpilased suudavad seostada mikrobioloogia põhilisi nähtusi igapäevaeluga ja looduslike protsessidega. Õppijad suudavad leida sobivaid õppematerjale (õppevideosid), oskavad koostada kompaktset analüüsi ja hinnata õppevideo sobivust aine omandamisel."}], "notes": {"et": "Loengutes osalemine ei ole kohustuslik, aga väga soovituslik, sest need sisaldavad interaktiivset komponenti. Esmaspäevased ja teisipäevased loengud toimuvad auditoorselt. Neljapäevase loengu aeg on mõeldud iseseisva töö tegemiseks ja läbitud teemade kordamiseks Moodle testide ja kordamisküsimuste abil.  \nMuutustest õppetöö toimumise osas teavitab õppejõud vähemalt 24 h ette infokirja kaudu."}}, "grading": {"independent_work": {"et": "Detailne iseseisva töö juhend on leitav aine Moodle kursusel. Koduse ülesandena otsib iga üliõpilane (või väike grupp, kuni 3 inimest) internetist ühe mikrobioloogiateemalise lühivideo (pikkus soovitavalt 3-5 min; eelistatult eesti või inglise keeles või varustatud subtiitritega). Õppejõu väljapakutud teemade hulgast saab teha valiku Moodle kursuse lingil. Soovi korral võib üliõpilane (või grupp) video ka ise valmistada/koostada. Iseseisva töö teise osana valida teis(t)e üliõpilaste esitatud videote hulgast üks, millele koostada lühike analüüs (kuni 1 lk). Analüüsis on vajalik tuua välja sisulised ja vormilised aspektid, mis teevad antud video sobivaks õppematerjaliks mikrobioloogia omandamisel. Analüüsis on vajalik vastata järgmistele küsimustele: Kellele on video suunatud ja sobiva raskusastmega? Millisel tasemel peaks olema õppija, et videost aru saada? Kas teema on adekvaatselt lahti seletatud? Kas on tegu fakitäpse materjaliga? Kas visuaal ja tehniline pool aitab teemast head ülevaadet saada? Kas visuaalne/tehniline/vormiline külg toetab materjali edastamist? Videote lingid ja analüüsid esitatakse Moodle kursuse Iseseisva töö esitamise vahendi kaudu. Tähtajaks esitatud iseseisva töö eest (videolink + analüüs) saab üliõpilane 20% koondhinde punktidest.    \nSeminarides vaatame ja analüüsime valitud õppevideosid."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Iseseisva töö tähtaeg, milleks tuleb esitada valitud video (link videole) ning koostada kirjalik analüüs teise üliõpilase valitud video kohta. Kodutööks on leida õppeaines käsitletud teemades kohta informatiivne õppevideo ning esitada teise tudengi välja pakutud õppevideo kohta lühike analüüs, millised tunnused teevad (või ei tee) esitatud video heaks mikrobioloogia õppematerjaliks. Iseseisev töö esitatakse Moodles. Täpsem info iseseisva töö sisu ja esitamise kohta antakse õppeaine käigus. Viimaseks tähtajaks analüüsi esitamiseks on 3.10 kell 17.00. Tähtajaks esitatud iseseisva töö (video + analüüs) esitamise eest saab 20% punktidest. Kui iseseisev töö jääb tähtajaks mõjuva põhjuseta esitamata, siis õppija selle eest ette nähtud punkte ei saa. Vähemalt 10 parimat kodutööd saavad eksamile 5% boonuspunkte."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Esimene võimalus sooritada eksam, mis koosneb 20 küsimusest, mille hulgas on erineva formaadiga küsimusi (valikvastused, pildiküsimused, vastuse kirjutamine). Eksam on kirjalik ja auditoorne. Täpsem info eksami korralduse kohta antakse õppeaine käigus. Eksamil saadud punktid moodustavad 80% lõpphinde punktidest."}}], "grade_preconditions": {"et": "Eksamiks peavad olema üliõpilastel kõik kohustuslikud õppematerjalid läbi töötatud. Eksam on kirjalik ja toimub auditoorsena. \nLoengud ja seminarid on plaanitud aditoorsetena, hädavajadusel Moodle kursusel BigBluButtoni loenguruumis. \nVahehindamisi (st hinnatavaid kontrolltöid) ei toimu.\nEksami sooritamiseks on valikus kaks aega. Eksamile registreerumine toimub ÕIS-i kaudu."}, "grade_evaluation": {"et": "Hinne kujuneb kirjaliku eksamitöö sooritamisel saadud tulemusest (80% koondinde punktidest; maksimaalne punktisumma 40 p) ja esitatud kodutöö eest saadavatest punktidest (20% punktidest; 10 p). 10 parima iseseisva töö tegijat saab 5% ulatuses boonuspunkte. Hinded jagunevad järgmiselt: üle 91% - A (suurepärane); 90-81% - B (väga hea); 80-71% - C (hea); 70-61% - D (rahuldav); 60-51% - E (kasin); alla 51% - F (mitterahuldav)."}, "debt_elimination": {"et": "Eksamile mitteilmunud ja koondhindena alla 51% saanud üliõpilased saavad võimaluse uuesti eksamit sooritada. Vajalik registreeruda korduseksamile, mille aeg lepitakse kokku hiljem vastavalt vajadusele."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Loengute slaidikavad ja konspektid koos linkidega sobivatele õppevideotele on leitavad aine Moodle kursusel. Olulisemate mõistete ja teemade kordamiseks on loodud Moodle enesekontrolli testid, mis ei ole hinnatavad (8 testi). Lühiküsimusi ja -ülesanded kasutatakse loengutes ja need on olemas Moodles õppematerjalide hulgas. Kordamisküsimused ja olulisemad märksõnad (olemas aine Moodle kursusel)."}, "participants": {"lecturers": [{"person_uuid": "45c82747-9bf9-6c0f-6c3a-e03150928c2c", "person_name": "Triinu Visnapuu", "structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-8"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ülevaade ainekavast ja õppekorralduslikest aspektidest (detailne info olemas Moodles). Mikrobioloogia meie ümber. Prokarüoodid (bakterid ja arhed) eluslooduse süsteemis. Eluslooduse domeenid. Prokarüootide nimetamine ja suurus. Prokarüootide kirjeldamisel ja süstematiseerimisel kasutatavad olulisimad tunnused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mikrobioloogia kui teadusharu eellugu ja ajalugu. Mikrobioloogia teaduse ja põhimetoodikate ajalugu. Olulisimad mikrobioloogia suurkujud ja nende saavutused."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Kordamine (Moodle testid) ja iseseisev töö konspektide ja slaididega. Iseseisva töö juhendiga tutvumine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Eu- ja prokarüootsed rakud ja nende põhitunnused. Eukarüootse raku tekkehüpotees ja eukarüootsete organellide kujunemine. Arhede lühiiseloomustus. Kaasaegne prokarüootide süsteem."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mikroorganismide mitmekesisus. Mikroorganismide kujurühmad."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Kordamine (Moodle testid) ja iseseisev töö konspektide ja slaididega. Sobiva õppevideo lingi leidmine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Proakrüootsete rakkude membraan ja kest. Peptidoglükaan. Gramreaktiivsus. Rakukesta süntees. Kapsel, selle koostis, ülesanded ja süntees. Bakterite organellid. Nende ehitus ja funktsioonid. Bakterite sisaldised ja varuained, nende süntees ja funktsioonid.\nVideolingi esitamise TÄHTAEG: 23.09 kell 17:00 (esitada Moodles oleva lingi kaudu)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Endospoorid, sporogenees. Sporogeensed bakterid. Endospooride moodustumine ja idanemine. Patogeensed sporogeensed bakterid: botulismi, teetanuse ja siberi katku tekitajad. Koniidid, tsüstid, akineedid, heterotsüstid."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Kordamine (Moodle testid) ja iseseisev töö konspektide ja slaididega."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Bakteriviburid. Viburi ehitus ja tööpõhimõte. Liikumissuuna muutmine ja taksised. Bakterite liikumisviisid: piiltõmbumine, voogamine ja libisev liikumine. Bakterite kinnitumine pindadele. Biofilm."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Keskkond ja bakterid. Temperatuuri toime mikroorganismidele. pH toime mikroobidele. Hapniku toime mikroobidele. Rõhu ja kiirguse toime mikroobidele."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Iseseisev töö ja kordamine. \nAnalüüsi esitamise TÄHTAEG: 3.10 kell 17:00 (esitada Moodle vahendi kaudu)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mikroorganismide kasv ja paljunemine. Arengutsüklid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Desinfitseerimine ja steriilimine. Erinevad meetodid mikroobidest vabanemiseks. Vastupidavad mikroobid."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Iseseisev töö loengumaterjalidega, kordamine (Moodle testid)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kokkuvõtted ja tagasiside üliõpilaste õppevideode analüüside kohta. Rühmatöö. Kordamine õppevideode abil."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Valitud videote esitlused oluliste teemade kordamiseks. Rühmatöö."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Iseseisev töö loengumaterjalidega, kordamine (Moodle testid). Valmistumine eksamiks."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Eksami põhisisu ja korralduse tutvustamine. Võimalik küsida õppejõult Moodle BigBlueButtoni ruumis küsimusi ja täpsustusi."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Võimalik küsida õppejõult Moodle BigBlueButtoni ruumis küsimusi ja täpsustusi."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "c7122ad3-d170-9fa9-1c27-794e793ea6a1", "parent_code": "LOMR.03.016", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}