{"uuid": "0579fef4-8a52-d097-907a-5d92a14e2f10", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-13T11:55:39", "title": {"en": "Genetics II", "et": "Geneetika II"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR03", "structural_unit_name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 40, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "c7f23171-04c6-e35a-1f6a-316a721b24b7", "code": "LOMR.03.010", "title": {"en": "Genetics I", "et": "Geneetika I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "6ae1590d-4b94-7b6f-12b4-20dcdb85db28", "code": "BGMR.03.034", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Genetics I", "et": "Geneetika I"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "4371e582-c6a5-6bc7-55c9-d4f052566140", "code": "LOMR.03.025", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "General and Behavioural Genetics", "et": "Üld- ja käitumisgeneetika"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "More advanced topics in molecular genetics and genomics are covered including the genetics of bacteria and viruses, transposable genetic elements, cytoplasmatic inheritance, basic techniques of molecular genetics,  regulation of gene expression in prokaryotes and eukaryotes, and applications of molecular genetics. The course also introduces the genetic bases of development, immunity, behavioral traits and cancer. Finally, the concepts of population and evolutionary genetics are introduced.", "et": "Tegemist on geneetikakursuse järgmise astmega, mis hõlmab erinevate bioloogiliste süsteemide molekulaargeneetikat ja genoomiuuringuid. Käsitletakse bakterite ja viiruste geneetikat, transponeeruvaid geneetilisi elemente, mitokondrite ja kloroplastide geneetikat, põhilisi molekulaargeneetika meetodeid, geeniekspressiooni mehhanisme prokarüootides ja eukarüootides ning kaasaegseid molekulaargeneetika rakendusi. Antakse ülevaade organismi arengu, immuunsüsteemi kujunemise, vähitekke ning käitumise geneetilisest tagapõhjast. Tutvustatakse populatsiooni- ja evolutsioonigeneetika põhimehhanisme"}, "objectives": [{"en": "This is an advanced course in genetics which aims to give an overview of molecular genetics of special genetic systems, to introduce techniques of molecular genetics and to give an introduction to population and evolutionary genetics.", "et": "Geneetikakursuse järgmine aste, mille eesmärgiks on anda ülevaade spetsiifiliste geneetiliste süsteemide molekulaargeneetikast, tutvustada põhilisi molekulaargeneetika meetodeid ning käsitleda populatsioonigeneetika ja evolutsiooni põhiprintsiipe."}], "learning_outcomes": [{"en": "After the course, the students are expected:", "et": "Peale kursuse läbimist üliõpilane:"}, {"en": "To be able to understand mechanisms of gene regulation in prokaryotic and eukaryotic organisms. ", "et": "Omab ettekujutust geeniregulatsiooni mehhanismidest prokarüootsetes ja eukarüootsetes organismides."}, {"en": "To be able to use the acquired knowledge and skills in other disciplines in biology.", "et": "Oskab kasutada omandatut õppekava järgnevates bioloogiaalastes ainekursustes."}, {"en": "To be able to describe principles of main techniques of molecular genetics and their applications. ", "et": "Teab peamisi molekulaargeneetikas kasutatavaid meetodeid ja nende rakendusi."}, {"en": "To be able to explain genetic variation in natural populations and evolution of living organisms.", "et": "Oskab selgitada eluslooduse mitmekesisust ja evolutsiooni lähtudes geneetikaalastest teadmistest."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksam on kirjalik ning seal tuleb vastata neljale pikemale küsimusele (vt. kordamisküsimused; samad küsimused tulevad ka eksamil). Lisaks kirjalikule eksamile on võimalik eksamit sooritada ka suuliselt."}}], "grade_preconditions": {"et": "Ei ole eritingimusi"}, "grade_evaluation": {"et": "Kirjalik eksam."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "f080b639-88de-4e82-9b63-e0a40af9a961", "type": "MOODLE", "code": "LOMR.03.011", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "99f52df1-367e-baa7-3926-ea2559fc29fe", "person_name": "Maia Kivisaar", "structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-29"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1.\tViiruste geneetika. Viiruste avastamine. Viiruste tüübid. Viiruste ehitus ja genoom. Bakteriofaagi elutsükkel. Peremeesraku ja bakteriofaagi DNA kaitsmine nukleaaside eest. Bakteriofaagi genoomi kaardistamisel kasutatavad mutandid. Geneetiline rekombinatsioon faagidel, faagi geenide peenstruktuuri määramine. Miks on T4 geneetiline kaart esitatud rõngasmolekulina? Bakteriofaagi 174 genoom kui näide geenide kattuvusest. Faagide heterosügootsus DNA rekombinatsiooni käigus. Retroviirused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.\tBakterite geneetika. Bakteri genoomi erinevus eukarüoodi genoomist. Bakterite fenotüübi kirjeldamine. Geneetilise informatsiooni ülekandumise kolm viisi bakteritel ja nende ülekandeviiside testimine. Transformatsioon: transformatsiooni avastamine, kompetentsus, kunstlik transformatsioon, transformatsiooni kasutamine geenide kaardistamisel. Konjugatsioon: konjugatsiooni avastamine, DNA ülekanne plasmiidide abil, F plasmiid, kromosomaalse DNA ülekanne F plasmiidi abil (Hfr konjugatsioon), F' konjugatsioon e. seksduktsioon, konjugatsiooni kasutamine bakterikromosoomi geneetiliseks kaardistamiseks. Transduktsioon: transduktsiooni avastamine, üldine transduktsioon, abortiivne transduktsioon, spetsialiseeritud transduktsioon, transduktsiooni kasutamine bakteriaalsete geenide kaardistamisel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3.\tTransponeeruvad geneetilised elemendid. Transponeeruvad elemendid bakteritel: IS elemendid, transposoonid (komplekssed transposoonid ja Tn3 perekonna transposoonid), replikatiivne ning \"lõika ja kleebi\" transpositsioon, multiresistentsete bakteritüvede teke transposoonide abil. Transponeeruvad elemendid eukarüootides: maisi Ac ja Ds elemendid, äädikakärbse P elemendid, mariner elemendid, retroviiruse-laadsed elemendid, retroposoonid. Transponeeruvate elementide tähtsus genoomi evolutsioonis."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4.\tMitokondrite ja kloroplastide geneetika. Kloroplastide poolt kontrollitud lehtede mitmevärvilisus taimedel. Maisi tsütoplasmaatiline isasteriilsus. Chlamydomonas'e rakkude antibiootikumi resistentsuse määramine kloroplasti genoomi poolt. Mitokondri genoomi defektidest põhjustatud metaboolsed defektid pärmil. Mitokondrite molekulaargeneetika: mitokondrite genoomi ehitus erinevatel organismidel, mitokondriaalsete geenide regulatsioon. Mitokondriaalsed haigused. Kloroplastide molekulaargeneetika: kloroplastide genoom erinevatel organismidel, kloroplastide biogenees. Mitokondrite ja kloroplastide päritolu."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5.\tMolekulaargeneetika meetodid. Restriktaasid. Vektormolekulid. Geenide kloneerimine. Plasmiidsed vektorid: üldise funktsiooniga vektorid, geeni lacZ kasutamine insertsioonide testimiseks värvusreaktsiooni abil, ekspressioonivektorid, promootorite või transkriptsiooni terminaatorjärjestuste testimise vektorid. Kosmiidid. Fagemiidid. Vektorid bakteriofaagide DNA-st. Eukarüootsed kloneerimisvektorid. Kunstlikud kromosoomid (YAC-id ja BAC-id). Genoomse DNA raamatukogu konstrueerimine. cDNA raamatukogu konstrueerimine. Huvipakkuva geeni isoleerimine DNA raamatukogust (kolooniahübridisatsioon). DNA, RNA ja valkude molekulaarse analüüsi meetodid: DNA analüüs \"Southern blot\" meetodil, RNA analüüs \"Nothern blot\" meetodil, valkude analüüs \"Western blot\" meetodil."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6.\tGenoomi uuringud. DNA molekulide restriktsioonikaardi koostamine. DNA nukleotiidse järjestuse määramine. DNA amplifitseerimine PCR meetodil. Geenide positsiooniline kloneerimine. Kontiigid. Molekulaarsed markerid. RFLP analüüs. Genoomide sekveneerimine. Bakterite, arhede, pärmide genoomid. Inimese genoomi projekt. Eukarüootsete genoomide evolutsiooni uurimine kromosoomide värvimise abil. Globaalse transkriptsiooni uurimine, geenikiibid. Proteoomika."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7.\tMolekulaarne diagnostika. Transgeensed organismid ja geeniteraapia. Kloonimine. DNA fingerprint. Haiguste molekulaarne diagnostika. Transgeensed organismid. Eukarüootsete valkude tootmine bakterites. Transgeensed loomad. Transgeensed taimed. Antisens RNA-de kasutamine geenide ekspressiooni mahasurumiseks. Geeniteraapia. Kloonimine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8.\tProkarüootsete geenide regulatsioon. Geenide konstitutiivne avaldumine, indutseeritavus ja repressioon. Operonid. Laktoosi operoni regulatsioon E. coli rakkudes: negatiivne ja positiivne regulatsioon. Kataboliitne repressioon. Trüptofaani operoni regulatsioon E. coli rakkudes: repressiooon ja attenuatsioon. Arabinoosi operoni positiivne ja negatiivne kontroll. Bakteriofaag lambda lüsogeense ja lüütilise tsükli regulatsioon. Geenide avaldumise ajaline lahutatus faagi infektsiooni korral (geenide kaskaadne regulatsioon). Geenide ekspressiooni kontroll translatsiooni tasemel. Geenide globaalne regulatsioon bakteris."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9.\tEukarüootsete geenide regulatsioon. Vähitekke geneetilised alused. Eukarüootsete geenide ruumiline ja ajaline regulatsioon. Transkriptsiooni regulatsioon. RNA alternatiivne splaissing. mRNA stabiilsuse kontroll. Transkriptsiooni aktivatsiooni indutseerimine keskkonna ja bioloogiliste faktorite poolt: valgus, temperatuur, signaalmolekulid. Eukarüootsete geenide transkriptsiooni molekulaarne kontroll: DNA järjestused, mis osalevad transkriptsiooni kontrollis; transkriptsioonifaktorid. Geenide avaldumine kajastub kromosoomide ehituses: transkriptsioon \"lambihari\" kromosoomidelt ja polüteenkromosoomidelt Transkriptsiooniliselt aktiivse DNA molekulaarne organisatsioon; eukromatiin ja heterokromatiin. Geenide vaigistamine. Geenide amplifikatsioon. Kromosoomide aktivatsioon ja inaktivatsioon (X kromosoomi inaktivatsioon imetajatel, X kromosoomi hüperaktivatsioon äädikakärbsel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10.\tVähi geneetilised alused. Rakutsükli regulatsioon. Onkogeenid: tuumorit indutseerivad retroviirused ja viiruslikud onkogeenid; rakulised homoloogid viiruslikele onkogeenidele; mutantsed rakulised onkogeenid. Tuumori supressorgeenid. Vähi päritavus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "11.\t Loomade arengu geneetiline kontroll. Arenguprotsess loomadel. Mudelorganismide arengu geneetiline analüüs: mudelorganism äädikakärbes; mudelorganism Caenorhabditis elegans. Arenguteede geneetiline analüüs. Soo määramine äädikakärbsel ja C. elegans'il. Geneetiliste mosaiikide kasutamine arenguprotsesside uurimiseks. Organismide arengus osalevate geenide molekulaarne analüüs. Positsiooniline informatsioon. Organismi arengut mõjutavad emapoolsed geenid. Geenide aktivatsioon sügoodis. Keha segmentatsioon. Homeootilised geenid. Rakutüüpide spetsialiseerumine. Organite moodustumine. Selgroogsete arengu geneetiline analüüs: selgrootute geenide homoloogid selgroogsetel; hiirte kasutamine mudelorganismina."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "12.\tSelgroogsete immuunsüsteemi geneetiline kontroll. Imetajate immuunsüsteemi komponendid. Rakud, mis osalevad immuunvastuses. Valgud, mis tagavad immunoloogilise äratundmise. Koesobivusantigeenid. Immuunvastus: antikehade poolt vahendatud immuunvastus; T rakkude poolt vahendatud immuunvastus; immunoloogiline mälu. Antikehade mitmekesisuse geneetiline kontrolli hüpoteesid. Genoomi ümberkorraldused lümfotsüütide diferentseerumisel: kergete ahelate geenide assambleerumine; raskete ahelate geenide assambleerumine; signaaljärjestused, mis kontrollivad rekombinatsiooni; varieeruvus liitumiskohtades ning somaatilised hüpermutatsioonid. Rakkude ümberlülitumine ühte klassi kuuluvate antikehade tootmiselt teistele. T rakkude retseptorite geenide assambleerumine somaatilisel rekombinatsioonil. Immunoglobuliine kodeerivate geenide regulatsioon: alleelne välistamine; rasket ahelat kodeerivate geenide transkriptsioon. Immuunsüsteemi haigused: päritavad immuunsüsteemi haigused; omandatud immunodefektsus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "13.\tKäitumise geneetiline kontroll. Selgrootute käitumise geneetiline analüüs: mesilaste kodukorrashoid; rütmiline käitumine; Drosophila geen per. Käitumise geneetiline analüüs koertel ja hiirtel. Inimese käitumist mõjutav aneuploidsus. Ühe geeni defektid, mis mõjutavad inimese käitumist: fenüülketonuuria; Lesh-Nyhan'i sündroom; Huntingtoni tõbi. Isiksuse analüüs. Alkoholismi geneetilised alused. Alzheimeri tõbi. Intelligentsus kui multifaktoriaalne tunnus. Soolise orientatsiooni geneetiline determineeritus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.\tPopulatsioonigeneetika ja evolutsioon. Evolutsiooniteooria kujunemine: varajased evolutsiooniteooriad; Darwini evolutsiooniteooria. Populatsioonigeneetika: Hardy-Weinbergi populatsiooni geneetilise tasakaalu seadus. Loodusliku valiku teooria: kohasus (fitness); selektiivne surve; loodusliku valiku vormid (sagedusest sõltumatu ja sagedusest sõltuv valik); loodusliku valiku viisid (stabiliseeriv, suunav ja lõhestav valik). Muutused populatsiooni geneetilises struktuuris: kõrvalekalded vabast ristumisest; geenitriiv; migratsioon; mutatsioonid kui geneetilise muutlikkuse allikas. Tasakaal valiku ja mutatsioonide tekke vahel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "15.\tGeneetika ja liikide tekkimine. Geneetiline muutlikkus looduslikes populatsioonides: fenotüübiline muutlikkus; kromosoomide struktuuri polümorfism; muutlikkuse klassikaline ja tasakaalustatud mudel; geneetiline muutlikkus molekulaarsel tasemel. Liigi kontseptsioon. Liikidevaheline ristumisbarjäär. Liikide tekkimise erinevad viisid: allopatriline liigiteke; sümpatriline liigiteke; parapatriline liigiteke; populatsiooni väikeste alaosade eraldumine. Evolutsiooniliste muutuste toimumise kiirus. Primaatide evolutsioon rekonstrueerituna kromosoomide analüüsi tulemustest. Evolutsioon molekulaarsel tasemel. Inimese ja shimpansi vaheliste erinevuste analüüs. Inimese evolutsiooniline ajalugu."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "77c43156-c9f1-d474-f770-aa6c9756d437", "parent_code": "LOMR.03.011", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}