{"uuid": "b28477d6-77ee-20e1-1a79-8c7dcc3ff5e3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-11T13:53:11", "title": {"en": "Microbial Physiology", "et": "Mikroobifüsioloogia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR03", "structural_unit_name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 36, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "c7f23171-04c6-e35a-1f6a-316a721b24b7", "code": "LOMR.03.010", "title": {"en": "Genetics I", "et": "Geneetika I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "0322f1d3-c214-5d83-dc88-7db7627206c2", "code": "LOMR.03.020", "title": {"en": "Microbiology II", "et": "Mikrobioloogia II"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course will provide an understanding of the fundamentals and basic principles of the structure function, energy metabolism, growth, and regulatory mechanisms of bacteria. It will provide an insight on the basic mechanisms involved in: determining microbial cell shape, cell division, regulation of the synthesis of gene products, sensing and responding to environmental signals. Different secretion mechanisms found in bacteria are also described. The lecture series also contain a module outlining the strategies for survival in extreme and stressful environments, quorum sensing, microbial cell growth and cellular responses to environmental changes and expression of specific gene systems in a population dependent manner. The regulation of physiological processes through control of gene expression and enzyme activity is also covered, as well as the survival mechanisms used under different growth (incl. stravation) conditions.", "et": "Kursus annab ülevaate bakterite talitluse üldistest seaduspärasustest ja põhimõistetest. Käsitletakse bakterite ainevahetust, kasvu- ja arengufüsioloogiat, keskkonna muutuste toimet organismi kui terviku funktsioonile, stressifüsioloogiat. kirjeldatakse protsesse, mis toimuvad rakkude jagunemisel. Rõhku on pandud geenide ekspressioonile ning ekspressiooni regulatsioonile lähtuvalt bakteri füsioloogiast. Andakse ülevaade raku membraanide ehitusest ja funktsioonidest. Käsitletakse ainete transporti ja kirjeldatakse erinevaid sekretsioonisüsteeme. Käsitletakse kvoorumi tunnetamisega seotud füsioloogilisi muutusi bakterirakus. Selgitatkse, millised muutused toimuvad stressi tingimustes kasvavates bakterites. Iseloomutatakse füsioloogiliste protsesside geneetilistregulatsiooni erinevates kasvutingimustes."}, "objectives": [{"en": "The main goal of the course is to give an overview of the physiological processes that take place in a bacterial cell and ensure its normal life and division. To encourage students to think independently and to contribute to a broad understanding of microbial function.", "et": "Kursuse põhieesmärk on anda ülevaade füsioloogilistest protsessidest, mis toimuvad bakterirakus ja tagavad tema normaalse elutegevuse ja jagunemise. Soodustada tudengite iseseisvat mõtlemist ning kaasa aidata laiapõhjalisele arusaamisele mikroobide talitlusest."}, {"en": "It is an interdisciplinary subject that combines microbiology, genetics and biochemistry.", "et": "Tegemist on interdistsiplinaarse ainega, mis seob mikrobioloogiat, geneetikat ning biokeemiat."}], "learning_outcomes": [{"en": "After completing the course, the student acquires an understanding of the physiological processes in bacteria and the mechanisms of regulation that control these processes in different growth environments and conditions.", "et": "Kursuse läbimise järel on tudengil ettekujutus bakterites toimuvatest füsioloogilistest protsessidest ja regulatsioonimehhanismidest, mis kontrollivad nende protsesside toimumist erinevates kasvukeskkondades ja tingimustes."}, {"en": "Understand in-depth the processes in the bacteria during the different growth phases, the production of energy and its consumption. In addition, the function of bacteria in the population and the collective behaviour of planktonic and sessile cells are understood.", "et": "Tudeng saab aru protsessidest, mis toimuvad bakterites erinevate kasvufaaside ajal, energia tootmisest ning selle kulutamisest. Lisaks saab aru bakterite toimimisest populatsioonis, planktiliste ja sessiilsete rakkude kollektiivsest käitumisest. Kursus annab baasteadmised bakterite kasutamiseks mitesugustel rakendusaladel (nt rakuvabrikud)."}], "notes": {"et": "E-kirjadele vastatakse tööpäevadel ja tööajal."}}, "grading": {"independent_work": {"et": "Õpijuhis:\n1) Osale igas loengus. \n2) Valmistu igaks loenguks ette, selleks õpi eelmise loengu olulisimad terminid. \n3) Osale seminarides. Seminarides esitatakse probleemküsimusi.\n4) Alusta eksamiks õppimist varakult!"}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Hinne \"A\" 91-100% maksimumist\n\"B\" 81-90%\n\"C\" 71-80%\n\"D\" 61-70%\n\"E\" 51-60%\n\"F\" 0-50%"}}], "grade_preconditions": {}, "grade_evaluation": {"et": "Hindamine on kirjalik, eesti keeles. \nEksamil tuleb vastata umbes 5 erineva mahuga  küsimusele. Eksamil on nii üldisi kui kitsaid, detailseid vastuseid nõudvaid, küsimusi. Hinnatakse tudengi üldistamisoksust ning seoste leidmise võimet aine erinevate teemade vahel. Peale üldistamisoskuse hinnatakse veel täpseid teadmisi protsesside toimumisest.\n\nHinne \"A\" 91-100% maksimumist\n\"B\" 81-90%\n\"C\" 71-80%\n\"D\" 61-70%\n\"E\" 51-60%\n\"F\" 0-50%"}, "debt_elimination": {"et": "Vastavalt korrale järeleksam."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "15afc73b-3018-423e-8cdb-f1bf5486b7d8", "type": "MOODLE", "code": "LOMR.03.022", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "recommended_materials": "Moodlis olev lühikonspekt ja loenguslaidid.\nNB! Lühikonspekt ja loenguslaidid on abivahendid loengus käsitletud materjalile. Seetõttu, ainest aru saamiseks on tungivalt soovitatav käia loengutes, sest kõik materjal pole konspektis ega slaididel."}, "participants": {"lecturers": [{"person_uuid": "a2326732-0876-a667-fd89-19cd542f634e", "person_name": "Riho Teras", "structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-31"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. Sissejuhatus, aine korraldatuse tutvustamine"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "2. Bakterite kasv ja toitumine. Bakterite kasvatamine laboritingimustes. Bakteripopulatsiooni kasvukõver. Elutegevuseks vajalikud elemendid. Söötmed bakterite kasvatamiseks laboris. Füüsikalis-keemilised tegurid, mis mõjutavad bakterite kasvu."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "3. Bakterite ehitus ja rakustsuktuuride funktsioonid. Tsütoplasma komponendid: nukeloid, tsütoplasma inklusioonkehad. Nukleoidi moodustumine. Histoonilaadsed valgud (nukleoidi moodustavad valgud). Rakuümbrise komponendid; periplasma, peptidoglükaan, S-kiht, kapsel, välismembraani vesiikulid. Vesiikulite tähtsus antibiootikumiresistentsuse tekkimisel, naaberbakteri abistamisel, tapmisel."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "4. Bakterite membraanid. Tsütoplasmamembraan, funktsioonid. Ainete transport, soodustatud difusioon, ABC-tüüpi transporterid, modifitseerivad transporterid. Gram-negatiivsete bakterite välismembraan. Lipopolüsahhariidide kiht, tähtsus, biosüntees. Välismembraani valgud, poriinid. Välismembraani läbilaskvus ja antibiootikumiresistentsus. Resistentsuse tekkimine."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "5. Bakterite vesikulatsioon"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "6.  pH homoöstaas. Mehhanismid, mille abil bakter hoiab tsütoplasma pH-d stabiilsena. Prootonite liikumapanev jõud. Kemiosmoos. Tsütoplasma pH reguleerimine prootonite transportimise abil. Prootonite tarvitamine või genereerimine metaboolsete ensüümide abil. Passiivsed mehhanismid, mis toetavad pH homöostaasi. Raku pinna laeng. Ekstremofiilide kohanemine pH-ga. Neutrofiilide kohanemine pH-ga."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "7. Bakterite koordineeritud metabolism. Metabolismi regulatsioonietapid: substraadi kättesaadavus, ensüümide allosteeriline regulatsioon, valkude ekspressioon. Tagasisidestusregulatsioon. Süsiniku transpordi ja katabolismi regulatsioon. Negatiivne tagasisidestus, positiivne tagasisidestus, kataboliitne repressioon. Induktori välistamissüsteem. Transkriptsiooni kaudu reguleerimine. C-allika metabolismi reguleerimine Crp--ga, allosteeriliselt. Energia metabolism. ATP keskne roll, tsitraaditsükli geenide transkriptsiooni kontroll. Lämmastiku transport ja metabolism. Aminohapete transport ja metabolism. Valkude süntees ja kasv."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "8. Energia tootmine. Entroopia. Substraatne fosforüülimine. Oksüdatiivne fosforüülimine. E. coli hingamisaehl kui mudel. Hingamisahela komponendid: dehüdrogenaas, kinoonid, terminaalne oksüdaar. Hingamisahela alternatiivsed komponendid: dehüdrogenaasid, terminaalsed elektronide lõpp-akseptori redutseerijad, lõpp-aktseporid. Nitraatne ja fumaraatne hingamine. Metallihingamine"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "9. Rakkude energia hulk ja energia hulga muutus. AEC, kataboolne ja anaboone redutseeriv jõud. Metabolismi ja AEC muutused järsule toitaineküllusele ja -vaegusele E. coli näitel. Persistorid, nende teke ning tüübid"}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "10.Seminar. Kordamine. Probleemülesanded, arutelu."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "11. Transkriptsiooni reguleerimine. RNA-polümeraasi ehitus. Sigma-faktorid ja DNA konsensused. Transkriptsiooni reguleerimine: positiivne, negatiivne kontroll. Transkriptsiooni initsiatsiooni etapid: RNAP seondumine, avatud kompleksi moodustumine, promootori vabastamine. Regulatsioon. Geenide organiseeritus."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "12. Globaalne transkriptsiooni regulatsioon. Geenide asukohaga kromosoomis. Kromosoomi tertsiaarstruktuuri, selle tähtsus geeni ekrpressiooni regulatsioonis. Makrodomeen. mRNA difundeerumine rakus. DNA superspiralisatsioon. Topoisomeraasid. Globaalne ja lokaalne superspiralisatsioon, mõju promootorite topoloogiale ja avatud kompleksi moodustumisele. Histoonilaadsed valgud. Alarmoonid. Diskriminaatorjärjestus, ppGpp."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "13.  Bakterite programmeeritud surm. Toksiin-antitoksiin süsteemid, rakueksta lagundamisega seotud lüüs, hingamisahela blokeerimine. Toksiin-antitoksiin süsteemide tüübid, MazEF-süsteem. Faagide pühjustatud lüüs. Holiin ja antiholiin. Bakterite suitsiid kesta lüüsiga ja hingamisahela blokeerimisega.  Suitsiidi tähtsus liigi säilimiseks."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "14. Konjugatsioon. Konjugatsiooni etapid. F-plasmiid, merodipoloidsus, konduktsioon. Plasmiidide klassifitseerimine. Transportsüsteem Vir-kompleksi näitel. Relaksaas. Relaksosoomi moodustumine. Abivalgud."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "15. Bakterite transformatsioon. Natiivne ehk looduslik ja kunstlik transformatsioon. Loodusliku transformatsiooni etapid: DNA kinnitumine, fragmenteerimine, sisenemine rakku. Transformosoom. Tähtsus bakteritele. Kunstliku transformatsiooni metoodikat. Keemiline transformatsioon. Elektroporatsioon."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "16. Mikroorganismide kinnitumine pindadele."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "17. Bakterite pinna hüdrofoobsus ning selle tähtsus agregatsioonil ning biofilmi moodustumiseks."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "18.-19. Bakterite biofilm. Biofilmi uurimise metoodikad ja ajalugu. Biofilmi tähtsus bakterile. Biofilmi struktuur ja moodustumine. Biofilmi moodustumiseks vajalikud polümeerid. Pls ja Pel eksopolüsahhariidid nend ekspressiooni reguleerimine. CU-piilid. Amüloidpiilid. Tüüp IV piilid. Biofilmi kesksed signaalirajad. GacS/GacA signaalirada. C-di-GMP. Biofilmi maatriks. Biofilmi resistentsus. Biofilmi tähtsus inimesele"}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "20. Seminar. Kordamine. Probleemülesanded, arutelu."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "21.  Bakterite hulgatunnetus ja GacS/A signaalirada. Signaalmolekulid ja sensorsüsteemid. AI-1, AI-2, AI-3 ja Ai-4 süsteemid. AHL ja AI-2 biosüntees.  Hulgatunnetus ja bakterite biofilm. Hulgatunnetuse tähtsus bakterite patogeneesis. Liikide ja domeenidevaheline hulgatunnetus. GaCS/A signaalirada, selle komponendid ning seotud hulgatunnetusega."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "22. Soolepatogeenide virulentsusmehhanismid."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "23. Taim-bakter interaktsioon.  Endofüüt. Endosfääri koloniseerimine. Endofüütide toime taimele. Raua omastamine, abiootiline stress. Endofüütide genoom võrreldes teiste bakteritega. Inimese patogeenid ja kommensandid endofüütidena."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "2af6d5bd-a2c8-53be-b26f-fffc2c0f947a", "parent_code": "LOMR.03.022", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}