{"uuid": "08f44f32-565c-95e2-38fe-abf8bb5d94d9", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-14T09:23:44", "title": {"en": "Exercises in Genetics", "et": "Geneetika harjutused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR03", "structural_unit_name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 36, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "c7f23171-04c6-e35a-1f6a-316a721b24b7", "code": "LOMR.03.010", "title": {"en": "Genetics I", "et": "Geneetika I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "6ae1590d-4b94-7b6f-12b4-20dcdb85db28", "code": "BGMR.03.034", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Genetics I", "et": "Geneetika I"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "517c5e29-9dcb-79c4-cd42-893b1e39e6e6", "code": "BGMR.03.001", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Genetics", "et": "Geneetika"}, "credits": 5, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": true, "uuid": "c23543a7-4d2e-fe69-c98d-c62f8e3e89f4", "code": "MTMM.00.340", "title": {"en": "Calculus I", "et": "Kõrgem matemaatika I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "883fe7b3-27d8-981b-057d-849782799ad5", "code": "LTMS.00.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Calculus I", "et": "Kõrgem matemaatika"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "96a37b0a-043f-14cc-d328-c236f13e7ac3", "code": "MTMM.00.145", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Higher Mathematics", "et": "Kõrgem matemaatika"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The class practices solving problem tasks, finding data in the text, and compiling formulas based on the text. The creation of definitions based on the concepts of classical genetics as well as randomly selected objects, phenomena and connections is practised.\n\nText assignments are based on classical genetics on the following topics: mono- and dihybrid crossing; genes interaction; X-chromosome linked characteristics; linked genes; varied tasks, and genetic determination of cat hair colour.\n\nIt is necessary to assess the genes of colour and pattern of the cat's coat for ten cats. This task is used to study gene interactions and to learn exclusion techniques. \n\nIn the class, sample tasks are solved. Basic learning takes place independently at home, solving tasks from the collection of \"Geneetika ülesanded\" and e-tests. An e-test has been compiled for each topic in Moodle. The results of each e-test must be 100 % correct. The test can be performed as many times and for as long as is necessary to reach 100% before the deadline. E-tests are for studying and recording what has had heard in class.\n\nTo pass the exam, it is necessary to perform all e-tests and determine the genotype of 10 cats independently. The final grade is the grade of the exam.", "et": "Praktikumis harjutatakse tekstülesannete lahendamist, andmete leidmist tekstist ning valemite koostamist teksti põhjal. Harjutatakse definitsioonide loomist nii klassikalise geneetika mõistete järgi, kui ka juhuslikult valitud objektidele, nähtustele ja seostele. \nTekstülesanded on koostatud klassikalise geneetika põhjal järgnevatel teemadel: mono- ja dihübriidne ristamine; geenide koostoime tunnuse määramisel; suguliitelised tunnused; aheldunud geenid; segatüüpi ülesanded. Kasside karva värvuse geneetiline määratus.\n\nKoduse tööna on vaja määrata kassi karvastiku värvuse ja mustri geneetiline määratus kümnel kassil. Selle abil õpitakse geenide koostoimet ning õpitakse välistamise tehnikat.\n\nPraktikumis lahendatakse näidisüledandeid. Põhiline õppimine toimub iseseisvalt kodus, lahendades selleks ülesandeid \"Geneetika ülesannete\" kogumikust ja e-testidest. Iga teema kohta on Moodle's koostatud e-test, mis peab olema sooritatud järgmiseks praktikumiks100 protsendile. Testi saab teha enne tähtaega nii palju kordi ja nii kaua, kui on 100 % saavutamiseks vajalik. E-testide abil toimub praktikumis kuuldu kinnistamine ning õppimine. \n\nEksamile pääsemiseks on vajalik sooritada kõik e-testid ja määrata iseseisvalt 10 kassi genotüüp. Lõplik hinne kujuneb eksami hindest."}, "objectives": [{"en": "To develop problem tasks based on classical genetics. To develop functional reading and apply mathematics to solve problem tasks.", "et": "Arendada klassikalise geneetika baasil koostatud probleemülesannete lahendamist, teksti funktsionaalset lugemist ning matemaatika rakendamist probleemülesannete lahendamiseks."}], "learning_outcomes": [{"en": "The ability to solve problem tasks increases, the use of mathematics in solving problem tasks increases, and the understanding of the concepts of classical genetics become more established. The ability to define phenomena and their connections is improved.", "et": "Suureneb tekstülesannete lahendamise oskus, matemaatika kasutamine probleemülesannete lahendamisel ning kinnistub arusaam klassikalise geneetika mõistetest. Paraneb nähtuste ja nendevaheliste seoste defineerimisoskus."}], "notes": {"et": "Praktikumis lahendatakse ülesandeid paberil kirjutusvahendiga. Vajalik on taskuarvuti. Arvutite ja muude nutisedmete kasutamine pole lubatud. \n\nAbimaterjalide kasutamine eksamil pole lubatud."}}, "grading": {"independent_work": {"et": "Tegemist on osaliselt auditoorse, osaliselt e-õppega. Auditooriumis toimub uue teema tutvustamine, e-teste tehakse iseseisvalt arvutis (nutiseadmetes võib esineda tõrkeid). Iga teema kohta on Moodle's e-test, mida on vaja teha auditoorse tunni järel. Sellisel moel korratakse ja kinnistatakse õpitut: 1) tutvustamine auditooriumis, 2) iseseisva tööga kordamine ning 3) eksamiks valmistumisel veelkordne kordamine.\n\nÕpijuhis:\n1) Osale igas praktikumis\n2) Alusta e-testidega kohe praktikumi järel. Siis on näidisülesanded värskelt meeles ning lihtsam sooritada e-teste.\n3) Tee e-teste iseseisvalt. E-testid on õppimiseks ning materjali kinnistamiseks. Selleks vaata üle praktikumis õpitu ning slaidid. Kõik e-testid on koostatud praktikumi näidisülesannete põhjal. Iseseisev e-testidega õppimise tulemusel jaotab õppimisele kulutatud aeg kursuse peale laiali ning enne eksamit on vaja ainult korrata.Õppimine ei kuhju eksamiks.\n4) Valmistu igaks praktikumiks ette. Selleks õpi eelmises praktikumis kasutatud näisidülesanded ning õpi ära terminid. \n5) Mõisteid, seadusi ja olulisemaid seoseid küsitakse igas praktikumis, sellisel moel kinnistub olulisim.\n6) Harjuta kodus mõistete ja nähtuste defineerimist. \n\n\nIseseisvate tööde loetelu ja juhised:\n1) Praktikumis õpitu kinnistamiseks, tuleb iga praktikumi järel sooritada test(id) etteantud tähtajaks. Teste võib sooritada nii palju kordi, kui vaja, kuid enne tähtaega. Testi lahendamiseks pole ajapiirangut. Sooritatuks loetakse test, mis on vastatud 100 protsendile. Nädala esimese praktikumi test tuleb sooritada järgmiseks praktikumi eelõhtuks, nädala teise praktikumi test pühapäeva õhtuks. Tähtajad on antud iga e-testi juures.\n2) Lisaks on tungivalt soovitatav lahendada \"Geneetika ülesannete\" kogust harjutusi.\n3) Iseseisvalt tuleb määrata 10 kassi genotüüp ning esitada see 7. praktikumiks. Selleks tuleb täita vastav tabel Moodle's."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksamil antakse 5-7 erineva raskusastmega tekstülesannet, mis tuleb lahendada bioloogiliselt ja matemaatiliselt korrektselt. Vajalik on välja kirjutada lahenduskäik ning formuleerida vastus. Vastuse puudumine vähendab punktisummat. Iga lahenduskäik vaadatakse üle individuaalselt ning hinnatakse selle õigsust. Sellest johtuvalt võib ka arvuliselt vale vastuse korral saada osapunkte. Täispunktide saamise jaoks on vajalik õige lahenduskäik, korrektne arvutus ning vormistus.\nTuleb defineerida kolm klassikalise geneetika mõistet, seadust vms.\n\n\nHinne \"A\" 91-100% võimalikust\n\"B\" 81-90%\n\"C\" 71-80%\n\"D\" 61-70%\n\"E\" 51-60%\n\"F\" 0-50%"}}], "grade_preconditions": {"et": "Eksamile pääsemise tingimuseks on kõikide testide õigeaegne sooritamine ning koduse töö õigeaegne esitamine.Testi(de) õigeagselt sooritamata jätmise ja/või koduse töö õigeaegselt esitamata jätmise korral tudeng ei pääse eksamile ning saab hindeks \"F\"."}, "grade_evaluation": {"et": "Eksamile pääsemiseks tuleb sooritada e-testid (Moodle's) õigeaegselt ning 100-protsendiliselt. E-testid ei anna eksamile punkte kaasa. Testi(de) õigeagselt sooritamata jätmise ja/või koduse töö õigeaegselt esitamata jätmise korral tudeng ei pääse eksamile ning saab hindeks \"F\".\n\nEksam koosneb 5-7 erineva raskusastmega ülesandest, mis annavad erineval hulgal punkte. Ülesande eest saab maksimumpunktid, kui tulemus on õige, välja on kirjutatud lahenduskäik ning vastus! Ülesande vastus peab olema õige nii bioloogiliselt kui ka matemaatiliselt. Eksamil olevad teemad: geenide koostoime, aheldatus, suguliitelised geenid, populatsioonigeneetika, segatüüpi ülesanded ja kasside genotüüpide määramine pildi järgi.\n\nHinne \"A\" 91-100% võimalikust\n\"B\" 81-90%\n\"C\" 71-80%\n\"D\" 61-70%\n\"E\" 51-60%\n\"F\" 0-50%"}, "debt_elimination": {"et": "Järeleksale pääsemiseks peavad olema sooritatud kõik e-testid 100 protsendile ja kodune ülesanne esitatud enne järeleksamit."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "recommended_materials": "Heinaru, A. ja Viikmaa, M. (1992). Geneetika ülesanded. Tartu: Tartu Ülikool."}, "participants": {"lecturers": [{"person_uuid": "a2326732-0876-a667-fd89-19cd542f634e", "person_name": "Riho Teras", "structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"bioloogide rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "geenitehnoloogide rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}], "study_groups": [{"uuid": "7ed4af7d-f7c1-321b-f401-849cfe4df6a8", "code": "bioloogide rühm", "max_size": 40}, {"uuid": "68f40cf1-cc58-4b60-999e-66bd97d46a69", "code": "geenitehnoloogide rühm", "max_size": 60}]}, "schedule": {"weeks": {"et": "2-7"}, "entries": [{"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Klassikalise geneetika mõisted, mis on vajalikud ülesannete lahendamiseks. Mendeli I ja II seadus. Domineerimine, semidomineerimine ja kodomineerimine. Alleelide tähistamine. Monohübriidse ristamise ülesanded.\nMoodle'is vaja lahendada 1. praktikumi test (2. praktikumi eelõhtuks) ja protsentülesannete test (pühapäeva õhtuks)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Sõltumatud sündmused, välistavad sündmused, täielikult mittevälistavad sündmused. Hii-ruudu kasutamine ülesannete lahendamisel. Liitmis- ja korrutamisreegel. Heterosügootsuse tõenäosuse arvutamine\nMoodle'is vaja lahendada 2. praktikumi test (pühapäeva õhtuks)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "AB0-vererühmad. Bombay vererühm. Rh-vererühmad. Alleelide lahknemine ja genotüüpide teke, tõenäosuste arvutamine, kui tunnus on määratud ühe polüalleelse lookusega. AB0-vererühmade puhul tuuakse praktikumis välja vähelevinud alleelid.\nMoodle'is vaja lahendada 3. praktikumi test (4. praktikumi eelõhtuks)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Komplementaarsus, epistaas, duplikaatsus, polümeersus. Olukord, mil kaks (mitu) geeni määrab ühte tunnust, geenide koostoime äratundmine. Praktimis käsitletakse ainult kahe geeni koostoimet. Komplementaaruse eristamine epistaasist, mille järgi seda ära tunda. Polümeersuse äratundmine ning tõenäosuste arvutamine inimese silmavärvuse näitel.\nMoodle'is vaja lahendada 4. praktikumi test (pühapäeva õhtuks)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": " A-, B-, C-, D-, L-, O-, S-, T- ja W-lookus. Geenide koostoime harjutamine. Komplementaarsus ja epistaas kasside karvamustri ja -värvuse geneetikas. Kasside karvastiku järgi genotüübi määramine ning genotüübi järgi kassi karavastiku mustri ja värvuse määramine.\nMoodle'is vaja lahendada 5. praktikumi test (6. praktikumi eelõhtuks).\n\nKodune ülesanne. Tudengid saavad kasside karvavärvust ja -mustrit määravate lookuste kohta materjalid ning peavad 6. praktikumiks esitama Moodle'is vähemalt 10 kassi genotüübid (vt juhist Moodle'st)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Morgani seadus. Rekombinatsioonisagedus.Gameetide tekketõenäosus aheldatuse korral. Aheldatuse äratundmine. Dominantsete alleelide tõuke- ja tõmbefaas, sellest sõltuv järglaste lahknemissuhe.\nMoodle'is vaja lahendada 6. praktikumi test (7. praktikumi eelõhtuks). "}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Soo määramise süsteemid loomadel. Tunnuse suguliitelisuse äratundmine, ülesannete lahendamine, kui lookus on sugukromosoomis. Daltonism, hemofiilia.\nMoodle'is vaja lahendada 7. praktikumi test (pühapäeva õhtuks)."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Hardy-Weinbergy võrrand. Geneetiline tasakaaluseisund. Alleelisageduste arvutamine. Genotüübisageduste arvutamine. Kolme peamise tüüpülesande tutvustamine.\nMoodle'is vaja lahendada 8. praktikumi test (pühapäeva õhtuks).\n"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Tudengite kogutud andmete põhjal moodustunud virtuaalsest kassipopulatsioonist alleelisageduste arvutamine. Tudengid lahendavad ülesandeid tahvlil.\n\n"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Geenide koostoime, aheldunud geenid, populatsioonigeneetika. Sugupuude tingmärgid, retsessiivsete, dominantsete, suguliiteliste ja autosoomste haiguste äratundmine suguvõsas ning haige lapse sünnitõenäosuse arvutamine.\nMoodle'is vaja lahendada 10. praktikumi test (2. kordamise eelõhtuks)."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Teoreetiline kordamine. Kuidas ära tunda geenide koostoimet, suguliitelisust aheldatust, arvutada alleeli- ja genotüübisagedust. Hinnata geneetilist tasakaaluseisundit. Eristada komplementaarsust epistaasist. Tunda sugupuust ära retsessiivseid/dominantsed ja suguliitelisi/autosoomseid haigusi. Arvutada genotüübi tõenäosust."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {"et": "Kursusele pääsemiseks on vajalik eeldusainete läbimine (vt aine üldandmete juurest)"}, "min_students": 5, "max_students": 100}, "parent_uuid": "bb9c5126-2a28-e997-a4fc-f0998645ba54", "parent_code": "LOMR.03.009", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}