{"uuid": "147d6c0c-9439-1d70-19f9-9b2b1843ae98", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-13T11:53:59", "title": {"en": "Genetics I", "et": "Geneetika I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR03", "structural_unit_name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 39, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 39, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The subject gives basic knowledge in classical genetics and core concepts of  molecular genetics. At the beginning of the course the science of genetics and its applications and basic features of cellular reproduction are introduced. The next part of the course deals with concepts of classical genetics such as the basic principles of inheritance (Mendel's principles), extensions of mendelism, the chromosomal basis of Mendelism, variation in chromosome number and structure, and linkage, crossing over and chromosome mapping in eukaryotes. Additionally, the concept of quantitative genetics is introduced. The topics of molecular genetics cover  structure of DNA and chromosomes and basic cellular processes including DNA replication, transcription, translation, and mutation.", "et": "Kursuses antakse alusteadmised klassikalisest ja molekulaargeneetikast.Kursus algab ülevaaega geneetika kui teaduse kujunemisest ja geneetika tänapäevastest rakendustest; samuti käsitletakse geneetilise materjali pärandumist rakutasemel. Järgneb klassikalise geneetika osa, kus käsitletakse pärilikkuse üldprintsiipe (Mendeli seadused), medelismi edasiarendusi, kromosoome kui pärilikkuse kandjaid ning Mendeli seadusi lähtudes kromosoomiteooriast, erinevusi kromosoomide arvus ja struktuuris, geenide aheldumist, ristsiiret ning klassikalisi kromosoomide kaardistamise meetodeid eukarüootidel. Käsitletakse ka kvantitatiivsete tunnuste pärandumise põhimõtteid. Ainekursuse molekulaargeneetika osas käsitletakse DNA ja kromosoomide struktuuri ja antakse alusteadmised sellistest rakulistest põhiprotsessidest nagu DNA replikatsioon, transkriptsioon, translatsioon ja mutatsioonide teke."}, "objectives": [{"en": "The main goal of the subject is to give a basic knowledge in classical genetics and core concepts of  molecular genetics.", "et": "Kursuse põhieesmärk on anda süsteemsed alusteadmised klassikalise geneetika seaduspärasustest ja algteadmised molekulaargeneetikast."}], "learning_outcomes": [{"en": "After the course, the students are expected:", "et": "Peale kursuse läbimist üliõpilane:"}, {"en": "To acquire basic knowledge in genetics.", "et": "Omab alusteadmisi geneetika põhilistest seaduspärasustest."}, {"en": "To be able to use the acquired knowledge and skills in other disciplines in biology.", "et": "Oskab kasutada omandatut õppekava järgnevates bioloogiaalastes ainekursustes."}, {"en": "To understand principles of cellular reproduction of living organisms.", "et": "Saab aru elusorganismide rakulise reproduktsiooni põhiprintsiipidest."}, {"en": "To be able to analyze, using the Estonian language, orally and in writing the problems related to genetics and participate in relevant discussions.", "et": "Suudab eesti keeles analüüsida suuliselt ja kirjalikult geneetikaga seonduvaid probleeme ja osaleda vastavates aruteludes."}], "notes": {"et": "Eksam ( kirjalik) toimub auditoorsena.Lisaks kirjalikule eksamile on võimalik eksamit sooritada ka suuliselt."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Lõpliku hinde annab eksam. Positiivse hinde saamiseks peab olema eksam sooritatud vähemalt 50%-le."}}], "grade_preconditions": {"et": "Ei ole eritingimusi."}, "grade_evaluation": {"et": "Lõpliku hinde annab eksam. Positiivse hinde saamiseks peab olema eksam sooritatud vähemalt 50%-le. Lisaks kirjalikule eksamile on võimalik eksamit sooritada ka suuliselt."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "99f52df1-367e-baa7-3926-ea2559fc29fe", "person_name": "Maia Kivisaar", "structural_unit": {"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "35-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1.\tSissejuhatus geneetikasse. Klassikalise ja molekulaargeneetika kujunemine. Geneetika tänapäeval: rekombinantse DNA tehnoloogia; genoomide sekveneerimine; globaalne geeniekspressiooni uurimine, geenikiibid. Kaasaegse geneetika rakendusalad; geneetika ja meditsiin (haigust põhjustavad mutatsioonid geenides, geeniteraapia, molekulaarne diagnostika); geneetika kaasaegses põllumajanduses; organismide kloonimine. Geneetika väärkasutused: eugeenika; lõssenkism."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2.\tReproduktsioon kui pärilikkuse alus. Rakk kui elusorganismi ehituskivi. Eukarüootne ja prokarüootne rakk Kromosoomid. Rakutsükkel, selle toimumist mõjutavad kontrollpunktid. Raku jagunemine mitoosi teel. Raku jagunemine meioosi teel. Meioosi häired. Meioosi evolutsiooniline tähtsus. Gameetide moodustumine erinevatel organismidel: oogenees; spermatogenees; sugurakkude moodustumine taimedel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3.\tMendelism: pärilikkuse üldprintsiibid. Monohübriidne ristamine - dominantsuse ja lahknemise printsiip (Mendeli I ja II seadus); geen ja selle erinevad vormid - alleelid; homosügootsus ja heterosügootsus; sümbolite kasutamine geneetikas; genotüüp ja fenotüüp. Dihübriidne ristamine - sõltumatu lahknemise seadus e. vaba kombineerumise seadus (Mendeli III seadus). Mendeli seaduste kasutamine inimese geneetikas."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4.\tMendelismi edasiarendus. Alleelne varieeruvus ja geeni funktsioon: semidominantsus ja kodominantsus; mitmene allelism e. polüallelism; alleelide seeriad; mutatsioonide testimine alleelsuse määramiseks; mutatsioonide toime organismile. Geenide fenotüübilist avaldumist mõjutavad tegurid: keskkonna mõju geenide avaldumisele; penetranstsus ja ekspressiivsus. Geenidevahelise vastastikuse toime tüübid: epistaas; pleiotroopsus; pidev fenotüübiline varieeruvus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5.\tKomplekssete tunnuste päritavus. Tunnuste pidev muutlikkus ja Mendeli seadused. Mitmealleelsus. Erinevate lookuste ja keskkonna mõju tunnustele. Alternatiivsete fenotüüpide kompleksne päritavus. Kvantitatiivsete tunnuste analüüs: kvantitatiivsete väärtuste esinemissagedus; keskmine ja modaalklass; varieeruvus ja standardhälve; korrelatsioonikoefitsient; regressioon. Päritavus. Päritavuskoefitsient. Kunstlik valik. Inbriiding ja heteroos. Kvantitatiivsete tunnuste molekulaarne analüüs."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6.\tKromosoomid kui pärilikkuse kandjad. Kromosoomide arv. Sugukromosoomid. Pärilikkuse kromosoomiteooria: eksperimentaalsed tõendid selle kohta, et päritavus on seotud kromosoomidega; kromosoomide mitteraldumine raku jagunemisel Mendeli seadused lähtudes kromosoomiteooriast. Suguliitelised geenid inimesel: hemofiilia; värvipimedus; fragiilne X; Y kromosoomi-spetsiifilised geenid. Soo määramine sugukromosoomide poolt inimesel, äädikakärbsel ja teistel organismidel. X-liiteliste geenide doosi kompensatsioon: äädikakärbse X-liiteliste geenide hüperaktivatsioon isastel; X-liiteliste geenide inaktivatsioon imetajatel."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7.\tErinevused kromosoomide arvus ja struktuuris. Kromosoomide uurimise tsütoloogilised meetodid: mitoosikromosoomide analüüs; inimese karüotüüp; meioosikromosoomide analüüs; tsütogeneetiline varieeruvus. Genoommutatsioonid. Eu- ja aneuploidsus. Polüploidsus: steriilne polüploidsus; viljakad polüploidid; polüploidsuse teke; katsed luua uusi polüploide laboritingimustes; koe-spetsiifiline polüploidsus ja polüteenia. Aneuploidsus: trisoomia inimesel; monosoomia inimesel; kromosoomide segmentide deletsioonid ja duplikatsioonid. Kromosoommutatsioonid. Ümberkorraldused kromosoomide struktuuris: inversioonid; translokatsioonid; liitkromosoomid; Robertsoni translokatsioonid; kromosoomides toimunud geneetilise materjali ümberkorraldustest tulenevad fenotüübilised muutused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8.\tAheldumine, ristsiire (crossing over) ja eukarüootsete kromosoomide kaardistamine. Kõrvalekalded Mendeli sõltumatu lahknemise seadusest; rekombinatsiooni sagedus ja geenide aheldatuse määr; ristsiire; tõendid selle kohta, et ristsiire põhjustab geneetilise materjali rekombineerumist; homoloogiliste kromosoomide vahelised kiasmid. Kromosoomide kaardistamine: geneetilise distantsi mõõtmine ristsiirete sageduse kaudu; aheldunud geenide kaardistamine; rekombinatsiooni sagedus ja distantsid geneetilisel kaardil; kiasmide sagedus ja geneetiline distants; geneetiline ja füüsiline distants. Rekombinatsiooni osa evolutsiooniprotsessis. Rekombinatsiooni allasurumine inversioonide toimel. Rekombinatsiooni geneetiline kontroll."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9.\tAheldumise geneetiline analüüs, kasutades täiustatud meetodeid. Aheldumise uurimine katseorganismides: tetraadanalüüs seentel; \"paigalhoidvate\" kromosoomide kasutamine Drosophila geneetilises analüüsis. Spetsiaalsed kaardistamise meetodid: Neurospora crassa reastatud tetraadide analüüs; Drosophila deletsioonide ja duplikatsioonide tsütogeneetiline kaardistamine. Geenide aheldumise uurimine inimesel: geenide aheldatuse tuvastamine sugupuude analüüsil; somaatiliste rakkude geneetika (rakkude hübridiseerimine, geenide kaardistamine kasutades kromosomaalseid ümberkorraldusi); inimese genoomi analüüs."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10.\tDNA ja kromosoomide molekulaarne struktuur. Nukleiinhape kui geneetilise info kandja: bakterite transformatsioon, faagide nukleiinhape kui pärilikkuse kandja, RNA viirused. DNA ja RNA koostis: nukleosiidid, nukleotiidid; lämmastikalused; Chargaffi ekvivalentsuse seadus. DNA kaksikahela ehitus: komplementaarsusprintsiip; ahelate antiparallelsus; DNA kaksikheeliksi alternatiivsed vormid. Nukleiinhapete primaar- sekundaar- ja tertsiaarstruktuurid; DNA denaturatsioon ja renaturatsioon; heterodupleksid. Kromosoomide struktuur: viiruste genoomid; bakterikromosoom; eukarüootsete kromosoomide struktuur ja koostis: histoonid; nukleosoomid. Üks kromosoom - üks DNA molekul. Eukarüootse kromosoomi pakkimine. Metafaasikromosoom. Tsentromeerid ja telomeerid. DNA kordusjärjestused eukarüootses genoomis."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "11.\tDNA replikatsioon. Nukleiinhapete sünteesist üldiselt: nukleiinhapete sünteesi suund; sünteesi läbiviivad ensüümid. DNA replikatsiooni mudelid: semikonservatiivse mudeli tõestamine; kahesuunalise replikatsiooni tõestamine. DNA replikatsiooni alguspunkt bakterites ja eukarüootidel. DNA replikatsioonikahvlite liikumine vastassuunas. DNA polümeraasid bakterites: E. coli DNA polümeraas I; replikatiivne DNA polümeraas III; DNA polümeraaside vigu korrigeeriv (proofreading) aktiivsus; vigaderohked DNA polümeraasid pol IV ja pol V bakterites. DNA replikatsiooni toimumine mõlemalt DNA ahelalt korraga: juhtiv ahel; mahajääv ahel; Okazaki fragmendid; praimosoom; replisoom. DNA replikatsiooni initsiatsioon oriC-lt bakteris E. coli. DNA ahelate lahtikeeramisel osalevad valgud. Veereva ratta replikatsiooni mudel. Eukarüoodi kromosoomi replikatsiooni eripärad. Replikon. Telomeeride pikkus ja vananemine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "12.\tTranskriptsioon ja RNA protsessing. Molekulaarbioloogia põhidogma. RNA tüübid: tRNA, rRNA, mRNA, snRNA. RNA süntees ja selles osalevad valgud; promootorid; transkriptsiooni regulaatorid. Transkriptsioon prokarüootides: prokarüootne RNA polümeraas; 5' ja 3'- järjestused; transkriptsiooni initsiatsioon prokarüootsetelt promootoritelt; transkriptsiooni elongatsioon; transkriptsiooni terminatsioon. Transkriptsioon eukarüootidel: RNA polümeraasid eukarüoodi rakus; transkriptsiooni initsiatsioon eukarüootsetelt promootoritelt; RNA ahela elongatsion; transkriptsiooni terminatsioon. Eukarüootsete geenide struktuur: eksonid ja intronid; intronite kõrvaldamine splaissingu teel. mRNA molekulis asuva geneetilise informatsiooni muutmine - RNA editing."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "13.\tTranslatsioon ja geneetiline kood. Polüpeptiidide struktuur. Translatsioon: ribosoomide ehitus; koodonid ja antikoodonid; tRNA molekulid; tRNA laadimine aminohappega; tRNA seondumise saidid ribosoomis. Translatsiooni protsessi erinevad etapid võrdlevalt prokarüootides ja eukarüootides: initsiatsioon; elongatsioon ja terminatsioon. Geneetiline kood ja selle omadused. Koodon ja antikoodon paardumine. Asendusmutatsioonid polüpeptiide kodeerivates geenides: nonsens- ja missensmutatsioonid; supressormutatsioonid; supressor-tRNA-d."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.\tMutatsioonid, DNA reparatsioon ja rekombinatsioon. Mutatsioonid on alusmaterjaliks evolutsioonile. Mutatsioonid kromosoomide tasemel ja punktmutatsioonid. Mutatsioonide olemus: mutatsioonide avaldumine; spontaansed ja indutseeritud mutatsioonid; mutatsioonid tekivad juhuslikult; mutatsioonide reverteerumine. Mutatsioonide fenotüübiline efekt: dominantsed, retsessiivsed ja neutraalsed mutatsioonid; valgu omadusi ja metabolismiraja ensüümide aktiivsust mõjutavad mutatsioonid; letaalsete mutatsioonide uurimine. Mutatsioonitekke molekulaarsed mehhanismid: transitsioonid ja transversioonid; raaminihke mutatsioonid; keemiline mutagenees; kiirgusmutagenees; transponeeruvate elementide poolt põhjustatud mutatsioonid. Ames'i test kemikaalide mutageensuse uurimiseks. DNA reparatsioonimehhanismid: fotoreaktivatsioon; väljalõike reparatsioon (lämmastikaluste ja nukleotiidide väljalõikamine); DNA \"mismatch\" reparatsioon; SOS vastus ja rekombinatsiooniline reparatsioon. DNA rekombinatsioonimehhanismid. Geeni konversioon."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "15.\tGeeni definitsioon. Geeni kontseptsiooni areng. Geeni struktuuri kirjeldamine: geeni peenstruktuuri uurimine; geenide ja polüpeptiidide kolineaarsus. Geeni geneetiline definitsioon: cis- ja trans-konfiguratsioonid; komplementatsioonitest, selle erinevus rekombnatsioonitestist; geenisiseste mutatsioonide komplementatsioon; komplementatsioonitesti piirangud. Komplekssed seosed geenide ja polüpeptiidide vahel: alternatiivne splaissing; geenisegmentide assambleerimine erinevaid immunoglobuliine kodeerivateks DNA järjestusteks."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "c7f23171-04c6-e35a-1f6a-316a721b24b7", "parent_code": "LOMR.03.010", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}