{"uuid": "8f0afa2f-6de0-6fba-bee3-20a103fc9736", "code": "LOOM.03.086", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Geodynamics and Principles of the Solid Earth Physics", "et": "Geodünaamika ja tahke Maa füüsika alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "56f3c599-d38c-8e01-71d3-9a00581b3767", "code": "LOOM.03.063", "title": {"en": "Fundamentals of Earth Sciences I", "et": "Maateaduste alused I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The course concentrates to the spherical build-up of the planet earth, its gravity and magnetic fields, and geophysical methods in studies of the earth's interior. Principles of plate tectonics, hot spots and supercontinents will be presented. The course includes the following topics:\n\n1. Introduction. Overview of methods that are used in studying the Earth's interior.\n2. Gravity field. Earth's mass and density; linkage between gravity and geology; density and porosity of geological material; measurements of gravity; gravity in different tectonical situations.\n3. Magnetic field, its variations; instruments to measure the magnetic field, rock magnetic properties, magnetic fields associating with geological structures; basis of paleogeography.\n4. Seismology. Stress and deformation,; elastic properties; seismic waves, their behavior in layered environments; earthquakes, registration and description; earthquakes in describing the Earth' interior.\n5. Thermal field, sources of heat; density of the heat flow; melted regions within the solid Earth.\n6. Structure of the Earth. Earth crust, types and composition of the crust; mantle, core, and processes within.\n7. Plate tectonics. Geological processes at boundaries of neighboring plates.\n8. Hot spots; mantle convection; forces that influence the plate movements, supercontinents.", "et": "Kursuse käigus käsitletakse tahke Maa sfäärilist läbilõiget, füüsikalisi välju (raskusjõu ja magnetväli) ning erinevaid uurimismeetodeid Maa sisemuse uurimisel. Esitatakse litosfääri laamtektooniline, kuuma täpi ja superkontinentide tektooniline mudel. Loengukursus koosneb järgnevatest peatükkidest:\n\n1.\tSissejuhatus. Ülevaade meetoditest, mida kasutatakse Maa siseehituse uurimisel.\n2.\tMaa gravitatsiooniväli. Maa mass ja tihedus; gravitatsioonijõu seos geoloogiaga; kivimite ja setendite tihedus ning poorsus; gravitatsioonjõu mõõtmine; gravitatsioon globaalsetel tektoonilistel situatsioonidel.\n3.\tMaa magnetväli, selle kirjeldamine ja variatsioonid; magnetomeetria aparatuur; kivimite magnetilised omadused; geoloogiliste struktuuridega seonduv magnetväli; paleogeograafia alused.\n4.\tSeismoloogia. Mehaaniline pinge ja deformatsioon; materjalide elastsed omadused; seismilised lained, lainete käitumine ja levik kihilises keskkonnas; maavärinad; maavärinate registreerimine ja kirjeldamine; maavärinad sisesfääride iseloomustamisel.\n5.\tMaa soojusväli; maasisese soojuse allikad; soojusvoo tihedus; sulamisvööndid Maa sees.\n6.\tMaa siseehitus. Maakoor, koore tüübid ja koostis. Maa vahevöö ja tuum, neis toimuvad protsessid.\n7.\tLaamtektoonika. Laamade omavahelised piirid, neis toimuvad geoloogilised protsessid.\n8.\tKuumad täpid; vahevöö konvektsioon; laamasid mõjutavad jõud, superkontinendid."}, "objectives": [{"en": "Scope of the course is to introduce physical fields and spherical build-up of the planet earth, plate tectonics, and the methods used in studing the interior of earth.", "et": "Omandada teadmised Maa sfäärilisest ehitusest, füüsikalistest väljadest, maakoore liikumisest ning nende teadmiste aluseks olevatest uuringumeetoditest."}], "learning_outcomes": [{"en": "Student has knowledge on spherical structure of earth and principles of plate tectonics, plate-marginal processes and relations to hot spot magnetism. In addition, student has basic knowledge on principles of seismology, gravimetry, magnetometry, and thermometry.", "et": "Üliõpilane tunneb detailselt Maa sfäärilist ehitust, laamtektoonika põhimõtteid, laamade äärtel toimuvaid protsesse, kuuma täpi magmatisimi seoseid laamtektoonikaga. Lisaks teab üliõpilane seismoloogia, gravimeetria, magnetomeetria ja termomeetria meetodite põhimõtteid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}