{"uuid": "2db6386c-d2fa-bd5b-7c47-512e531683b3", "code": "lt-2018-autumn-fulltime-c4", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Invertebrates Zoology", "et": "Selgrootute zooloogia"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM04", "name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "webpage_url": "https://zooloogia.ut.ee", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM04", "structural_unit_name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 28, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course serves as an introduction to the most important anatomical, physiological, ecological and evolutionary characteristics of invertebrates. The course covers the phylogenetics of major invertebrate phyla and introduces major species and their distribution in the world.\n\nThe practical course introduces basic morphology and anatomy of major groups of  invertebrates by examining some more widespread/ important species from each major phylum. Conserved samples, dry preparations, micropreparations, and the collections of Zoology Museum are at students disposal.", "et": "Tutvustatakse ja analüüsitakse selgrootute loomade olulisemaid ehitusplaane, nende anatoomilisi, füsioloogilisi ja ökoloogilisi iseärasusi ning mitmekesisust ja evolutsiooni. Käsitletakse selgrootute loomade süsteemi, tuntumaid/olulisemaid liike ja nende levikut maailmas. \n\nPraktikumis tutvutakse tähtsamate selgrootute rühmadega, õpitakse nende tuntumate esindajate kaudu tundma rühmade morfoloogiat ja anatoomiat. Üliõpilaste kasutada on märg- ja kuivpreparaadid, mikropreparaadid ning zooloogiamuuseumi kollektsioonid."}, "objectives": [{"en": "The course aims to give an overview of invertebrates species by major taxa. The aim of the practical works is exploration of morphology and anatomy of the representitives of the major invertebrate groups", "et": "Kursuse eesmärgiks on anda seostatud ülevaade selgrootute loomade süstemaatikast, anatoomiast, füsioloogiast, ökoloogiast ning tähtsusest suuremate taksonite (hõimkonnad, klassid) kaupa. Loengukursuse raames käsitletud teemad kinnistatakse praktikumis tuntumate/ olulisemate liikide vaatluse ja visandamise teel."}], "learning_outcomes": [{"en": "After passing the course, the student:", "et": "Kursuse läbinu:"}, {"en": "1. Has achieved a level that enables to continue independent studies in zoology", "et": "1. Omab alusteadmisi selgrootutest loomadest  sellisel tasemel, et suudab jätkata õppimist selles valdkonnas."}, {"en": "2. Has a basic overview about essential aspects of invertebrate morphology, physiology, ecology and systematics of invertebrates", "et": "2. Teab ning oskab esitada ja võrrelda selgrootute organismide üldisi ehitusprintsiipe, toimimismehhanisme ja ökoloogilisi iseärasusi ning suuremate rühmade põlvnemissuhteid."}, {"en": "3. Is able to discuss the topics related to importance, anatomy, physiology, evolution and distribution of invertebrates.", "et": "3. Suudab eesti keeles suuliselt ja kirjalikult analüüsida selgrootute loomade tähtsuse, anatoomia, füsioloogia, evolutsiooni, ökoloogia ja levikuga seonduvat ning osaleda vastavates aruteludes."}], "notes": {"et": "puudub"}}, "grading": {"independent_work": {"et": "Kuna loengutes antavad ülesanded ja loengutes 3-14 toimuvad viktoriinid põhinevad rühmatööl, tuleks esmalt moodustada kuueliikmelised rühmad. Rühmad saavad õppijad ise moodustada ning nende koosseis kursuse jooksul ei muutu. Soovitavalt võiks rühmad olla moodustatud enne esimest loengut, kuid kindlasti ei tohi see toimuda hiljem kui esimese loengu toimumispäeva õhtul.\n\nKodutöö koosneb viiest osast: \n\n1) Hiljemalt enne 2. loengut paluks tutvuda kahe Marko Prousi populaarteadusliku artikliga päristuumsete ja loomade põlvnemispuudest (üleval ÕIS-is). Enne loengutesse 3-14 tulemist peaks õppijal olema käsitletavast peateemast (jämedas trükis alapeatükis 5.2) üldine ülevaade, mis saadakse enda poolt valitud allikast vastavat teemat lugedes. Allikaks võib olla nii baasõpik kui ka mõni muu monograafia (Näiteks Ruperti \"Invertebrate zoology\", Abrikossovi \"Selgrootute zooloogia\", \"Loomade elu\" või mõni vastavat loomarühma põhjalikumalt käsitlev teos) või mõni põhjalik ja teaduspõhine internetilehekülg.\n\n2) Ettekanne. Iga kursusest osavõtja peab kursuse jooksul ühe suulise ettekande. Vt täpsemaid nõudeid ettekandele hindamiskriteeriumite jaotisest.\n\n3) Ettekandeliiki puudutav viktoriiniküsimus. Lisaks ettekandele esitab iga kursusest osavõtja ettekannet puudutava nelja valikvastusega küsimuse. Vt täpsemaid nõudeid ettekandele hindamiskriteeriumite jaotisest.\n\n4) Loomahõimkonda puudutav viktoriiniküsimus. Vt täpsemaid nõudeid ettekandele hindamiskriteeriumite jaotisest.\n\n5) Õpimapp. Praktikumide jooksul tehtavad tööd kantakse õpimappi, mis on eksamile pääsemise eelduseks. Vt täpsemaid nõudeid õpimapile hindamiskriteeriumite jaotisest."}, "independent_work_assessments": [{"work_type": {"code": "portfolio", "et": "Õpimapp", "en": "portfolio"}, "description": {"et": "10 punkti;\n\nÕpimapp peab sisaldama kõigis (10) praktikumides juhendite alusel visandatud ning teemade kaupa esitatud jooniseid.  Tervikliku (kõiki teemasid sisaldava) õpimapi esitamine on eksamile pääsemise eelduseks. Vajadusel (praktikumist põhjusega puudumise korral) saab praktikume järele teha lisapraktikumides eeldusel, et tegemata töid ei ole rohkem kui kolm."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "kuni 70 punkti; \n\nEksam on kirjalik, põhineb loengutes käsitletud teemadel ja koosneb nelja valikvastusega faktiteadmisi kontrollivatest lühiküsimustest (16 küsimust, õigesti vastatud küsimus annab 2.5 punkti, valesti vastatud küsimus -0.5 punkti, vastamata jäetud küsimus 0 punkti) ning seostamist ja analüüsi nõudvatest pikematest küsimustest (3 küsimust, iga küsimus annab kuni 10 punkti)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kodulugemine\n\nEnne loengutesse 3-14 tulemist peab õppijal olema käsitletavast (pea)teemast üldine ülevaade, mis saadakse enda poolt valitud allikast vastavat teemat lugedes. Allikaks võib olla nii baasõpik kui ka mõni muu monograafia. Kodulugemisel ja loengu käigus omandatud teadmisi kontrollitakse viktoriinidega (rühmatööna loengutes 3-14). Viktoriinide paremaid premeeritakse preemiapunktidega."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Ettekanne - 10 punkti;\n\nLoengutes 3-14 esitatakse 2-3 minuti pikkused ettekanded tähtsamatest/ olulisematest liikidest arvestusega ca viis ettekannet ühe loengu kohta. Iga osaleja peab kursuse jooksul pidama ühe ettekande, teemad loositakse esimeses loengus. Ettekande esitab kursusest osavõtja suuliselt oma istekohalt, illustratiivseks materjaliks on vastava loengu slaiprogrammis sisalduv pilt liigist. Ettekande tekst tuleb ülevaatamiseks eelnevalt esitada kursuse läbiviijale (aadressil tome@ut.ee) hiljemalt ettekande esitamisele eelneva päeva lõunaks (kell 12.00). NB! Ettekanne peab vastama kindlatele nõuetele (vt allpool), tegemist ei ole tüüpilise (kirjeldava) referaadiga! \n\nEttekanne peab põhinema vähemalt kolmel allikal. Lisaks levikule ja üldkirjeldusele peaks tekstis sisalduma vähemalt kaks tunnust mille poolest liik on sarnane mõne suurema (süstemaatilise) rühmaga kuhu liik kuulub (Näiteks: \"vaegmoondega putukatele tüüpiliselt koosneb ka nõgeseliblika areng muna-, vastse- nuku- ja valmikustaadiumist\" ning \"liblikaliste seltsile omaselt on ka nõgeseliblikas taimtoiduline\") ning vähemalt ühte eripära (Näiteks: \"enamikus areaalist esineb nõgeseliblikal aastas kaks põlvkonda, kelle valmikud erinevad üksteisest tiivamustri, kehasuuruse, arvukuse ja muude tunnuste poolest\"). Lisaks peaks ettekandes olema välja toodud ka üks uurimisküsimus, mida on antud liigi puhul uuritud või mida võiks rühma liikmete meelest uurida ja vähemalt üks võimalik vastus sellele küsimusele (Näiteks: \"Nõgeseliblika põlvkondliku tiivamustri erinevuse põhjuseks on pakutud mõlema vormi paremat kaitsevärvust oma esinemisajal, kuid see hüpotees pole uuringutes kinnitust leidnud\".)"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Liigiseoseline viktoriiniküsimus - 4 punkti.\n\nIga kursusel osaleja valmistab lisaks ettekandele ette ka ettekannet puudutava nelja valikvastusega küsimuse, mis tuleb kasutusele sama loengu lõpus toimuvas viktoriinis. Küsimuse vastus peaks ettekandes kõlama või olema ettekannet tähelepanelikult kuulanule loogiliselt tuletatav. Küsimus (koos allika esitamisega) tuleb ülevaatamiseks eelnevalt esitada kursuse läbiviijale (aadressil tome@ut.ee) hiljemalt ettekande esitamisele eelneva päeva lõunaks (kell 12.00)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Hõimkonnaseoseline viktoriiniküsimus - 6 punkti.\n\nIga kursusel osaleja valmistab ette ka üht loomahõimkonda puudutava nelja valikvastusega küsimuse. Küsimuse teema määratakse pärast rühmade moodustamist ja mitte hiljem kui teise loengu toimumise päeval. Küsimus (koos allika esitamisega) tuleb ülevaatamiseks eelnevalt esitada kursuse läbiviijale (aadressil tome@ut.ee) hiljemalt vastavateemalisele loengule eelneva päeva lõunaks (kell 12.00).\n\nKüsimus peaks puudutama mingit antud loomahõimkonna jaoks olulist aspekti, so ei tohi olla liiga detailne (loomarühmaga mõõdukalt kursis olev inimene võiks teoreetiliselt olla võimeline selle vastuse tuletama). Küsimuse allikaks sobib teadustekst (artikkel), õpik või monograafia (mh näiteks \"Loomade elu\").  Arvu või protsenti küsiva küsimuse vastusevariantide vahe peab olema vähemalt 20%."}}], "grade_preconditions": {"et": "Hindamisele pääsemise eelduseks on praktikumide läbimine ja nõuetele vastavate joonistega õpimapi esitamine."}, "grade_evaluation": {"et": "Lõpphinne kujuneb eksamist, praktikumist ja kodutöödest (pluss viktoriinide preemiapunktid) saadud punktide kogutulemina, kusjuures eksamit hinnatakse eristavalt (0-70 p.), teisi osi aga arvestuslikult (nõuete täitmisel saadakse vastava ülesande eest täispunktid).\n\nLõpphinne: A - 91-... punkti; B - 81-90 punkti; C - 71-80 punkti; D - 61-70 punkti; E: 51-60 punkti;\n\nEksam (individuaalne) -  kuni 70 punkti;\n\nÕpimapp (individuaalne) - 10 punkti; \n\nEttekanne (individuaalne) - 10 punkti;\n\nEttekandeliigi seoseline viktoriiniküsimus (individuaalne) - 4 punkti;\n\nHõimkonnaseoseline viktoriiniküsimus (individuaalne) - 6 punkti.\n\nViktoriinid (rühmatöö, 6 liiget igas rühmas); \nLoengute 3-14 lõpus toimub viktoriini formaadis tunnikontroll, mis põhineb kodutööna ettevalmistatud valikvastustega küsimustel. Iga viktoriini parima rühma kõik liikmed saavad ühe preemiapunkti, teise koha saanud rühma liikmed aga 0,5 preemiapunkti."}, "debt_elimination": {"et": "Praktikumide järeletegemine (maks. kolm puudutud praktikumi) toimub 4.12.17 (E) 12.15-18.00, ruumis 305. Järeleksami aeg ja koht lepitakse eelnevalt kokku õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "*\tLoenguslaidid (pdf-formaadis ÕIS-is) \n*\tNäiteliikide ettekandetekstid (pärast loengute lõppu kokkupanduna pdf-failis ÕIS-is) \n*\tPraktikumide juhendid ÕIS-is. Palun enne igat praktikumi konkreetse praktikumi juhend(id) välja printida või tagada sellele/ nendele elektrooniline ligipääs praktikumi vältel.\n*\tLoengutes arutlusele tulevate (lugemis)ülesannete tekstid ÕIS-is. Ka juhul kui loengus konkreetse ülesandeni ei jõuta, võib selle materjali põhjal tulla eksamiküsimusi.", "recommended_materials": "Baasõpiku (Pechenik, J.A. 2015. Biology of invertebrates, 7th ed. McGraw-Hill Education, New York) kursuse põhiteemasid käsitlevad peatükid ÕIS-is.   \n\nMartin, M. 2015. Selgrootute zooloogia lühikonspekt (üleval ÕIS-is). NB! Kasutatav ainult lisamaterjalina, kuna ei vasta enam (täielikult) kursuse ainekavale.\n\nLoomade Elu. I-III. 1981-1984. Valgus, Tallinn.\n\nAbrikossov, G jt. 1960. Selgrootute zooloogia. Eesti Riiklik Kirjastus, Tallinn.\n\nBrusca, R. 2016. Invertebrates, 3rd ed. Sinauer Associates Inc.\n\nRuppert, E.E, Barnes, R.D. 1994. Invertebrate zoology, 6th ed. Saunders College Publishing, Orlando."}, "participants": {"lecturers": [{"person_uuid": "968baa81-a762-f82a-dbb9-a2244f54b515", "person_name": "Toomas Esperk", "structural_unit": {"code": "LTOM04EN", "name": {"en": "Chair of Entomology", "et": "entomoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM04"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "d4a16c3e-896a-b2f4-ab36-9eac5422a9b3", "person_name": "Andro Truuverk", "structural_unit": {"code": "P6LM01ZM", "name": {"en": "Zoological museum", "et": "zooloogiamuuseum"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "P6LM01", "is_expired": true}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"1. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "5a3453ba-8b7d-6fc0-3632-6362800628de", "person_name": "Daniel Valdma", "structural_unit": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"3. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "9313dfcd-c416-e2cd-37ad-b4453f47b690", "person_name": "Mari-Liis Viljur", "structural_unit": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}], "study_groups": [{"uuid": "ab94d684-70d6-d441-ee9c-23018f573c0f", "code": "1. rühm", "max_size": 21}, {"uuid": "61af9ab1-ec7c-49ae-ba89-dc13f27e2edf", "code": "2. rühm", "max_size": 20}, {"uuid": "e41857c0-573c-8168-80fd-e4418aa9f0b9", "code": "3. rühm", "max_size": 20}]}, "schedule": {"weeks": {"et": "1-8"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "täpsem info õppematerjalide hulgas"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "täpsem info õppematerjalide hulgas"}}]}, "registration_info": {"audience": {}, "min_students": 1, "max_students": 61}, "parent_uuid": "2ee50332-1f09-38d9-0ed5-0edea1b929cf", "parent_code": "LOOM.04.077", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}