{"uuid": "62f34d5d-26d8-f8fe-b553-fd1169f17f12", "code": "LOOM.03.134", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Geology", "et": "Erialane sissejuhatus geoloogiasse"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Basic concepts and keywords of the field of geology are given. Students' career planning skills are developed during the course.\nWe advise the first-year bachelor students of geology and environmental technology curriculum to register during first autumn semester also for the introductory practical course LOOM.00.031 \"Applications of Geology and Environmental Technology\".", "et": "Tutvustatakse geoloogia valdkonnaga seonduvaid põhimõisteid ja märksõnu. Aine raames antakse tudengeile karjääriplaneerimise oskusi. \nGeoloogia ja keskkonnatehnoloogia 1. õppeaasta üliõpilastel on soovituslik registreeruda sügissemestril lisaks sellel kohustulikule ainele ka sissejuhatavale rakenduslikule ainele LOOM.00.031 \"Geoloogia ja keskkonnatehnoloogia rakendused\"."}, "objectives": [{"en": "The aim of this course is to introduce students' history and current state of geology in Estonia and career opportunities in this field. The course gives an introduction to the field of geology, its general terms, structure, and terminology. The course develops students' career planning skills.", "et": "Tutvustada 1. aasta geoloogia ja keskkonnatehnoloogia bakalaureuseõppe üliõpilastele geoloogia eriala. Aine annab sissejuhatava ülevaate geoloogia eriala valdkonnast, tutvutakse üldmõistete, struktuuri ja terminoloogiaga. Aine arendab tudengite karjääriplaneerimise oskusi."}], "learning_outcomes": [{"en": "After completion of the course student knows: ", "et": "Kursuse läbinu: "}, {"en": "- different career opportunities in the geology field;", "et": "- omab ülevaadet erinevatest karjäärivõimalustest geoloogia erialal;"}, {"en": "- has a background knowledge of history and current situation in geology;", "et": "- omab ettekujutust geoloogia eriala ajaloost ja hetkeseisust;"}, {"en": "- basic concepts and theoretical principles of geology;", "et": "- omab ülevaadet geoloogia eriala põhimõistetest ja teoreetilistest printsiipidest"}, {"en": "- actual problems in the geology field; ", "et": "- tunneb geoloogia eriala aktuaalseid probleeme"}, {"en": "- is able to plan, decide and act based on personal learning goals, making informed choices both in the acquisition of professional electives and in the selection of the dissertation project and supervisor.", "et": "- mõtestab ja eesmärgistab oma erialaseid õpinguid ja karjäärivajadusi"}, {"en": "- analyses and targets their professional study and studies and career choices.", "et": "- suudab planeerida, otsustada ja tegutseda isiklikest õpieesmärkidest lähtuvalt tehes teadlikke valikuid nii erialaste valikainete komplekteerimisel kui ka lõputöö projekti ja juhendaja valikul."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}