{"uuid": "4bb26f04-2fe9-0da6-6ecb-f8628b468ef2", "code": "lt-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Hydrology", "et": "Hüdroloogia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 40, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Hydrology is one of the general subjects for geography students as well as for other students whose studies deal with water and waterbodies. Basic knowledge of the fundamentals of statistics is recommended.", "et": "Hüdroloogia on üks üldainetest geograafia üliõpilastele, samuti teiste eriala üliõpilastele, kelle õppetöö on seotud veega ja veekogudega. Soovitatavad algteadmised statistika alustest"}, "objectives": [{"en": "The aim of the course is to introduce the waterbodies and groundwater and the going processes.", "et": "Õppeaines käsitletakse veekogude ja põhjavee\niseloomustamist, neis toimuvaid protsesse ja rakendusliku iseloomuga\nülesannete lahendamist."}], "learning_outcomes": [{"en": "After finishing the course students are able to", "et": "Kursuse läbinu suudab/oskab:"}, {"en": "1) describe the different water cycles and relationships between water cycle componenets ;", "et": "1) selgitada veeringete erinevusi ning veeolude pikaajalist ja sesoonset muutlikkust ning nende muutuste füüsikalist põhjust,"}, {"en": "2) calculate the water balance of different water-bodies and use these balances in water management;", "et": "2) koostada erinevate veekogude veebilansse."}, {"en": "3) analyse the long-term and seasonal changes of water regime and their reasons;", "et": "3) oskab analüüsida veekogude veerežiimi,"}, {"en": "4) explain the formation of chemical composition of water and human impact on the water quality;", "et": "4) selgitada vee keemiliste omaduste kujunemist ja inimtegevuse mõju veekvaliteedi kujunemisele, "}, {"en": "5) describe the formation of ground-water and its movement;", "et": "5) oskab selgitada põhjavee kujunemist ja dünaamikat,"}, {"en": "6) describe the formation of wetlands and development of mires,", "et": "6) oskab selgitada soode kujunemist ja arengut,"}, {"en": "7) use hydrological knowledge in practical water management.", "et": "7) oskab kasutada hüdroloogia alaseid teadmisi veemajanduse praktikas."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Jõehüdroloogia. Ühe jõe ühe aasta hüdrograafiline analüüs. Juhend ÕIS-is olemas.\n2. Jõe reostuskoormuse analüüs. Juhend ÕIS-is olemas.\n3. Võrtsjärve veebilansi arvutused. Juhend ÕIS-is olemas."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "tuleb teada enam kui poolt õppemahust."}}], "grade_preconditions": {"et": "Kõik iseseivad tööd esitatud ja õppejõu poolt arvestatud."}, "grade_evaluation": {"et": "100% kirjalik eksam kogu maretjali peale, sh iseseisvate tööde temaatika."}, "debt_elimination": {"et": "Vastavalt õppe-eeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "1. Järvekülg, A., 2001. Eesti jõed. Tartu Ülikooli Kirjastus\n2. Haberman, J., Pihu, E., Raukas, A., 2003. Võrtsjärv. Eesti Entsüklopeediakirjastus\n3. Haberman, J., Timm, T.., Raukas, A., 2008. Peipsi. Eesti Loodusfoto\n4. Hülg, A., 2015. Eesti sood.", "recommended_materials": "1. Aunap, R., jt. 2014. Üldmaateadus. Õpik kõrgkoolidele. Esti Loodusfoto.\n2. Ven Te Chow, Larry W. Mays, David R. Maidment, 1988. Applied Hydrology. McGraw Hill\n3. Other S Dingman, 2008, 2014, Physical Hydrology. Waveland Pr Inc\n4. David Maidment, 1992, Handbook of Hydrology. McGraw-Hill Professional"}, "participants": {"lecturers": [{"person_uuid": "908551b1-367e-0a3f-aa4e-979b9e3cd362", "person_name": "Toomas Tamm", "structural_unit": {"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-16.n."}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "I Üldosa \r\nVee levik maakeral. Vesi atmosfääris, hüdrosfääris, litosfääris, biosfääris. Hüdratatsioon. Hüdroloogia aine ja meetodid. Seos teiste teadustega. Hüdroloogia alldistsipliinid. Geograafilise suunaga hüdroloogiakursuse ülesanded. Hüdroloogilised vaatlused ja mõõtmised. \r\nVee kui aine omaduste uurimine; uurimismeetodid. Veekogud. Erinevad veekogude tüübid. Veekogude tüüpe üheks tervikuks siduvad protsessid. Veekogude uurimine. Vee osa geofüüsikalistes, bioloogilistes ja loodusgeograafilistes protsessides. Vesi inimese elus, majanduses ja riigikaitses. Veevarustus, veetransport, hüdroenergeetika, melioratsioon (veerezhiimi reguleerimine). Veekogu orgaaniliste ja keemiliste ressursside kasutamine. Kalapüük ja -kasvatus, mereloomade küttimine. Vee- ja veekogude kaitse. Veemajandus ja selle probleemide komplekssne lahendamine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "II Vee füüsikalised ja keemilised omadused \r\n\r\nVee molekul ja selle ehitus. Vesiniku, hapniku ja vee isotoobid. Raske vesi. Vesi kui lahustaja. Erinevate ainete sisaldus veekogude vees. Vee soolsus. Hõljum. Vee agregaatolekud ja üleminekuprotsess ühest agregaatolekust teise. Peitesoojus. Külmumistemperatuuri ja suurima tiheduse temperatuuri sõltuvus vee soolsusest. Vee soojusmahutavus ja soojusjuhtivus. Inimtegevuse mõju vee omadustele. \r\nIII Looduslik vee ringlus \r\n\r\nAtmosfääri, maismaa ja Maailmamere vee ühtsus. Veeringe kui protsess, mis seob maakera vee tervikuks. Väike veeringe ja seda moodustavad protsessid. Suur veeringe ja seda moodustavad põhilised protsessid. Veebilansi võrrand. Vesikonna, valgla, jõgikonna veebilanss. Administratiivsete territooriumide veebilanss. Inimtegevuse mõju veeringele ja selle väljendamine veebilansis. Auramine ja selle aastasisene jaotus. Auramine maapinnalt ja lumelt. Transpiratsioon ja selle mehhanism. Transpiratsioonikoefitsent. Auramine jõgikonna pinnalt ja selle määramine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "IV Maailmameri \r\n\r\nMaailmameri kui tervik. Selle jaotumine osadeks: ookeanid, mered, lahed, väinad. Ookeanide piirid. Merede klassifikatsioon: vahemered, sisemered, ääremered, saartevahelised (väina-) mered. Maailmamere ja tema osade veebilanss. Maailmamere põhjareljeef. Sügavuste kaardid. \r\n\r\nMaailmamere ja selle osade vee soolsus. Isohaliinid. Soolsuse jaotumine Maailmamere pinnal ja seda tingivad tegurid. Soolsuse vertikaalne muutumine. Halokliin. \r\n\r\nSoojusbilanss. Maailmamere osade erinev soojenemine ja jahtumine. Termiline kihistumine ja selle põhjused. Isotermid. Temperatuuri kesk- ja ekstremaalväärtused. Temperatuuri muutumine sügavuti. Väinade kaudu toimuva veevahetuse mõju temperatuurirezhiimile. Rannalähedase vööndi ja jõgede suudmealade termika iseärasused. Veemasside segunemine. TS-diagrammid. Merevee tihedus. Rõhk meresügavuses. Vee kokkusurutavus. Termilise paisumise koefitsent. \r\n\r\nJää ookeanides ja meredes. Merejää moodustumine. Merejää soolsus. Jäämoodustiste tüüpilised vormid, nende klassifikatsioon. Merejää sulamine. Maismaalt pärinevate vete mõju merejää sulamisele. Tuule ja hoovuste osa merede jää sulamises. Jäämäed ja nende levik."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Merevee optika ja akustika. Vee läbipaistvus ja värvus. Meretase. Merepinna kõikumise põhjused. Keskmine merepinna kõrgus. Kaartide kõrguste- ja sügavusteskaala null. Lainetus ookeanides ja meredes. Laine elemendid. Lainete difraktsioon. Maavärina tekitatud lained. Seisid. Aju- ja pagunähtus. \r\n\r\nLooded ja selle avaldumine. Loodeid tekitavad jõud. Kuu faaside mõju sellele. Loodete ebaühtlus. Rannajoone kuju ja põhjareljeefi mõju loodetele. Looded jõgede suudmetes. Sadamatund. Loodete energia kasutamine. \r\n\r\nHoovused ja nende tekke põhjused. Tuule- (triiv-)hoovused. Maa pöörlemise, rannajoone kuju ja merepõhja reljeefi mõju hoovustele. Hoovused madalike kohal ja ranna lähedal. Maailmamere hoovuste tüüpskeem. Hoovuste mõju Maailmamere temperatuurile ja kliimale. \r\n\r\nOokeanide ja merede põhjasetted, nende teke. Ranniku setted. Põhjasetted jõgede suudmepiirkondades. Elu ookeanides ja meredes; floora ja fauna üldiseloomustus. Töönuslikud loomad ja taimed. Kalandus. Mereloomade küttimine."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "V Põhjavesi \r\n\r\nPõhjavee mõiste. Pinnase- ja põhjavesi. Kivimite ja pinnaste veelised omadused. Poorsus, veemahutavus, veeloovutus. Vee liigid kivimite poorides: hügroskoopsusvesi, kilevesi, gravitatsioonivesi, kapillaarvesi, kolloidvesi, veeaur, jää. Vee liikumine pinnases ja kivimites. Kivimite veeläbilaskvus. Kapillaarvee tõus poorides. Vee külmumine kivimite poorides. Igikelts; selle hüdroloogiline ja loodusgeograafiline tähtsus. \r\n\r\nPõhjavee teke ja toitumine. Vabapinnalised põhjaveed, gravitatsioonivee liikumine. Filtratsiooni kiirus ja seda mõjutavad tingimused. Darci valem. Filtratsioonikoefitsent. Hüdrogeoloogiline kaardistamine. Hüdroisohüpsid. Vettkandva kihi filtratsiooni kiiruse määramine. \r\n\r\nPõhjavee tasemerezhiim ja seda mõjutavad tegurid. Mulla verezhiim ja selle sõltuvus koha kliimast. Jõeorgude põhjavee rezhiim. Survelised põhjaveed. Allikad ja nende liigitus. Allikate deebeti dünaamika ja selle seos põhjavee toitumistingimustega. Mineraalveed. \r\n\r\nPõhjavee osa füüsilis-geograafilistes protsessides. Maalihked, nende tekkimise tingimused. Karst; karstivormide mõju põhjavee liikumisele. Sufosioon. Soostumine; põhjavee osa soode tekkes. Põhjavee mõju jõgede äravoolule. \r\n\r\nPõhjavee majanduslik tähtsus. Põhjavee baasil toimuv veevarustus. Depressioonilehter. Mulla- ja pinnasevee rezhiimi muutumine inimtegevuse mõjul. Maaparandus."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "VI Jõed \r\n\r\nPõhimõisted: jõgi, jõestik,, peajõgi, lisajõed ja nende järgud. Jõgikond. Veelahe, veelahkmejoon. Jõe pikkus, jõgedevõrgu pikkus, jõgedevõrgu tihedus, jõe looklevus ja nende määramise meetodid. Jõgikonna liigestatus. \r\n\r\nJõe ülem-, kesk- ja alamjooks. Jõeorg, voolusäng, kaldad, lamm, terrassid. Jõesängi karakteristikud: isobaadid, ristlõige ja selle elemendid. Jõeorgude hüdroloogiline tähtsus. Jõe pikiprofiil. Langu mõiste. Langu jaotus piki jõge ja selle olenevus maastikulistest tingimustest. \r\n\r\nJõgede toitumine. Erinevate toiteallikate omavaheline suhe sõltuvalt jõgikonna maastiku- ja kliimatingimustest. Jõgi - maastiku üldfoonil kujunev kliima produkt. Jõe veetaseme muutumine ja selle seos jõe toitumisega. Kohalike tegurite mõju jõe veerezhiimile. \r\n\r\nSuurvesi. Selle kõrgust ja kestvust määravad tingimused. Suurvee iseloom jõe ülem-, kesk- ja alamjooksul. Madalvesi ja seda põhjustavad looduslikud tegurid. Veeseisu kõikumine jõgede suudmetes. Tulvad. Tulvavalli kujunemine ja liikumine. \r\n\r\nJõgede voolumehhanism. Laminaarne ja turbulentne voolamine, nende iseärasused. Voolamise pulseeriv iseloom jõesängis. Veekeerised. Voolukiiruse jaotumine jõe elavpinnas. Voolukiiruse muutumine ristlõikes. Isotahhid. Jõe dünaamiline telg. Voolujoom. Tuule ja jääkatte mõju voolukiiruste jaotusele jõe elavpinnas. Keskmise voolukiiruse arvutamine. Mäestiku- ja tasandikujõgede voolukiiruste erinevus. Vooluhulk ja selle arvutamine. Vooluhulga ja veeseisu vaheline seos. Hüdrograafi mõiste. Tüüp-hüdrograaf. Jõe toitumise määramine hüdrograafi liigendamise järgi."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Äravool ja selle karakteristikud: äravoolu hulk, äravoolu kiht, äravoolu moodul, äravoolu koefitsent. Keskmine, maksimaalne, minimaalne äravool. Äravoolu aastasisene jaotus. Äravoolu kaardid. Äravoolu reguleerimine; veehoidlad ja paisjärved. Veehoidlate äravoolu reguleerimise rezhiim. Veehoidlate mõju ainete ärakande protsessidele. Veehoidlate mudastumine. Veehoidlate komplekkse kasutamise põhimõtted. \r\n\r\nJõgede termika. Homotermia kui turbulentse segunemise tagajärg. Vee temperatuuri muutumine piki jõge. Jõgede jäärezhiimi põhijooned (jääkatte teke ja jääst vabanemine). Veesisene jää: lobjakas, põhjajää. Jääummistused. \r\n\r\nJõgede energia. Potentsiaalne ja kasutatav hüdroenergia. Jõe töö. Aine edasikanne jõe sängis lahustunult, hõljumina ja veeredes. Jõevee sogasus. Vooluvee ja sängi vastastikune mõju. Jõesängi deformeerumine. Jõe looklemine ja meandrite teke. Soodid. Süvasäng, põikmadalikud. Joad, kosed, kärestikud. Jõesuudmete tüübid. Deltad, estuaarid. Tahke ainese ärakanne. \r\n\r\nJõevee keemilised omadused. Mineralisatsioon ja peamiste lahustunud ioonide vahekord. Vooluhulga ja ainete sisalduse vahelised seosed. Keemiline äravool. Reostuse mõju jõevee omadustele."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "VII Järved \r\n\r\nJärve määrang. Järvenõgude teke ja nende geneetilised tüübid. Järvenõo ümberkujunemine lainetuse ja veetaseme muutuste toimel. Järvede areng. Järve ja selle põhja osad; litoraal, pelagiaal. Veetaimestiku osa järve arenguprotsessides. \r\n\r\nJärve morfomeetrilised karakteristikudja nende muutumine veeseisu kõikumise korral. Batümeetriline kõver. \r\n\r\nJärve veebilanss ja selle elemendid. Kaldavalglad. Järve veeseisu kõikumine ja selle seos veebilansiga. Läbivoolujärved, umbjärved, ajutise väljavooluga järved. Karstijärvede omapära. Veetaseme muutused järvedes; denivellatsiooninähtused. \r\n\r\nJärve termika. Järve soojusbilanss; tulu- ja kuluosa elemendid. Soojusbilansi ööpäevane ja aastane muutlikkus. Järve soojenemise ja jahtumise protsess; temperatuurirezhiimi sessoonsus. Termiline kihistumine ja homotermia. Otsene termiline stratifikatsioon ja termiline pöördstratifikatsioon. Epilimnion, metalimnion, hüpolimnion; termokliin. Järvede külmumine. Jäärezhiimi iseärasused. Jääkatte teke, jää paksuse suurenemine, jääminek. Jää toime kaldaaladele. \r\n\r\nJärvede soolsus. Umbjärvede sooldumine. Järvevee keemiline koostis ja seda määravad tegurid. Järvede gaasirezhiim. Gaaside osa järve hüdrokeemilise rezhiimi kujunemisele. Mineraalainete ja biogeenide sisaldus järve vees. Troofsustase. Järve produktiivsus ja biomass. Hüdrobioloogilised järvetüübid. Järvede areng ja kinnikasvamine. Orgaaniline aine järves: allohtoonsed ja autohtoonsed ained. Järvesetete teke."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "VIII Sood \r\n\r\nSoo määrang. Soostumist põhjustavad tegurid. Soode teke ja tüübid. Soo toitumine ja hüdroloogilised tegurid soo arengus. Peenar-laugaskopleksi kujunemine. Soo vetevõrk ja veebilanss. Taimkatte mõju soo veebilansi elementidele. Vee liikumine soodes. Soode mõju pindmisele äravoolule. Soode kuivendamine ja majanduslik kasutamine. Sood veesäilitusaladena. \r\n\r\n\r\nIX Liustikud \r\n\r\nLumepiir. Lume kogunemine polaarpiirkondades ja kõrgmägedes. Lumelaviinid ja nende tekketingimused. Lume moondumine liustikujääks, liustike teke. Liustike liikumine ja seda põhjustavad tegurid. Liustike rezhiim. Ablatsioon. Liustike pealetung ja taandumine. Liustiku veebilanss. Liustike mõju jõgede veerezhiimile ja jõevee temperatuurile. Liustike hüdroloogiline tähtsus."}}]}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "111593c7-8fbf-5d55-04f6-7aebe61cec7e", "parent_code": "LOOM.02.143", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}