{"uuid": "266b7f89-1446-8053-f7b1-427240cfedd6", "code": "LOOM.01.129", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-02T08:17:33", "title": {"en": "Introduction to urban biodiversity", "et": "Sissejuhatus linna elurikkusesse"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is divided into a practical part and independent work. The practical part lasts one weekend day, during which participants are taught to observe the richness of vascular plants, bryophytes and lichens in the centre of Tartu and to learn the components that create/support the richness (study tour takes place also in a rainy weather). The second half of the day will take place in Oecologicum, where lab methods to survey organisms interacted with plants will be introduced; also a free-form lecture is given related to interesting facts about biodiversity research. As an independent work, during the week the student submits an essay on the pre-defined topic and submits proper observations of at least 10 different species from the city of Tartu (via the PlutoF GO app). The course ends with a concluding seminar.", "et": "Lühikursus jaguneb praktiliseks osaks ja iseseisvaks tööks. Praktiline osa kestab ühe nädalavahetuse päeva, mille jooksul õpetatakse vaatlema Tartu kesklinna soontaimede, sammalde ja samblike elurikkust ning märkama seda loovaid komponente (õpe toimub ka vihmase ilma korral). Päeva teises pooles näidatakse nende organismirühmadega varjatult seotud elurikkuse laboratoorseid uurimisvõimalusi Oecologicumi õppehoones ning vabavormilise loenguna tutvustatakse elurikkuse uuringutega seotud huvitavaid seikasid. Iseseisva tööna esitab tudeng nädala jooksul teemakohase essee ning teeb nõuetekohaselt vähemalt 10 erineva liigi vaatlust Tartu linnast (PlutoF GO rakenduse kaudu). Kursus lõpeb kokkuvõtva seminariga."}, "objectives": [{"en": "The aim of the course is to \"open eyes\" in the field of biodiversity and ecology.  For this purpose biota in Tartu urban space will be introduced on the basis of plants and fungi and organisms being (hiddenly) interacted with them; also the main observation and research methods are also introduced, both in the field and in the laboratory.", "et": "Kursuse eesmärgiks on \"avada silmad\" elurikkuse ja ökoloogia valdkonnas.  Selleks tutvustatakse taimede ja seente baasil Tartu linnaruumis esinevaid liike ning nendega (varjatud) interaktsioonis olevaid muid organismirühmi; samuti tutvustatakse peamisi vaatlemise ning uurimise viise, seda nii väli-kui laboritingimustes."}], "learning_outcomes": [{"en": "1. notices and knows different plant and fungal species in urban space ", "et": "1.\tmärkab ja tunneb erinevaid taime- ja seenerühma esindajaid linnaruumis "}, {"en": "2. knows the factors what influence (increase) biodiversity in urban space ", "et": "2.\tteab linnaruumis elurikkust mõjutavaid (sh suurendavaid) tegureid "}, {"en": "3. understands the role of biodiversity in urban space", "et": "3.\tmõistab elurikkuse rolli linnaruumis "}, {"en": "4. can compare the similarities/differences of the urban biodiversity with other ecosystems", "et": "4.\toskab võrrelda linnaruumi elurikkuse sarnasusi/erinevusi teiste ökosüsteemidega"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}