{"uuid": "4317846a-df20-5429-a5d0-4c1803cd5299", "code": "LOOM.03.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sedimentology", "et": "Sedimentoloogia"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "cb4c39b9-ce92-7db5-a23f-2299dfb76b69", "code": "LOOM.03.010", "title": {"en": "Field-training of Earth Sciences I", "et": "Maateaduste alused I välipraktikum"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Theoretical problems of sedimentation processes, origin and properties of sedimentary material are discussed. Classifications of sediments and sedimentary rocks are characterised and an overview of continental (riverine, lacustrine, gravitational, glacial) and marine (coastal, shelf, ocean) sedimentation is given. Practical training of the research methods of sediments, especially siliciclastic sediments, limestones and dolomites from Estonia, in the laboratory forms an important part of this course.", "et": "Käsitletakse settimisprotsesside teoreetilisi probleeme, settematerjali omaduste ja päritolu küsimusi. Iseloomustatakse settekivimite ja nüüdisaegsete setete klassifikatsioone ning antakse ülevaade kontinentaalsetest (jõed, järved, nõlvad, liustikud) ja merelistest (rannik, mandrilava, ookean) settekeskondadest. Kursuse oluline osa on setendite, eriti Eestis levivate purdsetete, liivakivide, lubjakivide ja dolomiitide uurimismeetodite praktiline omandamine laboratooriumis."}, "objectives": [{"en": "To give knowledge of sedimentary processes and consequences.", "et": "Viia üliõpilaseni teadmised setteprotsesside olemusest ja tagajärgedest."}], "learning_outcomes": [{"en": "Successful student must:", "et": "Tudeng peab:"}, {"en": "1) have a knowledge about mineralogical composition, properties and genesis of main sedimentary componets.", "et": "1) teadma enamlevinud settematerjali mineraloogiat, omadusi ja päritolu."}, {"en": "2) be able to identify most common sedimentary rocks and know their classification.", "et": "2) tundma põhiliste settekivimite gruppide klassifikatsioone ja enamlevinud kuvimeid. "}, {"en": "3) know processes and characterizations of main continental and marine sedimentary environments.", "et": "3) teadma põhilisi kontinentaalsete ja mereliste settekeskondade omadusi ja sealesinevaid protsesse."}, {"en": "4) Know and be able to use practically laboratory study methods of main sediments (siliciclastics, carbonates).", "et": "4) Teadma ja oskama praktiliselt kasutada põhiliste setendite (purdsetted, karbonaatkivimid) uurimismeetodeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}