{"uuid": "083a7b0e-79ad-346f-d23d-dd1955096526", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-28T17:38:10", "title": {"en": "Invertebrates Zoology", "et": "Selgrootute zooloogia"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM04", "name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "webpage_url": "https://zooloogia.ut.ee", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 A regular LT", "et": "24/25 S PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM04", "structural_unit_name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 36, "practice": 18, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course serves as an introduction to the most important anatomical, physiological, ecological and evolutionary characteristics of invertebrates. The course covers the phylogenetics of major invertebrate phyla and introduces major species and their distribution in the world.\n\nThe practical course introduces basic morphology and anatomy of major groups of  invertebrates by examining some more widespread/ important species from each major phylum. Conserved samples, dry preparations, micropreparations, and the collections of Zoology Museum are at students disposal.", "et": "Tutvustatakse ja analüüsitakse selgrootute loomade olulisemaid ehitusplaane, nende anatoomilisi, füsioloogilisi ja ökoloogilisi iseärasusi ning mitmekesisust ja evolutsiooni. Käsitletakse selgrootute loomade süsteemi, tuntumaid/olulisemaid liike ja nende levikut maailmas. \n\nPraktikumis tutvutakse tähtsamate selgrootute rühmadega, õpitakse nende tuntumate esindajate kaudu tundma rühmade morfoloogiat ja anatoomiat. Üliõpilaste kasutada on märg- ja kuivpreparaadid, mikropreparaadid ning zooloogiamuuseumi kollektsioonid."}, "objectives": [{"en": "The course aims to give an overview of invertebrates species by major taxa. The aim of the practical works is exploration of morphology and anatomy of the representitives of the major invertebrate groups", "et": "Kursuse eesmärgiks on anda seostatud ülevaade selgrootute loomade süstemaatikast, anatoomiast, füsioloogiast, ökoloogiast ning tähtsusest suuremate taksonite (hõimkonnad, klassid) kaupa. Loengukursuse raames käsitletud teemad kinnistatakse praktikumis tuntumate/ olulisemate liikide vaatluse ja visandamise teel."}], "learning_outcomes": [{"en": "After passing the course, the student:", "et": "Kursuse läbinu:"}, {"en": "1. Has achieved a level that enables to continue independent studies in zoology", "et": "1. Omab alusteadmisi selgrootutest loomadest  sellisel tasemel, et suudab jätkata õppimist selles valdkonnas."}, {"en": "2. Has a basic overview about essential aspects of invertebrate morphology, physiology, ecology and systematics of invertebrates", "et": "2. Teab ning oskab esitada ja võrrelda selgrootute organismide üldisi ehitusprintsiipe, toimimismehhanisme ja ökoloogilisi iseärasusi ning suuremate rühmade põlvnemissuhteid."}, {"en": "3. Is able to discuss the topics related to importance, anatomy, physiology, evolution and distribution of invertebrates.", "et": "3. Suudab eesti keeles suuliselt ja kirjalikult analüüsida selgrootute loomade tähtsuse, anatoomia, füsioloogia, evolutsiooni, ökoloogia ja levikuga seonduvat ning osaleda vastavates aruteludes."}], "notes": {"et": "puudub"}}, "grading": {"independent_work": {"et": "Kodutöö koosneb viiest osast: \n\n1) Hiljemalt enne 2. loengut palume tutvuda Marko Prousi ja Ivar Puura populaarteadusliku artikliga loomade põlvnemispuudest (üleval kursuse Moodle'is). Enne loengutesse 3-14 tulemist peaks õppijal olema käsitletavatest teemadest üldine ülevaade, mis saadakse enda poolt valitud allikast vastavat teemat lugedes. Allikaks võib olla nii baasõpik kui ka mõni muu monograafia (Näiteks Ruperti \"Invertebrate zoology\", Abrikossovi \"Selgrootute zooloogia\", \"Loomade elu\" või mõni vastavat loomarühma põhjalikumalt käsitlev teos) või mõni põhjalik ja teaduspõhine internetilehekülg.\n\n2) Ettekanne. Iga kursusest osavõtja peab kursuse jooksul ühe suulise ettekande. Vt täpsemaid nõudeid ettekandele hindamiskriteeriumite jaotisest.\n\n3) Ettekandeliiki puudutav viktoriiniküsimus. Lisaks ettekandele esitab iga kursusest osavõtja ettekannet puudutava nelja valikvastusega küsimuse. Vt täpsemaid nõudeid ettekandele hindamiskriteeriumite jaotisest.\n\n4) Loomahõimkonda puudutav viktoriiniküsimus. Vt täpsemaid nõudeid ettekandele hindamiskriteeriumite jaotisest.\n\n5) Õpimapp. Praktikumide jooksul tehtavad tööd kantakse õpimappi, mis on eksamile pääsemise eelduseks. Vt täpsemaid nõudeid õpimapile hindamiskriteeriumite jaotisest."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Hõimkonnaseoseline viktoriiniküsimus - 6 punkti.\n\nIga kursusel osaleja valmistab ette ka üht loomahõimkonda puudutava nelja valikvastusega küsimuse. Küsimuse teema loositakse välja esimeses loengus. Küsimus (koos allikaga) tuleb ülevaatamiseks eelnevalt esitada kursuse Moodle kodutööde jaotuse hõimkonnaküsimuse ülesandevormis või kirjas kursuse läbiviijale (aadressile tome@ut.ee) hiljemalt vastavateemalisele loengule eelneva päeva pärastlõunaks (kell 15.00).\n\nKüsimus peaks puudutama mingit antud loomahõimkonna jaoks olulist aspekti, so ei tohi olla liiga detailne (loomarühmaga mõõdukalt kursis olev inimene võiks teoreetiliselt olla võimeline selle vastuse tuletama). Küsimuse allikaks sobib teadustekst (artikkel), õpik või monograafia (mh näiteks \"Loomade elu\").  Arvu või protsenti küsiva küsimuse vastusevariantide vahe peab olema vähemalt 20%."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Ettekanne - 10 punkti;\n\nLoengutes 3-18 esitatakse 3-5 minuti pikkused ettekanded tähtsamatest/ olulisematest liikidest arvestusega ca viis ettekannet ühe loengu kohta. Iga osaleja peab kursuse jooksul pidama ühe ettekande, teemad loositakse esimeses loengus. Ettekande esitab kursusest osavõtja suuliselt, illustratiivseks materjaliks on vastava loengu slaidiprogrammis sisalduv pilt liigist. Ettekande tekst tuleb ülevaatamiseks eelnevalt esitada kursuse Moodle'i kodutööde jaotuse ettekande ülesandevormis või tekstifailina kirja teel kursuse läbiviijale (aadressil tome@ut.ee) hiljemalt ettekande esitamisele eelneva päeva pärastlõunaks (kell 15.00). NB! Ettekanne peab vastama kindlatele nõuetele (vt allpool), tegemist ei ole tüüpilise (kirjeldava) referaadiga! \n\nEttekanne peab põhinema vähemalt kolmel allikal. Lisaks levikule ja üldkirjeldusele peaks tekstis sisalduma vähemalt kaks tunnust mille poolest liik on sarnane mõne suurema (süstemaatilise) rühmaga kuhu liik kuulub (Näiteks: \"vaegmoondega putukatele tüüpiliselt koosneb ka nõgeseliblika areng muna-, vastse- nuku- ja valmikustaadiumist\" ning \"liblikaliste seltsile omaselt on ka nõgeseliblikas taimtoiduline\") ning vähemalt ühte eripära (Näiteks: \"enamikus areaalist esineb nõgeseliblikal aastas kaks põlvkonda, kelle valmikud erinevad üksteisest tiivamustri, kehasuuruse, arvukuse ja muude tunnuste poolest\"). Lisaks peaks ettekandes olema välja toodud ka üks uurimisküsimus, mida on antud liigi puhul uuritud või mida võiks rühma liikmete meelest uurida ja vähemalt üks võimalik vastus sellele küsimusele (Näiteks: \"Nõgeseliblika põlvkondliku tiivamustri erinevuse põhjuseks on pakutud mõlema vormi paremat kaitsevärvust oma esinemisajal, kuid see hüpotees pole uuringutes kinnitust leidnud\".)"}}, {"work_type": {"code": "portfolio", "et": "Õpimapp", "en": "portfolio"}, "description": {"et": "10 punkti\n\nÕpimapp peab sisaldama kõigi 8 praktikumi kohta vähemalt 8 tööd (erandiks esimene praktikum, kus töid on 6) ja juhul kui korraga käsitletakse mitmeid teemasid, peab iga teema kohta olema kaks tööd. Tööde väljundiks on kas joonised koos nõutud (keha)osade äramärkimisega (vastavalt kursuse Moodle'is praktikumikaustas olevatele juhenditele) või sisukad tekstid (joonistamist mittenõudvate tööde puhul).\nTervikliku (kõiki teemasid sisaldava) õpimapi esitamine ja õppejõu kommentaaridele ning küsimustele kirjalikult vastamine (praktikumiarvestus) on eksamile pääsemise eelduseks. Vajadusel (praktikumist põhjusega puudumise korral) saab praktikume järele teha lisapraktikumides eeldusel, et tegemata töid ei ole rohkem kui kolm."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Liigiseoseline viktoriiniküsimus - 4 punkti.\n\nIga kursusel osaleja valmistab lisaks ettekandele ette ka ettekannet puudutava nelja valikvastusega küsimuse, mis tuleb kasutusele sama loengu lõpus toimuvas viktoriinis. Küsimuse vastus peaks ettekandes kõlama või olema ettekannet tähelepanelikult kuulanule loogiliselt tuletatav. Küsimus (koos allika esitamisega) tuleb ülevaatamiseks eelnevalt esitada kursuse Moodle kodutööde jaotuse ettekandeliigi viktoriiniküsimuse ülesandevormis või kirjas kursuse läbiviijale (aadressil tome@ut.ee) hiljemalt ettekande esitamisele eelneva päeva pärastlõunaks (kell 15.00)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kodulugemine\n\nEnne loengutesse 3-18 tulemist peab õppijal olema käsitletavatest hõimkondadest (lülijalgste puhul alamhõimkondadest) üldine ülevaade, mis saadakse enda poolt valitud allikast vastavat teemat lugedes. Allikaks võib olla baasõpik, mõni muu monograafia või ka usaldusväärsed internetileheküljed. Kodulugemisel ja loengu käigus omandatud teadmisi kontrollitakse viktoriinidega (rühmatööna loengutes 3-18). Viktoriinide paremaid premeeritakse preemiapunktidega."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "kuni 70 punkti; \n\nEksam on kirjalik, põhineb loengutes käsitletud teemadel ja koosneb nelja valikvastusega faktiteadmisi kontrollivatest lühiküsimustest (16 küsimust, õigesti vastatud küsimus annab 2.5 punkti) ning seostamist ja analüüsi nõudvatest pikematest küsimustest (3 küsimust, iga küsimus annab kuni 10 punkti)."}}], "grade_preconditions": {"et": "Hindamisele pääsemise eelduseks on praktikumide läbimine ja nõuetele vastavate jooniste ning tekstiliste ülesannetega õpimapi esitamine ning õppejõudude õpimappi puudutavatele küsimustele ja kommentaaridele vastamine."}, "grade_evaluation": {"et": "Lõpphinne kujuneb eksamist, praktikumist ja kodutöödest (pluss viktoriinide preemiapunktid) saadud punktide kogutulemina, kusjuures eksamit hinnatakse eristavalt (0-70 p.), teisi osi aga arvestuslikult (nõuete täitmisel saadakse vastava ülesande eest täispunktid).\n\nLõpphinne: A - 91-... punkti; B - 81-90 punkti; C - 71-80 punkti; D - 61-70 punkti; E: 51-60 punkti;\n\nEksam (individuaalne) -  kuni 70 punkti;\n\nÕpimapp (individuaalne) - 10 punkti; \n\nEttekanne (individuaalne) - 10 punkti;\n\nEttekandeliigi seoseline viktoriiniküsimus (individuaalne) - 4 punkti;\n\nHõimkonnaseoseline viktoriiniküsimus (individuaalne) - 6 punkti.\n\nViktoriinid (rühmatöö, 2 liiget igas rühmas); \nLoengute 3-18 lõpus toimub viktoriini formaadis tunnikontroll, mis põhineb kodutööna ettevalmistatud valikvastustega küsimustel. Iga viktoriini viie parima rühma kõik liikmed saavad ühe preemiapunkti, kohtadele 6-10 jäänud rühmade liikmed aga igaüks 0,5 preemiapunkti."}, "debt_elimination": {"et": "Praktikumide järeletegemine (maks. kolm puudutud praktikumi) toimub 16. nädalal ühe päeva jooksul. Järeleksami aeg ja koht lepitakse eelnevalt kokku õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "4883b049-8a61-442f-9caa-fb652c8a9cce", "type": "MOODLE", "code": "LOOM.04.077", "base_url": "undefined", "linked_to_groups": ["79a38783-a748-8133-817c-dc5e1176275e", "1a221e1c-8cd5-2750-bfb9-3c700613512c", "22f71747-c0fc-ad2a-b9bf-01d02e8ec66c"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "*Loenguslaidid (pdf-formaadis kursuse Moodles) \n* Näiteliikide ettekandetekstid (pärast loengute lõppu kokkupanduna pdf-failis kursuse Moodles)   * Praktikumide juhendid (kursuse Moodles). Palume enne igat praktikumi konkreetse praktikumi juhend(id) välja printida või tagada sellele/ neile elektrooniline ligipääs praktikumi vältel!  * Loengutes arutlusele tulevate (lugemis)ülesannete tekstid kursuse Moodles. Ka juhul kui loengus konkreetse ülesandeni ei jõuta, võib selle materjali põhjal tulla eksamiküsimusi.", "recommended_materials": "Baasõpiku (Pechenik, J.A. 2015. Biology of invertebrates, 7th ed. McGraw-Hill Education, New York) kursuse põhiteemasid käsitlevad peatükid ÕIS-is.   \n\nMartin, M. 2015. Selgrootute zooloogia lühikonspekt (üleval ÕIS-is). NB! Kasutatav ainult lisamaterjalina, kuna ei vasta enam (täielikult) kursuse ainekavale.\n\nLoomade Elu. I-III. 1981-1984. Valgus, Tallinn.\n\nAbrikossov, G jt. 1960. Selgrootute zooloogia. Eesti Riiklik Kirjastus, Tallinn.\n\nGiribet, G. & Edgecombe, G.D. 2020. The invertebrate tree of life. Princeton University Press.\n\nBrusca, R. 2016. Invertebrates, 3rd ed. Sinauer Associates Inc.\n\nRuppert, E.E, Barnes, R.D. 1994. Invertebrate zoology, 6th ed. Saunders College Publishing, Orlando."}, "participants": {"lecturers": [{"person_uuid": "968baa81-a762-f82a-dbb9-a2244f54b515", "person_name": "Toomas Esperk", "structural_unit": {"code": "LTOM04EN", "name": {"en": "Chair of Entomology", "et": "entomoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM04"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "3. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "1. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "13ea5475-1655-1906-12e0-ea8ae1c947b5", "person_name": "Kerli Kuusk", "structural_unit": {"code": "LTOM04EN", "name": {"en": "Chair of Entomology", "et": "entomoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM04"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "3. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}, "1. rühm": {"code": "2", "et": "Praktikumijuhendaja", "en": "supervisor of practical class"}}}, {"person_uuid": "52b6e882-756a-5c06-061f-1418632c6dbd", "person_name": "Kelly Kittus", "structural_unit": {"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "is_responsible": false, "is_teaching": true}], "study_groups": [{"uuid": "79a38783-a748-8133-817c-dc5e1176275e", "code": "1. rühm", "max_size": 24}, {"uuid": "22f71747-c0fc-ad2a-b9bf-01d02e8ec66c", "code": "2. rühm", "max_size": 25}, {"uuid": "1a221e1c-8cd5-2750-bfb9-3c700613512c", "code": "3. rühm", "max_size": 25}]}, "schedule": {"weeks": {"et": "6-15"}, "entries": [{"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "täpsem info õppematerjalides"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "täpsem info õppematerjalides"}}]}, "registration_info": {"audience": {}, "min_students": 1, "max_students": 74}, "parent_uuid": "2ee50332-1f09-38d9-0ed5-0edea1b929cf", "parent_code": "LOOM.04.077", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}