{"uuid": "4413b49d-4b18-761d-e38f-08cf8fae5e40", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-14T13:11:56", "title": {"en": "The Development of Geographical Thought and the History of Geography", "et": "Geograafilise mõtte kujunemine ja geograafia ajalugu"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 28, "practice": 2, "seminar": 4, "independent_work": 44, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "de", "et": "saksa keel", "en": "German"}, {"code": "en", "et": "inglise keel", "en": "English"}, {"code": "ru", "et": "vene keel", "en": "Russian"}], "description": {"en": "The lecture course in the history of geography is, on the one hand, a systematic survey of how the Europeans discovered the world for themselves; on the other hand, it analyses the development of natural scientific knowledge from the ancient times to the end of the 19th century, which gave rise to the foundation of the science of geography and the debates about the investigation object in geography. In the light of these debates, the course also provides a survey of the development of theoretical geography and cartography from the 19th to the 21st century.", "et": "Geograafia ajaloo kursus on süsteemne analüütiline ülevaade maailma avastamisest Euroopa vaatevinklist. Kursus annab ülevaate koloniaalimpeeriumide sünnist ja langusest ning loodusteadusliku mõtte ja geograafiateaduse arengust kuni 20. sajandi lõpuni."}, "objectives": [{"en": "The aim of the lecture course is to describe the development of the world picture of Europeans from the ancient times to the beginning of the 20th century, and give a survey of the history of theoretical geography.", "et": "Geograafia eriala lõpetanud saavad tööd paljudel erialadel tänu hästi laiapõhjalisele õppele. Geograafia ajaloo tundmine on geograafia-alase hariduse üks nurgakive. Tänaste riikide geopoliitilisi, majanduslikke ning kultuurpoliitilisi huvisid  ei ole võimalik mõista ja toimuvaid protsesse iseseisvalt ning kriitiliselt analüüsida, kui me ei tunne maailma ja geograafiliste avastuste ajalugu alates ürgajast.\n\nSuurte riikide omavahelist konkurentsi on kogu aeg saatnud tung laieneda ja kontrollida nii poliitiliselt kui ka majanduslikult üha suuremaid territooriume, et kasvatada oma rikkust ja poliitilist mõju. Maadeavastused ja ümbermaailmareisid olid parimad vahendid rikkuse kasvatamiseks. Oma tegevuse õigustamiseks rakendasid näiteks eurooplased edukalt nö uskmatute ristiusustamist.\n\nMida rikkamaks said riigid seda kiiremini sai võimaluse areneda teadus ja (ülikooli)haridus, mis oli väga kõrgel tasemel olnud antiikajal, kuid sai uuesti hoo sisse pärast suuri maadeavastusi 16. sajandil. Sellest ajast alates jõudis kõrgharidus üha rohkemate inimesteni, sh. 19. sajandil ka esimeste eestlasteni. Geograafia ajaloo kursuse ülesanne on ka näidata millise panuse on andnud  Eestist pärit maadeuurijad ja geograafid geograafiateaduse arengusse.\n\nMis puudutab Maa loodusolude ja avalduvate seaduspärasuste uurimist (nt temperatuurierinevuste mõistmist Maa erinevates piirkondades), territooriumide kaardistamist ja kasulike loodusvarade otsimist, siis kõik need aspektid olid olulised geograafia kui teaduse kujunemisele ja arengule, mille peamiseks uurimisobjektiks muutus maastik. \n\nLühidalt: geograafia ajaloo kursuse eesmärk on soodustada analüütilist mõtlemist ja kujundada geograafide ja teiste ajaloost huvitatud üliõpilaste maailmapilti. Eesmärk on aidata üliõpilasi orienteeruda maailma ajaloo küsimustes  ning tänapäeva riikide huvide džunglis. \n\n"}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "The course gives the students a general understanding of extensive material on the development of world history and the role of geographical exploration trips and theoretical geography in it.", "et": "1. Üliõpilane tunnetab, et maailma ning geograafia ajalugu ei ole kunagi ainult must ja valge ning seda ka Eesti ajaloo kontekstis. Kõikjal on halle toone ning sageli pole võimalik värvitoonidel põrmugi vahet teha. Kriitiline mõtlemine on alati esmatähtis. \n\n2. Üliõpilane tunneb Maa geograafilise uurimise ajalugu ja teadmiste vähesusest ja tehnilistest vajakajäämistest tulenenud raskusi sel teel;\n\n3. Üliõpilane oskab  siduda riikide tõusu ja languse põhjuseid alates antiikajast poliitiliste protsessidega, maadeavastustega ja  loodusvarade kasutuselevõtuga; \n\n4. Üliõpilane analüüsib suurte riikide mh koloniaalimpeeriumide (Portugali, Hispaania, Holland, Briti, Prantsuse, Vene) omavahelist konkurentsi ja näitab, millised sammud tõid majanduslikku ja poliitilist kasu maadeavastustes ning avastatud maade koloniseerimisel;\n\n5. Üliõpilane suudab selgitada üksikteadlaste, teaduste akadeemiate ja ülikoolide sh Tartu ülikooli ning seal töötanud teadlaste rolli loodusteaduste ja eriti geograafiateaduse ning kartograafia arengu seisukohalt .  \n"}], "notes": {}}, "grading": {"independent_work": {"et": "Üliõpilased kirjutavad referaadi ühel geograafia ajaloo teemal ja kannavad selle seminaris ette. Järgneb diskussioon. Referaadi koostamiseks võib kasutada internetis leiduvat informatsiooni (tuleb viidata), kuid soovitav on esijoones toetuda publitseeritud allikatele ja teadustöödele ning neile ka viidata. "}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Osakaal lõpphindest 40%"}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Osavõtt diskussioonist nii loengus kui ka referaatide analüüsil, osakaal 10% "}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Hindamine põhineb oskusel kasutada õpiväljundeid, mis on kirjas nii ÕIS-s kui ka ainekavas. Osakaal 50%"}}], "grade_preconditions": {"et": "Osavõtt loengutest ja seminaridest. Üliõpilased registreerivad ennast loengulehel."}, "grade_evaluation": {"et": "Kujuneb vastavalt õpiväljunditele ning referaadi sisule."}, "grade_conditions": {"A": {"et": "Silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine."}, "B": {"et": "Väga heal tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused."}, "C": {"et": "Heal tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas avaldub ebakindlus ja ebatäpsus."}, "D": {"et": "Piisaval tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus."}, "E": {"et": "Minimaalselt lubataval tasemel olulisemate õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisidel, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus."}, "F": {"et": " Õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel."}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Nädal pärast teise kirjaliku eksami toimumise kuupäeva."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=8663", "is_moodle_connected": true, "learning_environments": [{"uuid": "62a22bf6-bbdf-49e4-bf64-6028464d1380", "type": "MOODLE", "code": "LOOM.02.244", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Lisamaterjalid on kõik üleval loengukursuse juures Moodle keskkonnas."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}], "mandatory_materials": "Kurs, O. Maateadusest Eestis. Geograafiast ja geograafidest 20. sajandil. Tartu: Õpetatud Eesti Selts, 2007 (Õpetatud Eesti Seltsi Kirjad, VIII).", "recommended_materials": "Baker, A. Geography and History. Bridging the Divide. Cambidge: Cambdige University Press, 2003;\nBalchin, J. Silmapiiri vallutades. Suurte maadeavastajate rännakud. Tallinn: Ersen, 2008;\nBawfl, S. Francis Drake. Kuninganna piraadi salajane avastusretk 1577-1580. Tallinn: Kunst, 2007;\nBeattie, O., Geiger, J. Jäätunud ajas. John Franklini Loodeväila ekspeditsiooni saatus. Tallinn: EEsti Raamat, 2005;\nBergreen, L. Üle maailma serva. Magalhaesi vapustav ümbermaailmareis. Tallinn: Tänapäev, 2008;\nByström, D. James Cook. Vaikse ookeani vallutaja. Tartu: EKS, 1935;\nCentkiewicz, A., Centkiewicz, C. Mees, keda kutsus meri. Jutustus Roald Amundsenist. Tallinn: EEsti Raamat, 1988;\nDriver, F. Geography Militant. Cultures of Exploration and Empire. Oxford: Blackwell, 2001;\nFritze, R.H. Uued maailmad. Suured geograafilised avastusreisid 1400-1600. Tallinn: Tänapäev, 2007;\nFrost, O. Bering. Vene impeeriumi teenistuses Ameerikat avastamas. Tallinn: Kunst, 2006;\nHanko, A. Roald Amundsen. Avastaja ja polaarmaade uurija elu. Tartu: EKS, 1932; \nHiiemaa (veski), K. Aafrika retseptsioon eestikeelses trükisõnas (kuni 1917). Tartu: Tartu ülikooli kirjastus, 2006;\nKay, B. Meresõiduajaloo suured ekspeditsioonid. Seikluslikud avastusretked maailma lõppu ja veelgi kaugemale. Tallinn: Olion, 2008;\nKotzebue, O. v. Reis ümber maailma aastail 1823-1826. Tallinn: Eesti Raamat, 1978;\nKäbin, I. Maal ja merel. Eesti arste-maadeuurijaid. Lund: Tulimuld, 1972 (Eesti ajalugu arsti pilgu läbi. Tartu: Ilmamaa, 1998);\nLivingstone, D. N. The Geographical Tradition. Episodes in the History of a Contested Enterprise. Oxford: Blackwell, 1992;\nMarco Polo reisid. Tallinn: Olion, 2004;\nMiddendorff, A. Th. v. Reis Taimõrile. Tallinn: Eesti Raamat, 1987;\nNilson, O. Maa avastamine. Tallinn: Valgus, 1975;\nPaatsi, V. Eesti talurahva loodusteadusliku maailmapildi kujunemine rahvakooli kaudu (1803-1918). Tallinn: Tallinna pedagoogikaülikooli kirjastus, 2003;\nParts, A. Läbi Aasia südame. Sven Hedini elulugu reisides. Tartu: Noor-Eesti, 1937. I-II.\nPassetski, V. Ühe kaardi saladus. Tallinn: Eesti Raamat, 1973;\nPassetski, V. Eestist pärit Arktika uurijad. Tallinn: Eesti Raamat, 1970;\nRoss, A. C. David Livingstone. Missioon ja impeerium. Tallinn: Kunst, 2006;\nVogt, C. E. Fritjof Nansen: mees ja maailm. Tallinn: Tänapäev, 2014."}, "participants": {"lecturers": [{"person_uuid": "48cbbc91-c78f-b751-1e9a-2451aad5e0b7", "person_name": "Erki Tammiksaar", "structural_unit": {"code": "LTOM02LM", "name": {"en": "Chair of Physical Geography and Landscape Ecology", "et": "loodusgeograafia ja maastikuökoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "27.-34.n."}, "entries": [{"course_week": 1, "time": "2025-03-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Geograafilised teadmised antiikmaailmas kuni Kristuse sünnini (kuni ca 200 aastat pärast Kristust)"}, "description": {"et": "Sissejuhatus teemasse, õpiväljundite ja oskuste selgitamine, põhimõisted. Ürgühiskondade silmaring ning uskumused. Sumerite riigi, Babüloonia, Vana-Egiptuse, Hiina ja antiikaja geograafia areng ning saavutused. Ptolemaiose maailmakaart ja selle vead."}}, {"course_week": 1, "time": "2025-04-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Geograafiliste teadmiste areng alates 4. sajandist pärast Kristust kuni 15. sajandini"}, "description": {"et": "Vana-Rooma langus ja Araabia geograafia tõus. Ristiusu levik ja ususõjad Palestiinas ning Põhja-Euroopas. Viikingite avastused ja nende mõju Euroopale. Kaubanduse areng Vahemerel ja Läänemerel. Uute kultuurtaimede kasutuselevõtt."}}, {"course_week": 2, "time": "2025-04-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "Suured geograafilised avastused (15.–18. sajand), loodusteaduste areng"}, "description": {"et": "Euroopa 15.–18. sajandil, suurte maadeavastuste põhjused. Portugallased suurte maadeavastuste eestvedajana (Henrique Meresõitja). Portugali ja Hispaania maailmariigi sünd. Meretee Indiasse ning Ameerika ja Austraalia avastamine. Inglismaa ja Prantsusmaa esimesed mereekspeditsioonid. Euroopa riikide Ida-India kompaniide sünd. Loodusteaduste ja kartograafia areng Euroopas. Läänemere nime küsimus. Bernhard Varenius ja geograafiateaduse esimesed sammud."}}, {"course_week": 2, "time": "2025-04-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"et": "Teaduslikud ümbermaailmareisid (18. ja 19. sajand)"}, "description": {"et": "Prantsuse (Louis-Antoine de Bougainville), Briti (James Cook) ja Vene ümbermaailmareisid (Adam Johann von Krusenstern) ja nende tähtsus maadeavastuse seisukohalt. Mandrite äärealade ning ookeanide kaardistamine. Ümbermaailmareiside tähtsus loodusteaduste arengule. Baltisaksa meresõitjate roll maadeavastuses ning Vaikse ookeani kaardistamises."}}, {"course_week": 3, "time": "2025-04-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"et": "Lõuna- ja Põhja-Ameerika uurimisajalugu (16.–20. sajand)"}, "description": {"et": "Hispaania konkistadooride kullajaht Kesk-Ameerikas, konkistadooride avastused. Ameerika – Hispaania impeeriumi rikkuse keskpunkt. Prantsuse ja Inglise koloniaalhuvid Ameerikas ning kolooniate asutamine. Teaduslike sisemaaekspeditsioonide algus: Charles-Marie de la Condamine ja Alexander von Humboldt."}}, {"course_week": 3, "time": "2025-04-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {"et": "Aafrika uurimisajalugu (14.–20. sajand). Austraalia ja Okeaania hõlvamine (18.–20. sajand) "}, "description": {"et": "Aafrika uurimise ajaloo peamised küsimused: Timbuktu, Nigeri jõe suubumise koht, Niiluse lätted. Hollandi, eriti aga Briti uurimisekspeditsioonid Aafrika sisealadele 19. sajandil (David Livingstone). Saksa maadeuurijad Aafrikas, misjonitöö Aafrika rahvaste ristiusku pööramiseks, eesti misjonäride osa selles töös. Brittide ja prantslaste koloniaalhuvid Austraalias ja Vaiksel ookeanil; Austraalia sisealade uurimine."}}, {"course_week": 4, "time": "2025-04-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {"et": "Aasia uurimisajalugu (18.–20. sajand)"}, "description": {"et": "Mongolite khaaniriik ja ohud eurooplastele. Euroopa emissarid Hiinas. Portugaallased Indias ja Jaapanis ning Portugali ja Hispaania maailmariikide sünd 16. sajandil. Inglismaa ja Prantsusmaa esiletõus 17. sajandil ja Aasia rannikualade hõlvamine, võitlus India kontrolli üle. Briti Ida-India kompanii roll India ja Aasia koloniseerimisel ning Briti impeeriumi majanduses. Aasia sisealade uurimine (Tiibet, Uiguuria, Turkestan) 19. sajandil. Vene ja Briti huvide põrkumine Sise-Aasias, sõjaväe retked (Nikolai Prževalski) ning Sise-Aasia geograafia kindlakstegemine. Sven Hedin Sise-Aasias."}}, {"course_week": 4, "time": "2025-04-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {"et": "Vene impeeriumi uurimisajalugu (16.–18. sajand)"}, "description": {"et": "Vene vürstiriikide vabanemine mongolite ikkest 15. sajandil. Vene riigi sünd ja tsentraliseerimine. Siberi vallutamine 17. sajandil. Vene kasakate kiire edasiliikumine inimtühjas Siberis ja kindlustuste rajamine Siberi põhja- ja idarannikul ning Amuuri jõe ääres. Vene-Hiina Nertšinski rahuleping (1648). Venemaa areng impeeriumiks. Peterburi teaduste akadeemia asutamine (1724) ning Vene ekspeditsioonid Siberisse: Esimene ja Teine Kamtšatka ekspeditsioon (1725–1730; 1733–1743) ning Alaska avastamine. Vene akadeemilised ekspeditsioonid (1766–1774) ja nende kasu Vene majanduse arengule."}}, {"course_week": 5, "time": "2025-04-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {"et": "VVene impeeriumi uurimine 19. sajandil ja baltisakslaste roll selles"}, "description": {"et": "Vene impeeriumi valitsemise reformimine 19. sajandi algul, ministeeriumide ja ülikoolide asutamine. Saksakeelse Tartu ülikooli asutamine. Baltisaksa rahvusgrupi kujunemine ning baltisaksa teaduse kõrge tase. Baltisakslased haaravad juhtpositsiooni Vene impeeriumi geograafilises uurimises terveks sajandiks. Baltisaksa teadlased panid aluse teadusele igikeltsast, selgitati mammutite väljasuremise põhjused, kinnitati jääajateooria kehtivus, tehti olulisi geograafilisi avastusi. Adolf Erik Nordenskiöldi Kirdeväila ekspeditsioon (1878–1879) ning Esimene rahvusvaheline polaaraasta (1882–1883)."}}, {"course_week": 5, "time": "2025-04-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {"et": "Loode- ja Kirdeväila uurimine (16.-20. sajand)"}, "description": {"et": "Hollandlaste ja inglaste meretee otsingud 16. sajandil ümber Aasia (Kirdeväil) ja Põhja-Ameerika (Loodeväil) Hiinasse. Põhjapolaaralade karm kliima lõpetas eurooplaste püüded läbi Kirde- ja Loodeväila Hiinasse jõuda. Põhjapolaaralade uurimise uus etapp 19. sajandil. Briti, ja baltisaksa maadeuurijate ning Saksa kartograaf August Petermanni osa selles uurimistöös. Fridtjof Nanseni põhjapooluse ekspeditsioon (1893–1893). Roald Amundsen läbib Loodedväila (1903–1906), põhjapooluse vallutamine. Kes jõudis põhjapoolusele esimesena?"}}, {"course_week": 6, "time": "2025-05-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {"et": "Antarktika geograafiline uurimine (16.–20. sajand)"}, "description": {"et": "Terra Australis Ptolemaiose maailmakaardil, Terra Australis’e mõõtmed maailmakaartidel vähenevad (16.–18. sajand). James Cooki, Fabian Gottlieb von Bellingshauseni, James Clark Ross, Jules Dumont d'Urville, Robert Falcon Scotti ja Roald Amundseni ekspeditsioonid Antarktikasse. Geopoliitiline konkurents küsimuses: kes avastas Antarktise kontinendi."}}, {"course_week": 6, "time": "2025-05-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 12, "topic": {"et": "Loodusteaduste areng (18.–20. sajand). Teoreetilise geograafia sünd ja areng "}, "description": {"et": "Kartograafia areng: mõõteriistade täiustumine, triangulatsiooni kasutuselevõtt, täpsete kaartide valmistamise algus. Kaartide ja atlaste laialdane levik ühiskonnas (alates 16. sajandist). Haritud eurooplased on maadeuurijate saavutustest vaimustatud. Loodusteaduste areng 18. ja 19. sajandil alates, Isaac Newtoni teooria – Maa on ellipsoid. Loodusajaloo jagunemine erinevateks loodusteaduslikeks distsipliinideks (geoloogia, botaanika, zooloogia, geograafia). Kui vana on planeet Maa, elusloodus ja inimkond? Teoreetilise geograafia sünd Preisimaal 19. sajandi algul. Mis peaks olema geograafia uurimisobjekt? Teoreetiline geograafia 20. sajandil."}}, {"course_week": 7, "time": "2025-05-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 13, "topic": {"et": "Loodusteaduste areng Eesti alal (17.-20. sajand), eesti geograafia areng 20. sajandil"}, "description": {"et": "Loodusteaduste areng Tartu ülikoolis (1632–1710). Tartu ülikooli taasavamine 1802. aastal andis tugeva tõuke teaduse arenguks Eesti alal. Saksakeelne Tartu ülikool oli Vene impeeriumi tippülikool, kus said hariduse mitmed eestlased. Baltisaksa teadlaste osa Eesti ala looduse uurimisel. Eesti loodusteaduse sünd Eesti Vabariigi Tartu ülikoolis. Kodu-uurimine eesti geograafia arengus. Eesti geograafia Nõukogude okupatsiooni ajal ja pärast iseseisvuse taastamist.\n"}}, {"course_week": 7, "time": "2025-05-14", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {"et": "Eesti rahvusarhiivi Noora külastus (Nooruse 3, Tartu) "}, "description": {"et": "Tutvume Eesti geograafia ajaloo jaoks oluliste dokumentidega Eesti rahvusarhiivis"}}, {"course_week": 8, "time": "2025-05-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Referaatide ettekandmine ja diskussioon"}, "description": {}}, {"course_week": 8, "time": "2025-05-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Referaatide ettekandmine ja diskussioon"}, "description": {}}]}, "registration_info": {"audience": {"et": "geograafia 1.a."}, "min_students": 10}, "parent_uuid": "aa971c68-c7fa-77c3-6945-be3f853b5709", "parent_code": "LOOM.02.244", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}