{"uuid": "28309fd8-b2ec-3831-0fb9-7a98c65d2c9b", "code": "LOOM.03.115", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Earth Sciences I", "et": "Maateaduste alused I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Essential geological phenomena and processes taking place inside the Earth and on the surface are discussed and introduced. Basic knowledge of the evolution of the Earth, origin of rocks, minerals and mineral resources is acquired.", "et": "Aine annab ülevaate endo-ja eksogeensetest geoloogilistest protsessidest ning selle taustal seletab Eesti geoloogilise ehituse ning maavarade leviku seaduspärasusi. Kohustuslik on osaleda mineraalide ja kivimite praktikumides."}, "objectives": [{"en": "Students will learn to recognize principal surficial and interior geodynamic processes, to identify minerals and rocks formed during these processes. They learn to describe Earth structure and periods of history.", "et": "Üliõpilase õpivad eristama põhilisi maasiseid ja maapindseid geoloogilisi protsesse, määrama neis tekkinud mineraale ja kivimeid, õpivad tundma Maa siseehitust ning tema arengu periodiseerimist."}], "learning_outcomes": [{"en": "Students know the main endogenic and exogenic geological processes taking place on  the Earth, have a knowledge on the Earths  inner structure and the geological evolution of the Earth. Students have basic knowledge on the origin of main rock types and minerals, of main exogenic processes, sediment types and main landforms. Students acquire outlines of Estonian geology.", "et": "Kursuse eduka läbimisega omab üliõpilane ülevaate peamistest endogeensetest ja eksogeensetest  geoloogilistest protsessidest ning tunneb Maa siseehituse põhijooni. Oskab määrata peamisi kivimitmoodustavaid mineraale ja peamisi tard-, moonde- ja settekivimeid. Üliõpilane teab Maa geoloogilise arengu periodiseerimise põhiprintsiipe. omab ülevaadet põhilistest eksogeensetest protsessidest, pinnakatte setetest ja pinnavormidest ning  Eesti geoloogilise ehituse põhijoontest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}