{"uuid": "046052f2-a680-be49-782a-0636dd7e8264", "code": "LOTI.05.092", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Technical Graphics II", "et": "Insenerigraafika II"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTTI", "structural_unit_name": {"en": "Institute of Technology", "et": "tehnoloogiainstituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTTI", "name": {"en": "Institute of Technology", "et": "tehnoloogiainstituut"}, "email": "info@tuit.ut.ee", "phone": "+372 737 4800", "webpage_url": "https://tuit.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students are asked to compile SolidWorks part and drawing files of real details with different complexity in the form of independent work and teamwork. For solving design tasks, students will be introduced to the standards of compiling assembly drawings consisting of threads and fits. Two problem-based creative assignments for three-member teams are taken from real life. Here students must find a creative solution, execute the overall design and present their design in class \nStudents with high academic achievement level will get the access to sit an on-line SolidWorks CSWA certification exam.", "et": "Individuaal- ja grupitööna tuleb üliõpilastel koostada SolidWorksi mudeli- ja joonisefailid erineva keerukuseastmetega detailidest. Ülesannete lahendamiseks tutvustatakse üliõpilastele keermeid ja iste sisaldavate koostejooniste vormistamist. Kolmeliikmelistes rühmades tuleb loovalt modelleerida ja seminaris kaitsta ülesandeks valjapakutud seadme uudne lahendus.\nEdukalt edasijõudvatele üliõpilastele antakse parool CSWA on-line eksami sooritamiseks."}, "objectives": [{"en": "The objective of this course is to give students knowledge of the design of assemblies, and provide students with individual work and teamwork experience of designing assemblies and drawings with the SolidWorks software.", "et": "Anda üliõpilastele teadmised koostude disaini põhimõtetest, praktiline individuaalne ja rühmatöö kogemus koostude mudelite ja jooniste vormistamiseks inseneritarkvaraga SolidWorks."}], "learning_outcomes": [{"en": "After completion of this course the student:", "et": "Peale kursuse läbimist üliõpilane:"}, {"en": "1. Is able to compose assembly models and drawings consisting of fits and tolerances;", "et": "1. Oskab vormistada mudelite koostusid ja koostejooniseid, mis sisaldavad iste ja tolerantse;"}, {"en": "2. Knows the basic manufacturing processes of metal;", "et": "2. Teab peamiseid metalli töötlemisviise;"}, {"en": "3. Is able to use mathematical modelling and MS Excel for design tasks;", "et": "3. Oskab inseneriülesannete lahendamisel kasutada matemaatilist modelleerimist ja MS Excel'it;"}, {"en": "4. Is able to solve modelling assignments on the level of the SolidWorks CSWA certification;", "et": "4. Suudab lahendada SolidWorks firma CSWA atesteerimistaseme ülesandeid;"}, {"en": "5. Has practical and creative problem-based learning experience in team for solving engineering tasks.", "et": "5. Omab praktilist ja loovat projektiõppe kogemust inseneriülesande lahendamiseks rühmatööna."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}