{"uuid": "142a68ac-aa4c-81d4-130e-3e159c6e9bd8", "code": "LTAT.05.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Blockchain Technology", "et": "Sissejuhatus Blockchaini tehnoloogiasse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "A very brief description of major subjects or activities. Major activities include (1) self-study of the course material given in the course Website, (2) active participation at the workshop. During workshop students will have to perform the given work assignments, to fill in the questionnaires and to execute quizzes.", "et": "Põhitegevuste lühikirjeldus. Põhitegevuste hulka kuulub (1) kursuse materjali iseseisev õpe kursuse veebilehel, (2) töökojas aktiivne osalemine. Töökojas peavad õppurid sooritama ülesandeid, vastama küsimustikele ning läbima teste."}, "objectives": [{"en": "1. Define the essential blockchain characteristic; address the fundamental features of blockchain technology. ", "et": "1. Defineerida blockchaini põhilisi omadusi; arvestada blockchaini tehnoloogia sisulist võimekust. "}, {"en": "2. Select appropriate technical options for blockchain design and implementation; specify, refine, update and make available a formal approach to design solutions, necessary to develop and operate a blockchain application. ", "et": "2. Valida sobivad plokiahela kavandamise ja implementeerimise tööriistad; täpsustada, parendada, uuendada ning avalikuks teha kavandusotsuste formaalne lähenemine blockchaini rakenduse arendamiseks ja kasutamiseks. "}, {"en": "3. Introduce how the characteristics of blockchain technology can disrupt and/or innovate existing business models and business processes; examine existing blockchain-based use cases in industries such as finance, public services, provenance, supply chains etc. ", "et": "3. Tutvustada, kuidas blockchaini tehnoloogia omaduses saavad tõkestada või uuendada olemasolevaid ärimudeleid ja äriprotsesse; vaadelda olemasolevaid plokiahelapõhiseid kasutusmalle tööstustes nagu finants, avalikud teenused, tarneahelad jne. "}, {"en": "4. Introduce process- and state-based modelling languages suitable for requirement analysis and design of blockchain applications; identify a use case, selection of suitable platform, design a solution that delivers value, and develop a proof of concept in accordance with defined specifications.", "et": "4. Tutvustada protsessi- ja olekupõhiseid modelleerimiskeeli, mis sobivad blockchaini rakenduste nõuete analüüsiks ja kavandamiseks; kasutusmalli tuvastamine, sobiva platvormi valimine, väärtust loova lahenduse kavandamine ning nõuetele vastava prototüübi loomine."}], "learning_outcomes": [{"en": "Learning outcomes U1. Students will be able to ", "et": "Õppeüksuse 1 õpiväljundid. Õppurid on võimelised "}, {"en": "1. Explain basic blockchain concepts, such as cryptographic components, consensus components, and major blockchain structures. ", "et": "1. Anda ülevaade spetsiifilise blockchain rakenduse hüvedest ja pahedest, rõhuga turvalisusel, hajususel ja üksmeele saavutamisel."}, {"en": "2. explain basic principles and applications of the smart contracts. ", "et": "2. Iseseisvalt selgitada  targa lepingu loogikat kirjeldatud blockchainikeskses olukorras."}, {"en": "Learning outcomes U2. Students will be able to ", "et": "Õppeüksuse 2 õpiväljundid. Õppurid on võimelised "}, {"en": "1. Select among the blockchain platform, select and formalise requirements for the specific scenario. ", "et": "1. Valida plokiahelaplatvormide vahel, olukorrapõhiste nõudeid luua ja vormistada. "}, {"en": "2. Design a specification according to the given scenario. ", "et": "2. Kavandada olukorrapõhiseid tehnilisi nõudeid. "}, {"en": "Learning outcomes U3. Students will be able to ", "et": "Õppeüksuse 3 õpiväljundid. Õppurid on võimelised "}, {"en": "1. Apply regulatory and legal frameworks for the blockchain operations. ", "et": "1. Kasutada regulatoorseid ja juriidilisi raamistike blockchaini tehingutes. "}, {"en": "2. Recommend blockchain technology for business and operation innovation. ", "et": "2. Soovitada blockchaini tehnoloogiat äride ja tehingute uuendamiseks. "}, {"en": "3. Perform SWOT analysis of the blockchain application. ", "et": "3. Blockchaini rakenduse SWOT-analüüsi läbi viia. "}, {"en": "4. Design blockchain business processes and business logics. ", "et": "4. Blockchainipõhiseid äriprotsesse ja äriloogikat kavandada. "}, {"en": "5. Explain blockchain features for the growth of the (impacted) industry. ", "et": "5. Blockchaini omadusi selgitada tööstuse kasvu kontekstis. "}, {"en": "Learning outcomes U4. Students will be able to ", "et": "Õppeüksuse 4 õpiväljundid. Õppurid on võimelised "}, {"en": "1. Engineer requirements and design the blockchain applications. ", "et": "1. Blockchaini rakenduse nõudeid määrata ning rakendust kavandada. "}, {"en": "2. Collect and formalise functional and non- functional requirements and to select the blockchain platform. ", "et": "2. Blockchaini platvormi funktsionaalseid ja mittefunktsionaalseid nõudeid määrata ja vormistada. "}, {"en": "3. Design and test existing blockchain based PoC. ", "et": "3. Kavandada ja testida prototööpi, mis põhineb olemasoleval plokiahelal. "}, {"en": "4. Develop and apply appropriate blockchain architecture.", "et": "4. Arendada ja kasutada sobivat blockchaini arhitektuuri."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}