{"uuid": "9f5973bb-4385-b9f8-3030-5debac27d2bf", "code": "LTAT.05.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "UX in Digital Products - Words and Visuals", "et": "Kasutajakogemus digitoodetes - sõnaline ja visuaalne disain"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "An introductory course to digital product creation with the main focus on linguistic and visual design. The visual design introduces graphic design and main principles in composition; linguistic design introduces the types of microcopy and its functions, how to write microcopy, and what should be known before starting writing. The first lectures of the course introduce the main principles of linguistic and visual design, information architecture, branding basics and user research principles. In the second part of the course, this knowledge will be put into practice by creating and testing a prototype.", "et": "Aines tutvustatakse digitoote loomisprotsesse, hoides põhifookust toote sõnalisel ja visuaalsel disainil. Antakse ülevaade graafilise disaini, kompositsiooni ja brändingu alustest ning keskendutakse pisitekstide liikidele ja funktsioonidele ning nende koostamisele. Aine esimese pooles tutvutakse sõnalise ja visuaalse disaini, infoarhitektuuri ning brändingu põhialuste ja kasutajauuringu põhivõtetega. Aine teises pooles liigutakse edasi praktilise poolega, kus pannakse kokku ja testitakse digitoote prototüüpi."}, "objectives": [{"en": "The course aims to give an understanding of the basic principles and work processes of creating digital products, focusing on user experience's word-based and graphic design.", "et": "Õppeaine eesmärgiks on tutvustada digitoote loomise protsessi - keskendudes eelkõige kasutajakogemuse sõnalise ja graafilise disaini põhimõtetele."}], "learning_outcomes": [{"en": "On the successful completion of the course, the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "knows the basic principles of linguistic and visual communication", "et": "teab sõnalise ja visuaalse kommunikatsiooni põhialuseid "}, {"en": "knows how to implement the basics of user research", "et": "tunneb kasutajauuringu meetodite põhivõtteid"}, {"en": "knows the basics of branding and connects them to product design", "et": "tunneb brändingu põhialuseid ja selle seoseid tootedisainiga"}, {"en": "knows the basics of information architecture", "et": "tunneb infoarhitektuuri põhialuseid"}, {"en": "uses the principle of graphic design in prototype creation", "et": "kasutab prototüübi valmistamisel graafilise disaini põhimõtteid "}, {"en": "writes best suited microcopy for the prototype, using the golden rules of UX writing", "et": "kirjutab prototüübi jaoks sobiva pisiteksti, järgides pisiteksti kirjutamise põhimõtteid "}, {"en": "knows testing methods for prototype and ready product", "et": "tunneb prototüübi ja valmistoote testimise meetodeid"}, {"en": "pinpoints and solves the paint points in the creation process of digital product", "et": "leiab ja lahendab digitoote loomisel ette tulevad kitsaskohad"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}