{"uuid": "d7718121-1048-43b5-54bb-0998ccdafc61", "code": "LTAT.01.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Communication in Estonian for Computer Science", "et": "Eestikeelne kommunikatsioon arvutiteaduses"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT01", "structural_unit_name": {"en": "Chair of Natural Language Processing", "et": "keeletehnoloogia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT01", "name": {"en": "Chair of Natural Language Processing", "et": "keeletehnoloogia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Composing materials in Estonian (test solutions, presentation slides, thesis). Language for specific purposes and practical language planning. Correct spelling of words, abbreviations, and numbers; correct spelling of names and appellations. Time planning to write research for a predicted time.", "et": "Ainekursusel keskendutakse eestikeelse lõputöö kirjutamise toetamisele. Üldisteks teemadeks on teadusteksti struktuur, allikakriitilisus, refereerimine ja viitamine (sh automaatne viitehaldus), tekstisidusus, erialainfootsing, oskussõnavara (sh tõlkeline), akadeemilise ettekande koostamine ja esitamine, populaarteaduslik tekst, tarbetekst. Kõik kursusel tehtavad iseseisvad tööd on seotud lõputöö teemaga: refereeriv tekst kirjutatakse ühe alateema kohta, andmebaasidest otsitakse bakalaureusetöö jaoks sobivaid allikaid, akadeemiline ettekanne valmistab ette kaitsekõneks. Lisaks koostavad tudengid ajakava oma uurimistöö tegemiseks. \nOrtograafia teemad on põimitud teiste teemade sisse ja neid käsitletakse läbivalt."}, "objectives": [{"en": "The course prepares students for independent reserach. They study and learn to read topic-related special literature critically. They learn to devise a  plan and time scedule for the course's exercises and to follow it. \nThe main focus is on to polish students' spelling and usage skills, assisting students in  their research as well as to give them regular feedback  on their work in progress:", "et": "Kursus on esimene etapp lõputöö kirjutamisel ja valmistab üliõpilasi ette iseseisvaks uurimistööks. Tudengid õpivad tundma ja kriitiliselt lugema teemaga seonduvat erialakirjandust. Õpivad tundma lõputöö ülesehituse ja vormistuse peensusi. Õpivad koostama lõputöö plaani ja ajakava ning seda järgima. Läbi praktiliste harjutuste  tõstetakse tudengite eneseväljendusoskuseid, mis aitaks neid nii akadeemilises keskkonnas, kui ka oleks abiks tööjõuturul. Harjutustele antakse regulaarset tagasisidet."}], "learning_outcomes": [{"en": "The student is able to\ncompile a well-written and correct text; correct his or her mistakes, if necessary; see the differences between standard language and special professional usage, scientific language and scientific jargon;\nuse the main sources of practical language planning (dictionaries, handbooks, websites, databases etc); create a research writing schedule; prepare the research for a specified time.", "et": "Kursuse läbinud üliõpilased\n- mõistavad eneseväljendusoskuse tähtsust (sh lõputöö koostamisel ning esitamisel),\n- teavad põhilisi reaalteaduste üliõpilaste kirjalikes töödes esinevaid õigekeelsusprobleeme ning oskavad neid vältida,\n- teavad teadusliku ning populaarteadusliku teksti erinevusi,\n- koostavad uurimistöö plaani ja ajakava ning järgivad seda, reflekteerivad oma tööprotsessi üle,  teevad koostööd juhendajaga ja kaasüliõpilastega; \n- tunnevad avaliku esinemise ja esitluse koostamise head tava,\n- on analüüsinud oma lõputöö eesmärkide püstitamise ning valdkonna ülevaate koostamise keelelist ja sisulist korrektsust,\n- tunnevad informaatika eriala lõputööde vormistusnõudeid,\n- on alustanud oma lõputöö kirjutamist."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}