{"uuid": "6cc41fdf-d4c7-dcfd-5b21-4466ebce57c3", "code": "LTAT.05.023", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research Seminar in Software Engineering", "et": "Tarkvaratehnika uurimisseminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "* Systematic study of software engineering and information systems literature on a given topic (agreed with MSc thesis supervisor)\n* Development, reporting and discussing of research designs on a given topic (agreed with MSc thesis supervisor)\n* Presentation and discussion of literature summaries and research designs on a given topic (agreed with MSc thesis supervisor)", "et": "* Kirjanduse süstemaatiline läbitöötamine etteantud tarkvaratehnika ja infosüsteemide teemal (kokku lepitud magistritöö juhendajaga)\n* Uurimiskava arendamine, aruandlus ja diskussioon ette antud teemal (kokku lepitud magistritöö juhendajaga)\n* Etteantud teema kirjanduskokkuvõtte ja uurimiskava tutvustus ja arutelu (kokku lepitud magistritöö juhendajaga)"}, "objectives": [{"en": "This seminar will cover advanced topics in the field of software engineering. Students will engage in active learning by reading academic and industry papers on various topics in the field, presenting these papers to the class, and participating in focused discussions. In addition, students will present research designs of their master theses and discuss it in-class.", "et": "See seminar hõlmab tarkvaratehnika kaasaegseid teemasid. Üliõpilased on õppimisprotsessi aktiivselt haaratud, lugedes valdkonna akadeemilisi ja tööstusalaseid artikleid erinevatel teemadel, tutvustades neid kursusekaaslastele ja osaledes fokusseeritud aruteludes. Lisaks esitavad üliõpilased oma magistritöö kavandi, ja arutavad seda seminaris."}], "learning_outcomes": [{"en": "On successful completion of this course, students are able to:", "et": "Kursuse edukalt läbinud üliõpilased:"}, {"en": "1. Collect, analyze and present information about advanced topics in the field of software engineering in a structured manner.", "et": "1. Koguvad, analüüsivade ja esitavad teavet tarkvaraarenduse teemadel struktureeritud viisil."}, {"en": "2. Develop, present and discuss a research design on a specific topic in the field of software engineering and information systems.", "et": "2. Arendavad, tutvustavad ja arutavad teadustegevuse kavandit etteantud tarkvaratehnika ja infosüsteemide valdkonna teemal."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}