{"uuid": "8cfaa13c-59a7-c871-1a2e-7719f6f3ae77", "code": "LTAT.03.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Verified Functional Algorithms", "et": "Kontrollitud funktsionaalsed algoritmid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT03", "structural_unit_name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT03", "name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "We use material from \"The Software Foundations\" series Volume 1: \"Logical Foundations\" and Volume 3: \"Verified Functional Algorithms\". Volume 1 is an intro to Coq and logic and Volume 3 deals with Verified Functional Algorithms.\n\nList of chapters/topics: \"Logical Foundations\": Basics, Induction, Lists, Polymorphism, Tactics, Logics in Coq, Inductively defined Propositions, Maps, Simple Imperative Programs, More Automation. \"Verified Functional Algorithms:: Basic Techniques for Permutations and Ordering, Insertion sort, Insertion Sort With Multisets, Selection sort, Search trees, Abstract data types, Runninc Coq programs in ML, Red-Black trees, Number Representations and Efficient Lookup Tables, Priority Queues, Binomial Queues, Programming with Decision Procedures", "et": "Kursus toimub \"Software Foundations\" materjalide põhjal, kus kaetakse Volume 1: \"Logical Foundations\" ja Volume 3: \"Verified Functional Algorithms\". Esimene raamat katab Coq-i algõpet ja loogika aluseid, teine tegeleb algoritmide korrektsuse tõestamisega. \n\nPeatükkide/teemade loetelu: \"Logical Foundations\": Basics, Induction, Lists, Polymorphism, Tactics, Logics in Coq, Inductively defined Propositions, Maps, Simple Imperative Programs, More Automation. \"Verified Functional Algorithms\": Basic Techniques for Permutations and Ordering, Insertion sort, Insertion Sort With Multisets, Selection sort, Search trees, Abstract data types, Runninc Coq programs in ML, Red-Black trees, Number Representations and Efficient Lookup Tables, Priority Queues, Binomial Queues, Programming with Decision Procedures"}, "objectives": [{"en": "Provide students with:", "et": "Anda tudengitele:"}, {"en": "a) a better understanding of formal proofs,", "et": "a) parem arusaam formaalsetest tõestustest,"}, {"en": "b) practical ability to prove something in Coq,", "et": "b) praktiline oskus Coq-iga midagi tõestada,"}, {"en": "c) understanding of the difficulties of correctness proofs of algorithms,", "et": "c) arusaam koodi korrektsuse tõestamise keerukusest ja"}, {"en": "d) practical experience of writing verified functional algorithm", "et": "d) praktiline kogemuse kontrollitud algoritmide kirjutamisest."}], "learning_outcomes": [{"en": "A student, that has completed the course:", "et": "Kursuse läbinud tudeng:"}, {"en": "a) knows common concepts of logic and proving,", "et": "a) teab loogika ja tõestamise põhilisi mõisteid,"}, {"en": "b) is able to understands the meaning of propositions written in Coq,", "et": "b) saab aru Coq süsteemis kirjutatud väidete sisust,"}, {"en": "c) can prove simple propositions in Coq, and", "et": "c) oskab Coq-is tõestada lihtsaid väiteid,"}, {"en": "d) can write simple verified functional algorithms.", "et": "d) oskab kirjutada lihtsaid kontrollitult korrektseid funktsionaalseid algoritme."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}