{"uuid": "f4a581fe-551f-a34a-41e0-a83587d6f720", "code": "LTAT.00.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-24T11:05:39", "title": {"en": "Master's Thesis Seminar", "et": "Magistritöö seminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT", "structural_unit_name": {"en": "Institute of Computer Science", "et": "arvutiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT", "name": {"en": "Institute of Computer Science", "et": "arvutiteaduse instituut"}, "email": "unitartucs@ut.ee", "phone": "+372 737 5445", "webpage_url": "https://cs.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "1. Overview University of Tartu Institute of Computer Science graduation theses requirements and criteria;\n2. Selection of the research topic and preparation of a work plan;\n3. Recommendations for Estonian-language academic writing;\n4. Instructions for completing a literature review;\n5. The use of citations and references; quotations and summaries, citation systems;\n6. Plagiarism, the causes of plagiarism and prevention of it with the help of electronic plagiarism detection methods;\n7. Introducing one's topic at a discussion seminar together with getting and giving feedback;\n8. Representation of the main content and respective visualisations\n9. Instructions for making a good defence presentation;\n10. Pre-defence rehearsal together with giving and receiving feedback.", "et": "1. Ülevaade TÜ Arvutiteaduse instituudi kaitstavate lõputööde nõuetest ja kriteeriumitest, protsessist ja hindamisest;\n2. Uurimustöö teema valik ja tööplaani koostamise juhised;\n3. Eestikeelse akadeemilise teksti kirjutamise soovitusi;\n4. Kirjandusülevaate koostamise juhised;\n5. Kirjandusallikate kasutamine ja viitamine; tsiteerimine ja refereerimine, viitamissüsteemid;\n6. Plagiaat, plagiaadi põhjused ja vältimine ning plagiaadituvastuse elektroonsed vahendid;\n7. Oma teema tutvustamine aruteluseminaril ning tagasiside saamine ja andmine;\n8. Töö põhisisu, jooniste ja tulemuste esitamine\n9. Hea esinemine Juhiseid hea kaitsmisettekande tegemiseks;\n10. Proovikaitsmiste läbiviimine ning tagasiside andmine ja saamine."}, "objectives": [{"en": "The aim of the course is to develop the knowledge on master thesis writing requirements and criteria at the Institute of Computer Science; to get an overview of possible research methodologies; help resolving possible questions arising during the thesis writing; to learn the terms and the language connected to the speciality; to learn using efficiently the language maintenance related resources; to develop critical attitude towards text creation; to practice presentation skills for the defence of the master thesis; to learn on how to get and how to give feedback to work by fellow students.", "et": "Kursuse eesmärk on arendada magistritöö ja lõputöö projekti koostajate teadmisi TÜ Arvutiteaduse instituudis kaitstavate lõputööde nõuete ja kriteeriumite osas; saada ülevaade võimalikest uurimustöö läbiviimise metoodikatest; aidata lahendada võimalikke magistritöö ettevalmistamisel ja kirjutamisel esilekerkivaid küsimusi; tutvuda erialakeelega, õppida akadeemilist eneseväljendust, õppida tõhusalt kasutama keelehooldeallikaid; arendada kriitilist suhtumist oma tekstiloomesse; harjutada esinemisoskust edukaks magistritöö kaitsmiseks; õppida andma ja saama tagasisidet enda ja kaasüliõpilaste tööle."}], "learning_outcomes": [{"en": "After passing the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1) has the basic and background knowledge for performing a successful research;", "et": "1) omab vajalikke põhi- ja taustateadmisi edukaks uurimustöö läbiviimiseks;"}, {"en": "2) can justify the choice of the methodology for one's master thesis and to perform an analysis;", "et": "2) oskab enda magistritöö metoodika valikut põhjendada ja analüüsi läbi viia;"}, {"en": "3) is able to bring out basics for good master's thesis writing (structuring, spelling, referencing and citing, writing up the thesis);", "et": "3) oskab tuua välja hea magistritöö kirjutamise põhitõed (töö struktureerimine, õigekiri, viitamine ja refereerimine, magistritöö vormistamine);"}, {"en": "4) is able to describe several ways of giving and receiving feedback and corresponding best practices;", "et": "4) suudab kirjeldada mitmeid tagasiside andmise ja saamise viise ja paremaid praktikaid;"}, {"en": "5) can describe the characteristics of a good presentation of the thesis at defence.", "et": "5) suudab kirjeldada hea kaitsmisettekande omadusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}