{"uuid": "38ec1a5d-c470-f23b-3313-fbc28549e438", "code": "LTAT.01.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Information Retrieval: How do Web Search Engines Work", "et": "Informatsiooni otsimine: Kuidas veebiotsingumootorid töötavad"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT01", "structural_unit_name": {"en": "Chair of Natural Language Processing", "et": "keeletehnoloogia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT01", "name": {"en": "Chair of Natural Language Processing", "et": "keeletehnoloogia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course covers traditional and advanced techniques for building text-based information retrieval  systems (also called Search Engines). This includes the following topics: indexing, classical retrieval models (boolean, vector space, probabilistic and language models), learning-based ranking algorithms (i.e., learning-to-rank), retrieval evaluation, advanced topics such as neural IR & personalization. Also, it includes hands-on experience with pyTerrier for building declarative information retrieval pipelines, and conducting experiments using state-of-the-art neural ranking models.", "et": "See kursus hõlmab traditsioonilisi ja täiustatud tehnikaid tekstipõhiste teabeotsingusüsteemide (nimetatakse ka otsingumootoriteks) ehitamiseks. See hõlmab järgmisi teemasid: indekseerimine, klassikalised otsimismudelid (boolean, vektorruum, tõenäosus- ja keelemudelid), õpipõhised järjestusalgoritmid (st õppimine-to-rank), otsingute hindamine, täiustatud teemad nagu närvi IR & isikupärastamine. Samuti sisaldab see praktilisi kogemusi pyTerrier ehitada deklaratiivne info hankimise torujuhtmed, ja viia läbi eksperimente kasutades state-of-the-art närvi pingerida mudelid."}, "objectives": [{"en": "This course focuses on introducing the basic concepts, the formal models, and the main techniques to define and design Information Retrieval Systems (also called Search Engines, and in particular Web Search Engines when working on the Web to the aim of retrieving Web pages).", "et": "See kursus keskendub põhimõistete tutvustamisele, formaalsetele mudelitele ja põhitehnikatele, et määratleda ja kujundada teabe hankimise süsteeme (nimetatakse ka otsingumootoriteks, eriti veebiotsingumootoriteks, kui töötate veebis, et leida veebilehti)."}], "learning_outcomes": [{"en": "After compliting the course, a student: \n -  will be familiar with the working principles of search engines.\n- will be familiar with traditional information retrieval approaches as well as advanced topics (neural IR & personalization).\n- can build declarative information retrieval pipelines, and conduct experiments using state-of-the-art neural ranking models.", "et": "Pärast kursuse täitmist üliõpilane: - tutvub otsingumootorite tööpõhimõtetega.\n- tutvub traditsiooniliste teabe otsimise lähenemisviiside ja täiustatud teemadega (närvisüsteem ja isikupärastamine).\n- saab ehitada deklaratiivse teabe hankimise torujuhtmeid ja teha katseid, kasutades nüüdisaegseid närvijärjestusmudeleid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}