{"uuid": "30d2ee75-696f-35b5-62c4-82b8a74ea6ab", "code": "LTAT.03.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Digital Safety in Schools", "et": "Digiohutus koolis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT03", "structural_unit_name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT03", "name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "An overview of risks related to the use of the Internet and misuse of information security. Social problems in the digital world. Multi-step personal identification. Managing multiple virtual identities. Privacy settings. Increasing the security level on your computer. Cyberbullying and coping with it. Misuse of digital devices, addiction. Analysis of your digital behavior. Ergonomics when using digital devices. Health rules and exercises.", "et": "Tutvustatakse interneti kasutamisega seotud riskide, infoturbega väära rakendamisega seotud ohte, sotsiaalseid probleeme digimaailmas. Mitmeastmeline isikutuvastus. Mitme virtuaalse identiteedi haldamine. Privaatsusseaded. Turvaastme tõstmine arvutis. Küberkiusamine ja sellega toime tulemine. Digiseadmete väärkasutus, sõltuvus. Oma digikäitumise analüüs. Ergonoomika digiseadmete kasutamisel. Tervisekaitse reeglid ja harjutused."}, "objectives": [{"en": "To acquire knowledge, skills and willingness to safely use digital tools in teaching.", "et": "Omandada teadmised, oskused ja valmisolek kasutada ohutult digivahendeid oma õpetajatöös."}], "learning_outcomes": [{"en": "Student successfully passing the course:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "-knows and understands the risks associated with the use of the Internet (including computer addiction, cyberbullying) and is able to act in a given situation;", "et": "-teab ja mõistab interneti kasutamisega seonduvaid riske (s.h arvutisõltuvust, küberkiusamist) ning oskab vastavas olukorras käituda;"}, {"en": "-manages and protects its digital identity like, using multi-level personal identification, configuring social media or other account privacy settings;", "et": "-haldab ja kaitseb oma digitaalset identiteet s.h kasutades mitmeastmelist isikutuvastust, mõistab sotsiaalmeedia vms konto privaatsusseadete häälestamise vajadust;"}, {"en": "-knows security risks associated with smart devices;", "et": "-omab ülevaadet nutiseadmetega seotud turvariskidest;"}, {"en": "-implements primary security techniques to protect her/his computer and smart devices;", "et": "-rakendab esmaseid  turvameetmeid oma arvuti ja nutiseadme kaitseks;"}, {"en": "-describes and avoids the health risks of using a digital device (addiction, visual impairment etc.);", "et": "-kirjeldab ja väldib digivahendi kasutamisest tekkida võivaid ohte tervisele (sõltuvus, liigese- ja rühivead, nägemise halvenemine);"}, {"en": "-analyze how to take digital risks into their teaching work;", "et": "-analüüsib, kuidas arvestada digiohtudega oma õpetajatöös;"}, {"en": "-describes how to guide learners to behave safely in the digital world.", "et": "-kirjeldab, kuidas juhendada õppijaid digimaailmas ohutul käitumisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}