{"uuid": "83933866-6780-a4b8-04d9-3f002bf9746e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-27T15:51:42", "title": {"en": "Public Key Cryptography", "et": "Avaliku võtme krüptograafia"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTAT04", "name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}, "label": {"en": "25/26 A regular LT Eng", "et": "25/26 S PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT04", "structural_unit_name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 32, "practice": 32, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The aim of this course is to present traditional public key cryptosystems and quantum-safe lattice-based cryptosystems. In this course, we review public key cryptosystems based on integer factorization problem and discrete logarithm problem over different groups. We discuss the required algorithms to implement a public key cryptosystem. We give a discussion on solving the hard problems. We review post-quantum cryptography by focusing on lattices. We provide details for quantum-resistant encryption schemes, key encapsulation mechanisms, and digital signature schemes. \nThe course covers the following topics: integer factorization problem, RSA cryptosystem, discrete logarithm problem, Diffie-Hellman key exchange, how to solve integer factorization and discrete logarithm problem, elliptic curve cryptography, algorithms to implement RSA, Diffie-Hellman key exchange and ECDSA, introduction to post-quantum cryptography, lattice-based cryptography.", "et": "Kursuse eesmärk on tutvustada traditsioonilisi avaliku võtme krüptosüsteeme ja kvantkindlaid võrepõhiseid krüptosüsteeme. Sellel kursusel vaatleme avaliku võtmega krüptosüsteeme, mis põhinevad täisarvu faktoriseerimise probleemil ja diskreetse logaritmi probleemil erinevate rühmade lõikes. Arutame avaliku võtme krüptosüsteemi rakendamiseks vajalikke algoritme. Arutame raskete probleemide lahendamist. Vaatleme postkvantkrüptograafiat keskendudes võredele. Pakume üksikasju kvantkindlate krüpteerimisskeemide, võtmekapseldamise mehhanismide ja digitaalallkirja skeemide kohta.\nKursusel käsitletakse järgmisi teemasid: täisarvu faktoriseerimise probleem, RSA krüptosüsteem, diskreetse logaritmi probleem, Diffie-Hellmani võtmevahetus vahetus, täisarvu faktoriseerimise ja diskreetse logaritmi probleemi lahendamine, elliptilise kõvera krüptograafia, algoritmid RSA rakendamiseks, Diffie-Hellmani võtmevahetus ja ECDSA, sissejuhatus postkvantkrüptograafiasse, võrepõhisesse krüptograafiasse."}, "objectives": [{"en": "- The idea of public key cryptography will be defined. The discussion on why we need public key cryptography will be done with real-world examples.", "et": "- Määratletakse avaliku võtme krüptograafia idee. Arutelu selle üle, miks me vajame avaliku võtmega krüptograafiat, viiakse läbi reaalsete näidetega."}, {"en": "- Integer factorization and discrete logarithm problems will be given. The algorithms to solve these problems will be discussed.", "et": "- Esitatakse täisarvude faktoriseerimine ja diskreetse logaritmi ülesanded. Arutatakse nende probleemide lahendamise algoritme."}, {"en": "- Elliptic curves in cryptography will be reviewed.", "et": "- Vaadeldakse krüptograafias kasutatavaid elliptilisi kõveraid "}, {"en": "- The algorithms to implement traditional public key cryptosystems (RSA, DH, ECDSA, ECDH) will be reviewed. Implementation details will be discussed.", "et": "- Vaadeldakse traditsiooniliste avaliku võtme krüptosüsteemide (RSA, DH, ECDSA, ECDH) implementeerimise algoritme. Arutatakse rakendamise üksikasju."}, {"en": "- Quantum-safe cryptosystem families will be introduced. Lattice-based cryptosystems will be discussed. ", "et": "- Tutvustatakse kvantkindlaid krüptosüsteemide perekondi. Arutatakse võrepõhiseid krüptosüsteeme."}, {"en": "This course will involve reading and writing of mathematical proofs and programming. We will explain the necessary mathematical background in the course.", "et": "See kursus hõlmab matemaatiliste tõestuste lugemist ja kirjutamist ning programmeerimist. Vajaliku matemaatilise tausta selgitame kursusel."}], "learning_outcomes": [{"en": "-understand the basic concepts and importance of public key cryptography", "et": "-mõistma avaliku võtme krüptograafia põhimõisteid ja tähtsust"}, {"en": "-generate the parameter sets for the public key cryptosystems", "et": "-genereerima avaliku võtme krüptosüsteemide parameetrite komplekte"}, {"en": "-analyze and compare public key encryption, key exchange and digital signature schemes by considering the complexity and performance", "et": "-analüüsima ja võrdlema avaliku võtme krüptimise, võtmevahetuse ja digitaalallkirja skeeme, võttes arvesse keerukust ja arvutuslikult rasket probleemi"}, {"en": "-learn post-quantum cryptography standardization efforts for encryption, key exchange and signature schemes", "et": "-õppima tundma postkvantkrüptograafia standardimise jõupingutusi krüptimise, võtmevahetuse ja allkirjaskeemide jaoks"}, {"en": "-compare lattice-based cryptosystems in terms of security and performance.", "et": "-võrdlema võrepõhiseid krüptosüsteeme turvalisuse ja jõudluse osas."}], "notes": {}}, "grading": {"independent_work": {"et": "Details will be given at  https://courses.cs.ut.ee/2024/pkc/fall"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "30%  There will be a set of \"theory\" and/or \"implementation\" homework assignments."}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "40% In the project assignment, the student should write a research report and/or implement one of the given algorithms."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "30%"}}], "grade_preconditions": {"et": "Submission of homeworks and project before the deadline, and taking final exam."}, "grade_evaluation": {"et": "The final grade will be established based on homeworks, project and final exam.\nHomeworks 30% of the final grade\nProject \t     40% of the final grade\nFinal exam    30% of the final grade"}, "debt_elimination": {"et": "Upon agreement with the supervisor"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "b3465453-b992-c29f-239e-e3efbc498472", "person_name": "Sedat Akleylek", "structural_unit": {"code": "LTAT04", "name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}, "is_responsible": true, "is_teaching": true}], "assistants": ["fc441e0d-db5c-25e3-a315-f9f0bd127e6f"]}, "schedule": {"weeks": {"et": "1.-16. study week"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "First meeting, course organization, grading\n1.  \tFirst meeting, course organization, grading\nBasic primitives, definitions in public key cryptography (encryption, key encapsulation mechanism, identification schemes, digital signature)\n2.  \tDiscrete logarithm problem (DLP), Diffie-Hellman key exchange, ElGamal public key encryption\n3.  \tInteger factorization problem, RSA cryptosystem, primality testing\n4.  \tModular exponentiation algorithms, RSA and Chinese Remainder Theorem\n5.  \tAlgorithms for integer factorization problem\n6.  \tAlgorithms for DLP\n7.  \tAlgorithms for DLP \n8.  \tElliptic curve Diffie-Hellman key Exchange, elliptic curve digital signature algorithm (ECDSA) over prime fields, algorithms for ECDLP \n9.  \tReal-world examples of traditional public key cryptosystems\n10. Basic primitives and definitions in post-quantum cryptography, post-quantum families, computationally hard problems \n11.  Introduction to lattices, LLL algorithm and properties of LLL reduced basis, Regev cryptosystem\n12.  Lattice-based key encapsulation mechanisms (KEM) and their primitives\n13. Lattice-based signature schemes and their primitives\n14. Arithmetic operations (polynomial multiplication, matrix-vector product) for lattice-based cryptography\n15. Project presentations\n16. Project presentations"}}]}, "registration_info": {"audience": {"et": "Senior bachelor students in addition to M.Sc. and Ph.D. students."}, "min_students": 8}, "parent_uuid": "e97bad0b-7315-69e5-431d-d69a5b34d4da", "parent_code": "LTAT.04.017", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}