{"uuid": "8e73b7d8-027f-4769-376a-75d0d743bfc8", "code": "LTAT.02.023", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Explainable Automated Machine Learning", "et": "Seletatav automatiseeritud masinõpe"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT02", "structural_unit_name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT02", "name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Nowadays, machine learning techniques and algorithms are employed in almost every application domain (e.g., financial applications, advertising, recommendation systems, user be- havior analytics). In general, the process of building a high-quality machine learning model is an iterative, complex and time-consuming process that involves trying different algorithms and techniques in addition to having a good experience with effectively tuning their hyper-parameters. Thus, there was a crucial need for automating the process of building good machine learning models. In the last few years, several techniques and frameworks have been introduced to tackle the challenge of automating the process of Combined Algorithm Selection and Hyper-parameter tuning (CASH) in the machine learning domain. The main aim of these techniques is to reduce the role of human in the loop and fill the gap for non-expert machine learning users by playing the role of the domain expert. In this course, you will learn and understand the ideas behind state-of-the-art AutoML approaches.", "et": "Nüüdisajal on masinõppe süsteemid kasutusel pea igas valdkonnas, näiteks reklaaminduses ning kasutajakäitumise analüüsimises. Kõrgekvaliteetsete masinõppe süsteemide loomine on üldiselt iteratiivne, keeruline, ning ajakulukas protsess, mille käigus katsetakse erinevaid algoritme ning hüperparameetrite konfiguratsioone. Viimastel aastatel on tekkinud mitmed meetodeid ning raamistikke, mis proovivad efektiivselt lahendada CASH (Combined Algorithm Selection and Hyper-parameter tuning) probleemi. Raamisteke eesmärgiks on vähendada inimese rolli süsteemide loomisel, pakkudes masinõppe võhikule domeenieksperdi funktsionaalselt. Lisaks eelpoolmainitule tutvustab see kursus ka tipptasemel AutoML algoritme."}, "objectives": [{"en": "The objective of this course is to introduce students to the topic of explainable automated machine learning, presenting its main concepts, categorization, optimization techniques and applications. The course will cover different approaches and meta-systems, that automate the process of obtaining well-performing machine learning pipelines, so-called Automated Machine Learning (AutoML). These AutoML systems allow for faster development of off-the-shelf machine learning methods that would require less expert knowledge. This course will cover the state-of-the-art AutoML frameworks, as well as techniques for improving the transparency and explainability of AutoML systems, increasing trust in AutoML tools as well as generating valuable insights into otherwise opaque optimization processes.", "et": "Aine eesmärgiks on tutvustada õpilastele seletatava automatiseeritud masinõppe (explainable automated machine learning) põhikontsepte, optimeerimise meetodeid ning nende rakendamis valdkondi. Kursuse käigus tutvustatakse mitmed meetodeid ning meta süsteeme, mille rakendamisel saab luua hästi toimivaid masinõppe süsteeme, mis ei vaja toimimiseks valdkonna spetsiifilisi teadmisi. Kursuse käigus tutvustatakse automatiseeritud masinõppe raamistikele lisaks ka meetodeid, millega saab masinõppe mudelite otsustusprotsessi seletada. Need kasutamine suurendab usaldust mudelite vastu ning annab väärtusliku ülevaadet nende toimumis loogika kohta."}], "learning_outcomes": [{"en": "On successful completion of this course, students should be able to:\n1. Demonstrate knowledge of the emerging AutoML techniques.\n2. Understand the various capabilities of explainability techniques to increase trust in the AutoML process.\n3. Identify possible design decisions and procedures in the application of ML. \n4. Evaluate the design decisions made.\n5. Implement efficient optimizers for AutoML problems, such as hyperparameter optimization.\n6. Increase the efficiency of AutoML via a multitude of different approaches.", "et": "Kursuse edukal lõpetamisel peaks tudeng suutma:\n1.    anda ülevaadet tärkavatest AutoML süsteemidest;\n2.    tunda erinevaid mudelite selgitamise süsteeme, nende kasutusvaldkondi ning piiranguid;\n3.    rakendada tipptasemel raamistike skaleerivate süsteemide ehitamiseks;\n4.    rakendada kvalitatiivseid ning kvantitatiivseid meetodeid erinevate AutoML süsteemide hindamiseks;\n5.    demonstreerida oskust ehitada keerulisi andmetöötluse süsteeme, mis saavad hakkama erinevat tüüpi andmete töötlemisega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}