{"uuid": "96966b34-ca03-67a1-f3b5-f4514a852b44", "code": "LTAT.04.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Wireless Technologies and Security", "et": "Juhtmevabad tehnoloogiad ja turvalisus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT04", "structural_unit_name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT04", "name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will briefly introduce students to wireless signals (frequencies, bandwidth, wavelength) and how they are transmitted and received. Students will learn how to use various hardware (HackRF, RTL-SDR, NFC reader, USB Wi-Fi receiver) and Software Defined Radio (GNU Radio). The course will cover different wireless communication protocols, analyse their security - different types of attacks and counter-measures. The homeworks will involve implementing exercises using Python.", "et": "Kursusel käsitleakse juhtmevaba andmeside tehnoloogia eripärasid (signaal, sagedus, ribalaius, lainepikkus) ja sinaali saatmist ning vastuvõtmist. Kursusel õpitakse kasutama erinevat riistvara (HackRF, RTL-SDR, NFC lugeja, USB Wi-Fi vastuvõtja) ja tarkvaraline raadio GNU Radio (Software Defined Radio). Kursus käsitleb erinevaid raadioside protokolle, analüüsib turvalisust ja teostab nende rünnet ning kaitset. Tudeng peab lahendama iseseisvaid koduseid ülesandeid Python programmeerimiskeeles."}, "objectives": [{"en": "To learn the basics of wireless technologies and communication protocols, and to get acquainted with the tools that can be used to assess security.", "et": "Kursuse eesmärk on õppida tundma, analüüsima ja kasutama juhtmevaba andmeside, andme-edastusprotokollide tehnoloogiaid ning traadita riistvara turvalisuse aspektist lähtuvalt."}], "learning_outcomes": [{"en": "Upon successful completion of this course, students should be able to: ", "et": "Peale kursuse edukat lõpetamist oskab tudeng: "}, {"en": "+ List and explain the main components of wireless communication  ", "et": "+ Nimetada ja seletada peamisi juhtmevaba andmeside mõisteid ja komponente "}, {"en": "+ Use software defined radio to inspect the radio spectrum ", "et": "+ Kasutada tarkvaralisi lahendusi raadioside spektri ja signaali analüüsiks "}, {"en": "+ Understand the most common weaknesses in wireless protocols ", "et": "+ Mõistab levinud turvalisuse nõrkusi ja probleeme juhtmevabas andmesides "}, {"en": "+ Create and implement attacks against wireless protocols and their implementations ", "et": "+ Läbi viia rünnet juhtmevabade andmeside lahenduste vastu "}, {"en": "+ Identify counter measures for some of the most common wireless attacks", "et": "+ Tuvastada ja soovitada kaitsemeetmeid levinud juhtmevaba tehnoloogia rünnete vastu"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}