{"uuid": "8273b28d-ddb3-5815-fcc9-3f83bafa7710", "code": "LTAT.03.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Functional Programming", "et": "Funktsionaalprogrammeerimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT03", "structural_unit_name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT03", "name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "bd2998eb-be1d-3e46-f80f-4f35adfbe43f", "code": "LTAT.03.001", "title": {"en": "Computer Programming", "et": "Programmeerimine"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Topics: introduction to a FP language, basic values and operations (including lists), higher order functions, types and (parametric) polymorfism, lazy evaluation and infinite structures, definition of data types, untyped lambda calculus, simply typed lambda calculus, Church's thesis, type inference, combinatory logic, type classes (ad hoc polymofism), monads and input/output, vectors and other dependent types.", "et": "Teemad: funktsionaalse programmeerimiskeele tutvustus, baasväärtused ja -operatsioonid (s.h. listid), kõrgemat järku funktsioonid, tüübid ja (parameetriline) polümorfism, laisk väärtustamine ja lõpmatud struktuurid, uute andmestruktuuride defineerimine, tüüpimata lambda arvutus, lihtsalt tüübitud lambda arvutus, Churchi tees, tüübituletus, kombinaatorloogika, tüübiklassid (ad hoc polümorfism), monaadid ja sisend-väljund, vektorid ja muud sõltuvad tüübid."}, "objectives": [{"en": "The goal of the course is to comprehensively introduce the functional programming paradigm and to explain its advantages and disadvantages compared to other paradigms. We give an overview of the theoretical foundations of functional programming.", "et": "Kursuse eesmärgiks on tutvustada põhjalikult funktsionaalse programmeerimise paradigmat ning selgitada selle eeliseid ja puudujääke võrreldes teiste paradigmadega. Anname ülevaate funktsionaalse programmeerimise teoreetilistest alustest."}], "learning_outcomes": [{"en": "On completion of the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "* is able to define the essential concepts of lambda calculus (expression, variable, application, abstraction, substitution, reduction, normal form, normal and applicative order reduction, free and bound variables) and analyze the corresponding programs", "et": "* oskab selgitada lambda arvutuse põhimõisteid (avaldis, muutuja, applikatsioon, abstaktsioon, substitutsioon, reduktsioon, normaalkuju, normaal- ja aplikatiivne reduktsiooni järjekord, vabad ning seotud muutujad) ning analüüsida vastavaid programme"}, {"en": "* is able to define the essential concepts of the functional programming (function, constructor, type, type family, kind, lazy- and strict evaluation)", "et": "* oskab selgitada funktsionaalse programmeerimise põhimõisteid (funktsioon, konstruktor, tüüp, tüübipere, liik, laisk ja agar väärtustamine)"}, {"en": "* is able to solve simple programming tasks using functional programming --- including understanding and being able to use higher-order polymorphic functions.", "et": "* oskab lahendada lihtsaid programmeerimise ülesandeid funktsionaalse programmeerimise abil; sealhulgas oskab kasutada kõrgemat järku polümorfseid funktsioone."}, {"en": "* is able to describe advantages and disadvantages of the functional paradigm.", "et": "* oskab kirjeldada funktsionaalse paradigma eeliseid ja puudusi"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}