{"uuid": "8f2142f8-d10f-7128-cfe7-2647e3a84293", "code": "LTAT.02.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Data Science", "et": "Sissejuhatus andmeteadusesse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT02", "structural_unit_name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT02", "name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course gives a brief overview of the basic concepts, principles and practice of data science. The main goal is to learn to plan and carry out a simple practical data science project. The course covers the main methods for descriptive data analysis and visualization, frequent pattern mining, cluster analysis, principal components analysis, common methods of machine learning for classification and regression (including deep neural networks), managing data and interpreting results of statistical tests. The main stages of data science projects are dicussed and available software tools reviewed. The homeworks are to be solved using the programming language Python 3 and its libraries.", "et": "Kursus annab lühiülevaate andmeteaduse põhimõistetest, põhiprintsiipidest ning praktilistest aspektidest. Lõppeesmärk on õppida planeerima ning läbi viima lihtsat praktilist andmeteaduse projekti. Kursus käsitleb peamisi andmete kirjeldava analüüsi ning visualiseerimise meetodeid, sagedaste mustrite otsimist, klasteranalüüsi, peakomponentanalüüsi, peamisi masinõppemeetodeid klassifitseerimise ja regressiooni jaoks (sealhulgas sügavaid neurovõrke), andmete haldamist ning statistiliste testide interpreteerimist. Tutvutakse andmeteaduse projekti põhiliste etappidega ning tarkvaraliste töövahenditega. Peamiseks töövahendiks Õpime projekti ellu viima baseerudes programmeerimiskeele Python teekidele. Kodutööde lahendamiseks on kasutusel programmeerimiskeel Python 3 ja selle teegid."}, "objectives": [{"en": "The main goal of the course is to get acquainted with the basic concepts and principles of data science and learn to carry out a simple practical data science project.", "et": "Kursuse eesmärk on tutvuda andmeteaduse põhimõistetega, põhiprintsiipidega ning õppida läbi viima lihtsat praktilist andmeteaduslikku projekti."}], "learning_outcomes": [{"en": "Upon successful completion of this course, students should be able to:", "et": "Kursuse läbinud üliõpilane on võimeline:"}, {"en": "- List and explain the main subfields, concepts and tasks of data science ", "et": "- Loetlema ning selgitama peamisi andmeteaduse alamvaldkondi, põhimõisteid ning põhiülesandeid"}, {"en": "- Perform a descriptive analysis of a given dataset", "et": "- Teostama etteantud andmestikul kirjeldavat analüüsi"}, {"en": "- Choose and implement appropriate visualisations for the data", "et": "- Valima ning teostama andmestikule sobivaid visualiseeringuid"}, {"en": "- Apply common clustering methods and interpret the results", "et": "- Rakendama tavalisemaid klasterdusmeetodeid ning tõlgendama nende tulemusi"}, {"en": "- Choose and apply basic machine learning algorithms to build predictive models for classification and regression", "et": "- Valima ja rakendama lihtsamaid masinõppe algoritme, et luua ennustavaid mudeleid klassifikatsiooni ja regressiooni jaoks"}, {"en": "- Use basic evaluation methods to measure predictive performance of models obtained by machine learning", "et": "- Kasutama lihtsamaid hindamismeetodeid, et mõõta masinõppe abil saadud mudelite ennustusväärtust"}, {"en": "- Interpret the results from a statistical test", "et": "- Interpreteerima statistilise testi tulemusi"}, {"en": "- Plan and implement a simple practical data science project and produce a final report", "et": "- Plaanima ja teostama lihtsat praktilist andmeteaduse projekti ning koostama selle lõppraporti"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}