{"uuid": "137da697-e5a5-0fce-9653-f48226f3a3b3", "code": "LTAT.05.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Web Application Development", "et": "Veebirakenduste loomine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Teemad:\n* Multi-tier web architectures\n* Basic Web standards (HMTL, CSS, DHTML, JavaScript)\n* The underpinnings of the Web\n* Trends and state of art in Web development\n* Server-side development technology: (CGI, ISAPI, Java Server, web template systems, web application frameworks)\n* XML Technology (XML, Schema, DOM, XPath, XSLT)\n* Rich Internet Interfaces (Asynchronous Javascript and XML)\n* Secure Web development\n*How to create and maintain good web sites?\n\nThe students are expected to have elementary programming skills and experience with working with collaboration tools (especially revision management like Git). Prior knowledge of creation and development of relational database, and experience of development of multi-threading programs is beneficial but not crucial.", "et": "Teemad:\n* Mitmekihiline arhitektuur\n* Põhilised veebistandardid (HMTL, CSS, JavaScript)\n* Veebi ülesehitus\n* Veebiarenduse suundumused ja hetkeseis\n* Serveripoolsed arendusvahendid ja tehnoloogiad  (CGI, ISAPI, Java Server, veebimustrite süsteemid, veebirakenduste raamistikud)\n* XML-tehnoloogia (XML, Schema, DOM, XPath, XSLT)\n* Rikkad internetiliidesed (asünkroonne Javascript ja XML)\n* Turvaline veebiarendus\n* Kuidas luua ja hooldada kvaliteetset veebisaiti?\n\nAinel osalejatelt oodatakse elementaarset programmeerimisoskust ja rühmatöövahendite (eriti versioonihaldusvahendid nagu Git) kasutamiskogemust. Abiks tulevad kuid hädavajalikud ei ole: relatsioonilise andmebaasi loomise ja arendamise oskus ja mitmelõimeliste rakenduste arendamise kogemus."}, "objectives": [{"en": "The goal is to introduce contemporary methods and techniques for developing web applications. The practical part of the course includes creating a multi-tier web application using XML and server- side web application development frameworks.", "et": "Eesmärgiks on tutvustada veebirakenduste loomist ning selleks kasutatavaid kaasaegseid tehnoloogiaid. Praktilises osas luuakse mitmekihiline veebirakendus, kasutades XML tehnoloogiat ning serveripoolseid veebi arendusraamistikke."}], "learning_outcomes": [{"en": "On successful completion of this course, students should be able to:", "et": "Kursuse läbinud üliõpilane "}, {"en": "1. Understand the principles of multi-tier Web information systems and how the presentation layer of these systems can be realized by appropriately combining client-side and server-side technology.", "et": "1. Tunneb mitmekililiste veebiinfosüsteemide ehitust ja omab ettekujutust, kuidas teostada taoliste süsteemide esitluskihti, selleks omavahel sobivalt kombineerides kliendi- ja serveripoolseid vahendeid."}, {"en": "2. Develop web applications using modern methods and technology.", "et": "2. On võimeline looma veebirakendusi moodsaid meetodeid ja tehnoloogiat kasutades."}, {"en": "3. Understand the principles of sustainable and user-centered design of web applications", "et": "3. On omandanud jätkusuutlike ning kasutajakesksete veebirakenduste loomise põhimõtted."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}