{"uuid": "c5672d2e-5d31-0c43-ff4d-c720245bb105", "code": "LTAT.02.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methods in Data Science", "et": "Andmeteaduse meetodid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT02", "structural_unit_name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT02", "name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course teaches to think like a data scientist. This includes understanding the scientific method of raising hypotheses and testing them, understanding the data in the probabilistic and statistical sense, as well as knowing the main steps within data science projects based on standard data science methodologies. Several case studies are visited to illustrate the methods and concepts of data science and to develop a mindset of a data scientist. Guest lectures are given by practitioners from industry, enterprises or public sector.", "et": "Käesolev kursus õpetab mõtlema nagu andmeteadlane. See hõlmab endas aru saamist hüpoteeside tõstatamisel ja kontrollimisel baseeruvast teaduslikust meetodist ning andmete mõistmist tõenäosuslikus ja statistilises mõttes, samuti andmeteaduse projektide põhisammude teadmist lähtuvalt standardsetest andmeteaduse metodoloogiatest. Käsitletakse mitmete juhtumite analüüse, et ilmestada andmeteaduse meetodeid ning mõisteid ning arendada andmeteadlase mõtteviisi. Külalisloenguid peavad tööstuse, ettevõtete või riigisektori praktikud."}, "objectives": [{"en": "The main objective of the course is to learn to think like a data scientist. This includes understanding the scientific method of raising hypotheses and testing them, understanding the data in the probabilistic and statistical sense, as well as knowing the main steps within data science projects based on standard data science methodologies.", "et": "Kursuse põhieesmärk on õppida mõtlema nagu andmeteadlane. See hõlmab endas aru saamist hüpoteeside tõstatamisel ja kontrollimisel baseeruvast teaduslikust meetodist ning andmete mõistmist tõenäosuslikus ja statistilises mõttes, samuti andmeteaduse projektide põhisammude teadmist lähtuvalt standardsetest andmeteaduse metodoloogiatest."}], "learning_outcomes": [{"en": "After completing this course, the student can:", "et": "Kursuse edukal lõpetamisel oskab tudeng:"}, {"en": "* List and explain the main subfields, concepts and tasks of data science;", "et": "* Loetleda ning lahti seletada andmeteaduse põhilised alamvaldkonnad, mõisted ning ülesanded;"}, {"en": "* Run a data science project, following the standard data science methodology CRISP-DM, and can explain why each of the activities is necessary;", "et": "* Läbi viia andmeteaduslikku projekti järgides andmeteaduse metodoloogiat CRISP-DM ning oskab selgitada iga tegevuse vajalikkust;"}, {"en": "* Perform descriptive data analyses, including calculation of summary statistics, performing clustering, dimensionality reduction, outlier detection, and basic statistical hypothesis tests;", "et": "* Läbi viia kirjeldavat andmeanalüüsi, seejuures arvutada kokkuvõtvaid statistikuid, klasterdada, vähendada dimensioone, tuvastada jaotusväliseid punkte ning kontrollida lihtsaid statistilisi hüpoteese;"}, {"en": "* Explain the principles of the scientific method, and can identify what data should be collected to test a given hypothesis;", "et": "* Selgitada teadusliku meetodi põhimõtteid ning teha kindlaks, milliseid andmeid on vaja etteantud hüpoteesi kontrollimiseks;"}, {"en": "* Explain the main elements of probability and statistics (joint, conditional and marginal probability distributions, hypothesis testing, statistical estimators, bias, variance, confidence intervals, causal and non-causal dependencies, probabilistic graphical models, signal and noise) and can explain the meaning of these concepts on a particular data set and analysis;", "et": "* Selgitada tõenäosuse ja statistika põhielemente (ühine, tinglik ning marginaalne tõenäosusjaotus, hüpoteeside kontrollimine, statistiline hindamine, nihe, dispersioon, usaldusintervallid, põhjuslikud ning mitte-põhjuslikud sõltuvused, tõenäosuslikud graafilised mudelid, signaal ja müra) ning selgitada nende mõistete tähendust konkreetsel andmestikul ning analüüsil;"}, {"en": "* Perform an analysis to quantify how many data are needed to obtain convincing evidence to support a hypothesis;", "et": "* Läbi viia analüüsi, mis mõõdaks kui palju andmeid on vaja, et saada kokku veenev tõendusmaterjal hüpoteesi toetuseks;"}, {"en": "* Explain the role of data science in decision making.", "et": "* Selgitada andmeteaduse rolli otsuste tegemisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}