{"uuid": "9a5c107f-2f34-2fdd-856a-ef7370e35d41", "code": "LTAT.05.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-23T11:45:50", "title": {"en": "Human-Computer Interaction", "et": "Inimese ja arvuti interaktsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Topics covered by the course include: Human perception, memory and processing; input and output devices and controls; user interface basics; UI and UX design and evaluation processes; methods of UI and UX design; methods of UI and UX evaluation; design thinking and creativity; prototyping; selected topics from the field.", "et": "Kursus hõlmab järgmiseid teemasid: Inimese taju, mälu ja töötlemine; sisend- ja väljundseadmed ja -kontrollid; kasutajaliidese põhitõed; kasutajaliideste ja kasutajakogemuse disaini- ja hindamisprotsessid; kasutajaliideste ja kasutajakogemuse disaini meetodid; kasutajaliideste ja kasutajakogemuse hindamise meetodid; disainmõtlemine ja loovus; prototüüpimine; valikteemad."}, "objectives": [{"en": "This course will introduce students to the fundamentals of Human Computer Interaction with a focus on identifying and deploying methods for interface and experience design, development and evaluation. It will also provide them with insights into topics beyond traditional desktop interfaces.", "et": "Aines tutvustatakse tudengitele inimese ja arvuti interaktsiooni põhialuseid keskendudes kasutajaliideste ja kasutajakogemuse kavandamise, arenduse ja hindamise meetodite tutvustamisele ja rakendamisele. Teemade käsitlus katab kasutajaliideseid tavapärastest töölauarakendustst laiemalt."}], "learning_outcomes": [{"en": "On successful completion of this course, students will able to:", "et": "Kursuse eduka läbimise järel on tudengid võimelised:"}, {"en": "1.\tUnderstand the basics of human perception, memory and information processing.", "et": "1.\tmõistma inimese taju, mälu ja informatsiooni töötlemise põhitõdesid;"}, {"en": "2.\tUnderstand the basics of computer input and outputs devices along principles of UI and UX design.", "et": "2.\tmõistma arvuti sisend- ja väljundspetsiifikaid lähtuvalt kasutajaliideste ja kasutajakogemuse disaini põhimõtetest;"}, {"en": "3.\tIdentify and deploy suitable methods to identify user needs and turn them into interface concepts", "et": "3.\tleidma ja rakendama sobivaid meetodeid kasutajate vajaduste kindlakstegemiseks ja nende teisendamiseks kasutajaliidese kontseptsiooniks;"}, {"en": "4.\tTurn concepts into prototypes.", "et": "4.\tlooma kontseptsiooni põhjal kasutajaliidese prototüüpe;"}, {"en": "5.\tIdentify and deploy suitable methods to evaluate user interfaces and iteratively improve them.", "et": "5.\tleidma ja rakendama kasutajaliideste hindamiseks sobivaid meetodeid ning iteratiivselt parandusi-täiendusi tegema."}, {"en": "6.\tGain an understanding of interfaces beyond traditional desktop UIs.", "et": "6.\tMõistma tavapärastest töölauarakendustest erinevaid kasutajaliideseid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}