{"uuid": "3a6baaba-2c99-eae8-6b70-f20b93fa1db5", "code": "LTAT.06.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Autonomous Vehicles Project", "et": "Isejuhtivate sõidukite projekt"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT06", "structural_unit_name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT06", "name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "An applied project in the form of participation in an autonomous-vehicles competition. Or a research project in the domain of autonomous vehicles, agreed upon with supervisor.", "et": "Rakendusprojekt isejuhtivate sõidukite võistlusel osalemiseks või uurimistöö isejuhtivate sõidukite valdkonnas, mis lepitakse kokku juhendajaga."}, "objectives": [{"en": "Autonomy, in the context of autonomous vehicles, is the ability of a vehicle to operate without the intervention of a human operator. Such vehicles constitute a very broad spectrum of shapes and sizes including, for instance, vacuum cleaning robots, automated guided vehicles (AGVs) operating on factory floors and warehouses, and robot taxis etc.", "et": "Autonoomsus on isejuhtivate sõidukite kontekstis sõiduki võime töötada ilma inimese sekkumiseta. Sellised sõidukid varieeruvad kuju ja suuruse poolest, sealhulgas näiteks robottolmuimejad, isejuhtivad sõidukid, mis toimetavad ladudes ning ka robottaksod jne."}, {"en": "The objective of the course is to give students knowledge in the area of autonomous vehicles, by participating in an autonomous-vehicles project. This can either be an applied project in the form of participation in an autonomous-vehicles competition, or a research project on an advanced sub-area of autonomous vehicles research.", "et": "Kursuse eesmärk on anda üliõpilastele teadmisi osaledes isejuhtivate sõidukite projektis. Projektiks võib olla kas rakendus, millega osaletakse isejuhtivate sõidukite võistlusel, või isejuhtivate sõidukite teadusuuringute alamvaldkonna uurimistöö."}], "learning_outcomes": [{"en": "Upon completion of the course a student will be able to:", "et": "Õppeaine läbinud õpilane on võimeline:"}, {"en": "I.\tuse a systematic approach for an applied or research project.", "et": "I.\tkasutama rakendus- või uurimisprojekti jaoks süstemaatilist lähenemist."}, {"en": "II.\tplan the project with appropriate milestones and timeline. ", "et": "II.\tkavandama projekti vastavalt eesmärkidele ja ajakavale. "}, {"en": "III.\twork and interact with the supervisor and team members. ", "et": "III.\ttöötama koostöös juhendaja ja meeskonnaliikmetega."}, {"en": "IV.\treport the findings in written form and communicate them orally.", "et": "IV.\tkoostama tulemustest kirjaliku raporti ja esitama seda suuliselt."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}