{"uuid": "e9d485f0-240e-2048-f36e-dcace8ba4c1f", "code": "LTAT.06.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Trustworthy AI", "et": "Usaldusväärne tehisintellekt"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT06", "structural_unit_name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT06", "name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Every day, we rely on AI-made decisions. But how do we know which ones to trust? Discriminating, opaque, and vulnerable AI systems are a risk for their owners and users. Every business using AI must know how to make it trustworthy.", "et": "Iga päev toetume tehisintellekti tehtud otsustele. Aga kuidas me teame, milliseid usaldada? Diskrimineerivad, läbipaistmatud ja haavatavad AI-süsteemid kujutavad endast ohtu nende omanikele ja kasutajatele. Iga tehisintellekti kasutav ettevõte peab teadma, kuidas see usaldusväärseks muuta."}, "objectives": [{"en": "-To identify AI's role in shaping our society, environment, markets, and democracy", "et": "Teha kindlaks tehisintellekti roll meie ühiskonna, keskkonna, turgude ja demokraatia kujundamisel"}, {"en": "-To evaluate whether an AI system has possible biases that should be accounted for", "et": "Kas tehisintellekti süsteemil on võimalikke kõrvalekaldeid, millega tuleks arvestada"}, {"en": "-To evaluate whether explainability is a requirement for an AI application and understand the various approaches for it", "et": "Kas seletatavus on AI-rakenduse nõue, ja mõista selle erinevaid lähenemisviise"}, {"en": "-To assess  the potential security and privacy risks of AI systems and remember the main legal obligations", "et": "Tehisintellektisüsteemide võimalikke turva- ja privaatsusriske ning meeles pidada peamisi juriidilisi kohustusi"}], "learning_outcomes": [{"en": "-Understand AI's role in shaping our society, environment, markets, and democracy", "et": "- Mõista tehisintellekti rolli meie ühiskonna, keskkonna, turgude ja demokraatia kujundamisel"}, {"en": "-Evaluate whether an AI system has possible biases that should be accounted for", "et": "- osata hinnata, kas tehisintellekti süsteemil on võimalikke kõrvalekaldeid, millega tuleks arvestada"}, {"en": "-Evaluate whether explainability is a requirement for an AI application and understand the various approaches for it", "et": "- osata hinnata, kas tehisintellekti rakenduse puhul on seletatavus nõutav ja  selle erinevaid lähenemisviisid"}, {"en": "-Understand the potential security and privacy risks of AI systems and remember the main legal obligations", "et": "- mõista tehisintellektisüsteemide võimalikke turva- ja privaatsusriske ning peamisi juriidilisi kohustusi"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}