{"uuid": "57ae97b7-04d9-1442-3d70-c0a273fea8c1", "code": "LTBI.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Molecular Systems Biology", "et": "Molekulaarne süsteemibioloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTBI", "structural_unit_name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTBI", "name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "webpage_url": "https://bioengineering.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "698d72e3-33f1-c5c5-34bd-0091c8a1401d", "code": "LTTI.00.008", "title": {"en": "Systems Biology", "et": "Süsteemibioloogia"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The interface between systems biology and synthetic biology will be thoroughly discussed.  The principle \"Build life to understand it\" will be analyzed and studied using specific examples.  Conventionally, biologists have sought to understand life as it exists. Increasingly, however, from stem-cell reprogramming to microbial factories, researchers are describing what is and exploring what could be. A large part of the course will be dedicated to theoretical introduction into the mathematical modeling methods for systems biology. This part will serve as groundwork for the following practical modeling course using MATLAB (\"Systems Modeling\" 4EAP).", "et": "Tutvustatakse ja arutatakes süsteemibioloogia ja sünteetilise biolooogia kokkupuutepunkte. Analüüsitakse printsiipi \"ehita elu, et elust aru saada\" ja tuuakse sellekohaseid spetsiifilisi näiteid. Kui tavaliselt on bioloogid uurinud elu nagu see eksisteerib, siis üha rohkem kirjeldavad teadlased süsteeme, mis võiksid eksisteerida, mida on võimalik disainida. Selline lähenemine on levimas paljudes suundades nagu näiteks tüvirakuteaduses ja mikroobsete rakuvabrikute alal. Suur osas kursusest on pühendatud teoreetilisele sissejuhatusele, et üliõpilasi ette valmistada praktiliseks kursuseks biomolekulaarsete süsteemide modelleerimise alal (\"Systems Modeling\" 4EAP)."}, "objectives": [{"en": "Specific examples of cutting edge studies from recent literature will be discussed with the aim to give the participants skills and ideas for designing their own interesting and competitive research projects in the field of systems biology. At this point the quantitative systems-level thinking about biomolecular systems should be galvanized in the student's minds, providing them an excellent basis for starting their master and doctorate projects.", "et": "Esitatakse ja arutatakse spetsiifilisi näiteid viimastest arengutest süsteemibioloogias eesmärgiga anda üliõpilastele oskusi ja ideid huvitavate ja konkurentsivõimeliste süsteemibioloogia alaste teadusprojektide väljaarendamiseks. Kursuse lõpuks peaks osalejatel olema kinnistunud kvantitatiivne süsteemi tasemel mõttemall, mis annab neile hea aluse biomolekulaarsete süsteemide uurimiseks magistri ja doktoriprojektide raames."}], "learning_outcomes": [{"en": "The course presents a more advanced approach as a subsequent step after the introductory course LTTI.00.008 Systems Biology (4 EAP).", "et": "Kursus pakub süvendatud käsitlust süsteemibioloogiast ja on sissejuhatavale kursusele LTTI.00.008 Süsteemibioloogia (4 EAP) järgnev edasijõudnute kursus."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}