{"uuid": "8656843a-d507-e0d3-3198-1b1f30556714", "code": "LTBI.00.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Systems Biology", "et": "Süsteemibioloogia"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTBI", "structural_unit_name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTBI", "name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "webpage_url": "https://bioengineering.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is introductory, specialist terms are largely avoided, focusing instead on several well-studied biological systems that concisely demonstrate key principles. \nThe course will present an integrated approach in which the quantitative experimental data from biochemical and cell biology research is used to create predictive models of cellular systems. Examples will be discussed to demonstrate how cell-level functions arise and why mechanistic knowledge of the biochemical systems allows us to predict behaviors leading to different cell fate decisions, and also to disease states and drug responses.", "et": "Tegemist on sissejuhatava kursusega, eritermineid püütakse vältida, keskendutakse põhiliselt läbiuuritud bioloogiliste süsteemide abil võtmeprintsiipide demonstreerimisele. Kursus pakub integreeritud lähenemist kasutades reaalseid kvantitatiivseid eksperimditulemusi rakusüsteemide ennustuslike mudelite loomisel. Tuuakse palju näiteid rakuliste funktsioonide kujunemisest ja õpetatakse kuidas biokeemiliste süsteemide mehhanismi tasemel mõistmine aitab ennustada rakulisi otsustusprotsesse, haigusolekuid ja ravimimõjusid."}, "objectives": [{"en": "The course builds a solid foundation for the intuitive understanding of general principles of biological systems. It encourages the students to ask why a system is designed in a particular way and then proceeds to answer with simplified models.", "et": "Kursus laob kindla alusmüüri biomolekulaarsete süsteemide üldprintsiipide mõistmiseks. Üliõpilasi õhutatakse mõtlema miks on süsteemid arenenud justnimelt sellisteks nagu me neid näeme. Samuti õpetatakse looma süsteeme kirjeldavaid lihtsustatud mudeleid."}], "learning_outcomes": [{"en": "Recent advances in technology have revolutionized biology enabling the collection of large sets of genomics, metabolomics and proteomics data. The new discipline of systems biology aims to meet the most important challenge of the 'post-omics' era: to understand the mechanisms of the biomolecular networks. The course presents the design principles of biological systems, and highlights the recurring circuit elements that make up biolomolecular networks. It provides a simple mathematical framework which can be used to understand and even design biological circuits.", "et": "Viimase aja tehnoloogilised arengud on toonud bioloogiasse revoltutsioonilisi muutusi, mida ilmestab suur hulk kogutud genoomi, metaboloomi ja proteoomi andmeid. Uus teadusharu, mida kutsutakse süsteemibioloogiaks püüab lahendada ühte suurimat \"pos-genoomse\" ajajärgu väljakutset: mõista biomolekulaarsete süsteemide mehhanisme. Kursus pakub ülevaate bioloogiliste süsteemide disainiprintsiipidest ja moodulitest, mis moodustavad biomolakulaarseid signaalivõrgustikke. Kursus pakub lihtsa matemaatilise lähenemistasandi, mille abil saab mõista ja disainida bioloogilisi võrgustikke."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}