{"uuid": "a469eff3-f793-ee1d-7496-0bb872e9f9fc", "code": "LTBI.00.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "iGEM", "et": "iGEM"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTBI", "structural_unit_name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTBI", "name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "webpage_url": "https://bioengineering.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "f0c7968b-fa2f-95f4-8b01-9fd67c1617f4", "code": "LTTI.00.002", "title": {"en": "Introductory Laboratory Course", "et": "Sissejuhatav laboritöö praktikum"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "During the course students participate in the Worlds biggest synthetic biology competion - iGEM. Participants will get experience in every step of scientific research, from hypothesis to analysis of results, from searching for sponsors to engaging general public in science. Students would learn how to work both independently and in a team. They improve their lab working skills, communacation skills, teamwork skills, learn how resaerch is done in the real-life conditions. The course end with the international conference where students present the resuls of their work.", "et": "Kursuse raames osalevad tudengid suurimas rahvusvahelises sünteetilise bioloogia võistluses iGEM. iGEMi jooksul saavad üliõpilased kastetada igast teadustööga seotud rolli: töötada laboris, kommunikeerida ja teha koostööd teiste teadlastega, populariseerida teadust, otsida rahandust, avaldada saadud tulemusi, esitada neid teaduskonferentsil."}, "objectives": [{"en": "The goal is to introduce the students to the scientific process, to try a researcher's role, planning of experiments, and critical reading of scientific literature; develop learning skills. Additionally the goal is to develop the ability to plan, to do and to present the research of different specialty field. Student gets the opportunity to be in the role of researcher. Participant learns to plan working time, arrnages meetings with supervisor(s), selects the most suitable research topic, gets experience and better understanding of the research work. Student learns how to study independently. Overall, the course help students improve the chances to find a good job after graduation.", "et": "Kursuse eesmärk on arendada tudengi õpimisoskust, lisaks anda võimalust tudengile proovida ennast teadustöötaja rollis. Õpetada plaaneerima oma aega, leppima kokku aja ja tegevusplaani projekti juhandajaga, valima endale sobivat uurimisteemat, töötada iseseisvalt. Eesmärk anda kursuse läbinud üliõpilasele ettekujutuse eksperimentaalse teadustöö iseloomust ja anda eelistuse tulevikus töö otsimisel peale ülikooli lõpetamist (tudeng omab eriala praktika kogemust)."}], "learning_outcomes": [{"en": "The course participant:", "et": "Kursuse läbinud õliõpilane:"}, {"en": "1) knows how to find necessary information in the scientific literature;", "et": "1)\tOskab otsida informatsiooni teadusartiklitest;"}, {"en": "2) is able to plan the working time;", "et": "2)\tOskab oma tööaega planeerida;"}, {"en": "3) is able to work in the lab both independently and in a team;", "et": "3)\tOskab töötada laboris iseseisvalt ja meeskonna koosseisus;"}, {"en": "4) is able to organise  scientific public event;", "et": "4)\tOskab organiseerida ja läbi viia teaduspopulariseerime üritust;"}, {"en": "5) is able to analyse the results of the experiments;", "et": "5)\tOskab analüüsida katsete tulemusi;"}, {"en": "6) is able to write scientific texts;", "et": "6)\tOskab kirjutada teadus teksti;"}, {"en": "7) is able to present the results of the work on the scientific conference;", "et": "7)\tOskab esitada teadustöö tulemusi teaduskonverentsil;"}, {"en": "8) is able to find funding for the project;", "et": "8)\tOskab otsida rahandust projekti teostamiseks;"}, {"en": "9) is able to design and program website that contain all the information about the project;", "et": "9)\tOskab disainida ja programeerida veebilehekülge, kus on olemas kogu projekti info;"}, {"en": "10) is able to cooperate with the other scientists and experts in the field;", "et": "10)\tOskab kommunitseerida teiste teadlastega ja organiseerida koostööd;"}, {"en": "11) has aquired the most up-to-date information and experience about the field of study, which enables to make the consent career desicion.", "et": "11)\tOn saanud parima ettekujutust teadustöö spetsifiikast, mis võimaldab teha kaalutud karjääri valikut."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}