{"uuid": "00338f2b-bc68-e1a3-6faf-e043a2bd0260", "code": "LTBI.00.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Synthetic Biology Lab II", "et": "Sünteetilise bioloogia praktikum II"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTBI", "structural_unit_name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTBI", "name": {"en": "Institute of Bioengineering", "et": "bioinseneeria instituut"}, "webpage_url": "https://bioengineering.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is divided into 4-5 subprojects. Every project will start with the in silico design of the genetic/protein circuits to be built with the aim to gain the desired biological function. This stage will be held separately, few weeks before the laboratory stage in order to order the synthetic DNA and other missing reagents. Each student will participate in at least two different projects. The list of the projects is subject to changes in each year depending on the progress and emerging new ideas.", "et": "Praktikum on jaotatud 4-5 alamprojektiks. Iga projekt algab geneetiliste/valgu signaalivõrgustike in silico disainiga, mille eesmärgiks on luua uus bioloogiline funktsioon. See esimene etapp viiakse läbi eraldi, mõned nädalad enne kursuse laboratoorse osa algust, et oleks aega tellida sünteetilne DNA ja vajaminevad reagendid. Iga üliõpilane osaleb vähemalt kahes alamprojektis. Projektide nimekiri muutub igal aastal vastavalt arengule ja uute ideede esilekerkimisele."}, "objectives": [{"en": "The course will provide the students the hands-on experience on a wide variety of laboratory techniques and protocols used in synthetic biology. Most importantly, the course enhances creative thinking in using the building blocks of genetic circuits and protein modules, and also seeds the engineering attitude towards biological systems. It also combines techniques from different disciplines, including electronics, biosensors, sustainable bioprocessing, organic synthesis etc.", "et": "Praktikum annab üliõpilastele otsese praktilise kogemuse erinevate sünteetilises bioloogias kasutatavate laboratoorsete meetodite ja protokollide alal. Peamine kursuse juures on see, et arendatakse loovat mõtlemist kasutades sünteetiliste bioloogiliste süsteemide disainiks geneetiliste signaalivõrgustike ja valgumoodulite aluselemente. Selline lähenemine ärgitab kasutama insenerimõtlemist bioloogiliste süsteemide kontekstis. Samuti kombineerib praktikum meetodeid erinevatest distsipliinidest nagu näiteks elektroonika, biosensorid, jätkusuutlik biotöötlus, orgaaniline süntees etc."}], "learning_outcomes": [{"en": "The aim of the lab is to guide the students through the entire creative cycle required for the design of synthetic biological systems with novel functions. The participants will go through all stages of the design-build-test process followed by analysis and interpretation of the outcome. The analysis stage provides new ideas for improving the performance of the designed cells, or even further, ideas for novel approaches and functions. In this way, the course can potentially evolve into continuously developing engineering projects, where the prototypes will be improved and further developed in each year.", "et": "Praktikumi eesmärgiks on juhatada üliõpilased läbi sünteetiliste bioloogiliste süsteemide disaini loomingulise tsükli. Proovitakse läbi kõik disain-konstrueerimine-testimine protsessi etapid, millele järgneb tulemuste analüüs ja interpreteerimine."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}