{"uuid": "451cbfa8-1995-d460-1905-f2d1d79b28a2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T15:39:09", "title": {"en": "Physics and Engineering", "et": "Füüsika ja tehnika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "25/26 A regular LT Eng", "et": "25/26 S PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 64, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course is targeted to the quick and efficient introduction of the main principles of the current physics (matter and field, fermions and bosons, absolute speed, energy minimum, etc.), whereas the previous knowledge in physics is not required. In most important cases, the examples are illustrated considering the application of the mathematical methods in physics (differentiation, integration, complex numbers). The students also learn to explain the operating principles of selected technical devices applying physical terminology in a correct way.", "et": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse vastavalt vajadusele markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud), taotlemata käsitluse üldist matemaatilist rangust. Üliõpilased õpivad ka seletama valitud tehniliste seadmete tööpõhimõtet, kasutades korrektselt füüsika termineid."}, "objectives": [{"en": "The main goal of the course is to introduce the role of physics in the generation of the individual's personal concept of the world and to explain the fundamental physical principles of modern technologies.", "et": "Tutvustada füüsika rolli indiviidi isikliku maailmapildi kujundamisel ja kaasaegse tehnoloogia füüsikalisi alusprintsiipe."}], "learning_outcomes": [{"en": "Upon completion of this course, the student should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Express the basic principles of the physical concept of the Nature (such as atomistic principle, energetic minimum, absolute speed, Pauli exclusion principle, wave-particle dualism, uncertainty principle), and refer to their exertion;", "et": "1. Oskab väljendada füüsikalise looduspildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;"}, {"en": "2. Possess the knowledge considering the mathematical background and calculus necessary for the description of physical processes (e.g., graphical representations, differentiation and integration, application of complex numbers), and recognize the main attributes and occurrence conditions of main functions present in physics (e.g., linear, power, exponent, harmonic);", "et": "2. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);"}, {"en": "3. Know the physical quantities describing the most important natural phenomena and properties including their abbreviations and measuring units; recognize the reasonable order of magnitude of physical quantities. ", "et": "3. Tunneb füüsikalisi suurusi, mis kirjeldavad olulisemaid loodusnähtusi ja loodusobjektide omadusi, sh nende suuruste tähiseid, SI mõõtühikuid ja ühikute tähiseid; teab nende füüsikaliste suuruste mõistlikke väärtuste vahemikke. "}, {"en": "4. Use the vocabulary introduced at the lectures to explain the basic principles of some high-tech devices applying physical terminology in a correct way;", "et": "4. Oskab loengute kavas toodud mahus selgitada valitud kõrgtehnoloogiliste seadmete tööpõhimõtet, kasutades korrektselt füüsika termineid."}, {"en": "5. Solve the physical problems within the limits of example exercises available via the web support of the course.", "et": "5. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "The students have to pass 4 tests. With four written tests during semester, a student can collect 70% of total points of final examination. The first two tests can give up to 15% and the last two tests as 20% of the final score, respectively."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "The rest 30% can be collected with the final written examination. In order to qualify for examination the student have collect at least 35 points from a sum of four tests (i.e., half or more of the possible 70 points). The positive completion of all the tests is not required in order to qualify for the examination; however, it will be required for full completion of the course."}}], "grade_preconditions": {"et": "With four written test during semester the student can collect 70 % of total points  of final examination. The first two tests accounts as a 15% and the last two test as a 20% of final examination, respectively. The rest 30 % can be collected with final written examination.   \nIn order to qualify for final examination the student have collect at least 35 % of points with four test. \nWith written exam the learning outcomes 2,3 and 4 will be tested."}, "grade_evaluation": {"et": "With four written test during semester, the student can collect 70% of total points of final examination. The first two tests can give up to 15% and the last two tests as 20% of the final score, respectively. The rest 30% can be collected with the final written examination. In order to qualify for examination the student have collect at least 35 points from a sum of four tests (i.e., half or more of the possible 70 points). The positive completion of all the tests is not required in order to qualify for the examination; however, it will be required for full completion of the course. The first test will assess the achievement of the 1st learning outcome and 3rd outcome from the aspect of mechanics and oscillations. The three last tests will assess achievement of the 5th learning outcome (physical problem solving ability). The  achievement of the 3rd learning outcome (physical quantities and their units) related to the chapters of electromagnetic field, optics and quantum mechanics will be assessed during the written examination. In order to get a positive final score, a student has to get over 50% in all four tests as well as in the each of the final exam tasks assessing achievement of the learning outcomes 2, 3 and 4. Those are the Functions task, the Physical Quantities task and the Engineering task. The additional oral part of the examination can be arranged for students who scored initially over 70% of the final score, in order to provide them a possibility for the improvement of the final result."}, "debt_elimination": {"et": "There will be two chances for passing each test during the semester and they do NOT depend on the time of performing the attempt. The students are invited to perform the some written test only if they are trained enough via the web-based system Moodle. In order to qualify for examination the students have collect at least 35 points from a sum of four tests during the semester (50% or more of the maximally possible 70 points). If the positive result of some outcome-assessing examination task is already reached, there is no need to do this task again. All the reached positive results are valid. On the next exam the student may confine only to the problems he/she failed on the previous one. All the students who are able to perform some outcome-assessing task are invited to show their ability immediately on the nearest examination day. If the only one or two learning outcomes remain negative (not reached) at the end of written examination period then the student can briefly complement his/her written task on the additional oral part of the exam to reach the positive final assessment. All the examination procedure ends before the start of the next semester and the students who have already remaining negative results of the outcome-assessing tasks have failed. They should repeat the course on the next year."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://sisu.ut.ee/pae/", "is_moodle_connected": false, "mandatory_materials": "Study aids at the websites \nhttps://moodle.ut.ee/course/view.php?id=4083  \nand  \nhttps://sisu.ut.ee/pae/", "recommended_materials": "D. Halliday, R. Resnick, J. Walker. Fundamentals of Physics. 5-th and later editions.\n5-th edition (1997) is available (up to 40 copies) in Physicum library at W. Ostwaldi Str. 1."}, "participants": {"lecturers": [{"person_uuid": "16785eed-74a3-7105-7d82-b2e8a4f709e4", "person_name": "Kalev Tarkpea", "structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "4e5e5137-f558-6c0a-d0d2-cc01955a668a", "person_name": "Sven Lange", "structural_unit": {"code": "LTFY08", "name": {"en": "Laboratory of Laser Spectroscopy", "et": "laserspektroskoopia labor"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "2769514b-4c15-d124-2428-49f971ab38f6", "person_name": "Veera Krasnenko", "structural_unit": {"code": "LTFY08", "name": {"en": "Laboratory of Laser Spectroscopy", "et": "laserspektroskoopia labor"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "8cc2b221-d526-79aa-e00d-63ee28be3354", "person_name": "Leonid Dolgov", "structural_unit": {"code": "LTFY08", "name": {"en": "Laboratory of Laser Spectroscopy", "et": "laserspektroskoopia labor"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-3.n. 4L n-s; 4.-16.n. 4L, 2S n-s, 4 knt => E"}, "entries": [{"time": "2024-09-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>1. Introduction and conditions for passing the subject. General principles of physics. </B>\nBasic concepts of scientific methods: hypothesis-verification, problem-finding. Models and laws in physics."}}, {"time": "2024-09-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "General principles of modern physics. Properties of the substance and field. Interactions: gravitational, electromagnetic, weak and strong. Standard model: fermions and bosons."}}, {"time": "2024-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Energy minimum. Absolute speed (speed of light). Linear and angular momentum. Spin of the particle. Pauli exclusion principle. Properties of the Nature and the physical quantities describing them. Scalars and vectors. Measurements and units."}}, {"time": "2024-09-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sine and cosine functions. Interference of waves. Wave-particle duality. Heisenberg uncertainty principle."}}, {"time": "2024-09-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Relation with mathematical formalism: power and exponential functions. Half-life and time constant. Exponential decay, limited exponential increase. Complex numbers, Euler formula."}}, {"time": "2024-09-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>2. Mechanics.</B>  Motion, position and displacement, coordinate systems, frame of reference, velocity, acceleration. Graphical representation and equations of motion."}}, {"time": "2024-09-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<B>The problem-solving seminars </B> take place on Thursdays at 2 pm (Physicum, room A106), starting from 26th of September."}}, {"time": "2024-09-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Differentiation and integration in Physics. The time derivative operator and the operator of defined integral over time."}}, {"time": "2024-09-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Newton's laws in the case of translational motion. Momentum, energy, impulse, conservation of momentum and energy. Work and power. Friction force, coefficient of friction. Drag force."}}, {"time": "2024-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Rotation. Position angle, angular velocity and angular acceleration. Normal and tangential acceleration. Centripetal and centrifugal force."}}, {"time": "2024-10-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Vector and scalar products. Examples: torque and work. Rotational inertia, angular momentum. Newton's laws in the case of rotational motion. Precession and the gyroscope."}}, {"time": "2024-10-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Conservation of the angular momentum. Kinetic energy in the case of rotation. Elasticity, Hooke's law."}}, {"time": "2024-10-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Fluids: buoyancy, Pascal principle, static and dynamic pressure, Bernoulli equation. Tensile, shear and uniaxial stresses and strains. Young modulus, shear modulus and bulk modulus."}}, {"time": "2024-10-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>3. Oscillations and waves.</B> Periodic motions, amplitude, displacement and phase. Simple harmonic oscillations, velocity and acceleration, energy of oscillations."}}, {"time": "2024-10-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Damped oscillations. Complex representation of the oscillatory motion. Differential equation of harmonic and damped oscillations, it's solution as an equation of motion."}}, {"time": "2024-10-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Exponential decay. Half-life and time constant. Coefficient of damping and logarithmic decrement. Forced oscillations and resonance."}}, {"time": "2024-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Waves in nature. Transverse and longitudinal waves. Standing waves, harmonics. Wavefunction."}}, {"time": "2024-11-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Speed of the waves. Fourier Transform. Soundwaves intensity and sound level. The decibel scale."}}, {"time": "2024-11-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>4. Electromagnetic field.</B>  Electric charge and current strength. Voltage and electric potential. Ohm's law, resistance and resistivity. Electromotive force."}}, {"time": "2024-11-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electrostatics. Point charge and Coulomb's law. Electrostatic field. Field strength E. Field lines. Capacitance."}}, {"time": "2024-11-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Magnetostatics. Ampere's law for current-carrying wires. Magnetic flux density B. Permittivity and permeability of matter. Uniform electric and magnetic fields."}}, {"time": "2024-11-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electric displacement D and magnetic field strength H. Gauss law for the electric and magnetic flux. Ampere's law for the magnetic field lines. Lorentz force."}}, {"time": "2024-11-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Maxwell-Faraday equation. Electromagnetic induction. Principles of the electric motor and generator. Self-induction and inductance. Energy of the electric and magnetic field. Comparison with the mechanics."}}, {"time": "2024-11-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>5. Quantum mechanics and Optics.</B>  Electromagnetic waves. The scale of electromagnetic radiation. Spectral parameters: wavelength, wave number, frequency and photon energy. Bohr model of the hydrogen atom."}}, {"time": "2024-11-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Spectral series of  hydrogen. Big atoms. Orbitals, quantum numbers. Selection rules.  Nuclear physics. Fission, fusion and radiocarbon dating."}}, {"time": "2024-12-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Wave-particle duality and Heisenberg uncertainty principle revisited. Basic principles of quantum mechanics. Eigenfunctions and eigenvalues, the Schrödinger equation. Tunneling."}}, {"time": "2024-12-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Propagation and absorption of light. Reflection and refraction. Wave optics: polarization, diffraction and interference."}}, {"time": "2024-12-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Quantum optics: photoelectric effect, interaction of light with matter. Thermal radiation and luminescence. Laser light and its applications."}}, {"time": "2024-12-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>6. Electrical and optical engineering. </B> Intrinsic and doped semiconductors. P-N junction. Diodes, LED's, semiconductor lasers. Transistors. JUGFET and MOSFET. CCD and CMOS technologies."}}, {"time": "2024-12-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Alternating current. Inductive and capacitive reactance. Phase relation between voltage and current, phasor representation."}}, {"time": "2024-12-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<B>7. Molecular physics and thermodynamics</B> Temperature and heat. Three states (phases) of matter and phase transitions. Molecular forces, surface tension and wetting. Main concepts of kinetic theory of gases. Laws of the thermodynamics. Heat engines and refrigerators."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "<B>The first possibility to take tests </B> will be offered Thursdays at:17.10 (first test), 14.11 (second test), 28.11 (third test),13.12 (fourth test) NB! on Friday, not Thursday. Another possibility to write (or rewrite) tests will be given Fridays (01.11, 08.11, 15.11, 22.11, 29.11, 06.12, 13.12 and 20.12) during the additional seminars from 12:15 in the room A411 (Physics Building)"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "8c7df759-ec9f-1eae-b8df-28b431c290ed", "parent_code": "LTFY.01.007", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}