{"uuid": "d6780ed9-9610-431b-fce2-fccf89e70d74", "code": "LTFY.04.011", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Perturbative Methods in Gravity Theory", "et": "Häiritusmeetodid gravitatsiooniteoorias"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY04", "structural_unit_name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY04", "name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The lecture course provides an introduction to perturbation theory and its applications in gravitational physics. It covers the foundations of the perturbation theory of tensor fields, in particular the metric tensor, as well as several important formalisms used in gravity theory, such as: 1. the linearization of gravitational field equations and the speed of gravitational waves, 2. the Newman-Penrose formalism and the polarization of gravitational waves, 3. the parameterized post-Newtonian formalism and solar system tests of gravity, 4. cosmological perturbations and cosmological observables of gravity. Examples from (simple) gravity theories based on different geometric descriptions will be used during the course.", "et": "Loengukursus on sissejuhatus häiritusteooriasse ja tema rakendusesse gravitatsioonifüüsikas. Teemaks on tensoriväljade, eriti meetrikatensori, häiritusteooria aluseid, ning mõned olulised formalismid, mida kasutatakse gravitatsiooniteoorias, näiteks: 1. gravitatsiooni väljavõrrandite lineariseerimine ja gravitatsioonilainete levimiskiirus, 2. Newman-Penrose'i formalism ja gravitatsioonilainete polarisatsioon, 3. parameteriseeritud post-Newton'i formalism ja gravitatsiooni testid päikesesüsteemis, 4. kosmoloogilised häiritused ja gravitatsiooni kosmoloogilised vaatlused. Kursuses tuuakse välja (lihtsaid) gravitatsiooniteooria näiteid erinevate geomeetriliste kirjelduste alusel."}, "objectives": [{"en": "The objective of the lecture course is to provide an introduction to perturbation theory and different perturbative methods used, in particular, in the theoretical description of gravity.", "et": "Loengukursuse eesmärk on tutvustada häiritusteooriat ja erinevaid häiritusmeetodeid, mida kasutatakse eriti gravitatsiooni teoreetiliseks kirjelduseks."}], "learning_outcomes": [{"en": "After the course the student knows the foundations of perturbation theory and the most important perturbative formalisms in gravitational physics. He / she can perform perturbative calculations of tensor fields and apply these formalisms to different gravity theories.", "et": "Pärast kursuse läbmist osaleja teab häiritusteooria aluseid ja kõige olulisemaid formalisme, mida kasutatakse gravitatsiooni erialal. Ta oskab arvutada tensoriväljade häiritusi ja rakendada neid formalisme erinevatele gravitatsiooniteooriatele."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}