{"uuid": "1f60dd8a-6d6c-f85a-941a-63ccd19ad381", "code": "LTFY.01.034", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Optics at Lower Secondary School", "et": "Valgusõpetuse õpetamine põhikoolis"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Topics in this course:\nOptics in physics curriculum of primary school. Experiments and practical works in optics. Learning methods in teaching optics. Optics in nature and technology. Student projects in optics.", "et": "Läbitavad teemad: \nValgusõpetus põhikooli õppekavas. Valgusõpetuse demokatsed ja praktilised tööd ning nende läbiviimise meetodid. Füüsika õppemeetodite rakendamine valgusõpetuse õpetamisel.  Valgusnähtused looduses ja tehnoloogias. Uurimuslikud tööd valgusõpetuses."}, "objectives": [{"en": "The main goal of this course is to give students profound understanding of the topics of optics in physics curriculum in basic school. The material is presented together with learning methods and practical skills suitable for applying in primary school classes.", "et": "Aine eesmärgiks on anda üliõpilasele süvendatud ja laiendatud teadmised valgusõpetusest, omandada põhikooli valgusõpetuse kursuses esitatavate demokatsete ja praktiliste tööde tehnika ning õppemeetodid ning anda praktilised oskused erinevate õppemeetodite rakendamseks valgusõpetuse õpetamisel."}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to:\n1. Is able to notice natural phenomena related to light;\n2. Is able to qualitatively analyze light related phenomena using ray optics;\n3. Is able to use experimantal approach in teaching optics in primary school.", "et": "Aine läbinud üliõpilane:\n1. Oskab märgata valgusnähtustega seotud füüsikalisi probleeme meid ümbritsevas keskkonnas;\n2. Kasutab valgusnähtuste analüüsimisel füüsikaseadusi kvalitatiivsel tasemel;\n3. Oskab kasutada peamisi valgusnähtusi demonstreerivaid katsevahendeid ja kasutab neid asjakohaselt valgusõpetuse teemade õpetamisel; \n4. Tunneb põhikooli sobivate  valgusõpetuse laboritööde eesmärke ning nende koostamise ja läbiviimise põhimõtteid; \n5. Teab valgusnähtuste demonstratsioonkatsetel ja praktilistel töödel tarvilikke ohutusnõudeid; \n6. Tunneb teemakohaseid allikaid kirjandusest ja internetist."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}