{"uuid": "09ed4279-af46-f597-5efd-f5f0f4182e84", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-12T23:33:36", "title": {"en": "Mathematical Physics", "et": "Matemaatiline füüsika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY04", "name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY04", "structural_unit_name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 72, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "c23543a7-4d2e-fe69-c98d-c62f8e3e89f4", "code": "MTMM.00.340", "title": {"en": "Calculus I", "et": "Kõrgem matemaatika I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "06011bf0-74f4-d033-f7de-be9d4607a262", "code": "MTMM.00.341", "title": {"en": "Calculus II", "et": "Kõrgem matemaatika II"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-03T13:33:30"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course starts with the overview of mathematical methods applied to physical applications.\nIn the course we focus on the following subjects:  vector- and tensor algebra in Euclidean 3-space, main operations of the vector- and tensor analysis, foundations of differential geometry, calculation of line and surface integrals, main theorems of vector analysis.", "et": "Loengukursuses esitatakse matemaatilised seaduspärasused seostatult füüsikaliste rakendustega. Käsitletakse järgmisi matemaatilisi teemasid ja nende füüsikalisi rakendusi: vektor- ja tensoralgebra 3-mõõtmelises eukleidilises ruumis, vektor- ja tensoranalüüsi põhioperatsioonid, diferentsiaalgeomeetria alused, joon- ning pindintegraalid ja nende arvutamine, vektoranalüüsi põhiteoreemid."}, "objectives": [{"en": "Provide a mathematical foundation for understanding of the subsequent courses in theoretical physics.", "et": "Anda matemaatiline aluspõhi edaspidiste teoreetilise füüsika kursuste mõistmiseks."}], "learning_outcomes": [{"en": "+ understands the need to extend the class of scalar functions, knows the concept of vector and tensor fields and their transformation rules in coordinate transformations,", "et": "+ mõistab vajadust skalaarsete funktsioonide klassi laiendamiseks, tunneb vektor- ja tensorvälja mõistet ning nende teisenemist koordinaatteisendustel, "}, {"en": "+ is able to use vector and tensor algebra and analysis in 3-dimensional Euclidean space, is familiar with the concepts and can be able to calculate scalar, vector and tensor field gradients and divergences and vector field rotor,", "et": "+ oskab kasutada vektor- ja tensoralgebra ning analüüsi 3-mõõtmelises eukleidilises ruumis, sealhulgas tunneb ja oskab arvutada skalaar-, vektor- ja tensorvälja gradienti ja divergentsi ning vektorvälja rootorit,"}, {"en": "+ understands the physical meaning of gradient, divergence and rotor,", "et": "+ mõistab gradiendi, divergentsi ja rootori füüsikalist tähendust,"}, {"en": "+ can calculate line, surface and space integrals and use related integral theorems,", "et": "+ oskab arvutada joon-, pind- ja ruumintegraale ning kasutada neid omavahel siduvaid integraalteoreeme, "}, {"en": "+ is able to find the eigenvalues and eigenvectors of the matrix, to bring the matrix to the normal form of Jordan and to apply this skill in the study of the fixed points of a dynamic system by writing approximate solutions,", "et": "+ oskab leida maatriksi omaväärtuseid ja omavektoreid, viia maatriksi Jordani normaalkujule ning rakendada seda oskust dünaamilise süsteemi püsipunktide uurimisel ligikaudsete lahendite kirjapanekul,"}, {"en": "+ knows the basic concepts of dynamical systems such as phase trajectory and phase portrait, fixed point and its types, bifurcation, deterministic chaos.", "et": "+ tunneb dünaamiliste süsteemide põhimõisteid nagu faasitrajektoor ja faasiportree, püsipunkt ja selle tüübid, bifurkatsioon, determineeritud kaos."}], "notes": {"et": "Toimub 3.semestril"}}, "grading": {"independent_work": {"et": "Koduülesanded igal nädalal."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kokku 13 kodutööd (10 kodutööd vektor- ja tensoranalüüsi osa kohta ja 3 kodutööd dünaamiliste süsteemide osa kohta),  igas töös  2-4 ülesannet. \n\nKodutööde vormistamise kohta on kursuse Moodle'i ajajoonele lisatud näidis (mf_kodutoode_ vormistamine.pdf). Kodutöö tuleb esitada pdf failina Moodle'i keskkonda laadituna. Kodutöö võib esitada ka jupyteri töölehena või vastava pdf failina."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Matemaatilise füüsika kursuse koondhinne kujuneb kahest osast. Esimene osa moodustab 75 % (vastavalt 75 punkti) kogu eksamitööst  (vektor- ja tensoralgebra, vektoranalüüs, joon- ja pindintegraalid, integraalteoreemid). Teine osa eksamitööst moodustab 25 % (vastavalt 25 punkti) kogu eksamitööst (maatriksite omaväärtused ja omavektorid, dünaamilised süsteemid, kaos). Mõlema osa kirjaliku eksamitöö kirjutamise ajal on lubatud abivahendina kasutada omakäeliselt kirjutatud A4 formaadis lehte valemitega (sõnalised selgitused ei ole lubatud!). \n\nVektor- ja tensoranalüüsi osa punktid jagunevad omakorda: kirjalik eksamitöö 30 punkti, kirjalik test 7 punkti, 10 kodutööd kokku 38 punkti (kokku 75 punkti)\nDünaamiliste süsteemide osa  punktid jagunevad omakorda: kirjalik eksamitöö 15 punkti, 3 kodutööd 10 punkti (kokku 25 punkti)."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "Matemaatilise füüsika kursuse koondhinne kujuneb kahest osast. Esimene osa moodustab 75 % (vastavalt 75 punkti) kogu eksamitööst (vektor- ja tensoralgebra, vektoranalüüs, joon- ja pindintegraalid, integraalteoreemid). Teine osa eksamitööst moodustab 25 % (vastavalt 25 punkti) kogu eksamitööst (maatriksite omaväärtused ja omavektorid, dünaamilised süsteemid, kaos). Mõlema osa kirjaliku eksamitöö kirjutamise ajal on lubatud abivahendina kasutada omakäeliselt kirjutatud A4 formaadis lehte valemitega (sõnalised selgitused ei ole lubatud!).\n\nVektor- ja tensoranalüüsi osa punktid jagunevad omakorda: kirjalik eksamitöö 30 punkti, kirjalik test 8 punkti, 10 kodutööd kokku 37 punkti (kokku 75 punkti)\nDünaamiliste süsteemide osa punktid jagunevad omakorda: kirjalik eksamitöö 15 punkti, 3 kodutööd 10 punkti (kokku 25 punkti).\nKõik kokku 100 punkti st kogutud punktide hulk näitab samal ajal ka soorituse protsenti."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne semestri lõppu (kokkuleppel õppejõuga). Kodutöid sellel semestril uuesti teha ei ole võimalik."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Konspekt. Koduülesanded. Test.", "recommended_materials": "1. G. B. Thomas, M. D. Weir, J. R. Hass, \"Thomas' Calculus\",  Addison-Wesley, 12th Global Edition, 2010 \n(Käsitleme seda kursuse põhiõpikuna, olgugi, et ta ei kata mitmeid teemasid: indekstähistus, tensorid ja pseudotensorid, vektori gradient, kompleksmuutuja funktsioonide teooria. Väga saranase sisu ja ülesehitusega on ka teiste autorite õpikuid, mida iseloomustab pealkirjas oesinev  sõna \"Calculus\". Sisulises osas varieeruvad nad üksteisest väga vähe ja on seetõttu nendes sisalduvate teemade osas kasutatavad.).\n\n\nJärgnevad õpikud (2, 3, 4) on väga head ja sisaldavad kõiki \"MF II\" kursuse materjale, aga nende esitustase on võrreldes \"Thomas Calculusega\" kõrgem ehk lugejalt eeldatakse natuke rohkem baasteadmisi ja ka stiililt on käsitlus selline, mis eeldab, et matemaatiline mõtteviis on lugeja poolt omaks võetud. \n \n2. G. B. Arfken, H. J. Weber, \"Mathematical Methods for Physicists\",  Academic Press, 2001.\n\n3. K. F. Riley, M. P. Hobson, S. J. Bence, \"Mathematical Methods for Physics and Engeneering: \nA Comprehensive Guide\", Cambridge University Press, 2006.\n\n4. T.L. Chow, \"Mathematical Methods for Physicists: A concise introduction\", Cambridge University Press, 2000.\n\n---------------------------------------------------------------------------------------------------------------------------------\nEesti keels olevad õppematerjalid:\nÜkski eesti keeles ilmunud ja nimekirja lisatud õpik ei kata kogu \"MF II\" materjali. Samas on lisatud raamatutes olev käsitlus sageli matemaatiliselt täiuslikum ja mitmes osas (eriti kompleksmuutuja funktsioonide teooria) põhjalikum. \n\n5. I. Piir,  \"Kõrgem algebra ja anlüütiline geomeetria\", Tartu Ülikooli kirjastus, Tartu 1986\n(Konspektiivne, aga nii sisult   kui  vormilt sarnane käsitlus loengus esitatule.  Sisulises osas katab MF II teemadest üksnes vektor- ja tensoralgebra osa, aga sisaldab samas mitmeid teemasid, mis MFII käsitlemist ei leia).\n\n6. G. Kangro,  \"Matemaatiline analüüs I, II\", Eesti Raamat, Tallinn 1965 ja 1968\n(Matemaatiliselt väga korrektne käsitlus. Soovitan lugeda mitmemuutuja funktsiooonide integraalarvutuse osa, väljateooria elemendid natuke liiga pealiskaudselt. Stiililt vägagi erinev käsitlus loengus esitatavast).\n\n7. N. Piskunov, \"Diferentsiaal- ja integraalarvutus I, II\", Valgus, Tallinn 1965 ja 1966\n(Stiililt sarnasem loengusesitatule kui eelnev raamat, päris palju näiteid).\n\n8. E. Reimers, \"Matemaatilise analüüsi praktikum I, II\", Valgus, Tallinn, 1988\n(Ülesannete kogu koos lühikokkuvõttega teooriast ja näidisülesannetega. Koostatud G. Kangro õpiku järgi).\n\n9. L. Loone ja V. Soomer \"Matemaatiline analüüsi algkursus II\", Tallinn, 2009\n(Mitmemuutuja funktsioonide integreerimine). \n\n10. E. Jürimäe \"Kompleksmuutuja funktsioonide teooria lühikursus\", Tallinn 1983\n(Hea, aga küllaltki nõudlik käsitlus kompleksmuutuja funktsioonide teooriast. Sisaldab palju teemasid, mis MF II kursuses käsitlemist ei leia. Küllaltki vähe näidisülesandeid).\n\n---------------------------------------------------------------------------------------------------------------------------------\nVene keeles ilmunud õppematerjalid:\nMa ei ole kõiki lisatud raamatuid ise lugenud ja ei lisa seetõttu ka  kommentaare, aga esimese valikuna soovitaksin kindlasti Arfkeni tõlget, olgugi, et see on tehtud esmatrükist.\nOlukord on saranane eesti keeles ilmunuga--täielikult katab materjali ühe raamatuna ainult Arfkeni õpik.\n\n11. G. Arfken, \"Matematitšeskije metodõ dlä fizikov\", Mir, 1970 (vene keeles, originaali uustrükk on kirjanduse loetelus nr 2.).\n\n12. E. Madelung \"Matematitšeski apparat fiziki\", Moskva,1960 (vene keeles, originaal saksa keels E. Madelung, \"Die mathematischen hilfsmittel des Physicers\", springer 1957).\n\n13. M. A. Akivis, V. V. Goldberg \"Tenzornoje istšislenije\", Nauka, 1969 (vene keeles).\n\n14. P. I. Romanovskii \"Rjadõ Furje. Teorija polja\", Nauka, 1973 (vene keeles)."}, "participants": {"lecturers": [{"person_uuid": "b37b022f-ffc1-9506-0657-1b92c690b8f2", "person_name": "Laur Järv", "structural_unit": {"code": "LTFY19", "name": {"en": "Laboratory of Theoretical Physics", "et": "teoreetilise füüsika labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "bdc8b455-5588-3766-9a79-f9bd6cb7239f", "person_name": "Margus Saal", "structural_unit": {"code": "LTFY19", "name": {"en": "Laboratory of Theoretical Physics", "et": "teoreetilise füüsika labor"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-12.n. 6L n-s, 2 knt -> A"}, "entries": [{"time": "2024-09-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "0. Sissejuhatus kursusele \"Matemaatiline füüsika\":\n(a.)  Töökorraldus. \n(b.)  Õppematerjalid.\n(c.)  Mida peame antud kursuse jooksul juurde õppima  ja milliseid oskuseid omandama.\n(g.)  Kokkuvõte kursuse sisust."}}, {"time": "2024-09-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>I. VEKTORID JA TENSORID </b> [Margus Saal]\n1. Vektori mõiste. Algebra. Vektorruum\n(Kordamine. Geomeetriline vektor ja sellega seotud mõisted. Geomeetrilise vektori üldistus. Näited vektorruumidest.)\n2. Vektorite lineaarne sõltuvus ja sõltumatus\n(Definitsioonid. Näited ruumides E2 ja E3)"}}, {"time": "2024-09-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. Vektorruumi baas ja mõõde. Vektori koordinaadid\n(Vektori esitamine baasivektorite lineaarkombinatsioonina. Erinevad baasid. Koordinaatide ühesus baasis. Seotud mõisted: moodul, ühikvektor, suunakoosinused. Näide vektori nn aktiivsest teisendusest - vektori pööre. Indekstähistus ja maatriksesitus - nende võrdlus. Summeerimiskokkulepe.)"}}, {"time": "2024-09-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. Vektorite skalaarkorrutis. Ortonormeeritud ja mitteortonormeeritud baas\n(Geomeetriliste vektorite skalaarkorutis ja selle omadused. Vektori projektsioon vektorile. Seotud mõisted: ortogonaalsus, normeeritus, ortonormeeritus, mitteortonormeeritus. Kroneckeri delta. Skalaarkorrutis koordinaatides - ortonormeeritud baasis ja mitteortonormeeritud baasis. Meetrilise tensori kovariantsed komponendid ja nende tähtsus. Summeerimiskokkulepe ja indekstähistus. Schwarzi võrratus. Minkowski võrratus.)\n5. Vektorite vektorkorrutis. Levi-Civita sümbol\n(Mõisted: orienteeritus ja selle omadused)"}}, {"time": "2024-09-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. Vektorite vektorkorrutis\n(Pärisortogonaalteisendused, pseudoskaalar, pseudovektor, vektorite vektorkorrutis, selle omadused ja geomeetriline tähendus. Levi-Civita sümbol, seos Kroneckeri sümboli ja Levi-Civita sümboli vahel.)\n6. Liitkorrutised\n(Segakorrutis ja selle omadused. Lineaarne sõltuvus ja sõltumatus segakorrutise kaudu. Levi-Civita sümboli kasutamine vektoralgebra seoste tõestamisel.)"}}, {"time": "2024-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7. Tensorite tensorkorrutis (otsekorrutis)\n(Bilineaarne funktsioon, tensorkorrutise omadused,tarvlik tingimus, et maatriks oleks vektorite tensorkorrutis, tensor mõiste  tensorkorrutisest, näited.)"}}, {"time": "2024-09-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. Kordamine. Koordinaatjooned ja pinnad. Põhibaasi ja kaasbaasi mõisted"}}, {"time": "2024-09-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9. Kõverjooneliste koordinaatide põhibaas ja kaasbaas\n(koordinatteisendused, Jacobi maatriks, jakobiaan, baasi teisendused, seos põhi- ja kaasbaasi vahel, terminoloogia.)"}}, {"time": "2024-09-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10. Nihkevektor ja meetrika\n(Meetriline tensor - teist järku tensorväli, eukleidiline ja pseudoeukleidiline meetrika, intervall, näited - meetrika üleminekul Cartesiuse ristkoordinaatidest sfäärilistesse koordinaatidesse.)"}}, {"time": "2024-09-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "11. Vektorite ja tensorite kontravariantsed ja kovariantsed komponendid\n(Vektorite ja tensorite invariantsus, komponentide teisenemiseeskirjad ja klassifikatsioon vastavalt sellele.)"}}, {"time": "2024-09-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "12. Vektorite ja tensorite indeksite tõstmine ja langetamine\n(Meetrika roll indeksite tõstmisel ja langetamisel.)\n13. Võimalikud üldistused\n(Eukleidiline ruum, pseudoeukleidiline ruum, Riemanni ruum, ruumi dimensionaalsus.)"}}, {"time": "2024-09-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14. Tensoralgebra. Sümmeetria ja antisümmeetria. Näited\n(Tensoralgebra põhitehted ja nende omadused: tensorite liitmine, korrutamine ja ahendamine, tensori jälg, sümmeetria ja antisümmeetria ja nende invariantsus, kõrgemat järku tensorid,  deformatsioonitensor, inertsitensor.)"}}, {"time": "2024-09-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "15. Pseudotensorid. Näited\n(Vektorkolmiku parem- ja vasakorientatsioon, pseudoskalaarid ja skalaarid, kolme vektori segakorrutis kui pseudoskalaar, aksiaalsed- ehk pseudovektorid ja polaarsed vektorid, vektorkorrutis kui pseudovektor ja selle komponentide teisenemine koordiaantteisendustel, kõrgemat järku pseudotensorid, Levi-Civita pseudotensor ja tema (ahendatud) korrutised, Levi-Civita tensori kasutamine arvutustel. Kõrgemat järku pseudotensorid. Levi-Civita pseudotensor ja tema (ahendatud) korrutised. Levi-Civita tensori kasutamine arvutustel.)"}}, {"time": "2024-10-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Test I osa kohta\n<b>II. VEKTORANALÜÜS</b> [Margus Saal]\n16. Skalaar-, vektor- ja tensorvälja mõisted. Skalaarvälja gradient\n(Skalaarvälja nivoopinnad, skalaarvälja muutus nihkel ja tuletis antud suunas, skalaarvälja gradiendi definitsioon, skalaarvälja gradient kui vektor, tema geomeetrilised omadused ja füüsikaline tähendus, liitfunktsioonide gradiendi arvutamine.)"}}, {"time": "2024-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "17. Vektorvälja gradient\n(Vektorvälja komponentide nivoopinnad, vektorvälja komponendi juurdekasv nihkel ja tuletis antud suunas,  vektorvälja gradiendi definitsioon, vektorvälja gradient kui teist järku tensor, tensorvälja gradient.)\n18. Vektorfunktsiooni diferentseerimine ja integreerimine skalaari järgi\n(Vektorfunktsiooni pidevus ja tuletis,  arvutusureeglid ja järeldused nendest, mitmemuutuja vektorfunktsioon, näited, vektorfunktsiooni integreerimine skalaari järgi.)"}}, {"time": "2024-10-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "19. Kõverad ja pinnad\n(kõvera parameetrilised võrrandid ja vektorvõrrand, kõvera puutujavektor, kaare pikkus, Ferneti-Serrati valemid. Näited.)"}}, {"time": "2024-10-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "19. Kõverad ja pinnad\n(pinna parameetrilised võrrandid ja vektorvõrrand, Pinna normaalivektor ja ühiknormaal,  diferentsiaalne pinnaelement.)"}}, {"time": "2024-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "20. Kordamine. Üldised kõverjoonelised koordinaadid\n(Koordinaatjooned ja koordinaatpinnad; baasivektorid, põhibaas ja kaasbaas; kauguse ja ruumala avaldised üldistes kõverjoonelistes koordinaatides, üldised koordinaatteisendused -  Jacobi maatriks, \nvektori esitamine põhibaasi ja kaasbaasi kaudu.)"}}, {"time": "2024-10-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "21. Kordamine. Silindrilised ja sfäärilised koordinaadid\nÜleminekuvalemid Cartesiuse koordinaatsüsteemist. Ruumalaelement vastavates koordinaatides. Jakobiaani mõiste ja jakobiaanid vastavates koordinaatides."}}, {"time": "2024-10-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "22. Joonintegraal\n(Esimest liiki joonintegraali (joonintegraal kaare pikkuse järgi) mõiste, olemasolu ja arvutamine, teist liiki joonintegraali mõiste (joonintegraal koordinaatide järgi), olemasolu ja arvutamine, orienteeritud joon ning seos esimest ja teist liiki joonintegraalide vahel,  Greeni valem, joonintegraal funktsiooni täisdiferentsiaalist, ruumiline joonintegraal, joonintegraal kinnisel kõveral (tsirkulatsioon). Näited arvutamisest.)"}}, {"time": "2024-10-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "23. Pindintegraal\n(Esimest liiki pindintegraali mõiste, olemasolu ja arvutamine, orienteeritud pind, teist liiki pindintegraali mõiste, olemasolu ja arvutamine, seos esimest ja teist liiki pindintegraalide vahel.)"}}, {"time": "2024-10-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "(Arvutuslikud näited.)"}}, {"time": "2024-10-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "24. Vektorvälja divergents\n(Vektorvälja divergentsi definitsioon ja lineaarsusega seotud omadused. Laplace'i operaator. Harmooniline skalaarväli. Allikavaba ehk solenoidaalse vektorvälja mõiste. Vektorvälja trajektoorid. Vektorvälja voog läbi (infinitesimaalse) pinnaelemendi. (Vajadus pindintegraali mõiste järele!). Vektorvälja voo omadused. Divergentsi hüdrodünaamiline tähendus, vektorvälja allika- ja neelupunktid. Näited.)"}}, {"time": "2024-10-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "25. Vektorvälja rootor\n(Vektorvälja rootori definitsioon ja esitamine Levi-Civita pseudotensori abil. Vektorvälja rootor kui pseudovektor. Rootori lineaarsed omadused. Rootori seos tsirkulatsiooniga ja füüsikaline tähendus. Pöörisevaba ehk potentsiaalse vektorvälja mõiste ja omadused. Vektorpotentsiaali mõiste. Näited.)"}}, {"time": "2024-10-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "26. Gaussi divergentsiteoreem\n(Gaussi teoreemi eeldused, Gaussi teoreem, tõestus, järeldused Gaussi teoreemist. Gaussi teoreemi üldistamine tensor ja skalaarväljade jaoks. Näited.)"}}, {"time": "2024-10-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "27. Stokes'i teoreem\n(Stokes'i teoreemi eeldused, Stokes'i teoreem, heuristiline tõestus (seletus) ja järeldused Stokes'i teoreemist. Näited.)"}}, {"time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "28. Vektorvälja divergentsi ja rootori invariantsed definitsioonid\n29. Gradiendi, divergentsi, rootori ja Laplace'i operaatori avaldised kõverjoonelistes  (silindrilistes ja sfäärilistes) koordinaatides\n(Vastavad arvutusvalemid ja kahe valemi tuletamine.)"}}, {"time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "30. Näited kasutades Jupiteri töölehti (kogu kursuse jooksul). Kokkuvõte"}}, {"time": "2024-11-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>III. MAATRIKSITE OMAVÄÄRTUSED JA OMAVEKTORID</b> [Laur Järv]\n<b>31. Baasiteisendused:</b>\nA. Vektori komponentide teisenemine. B. Lineaarteisendused ja maatriksid. C. Maatriksi komponentide teisenemine. D. Maatriksite ekvivalentsiklassid. E. Maatriksi normaalkuju. F. Mõned näited rakendustest."}}, {"time": "2024-11-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>32. Omaväärtused ja omavektorid:</b>\nA. Omaväärtused ja omavektorid. B. Omaväärtuste omadusi. C. Omavektorite geomeetriline tähendus. D. Omaväärtuste algebraline ja geomeetriline kordsus."}}, {"time": "2024-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "E. Üldistatud omavektorid. F. Sümmeetrilise maatriksi omaväärtused ja omavektorid, mitmekordsele omaväärtusele vastavad omavektorid. G. Omavektorid moodustavad baasi. (Lisa: Grami-Schmidti ortogonaliseerimisprotseduur.)\n<b>33. Maatriksi diagonaliseerimine:</b>\nA. Millal saab maatriksi diagonaliseerida. B. Kui kõik omaväärtused on reaalsed."}}, {"time": "2024-11-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "C. Tõestus, miks diagonaliseerimine töötab. D. Kui kõik omaväärtused on komplekssed. E. Komplekssed omaväärtused diagonaalile. F. Reaalsed ja komplekssed omaväärtused.\n<b>34. Maatriksi Jordani normaalkuju</b>\nA. Millal maatriksit ei ole võimalik diagonaliseerida. B. Reaalsete omaväärtuste juhul. C. Reaalsete ja komplekssete omaväärtuste (üldisel juhul). Jordani normaalkuju leidmise keerulisem näide. D. Kokkuvõte."}}, {"time": "2024-11-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>IV. DÜNAAMILISED SÜSTEEMID</b> [Laur Järv]\n<b>35. Dünaamilised süsteemid:</b>\nA. Dünaamiline süsteem. B. Hariliku diferentsiaalvõrrandi saab esitada dünaamilise süsteemina.\nC. Kui harilik diferentsiaalvõrrand sisaldab ilmutatud kujul aega. D. Harilike diferentsiaalvõrrandite süsteem. E. Dünaamilise süsteemi mõõde.\n<b>36. Ühemõõtmelised dünaamilised süsteemid: </b>\nA. Analüütilised lahendid. "}}, {"time": "2024-11-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "B. Vool ja püsipunktid. C. Püsipunktide tüübid. D. Lineaarne lähendus püsipunkti ümbruses. E. Püsipunktid kui \"potentsiaalli\" miinimumid. F. Võnkumiste võimatus ühemõõtmelises dünaamilises süsteemis.\n<b>37: Bifurkatsioonid:</b>\nA. Bifurkatsioon. B. Bifurkatsioonidiagramm. C. Voltbifurkatsioon. D. Transkriitiline bifurkatsioon. E. Superkriitiline kahvelbifurkatsioon. F. Subkriitiline kahvelbifurkatsioon. G. Ebatäiuslikud bifurkatsioonid ja katastroofid."}}, {"time": "2024-11-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>38. Kahemõõtmeline lineaarne dünaamiline süsteem sõltumatute muutujatega:</b>\nA. Kahemõõtmeline lineaarne dünaamiline süsteem. B. Kui muutujad on teineteisest sõltumatud. C. Üldlahend sõltumatute muutujate korral. D. Püsipunkt. E. Faasiportreed. F. Püsipunktide tüübid. G. Püsipunkti stabiilne ja ebastabiilne alamruum. H. Vool ja faasiportree.\n<b>39. Kahemõõtmeline lineaarne dünaamiline süsteem üldjuhul:</b>\nA. Lineaarsüsteemide fundamentaalteoreem. B. Maatriksi eksponendi arvutamine. C. Süsteemi diagonaliseerimine, üldlahend ja faasiportree erinevate reaalsete omaväärtuste korral."}}, {"time": "2024-11-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "D. Süsteemi diagonaliseerimine, üldlahend ja faasiportree komplekssete omaväärtuste korral. E. Püsipunktide tüübid komplekssete omaväärtuste korral. F. Süsteemi viimine normaalkujule, üldlahend ja faasiportree korduvate reaalsete omaväärtuste korral. G. Korduva omaväärtuse juht, kui geomeetriline kordsus võrdub algebralise kordsusega. H. Püsipunktide klassifikatsioon.\n<b>40. Üldine n-mõõtmeline lineaarne süsteem:</b>\nA. Üldlahend. B. Mitmekordsete omaväärtuste juht. C. Kokkuvõte.\n<b>41. Kahemõõtmeline mittelineaarne süsteem:</b>\nA. Faasiportree uurimine."}}, {"time": "2024-11-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "B. Lahendite olemasolu ja ühesus. C. Lineariseerimine püsipunkti ümbruses. Näide: hõõrdumisega pendel. D. Hartmani-Grobmani teoreem. E. Piirtsüklid. F. Poincare-Bendixoni teoreem. G. Bifurkatsioonid. H. Hopfi bifurkatsioon. I. Superkriitiline ja subkriitiline Hopfi bifurkatsioon.\n<b>42. Determineeritud kaos:</b>\nA. Veider atraktor. Näide: Lorenzi atraktor. B: Determineeritud kaos. Näide: Pendel hõõrdumise ja sundiva jõuga"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "rühmatöö (koos analüütilise mehaanikaga)"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "koos analüütilise mehaanikaga rühmatöö ülesande konsultatsioon"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "koos analüütilise mehaanikaga rühmatööde ettekandmine"}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "341a9595-e026-41fd-4e11-4cd3832d99e5", "parent_code": "LTFY.04.013", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}