{"uuid": "7e271658-b059-b62c-d94c-6e6984e3c32a", "code": "LTFY.00.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Training in Physics or Materials Science", "et": "Erialane praktika füüsikas või materjaliteaduses"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY", "structural_unit_name": {"en": "Institute of Physics", "et": "füüsika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTFY", "name": {"en": "Institute of Physics", "et": "füüsika instituut"}, "webpage_url": "https://fi.ut.ee", "address": "W. Ostwaldi 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "W. Ostwaldi 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Aim of the course is to give students first practical experience of working as a scientist or laboratory assistant in the factory or scientific laboratory. During the practical part both theoretical and practical experience on the specific field will be obtained as at least one-month full job in particular enterprise. Obtained theoretical and practical experience will be summarized in written report. The project has to be defended in open discussion of seminar classes.", "et": "Käesoleva õppeaine raames läbib tudeng vähemalt kuuajalisele täiskoormusele vastava praktika mõnes füüsika või muu sarnase kallakuga teaduslikus või tootmisettevõttes. Praktika lõpus esitab tudeng kirjaliku aruande saadud teadmisest koos ülevaatega praktika raames läbi viidud praktilistest töödest. Arvestuse saamiseks esitatakse aruanne oponeeritava suulise ettekandena. Praktika aruannete kaitsmine toimub vähemalt kord semestris Füüsika Instituudi direktori poolt määratud komisjoni ees."}, "objectives": [{"en": "The course provides practical experience in research and development work in companies and laboratories. The students learn general regulations used in these institutions, practical aspects of organization and evaluation of research and development. The activity may also include work for solving scientific problems, generating intellectual property, learning legal, economical and quality assurance aspects.", "et": "Kursuse eesmärgiks on anda üliõpilastele praktiline kogemus teadustöö ja arendustöö vallas, mis toimub praktika kohaks valitud ettevõttes või uurimisasutuses. Tutvutakse asutuste tegevuse põhimõtetega, uurimistöö ja arendustöö korralduse alustega, töö tulemuslikkuse hindamise viisidega. Võetakse osa teadusprojektidest, intellektuaalse omandi loomisest, tutvutakse ettevõtte tegevuse juriidiliste, majanduslike ning tegevuse kvaliteeti tagava süsteemi alustega."}], "learning_outcomes": [{"en": "Aim of the course is to give students first practical experience of working as a scientist or laboratory assistant in the factory or scientific laboratory. During the practical part both theoretical and practical experience on the specific field will be obtained as at least one-month full job in particular enterprise. Obtained theoretical and practical experience will be summarized in written report. The project has to be defended in open discussion of seminar classes.", "et": "Tudeng tunneb mõne teadus- või tööstuslabori igapäevatöö praktilisi aspekte.\nTudeng oskab kasutada laboris kasutatavat aparatuuri. Tudeng tunneb vastavas valdkonnas kehtivaid kvaliteedinorme ja standardeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}