{"uuid": "c8a2fd1d-0d14-404a-c3ae-46c60499f67d", "code": "LTFY.01.033", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Electricity and Magnetism at Lower Secondary School", "et": "Elektriõpetuse õpetamine põhikoolis"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Getting an overview of the curriculum to teach electricity in basic schooll, demo experiments and practical works in basic school electricity, electricity in nature and technology. The subject gives necessary skills and knowledge for teaching electricity physics at basic school.", "et": "Läbitavad teemad: \nElektriõpetuse põhikooli õppekava. Elektriõpetuse demokatsed ja praktilised tööd ning nende läbiviimise meetodid. Füüsika õppemeetodite rakendamine elektriõpetuse õpetamisel. Elekter looduses ja tehnoloogias. Uurimuslikud tööd elektriga."}, "objectives": [{"en": "The main goal of the subject is to give necessary skills and knowledge for teaching electricity at lower secondary school. During the cource acquire knowledges and skills how to apply a topic in school physics when doing practical tasks and solving tasks, acquire the technique of demo experiments and practical work.", "et": "Aine eesmärgiks on anda üliõpilasele süvendatud ja laiendatud teadmised elektriõpetusest, omandada põhikooli elektriõpetuse kursuses esitatavate demokatsete ja praktiliste tööde tehnika ning õppemeetodid ning anda praktilised oskused erinevate õppemeetodite rakendamseks elektriõpetamise õpetamisel."}], "learning_outcomes": [{"en": "On completing the course the students should be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) identify practical situations in which physics can be explored beyond the classroom;", "et": "1) oskab märgata elektriga  seotud füüsikalisi probleeme meid ümbritsevas keskkonnas;"}, {"en": "2) knows physical laws at a qualitative level to analyze electrical phenomena;", "et": "2) kasutab elektrinähtuste analüüsimisel füüsikaseadusi kvalitatiivsel tasemel;"}, {"en": "3) is able to use instruments demonstrating the main electrical phenomena and uses them appropriately in teaching electrical teaching subjects;", "et": "3) oskab kasutada peamisi elektrinähtuseid demonstreerivaid katsevahendeid ja kasutab neid asjakohaselt elektriõpetuse teemade õpetamisel; "}, {"en": "4) knows the goals of the electrical practical works and the principles of their preparation and conducting;", "et": "4) tunneb põhikooli sobivate  elektriõpetuse laboritööde eesmärke ning nende koostamise ja läbiviimise põhimõtteid; "}, {"en": "5) knows the safety requirements that are required for electrical demo experiments and practical works;", "et": "5) teab elektriõpetuse demonstratsioonkatsetel ja praktilistel töödel tarvilikke ohutusnõudeid; "}, {"en": "6) knows the sources of literature.", "et": "6) tunneb teemakohaseid allikaid kirjandusest ja internetist."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}