{"uuid": "7a792251-5a77-58de-a2dd-b7c6dadf3bfe", "code": "LTFY.01.029", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Didactics of Physics II", "et": "Füüsika didaktika II"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Theoretical basis of different forms and methods of physics studies with examples. Physics Syllabus. Learning objectives, different ways of assessment, traditional and cutting-edge teaching methods, planning of the learning activities, methods, and forms of physics studies; the role of experiments, tests and problems in physics studies; teaching materials and resources, textbooks and science literature. Learning equipment and devices. Student motivation and creative approach to teaching.", "et": "Erinevate füüsikaõppe vormide ja meetodite teoreetiline alus koos näidetega.  Füüsika ainekava. Õpieesmärgid, erinevad hindamisviisid, traditsioonilised ja tänapäevased õppemeetodid, õppetegevuste planeerimine, füüsikaõppe meetodid ja vormid, eksperimentide, katsete ja ülesannete roll füüsikaõppes, õppematerjalid ja õppevahendid, õppe- ja populaarteaduslik kirjandus. Õppevahendid ja -tehnika. Õpilaste motiveerimine ja loov  lähenemine õpetamisele."}, "objectives": [{"en": "The course gives knowledge about research based strategies for teaching physics to different audiences.", "et": "Kursus annab ülevaate füüsika õppimise ja õpetamise erinevate strateegiate teoreetilisest käsitlusest."}], "learning_outcomes": [{"en": "After the course, the students are expected:\n1. Competence to plan the learning process according to the learning objectives, different ways of assessment, and various teaching methods.\n2. Efficient planning skills of learning activities for students in accordance to physics syllabus of both secondary and upper secondary national curricula. \n3. Knowledge of and ability to use forms and methods of physics studies.\n4. Skills for planning and conducting experiments and tests in accordance to the goal of the course and level of studies.\n5. Knowledge of types of physics problems, procedures of solving, format requirements, and the ability to create own problems.\n7. Knowledge of and ability to use different ways of feedback.\n8. Creative and engaging approach to teaching, ability to motivate students, appreciation of school ethos.", "et": "Aine läbinud üliõpilane:\n1. Oskab kavandada õpieesmärkidele, erinevatele hindamisviisidele ja õppemeetoditele tuginevat õppeprotsessi.\n2. Oskab  füüsika ainekava raames planeerida oma ja õppijate õppetegevusi.\n3. Teab millised on füüsikaõppe vormid ja meetodid ning oskab neid kasutada.\n4. Teab erinevaid hindamise ja tagasiside andmise viise ning oskab neid kasutada.\n5. Läheneb õpetaja  tööle loovalt ja kaasahaarvalt, suudab motiveerida õpilasi ning väärtustab eetilisust õpetaja  töös."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}