{"uuid": "10f3426f-e594-c4dc-3888-02c57a1f6395", "code": "lt-2018-autumn-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Strategies of Professional Success", "et": "Erialase edu strateegiad"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 48, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The physicist's professional career models and their prerequisites are discussed. The theoretical basis of general demands for teaching and public performance are introduced. Reports and team work are used as the methods of teaching.", "et": "Aine õpetamisel kasutatakse ümberpööratud klassiruumi metoodikat, ehk enne igat seminari tuleb iseselsvalt töötada läbi teoreetiline materjal või valmistada ette mõni analüüs.\nTagasiside andmiseks kasutatakse kujundavat hindamist ja kaaslaste vastastiku hindamist.\nTeemad:\n-SWOT analüüs\n-konsulteerimine, nõustamine, nõu andmine, soovitamine.\n-suhtlemisoskused\n-Tõhusa enesejuhtimise võtted, aja planeerimine\n-lühikõned ja -esinemised, sõnumi edastamine, erinevate sihtgruppidega arvestamine, olulise eristamine ebaolulisest, veenmise tehnikad, näitlikustamise võtted\n-Kuulajate kaasamine, kuulajaskonnaga arvestamine, küsimuste sõnastamine ja esitamine, küsimustele vastamine, lühiintervjuud\n-Intervjueerimine, arutelule suunavad küsimused, motiveeriv intervjueerimine\n- Veenmine, argumenteerimine, demagoogia\n- tööle kandideerimine, CV koostamine, motivatsiooni- ja soovituskirja koostamine, tööintervjuu (individuaalne ja gruppiintervjuu)"}, "objectives": [{"en": "The aim of this course is to introduce the MSc students with striking examples to the models of physicist's professional career, prerequisites needed for realizing them and strategies of professional success. As well as to practice various techniques for planning and self-analysis. Another goal is to develop the public communication skills of the students and abilities to describe their own professional work and the importance of it to different level audiences.", "et": "Tutvustada magistrandile markantsete näidete varal erinevaid erialaseid karjäärimudeleid, nende realiseerumiseks vajalikke eeldusi ja edu saavutamise strateegiaid ning harjutada erinevaid planeerimise ja eneseanalüüsi võtteid. Luua võimalused avaliku kommunikatsiooni oskuste arendamiseks ning kujundada suutlikkust efektiivselt tutvustada oma erialast tööd ja selle vajalikkust erineva tasemega kuulajaile."}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Describe the models of physicist's professional career and prerequisites needed to realize them.", "et": "1. Mõtestab füüsiku erialaseid karjäärimudeleid ja nende realiseerumiseks vajalikke eeldusi."}, {"en": "2. Describe the success strategy relevant to the personally preferred career model and the related problems.", "et": "2. Mõistab personaalselt eelistatud karjäärimudeli edustrateegiat ja sellega seonduvaid probleeme."}, {"en": "3. Implement self-analysis by assessing own strengths and aspects requiring development in planning the professional career.", "et": "3. Teostab eneseanalüüsi hinnates enda tugevusi ja arendamist vajavaid aspekte erialase karjääri planeerimisel."}, {"en": "4. Recognise time planning techniques and implement them when prioritizing and adjusting activities.", "et": "4. Teadvustab ajaplaneerimise võtteid ning rakendab neid oma tegevuste prioritiseerimisel ja korrigeerimisel."}, {"en": "5. Give information related to own profession by taking into account audience's former knowledge and specificity and by using appropriate engagement and visualization methods.", "et": "5. Suudab edastada oma erialaga seotud teavet arvestades auditooriumi eelteadmiste ja eripäradega ning kasutades otstarbekaid kaasamise ja visualiseerimise võtteid."}, {"en": " 6. Formulate questions to hold professional conversation, answer questions competently and give constructive criticism. ", "et": "6. Osaledes erialases diskussioonis suudab sõnastada vestlust arendavaid küsimusi, asjatundlikult vastata küsimustele ja anda konstruktiivset tagasisidet. "}, {"en": "7. Create a CV, a letter of motivation and a reference letter when applying for a job, and have an understanding of participation in individual and group interviews.", "et": "7. Suudab tööle kandideerimisel koostada CV, motivatsiooni- ja soovituskirja ning omab etttekujutust individuaal- ja grupiintervjuul osalemisest."}], "notes": {"et": "Asendab ainet LOFY.01.076 Konsultatiivtöö metoodika (6 EAP) alates 2017/2018 õ-a!"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "a)  Töötada läbi raamatu materjal lk 7-13. Igast peatükist selekteerida välja vähemalt viis kandvat mõtet. Olla valmis nende punktide alusel esitada seminaris oma arvamus. Kes ei saa seminarist osa võtta, esitab enda koostatud kirjaliku töö (mitte Copi/Paste!), kus on näha koostaja isikliku panust, nt näidete, analoogiate jmt toomisel. Tööd tuleb esitada hiljemalt 24.09 foorumis \"Eneseväljendus\".\n\nb) Koostada esinemise  analüüs, lähtudes oma kogemusest ja oma isiklikust arvamusest avalikust esinemisest. Analüüsis peab olema vähemalt seitse aspekti, millest lähtutakse. Tähelepanu tuleb pöörata nii sisule kui ka vormile. Tööd tuleb esitada hiljemalt 24.09 foorumisse \"Esinemise analüüs\"."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "a) Tutvuda projektide tutvustega ja koostada esinemiste võrdlusanalüüs. Analüüsi tulemusi postitada foorumisse \"Lühiesinemised\", tähtajaks on 01.10.2018. Igale analüüsile annab õppejõud individuaalse tagasiside hiljemalt 02.10.2018\n\nProjektid: tiim MovePrep, tiim MARKUS, Tippy, 3D Treatement Systems\n\nb) Valmistada ette üks lühiesinemine teemal \"Eksamid/arvestused kõrgkoolis\" (5-7min) ehk tuleb selgitada mida kujutavad endast ette eksamid/arvestused kõrgkoolis lähtudes teie kogemusest. Sihtgrupid, kellele kõne peetakse on: pensionääride klubi, linnavalitsus, 7. klassi õpilased, lasteaia kasvatajad. Sihtrühma kellele te soovite kõne pidada valite ise ja teatate publikule vahetult enne esinemist. Kes juba teab, et ei saa seminarist osa võtta, teeb salvestust nö kodustel tingimustel ja saadab Moodle foorumisse link, kust saame videot vaadata hiljemalt 02.10.2018. Esinemisi filmitakse ja pärast saame need analüüsida."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "a) Tutvuda artikliga ja selle põhjal olla valmis tuua välja vähemalt viis kandvat mõtet.\n\nb) Vaadata video oma esinemisest ja koostada eneserefleksioon milles tuua välja õnnestumisi ja arendamist vajavaid aspekte. Tulemused esitada foorumis Oma esinemise analüüs, tähtajaks on 06.10.2018.\n\nc) Vaadata vähemalt ühe kursusekaaslase esinemist videost ja anda talle selle kohta tagasiside. Tagasisides tuleb tuua esile selle mis oli positiivne ja konstruktiivset kriitikat. Tagasiside andmisel lähtuda nii sisust kui vormist. Tulemused esitada foorumis Kaaslase esinemise analüüs, tähtajaks on 08.10.2018."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "a) vaadata TÜ rektori kandidaatide debati ja esitada foorumis \"Debatt\" 17. oktoobriks oma kokkuvõte järgmistel punktidel:\n\nmillised olid debatti reeglid?\nmilliseid veenmistehnikaid kandidaadid kasutasid?\nmida võib öelda kandidaatide multimodaalse suhtluse kohta?\nmillisele hetkele debatist tahad ka teiste tähelepanu pöörata? Lisa konkreetne koht (nt min) ja selgita mis selles momendis köitis Su tähelepanu.\nb) põgusalt tutvuda seminari külalise Teofilus Tõnnissoni taustaga (otsida saab googeldades või http://interspectrum.ee/) ning olla valmis esitama seminaris sisulisi küsimusi"}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "a) Raamatu ptk Veenmine põhjal koostada esinemise stsenaarium. Ehk Sa pead einema alustavate ärimeeste konverentsil ja Sinu esinemise teemaks ongi VEENMINE (sisu raamatu põhjal). Arvesta sellega, et esinemiseks on ettenähtud 30 min aega.\n\nMõtle:\n\nmillest Sa alustad?\nmillega lõpetad?\nmis on selle teema juures Sinu arvates kõige olulisem? Kuidas sellele tähelepanu juhtida?\nMilliseid võtteid saad kasutada oma juttu ilmestamiseks?\nKuidas kaasata kuulajaid?\n Tulemusi palun esitada foorumis \"Veenmine\", tähtajaks on 20.10.2018.\n\nb) Tutvuda Martin Luther Kingi 1963 a. kõnega (siin ja/või siin). Koostada kõne analüüs lähtudes järgmistest punktidest: kõne struktuur, kõne faasid, kõne tempo, kehakeel, žestid, pausid, publiku reaktsiooniga arvestamine ja kõne sõnum. Analüüsi tuleb esitada foorumis \"Speetch\", tähtajaks on 22.10.2018.\n\nc) tutvu tööpakumistega, vali enda jaoks vähemalt üks mis sobib ja esitades CV ja motivatsioonikiri \"kandideeri\" tööle vastavalt kuulutuses olevale informatsioonile."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "a) Kasutades raamatu (lk 9.-10.) ja toetades esitatule koosta Sinu poolt viimati külastatud loengu lühianalüüs. Konfidentsiaalsuse tagamiseks palun, et Sa ei maini aine nimetust , teemat ega õppejõu nime. Analüüsi maht on umbes viis-seitse lauset. Analüüsis tuleb kasutada sellised mõisted: sisukus/sisutus, emotsionaalsus/tuimus, lihtsus/keerukus, tihedus/hõredus. Alusta palun nii: \"Mina tahan/ei taha olla selline õppejõud, kelle loeng...\".\nValmistöö palun esitada foorumis \"Analüüs\", tähtajaks on 29.10.2018.\n\nb) Põgusalt tutvuda artikliga huumorist inglise keeles või kokkuvõtega eesti keeles ning olla valmis võta sel teemal sõna seminaris.\n\nc)* Need, kes pole veel \"tööle kandideerinud\" tuleb seda teha vastavalt kuulutuses olevale infole.."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {}}], "grade_preconditions": {"et": "Kõikide aruannete õigeaegne esitamine"}, "grade_evaluation": {"et": "arvestus"}, "debt_elimination": {"et": "Kordusarvestuse peab sooritama hiljemalt järgneva semestri alguseks."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "https://moodle.ut.ee/course/search.php?search=LTFY.01.018", "recommended_materials": "https://moodle.ut.ee/course/search.php?search=LTFY.01.018"}, "participants": {"lecturers": [{"person_uuid": "b98e7bb4-b3fd-e8c4-bbd3-2d1a6ca372e9", "person_name": "Svetlana Ganina", "structural_unit": {"code": "LTFY01KF", "name": {"en": "Centre for School Physics", "et": "koolifüüsika keskus"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-16.n. 3L,S n-s => A"}, "entries": [{"time": "2018-09-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatus. Mis on erialane edu? Õppekavade tutvustus. K. Tarkpea esinemine."}}, {"time": "2018-09-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "SWOt analüüs, Eneseanalüüs. Elukell. Eesmärgid"}}, {"time": "2018-09-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Üldised suhtlemisoskused: Oskus ennast mõistetavalt väljendada; Kuulamisoskus; Eneserefleksioon; Probleemid suhtlemisel; Tõhusa enesejuhtimise võtted, aja planeerimine; Prioriteetide seadmine; Väärtused.\nAja efektiivne planeerimine: Asendustegevused; Ülesannete edasilükkamise põhjused; Hea planeerimise võtted"}}, {"time": "2018-09-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Selle aine ettekanded; Kuulajate kaasamine; Kuulajaskonnaga arvestamine; Küsimuste esitamine"}}, {"time": "2018-10-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-10-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-10-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-10-23", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-10-30", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-11-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-11-13", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"time": "2018-11-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-11-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-12-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-12-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2018-12-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "54165b3c-ff6f-3cfd-0822-4a591065928a", "parent_code": "LTFY.01.018", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}