{"uuid": "b969e7a5-c4b1-de15-6bb3-ce82333c4273", "code": "LTFY.05.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Atmospheric and Climate Sciences", "et": "Atmosfääri- ja kliimateadused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY05", "structural_unit_name": {"en": "Department of Bio and Environmental Physics", "et": "bio- ja keskkonnafüüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY05", "name": {"en": "Department of Bio and Environmental Physics", "et": "bio- ja keskkonnafüüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will introduce main physical and chemical processes in atmosphere and whole climate system, their connections, mathematical apparatus for the description and measurement methods.", "et": "Kursus tutvustab atmosfääris ning kogu kliimasüsteemis aset leidvaid põhilisi füüsikalisi ning keemilisi protsesse ja nende protsesside omavahelisi seoseid, nende kirjeldamiseks kasutatavat matemaatilist aparaati ning nende mõõtmiseks kasutatavaid meetodeid."}, "objectives": [{"en": "To give an overview of atmospheric physical and chemical processes with mathematic methods. To describe the connections and dynamics in climate system.", "et": "Anda ülevaade meie elukeskkonnas, atmosfääris, toimuvate füüsikaliste ja keemiliste protsesside selgitus koos matemaatilise kirjeldusega. Näidata kliimasüsteemisiseseid  seoseid ning dünaamilisust."}], "learning_outcomes": [{"en": "After completing the course the student ", "et": "Pärast kursuse läbimist üliõpilane "}, {"en": "1) has an overview of main chemical reactions in atmosphere, its chemical composition and measurement methods;", "et": "1) omab ülevaadet atmosfääri tähtsamatest keemilistest reaktsioonidest, keemilisest koostisest ning selle mõõtmismeetoditest; "}, {"en": "2) has a quantified understanding of connections between the structure, composition and dynamics of the atmosphere using simplified equations;", "et": "2) omab kvantitatiivset arusaama atmosfääri struktuuri, koostist ja dünaamikat kirjeldavate suuruste seostest ning suudab neid arvutada lihtsaid valemeid kasutades; "}, {"en": "3) is able to explain the global energy budget;", "et": "3) suudab selgitada globaalset energiabilanssi; "}, {"en": "4) will explain the feedbacks and inner unstability mechanisms of climate system;", "et": "4) selgitab kliimasüsteemi tagasisidemeid ning sisemise muutlikkuse mehhanisme; "}, {"en": "5) can discuss the climate change causes including anthropogenic causes.", "et": "5) oskab arutleda kliimamuutuse põhjuste, sh inimtegevuse kliimamõjude üle."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}