{"uuid": "9fc78012-5abf-0d3c-16c2-67f707fdaab0", "code": "LTFY.01.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Mechanics at Lower Secondary School", "et": "Mehaanika õpetamine põhikoolis"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Topics covered:\nMechanics in the curriculum of lower secondary school.\nDemo experiments and practical works and methods of conducting them.\nApplication of learning methods of physics in teaching mechanics.\nMechanics in nature and technology.\nIn the course of work we will familiarize us with all the topics covered in lower secondary school mechanics and with at least one school mechanics textbook.", "et": "Läbitavad teemad: \nMehaanika põhikooli õppekavas.\nMehaanika demokatsed ja praktilised tööd ning nende läbiviimise meetodid.\nFüüsika õppemeetodite rakendamine mehaanika õpetamisel.\nMehaanika looduses ja tehnoloogias.\nTöö käigus tutvume kõikide põhikooli mehaanikas käsitletavate teemadega ja vähemalt ühe mehaanika kooliõpikuga."}, "objectives": [{"en": "The aim of the course is to prepare the student for teaching mechanics at lower secondary school:", "et": "Aine eesmärgiks on valmistada üliõpilast ette mehaanika õpetamiseks põhikoolis:"}, {"en": "to give extended knowledge of mechanics,", "et": "anda süvendatud ja laiendatud teadmised mehaanikast,"}, {"en": "to help them acquire the technology and methodology needed for conducting practical works and demo experiments in lower secondary school", "et": "aidata tal omandada põhikooli mehaanikas tehtavate demokatsete ja praktiliste tööde tehnika ning õppemeetodid,"}, {"en": "and to give practical skills of applying different methods for teaching mechanics.", "et": "anda praktilised oskused erinevate õppemeetodite rakendamiseks mehaanika õpetamisel."}], "learning_outcomes": [{"en": "The student", "et": "Tudeng"}, {"en": "1. Is able to recognize problems related to mechanics in the environment surrounding us.", "et": "1. Oskab märgata mehaanikaga seotud füüsikalisi probleeme meid ümbritsevas keskkonnas."}, {"en": "2. Uses the laws of physics for analyzing mechanics problems.", "et": "2. Kasutab mehaanika probleemide analüüsimisel füüsikaseadusi."}, {"en": "3. Can use basic demo equipment and choose suitable equipment for teaching different topics in mechanics.", "et": "3. Oskab kasutada peamisi mehaanikanähtusi demonstreerivaid katsevahendeid ja kasutab neid asjakohaselt mehaanika teemade õpetamisel."}, {"en": "4. Knows the purpose and principles of working out and organizing practical works in mechanics for lower secondary school.", "et": "4. Tunneb põhikooli sobivate mehaanika laboritööde eesmärke ning nende koostamise ja läbiviimise põhimõtteid. "}, {"en": "5. Knows and follows safety requirements for demo experiments and practical works in mechanics.", "et": "5. Teab ja järgib mehaanika demonstratsioonkatsetel ja praktilistel töödel tarvilikke ohutusnõudeid. "}, {"en": "6. Can find suitable information sources in literature and on the Internet.", "et": "6. Oskab leida teemakohaseid allikaid kirjandusest ja internetist."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}