{"uuid": "30bfbfcb-659b-0bde-aa7e-17709e364053", "code": "LTFY.02.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Development of Materials I: Classes of Materials and Composites", "et": "Materjaliarendus I: materjaliklassid ja komposiidid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students solve problems of choice and development of materials. They collect and analyze data about availability, properties and design options of materials necessary for given applications, and propose solutions to the problems of choice and design of materials.", "et": "Üliõpilased lahendavad materjalide valiku ja arendusega seotud probleeme, kogudes ja analüüsides infot etteantud rakendusteks vajalike materjalide olemasolu, omaduste ja  disainivõimaluste kohta ning pakkudes välja probleemide lahendamise võimalusi."}, "objectives": [{"en": "The goal of the course is development of the skills of students to solve problems in materials design, and to give supplementary knowledge about technological and structural materials, their properties, technologies and applications.", "et": "Eesmärgiks on üliõpilaste materjaliarenduslike probleemide lahendamise oskuse arendamine. Kinnistatakse teadmisi tehno- ja struktuursetest materjalidest, nende omadustest, valmistamise ja töötlemise tehnoloogiatest ning rakendustest."}], "learning_outcomes": [{"en": "After the course a student has systematic overview and broad-based knowledge about modern technological and structural materials, their properties, technologies and applications. He/she  is able to participate in reasearch of materials, can gather, analyze and present the results.", "et": "Kursuse läbinud üliõpilane omab süsteemset ülevaadet ja laiapõhjalisi teadmisi kaasaegsetest tehnomaterjalidest ja struktuursetest materjalidest, nende omadustest, tehnoloogiatest ja rakendusvaldkondadest. Ta on valmis osalema materjaliteaduse uurimistegevuses ning oskab erialaseid teadmisi koguda, analüüsida ja esitada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}