{"uuid": "341a9595-e026-41fd-4e11-4cd3832d99e5", "code": "LTFY.04.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Mathematical Physics", "et": "Matemaatiline füüsika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY04", "structural_unit_name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY04", "name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "c23543a7-4d2e-fe69-c98d-c62f8e3e89f4", "code": "MTMM.00.340", "title": {"en": "Calculus I", "et": "Kõrgem matemaatika I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "06011bf0-74f4-d033-f7de-be9d4607a262", "code": "MTMM.00.341", "title": {"en": "Calculus II", "et": "Kõrgem matemaatika II"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-03T13:33:30"}]}, "overview": {"description": {"en": "The course starts with the overview of mathematical methods applied to physical applications.\nIn the course we focus on the following subjects:  vector- and tensor algebra in Euclidean 3-space, main operations of the vector- and tensor analysis, foundations of differential geometry, calculation of line and surface integrals, main theorems of vector analysis.", "et": "Loengukursuses esitatakse matemaatilised seaduspärasused seostatult füüsikaliste rakendustega. Käsitletakse järgmisi matemaatilisi teemasid ja nende füüsikalisi rakendusi: vektor- ja tensoralgebra 3-mõõtmelises eukleidilises ruumis, vektor- ja tensoranalüüsi põhioperatsioonid, diferentsiaalgeomeetria alused, joon- ning pindintegraalid ja nende arvutamine, vektoranalüüsi põhiteoreemid."}, "objectives": [{"en": "Provide a mathematical foundation for understanding of the subsequent courses in theoretical physics.", "et": "Anda matemaatiline aluspõhi edaspidiste teoreetilise füüsika kursuste mõistmiseks."}], "learning_outcomes": [{"en": "+ understands the need to extend the class of scalar functions, knows the concept of vector and tensor fields and their transformation rules in coordinate transformations,", "et": "+ mõistab vajadust skalaarsete funktsioonide klassi laiendamiseks, tunneb vektor- ja tensorvälja mõistet ning nende teisenemist koordinaatteisendustel, "}, {"en": "+ is able to use vector and tensor algebra and analysis in 3-dimensional Euclidean space, is familiar with the concepts and can be able to calculate scalar, vector and tensor field gradients and divergences and vector field rotor,", "et": "+ oskab kasutada vektor- ja tensoralgebra ning analüüsi 3-mõõtmelises eukleidilises ruumis, sealhulgas tunneb ja oskab arvutada skalaar-, vektor- ja tensorvälja gradienti ja divergentsi ning vektorvälja rootorit,"}, {"en": "+ understands the physical meaning of gradient, divergence and rotor,", "et": "+ mõistab gradiendi, divergentsi ja rootori füüsikalist tähendust,"}, {"en": "+ can calculate line, surface and space integrals and use related integral theorems,", "et": "+ oskab arvutada joon-, pind- ja ruumintegraale ning kasutada neid omavahel siduvaid integraalteoreeme, "}, {"en": "+ is able to find the eigenvalues and eigenvectors of the matrix, to bring the matrix to the normal form of Jordan and to apply this skill in the study of the fixed points of a dynamic system by writing approximate solutions,", "et": "+ oskab leida maatriksi omaväärtuseid ja omavektoreid, viia maatriksi Jordani normaalkujule ning rakendada seda oskust dünaamilise süsteemi püsipunktide uurimisel ligikaudsete lahendite kirjapanekul,"}, {"en": "+ knows the basic concepts of dynamical systems such as phase trajectory and phase portrait, fixed point and its types, bifurcation, deterministic chaos.", "et": "+ tunneb dünaamiliste süsteemide põhimõisteid nagu faasitrajektoor ja faasiportree, püsipunkt ja selle tüübid, bifurkatsioon, determineeritud kaos."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}