{"uuid": "6004936f-652b-3b10-3623-ebfffabc322b", "code": "LTFY.02.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Theoretical Principles of Materials Science", "et": "Materjaliteaduse teoreetilised alused"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY02", "structural_unit_name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY02", "name": {"en": "Department of Materials Science", "et": "materjaliteaduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of the main concepts and models used to describe  structure and properties of materials. Respective problems are solved in practice lessons.", "et": "Kursuses käsitletakse põhilisi tahkisefüüsika kontseptsioone ja mudeleid, mis on kasutusel materjalide struktuuri ja omaduste kirjeldamisel. Harjutustundides lahendatakse vastavaid ülesandeid."}, "objectives": [{"en": "The goal of the course is to give a systematic picture of the models and concepts of solid state physics and quantum mechanics for describing structure and properties of materials, and for choice and design of materials for several applications.", "et": "Kursuse eesmärk on anda süsteemne ettekujutus tahkisefüüsika ja kvantmehhaanika mudelitest ja kontseptsioonidest materjalide struktuuri ja omaduste kirjeldamiseks ja materjalide valikuks ning disainiks erinevate rakenduste tarbeks."}], "learning_outcomes": [{"en": "After the course the student has a picture of models and concepts of solid state physics and quantum mechanics for describing  materials, on the basis of these models he/she is able to perform calculations of materials properties and choose  materials for several applications.", "et": "Kursuse läbinu omab ettekujutust tahkisefüüsika ja kvantmehhaanika mudelitest ja kontseptsioonidest materjalide kirjeldamiseks, oskab nendest lähtuvalt sooritada materjalide omaduste arvutusi ja valida materjale erinevate rakenduste tarbeks, oskab kavandada sellesuuunalisi uurimis- ja arendustöid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}