{"uuid": "6c0a94cc-4c8c-8048-0ab9-ef39682b5dd6", "code": "LTFY.04.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Quantum Computing: Theory and Practice", "et": "Kvantarvutuse alused: teooria läbi praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY04", "structural_unit_name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTFY04", "name": {"en": "Department of Theoretical Physics", "et": "teoreetilise füüsika osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY", "is_expired": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an introduction into the basics of quantum computing focussing on problem solving and practical programming while using only a minimal amount of the theory of quantum mechanics. The course is taken before students have completed an advanced mathematics or a quantum physics course", "et": "Kursuse eesmärk on anda algteadmised kvantarvutusest läbi ülesannete ja praktilise programmeerimise ja minimaalse kvantmehaanika teooria. Kursuse eelduseks ei ole kvantmehaanika kursuse läbimine.\n\nNB! Kursus on küll inglise keeles (kui vähemalt üks osavõtja ei valda eesti keelt), kuid soovi korral vastame küsimustele ning anname konsultatsiooni ja tagasisidet eesti keeles."}, "objectives": [{"en": "The aim of the course is to teach basic skills in quantum programming.", "et": "Kursuse eesmärgiks on anda kvantarvutite programmeerimisoskus elementaarsel tasemel."}], "learning_outcomes": [{"en": "The sudent who passes the course", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- has mastered the notion of a two dimensional quantum system: state, unitary evolution of state, measurement", "et": "- on omandanud 2-dimensionaalse kvantsüsteemi mõiste: olek, oleku unitaarne evolutsioon, mõõtmine;"}, {"en": "- is able to describe the behavior of a two dimensional quantum system on the Bloch sphere", "et": "- oskab kirjeldada 2-tasemelise kvantsüsteemi käitumist Blochi sfääri abil;"}, {"en": "- has mastered the notion of superposition and entanglement in simple cases", "et": "- tunneb põimituse ja superpositsioon mõisteid ja oskab näitlikustada lihtsamatel juhtudel;"}, {"en": "- has mastered the notion of a digital quantum computer: quantum bit (qubit), gates, circuits, carrying out quantum computation using these elements", "et": "- on omandanud digitaalse kvantarvuti mõiste: kvantbitt, ahelad, väratid, kvantarvutuse kirjeldamine nende abil; "}, {"en": "- is able to use free software packages (eg IBM QISKIT or ProjectQ) to compute simple quantum circuits", "et": "- oskab kasutada olemasolevat vabavaralist tarkvara (nt IBM QISKIT või ProjectQ) lihtsamate kvantahelate arvutamiseks;"}, {"en": "- can implement, on a gate-based digital quantum computer such as IBM Q, the time-evolution of a quantum system", "et": "- oskab implementeerida lihtsamate kvantsüsteemide evolutsiooni  väratipõhisel kvantarvutil nagu nt IBM Q."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}