{"uuid": "06f99500-7964-4d39-757b-ff0bd788b50b", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T15:52:50", "title": {"en": "Strategies of Professional Success", "et": "Erialase edu strateegiad"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTFY01", "name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTFY"}, "label": {"en": "25/26 A regular LT", "et": "25/26 S PÕ LT"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTFY01", "structural_unit_name": {"en": "Department of Physics Education", "et": "füüsikahariduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 60, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The physicist's professional career models and their prerequisites are discussed. The theoretical basis of general demands for teaching and public performance are introduced. Reports and team work are used as the methods of teaching.", "et": "Aine õpetamisel kasutatakse ümberpööratud klassiruumi metoodikat, ehk enne igat seminari tuleb iseselsvalt töötada läbi teoreetiline materjal või valmistada ette mõni analüüs.\nTagasiside andmiseks kasutatakse kujundavat hindamist ja kaaslaste vastastiku hindamist.\nTeemad:\n-SWOT analüüs\n-konsulteerimine, nõustamine, nõu andmine, soovitamine.\n-suhtlemisoskused\n-Tõhusa enesejuhtimise võtted, aja planeerimine\n-lühikõned ja -esinemised, sõnumi edastamine, erinevate sihtgruppidega arvestamine, olulise eristamine ebaolulisest, veenmise tehnikad, näitlikustamise võtted\n-Kuulajate kaasamine, kuulajaskonnaga arvestamine, küsimuste sõnastamine ja esitamine, küsimustele vastamine, lühiintervjuud\n-Intervjueerimine, arutelule suunavad küsimused, motiveeriv intervjueerimine\n- Veenmine, argumenteerimine, demagoogia\n- tööle kandideerimine, CV koostamine, motivatsiooni- ja soovituskirja koostamine, tööintervjuu (individuaalne ja gruppiintervjuu)"}, "objectives": [{"en": "The aim of this course is to introduce the MSc students with striking examples to the models of physicist's professional career, prerequisites needed for realizing them and strategies of professional success. As well as to practice various techniques for planning and self-analysis. Another goal is to develop the public communication skills of the students and abilities to describe their own professional work and the importance of it to different level audiences.", "et": "Tutvustada magistrandile markantsete näidete varal erinevaid erialaseid karjäärimudeleid, nende realiseerumiseks vajalikke eeldusi ja edu saavutamise strateegiaid ning harjutada erinevaid planeerimise ja eneseanalüüsi võtteid. Luua võimalused avaliku kommunikatsiooni oskuste arendamiseks ning kujundada suutlikkust efektiivselt tutvustada oma erialast tööd ja selle vajalikkust erineva tasemega kuulajaile."}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to be able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Describe the models of physicist's professional career and prerequisites needed to realize them.", "et": "1. Mõtestab füüsiku erialaseid karjäärimudeleid ja nende realiseerumiseks vajalikke eeldusi."}, {"en": "2. Describe the success strategy relevant to the personally preferred career model and the related problems.", "et": "2. Mõistab personaalselt eelistatud karjäärimudeli edustrateegiat ja sellega seonduvaid probleeme."}, {"en": "3. Implement self-analysis by assessing own strengths and aspects requiring development in planning the professional career.", "et": "3. Teostab eneseanalüüsi hinnates enda tugevusi ja arendamist vajavaid aspekte erialase karjääri planeerimisel."}, {"en": "4. Recognise time planning techniques and implement them when prioritizing and adjusting activities.", "et": "4. Teadvustab ajaplaneerimise võtteid ning rakendab neid oma tegevuste prioritiseerimisel ja korrigeerimisel."}, {"en": "5. Give information related to own profession by taking into account audience's former knowledge and specificity and by using appropriate engagement and visualization methods.", "et": "5. Suudab edastada oma erialaga seotud teavet arvestades auditooriumi eelteadmiste ja eripäradega ning kasutades otstarbekaid kaasamise ja visualiseerimise võtteid."}, {"en": " 6. Formulate questions to hold professional conversation, answer questions competently and give constructive criticism. ", "et": "6. Osaledes erialases diskussioonis suudab sõnastada vestlust arendavaid küsimusi, asjatundlikult vastata küsimustele ja anda konstruktiivset tagasisidet. "}, {"en": "7. Create a CV, a letter of motivation and a reference letter when applying for a job, and have an understanding of participation in individual and group interviews.", "et": "7. Suudab tööle kandideerimisel koostada CV, motivatsiooni- ja soovituskirja ning omab etttekujutust individuaal- ja grupiintervjuul osalemisest."}], "notes": {}}, "grading": {"independent_work": {"et": "Tuleb iseseisvalt läbida pakutud lugemis- ja vaatamisülesandeid ning valmistuda seminarideks."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "a) Tuleb pidada üks lühiettekanne (3 min), mida filmitakse ja edaspidi analüüsitakse.\nb) tuleb pidada ettekanne vabal teemal (10 min), millele antakse tagasiside.\nc) tuleb pidada erialane ettekanne (10 min), mida retsenseeritakse.\n\nIgaühel on vaja retsenseerida vähemalt üht ettekannet."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Tuleb koostada jooksvad aruanded/analüüsid vastavalt õppejõu juhistele ja esitada neid Moodles. Igale tööle antakse tagasiside."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "SWOT"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Potentsiaalsele tööle kandideerimisel tuleb koostada CV, motivatsiooni- ja soovituskiri. Vastavalt saadud tagasisidele tuleb neid vajadusel korrigeerida."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Tuleb koostada essee / kirjalik arutlus (500-700 sõna), mille märksõnadeks on edu, erialane edu, prestii, tunnustus, staatus, strateegiad, planeerimine, analüüs, ühiskonna roll, ühiskonna surve, ootused, õnn, rahulolu, harmoonia, tasu, tulemus jmt."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Tuleb viia iseseisvalt läbi intervjuu, milles harjutatakse motiveerivaid küsimusi. Intervjuud tuleb transkribeerida ja esitada Moodles."}}], "grade_preconditions": {"et": "Kõikide ülesannete õigeaegne esitamine"}, "grade_evaluation": {"et": "Kõikide hinnatavate ülesannete positiivne sooritus"}, "debt_elimination": {"et": "Õppejõuga kokkulepitud tingimustel."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=5321", "is_moodle_connected": false, "mandatory_materials": "https://moodle.ut.ee/course/search.php?search=LTFY.01.018", "recommended_materials": "https://moodle.ut.ee/course/search.php?search=LTFY.01.018"}, "participants": {"lecturers": [{"person_uuid": "b98e7bb4-b3fd-e8c4-bbd3-2d1a6ca372e9", "person_name": "Svetlana Ganina", "structural_unit": {"code": "LTFY01KF", "name": {"en": "Centre for School Physics", "et": "koolifüüsika keskus"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTFY01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2.-16.nädal"}, "entries": [{"time": "2024-09-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2024-09-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ülesanne enne seminari: \na) palun uuri vähemalt kahelt erinevalt allikalt välja mis on SWOT analüüs ja ole valmis seda teistele tutvustama. See on see, millega tegeleme terve kursuse jooksul.\n\nb) postita foorumisse oma arvamus sellest mille poolest sarnanevad ja mille poolsest erinevad tegusõnad: konsulteerima, nõustama, nõu andma ja soovitama. Mitte nende definitsioonid/selgitused, vaid just sarnasused ja erinevused. Seda võib esitada skeemina, tabeline, animatsioonina jmt. Selle teemaga on plaanis järgmisel seminaril edasi minna."}}, {"time": "2024-09-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "a)  Palun tööta läbi raamatu materjal eneväljendusest ja kuulamisest lk 7-13. Igast peatükist selekteeri välja vähemalt viis kandvat mõtet. Ole palun valmis nende punktide alusel esitama seminaris oma arvamus.\n\n\nb) Palun koosta esinemise  analüüs, lähtudes oma kogemusest ja oma isiklikust arvamusest avalikust esinemisest. Hetkel jäta palun välja küsimuste vooru. Analüüsis peab olema vähemalt seitse aspekti, millest lähtutakse (maht on ca 10-15 lauset). Tähelepanu tuleb pöörata nii sisule kui ka vormile. Palun esita töö enne seminari algust foorumis \"Eneseväljendus\"."}}, {"time": "2024-10-01", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "a) vaata palun video Heli Lukneri esinemist: https://www.youtube.com/watch?v=8k2OHvb1kWc, pööra tähelepanu Heli karjääri kujunemisele ning küsimustele, mida on tema käest küsiti. Pane palun  kirja kolm kandvat mõted, mis Heli jutust sind inspireerisid. Millist küsimust sa ise Helile esitaksid? \n\nb) Tutvu palun raamatus lk 89. toodud soovitustega kuidas vastata küsimustele. Mida sa saad siit endale kasutusele võtta?"}}, {"time": "2024-10-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "a) Toetudes Tõnu Lehtsaare raamatu -le Õppejõudude sotsiaalsed ja kommunikatiivsed oskused (lk 9.-10.) koosta Sinu poolt viimati külastatud loengu lühianalüüs. Konfidentsiaalsuse tagamiseks palun, et Sa ei maini aine nimetust, teemat ega õppejõu nime. Analüüsi maht on umbes viis-seitse lauset. Analüüsis tuleb kasutada sellised mõisted: sisukus/sisutus, emotsionaalsus/tuimus, lihtsus/keerukus, tihedus/hõredus. Alusta palun nii: \"Mina tahan/ei taha olla selline õppejõud, kelle loeng...\".\n\nb) Tutvu palun kahe füüsiku kõnega: Aigar Vaigu ja Andres Juur ja analüüsi neid pöörates tähelepane järgmistele aspektidele: kõne struktuur, mõjukus, ilmestamine, selgus."}}, {"time": "2024-10-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ole hea ja tutvu palun Toomas Planki, kui FI direktori kandidaadi platvormi tutvustustusega  ja küsimustele vastamisega: \n\nhttps://web.microsoftstream.com/video/178ef505-3110-44d9-b2e8-61ed35a2f2e6\nSelle alusel palun, et koostad ülevaade, toetudes järgmistele küsimustele:\n\nMillised aspektid kandidaadi jutust võiksid mõjutada sinu, kui füüsiku/füüsika õpetaja karjääri?\nKuidas kirjeldab kandidaat eelmise perioodi edulood ja kuidas see suhestub sinu kogemusega?\nMilliseid muudatusi ootad sina?\nMilline küsimus ja sellele vastamine kõnetas sind kõige rohkem?\nKui mõelda tulevikku, mida sa peaksid/võiksid tegema selleks, et kunagi kandideerida ise FI direktoriks? \nMilliseid küsimusi Sa küsiksid nüüd uutel FI direktori valimisel?"}}, {"time": "2024-10-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "a) Võrdle palun nelja erialast lühiettekannet. Oma võrdlusel tuleb lähtuda järgmistest aspektidest: keele korrektne kasutus, info korrektsus, näitlike materjalide kasutamine, jutu ilmekus ja sisu korrektsus.\n\nb) Vaata TÜ professori Äli Leijeni innugaratsiooni loegut. Analüüsi objektiks on küsimuste voor (alates 45:00). Kommenteeri palun vähemalt kolme esitatud küsimust: selle sisu, vormi, pikkust, ulatust, selgust, seotust ettekandega, korrektsust jmt.\n\nAnalüüsi toetamiseks soovitan kasutada T. Lehtsaare raamatu Õppejõuduse sotsiaalsed ja kommunikatiivsed oskused (Internetist vabalt kättesaadav). \n\nPostita palun tulemused siin foorumis."}}, {"time": "2024-10-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Palun intervjueeri üht inimest, kes on sinu hinnangul erialaselt edukas. See võib olla su naaber, vanaisa, kooli õpetaja, äripartner, õppejõud vmt. Vormista selle intervjuu tulemused potentsiaalse artiklina UT ajakirjasse, Lisa sinna sobiv pealkiri, pilt ja kujundus ning esita pdf-i siin foorumis. Tähtajaks on 07.11. Intervjuu küsimuste arv pole piiratud, aga pead arvestama sellega, et sinu tekstile on ajakirjas ettenähtud kaks lehekülge. Püüa esitada sellised küsimused, mis aitavad intervjueeritaval avada oma erialase edu tagamaad."}}, {"time": "2024-11-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Tänasel seminaril mainisime multimodaalsuse teemat ja selleks, et me edaspidi saaksime analüüsida esinemisi ka sellest aspektist lähtudes, palun, et valid SIIT üks artikkel ja tutvud sellega. Kui kavatsed 14.11. seminaris osaleda, siis tulemusi pole vaja siia postitada, kuid ole palun valmis ca 1 min jooksul sellest rääkima ehk võtta loetu kohta."}}, {"time": "2024-11-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Vaata palun  videot Tanel Ainla esinemisest ja tutvu Teofilus Tõnnissoni esinemisega siin.\n\nKoosta palun esinemise analüüs lähtudes multimodaalsusest (kehakeel, keha asend, lisavahendid, kõne tempo jmt). Põimi palun analüüsi sisse ka esitatud küsimustele vastused. Analüüsi pikkuseks on ca 20 lauset. Tulemused esita siin foorumis."}}, {"time": "2024-11-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "a) Tutvuge Martin Luther Kingi 1963 a. kõnega. Koostada kõne analüüs lähtudes järgmistest punktidest: kõne struktuur, kõne faasid, kõne tempo, kehakeel, estid, pausid, publiku reaktsiooniga arvestamine ja kõne sõnum. Analüüsi maht on ca 10 lauset ja seda tuleb esitada siin foorumis.\n\nb) Tutvu palun Physicumis toimunud Nobeli preemiate ettekandega. Ole palun valmis seminaris arutleda teemadel: sihtrühmaga arvestamine, kõne selgus, visuaalsete materjalide kasutamine, publiku kaasamine."}}, {"time": "2024-11-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "teeme erialased/füüsikaalased ettekanded lühikõne formaadis  ehk lühiesinemine on 4-6 minutit. Täpsema fookuse vali panun ise variantide A ja B vahel:\n\nA. Saad teha ettekande gümnasistidele  nende teemade vahel, mis on siin foorumi all Vikis. (kui valik on tehtud, siis tõsta see teema tabelisse, et keegi teine seda enam valida ei saaks naeratus)\n\nB. Saad tutvustada oma füüsikaalast uurimisvaldkonda, millega plaanid tegeleda magistritöös või mida sa tegid bakas (rõhutan, et tegemist peab olema füüsikaga). Ja sihtrühma valid meie eelmistest sihtrühmadest: matemaatika õpetajad, pensionäärid jne.\n\nPäära palun tähelepanu multimodaalsusele ja eriti visuaalsele komponendile: pildid, joonised, tahvli kasutamine, asja näitamine jmt."}}, {"time": "2024-12-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2024-12-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"time": "2024-12-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Eneseanalüüs koosneb kahest osast:\n\n1.  Oma õppimise analüüs (eneserefleksioon): vaata palun kõik tegevused, mis olid selle aine jooksul seminarides ja iseseisva töö raames tehtud (raamatu lugemine, esinemised, esinemiste analüüs, ajaplaneerimine, külalised, videod, intervjuu, dispuut, arutelud...) ning too välja nendest viis, mis Sinule kõige rohkem sobisid. Kui oled oma valiku teinud, siis kirjelda palun neid põhjusi, mis panid Sind tegema just sellist valiku. Kas see oli Su jaoks uudne? huvitav? avardas silmaringi? pani teistmoodi mõtlema? pani analüüsima ennast? ärritas? vmt. \n\n2. Sinu karjääri SWOT analüüs, lähtuda soovitan mudelist, mis on toodud siin: https://leanway.ee/swot-analuus/.\n\nSelles eneseanalüüsis pole õigeid ega valeid vastusi, seminaris saad tutvustada selle, mis sul tuli välja ja korraldame arutelu."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "54165b3c-ff6f-3cfd-0822-4a591065928a", "parent_code": "LTFY.01.018", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}