{"uuid": "d4182643-04b4-59de-4e27-52d1dc2acf81", "code": "LTGI.00.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Theoretical and Philosophical Aspects of Genomics / Creative Thinking", "et": "Teoreetilised ja filosoofilised aspektid genoomikas"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTGI", "structural_unit_name": {"en": "Institute of Genomics", "et": "genoomika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTGI", "name": {"en": "Institute of Genomics", "et": "genoomika instituut"}, "email": "info.genoomika@ut.ee", "phone": "+372 737 5029", "webpage_url": "https://genoomika.ut.ee", "address": "Riia 23b/2\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23b/2", "zip": "51010", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 7, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Every PhD student chooses together with the supervisor one book (extended essay) on philosophical aspects of biology, genomics. To give an example: Griffiths, P., & Stotz, K. (2013). Genetics and Philosophy: An Introduction (Cambridge Introductions to Philosophy and Biology). Cambridge: Cambridge University Press. doi:10.1017/CBO9780511744082. The student will read the book and discuss it in a seminar before all PhD students (and interested audience from the institute and beyond). There will be 23 such seminars per semester. This means that each student will get deep understanding of one line of thought and an overview of another 8-12 through the discussion seminars.", "et": "Iga PhD tudeng valib koostöös juhendajaga välja ühe raamatu (või pikema essee), mis käsitleb bioloogia, genoomika jms üldisi, filosoofilisi jne aspekte. Näitena võib tuua Griffiths, P., & Stotz, K. (2013). Genetics and Philosophy: An Introduction (Cambridge Introductions to Philosophy and Biology). Cambridge: Cambridge University Press. Tudeng töötab materjali läbi ja tutvustab loetut seminaril, kus osalevad kõik genoomika eriala PhD tudengid (ja huvitatud kuulajad genoomika instituudist ja mujalt ülikoolist). Nii tekib genoomika eriala doktorantidel põhjalik ülevaade nende poolt valitud teemakäsitlusest kui ka üldine ülevaade laiemalt genoomikaga seotud filosoofilistest küsimustest. Selliseid seminare on 2-3 semestris. Seega valmistab doktorant õpingute jooksul ette ühe seminari ning tutvub kokku 8-12 teemakäsitlusega."}, "objectives": [{"en": "The main objective of this course  is to promote thought on broader philosophical categories in and around the realm of genomics.", "et": "Aine peamiseks eesmärgiks on toetada PhD tudengite mõtisklusi genoomikaga seotud laiematest filosoofilistest aspektidest."}], "learning_outcomes": [{"en": "PhD students who have passed this course will have the ability to think in terms of broader philosophical categories in and around the realm of genomics and analyse and discuss ethical issues in the filed.", "et": "Aine läbinud dokorandid omandavad oskuse mõelda genoomikaga seotud laiematest filosoofilistest aspektidest ning analüüsida valdkonnaga seotud eetilisi aspekte."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}