{"uuid": "afce580d-3aa5-48f5-2ad4-c80068349f5a", "code": "LTKT.00.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Professional Practice in Chemistry", "et": "Erialane praktika keemias"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT", "structural_unit_name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTKT", "name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "email": "chemistry@ut.ee", "phone": "+372 737 5261", "webpage_url": "https://chem.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "A professional internship course designed for those who have chosen the specialty of chemistry to develop and practice their professional skills with a research group or company. Within the framework of this subject, the student completes an internship in a work group or company closely related to chemistry. At the end of the internship, the student submits a written report of the knowledge gained, together with an overview of the practical work done in the internship. The report shall be presented in the form of an oral report to be opposed. Internship reports are defended at least once a semester before a committee appointed by the Director of the Institute of Chemistry.", "et": "Erialane praktikakursus, mis on mõeldud keemia eriala valinutele erialaste oskuste täiendamiseks ja praktiseerimiseks uurimisgrupi juures või ettevõttes. Käesoleva õppeaine raames läbib tudeng praktika mõnes keemiaga lähedalt seotud töögrupis või ettevõttes. Praktika lõpus esitab tudeng kirjaliku aruande saadud teadmisest koos ülevaatega praktika raames läbi viidud praktilistest töödest. Arvestuse saamiseks esitatakse aruanne oponeeritava suulise ettekandena. Praktika aruannete kaitsmine toimub vähemalt kord semestris Keemia Instituudi direktori poolt määratud komisjoni ees."}, "objectives": [{"en": "The aim of the course is to provide students with practical work experience in a research or work group or in a company in the field of research and development in a research laboratory, company or research institution of their choice. The principles of operation of institutions, basics of organization of research and development, ways of evaluating work efficiency are examined. Participation in research projects, creation of intellectual property, introduction to the legal, economic and quality assurance system of the company's activities.", "et": "Kursuse eesmärgiks on anda üliõpilastele praktiline töökogemus uurimis- või töögrupis või ettevõttes teadustöö ja arendustöö vallas, mis toimub praktika kohaks valitud teaduslaboris, ettevõttes või uurimisasutuses. Tutvutakse asutuste tegevuse põhimõtetega, uurimistöö ja arendustöö korralduse alustega, töö tulemuslikkuse hindamise viisidega. Võetakse osa teadusprojektidest, intellektuaalse omandi loomisest, tutvutakse ettevõtte tegevuse juriidiliste, majanduslike ning tegevuse kvaliteeti tagava süsteemi alustega."}], "learning_outcomes": [{"en": "After passing the subject student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. have acquired practical practical experience;", "et": "1. on omandanud erialase praktilise töö kogemuse;"}, {"en": "2. is able to work in a team;", "et": "2. oskab töötada meeskonnas;"}, {"en": "3. can adapt to daily work routine;", "et": "3. oskab kohaneda igapäevase töörutiiniga;"}, {"en": "4. have an overview of the specific working group, its working environment, market potential, practical aspects of working group management and career opportunities in general;", "et": "4. omab ülevaadet konkreetsest töögrupist, selle töökeskkonnast, turupotentsiaalist, töögrupi juhtimise praktilistest külgedest ja karjäärivõimalustest üldiselt;"}, {"en": "5. Is aware of his / her role in the given work group: overview of the problem, purpose of the practice, specific tasks of the trainee, results of work;", "et": "5. teab oma rolli antud töögrupis: ülevaadet probleemist, praktika eesmärgist, praktikandi spetsiifilistest ülesannetest, töötulemustest;"}, {"en": "6. is able to analyze what he or she has used in practice at university, what has been useful and what needs to be changed or adapted in the learning process;", "et": "6. oskab analüüsida, mida ülikoolis õpitust on ta praktilisest tegevuses kasutanud, mis on tulnud kasuks ja mida oleks vajalik muuta või kohendada õppeprotsessis;"}, {"en": "7. Is able to analyze how the experience and knowledge gained in the working group has improved his / her university education;", "et": "7. oskab analüüsida, kuidas töögrupis omandatud kogemused ja teadmised on täiendanud tema ülikooliharidust;"}, {"en": "8. Is able to make periodic self-reflections on how the set goals have been achieved and can set goals for a new reflection period.", "et": "8. oskab teha perioodilisi enesereflektsioone, kuidas seatud eesmärgid on täitunud ja oskab seada eesmärke uueks reflektsiooniperioodiks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}