{"uuid": "5a62b55e-227b-999a-05dc-c6137aee3b12", "code": "LTKT.09.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Laboratory Works in Organic Synthesis", "et": "Orgaanilise sünteesi eripraktikum"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT09", "structural_unit_name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "24486b8a-142f-c540-781e-1f889d9cea3a", "code": "LOKT.09.004", "title": {"en": "Organic Chemistry I", "et": "Orgaaniline keemia I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "8dc878ed-3ef6-a9ed-710b-a31b793822ac", "code": "LOKT.09.015", "title": {"en": "Practical Work in Organic Chemistry", "et": "Orgaanilise keemia praktikum"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "2e7a8276-7248-aafc-7711-f400b25470b2", "code": "LOKT.09.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Work in Organic Chemistry", "et": "Orgaanilise keemia praktikum"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "c81a4503-8077-44b0-c136-a6f2547cd229", "code": "LTKT.09.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Work in Organic Chemistry", "et": "Orgaanilise keemia praktikum"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}]}, "overview": {"description": {"en": "During the practical course, each student will conduct a single multi-step synthesis. Students will plan and perform their synthesis, purify and analyse final product(s). A report will be compiled and presented.", "et": "Praktikumi käigus teostatakse üks mitmeetapiline süntees. Alustatakse sünteesi planeerimisest, teostatakse  lõpp-produktide (vajadusel lähteainete, vaheproduktide) puhastamine ja täielik struktuuranalüüs. Samuti kasutatakse otsinguid andmebaasides ja vajadusel kvantkeemilisi arvutusi ja spektrite simuleerimist. Koostatakse aruanne."}, "objectives": [{"en": "To give the students practical knowledge about to plan and perform independently the modern synthesis as well the methods for determination of the purity and structure of compounds.", "et": "Anda üliõpilasele praktilised oskused kaasaegse orgaanilise sünteesi iseseisvaks planeerimiseks, teostamiseks ning ainete puhtuse ja struktuuri analüüsimiseks."}], "learning_outcomes": [{"en": "Students should be able to plan the synthetic work from chemical and also from technical point of view.", "et": "Üliõpilased peavad oskama sünteesiskeemi keemiliselt ja kogu projekti tehniliselt ise planeerida. Nad peavad teadma retrosünteesi põhialuseid."}, {"en": "Students should know where to get and how to handle the chemical information (methods, mechanisms, properties, safety etc.), work with data bases. They should know how to evaluate different synthetic or separation methods.", "et": "Üliõpilased peavad tundma infootsingu ja sünteesimeetodite hindamise põhimõtteid."}, {"en": "Students should know the modern method of purification of starting materials, products and solvents.", "et": "Üliõpilased peavad tundma ainete (lähteainete, produktide, lahustite) puhastamise meetodeid."}, {"en": "Students should know the main methods of working with air and moisture sensitive compounds. Deep freezing and high heating.", "et": "Üliõpilased peavad teadma niiskuse- ja hapnikutundlike ainetega töötamise meetodeid,  jahutamise ja kuumutamise meetodeid."}, {"en": "Students should be able independently to follow the synthesis processes using different methods and make the decision if neccessary.", "et": "Üliõpilased peavad oskama iseseisvalt teostada sünteese, jälgima erinevate meetoditega nende kulgu ning võtma töö käigus vastu otsuseid."}, {"en": "Students should see any details of experiment in order to take them into account in next steps or repeated syntheses.", "et": "Üliõpilased peavad oskama teha eksperimendi käigus tähelepanekuid, mis võivad mõjutada tulemusi ning mida on tarvis tulevikus arvesse võtta."}, {"en": "Students shoul know the methods for determination of the purity and structure of separated compounds.", "et": "Üliõpilased peavad teadma meetodeid, millega määrata eraldatud produktide puhtust ja tõestada nende struktuuri."}, {"en": "Students should be able to report hes (or her) work in any step of general project.", "et": "Üliõpilased peavad oskama oma eksperimendi käigust jooksvalt aru anda."}, {"en": "Students should know how to write the report according to requirements, discuss it and do the presentation.", "et": "Üliõpilased peavad oskama kirjutada nõuetele vastava aruande oma eksperimentaalse töö kohta, seda analüüsima ja esitama."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}