{"uuid": "33ec1393-b28b-2a60-9b50-907f28854bfc", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-28T11:57:01", "title": {"en": "Applied Electrochemistry", "et": "Rakenduselektrokeemia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT02", "name": {"en": "Chair of Physical Chemistry", "et": "füüsikalise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "label": {"en": "25/26 A regular LT Eng", "et": "25/26 S PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT02", "structural_unit_name": {"en": "Chair of Physical Chemistry", "et": "füüsikalise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Some more general topics in the field of applied electrochemistry will be studied. Various cyclic voltammetry methods, rotating disc and rotating ring disc techniques, chronoamperometry, chronopotentiometry, electrochemical impedance spectroscopy, ellipsometry methods will be characterised. More general methods for electroanalysis will be discussed. The applicability limits of various experimental methods for electroanalysis and electrochemical studies will be discussed. Also the quantum chemical models for the electrical double layer structure, adsorption of organic molecules and ions as well as for electrochemical kinetics will be analyzed. The basic principles of various electrochemical energy storage devices (supercapacitors, batteries) will be given.", "et": "Käsitletakse rakenduselektrokeemia olulisemate uurimismeetodite - tsüklililise voltammeetria, pöörleva ketaselektroodi, rõngaga pöörleva ketaselektroodi, kronoamperomeetria, kronopotentsiomeetria, elektrokeemilise impedantsspektroskoopia, ellipsomeetria - põhialuseid ja rakenduspiire. Samuti analüüsitakse elektrilise kaksikkihi, orgaaniliste ühendite ja ioonide adsorptsiooni ja elektrokeemilise kineetika kvantkeemilisi mudeleid. Analüüsitakse erinevate elektrokeemiliste energiasalvestusseadmete (superkondensaatorid, patareid) tööprintsiipe."}, "objectives": [{"en": "To give an overview of more common methods for use in applied electrochemistry. To apply some of the most important methods and their applications to solve practical problems. To analyze the construction, working principles and applicability of different energy storage devices (supercapacitors, batteries).", "et": "Anda ülevaade elektrokeemiliste uurimismeetodite olulisematest rakendusaladest. Tutvustada mõningaid olulisemaid meetodeid ja nende rakendusvõimalusi praktiliste probleemide lahendamiseks. Analüüsida erinevate energiasalvestusseadmete (superkondensaatorid, batteries) ehitust, tööprintsiipe ja kasutusvõimalusi."}], "learning_outcomes": [{"en": "Graduates are able to understand connections between different processes and to apply theoretical knowledge in process planning and use as well as form proper attitudes to encourage creative activities in their speciality, sense of responsibility and life-long learning.", "et": "Oskab käsitleda erinevaid uurimismeetodeid ja näha erinevate protsesside vahelisi seoseid, oskab rakendada teoreetilisi teadmisi protsesside planeerimisel ja kasutamisel kujundada õiged hoiakud erialaliseks loominguliseks tegutsemiseks, vastutuse kandmiseks ja elukestvaks enesetäiendamiseks"}, {"en": "Graduates critically evaluates the problems of modern applied electrochemistry and their solutions in the context of sustainable society development.", "et": "Hindab kriitiliselt kaasaegse rakenduselektrokeemia probleeme ja nende lahendusvõimalusi jätkusuutliku ühiskonna arengu kontekstis."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "About the evaluation:\n* The pre-examination questions can be found from the section of the \"study materials\".\n* A student will take a \"ticket\" containing five questions covering all subjects handled in the course of \"Applied electrochemistry\" before the start of the written examination.\n* Five questions will be selected from the list of the pre-examination questions by the responsible lecturer (Dr. Alar Jänes).\n* The answering to the examination questions includes detail explanation and the presentation of the appropriate equations (with the explanation of the symbols used) and the drawing of the figures/schemes when necessary. \n* Each question can give 10 points.\n* Maximum number of points obtainable is 50.\n\nEvaluation criteria\n\nWhen the student has collected:\n* <50% of maximum points possible, the grade is: \"F\";\n* 50% ... 60% of maximum points possible, the grade is: \"E\";\n* 61% ... 70% of maximum points possible, the grade is: \"D\";\n* 71% ... 80% of maximum points possible, the grade is: \"C\";\n* 81% ... 90% of maximum points possible, the grade is: \"B\";\n* 91% ... 100% of maximum points possible, the grade is: \"A\"."}}], "grade_preconditions": {"et": "The subject ends with a written examination performed after the end of the study time during current term time. For the examination the student takes by her/him self randomly a token containing five questions about the material given and/or read during the study time. The exam is performed successfully when the person examined reflects 50 % of the material given during the study time of this subject. If the question asked presumes the presentation of the formulas or explaining schemes or figures, then they should be presented with the appropriate explanations of the used symbols and terms. The figures are hand-drawn. but they must be drawn clear. The exam will be written individually without the use of the supporting materials (electronic devices included). The examination will be conducted at the time suitable for the students and the \"responsible\" lecturer both. (Before the examination the students have the right for one consultation time where they can ask questions about themes and materials handled during this subject. While this subject is presented by many readers, it is very kindly recommended to ask the questions in the written form directly from the person who presented appropriate theme or to submit the question to the \"responsible\" reader 2 working days before the consultation time.)"}, "grade_evaluation": {"et": "A written examination will be performed in order to control participants knowledges."}, "debt_elimination": {"et": "When the written exam was performed unsuccessfully, the student has two opportunities to re-write the exam (with new questions) during current study-term."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "1. J. Wang, Analytical Electrochemistry, VCH Publishers Inc., 1994.\n2. D. A. Skoog, J. J. Leary, Principles of Instrumental Analysis, 4-th Ed., Saunders College Publishing, 1992.\n3.  P. Atkins, J. de Paula, Atkins' Physical Chemistry (7th Ed), Oxford Univ. Press, Trento, Italy, 2002 (or newer editions).\n4. B.E.Conway, Electrochemical Supercapacitors: Scientific Fundamentals and Technological Applications, Kluwer Academic/Plenum Publishers, New York, 1999.\n5. W.A.van Schekwijk, B.Scrosatti (Eds), Advances in Lithium-Ion Batteries, Kluwer Academic/Plenum, New York, 2001.", "recommended_materials": "1. A.J. Bard, L. Faulkner, Electrochemical Methods: Fundamentals and Applications, John Wiley & Sons, New York, 1980.\n2. J.R. MacDonald (Ed.), Impedance Spectroscopy. Emphasizing Solid Materials and Systems, Wiley, New York, 1987.\n3. A.W. Adamson, Physical Chemistry of Surfaces, Wiley -Interscience Publication, New York, 1990.\n4. G.A. Somorjai, Introduction to Surface Chemistry and Catalysis, Wiley-Interscience Publication, New York, 1994.\n5. A. J. Bard, M. Stratman: Encyclopedia of Electrochemistryk, Vol. 1, Thermodynamics and Electrified Interfaces, E. Gileadi, M. Urbakh (Eds.), Wiley, 2002\n6. A. J. Bard, M. Stratmann, Encyclopedia of Electrochemistry, Vol. 3 Instrumentation and Electroanalytical Chemistry, P. Unwin (Ed.), Wiley-VCH GmbH& Co. KGaA, 2003, Weinheim\n7. A. J. Bard, M. Stratmann, Encyclopedia of Electrochemistry, Vol. 2, Interfacial Kinetics and Mass Transport, A.J. Calvo (Ed.), Wiley-VCH GmbH& Co. KGaA, 2003, Weinheim."}, "participants": {"lecturers": [{"person_uuid": "415ac106-cad4-2032-2b45-624a07bfbfe3", "person_name": "Jaanus Kruusma", "structural_unit": {"code": "LTKT02", "name": {"en": "Chair of Physical Chemistry", "et": "füüsikalise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "bc8bdf10-e3f8-d026-bb83-a73c7882cf6c", "person_name": "Alar Jänes", "structural_unit": {"code": "LTKT05", "name": {"en": "Chair of Applied Electrochemistry", "et": "rakenduselektrokeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "02a63121-4cf8-36e5-f2e3-eeb9e0b7a909", "person_name": "Tavo Romann", "structural_unit": {"code": "LTKT02", "name": {"en": "Chair of Physical Chemistry", "et": "füüsikalise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "8b70a02f-c919-febc-e488-b3d0247b5cfe", "person_name": "Meelis Härmas", "structural_unit": {"code": "LTKT05", "name": {"en": "Chair of Applied Electrochemistry", "et": "rakenduselektrokeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16 n."}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electrochemistry. Electrical current, Ohm law, Faraday rules. Conductivity and resistivity of the materials and solutions."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The electrochemical potential. Equilibrium at the electrodes. Nernst equation. Galvanic semi-cells and electrochemical cells. Electromotoric force of the electrochemical cells."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction to the electrochemical measurements and most common sources of errors. Theory of the charge transfer, measured current and the formation of the electrode potentials."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Corrosion and galvanic processes."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electrodes used in electrochemistry."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electrolysis."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electric double layer."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Electrochemical impedance spectroscopy. Some EIS applications. Analysis of the surface area of solid electrodes by impedance spectroscopy and dependence of impedance on ac frequency. Solving reaction mechanisms by EIS. Using capacitance for determination of concentration or adsorption characteristics of organic and inorganic compounds."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Characterization of porous materials by electrochemical methods. Comparison with BET analysis."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Supercapacitors. Electrical double layer capacitors. Pseudo capacitors. Hybrid capacitors."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "High voltage capacitors with graphene-based electrodes and ionic liquid electrolyte."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Materials for supercapacitors, preparation, physical and electrochemical characteristics."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Batteries. Thermodynamics in batteries and application of Nernst equation. Primary batteries."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Secondary batteries: Lead-acid, Ni-Cd, Ni-MH, Li-ion, Redox-flow."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Materials for batteries: preparation, physical and electrochemical characteristics."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "bf14f5b1-07a3-6a0d-8186-792e4091ee13", "parent_code": "LTKT.02.007", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}