{"uuid": "73117ee5-6637-bbce-adb9-7cbe89a28e3d", "code": "LTKT.06.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Analytical Chemistry", "et": "Analüütilise keemia põhikursus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT06", "structural_unit_name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT06", "name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Fundamentals of analytical chemistry: general aspects of analytical chemistry, gravimetry, titrimetry (acid-base, complexometric, redox), potentiometry, chromatography (GC and LC), atomic (AAS, AES, Atomic mass spectrometry) and molecular spectroscopy (UV-Vis, IR and mass spectrometry), sampling, sample preparation, data treatment in analytical chemistry.", "et": "Algteadmised analüütilisest keemiast: proovi võtmine ja eeltöötlus, gravimeetria, titrimeetria, potentsiomeetria, kromatograafia, aatom- ja molekulspektroskoopia, andmetöötlus analüütilises keemias."}, "objectives": [{"en": "An overview is gven on the contemporary analytical chemistry, both classical and instrumental analysis.", "et": "Antakse ülevaade moodsast analüütilisest keemiast, nii klassikalisest kui ka instrumentaalanalüüsist."}], "learning_outcomes": [{"en": "The following knowledge is acquired:", "et": "Aine läbinud tudengil on järgmised teadmised:"}, {"en": "(1) General principles of chemical analysis: chemical analysis workflow, analysis procedures, their characteristics.", "et": "(1) Keemilise analüüsi üldpõhimõtted: keemilise analüüsi käik, analüüsimetoodika, selle omadused."}, {"en": "(2) Classical and instrumental methods of chemical analysis (gravimetry, titrimetry, potentiometry, chromatography, spectroscopic methods) and the underlying processes (precipitation, chemical equilibria, transitions in molecules).", "et": "(2) Keemilised ja instrumentaalsed analüüsimeetodid (gravimeetria, titrimeetria, potentsiomeetria, kromatograafia, spektroskoopilised meetodid) ja nende aluseks olevad protsessid (sadenemine, tasakaaludreaktsioonid, molekulisisesed üleminekud)."}, {"en": "(3) Analysis objects and samples, principles and main methods of sample preparation.", "et": "(3) Analüüsiobjekt ja proov, proovide ettevalmistamise üldprintsiibid ja põhilised meetodid."}, {"en": "The following ability is acquired:", "et": "Aine läbinud tudengil on järgmised oskused:"}, {"en": "(4) Ability to apply the acquired knowledge when carrying out chemical analysis.", "et": "(4) Aine läbinud tudeng oskab omandatud teadmisi praktiliselt rakendada keemilise analüüsi läbiviimisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}