{"uuid": "0f44ec12-3f19-60f3-d3a5-9bb06da6143d", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-10T22:10:44", "title": {"en": "Analytical Chemistry II", "et": "Analüütiline keemia II"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT06", "name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT06", "structural_unit_name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Advanced methods of analytical chemistry. The focus is on instrumental methods, their physical basis and applications. Several of the methods covered in Analytical Chemistry I are revisited with more in-depth approach. The methods include: optical atomic spectroscopy (AAS, AES, AFS) and the respective atomisation and excitation sources (flame, arc, spark, plasma), X-Ray methods, Atomic mass spectrometry, Optical molecular spectroscopy (UV-Vis, Fluorescence, IR, Raman, covering also special sampling techniques of the methods), Molecular mass spectrometry (including the various modern ionization methods: MALDI, ESI, APCI), NMR spectroscopy.\nDiscussions and problem solving on advanced methods of analytical chemistry, in support to the lecture. The methods include: optical atomic spectroscopy (AAS, AES, AFS) and the respective atomisation and excitation sources (flame, arc, spark, plasma), X-Ray methods, Atomic mass spectrometry, Optical molecular spectroscopy (UV-Vis, Fluorescence, IR, Raman, covering also special sampling techniques of the methods), Molecular mass spectrometry (including the various modern ionization methods: MALDI, ESI, APCI), NMR spectroscopy.", "et": "Süvendatud loengukursus analüütilisest keemiast, eeskätt instrumentaalmeetoditest: mitmesugused aatom- ja molekulspektroskoopia, mass-spektromeetria, NMR ja röntgenmeetodid\nDiskussioonid ja arutelud mitmesugustel analüütilise keemia teemadel (mass-spektromeetrilised, aatom- ja molekulspektroskoopilised, NMR, röntgen jt meetodid) ning praktilises analüüsis ette tulevate ülesannete lahendamine."}, "objectives": [{"en": "An overview of most used instrumental analytical methods is given.\nTo deepen and systematize the knowledge of the methods of instrumental analysis in the seminar", "et": "Loengus antakse ülevaade enamlevinud instrumentaalsetest keemilise analüüsi meetoditest.nstrumentaalsete Seminaris analüüsimeetodite alaste teadmiste kinnistamine ja näitlikustamine."}], "learning_outcomes": [{"en": "Student has advanced level knowledge of instrumental analysis methods, their physical principles and applications: atom- and molecul spectroscopy, mass spectrometry, NMR and X-ray analysis.Student\n-- understands the physical principles of the most important instrumental analysis methods,\n-- is able to compare different methods,\n-- knows applications of the methods,\n-- can choose method for a given analytical task.", "et": "Tudengil teab edasijõudnu tasemel instrumentaalanalüüsi meetodite füüsikalisi aluseid ja rakendamise võimalusi: aatom- ja molekulspektroskoopia, massispektromeetria, NMR ja röntgenmeetodid.\nKursuse läbinu\n-- mõistab instrumentaalsete meetodite füüsikalisi aluseid,\n-- oskab meetodeid omavahel võrrelda,\n-- tunneb meetodite rakendusi,\n-- oskab etteantud analüüsiülesande jaoks meetodit valida."}], "notes": {"et": "Seoses COVID-19 puhanguga toimub õppetöö praegu internetipõhiselt, kasutades kombinatsioonis Moodle ja BBB vmt vahendeid ning iseseisvaid töid. Õppetöö ajastus järgib võimalustmööda tunniplaanis sätestatut, aga üliõpilastega on pidev kontakt ja vajadusel muudetakse ajastust jooksvalt, vastavalt olukorrale."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö koosneb teooria osast, arvutusülesandest ja spektrite interpreteerimise osast.\nTeooria osa küsimused puudutavad kontrolltöö toimumise ajaks loengus läbitud analüüsimeetodeid. Teooria osa koosneb kahest valikvastustega küsimusest ja ühest pikemat vastust eeldavast küsimusest. Teooria osa vastustega demonstreerib tudeng, et ta tunneb instrumentaalsete analüüsimeetodite põhialuseid, suudab lihtsamatele analüüsiprobleemidele lahendusi pakkuda ja orienteerub vastavate mõõtmiste juures kasutatavates mõõtühikutes.\nArvutusülesanne puudutab ühikute teisendamist ja kvantitatiivset keemilist analüüsi. Eristab kalibreerimisgraafiku- ja lisamismeetodit ning arvutab vastavad analüüsitulemused. Kasutab Beeri reeglit.\nSpektrite interpreteerimise osa koosneb infrapunase (IR) ja massispektri (MS) analüüsist. Mõlemal juhul tuvastab tudeng, kas toodud spekter võib kuuluda etteantud ainele ja põhjendab vastust. MS puhul arvutab korrektselt molekulmassi ja esimese isotoopjoone suhtelise intensiivsuse. Abimaterjaliks on õppejõu antavad IR korrelatsioonitabel ja aatommasside tabel.\nKontrolltöö eest on võimalik saada maksimaalselt 11 punkti. Arvestuse saamiseks on vaja saada vähemalt 5,5 punkti."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö koosneb teooria osast ja arvutusülesannetest.\nTeooria osa küsimused puudutavad kontrolltöö toimumise ajaks loengus läbitud analüüsimeetodeid. Teooria osa koosneb neljast valikvastustega küsimusest ja ühest pikemat vastust eeldavast küsimusest. Teooria osa vastustega demonstreerib tudeng, et ta tunneb instrumentaalsete analüüsimeetodite põhialuseid, suudab lihtsamatele analüüsiprobleemidele lahendusi pakkuda ja orienteerub vastavate mõõtmiste juures kasutatavates mõõtühikutes.\nArvutusülesanded (2) puudutavad ühikute teisendamist ja kvantitatiivset keemilist analüüsi. Teostab teisendusi elektromagnetlainete sageduse, lainepikkuse, lainearvu ja energiaga ning nimetab vastavad elektromagnetlainete skaala alad. Eristab kalibreerimisgraafiku- ja lisamismeetodit ning arvutab vastavad analüüsitulemused.\nKontrolltöö eest on võimalik saada maksimaalselt 11 punkti. Arvestuse saamiseks on vaja saada vähemalt 5,5 punkti."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Tudengid moodustavad 3-5-liikmelised grupid. Iga grupp saab mõne keemilise analüüsi probleemi, millest koostatakse 15 minutiline ettekanne. Tudeng saab püstitatud probleemist aru, eristab analüüdi ja analüüsiobjekti ning otsib kirjandusest ja Internetist nende kohta infot. Eristab jälgede ja põhikomponendi analüüsi. Valib välja sobiva(d) meetodi(d) analüüsiülesande lahendamiseks ja põhjendab valikut. Võrdleb põhimõtteliselt sobivaid meetodeid omavahel.\nIga ettekande esitamisel osalenud tudeng saab 8 punkti."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Loengukursuse hinne kujuneb eksamitöö hindest. Eksamitöö koosneb kuuest teoreetilisest küsimusest, mis on tudengitele ette teada.\nNeed teoreetilised küsimused hindavad kõigis aine õpiväljundites teadmiste osa.\nHindamine on statistiline: küsimused valitakse suurest hulgast potentsiaalsetest küsimustest (umbes 150). Nendele küsimustele on omistatud kaalud ja igat neist hinnatakse eraldi kümnepallisüsteemis. Hindamisel võetakse arvesse põhimõtete teadmist ja neist arusaamist, seoste loomise oskust ja faktiteadmist. Saadud tulemustest leitakse kaalutud keskmine ja see normeeritakse 100-ni."}}], "grade_preconditions": {"et": "Hindamisele pääsemiseks tuleb positiivselt sooritada kontrolltööd ja osaleda ettekande koostamisel ning esitamisel."}, "grade_evaluation": {"et": "Eksamihinne kujuneb eksamivastuse põhjal eksamitöö hindest.\nPunktisumma muudetakse hindeks vastavalt klassikalisele skeemile: 50-60 E; 60-70 D; 70-80 C; 80-90 B; 90-100 A. Kui tulemus jääb täpselt kahe hinde vahele, siis läheb kirja kõrgem hinne.\nSeminari arvestuse saamiseks tuleb sooritada mõlemad kontrolltööd vähemalt 50% punktide peale ja osaleda ettekande koostamisel ning esitamisel."}, "debt_elimination": {"et": "Eksamit on võimalik üks kord uuesti sooritada.\nKontrolltöid on võimalik ümber teha 1 kord. Ettekanne tuleb esitada ühel kahest väljapakutud päevast."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "is_moodle_connected": true, "learning_environments": [{"uuid": "dace87f6-8268-4915-8726-98ddf58cbe23", "type": "MOODLE", "code": "LTKT.06.024", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "D.A. Skoog, D.M. West, F.J. Holler Fundamentals of Analytical Chemistry, 7th edition, Saunders College, 1996.\n\nMaterjalid kursuse kodulehel: http://tera.chem.ut.ee/~ivo/ak2/", "recommended_materials": "1. http://tera.chem.ut.ee/~ivo/praks/allikad.html\n2. Kemp W. Organic Spectroscopy. - Third edition. Macmillan press 1991. \n3. Pavia D.L., Lampman G.M., Kriz G.S., Jr. Introduction to Spectroscopy: A Guide for Students of Organic Chemistry. Saunders College Publishing, 1979. \n4. I. Rammo. Spektraalseadmed. Optiline diapasoon, TÜ , 2002.\n5. MODERN METHODS FOR TRACE ELEMENT DETERMINATION\nC. Vandecasteele and C.B. Block, Chichester [etc.] : Wiley, 1995\n6. PRACTICAL HPLC METHOD DEVELOPMENT L. R. Snyder, J. L. Glajch, J. J. Kirkland, Wiley, New York, 1988"}, "participants": {"lecturers": [{"person_uuid": "a6e13f52-77b9-2659-1176-53a652430299", "person_name": "Koit Herodes", "structural_unit": {"code": "LTKT11", "name": {"en": "Testing Centre", "et": "katsekoda"}, "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "0da1eb8e-142d-01cb-1f8b-83d27e450575", "person_name": "Ivo Leito", "structural_unit": {"code": "LTKT06", "name": {"en": "Chair of Analytical Chemistry", "et": "analüütilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1.\tSissejuhatus. Instrumentaalsed meetodid. Signaalid ja müra. Elektromagnetkiirgus. Kiirguse omadused ja dualism.\n2.\tOptiliste spektraalriistade klassifikatsioon\n3.\tOptilised süsteemid, lainepikkuse valik, dispergeerivad elemendid, pilulaius, valgusjuhid\n4.\tAES, AAS, AFS. AES ja AAS analüüsi võrdlus\n5.\tRöntgenmeetodid. Röntgenkiirgus, selle saamine. Röntgendifraktsioon, röntgenfluorestsents.\n6.\tLaserid, laserite tüübid (pooljuhtlaser, kemolaser, värvuslaser)\n7.\tUV-Vis spektroskoopia. UV-Vis kiirguse ja molekulide vaheline vastasmõju, kiirguse neeldumine, üleminekute tüübid. UV-Vis spektrid analüüsis. Fotomeetriline tiitrimine. Beeri reegel. Kõrvalekaldumised Beer'i reeglist\n8.\tUV-Vis spektroskoopia aparatuur. Valgusallikad, lainepikkuse selektorid, detektorid.\n9.\tIR spektroskoopia. IR kiirgussallikad, detektorid. IR spektromeetrid. FT-IR spektromeetria. Molekulide IR spektrid. Peeglusspektromeetria.\n10.\tFluorestsentsispektrid. Fluorestsentsi kustumine. Fluorimeetria. \n11.\tNefelomeetria ja turbidimeetria \n12.\tRaman efekt, spektrid, spektromeetria. FT- ja dispersiivne Raman-spektromeetria.\n13.\tRadioaktiivne lagunemine, lagunemise tüübid. Radioaktiivse kiirguse allikad. Kiirguse ioniseeriv toime. Ioniseeriva kiirguse detektorid. Radiokeemilised meetodid.\n14.\tRaadiospektroskoopia meetodid. Ainesisesed magnetväljad. NMR ja EPR spektroskoopia.\n15.\tMassispektromeetria. Aparatuur, sisestusmeetodid, analüütiline informatsioon."}}]}, "registration_info": {"audience": {}, "min_students": 5}, "parent_uuid": "48ed4945-2e78-229b-a2c2-10a076706638", "parent_code": "LTKT.06.024", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}