{"uuid": "93cee6c5-53da-a373-8b94-524a17a05f42", "code": "LTKT.04.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Environmental Analysis Seminar", "et": "Keskkonna analüüsi seminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT04", "structural_unit_name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT04", "name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course analyzes important analytical methods in environmental chemistry, analyzes their applicability, advantages and disadvantages, and calculates concentrations and other parameters according to the analytical method. The aim of the course is to understand and deepen the methods of analytical environmental chemistry, as well as to refine chemical calculation skills. The latter is assessed by compulsory homework.\nIn small groups, complex, possibly vital problem tasks are solved, which require a combination of knowledge of different chemistry topics, creative thinking, self-expression and group work skills.", "et": "Kursusel analüüsitakse keskkonnakeemias olulisi analüüsimeetodeid, analüüsitakse nende rakendatavust, eeliseid ja puudusi ning arvutatakse kontsentratsioone ning muid parameetreid vastavalt analüüsimeetodile. Kursuse eesmärgiks on analüütilise keskkonnakeemia meetodite lahtimõtestamine ja sügavam mõistmine, ühtlasi keemillise arvutusoskuse lihvimine. Viimast hinnatakse kohustuslike kodutöödega.\nVäikestes rühmades lahendatakse komplitseeritud, võimausel elulisi probleemülesandeid, milleks tuleb kombineerida erinevate keemiateemade teadmisi, loovat mõtlemist, eneseväljenduse ning rühmatöö oskusi."}, "objectives": [{"en": "Solving environmental chemistry problems, working out computational problems in a small group. Deeper understanding of analytical environmental chemistry methods. During the course also complicated problem tasks are solved, which require combining knowledge of different chemistry topics and group work skills.", "et": "Keskkonnakeemia ülesannete lahendamine, arvutusprobleemide läbitöötamine väikses rühmas. Analüütilise keskkonnakeemia meetodite lahtimõtestamine ja sügavam mõistmine. Kursusel lahendatakse ka komplitseeritud probleemülesandeid, milleks tuleb kombineerida erinevate keemiateemade teadmisi ning rühmatöö oskusi."}, {"en": "The course can only be completed as an e-course, in which case the student works independently according to the schedule.", "et": "Kursuse saab läbida ainult e-kursusena, sellisel juhul töötab üliõpilane iseseisvalt vastavalt ajakavale."}], "learning_outcomes": [{"en": "Student who has completed the course:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- describes analytical methods such as titration, spectrophotometry, oxygen demand methods and chromatography;", "et": "- kirjeldab analüüsimeetodeid nagu tiitrimine, spektrofotomeetria, hapnikutarbe meetodid ja kromatograafia;"}, {"en": "- calculates the concentrations of the substances in the solutions;", "et": "- arvutab ainete kontsentratsioone lahustes;"}, {"en": "  -analyzes a more complex problem as a group.", "et": " -analüüsib komplekssemat probleemi rühmatööna."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}