{"uuid": "d4c5a2bc-05d9-814b-e7ba-4f8407f9ca7e", "code": "LTKT.09.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methods of Preparative and Gas Chromatography", "et": "Preparatiivse ja gaasikromatograafia meetodid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT09", "structural_unit_name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT09", "name": {"en": "Chair of Organic Chemistry", "et": "orgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The aim of the course is to provide knowledge of the nature and applications of gas chromatography and gas chromatography-mass spectrometry methods. The course deals with the theory of chromatography, describes methods of qualitative and quantitative analysis, explains principles of apparatus and materials used for analysis, presents methods of pre-processing of samples and explains possibilities of interpretation of results.", "et": "Kursuse eesmärgiks on anda teadmisi preparatiivse, gaasikromatograafia ja gaasikromatograafia-massispektromeetria meetodite olemusest ja rakendustest. Kursuse raames käsitletakse kromatograafia teooriat, kvalitatiivse ja kvantitatiivse analüüsi meetodeid, analüüsiks kasutatavat aparatuuri ja materjale, proovide eeltöötlemist ning tulemuste interpreteerimist. Teostatakse praktilisi töid."}, "objectives": [{"en": "This course is meant to introduce preparative (Prep.C), gas chromatography (GC) and gas chromatography - mass spectrometry (GCMS), to give overview of theoretical principles, data processing methods and applications.", "et": "Kursuse eesmärgiks on anda teadmisi preparatiivse (Prep.C) ja gaasikromatograafia (GC) ning gaasikromatograafia-massispektromeetria (GCMS) teoreetiliste printsiipide, andmetöötluse võimalustest ja nende meetodite rakendustest."}], "learning_outcomes": [{"en": "1. Students know the classification of chromatographic methods, correct terminology and general theoretical aspects of chromatography. 2. Students have an overview of methods, types and the most important practical aspects of preparative chromatography (Prep C). 3. Students understand the general principles and design of the apparatus used in gas\n\nchromatography and mass spectrometry, and will be aware of the impact of different work parameters on the results of the analysis. 4. Students know the procedures of qualitative and quantitative analysis and have an overview of the modern data processing software. 5. Students know main materials used in GC, their properties and applications. 6. Students know the principles and apparatus used for pre-treatment of samples. 7. Students can practically carry out gas chromatographic-mass spectrometry experiments. 8 Students understand main trends of development of GC and GCMS methods in the world.", "et": "1.Üliõpilased teavad kromatograafia meetodite klassifikatsiooni, korrektset terminoloogiat ja kromatograafia üldisi teoreetilisi seisukohti. 2.Üliõpilased omavad ülevaadet preparatiivse kromatograafia (Prep C) meetoditest, liikidest ja praktilise teostamise tähtsamatest aspektidest. 3.Üliõpilased tunnevad gaasikromatograafias ja massispektromeetrias kasutatava aparatuuri üldisi tööprintsiipe ja ehitust ning teavad erinevate tööparameetrite mõju analüüsi tulemustele. 4.Üliõpilased teavad kvalitatiivse ja kvantitatiivse analüüsi tööprotsesse ning omavad ülevaadet kaasaegse kvalitatiivse ja kvantitatiivse analüüsi andmetöötlustarkvara võimalustest ja rakendustest. 5.Üliõpilased tunnevad gaasikromatograafias kasutavaid materjale, nende omadusi ja rakendusvõimalusi. 6.Üliõpilased tunnevad proovide eeltöötlemiseks kasutatavaid meetodeid ja aparatuuri. 7.Üliõpilased oskavad praktiliselt teostada gaasikromatograafia-massispektromeetria eksperimente. 8.Üliõpilased saavad ülevaate GC ja GCMS arengusuundadest maailmas."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}