{"uuid": "989262b5-e036-2566-4345-21ff24e62413", "code": "LTKT.04.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Resources and Circular Economy", "et": "Ringmajandus ja ressursside kasutus"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT04", "structural_unit_name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT04", "name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course analyzes the principles of the circular economy, introduces the accompanying legislation, gives an overview of the planning and implementation of environmental technological processes of organizations based on the concept of sustainable development. The basics of the organisation's environmental management related to the renovation of existing technologies and the introduction of new modern technologies in the production and service spheres are discussed.", "et": "Kursus analüüsib ringmajanduse põhimõtteid,  tutvustab kaasnevat seadusandlust, annab ülevaate organisatsioonide keskkonnatehnoloogiliste protsesside planeerimisest ning rakendamisest säästva arengu kontseptsioonist lähtuvalt. Käsitletakse organisatsiooni keskkonnajuhtimise põhialuseid, mis on seotud olemasolevate tehnoloogiate renoveerimise ning uute kaasaegsete tehnoloogiate juurutamisega tootmis- ja teenindussfääris."}, "objectives": [{"en": "Introduction of the principles of the circular economy and evaluation criteria, analyzing the views of sustainable development. To analyze the organization's environmental performance based on both production technology and product handling.", "et": "Tutvustada ringmajanduse põhimõtteid ning hindamiskriteeriumeid, analüüsida jätkusuutliku arengu seisukohti. Analüüsida organisatsiooni keskkonna-alast tegevust nii tootmistehnoloogia kui toodete käitlemise põhjal."}], "learning_outcomes": [{"en": "Student who has completed the course:", "et": "Kursuse läbinud üliõpilane"}, {"en": "- knows the criteria for assessing the sustainability and environmental impact of products and technologies;", "et": "- tunneb kriteeriume, mille kaudu hinnatakse toodete ja tehnoloogiate jätkusuutlikkust ning keskkonnamõju;"}, {"en": "- knows the basic principles of the circular economy and analyzes the possibilities of waste recovery;", "et": "- tunneb ringmajanduse põhimotteid ja analüüsib jäätmete kasutuselevõtu võimalusi; "}, {"en": "- is able to assess the life cycle of products and point out its significant environmental problems;", "et": "- oskab hinnata toodete olelusringi ning välja tuua selle olulised keskkonnaprobleemid;"}, {"en": "- is able to analyze the organisation's environmental performance and identify opportunities to improve its environmental performance.", "et": "- oskab analüüsida organisatsiooni keskkonna-alast tegevust ning selgitada võimalusi keskkonna-alase tegevuse parendamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}