{"uuid": "ef2af483-dcc2-9fb7-884b-dc430cae8105", "code": "lt-2018-autumn-fulltime-p1-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Seminar of the Scientific Method", "et": "Loodusteadusliku meetodi seminar"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 3, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTKT", "name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "email": "chemistry@ut.ee", "phone": "+372 737 5261", "webpage_url": "https://chem.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "label": {"en": "18/19 A regular part 1 3 CP LT", "et": "18/19 S PÕ 1. osa 3 EAP LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT", "structural_unit_name": {"en": "Institute of Chemistry", "et": "keemia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 2, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The students become acquainted with the principles behind scientific method, mechanisms ensuring research integrity, importance of correct data analysis and presentation; learn to distinguish characteristics of science and pseudoscience; and master use of the scientific databases. The obtained knowledge is applied for the thorough analysis of the publications and theses defended during the preceding years. Next, the students will perform a short research project in a chosen laboratory within the UT Institute of Chemistry to gain experience in the following aspects: formulation of hypotheses and planning of the according experimental solutions; carrying out pilot experiments; analysis of the results and presentation of those to the public specialized in the given field.\nThe course also contributes to improvement of the following general learning skills:\na) time management (adhering to deadlines for the required assignments),\nb) participation in the team project (homework assignments performed as team work; communication with the mentor, setting up the personal activities within the functioning research group),\nc) giving feedback (anonymous review of the presentations made by other students),\nd) presenting in front of a large audience.", "et": "Üliõpilased omandavad näidete varal loodusteadusliku meetodi, andmete analüüsi ja esitamise põhitõdesid, õpivad eristama teadust pseudoteadusest ning tutvuvad teaduse kvaliteeti tagavate mehhanismide ja teadusinfo-alaste andmebaasidega. Teaduse hea tava nõuete kontekstis analüüsitakse varasematel aastatel kaitstud bakalaureusetöid või teadusartikleid. Seejärel teostatakse lühiprojekt TÜ Keemia instituudi laboris, mille käigus omandatakse praktiline kogemus hüpoteesidele vastavate katsete planeerimiseks, läbiviimiseks, analüüsimiseks ja tutvustamiseks erialasele publikule.\nÕppeaine arendab muuhulgas järgnevaid ülekantavaid oskusi:\na) ajaplaneerimine (tähtajaliste iseseistvate tööde õigeaegse esitamise kaudu),\nb) rühmatöös osalemise kogemus (kodutööd rühmatöö vormis ning suhtlemine mentoriga, sisse elamine funktsioneeriva teadusrühma töörütmi praktilise töö käigus),\nc) tagasiside andmine (anonüümne retsensioon teiste üliõpilaste ettekannetele),\nd) esinemise kogemus (2 suulist ettekannet)."}, "objectives": [{"en": "The aim of the first part of this course is to give the students an overview of the scientific method characteristics, scientific career options in academia and in industry, quality assessment criteria of the scientific publications, and the Estonian Code of Conduct for Research Integrity. As a general goal, the critical thinking and reading skills of students will be developed. Using their newly acquired skills, the students will perform deep analysis of an BSc or MSc thesis (defended during the preceding years at the UT Institute of chemistry) or an experimental research article (cited in WOS/Scopus), and present it in the form of a short talk followed by the academic discussion. The aim of the second part of this course is to review various relevant scientific databases, and teach students basic academic writing skills as well as planning of the experimental work. The students will carry out a short practical research project supervised by a member of the UT Institute of chemistry, and summarize it as a written report and as an oral presentation. The course will prepare students to progress successfully through the process of preparation of their BSc theses.", "et": "Kursuse esimese osa eesmärgiks on anda üliõpilastele ülevaade loodusteadusliku meetodi olemusest, teadlase karjäärist akadeemias ja tööstuses, teaduslike publikatsioonide kvaliteedinäitajatest ja teaduse heast tavast üldiselt ning arendada üliõpilaste kriitilise mõtlemise ja lugemise oskused. Valmib analüüs varasematel aastatel TÜ KI kaitstud bakalaureusetööst või ETIS 1.1-tüüpi teadusartiklist, mille alusel tehakse suuline ettekanne. Kursuse teise osa eesmärgiks on anda üliõpilastele ülevaade teadusteksti kirjutamise baasoskustest, eksperimentaalse töö planeerimisest ning tutvustada erialaste andmebaaside kasutamist teadusinformatsiooni otsimiseks. Kursuse teises pooles osalevad üliõpilased erinevate teadusgruppide juures ühe teadusprobleemi lahendamisel ning esitavad töö tulemuste põhjal kirjaliku aruande, mille kaitsmine toimub suulise ettekandena. Kursus valmistab üliõpilasi ette bakalaureusetöö tegemiseks."}], "learning_outcomes": [{"en": "1st part of the course:", "et": "Aine 1. OSA "}, {"en": "1.\tA student is familiar with the characteristics of high-quality science, scientific misconduct, and pseudoscience (assessed by homework);", "et": "1.\tÜliõpilane oskab eristada kvaliteetse teaduse, teadusliku väärkäitumise ja pseudoteaduse tunnuseid (kontrollivorm: kodutöö)."}, {"en": "2.\tA student is able to formulate examples of and a personal concept regarding the importance of fundamental vs applied science, and has basic understanding about the scientific career stages (assessed by homework);", "et": "2.\tÜliõpilane oskab sõnastada arvamust fundamentaal- ja rakendusteaduse olulisusest (koos relevantsete näidetega mõlema teema kohta) ning omab ettekujutust teadlase karjääri eri staadiumitest ja teaduskollektiivide toimimisest (kontrollivorm: kodutöö)."}, {"en": "3.\tA student is able to discuss the logics behind the famous scientific studies and breakthroughs, and is familiar with the contemporary requirements ensuring research integrity, including safety requirements (assessed by homework);", "et": "3.\tÜliõpilane on tutvunud teadusliku avastusprotsessi loogikaga (ajalooliste näidete varal) ning on teadlik teadustöödele esitatavatest kaasaegsetest nõuetest, sh ohutusnõuetest (kontrollivorm: kodutööd)."}, {"en": "4.\tA student is aware of the science intrinsic quality control mechanisms and limitations of those (assessed by homework);", "et": "4.\tÜliõpilane on teadlik kaasaegsetest mehhanismidest, mis tagavad teadustööde kvaliteeti, ning nende võimalikest piirangutest (kontrollivorm: kodutöö)."}, {"en": "5.\tA student is skilled in critical reading, analysing, presenting, discussing and giving feedback on the research done by other authors (assessed by homework, oral report and participation in the academic discussion).", "et": "5.\tÜliõpilane oskab lugeda, analüüsida, tutvustada, diskuteerida ja tagasisidestada teise autori poolt teostatud teadustööd viisil, mis vastab loodusteadusliku meetodi heale tavale (kontrollivorm: kodutöö, ettekanne, osalemine akadeemilises diskussioonis). "}, {"en": "2nd part of the course:", "et": "Aine 2. OSA"}, {"en": "1.\tA student is able to conduct a subject-based literature/information search in the following databases: WoS/Scopus, SciFinder, Google Patent/Espacenet (assessed by homework).", "et": "1.\tÜliõpilane tunneb peamisi keemiaalase teaduskirjanduse ning patendiinformatsiooni sisaldavaid andmebaase ning oskab neid kasutada vajaliku teadusliku info kogumiseks (kontrollivorm: kodutööd)."}, {"en": "2.\tA student can plan and conduct a goal-oriented short-term research project (under the supervision of a mentor);", "et": "2.\tÜliõpilane oskab planeerida ning teostada eksperimentaalset tööd püstitatud hüpoteesi kontrollimiseks (kontrollivorm: osavõtt eksperimentaalprojektist valitud laboris mentori juhendamisel)."}, {"en": "3.\tA student is able to analyse the obtained data and outline the results reliably and correctly in both written and oral form (assessed by homework and written report);", "et": "3.\tÜliõpilane oskab tehtud töö tulemusi analüüsida ning neid korrektselt esitada nii kirjalikus kui ka suulises vormis (kontrollivorm: kodutöö ja kirjalik aruanne)."}, {"en": "4.\tA student is skilled in presenting and discussing its own research as well as giving feedback on the research presented by the fellow students (assessed by oral report and participation in the academic discussion).", "et": "4.\tÜliõpilane oskab tutvustada ja diskuteerida enda poolt teostatud teadustööd viisil, mis vastab loodusteadusliku meetodi heale tavale, ning tagasisidestada teiste esinejate töid (kontrollivorm: ettekanne, osalemine akadeemilises diskussioonis)."}], "notes": {"et": "Toimub 3. semestril (2018/2019 süg)\nAktiivsed mentorid: Kaido Viht, Erki Enkvist, Darja Lavõgina, Ago Rinken, Kaisa Mihklepp, Toonika Rinken, Jaak Nerut, Tavo Romann, Ave Sarapuu, Nadežda Kongi, Koit Herodes, Lauri Sikk"}}, "grading": {"independent_work": {"et": "Üliõpilane peab koostama ja ette kandma eestikeelse presentatsiooni teadusliku publikatsiooni (eksperimentaalartikkel, mitte review) või varasemalt kaistud lõputöö kohta. Üliõpilane võib valida materjali ettekandeks õppejõu poolt pakutavast nimekirjast (vt aine Moodle) või kokkuleppel õppejõuga valida ise sobiv materjal. Täpsemad juhised ettekande tegemiseks on esitatud esimese loengu õppematerjalis."}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "due_date": "2018-10-15", "description": {"et": "15. oktoobriks peab üliõpilane olema valinud materjali oma ettekande jaoks ning teavitanud sellest õppejõudu (darja.lavogina@ut.ee)"}}, {"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Ettekanded toimuvad ajavahemikus 8.november - 20.detsember ning peavad olema tehtud kaitsmisettekandele analoogses vormis. Hinded: arvestatud/mittearvestatud."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Puudumisel kolmest seminarist (sh seminarid, kus teised üliõpilased teevad ettekandeid) peab üliõpilane esitama kirjaliku essee (ca 500 sõna) ühel teemadest, mida käsitleti seminaris, kus üliõpilane ei käinud kohal. Puudumisel kuuest seminarist vastavalt kaks esseed, üheksast seminarist - kolm esseed, kaheteistkümnest seminarist - 4 esseed. On kohustuslik osaleda ka nendes seminarides, kus teevad ettekandeid teised tudengid."}}], "grade_preconditions": {"et": "Õpilane on 15. oktoobriks andnud teada, millise materjali ta on valinud oma ettekande jaoks. Kui valitud materjal ei sisaldu õppejõu poolt pakutavas nimekirjas, on vajalik õppejõu nõusolek, et materjal kvalifitseerub."}, "grade_evaluation": {"et": "Ettekanne: arvestatud. \nKui üliõpilane on puudunud rohkem kui 3 seminarist, siis lisandub kriteeriumina vajalike esseede olemasolu."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Seminaride slaidide PDFid ilmuvad aine leheküljele Moodle's vahetult enne vastavat seminari.", "recommended_materials": "I. Peil, K. Tarkpea \"Füüsikalise looduskäsitluse alused\"; Eesti Füüsika Selts, 2013 (vt ka http://opik.fyysika.ee/index.php/book/view/17 )\nI. Leito, \"Mõõtmine ja Mõõtemääramatus\", http://tera.chem.ut.ee/~ivo/metro/u.pdf ning http://tera.chem.ut.ee/~ivo/metro/u_2.pdf\nI. Leito, \"Mõõtetulemuste jälgitavus \", http://tera.chem.ut.ee/~ivo/metro/Jalgitavus.pdf\nTÜ hea teadustava, https://www.eetika.ee/et/eesti-hea-teadustava\nTÜ Keemia instituudi nõuded bakalaureuse- ja magistritöödele: https://www.chem.ut.ee/et/oppimine/bakalaureuse-magistritoodele-esitatavad-nouded\nTÜ eetikaveeb: http://www.eetika.ee/et/eetika-moraal/bioeetika\nTÜ Keemia instituudi laboris ohutu töötamise juhend: http://www.chem.ut.ee/et/tooohutus"}, "participants": {"lecturers": [{"person_uuid": "bb76943b-a365-4017-76cf-776bb54b67d0", "person_name": "Toonika Rinken", "structural_unit": {"code": "LTKT04", "name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "be2fdcf6-4f90-53aa-8a96-c807d00d7864", "person_name": "Darja Lavõgina", "structural_unit": {"code": "LTKT10", "name": {"en": "Chair of Bioorganic Chemistry", "et": "bioorgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "6a801fda-175d-2f94-6bc3-800c72104ed9", "person_name": "Jaak Nerut", "structural_unit": {"code": "LTKT03", "name": {"en": "Chair of Chemical Education", "et": "keemiahariduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "c17cedaa-b4ea-f59a-4800-ebd04f2db7b5", "person_name": "Uno Mäeorg", "structural_unit": {"code": "LTKT10", "name": {"en": "Chair of Bioorganic Chemistry", "et": "bioorgaanilise keemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2.-16.n."}, "entries": [{"time": "2018-09-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Õppeaine tutvustus: eesmärk, õpiväljundid, läbimise tingimused.\nTeaduse definitsioonid. Loodusteaduslik meetod.\n "}}, {"time": "2018-09-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Loodusteaduslik meetod. Hüpoteesi püstitamine. Eksperiment ja vaatlus. \n "}}, {"time": "2018-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Vaatluse objektiivsus. Katse planeerimine ja katsetingimuste valik. \n "}}, {"time": "2018-10-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Mõõtmine, mõõtemääramatus, kordustäpsus mõõtmisel. Katseandmete protokollimine. Katseandmete esitamise ja tõlgendamise viisid (algab). Skaalade valik.\n  "}}, {"time": "2018-10-11", "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Teema valimine arvestusliku ettekande tegemiseks (iseseisev töö, vajadusel võib kokku leppida individuaalkonsultatsiooni õppejõuga)"}}, {"time": "2018-10-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Katseandmete esitamise ja tõlgendamise viisid (jätkub). Korrelatsioon ja põhjuslikkus. Keemia instituudis lõputöödele esitatavad nõuded ja kaitsmise kord.\n \n "}}, {"time": "2018-10-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Teadustöödele esitatavad nõuded (jätkub). Ettekanne ja akadeemiline diskussioon. Viitamine. \n  \n "}}, {"time": "2018-11-01", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "6. seminari teemade lõpetamine. Teaduse hea tava. \n   \nTeadusandmete publitseerimine: eesmärgid ja põhimõtted. Teadusliku informatsiooni otsimine (lühiülevaade). \n "}}, {"time": "2018-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded I: varasema bakalaureusetöö või teadusartikli analüüs\n  "}}, {"time": "2018-11-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded II"}}, {"time": "2018-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded III"}}, {"time": "2018-11-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded IV"}}, {"time": "2018-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded V"}}, {"time": "2018-12-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded VI"}}, {"time": "2018-12-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekanded VII"}}]}, "registration_info": {"audience": {}, "min_students": 3}, "parent_uuid": "2bef8119-6f34-a301-eb0d-1ee5335270a8", "parent_code": "LTKT.00.001", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}