{"uuid": "34e20ecf-8408-497b-efdb-2ff517e34112", "code": "LTKT.03.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching Chemistry Using Home Experiments", "et": "Keemia õpetamine kodukeemia katsetega"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT03", "structural_unit_name": {"en": "Chair of Chemical Education", "et": "keemiahariduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT03", "name": {"en": "Chair of Chemical Education", "et": "keemiahariduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The purpose of the course is to introduce future chemistry teachers ways to make chemistry lessons more attractive, for example using virtual reality, the idea of flipped classroom, escape rooms and etc. The university students go through the seminar materials by themselves in the form of practical work. In the end of the course each university student prepares a topic set which can later be used to conduct a practicum in a general education school.", "et": "Kursuse eesmärk on tutvustada tulevastele keemiaõpetajatele viise, kuidas saaks muuta keemiatunni atraktiivsemaks, nt. virtuaalreaalsus, ümberpööratud klassiruum, põgenemistuba, jne. Seminarides käsitletud teemad läbivad üliõpilased iseseisvalt praktiliste tööde näol. Kursuse lõpus valmistavad õliõpilased iseseisvalt ette ühe teemaploki, mida saaks kasutada üldhariduskoolis praktikumi läbi viies."}, "objectives": [{"en": "To introduce different opportunities for making a chemistry lesson more attractive.", "et": "Tutvustada erinevaid võimalusi keemiatunni atraktiivsemaks muutmiseks."}, {"en": "To give an overview of the experiments in school chemistry that can be performed with supplies obtained from ordinary trade.", "et": "Anda ülevaade koolikeemias katsetest, mida on võimalik sooritada tavakaubandusest saavate vahenditega."}], "learning_outcomes": [{"en": "Student, who has completed the course", "et": "Kursuse läbinud üliõpilane"}, {"en": "1. acknowledges the importance of performing experiments as well as using alternative theoretical materials besides a text book to teach chemistry in a general education school,", "et": "1. teadvustab katsete sooritamise ja õpikule alternatiivsete meetodite vajalikkust keemia õpetamisel üldhariduskoolis,"}, {"en": "2. knows how to use chemicals and test equipment safely while performing an experiment and is able to evaluate the time span and economical aspect of performable experiments,", "et": "2. oskab kasutada ohutult kemikaale ning töövahendeid katsete sooritamisel ja hinnata katsete ajalist ja majanduslikku aspekti,"}, {"en": "3. is able to use their knowledge to solve school chemistry problems and can compose corresponding practical exercises for students,", "et": "3.oskab rakendada oma teadmisi koolikeemia probleemide selgitamisel ja koostada vastavaid praktilisi ülesandeid õpilastele,"}, {"en": "4. is able to associate the problems in school chemistry with everyday life and other scientific problems.", "et": "4.oskab seostada koolikeemias käsitletavaid probleeme argielu ning teiste loodusteaduste probleemidega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}