{"uuid": "bf206937-b9d7-7e81-c845-373886b3d5e3", "code": "LTKT.04.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-05T15:46:53", "title": {"en": "Bioresources and Biowaste Treatment Technologies", "et": "Bioressursside tehnoloogiad ja bioenergeetika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT04", "structural_unit_name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT04", "name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will cover in-depth bio-waste management technologies and the possibilities of using bio-waste for energy purposes. The safe management of bio-waste is one of the key areas of the principles of sustainable development, ensuring the implementation of sustainable waste management technologies.", "et": "Kursuses käsitletakse süvendatult biojäätmete käitluse tehnoloogiaid ning võimalusi biojäätmete kasutamiseks energeetilisel otstarbel. Biojäätmete ohutu käitlemine on säästva arengu printsiipide üks olulisemaid valdkondi, mille kaudu tagatakse jätkusuutlike tehnoloogiate rakendumine jäätmekäitluses."}, "objectives": [{"en": "The aim of the course is to learn about bio-waste management and bio-resource processing technologies, both in terms of their use for energy production and their valorisation in the production of materials.", "et": "Kursuse eesmärk on õppida tundma biojäätmete käitluse ja bioressursside töötlemise tehnoloogiaid nii nende kasutamisel energia tootmiseks kui ka väärindamisel materjalide tootmisel."}], "learning_outcomes": [{"en": "Student", "et": "Õppeaine läbinu:"}, {"en": "- has an overview of bio-resources at Estonian, European Union and global level;", "et": "- omab ülevaadet bioressurssidest nii Eesti, Euroopa Liidu kui ka gloobaalsel tasandil;"}, {"en": "- acquires knowledge of the basics of bio-waste classification and environmentally sound methods of waste management. ", "et": "- teab biojäätmete klassifitseerimise aluseid ja jäätmekäitluse keskkonnahoidlikke meetodeid "}, {"en": "- acquires knowledge of bio-waste management technologies and their characteristics.", "et": "- tunneb biojäätmete käitlustehnoloogiaid ja neid iseloomustavaid näitajaid"}, {"en": "- analyses the potential use of bio-waste and the efficiency of technological methods;", "et": "- analüüsib biojäätmete kasutuspotentsiaali ja tehnoloogiliste meetodite efektiivsust;"}, {"en": "- knows the main options for energy recovery from bio-waste.", "et": "- teab peamisi biojäätmete energiakasutuse võimalusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}