{"uuid": "386758e8-a1b3-a4eb-c9ac-a81460b1dbab", "code": "LTKT.04.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Wastewater and Sludge Treatment Technologies", "et": "Reovee- ja settekäitluse tehnoloogiad"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTKT04", "structural_unit_name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTKT04", "name": {"en": "Chair of Colloidal and Environmental Chemistry", "et": "kolloid- ja keskkonnakeemia õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTKT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides a comprehensive overview about the main technologies used in municipal wastewater treatment and sludge management technologies. The technologies of physicochemical and biological wastewater treatment are systematically related to the laboratory wastewater analyses and are also brought into the concept of legal framework. The course addresses all major technological aspects of nutrient removal and cost-effective sludge management. Process dimensioning is addressed according to valid standards for major wastewater treatment technologies.", "et": "Kursusel antakse põhjalik ülevaade olmereoveepuhastites kasutatavast reovee- ja settekäitluse tehnoloogiast. Alustades reovee- ja settekäitluse õiguslikust taustast ning keskkonnakeemia laborianalüüsidest luuakse süsteemne seostatud ülevaade füüsika-keemilisest ja bioloogilisest reoveepuhastustehnoloogiast. Kursusel käsitletakse kõikide enamlevinud reovee komponentide ärastustehnoloogiaid ning tõhusaid settekäitluse meetodeid. Antakse juhised olmereoveepuhastuse tehnoloogiliste lahenduste dimensioneerimiseks vastavalt kehtivatele standarditele."}, "objectives": [{"en": "The aim of the course it to introduce wastewater and sludge treatment technologies and learn the principles for dimensioning of treatment facilities.", "et": "Kursuse eesmärgiks on tutvuda reoveepuhastuse ning settekäitluse tehnoloogiliste lahendustega ning omandada vastavate rajatiste dimensioneerimise põhimõtted."}], "learning_outcomes": [{"en": "The student:", "et": "Kursuse läbinud üliõpilane: "}, {"en": "1. knows the methods of wastewater treatment used in municipal wastewater treatment plants;", "et": "1. tunneb olmereoveepuhastites kasutatavaid reovee puhastamise metoodikaid;"}, {"en": "2. is able to choose the wastewater treatment technology on the basis of wastewater analyses and effluent limits;", "et": "2. oskab reovee analüüside ja heitvee väljavoolu piirmäärade alusel valida reoveepuhastustehnoloogiat;"}, {"en": "3. knows the dimensioning principles of wastewater and sludge treatment technology and can dimension the process;", "et": "3. teab reovee ja reoveesette käitlemise tehnoloogia dimensioneerimise põhimõtteid ja oskab protsessi dimensioneerida;"}, {"en": "4. is able to optimize the wastewater treatment process.", "et": "4. oskab teha tehnoloogilisi muudatusi reoveepuhastusprotsessi optimeerimiseks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}