{"uuid": "aadcfe7e-d59a-d01e-717c-b161925152e7", "code": "LTLT.00.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Doctoral Studies in Science and Technology", "et": "Sissejuhatus doktoriõpingutesse loodus- ja täppisteadustes"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTLT", "structural_unit_name": {"en": "Dean's Office, Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkonna dekanaat"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTLT", "name": {"en": "Dean's Office, Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkonna dekanaat"}, "email": "ltt@ut.ee", "phone": "+372 737 5820", "webpage_url": "https://reaalteadused.ut.ee", "address": "Vanemuise 46 - 208\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46 - 208", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course begins with the information day organized by the Centre for Doctoral Studies. The following lectures and seminars introduce the aims and organization of doctoral studies at the University of Tartu, planning one's studies, annual review, types of theses (article thesis and monograph), sources and databases, reference management tools, project-based research, writing and publishing research texts, conference culture, and principles of Open Science.", "et": "Õppeaine algab doktoriõppe keskuse korraldatava infopäevaga. Järgnevate loengute ja seminaride käigus tutvutakse doktoriõpingute korralduse ja eesmärkidega TÜs, doktoriõpingute planeerimisega, atesteerimisega, väitekirjade liikide (artikliväitekiri ja monograafia), andmeallikate ja -baasidega, viitehaldussüsteemidega, projektipõhise teaduse toimimisega, teadusliku teksti koostamise ja publitseerimisega, konverentside tavade, andmete ja avatud teaduse põhimõtetega."}, "objectives": [{"en": "The course introduces first-year PhD students to the aims and organization of doctoral studies at the University of Tartu, planning their studies, annual review, types of theses (article thesis and monograph), sources and databases, reference management tools, project-based research, writing and publishing research texts, conference culture, and principles of Open Science.", "et": "Aine eesmärk on anda esimese aasta doktorantidele ülevaade doktoriõpingute korraldusest ja eesmärkidest Tartu Ülikoolis (TÜ), doktoriõpingute planeerimisest, atesteerimisest, doktoritöö liikidest, andmeallikatest ja -baasidest, viitehaldussüsteemidest, projektipõhise teaduse toimimisest, teadusliku teksti koostamisest ja publitseerimisest, konverentside tavadest, andmetest ja avatud teaduse põhimõtetest."}], "learning_outcomes": [{"en": "After completing the course, PhD students", "et": "Kursuse läbinud doktorant"}, {"en": "-understand documents regulating doctoral studies and the good practice of doctoral studies and research", "et": "- mõistab doktoriõpet reguleerivaid õigusakte ning doktoriõppe ja teaduse hea tava põhimõtteid"}, {"en": "-can purposefully plan their doctoral studies and subsequent (academic) careers and set achievable aims", "et": "- oskab doktoriõpinguid ja järgnevat (teadlas)karjääri sihipäraselt planeerida ja teostatavaid eesmärke seada"}, {"en": "-know and use leading publications in their discipline and understand the principles of classifying publications", "et": "- tunneb ja kasutab valdkonna juhtivaid väljaandeid ning publikatsioonide klassifitseerimispõhimõtteid"}, {"en": "-can plan the publication of a research article, among other things using skills necessary for reviewing in this process", "et": "- kavandab teadusliku artikli publitseerimist, kasutades selles protsessis, s.h retsenseerimises vajalikke oskusi"}, {"en": "-systematically use research databases and reference management tools in their research", "et": "- rakendab oma töös sihipäraselt teadustööd koondavaid ja reguleerivaid andmebaase ning viitehaldusprogramme"}, {"en": "-understand the operation of project-based and Open Science and plan their work in accordance with their requirements.", "et": "- mõistab, kuidas toimib projektipõhine teadus ja avatud teadus (Open Science) ning kujundab oma tegevust selle vajadustega vastavalt"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}