{"uuid": "459273dd-9f9c-f62c-721d-0b0684b8aab8", "code": "LTMR.03.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Molecular Mechanisms and Applications of Microbial Processes", "et": "Mikroobsete protsesside molekulaarsed mehhanismid ja rakendused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR03", "structural_unit_name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMR03", "name": {"en": "Chair of Genetics", "et": "geneetika õppetool"}, "phone": "+372 737 5014", "address": "Riia 23, ruumid 101-117, 301, 302\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, ruumid 101-117, 301, 302", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The lecture course deals with the molecular mechanisms and regulation of biological processes in the bacterial cell. Mechanisms of physiological and genetic adaptation of bacteria in response to environmental stress are discussed. Examples of how to apply this knowledge in biotechnology, medicine, environmental protection, food microbiology and agriculture are explained and presented.\n\nThe following topics of biological processes are discussed: gene regulation at transcriptional and posttranscriptional level; translation regulation; posttranslational modification of proteins and secretion of proteins; global gene regulation and sensing environment signals; regulation of metabolism and energy generation; transport systems; adaptation of bacteria to different environmental stresses; differentiation of bacterial cells (biofilms, sporulation); phenotypic variation in bacterial populations; intra-species and inter-species communication in bacterial populations; bacterial interactions with the eukaryotic host; control of DNA replication initiation and cell division; tolerance and repair of DNA damage; bacterial evolution under stress conditions.", "et": "Loengukursuses käsitletakse bakterirakus toimuvate bioloogiliste protsesside molekulaarseid mehhanisme ja regulatsiooni. Käsitletakse bakterite füsioloogilisi ja geneetilisi kohastumise mehhanisme vastusena keskkonnastressile. Selgitatakse ja tuuakse näiteid, kuidas rakendada neid teadmisi biotehnoloogias, meditsiinis, keskkonnakaitses, toiduainete mikrobioloogias ja põllumajanduses.   \n\nBakterirakus toimuvatest protsessidest käsitletakse järgmisi teemasid: geeniregulatsioon transkriptsiooni tasemel ja selle järgselt; translatsiooni regulatsioon; valkude posttranslatsiooniline modifikatsioon ja valkude sekreteerimine; globaalne geeniregulatsioon ja väliskeskkonna signaalide tunnetamine; metabolismi ja energia genereerimise regulatsioon; transportsüsteemid; bakterite kohanemine erinevate keskkonnastressidega; bakterirakkude diferentseerumine (biokiled, sporulatsioon);  fenotüübiline varieeruvus bakteripopulatsioonides; liigisisene ja liikidevaheline kommunikatsioon bakteripopulatsioonides; bakterite interaktsioonid eukarüootse peremeesorganismiga.  DNA replikatsiooni initsiatsiooni ja rakkude jagunemise kontroll; DNA kahjustuste tolereerimine ja reparatsioon; bakterite evolutsioneerumine stressitingimustes."}, "objectives": [{"en": "The aim of the lecture course is to provide an overview of the molecular mechanisms of biological processes in prokaryotic cells and the use of this knowledge in applied microbiology.", "et": "Loengukursuse eesmärgiks on anda ülevaade prokarüootses rakus toimuvate bioloogiliste protsesside molekulaarsetest mehhanismidest ja nende teadmiste kasutamisesest rakendusmikrobioloogias."}], "learning_outcomes": [{"en": "After the course, the students are expected:", "et": "Peale kursuse läbimist üliõpilane:"}, {"en": "To acquire knowledge in molecular mechanisms of biological processes and their interconnections in bacterial cells.", "et": "On omandanud teadmised bakterirakus toimuvate bioloogiliste protsesside molekulaarsetest mehhanismidest ja omavahelistest seostest.  "}, {"en": "To be able to understand molecular mechanisms of physiological adaptation of bacteria to environmental conditions. ", "et": "Saab aru bakterite füsioloogilise kohastumise molekulaarsetest mehhanismidest keskkonnatingimuste muutumisel."}, {"en": "To know how to apply this knowledge in biotechnology, medicine, environmental protection, food microbiology and agriculture ", "et": "Omab ülevaadet sellest, kuidas rakendada saadud teadmisi biotehnoloogias, meditsiinis, keskkonnakaitses, toiduainete mikrobioloogias ja põllumajanduses.    "}, {"en": "To be able to use the acquired knowledge and skills in other disciplines in biology and in scientific research and find new solutions in applied microbiology.", "et": "Oskab kasutada omandatut õppekava järgnevates bioloogiaalastes ainekursustes, teaduslikus uurimistöös ning pakkuda välja uudseid lahendusi rakndusmikrobioloogiaalastesle probleemidele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}