{"uuid": "e5b79b54-c86d-b706-81d3-b22a912e8f77", "code": "LTMR.09.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Molecular Developmental Biology", "et": "Molekulaarne arengubioloogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR09", "structural_unit_name": {"en": "Chair of Developmental Biology", "et": "arengubioloogia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMR09", "name": {"en": "Chair of Developmental Biology", "et": "arengubioloogia õppetool"}, "address": "Riia 23-204; Riia 23b-226,230,234\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23-204; Riia 23b-226,230,234", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview about the general cellular and molecular mechanisms of embryonic development and organogenesis. In the course the important signalling pathways of development will be handled and what processes they regulate. The focus is on the early mammalian development,  primordial germ cell specialization, body axes formation, and the molecular mechanisms of nervous system, limb, and heart development, as well as sex determination and embryonic pattern formation. The seminars cover original articles on these topics and provide an overview of the methodologies used in developmental biology research.", "et": "Kursus annab ülevaate organismide varajase arengu ning hilisema organogeneesi rakulistest ja molekulaarsetest alustest. Käsitletakse arengus olulisi signaaliradasid ja milliseid protsesse nad reguleerivad. Keskendutakse imetajate varajasele arengule, idurakkude spetsialiseerumisele, kehatelgede kujunemisele ning närvisüsteemi, jäsemete ja südame arengu molekulaarsetele mehhanismidele, lisaks ka soo determinatsioonile ning embrüonaalse mustri moodustumisele. Seminarides käsitletakse originaalartikleid antud teemadel ning saadakse ülevaade arengubioloogilises uurimustöös kasutatavatest metoodikatest."}, "objectives": [{"en": "The general aim of the course is to provide the basic knowledge about the cellular and molecular mechanisms of development and organogenesis.", "et": "Kursuse eesmärgiks on anda ülevaade organismide arengu ning organogeneesi rakulistest ja molekulaarsetest alustest."}], "learning_outcomes": [{"en": "The student who have passed the course:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) Orientates in terminology of developmental biology, understands the principle processes of development and can (create associations) make connections between different developmental mechanisms.", "et": "1) Orienteerub arengubioloogia terminoloogias, saab aru arengulistest põhiprotsessidest ning oskab luua seoseid erinevate arengumehhanismide vahel."}, {"en": "2) Can describe the most important signalling pathways and signalling molecules and bring examples of their functioning in different developmental processes.", "et": "2) Oskab kirjeldada olulisemaid signaaliradu ja signaalmolekule ning tuua näiteid nende toimimisest erinevates arenguprotsessides."}, {"en": "3) Can describe the molecular mechanisms involved in the developmental stages discussed in the lectures (early development, body axis formation, germ cell development, nervous system development, heart development, limb development, sex determination).", "et": "3) Oskab kirjeldada loengutes käsitletud arengu etappides (varane areng, kehatelgede moodustumine, idurakkude areng, närvisüsteemi areng, südame areng, jäsemete areng, soo determinatsioon) toimuvaid molekulaarseid mehhanisme."}, {"en": "4) Is aware of new methodologies and scientific advances in developmental biology.", "et": "4) On kursis uuemate metoodikatega ja teadussaavutustega arengubioloogias."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}