{"uuid": "165d1012-2578-160c-a941-89f3e095b114", "code": "LTMR.02.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Population Genetics", "et": "Populatsioonigeneetika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR02", "structural_unit_name": {"en": "Chair of Evolutionary Biology", "et": "evolutsioonilise bioloogia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMR02", "name": {"en": "Chair of Evolutionary Biology", "et": "evolutsioonilise bioloogia õppetool"}, "phone": "+372 737 5053", "webpage_url": "https://evolutsioon.ut.ee", "address": "Riia 23b, ruumid 301-305, 328, 329\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23b, ruumid 301-305, 328, 329", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Introduction. Hardy-Weinberg equilibrium\nGenetic drift & mutation. Molecular clock\nCoalescence theory. \nEffective population size\nPopulation subdivision. Heterozygosity & FST\nLinkage disequilibrium, types of selection\nModel of neutrality and selection tests\nInferring populations' demographic history\nSeminars", "et": "Sissejuhatus. \nHardy-Weinberg'i tasakaal; \nGeneetiline triiv & mutatsioonid. Molekulaarne kell; \nKoalestsentsiteooria; \nEfektiivne populatsioonisuurus; \nPopulatsiooni struktureeritus. Heterosügootsus & FST; \nAheldatuse tasakaalutus, valiku tüübid; \nNeutraalne mudel & testid valiku tuvastamiseks;\nPopulatsioonide demograafilise ajaloo selgitamine; \nSeminarid"}, "objectives": [{"en": "The goal of the Population Genetics course is to give overview of basic models and parameters for description and study of the genetic structure and demographic history of populations. Theory is illustrated by computer simulations and calculation exercises.", "et": "Populatsioonigeneetika kursuse eesmärk on anda ülevaade põhilistest näitajatest ja mudelitest, mida populatsioonide geneetilise struktuuri ja demograafilise ajaloo kirjeldamiseks ja uurimiseks kasutatakse. Lisaks teooriale tehakse loengutes läbi arvutusülesandeid ja arvutisimulatsioonide demonstratsioone, mille eesmärk on materjali parem visualiseerimine ja praktilisel tasemel omandamine."}], "learning_outcomes": [{"en": "*Knows how to postulate the basic population genetics hypotheses.\n*Applies the knowledge, according to the necessity, for the cases related to the mutation genesis and the fate of mutations.\n* Understands the essence of the Hardy-Weinberg Law, and exploits it for testing the zero-hypothesis, using the knowledge about natural selection, migration, assortative mating, inbreeding, population structure, and random genetic drift.\n* Knows the properties of Wright-Fisher population. Knows how to find the probability of allele frequency change dependent on population size by the use of binomial equation. Is able to describe Markov Chains model of genetic drift.\n* Understands the definition of effective population size through the behaviour of model population. Knows the main factors that influence effective populations size, Ne, and is able to find Ne if any of the assumptions are violated.\n* Understands the concept of coalescence and the influence of demographic factors (Ne, structure) on the coalescence process. Knows how to find the probability of an exponentially distributed random event.\n* Knows the beneficial features of mitochondrial DNA and Y chromosome that are applied in the population genetic research. Knows the basic properties of marker classes: haplotype, SNP, STR. Knows how to find coalescence age of a clade by i) average number of pairwise differences, ii) average mutational distance from founder haplotype.\n* Has a general overview of the distribution of human global genetic diversity. Is able to name general methods of genomewide data analysis.", "et": "Kursuse läbinud tudeng: \n* Oskab püstitatada põhilisi populatsioonigeneetilisi hüpoteese. \n* Rakendab vajadusel teadmisi mutatsioonide tekke ja saatusega seotud asjaoludest. \n* Mõistab Hardy-Weinbergi seaduse olemust ja oskab seda rakendada nullhüpoteesi ümberlükkamiseks, kasutades teadmisi loodusliku valiku, migratsiooni, valikulise ristumise, inbriidingu, populatsiooni struktureerituse ja juhusliku geneetilise triivi kohta. \n* Oskab kirjeldada Wright-Fisheri populatsiooni. Suudab leida binoomvõrrandi abil alleelisageduse muutuse tõenäosuse geneetilise triivi tagajärjel sõltuvalt populatsiooni suurusest. Teab, mis on geneetilise triivi Markovi ahelate mudel ja milleks see hea on. \n* Teab efektiivse populatsiooni suuruse, Ne, definitsiooni vastavalt mudelpopulatsiooni käitumisele. Teab efektiivse populatsiooni suurust mõjutavaid peamisi tegureid ja suudab leida Ne juhul, kui mudelpopulatsiooni eeldused on rikutud. \n* Teab, mis on geneetiliste liinide koalestseerumine ja kuidas sõltub see populatsiooni suuruse muutustest ja struktureeritusest. Oskab leida eksponentjaotusega juhusliku sündmuse tõenäosust. \n* Oskab nimetada mitokondriaalse DNA ja Y kromosoomi kasulikke populatsioonigeneetilisi omadusi, mida rakendatakse (inim)populatsioonide ajaloo uurimisel. Eristab funktsionaalsest seisukohast markeritüüpe nagu haplotüüp, SNP ja STR. Oskab arvutada klaadi koalestsentsi aega kahel viisisl: 1) paariviisiliste erinevuste ja 2) keskmise mutatsioonilise kauguse järgi asutajahaplotüübist. \n*Omab üldist ülevaadet inimese globaalsest geneetilisest mitmekesisusest ja ülegenoomsetest populatsioonigeneetilistest meetoditest"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}