{"uuid": "6f355fe7-4221-33e9-f3a5-19fc2a7a369a", "code": "LTMR.06.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Molecular Cell Biology", "et": "Molekulaarne rakubioloogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR06", "structural_unit_name": {"en": "Chair of Cell Biology", "et": "rakubioloogia õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMR06", "name": {"en": "Chair of Cell Biology", "et": "rakubioloogia õppetool"}, "phone": "+372 737 5022", "address": "Riia 23b, ruumid 123-127, 135, 220, 227\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23b, ruumid 123-127, 135, 220, 227", "zip": "51010", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTMR"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives a compact review of essential cellular processes that direct the growth and differentiation of cells in response to various signals from their environment. The specific aim of the course is to emphasise the connections between different topics of molecular and cell biology - from structure of macromolecules to cell differentiation. The course is an introductory step for several follow-up courses in which those processes will be studied in more detail.", "et": "Õppeaine annab kontsentreeritud ülevaate nii eukarüootsetes, kui prokarüootsetes rakkudes toimuvatest molekulaarsetest protsessidest, mis on aluseks rakkude kohastumisel väliskeskkonnas toimuvatele muutustele ja signaalidele. Aine kujundab üldise arusaama rakudevahelise signalisatsiooni alustest, makromolekulide struktuuri ja funktsiooni vahelistest seostest ning geneetilise info avaldumist kontrollivatest protsessidest. Aine on sissejuhatuseks mitmetele valikainetele, kus mitmeid siin tutvustatud protsesse käsitletakse põhjalikumalt."}, "objectives": [{"en": "The aim of this course is to provide an overview of basic molecular processes and their interconnections in directing the cell growth and differentiation.", "et": "Kursuse eesmärgiks on anda üldteadmised molekulaarsest rakubioloogiast. Kursus annab ülevaate rakkudes toimuvatest molekulaarsetest protsessidest ja nende sidususest."}], "learning_outcomes": [{"en": "After passing the course the student:", "et": "Kursuse läbinud tudengid: "}, {"en": "1. Understands the mechanisms how cells respond to the signals from its environment, what are the mechanisms of signal transduction in cells and how it leads to cell differentiation.", "et": "1. Omavad ülevaadet bioloogilistest protsessidest, mille kaudu kujuneb rakkude vastus neid ümbritsevale keskkonnale - alustades erinevatest signalisatsiooniradadest kuni rakkude diferentseerumiseni. "}, {"en": "2. Knows the basic principles of protein structure formation and has an overview of the methods that are used for determination of protein structures.", "et": "2. Orienteeruvad makromolekulide (eeskätt valkude) struktuurides ja selle tuvastamise metoodikates. "}, {"en": "3. Knows the molecular mechanisms leading to cell differentiation.", "et": "3. Omavad ülevaadet rakkude diferentseerumise molekulaarsetest mehhanismidest. "}, {"en": "4. Knows the basic processes that regulate gene expression in different levels.", "et": "4. On kursis põhiliste protsessidega, mis kontrollivad geneetilise info avaldumist."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}