{"uuid": "d38025f5-c33f-40f0-80a0-8ef55e34ac76", "code": "LTMR.00.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Seminar in Speciality", "et": "Erialaseminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMR", "structural_unit_name": {"en": "Institute of Molecular and Cell Biology", "et": "molekulaar- ja rakubioloogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMR", "name": {"en": "Institute of Molecular and Cell Biology", "et": "molekulaar- ja rakubioloogia instituut"}, "phone": "+372 737 5027", "webpage_url": "https://tymri.ut.ee", "address": "Riia 23, 23b - 134\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23, 23b - 134", "zip": "51010", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The aim of the study is to acquire necessary skills for making scientific presentation and participation in discussion. Student learns how to make a presentation and write an article. During the course student has to make at least two presentations from which at least one has to be based on his/her scientific results from the course LTMR.00.023. The presentations are graded by the official supervisor and by the committee", "et": "Aine käigus süvendatakse tudengi oskusi teadusliku ettekande tegemiseks ja diskussioonides osalemiseks. Tudeng õpib praktilise töö käigus teadustulemuste esitamist nii suuliselt, kui kirjalikult.  Stuudiumi jooksul peab tudeng esinema seminaridel vähemalt kahe ettekandega, millest vähemalt ühel peab tudeng esitama oma teadustulemusi, milled on saanud õppeaine LTMR.00.023 Erialapraktika raames.  Ettekannete teemad fikseeritakse magistrandi õpingukavas.Ettekannete koostamist kontrollib ja hindab tudengile kinnitatud juhendaja ja tema poolt määratud komisjon."}, "objectives": [{"en": "The purpose of the course is to deepen the skills of masters students to present their scientific results in writing and orally. To deepen the skills to analyze scientific results to make conclusions and to place into larger context.", "et": "Aine eesmärgiks on süvendada magistrantide, oskusi teadustöö tulemuste esitamisel nii suuliselt, kui kirjalikult. Süvendade üliõpilaste oskust oma tulemusi kokku võtta, analüüsida, nendest järelduste tegemist ning oskust paigutada oma teadustulemusi üldisemasse teadusala konteksti."}], "learning_outcomes": [{"en": "After passed the course students:", "et": "Aine läbinud üliõpilane: "}, {"en": "1.Student is able to compile the presentation about the results from master's thesis or literature, to deliver spoken academic text and answer to questions during discussion;", "et": "1. Oskab koostada esitleda oma teadustöö tulemusi nii suuliselt kui kirjalikult ning arendada teaduslikku diskussiooni oma erialal; "}, {"en": "2. The student knows the general rules of writing academic text and can apply it in practice", "et": "2. Teab artiklite ja ettekannete koostamise üldreegleid ja suudab koostada teaduslikku artiklit ja ettekannet oma andmete alusel; "}, {"en": "3. The student knows the main programs and technical aids for preparing presentations and scientific papers.", "et": "3. Üliõpilane tunneb peamisi ettekannete koostamiseks ja artiklite kirjutamiseks kasutatavaid programme ja tehnilisi abivahendeid. "}, {"en": "4. Is able to orientate in scientific literature and critically evaluate previously published data in the context of its research", "et": "4. Suudab orienteeruda teaduskirjanduses ning kriitiliselt hinnata varasemalt avaldatud andmeid oma teadustöö kontekstis. "}, {"en": "5.Is able to understand and present the research results published by others.", "et": "5. Suudab aru saada ja esitada ka teiste poolt publitseeritud teadustulemusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}