{"uuid": "0be49344-6452-018b-92c2-3439c18d1666", "code": "LTMS.00.062", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Calculus I (Fundamentals)", "et": "Kõrgem matemaatika I (alused)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Linearalgebra. Vectors in space, their dot and vector product. Lines and planes in space. Functions, limits and continuity. Derivatives and applications of derivatives. Antiderivatives. Definite integrals and their applications, improper integral with infinite limits of integration.", "et": "Kõrgema matemaatika kursus, milles käsitletakse järgmisi teemasid: maatriksid, determinandid, lineaarvõrrandisüsteemid, vektorid ruumis, skalaarkorrutis, vektorkorrutis, sirged ja tasandid ruumis, funktsioonid, funktsiooni piirväärtus ja pidevus, funktsiooni tuletis ja diferentsiaal, määramata integraal, määratud integraal, lõpmatute rajadega päratu integraal."}, "objectives": [{"en": "To give basic knowledge of higher mathematics needed in computer science. The student develops learning skills related to numbers and calculation throughout the topics and exercise types covered in the course.", "et": "Anda informaatikas vajaminevad algteadmised kõrgemas matemaatikas. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes."}], "learning_outcomes": [{"en": "After passing this course the student:", "et": "Selle kursuse läbinud üliõpilane:"}, {"en": "1. knows definitions of matrix, inverse matrix; is able to multiplicate matrices and find inverse matrix;", "et": "1. teab maatriksi, pöördmaatriksi mõistet ja oskab teostada tehteid maatriksitega ning leida pöördmaatriksit;"}, {"en": "2. knows properties of determinants, is able to evaluate determinants;", "et": "2. oskab arvutada determinanti, teab determinantide põhiomadusi;"}, {"en": "3. is able to solve systems of linear equations;", "et": "3. oskab lahendada lineaarseid võrrandisüsteeme, teab Gaussi meetodit;"}, {"en": "4. is able to find vectors dot product, cross product in space and knows their applications;", "et": "4. oskab leida ruumivektorite skalaarkorrutist, vektorkorrutist ning teab nende rakendusi;"}, {"en": "5. is able to construct equation formulas for lines and planes in space, find their position;", "et": "5. oskab koostada sirgete ja tasandite võrrandeid ruumis ning leida nende vastastikust asendit;"}, {"en": "6. knows the definition of the function and general classes of functions and their graphs;", "et": "6. teab funktsiooni mõistet, funktsioonide liigitust, oskab ära tunda põhiliste elementaarfunktsioonide graafikuid;"}, {"en": "7. is familiar with the main properties of the limit, is able to find liimits; knows, what is continous function;", "et": "7. oskab arvutada piirväärtust ja teab piirväärtuse põhiomadusi; teab pideva funktsiooni mõistet;"}, {"en": "8. is familiar with the notions of the derivative, the differential; is able to find derivatives and differentials; knows the most important applications of derivatives;", "et": "8. teab tuletise ja diferentsiaali mõisteid; teab tuletise põhilisi omadusi ja oskab neid leida; teab tuletise ja diferentsiaali tähtsamaid rakendusi;"}, {"en": "9. knows the l'Hospital rule and knows how to use it;", "et": "9. teab L'Hospitali reeglit ja oskab seda rakendada."}, {"en": "10. knows how to investigate functions, when they are decreasing/increasing;", "et": "10. oskab uurida funktsiooni ja teab, mis on kasvavad/kahanevad funktsioonid;"}, {"en": "11. knows, what is antiderivates and how to find them in simpler case;", "et": "11. teab algfunktsiooni mõistet ja oskab leida määramata integraali lihtsamal juhul;"}, {"en": "12. knows, what is definite integral and how to calculate it;", "et": "12. teab, mis on määratud integraal ning oskab seda arvutada;"}, {"en": "13. knows applications of definite integral;", "et": "13. tunneb määratud integraali rakendusi;"}, {"en": "14. knows, what are improper integrals with infinite limits of integration and how to find them;", "et": "14. teab lõpmatute rajadega päratu integraali mõistet ja oskab seda leida;"}, {"en": "15. chooses suitable mathematical conceptions (formulae) for problems, and applies these conceptions while solving problems.", "et": "15. valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}