{"uuid": "939cb896-7f92-1cc2-b439-cfe61eec7bec", "code": "LTMS.00.068", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Linear Algebra", "et": "Lineaaralgebra alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This is an introductory course of algebra. The following topics are considered: 1) matrices, operations with matrices; 2) determinant of a matrix, Laplace theorem, reciprocal matrix; 3) vector space over the field of real numbers, subspace, basis, coordinates of a vector; 4) linear system of equations and their solutions Gauss-Jordan elimination, Cramer's rule; 5) complex numbers, operations with them.", "et": "Algebra sissejuhatav kursus, milles käsitletakse järgmisi teemasid: 1) maatriksid, tehted maatriksitega, tehete omadused; 2) determinandid, tema omadused, Laplace`i teoreem, teoreem maatriksite korrutise determinandist, pöördmaatriks; 3) vektorruum üle reaalarvude, alamruum, baas ja koordinaadid; 4) lineaarvõrrandsüsteemid, nende lahendamine Gaussi meetodiga, Crameri reegel; 5) kompleksarvud, tehted nendega."}, "objectives": [{"en": "This course gives basic knowledge in linear algebra. The student develops learning skills related to numbers and calculation throughout the topics and exercise types covered in the course.", "et": "See kursus annab algteadmised lineaaralgebrast. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes."}], "learning_outcomes": [{"en": "After passing this course every student:", "et": "Selle kursuse läbinud üliõpilane:"}, {"en": "1. knows the properties of matrices and determinants and is able to formulate and prove them;", "et": "1. teab maatriksite ja determinantide omadusi, oskab neid sõnastada ja tõestada;"}, {"en": "2. is able to calculate the inverse matrix;", "et": "2. oskab leida maatriksi pöördmaatriksit;"}, {"en": "3. knows what is a vector space and is able to give examples of vector spaces, to formulate and prove main properties of vector space;", "et": "3. teab, mis on vektorruum (üle reaalarvude), oskab tuua näiteid ning sõnastada ja tõestada põhiomadusi;"}, {"en": "4. knows the Gauss' method and Cramer's rule for solving systems of linear equations and is able to use these for solving noncomplicated problems;", "et": "4. tunneb Gaussi meetodit ja Crameri peajuhtu ja oskab neid vajadusel lihtsamate ülesannete korral kasutada;"}, {"en": "5. knows complex numbers, their algebraic, geometric and trigonometric form, is able to carry out arithmetic operations (addition, multiplication, division) with them;", "et": "5. teab, mis on kompleksarv, selle algebraline, geomeetriline, trigonomeetriline kuju, oskab teostada aritmeetikatehteid (liitmine, korrutamine, jagamine) kompleksarvudega;"}, {"en": "6. chooses suitable mathematical conceptions (formulae) for problems, and applies these conceptions while solving problems.", "et": "6. valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}