{"uuid": "3effadcb-1381-3576-8d98-5cdea19f77eb", "code": "LTMS.00.050", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-31T16:16:43", "title": {"en": "Analytic Geometry (Part 1)", "et": "Analüütiline geomeetria (1. osa)"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The present course of lectures is an introduction to analytic geometry. The following topics are considered in this course of lectures: 1) algebra of vectors (frame and coordinate system, inner product, cross product and triple product of vectors); 2) the equations of straight lines and planes, their applications.", "et": "Antud kursus on sissejuhatus analüütilisse geomeetriasse. Kursuses vaadeldakse järgmisi teemasid: 1) vektoralgebra (reeper ja selle poolt määratud koordinaadisüsteem, skalaar-, vektor- ja segakorrutamine); 2) sirge ja tasandi võrrandid, rakendused."}, "objectives": [{"en": "The goal of the present course of lectures is to give to the students of the Faculty of Science and Technology a basic knowledge in a field of geometry. The student develops also learning skills related to numbers and calculation throughout the topics and exercise types covered in the course.", "et": "Loodus- ja täppisteaduste valdkonna üliõpilastele geomeetria algteadmiste andmine. Õppija arendab muuhulgas arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes."}], "learning_outcomes": [{"en": "After passing this course every student:", "et": "Selle kursuse läbinud üliõpilane:"}, {"en": "1. is able to use vectors and operations of a vector algebra for solving simple problems;", "et": "1. oskab kasutada vektoreid ja vektoralgebra tehteid lihtsamate ülesannete lahendamisel;"}, {"en": "2. recognizes the equations of straight lines, given sufficient geometrical data a student is able to find the equation of a straight line, he is also able to determine the mutual positions of two lines in the space and to calculate the distance from a line to a point and the angle between two lines;", "et": "2. tunneb ära sirge võrrandi, oskab seda erinevate algandmete põhjal koostada, oskab määrata sirgete vastastikuseid asendeid ruumis ning arvutada punkti kaugust sirgest ja sirgete vahelist nurka;"}, {"en": "3. recognizes the equations of planes, given sufficient geometrical data a student is able to find the equation of a plane in Cartesian coordinates; he is also able to determine the mutual positions of a line and a plane and two planes in a space, to calculate the distance from a plane to a point and the angle between a line and a plane and between two planes.", "et": "3. tunneb ära tasandi võrrandi, oskab seda erinevate algandmete põhjal koostada, oskab määrata tasandite või sirge ja tasandi vastastikuseid asendeid ruumis ning arvutada punkti kaugust tasandist, samuti kahe tasandi või sirge ja tasandi vahelist nurka."}, {"en": "4. chooses suitable mathematical conceptions (formulae) for problems, and applies these conceptions while solving problems.", "et": "4. valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}