{"uuid": "e1eb1b0d-1eee-cd1d-fff6-446107d2778c", "code": "LTMS.00.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-08T16:21:06", "title": {"en": "Introduction to Financial Mathematics", "et": "Sissejuhatus finantsmatemaatikasse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The following concepts are considered: discounting and time value of the money; some securities (bond, stock, forward, future, swap, option); market of securities; mathematical models to price risk-free and risky future cash flows; pricing bonds, options etc; speculation, arbitrage, risk hedging and diversification at the market; portfolio theory, CAPM, APT.", "et": "Kursuses vaadeldakse finantsturgude alusmõisteid: intressid, diskonteerimine, investeeringu nüüdisväärtus, tulumäär ja oodatav tulu ning antakse ülevaade peamistest väärtpaberite liikidest (võlakiri, aktsia, forward, futuur, swap, optsioon). Kursuses käsitletakse matemaatilisi mudeleid riskivabade ja riskantsete tuleviku rahavoogude hindamiseks ning võlakirjade ning tuletisväärtpaberite hinna leidmiseks.  Samuti vaadeldakse portfelliteooriat, CAPM ja APT mudeleid  ning erinevaid riskide maandamise võimalusi."}, "objectives": [{"en": "The goal of the course is to give overview of the fundamental concepts of the financial markets and the basic models of the financial mathematics.", "et": "Anda ülevaade finantsturgude baasmõistetest ning finantsmatemaatika põhilistest mudelitest."}], "learning_outcomes": [{"en": "Student knows main types of financial markets and assets traded there, mathematical models of financial markets to price the risk-free and risky future cash flows.  Student has skills to find interests, net value of investment and investment portfolio risk, has skills to find prices of the bonds, options, futures etc, has skills to disperse and manage risks related with risky investments.", "et": "Kursuse läbinu tunneb peamisi finantsturgude liike ja nendel kaubeldavaid väärtpabereid, finantsturgude matemaatiliste mudelite kasutamise eeldusi ja matemaatilisi mudeleid riskivabade ja riskantsete tuleviku rahavoogude hindamiseks. Oskab leida intresse, investeeringute puhasväärtust ja investeerimisportfelli riski, oskab  leida võlakirjade, optsioonide, futuuride jne. hinda. Oskab hajutada ja maandada riske."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}