{"uuid": "9071169f-49c3-cfaf-6716-b9caa848046f", "code": "LTMS.00.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The master thesis gives knowledge and skills to compose scientific-based additional materials for teaching mathematics and informatics in school, and/or to evaluate the effectiveness of their application in school. An overview of educational research methods and their specific features in teaching mathematics in school, and their linkage to teaching practice will be developed.", "et": "Magistritööga saadakse teadmised ja oskused teaduslikel alustel õpetajatööks vajalike lisamaterjalide koostamiseks ning/või nende rakendamise tulemuslikkuse hindamiseks. Seejuures saadakse ülevaade haridusteaduslikest uurimismeetoditest ning nende rakendamise spetsiifikast koolimatemaatikas ning nende seostamise võimalustest õpetajatööga."}, "objectives": [{"en": "The main goal is to direct the student to study an entire problem on the field of didactics of mathematics or pedagogics, to draw up and present the results of this research.", "et": "Eesmärk on suunata üliõpilane mingi tervikliku matemaatika didaktika või pedagoogikaalase probleemi uurimisele, vastava uurimistöö tulemuste vormistamisele ja esitlemisele."}], "learning_outcomes": [{"en": "A graduate student:", "et": "Õppeaine läbinu:"}, {"en": "1. Is able to compose scientific-based additional materials for teaching mathematics and informatics, and to evaluate the effectiveness of their application in classes.", "et": "1. Oskab teaduslikul alusel koostada õppetööks vajalikke lisamaterjale ning hinnata nende rakendamise tulemuslikkust ainetundides."}, {"en": "2. Can find and analyze scientific information and synthesizes new knowledge in mathematics and informatics education, based on this information and collected experimental data, and is able to apply this in composing teaching/learning materials.", "et": "2. Oskab leida ja analüüsida teaduslikku infot ning suudab sellest ja enda poolt kogutud andmetest sünteesida uusi teadmisi koolimatemaatikas ja -informaatikas ning oskab selle põhjal koostada õpetajatööks vajalikke materjale."}, {"en": "3. Holds a general review of educational research methods and their specific features in science education and can use them in composing a master thesis.", "et": "3. Omab ülevaadet hariduslikest uurimismeetoditest ja eripärast ning oskab neid rakendada magistritöö koostamisel."}, {"en": "4. Applies his/her acquired knowledge in formulating scientific problems, planning and carrying out studies, making conclusions based on the results, and presents these in an oral or written form in the field of mathematics education.", "et": "4. Oskab rakendada omandatud teadmisi ja oskusi teadusprobleemide sõnastamisel, uuringute planeerimisel ja läbiviimisel, kogutud andmete põhjal järelduste tegemisel ning nende kirjalikul ja suulisel esitamisel koolimatemaatika valdkonnas."}, {"en": "5. Is able to present his/her research results in a written form and present these orally to educational specialists and broader auditorium, holds a skill of academic discussion and gives argumentative scientific answers.", "et": "5. Oskab uurimustulemusi kirjalikult vormistada eesti keeles ja esitada neid suuliselt nii haridusteadlastele kui ka laiemale kuulajaskonnale, valdab akadeemilist diskussiooni ning oskab argumenteeritult kaitsta oma seisukohti."}, {"en": "6. Knows the main principle of scientific ethics and is able to evaluate a level of research and application in teaching practice.", "et": "6. Tunneb teaduseetika üldprintsiipe ning oskab hinnata uuringute teaduslikku taset ja rakenduslikku väärtust õpetajatöös."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}