{"uuid": "e9cfd394-5c70-1c59-a2e5-4ae87406da98", "code": "LTMS.00.055", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Statistical Machine Learning", "et": "Statistiline masinõpe"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Methods of statistical analysis broadly classified as supervised and unsupervised learning are treated. Though many methods belonging here come from the history of statistics, significant contribution has been made by algorithmic methods of computer scientists during last years. The goal of the methods is modelling, prediction, classification, dimensionality reduction, structure discovery and visualization. The performance of methods is evaluated by the computer-intensive techniques, like cross-validation. In this course we pay attention to assumptions and mathematical background of each method, enabling students to understand actual meaning of different choices and parameters used in the modelling process. The theoretical backgound of methods is discussed in lectures and practical skills of applying them are developed in computer labs by using R software.", "et": "Aine käsitleb statistilise analüüsi meetodeid, mida laias laastus jagatakse juhendatud ja juhendamata õppega meetoditeks. Kuigi paljud siia kuuluvad meetodid tulevad statistika ajaloost, on viimastel aastatel olulise panuse andnud arvutiteadlased oma algoritmiliste meetoditega. Meetodite eesmärgiks on modelleerimine, prognoosimine, klassifitseerimine, dimensiooni alandamine, struktuuri avastamine ja visualiseerimine. Meetodite headuse hindamiseks kasutatakse arvutiintensiivseid meetodeid, näiteks ristvalideerimist. Kursuses pööratakse suurt tähelepanu ka meetodite rakendamisel tehtavatele eeldustele ning taustaks olevatele matemaatilistele printsiipidele, andes kuulajatele võimaluse aru saada erinevate kasutatavate parameetrite sisulisest tähendusest."}, "objectives": [{"en": "Introduction to modern methods for analysing large datasets, the mathematical background of each method and learning to apply those methods by using R software.", "et": "Tutvumine kaasaegsete meetoditega suurte andmekogude analüüsimiseks, nende meetodite matemaatiliste tööprintsiipidega ning rakendamisvõimalustega R tarkvara baasil."}], "learning_outcomes": [{"en": "After completing the course, students know main machine learning methods (except neural networks), is able to choose most meaningful methods based on the aim of data analysis, is able to apply the methods for analyzing various datasets in R and is also able to interpret the results.", "et": "Kursuse läbinu tunneb põhilisi masinõpe meetodeid (peale närvivõrkude) ja nende matemaatilist tausta, oskab lähtuvalt eesmärgist valida sobiva meetodi, seda rakendada R tarkvara kasutades ning saadavaid tulemusi interpreteerida."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}