{"uuid": "883fe7b3-27d8-981b-057d-849782799ad5", "code": "LTMS.00.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Calculus I", "et": "Kõrgem matemaatika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Linearalgebra, matrices, determinants. Functions, graphs, limits and continuity. Derivatives and applications of derivatives. Antiderivates and their applications.", "et": "Kõrgema matemaatika kursus, milles käsitletakse järgmisi teemasid: maatriksid, determinandid, lineaarvõrrandisüsteemid, funktsioonid ja nende graafikud, funktsiooni piirväärtus ja pidevus, funktsiooni tuletis ja diferentsiaal ning nende rakendused, määramata integraal, määratud integraal,  selle rakendused"}, "objectives": [{"en": "This course gives basic knowledge in higher mathematics. The student develops learning skills related to numbers and calculation throughout the topics and exercise types covered in the course.", "et": "See kursus annab algteadmised kõrgemas matemaatikas. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes."}], "learning_outcomes": [{"en": "After passing this course the student:\t\n- Knows properties of determinants, is able to evaluate determinants. \n- Is able to solve systems of linear equations.  \n- Knows the definition of the function and general classes of functions and their graphs.\n- Is familiar with the main properties of the limit, is able to find limits. Knows, what is continous function.\n- Is familiar with the notions of the derivative, the differential; is able to find derivatives and differentials; knows the most important applications of derivatives.\n- Knows how to investigate functions, when they are decreasing/increasing and curved/concave.\n- Knows, what is antiderivates and how to find them in simpler case.\n- Chooses suitable mathematical conceptions (formulae) for problems, and applies these conceptions while solving problems.", "et": "Selle kursuse läbinud üliõpilane:\n- oskab lahendada lineaarseid võrrandisüsteeme.\n- teab funktsiooni mõistet, funktsioonide liigitust. Oskab ära tunda põhiliste elementaarfunktsioonide graafikuid.\n- oskab arvutada piirväärtust ja teab piirväärtuse põhiomadusi. Teab pideva funktsiooni mõistet.\n- teab tuletise ja diferentsiaali mõisteid; teab tuletise põhilisi omadusi ja oskab neid leida; teab tuletise ja diferentsiaali tähtsamaid rakendusi;\n- oskab uurida funktsiooni ja teab, mis on kasvavad/kahanevad, kumerad/nõgusad funktsioonid;\n- teab algfunktsiooni mõistet ja oskab leida määramata integraali lihtsamal juhul;\n- valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}