{"uuid": "b7810054-545b-357c-9b83-59c11209483c", "code": "lt-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-30T10:39:13", "title": {"en": "Origami and Mathematics: The Art and Science of Folding", "et": "Origami ja matemaatika: voltimise kunst ja teadus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course \"Origami and Mathematics: The Art and Science of Folding\" introduces origami as an interdisciplinary tool that integrates creativity, mathematical concepts, and problem-solving skills. It explores the historical and cultural background of origami, its mathematical foundations—including symmetry, geometric shapes, and algorithms—and its practical applications in design, engineering, and research. Through practical tasks and a creative project, students will gain experience in understanding and applying folding processes in both aesthetic and functional contexts. The course aims to enhance students’ spatial reasoning, analytical skills, and creative approaches, offering opportunities to explore how art and science complement each other.", "et": "Kursus \"Origami ja matemaatika: voltimise kunst ja teadus\" tutvustab origamit kui interdistsiplinaarset tööriista, mis ühendab loovust, matemaatilisi kontseptsioone ja probleemilahendamise oskusi. Kursus uurib origami ajaloolist ja kultuurilist tausta, selle matemaatilisi aluseid, sealhulgas sümmeetriat, geomeetrilisi kujundeid ja algoritme, ning praktilist rakendust disainis, inseneriteadustes ja teadusuuringutes. Läbi praktiliste ülesannete ja loovprojekti saavad üliõpilased kogemuse voltimise protsesside mõistmiseks ja kasutamiseks nii esteetilistes kui ka funktsionaalsetes kontekstides. Kursuse eesmärk on arendada üliõpilaste ruumilist mõtlemist, analüüsioskusi ja loovat lähenemist, pakkudes võimalust uurida, kuidas kunst ja teadus saavad üksteist täiendada."}, "objectives": [{"en": "The course \"Origami and Mathematics: The Art and Science of Folding\" aims to introduce origami as an interdisciplinary tool that combines creative thinking, mathematical concepts, and problem-solving skills. It seeks to develop students’ spatial reasoning, logical thinking, and aesthetic perception by offering practical skills through folding processes. Additionally, the course explores the applications of origami in various fields, including design, engineering, and education, showcasing how mastery of folding techniques can foster creative scientific inquiry.", "et": "Kursuse \"Origami ja matemaatika: voltimise kunst ja teadus\" eesmärk on tutvustada origamit kui interdistsiplinaarset tööriista, mis ühendab loovmõtlemist, matemaatilisi kontseptsioone ja probleemilahendusoskusi. Seega püütakse arendada üliõpilaste ruumilise mõtlemise, loogilise arutlemise ja esteetilise tajumise oskust, pakkudes praktilisi oskusi voltimisprotsesside kaudu. Lisaks käsitleb kursus origami rakendusi erinevates valdkondades, sealhulgas disainis, inseneriteadustes ja hariduses, et näidata, kuidas voltimise kunsti valdamine võib olla samal ajal võimalus loovaks teadustööks."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "understand the history, principles, and applications of origami across various fields, including mathematics, design, and engineering;", "et": "tunneb origami ajalugu, põhimõtteid ja rakendusi erinevates valdkondades, sealhulgas matemaatikas, disainis ja inseneriteadustes;"}, {"en": "analyze and interpret folding processes through mathematical and geometric concepts;", "et": "analüüsib ja tõlgendab voltimise protsesse matemaatiliste ja geomeetriliste mõistete kaudu;"}, {"en": "design and create origami models by combining folding techniques from engineering with creative thinking;", "et": "kavandab ja loob origami mudeleid, kombineerides inseneeriast tuntud voltimisvõtteid ja loovmõtlemist;"}, {"en": "explain and present folding processes by creating algorithmic instructions and teaching materials;", "et": "selgitab ja esitleb voltimise protsesse, osates luua algoritmilisi juhiseid ja juhendmaterjale;"}, {"en": "evaluate origami techniques in the context of sustainability and material use;", "et": "hindab origami tehnikaid jätkusuutlikkuse ja materjalikasutuse kontekstis;"}, {"en": "develop problem-solving and interdisciplinary thinking skills using origami as a practical tool;", "et": "arendab probleemilahendamise ja interdistsiplinaarse mõtlemise oskusi, kasutades origamit kui praktilist tööriista;"}, {"en": "understand how folding processes are applied in modern scientific research and technology.", "et": "mõistab, kuidas voltimisprotsesse rakendatakse kaasaegsetes teadusuuringutes ja tehnoloogias."}], "notes": {}}, "grading": {"independent_work": {"en": "1. Learning portfolio. Detailed requirements in Moodle.\n2. Analysis and presentation of a science paper related to origami. Detailed requirements in Moodle.\n3. Creative project development and presentation. Detailed requirements in Moodle.", "et": "1. Õpimapp. Täpsemad nõuded Moodle'is.\n2. Origami-teemalise (üliõpilase õppekavale vastava valdkonna) teadusartikli analüüs ja esitlus. Täpsemad nõuded Moodle'is.\n3. Loovprojekti koostamine ja esitlus. Täpsemad nõuded Moodle'is."}, "independent_work_assessments": [{"work_type": {"code": "portfolio", "et": "Õpimapp", "en": "portfolio"}, "description": {"en": "A learning portfolio meeting the requirements has been submitted.", "et": "Esitatud on nõuetelevastav õpimapp."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"en": "The analysis of a scientific article on origami has been submitted and presented.", "et": "Esitatud ja esitletud on origami-teemalise teadusartikli analüüs."}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"en": "Creative project have been submitted.", "et": "Koostatud ja esitletud on loovprojekt."}}], "grade_preconditions": {"en": "Learning Portfolio:\nA learning portfolio meeting the requirements has been submitted. Detailed requirements in Moodle.\nPractical Assignment:\nAn analysis of a science article related to origami and a creative project have been submitted. Detailed requirements in Moodle.\n", "et": "Õpimapp:\nEsitatud on nõuetele vastav õpimapp. Täpsemad nõuded Moodle'is.\nPraktiline ülesanne: \nEsitatud on origami-teemalise teadusartikli analüüs ning loovprojekt. Täpsemad nõuded Moodle'is."}, "grade_evaluation": {"en": "All assessment tasks have been submitted in accordance with the requirements.", "et": "Kõik arvestuslikud tööd on esitatud vastavalt nõuetele."}, "grade_conditions": {"arvestatud": {"en": "All assessment tasks have been submitted in accordance with the requirements.", "et": "Kõik arvestuslikud tööd on esitatud vastavalt nõuetele."}, "mittearvestatud": {"en": "The assessment tasks have not been submitted or do not meet the requirements.", "et": "Arvestuslikud tööd on esitamata või ei vasta nõuetele."}}, "debt_elimination": {"en": "By agreement with the instructor, in accordance with the study regulations.", "et": "Kokkuleppel õppejõuga vastavalt õppekorralduseeskirjale."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "e19d8314-dfa8-4819-bc20-bbb68a2b8a32", "type": "MOODLE", "code": "LTMS.00.086", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "f012a438-3fc0-07c4-5ffb-c45231bfeadb", "person_name": "Tiina Kraav", "structural_unit": {"code": "LTMS01", "name": {"en": "Centre for Mathematics Education", "et": "Matemaatikahariduse keskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTMS"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-39."}, "entries": [{"course_week": 24, "time": "2025-02-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"en": "Introduction to Origami. Basic Techniques. Miura-ori", "et": "Sissejuhatus origamisse. Põhivõtted. Miura voltimisvõte"}, "description": {"en": "Course structure and introduction to objectives. History and cultural background of origami. Origami as an interdisciplinary tool (connecting art, mathematics, and science). Fundamental principles of folding. Flat-folding demonstrated through the Miura-ori.", "et": "Kursuse ülesehitus ja eesmärkide tutvustus. Origami ajalugu ja kultuuriline taust. Origami kui interdistsiplinaarne tööriist (kunsti, matemaatika ja teaduse ühendamine). Voltimise aluspõhimõtted. Lamevoltimine Miura voltimisvõtte näitel. "}}, {"course_week": 26, "time": "2025-02-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"en": "Origami Geometry", "et": "Origami geomeetria"}, "description": {"en": "Axioms of origami geometry. Regular polygons, Bronze, silver, and golden ratios.\n", "et": "Origami geomeetria aksioomid. Korrapärased hulknurgad, pronks-, hõbe- ja kuldlõige."}}, {"course_week": 28, "time": "2025-03-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"en": "Yoshimura-ori", "et": "Yoshimura voltimisvõte"}, "description": {"en": "The mathematical background of the Yoshimura-ori, applications in art, design and engineering.", "et": "Yoshimura voltimisvõtte matemaatiline taust, praktilised rakendused kunstis, disainis ja inseneerias."}}, {"course_week": 30, "time": "2025-03-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"en": "Waterbomb-base", "et": "Veepommivõte"}, "description": {"en": "The waterbomb technique and its developments: Practical applications in art, design, and engineering. Algorithmic thinking and its connections to folding tasks.", "et": "Veepommivõte ja selle edasiarendused. Praktilised rakendused kunstis, disainis ja inseneerias. Algoritmiline mõtlemine ja selle seosed voltimisülesannetega. "}}, {"course_week": 32, "time": "2025-04-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"en": "Twisted and collapsible objects", "et": "Keerduvad ja kokkuvoltuvad objektid"}, "description": {"en": "The mathematical principles of constructing twisted and collapsible objects. The design process of such objects: from idea to model. Quadric surfaces.", "et": "Keerduvate ja kokkuvoltuvate objektide konstrueerimise matemaatilised põhimõtted. Selliste objektide disainiprotsess: ideest mudelini. Teist järku pinnad."}}, {"course_week": 34, "time": "2025-04-23", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {"en": "One-cut method", "et": "Ühe lõike meetod"}, "description": {"en": "Mathematical background behind the single cut method, its application for cutting freely chosen simple and more complex shapes.", "et": "Matemaatiline taust ühe lõike meetodi taga, selle rakendamine vabalt valitud lihtsate ja keerukamate kujundite lõikamiseks. "}}, {"course_week": 36, "time": "2025-05-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"en": "Origami in scientific research and papers", "et": "Origami teadusuuringutes ja -artiklites"}, "description": {"en": "Presentation of scientific papers selected by the participants of the course.", "et": "Osalejate poolt valitud huvipakkuvate (iga üliõpilase õppekavale vastava valdkonna) teadusartiklite tutvustus."}}, {"course_week": 38, "time": "2025-05-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 8, "topic": {"en": "Creative project", "et": "Loovprojekt"}, "description": {"en": "Application of origami techniques learned during the course in a creative project, with its presentation.", "et": "Kursuse jooksul omandatud origamivõtete rakendamine loovprojektis, selle tutvustus."}}]}, "registration_info": {"audience": {}, "max_students": 30}, "parent_uuid": "a80926e2-df6d-6b31-5526-6495ac8aa255", "parent_code": "LTMS.00.086", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}