{"uuid": "24ba51cd-8d0a-bebc-db4e-aba2476a9f3d", "code": "LTMS.00.069", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-30T15:28:54", "title": {"en": "Real Analysis I", "et": "Matemaatiline analüüs I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course is the first of the basic courses in the mathematical analysis of real variables and delves into the following topics: the theory of real numbers, sequences and series, continuous and discontinuous functions, and differentiable functions.", "et": "Kursus on reaalmuutuja analüüsi põhikursustest esimene ning käsitleb süvendatult järgmisi teemasid: reaalarvude teooria, arvjadad ja arvread, pidevad ja katkevad funktsioonid, diferentseeruvad funktsioonid."}, "objectives": [{"en": "The aim of \"Real Analysis I\" is to treat in detail the following topics: the theory of real numbers, sequences and series, continuous functions, and differentiable functions.\n \nTo support critical thinking skills and to develop mathematical oral and written self-expression skills.", "et": "Aine \"Matemaatiline analüüs I\" eesmärk on süvendatult käsitleda järgmisi teemasid: reaalarvude teooria, arvjadad ja -read, pidevad funktsioonid ja diferentseeruvad funktsioonid.\n\nKriitilise mõtlemise oskuse toetamine ning matemaatilise suulise ja kirjaliku eneseväljendusoskuse arendamine."}], "learning_outcomes": [{"en": "A student who completes the course will:\n1) Know the basic properties of real numbers; be able to find infima and suprema of subsets of real numbers; know the properties of absolute value and be able to prove them.\n2) Know the concept of the limit of a sequence; recognize the main convergent and divergent sequences; know and be able to prove the properties of convergent sequences and the basic principles of convergence theory.\n3) Know the concepts of the limit and continuity of a function; be able to state and prove the most important properties of continuous functions on an interval; be able to investigate the continuity of a function in simpler cases using both definitions and fundamental results.\n4) Know the concepts of the derivative and differentiability of a function; be able to state and prove the fundamental theorems of differential calculus and apply them in simpler situations; be able to find the derivative of a function in simpler cases using the definition.\n5) Choose appropriate mathematical concepts for solving problems and be able to apply them accordingly.\n6) Examine and construct logical arguments within the framework of the mathematical concepts learned during the course.\n7) Have developed mathematical written self-expression skills through tests and mathematical oral self-expression skills through practical sessions, lectures, and the exam; also have discussed the nature, proofs, and examples of mathematical concepts in the oral exam.", "et": "Õpiväljundid\nSelle kursuse läbinud üliõpilane:\n1) tunneb reaalarvude hulga põhiomadusi; oskab leida reaalarvude hulkade rajasid; teab absoluutväärtuse omadusi, oskab neid tõestada;\n2) teab arvjada piirväärtuse mõistet; tunneb põhilisi koonduvaid ja hajuvaid arvjadasid; teab ja oskab tõestada koonduvate jadade omadusi ning koonduvusteooria põhiprintsiipe;\n3) teab funktsiooni piirväärtuse ja pidevuse mõisteid; oskab sõnastada ja tõestada lõigus pideva funktsiooni tähtsamaid omadusi; oskab lihtsamatel juhtudel uurida funktsiooni pidevust nii definitsiooni kui ka põhitulemuste abil;\n4) teab funktsiooni tuletise ja diferentseeruvuse mõisteid; oskab sõnastada ja tõestada diferentsiaalarvutuse põhiteoreeme ning oskab neid lihtsamates olukordades rakendada; oskab lihtsamatel juhtudel leida funktsiooni tuletist definitsiooni abil;\n5) valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid ning oskab neid siis rakendada;\n6) uurib ja koostab loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames;\n7) on arendanud matemaatilist kirjalikku eneseväljendusoskust kontrolltöödes ja matemaatilist suulist eneseväljendusoskust praktikumides, loengutes ja eksamil; samuti on arutlenud suulisel eksamil matemaatiliste kontseptsioonide olemuse, tõestuse ja näidete üle."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}