{"uuid": "85e53d7f-0574-b0bf-826b-bfa1b1ab2e93", "code": "LTMS.00.065", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-03T16:08:03", "title": {"en": "Introduction to Bayesian Modelling", "et": "Sissejuhatus Bayesi mudelitesse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course starts with the explanation Bayesian modelling (prior, posterior, marginal distribution, posteiror predicative distribution) followed by examples of standard parametric models (Beta-Bernoulli, Dirichlet-categorical, Polya urn, Gamma-Poisson, Normal and NIX-models, Gamma-exponential). The choice of priors (conjugate, non-informative, Jeffreys, proper and unproper, empirical) are discussed. Then an overview of some basic asymptotic results (posterior consistency, Bernstein-von Mieses theorem, deFinetti theorem). The idea of hierarchical models and some examples of standard hierarchical models are covered (latent Dirichlet allocation). Some Bayesian regression models are introduced. The course ends with introduction to non-parametric Bayesian models (Dirichlet process mixtures, Chinese restaurant process, etc).", "et": "Kursus algab Bayesi modelleerimise põhialustega (eelmõõt, järelmõõt jne), seejärel näited parameetrilistest standardmudelitest (Beta-Bernoulli, Dirichlet-kategoriaalne, Polya urn, Gamma-Poisson, normaalsed ja  NIX-mudelid, Gamma-eksponent). Eelmõõdu tüübid (kaasjaotus, mitteinformatiivne eelmõõt, Jeffrey eelmõõt, ebakorrektne eelmõõt, empiiriline eelmõõt). Väike ülevaade asümptootikast -- mõjusus ja tsentraalne piiretroreem (Bernstein-von Mieses), deFinetti teoreem. Hierarhilised mudelid, näited. Sissejuhatus mitteparemeetrilisse Bayesi statistikasse (Dirichlet protsess, üldistatud Polya urn, Hiina restorani protsess jne). Näited."}, "objectives": [{"en": "To learn basic of Bayesian modelling: standard models, some asymptotics, hierarchical models, non-parametric models.", "et": "Tutvumine Bayesi statistikas kasutatavate peamiste (parameetrilised, hirarhilised, mitteprameetrilised) mudelitega."}], "learning_outcomes": [{"en": "After passing the course, the student uderstands the fundamentals of Bayesian modelling and can apply standard models in practical data analysis.", "et": "Kursuse läbinu tunneb Bayesi statistika aluseid, põhimõisteid, peamisi mudeleid ja printsiipe ning oskab neid kasutada statistilises analüüsis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}