{"uuid": "d6e39e95-66bf-afc0-8f8a-92fad2898488", "code": "LTMS.00.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Stochastic Models", "et": "Stohhastilised mudelid"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In this course a short overview of  some parts of probability theory , random processes and statistics is given that are necessary for passing other courses in the curricula of Actuarial and Financial Engineering. The concepts of probability, random variable, and expected value are presented from measure-theoretic point of view. As basic random processes, Markov chains, Poisson processes and Brownian motion are introduced. Linear regression is handled by means of matrix algebra.", "et": "Kursuses antakse lühike ülevaade tõenäosusteooria, juhuslike protsesside ja statistika nendest osadest, mida vajatakse õppekava teiste ainete läbimiseks. Tõenäosuse, juhuslik suuruse ja keskväärtuse mõisted esitatakse mõõduteoreetilisest vaatevinklist lähtudes. Juhuslikest protsessidest tutvustatakse Markovi ahelaid, Poissoni protsesse ja Browni liikumist. Lineaarsete statistiliste mudelite käsitlemisel kasutatakse maatriksalgebra keelt."}, "objectives": [{"en": "The purpose of the subject is to prepare students for the courses that assume knowledge of probability and statistics:", "et": "Aine eesmärk on valmistada üliõpilasi ette erialaainete läbimiseks, mis eeldavad tõenäosusteooria ja statistika alaseid teadmisi:"}, {"en": "* to give short overview of  probability (axiomatic aspect),", "et": "* anda lühike  ülevaade tõenäosusteooria põhimõistetest (aksiomaatiline aspekt);"}, {"en": "* to introduce basic stochastic processes,", "et": "* tutvustada olulisemaid juhuslikke protsesse;"}, {"en": "* to introduce basics of statistical modelling.", "et": "* tutvustada statistiliste seoste modelleerimise aluseid."}], "learning_outcomes": [{"en": "The students who have passed the course", "et": "Aine läbinud üliõpilased "}, {"en": "* know and are able to apply main concepts and results  of probability theory", "et": "* teavad ja oskavad kasutada tõenäosusteooria põhimõisteid ja klassikalisi tulemusi;"}, {"en": "* know basic stochastic processes, including Markov chains, Poisson processes and Brownian motion,", "et": "* tunnevad  kõige põhilisemaid juhuslikke protsesse sh Markovi ahelaid, Poissoni protsesse, Browni liikumist;"}, {"en": "* have knowledge and skills for applying linear regression analysis.", "et": "* oskavad kasutada lineaarseid mudeleid statistiliste seoste kirjeldamiseks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}