{"uuid": "6abd9632-3230-ae50-3a73-4bc4d09e97c3", "code": "lt-2025-autumn-fulltime-p3-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-28T16:37:37", "title": {"en": "Statistical Data Science", "et": "Statistiline andmeteadus"}, "credits": 2, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "3", "et": "3. osa", "en": "part 3"}, "part_credits": 2, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "label": {"en": "25/26 A regular part 3 2 CP LT Eng", "et": "25/26 S PÕ 3. osa 2 EAP LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 10, "practice": 10, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 30, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course consists in three modulae:\nData description, visualization and basic data analysis - 2 ECTS\nStatistical models and multivariate analysis - 2 ECTS\nAnalysis of complex data structures - 2 ECTS\nOrientation in big data sets, finding necessary information and making correct conclusions is necessary not only in professional career but also in politics, administration and entrepreneurship.\nIn the first modulus of the course basic data analysis and visualization methods are presented, the second modulus introduces main methods of multivariate analysis and gives knowledge for applying these methods in data analysis.\nThe third modulus gives overview on specific advanced methods of data analysis and skills for applying them to real data.", "et": "Kursus koosneb kolmest moodulist:\nAndmete kirjeldamise, visualiseerimise ja analüüsi alused (baasmoodul) - 2 EAP\nStatistilised mudelid ja mitmemõõtmeline analüüs - 2 EAP\nKeerukate andmestruktuuride analüüs - 2 EAP\nSuurtes andmehulkades orienteerumine, andmetest vajaliku informatsiooni leidmine ja korrektsete järelduste tegemine on tänapäeva ühiskonnas hädavajalik oskus nii erialasel tööl, kui juhtivatel kohtadel, poliitikas ja ettevõtluses. \nKursuse esimeses moodulis antakse vajalikud teadmised esmase andmeanalüüsi läbiviimiseks, teine moodul annab teadmised ja oskused mitmemõõtmelise statistika põhiliste meetodite rakendamiseks. Kolmas moodul annab ülevaate spetsiifilistest andmetöötlusmeetoditest ning oskused olulisemate meetodite rakendamiseks."}, "objectives": [{"en": "Basic modulus: Data description, visualization and basic analysis - 2 ECTS", "et": "Andmete kirjeldamise, visualiseerimise ja analüüsi alused (baasmoodul) - 2 EAP"}, {"en": "The aim of the modulus is to give systematic overview on elementary principles of data management and analysis. The data package R is introduced (with submodule RStudio) and applied in primary data analysis and visualization. The modulus gives to PhD students knowledge for planning their future empirical research and the following analysis of collected data. It also gives necessary knowledge for critical reading research papers and data analysis reports to evaluate correctness and validity of the conclusions made in literature.", "et": "Kursuse baasmoodul annab süstemaatilise ülevaate andmetöötluse ja -analüüsi elementaarsetest põhimõtetest. Tutvutakse populaarse analüüsikeskkonnaga R (ja kasutajamooduliga RStudio) ning õpitakse seda vahendit kasutama andmete esmasel töötlusel ja visualiseerimisel. Mooduli läbimine võimaldab doktorantidel otstarbekalt planeerida uuringute läbiviimist ja hilisemat töötlemist ning tulemuste tõlgendamist. Samuti annab ta vajalikud eelteadmised selleks, et doktorant omandaks andmeanalüüsi raportite ja teadusartiklite kriitilise lugemise oskuse hindamaks uuringu ülesehituse korrektsust, andmete piisavust, analüüsi ja selle põhjal tehtud järelduste valiidsust.  "}, {"en": "Modulus: Statistical models and multivariate analysis - 2 ECTS", "et": "Statistilised mudelid ja mitmemõõtmeline analüüs - 2 EAP"}, {"en": "The aim is to present main statistical methods for discovering patterns and regularities in data in the analyzing and testing process. After passing the modulus a student is aware of basic statistical models, is able to use linear and loglinear regression models using R. He/she is able to use main methods of multivariate analysis.", "et": "Mooduli eesmärgiks on tutvustada põhilisi töövahendeid andmetes esinevate mustrite ja seaduspärade avastamisel, testimisel ja uurimisel. Mooduli läbinud doktorant tunneb statistilise mudeli mõistet, oskab kasutada tarkvara R lineaarsete ja logistiliste regressioonimudelite hindamisel ning oskab kasutada tuntumaid mitmemõõtmelise analüüsi meetodeid."}, {"en": "Modulus: Analysis of complex data structures - 2 ECTS", "et": "Keerukate andmestruktuuride analüüs (2 EAP)"}, {"en": "The aim of the modulus is to present more specific and advanced methods of statistical data analysis. Aim of the methods is to discover hidden data structures and to suggest realistic forecasting methods. Also an overview is given about the methodology of analysing specific data formats  (repeated measurements, longitudinal and spacial data).", "et": "Moodulis tutvustatakse keerukamaid erinevate valdkondade teadustöödes kasutatavaid kaasaegse statistilise andmeanalüüsi meetodeid, mille eesmärgiks on mitmemõõtmeliste andmestruktuuride uurimine, varjatud seosestruktuuride avastamine ja/või realistlike prognoosimudelite loomine. Samuti antakse ülevaade sellest, millise metoodika abil analüüsitakse erinevaid spetsiifilisi andmeformaate (kordusmõõtmised, kestusandmed, ruumiandmed, jne)."}], "learning_outcomes": [{"en": "After passing the basic modulus a student is able to carry out elementary data analysis using R. He/she has got knowledge for planning his/her own empirical research and is able to evaluate critically data analysis in research papers on his/her speciality.", "et": "Baasmooduli läbimise järel oskab doktorant läbi viia esmast andmeanalüüsi paketiga R. Ta oskab planeerida enda empiirilist uuringut ja läbi viia kogutud andmete esmast analüüsi. Oskab suhtuda kriitiliselt kirjanduses esinevate andmeanalüüsi meetodite kasutusse."}, {"en": "After passing the second modulus a student is able to use main methods of multivariate analysis when analysing data. He/she is able to make correct conclusions from the results of analysis.", "et": "Teise mooduli läbinud doktorant oskab rakendada mitmemõõtmelise analüüsi põhilisi meetodeid paketiga R ja teha saadud tulemustest korrektseid järeldusi."}, {"en": "After passing the third modulus a student has got an overview on specific advanced data analysis methods. He/she is able to carry out analysis of specific data (repeated measurements, longitudinal and spacial data).", "et": "Kolmanda mooduli läbinu on saanud ülevaate kaasaegse andmeanalüüsi spetsiifilistest meetoditest. Ta tunneb kordusmõõtmiste analüüsi ning ruumi- ja kestusuuringute andmete analüüsi meetodeid ja oskab läbi viia vastavaid analüüse."}], "notes": {"et": "The module gives an overview of some methods of complex statistical analysis. The students will learn to recognize the research questions where these methods are needed and to conduct an analysis using these methods in R. The contents of this module (selection of methods to be introduced) may vary from year to year."}}, "grading": {"independent_work": {"et": "Each student should prepare a data analysis project using one of the methods that is introduced in this module. The results should be presented in the last seminar. It is highly recommended that the student uses data from his/her own PhD work or another dataset from the field of research. More detailed requirements will be introduced during the practicals."}, "independent_work_assessments": [{"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "To successfully pass the course, the student needs to prepare a data analysis project, using at least one of the methods introduced in this module. It is highly recommended to use data from one's own research (in case this is not possible, some datasets will be provided). The projects will be presented during the last seminar."}}], "grade_preconditions": {"et": "Preparation of the data analysis project."}, "grade_evaluation": {"et": "Preparation of the data analysis project and its presentation during the last seminar."}, "debt_elimination": {"et": "In case of an illness or other serious reason, the project can be presented at a later date, upon a mutual agreement with the course instructors."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "404bbb3a-7c0d-59d2-d240-fedecc2b403d", "person_name": "Krista Fischer", "structural_unit": {"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "f695ee4d-cd1d-8901-203f-42b31210f8a6", "person_name": "Märt Möls", "structural_unit": {"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "is_responsible": false, "is_teaching": true}], "study_groups": [{"uuid": "eac34bb2-1ba8-1569-9c41-fc6c1318e75c", "code": "1. rühm (Eng)", "max_size": 22}, {"uuid": "c5e41a41-99cb-ef1b-c413-6df45b3b45d0", "code": "2. rühm (e-learning)", "max_size": 43}]}, "schedule": {"weeks": {"et": "12.-16."}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Analysis of survival data: concepts of censoring, survival and hazard functions, Kaplan-Meier method for data visualization and quantile estimation. Cox proportional hazards models and interpretation of the parameter estimates."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Survival analysis in R. Kaplan-Meier survival and cumulative hazard curves, graphical comparison of survival in two or more groups. Cox model estimation and ways to check validity of the assumptions. Presentation of results as hazard ratios and confidence intervals."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Multilevel models. Random effects and mixed effects models, their estimation and interpretation."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Multilevel models in R. Presentation of the results."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Analysis of repeated measures. Descriptive statistics and basic tools for tests and modeling."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Visualization and analysis of repeated measures data in R."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Time series analysis. Concept of autocorrelation and ways to estimate it. Common modeling tools for time series."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Time series analysis in R: data visualization, modeling and prediction."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Analysis of spatial data. Concept of spatial correlation and some modeling tools."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Spatial data analysis in R. Statistical simulation and its uses for study planning. Summary of the course."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Presentations of student projects."}}]}, "registration_info": {"audience": {}, "max_students": 65}, "parent_uuid": "d64dcacd-9067-9067-d980-3796bc75ca7f", "parent_code": "LTMS.00.025", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}