{"uuid": "d4a993d3-d2b4-f1fc-7f3f-0d69f779ab02", "code": "LTOM.01.011", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-10T15:13:38", "title": {"en": "Phycology", "et": "Algoloogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM01", "structural_unit_name": {"en": "Department of Botany", "et": "botaanika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM01", "name": {"en": "Department of Botany", "et": "botaanika osakond"}, "phone": "+372 737 6222", "address": "J. Liivi 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi 2", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is an eye-opener to understand the hidden, often enigmatic life of algae, their structure, function, and role in the ecosystem. The course starts with lectures, and proceeds intermingled with seminars. A mandatory part of the course is written seminar work, which also has to be presented as an oral talk (max 10 min). This trains writing and presentation skills, as well as giving feed-back to others presentations. The course material is made available electronically. The seminar work requires analysis of a few regular research papers, which can be chosen by the student, or will be given by the tutor.", "et": "Kursus õpetab nägema silmale sageli varjatud, kuid biosfääri toimimisel oluliste organismirühmade funktsiooni, ehitust ja elutegevust. Kursus koosneb loengutest ja seminaridest.\nKursuse kohustuslik osa on referatiivne seminaritöö ja selle ettekandmine, mille läbi arendatakse kirjalikku ja suulist eneseväljendus- ja esinemisoskust ning esineja tagasisidestamist läbi kiituse ja kriitika. Tudengite seminariettekanded toimuvad loenguaegadel, algavad 7-8 loengu ajal ja võtavad seejärel ca pool iga loengu ajast. \nPeamised õppematerjalid on lektori koostatud elektroonilised konspektid ja loenguslaidid. Seminaritöö sooritamine eeldab paari enda poolt valitud või etteantud teadusartikli läbitöötamist."}, "objectives": [{"en": "An overview about the evolutionary systematics of algae, their role in the biosphere and ecosystem. Environmental problems and health hazards caused by algae, as well as their biotechnological perspectives, food and energy production.", "et": "Ülevaade vetikate olemusest, evolutsioonilisest süstemaatikast, rollist Maa biosfääris ja ökosüsteemis. Erikäsitlus vetikate põhjustatud probleemidest ja biotehnoloogilistest võimalustest."}], "learning_outcomes": [{"en": "1. Understand the very nature of algae, what distincts them from other organism groups, and what are the common features", "et": "1. Sõnastab vetikate olemuse, erinevused ja ühisosa teiste organismirühmadega"}, {"en": "2. Name the main groups of algae, their structural, physiological and ecological features", "et": "2. Nimetab olulisemaid vetikate suur-rühmi, nende ehituslikke, füsioloogilisi ja ökoloogilisi eripärasid"}, {"en": "3. Describe the role of algae in global biogeochemistry and in the formation of biosphere", "et": "3. Kirjeldab vetikate rolli Maa biogeokeemias ja biosfääri kujundamisel"}, {"en": "4. Describe the functioning of algae as part of aquatic ecosystem", "et": "4. Kirjeldab vetikate toimimist veekogude ökosüsteemi osana"}, {"en": "5. List the fundamental differences between the functioning of aquatic and terrestrial ecosystems", "et": "5. Nimetab olulisemaid erinevusi veekogude ja maismaa ökosüsteemide toimimises"}, {"en": "6. Evaluates the health and environmental risks caused by algae", "et": "6. Oskab hinnata vetikatega seotud terviseriske ja keskonnaprobleeme"}, {"en": "7. Describe the potential of algae in biotechnology, energy and food production", "et": "7. Nimetab vetikate eeliseid biotehnoloogia, energia- ja toiduainete tootmise valdkondades"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}