{"uuid": "b5533086-6aea-cee1-fc3e-855840c3806e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T16:05:24", "title": {"en": "Ecosystem and Soil", "et": "Ökosüsteem ja muld"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Soil is made up of a multitude of physical, chemical, and biological entities, with many interactions occurring among them. Soils are not distinctive bodies, but they form soil sequences (catenas) on landscapes. Every research goal in ecosystem approach had different demands for research scaling. In soil ecosystem this scaling levels are  aggregate, horizon, pedon or polypedon. Soil physical and chemical properties had not influential, but often decisive factor for belowground processes. Soil is remarkable biological heritage. Organic matter turnover in soils (input and output fluxes). Food webs in soils and their characterization. Rhizosphere and processes.  The soil food web is an integral part of landscape processes. Soil organisms decompose plant residues, and pesticides, preventing them from entering water and becoming pollutants. They sequester nitrogen and other nutrients that might otherwise enter groundwater, and they fix nitrogen from the atmosphere, making it available to plants. The relation between functional diversity of soil organisms and elemental cycles linking to the soil properties. Soil protection needs and strategies for local, regional and global level. Pollutants loads and critical levels for soils. Remediation of polluted soils. Global changes and their influence on soil and belowground processes.", "et": "Maastikul paiknevad sarnased mullad kõrvuti, moodustades maastikul mullastiku. Optimaalsed mõõtmed maastiku või mulla kui ökosüsteemi uuringuteks sõltuvad uurimisvaldkonnast. Maastikul on selleks maastikuprofiil, või muldade pidevrida (kateena). Mullaelustiku uuringuteks mullahorisont või mullatüsend kuni lähtekivimini. Mulla kui elukeskkonna põhiomadused sõltuvad peamiselt veerežiimist, mulla reaktsioonist (pH) ja redoksrežiimist. Neelamisnähtused ja mulla neelamismahutavus.\nMuld kui bioloogilise mitmekesisuse varamu. Mulla orgaanilise aine varud ja käive erinevates mullatüüpides: sisend- ja väljundvood. Toiduahelad mullas. Orgaanilise aine laguahelad ja seal osalevad organismid. Rhisosfäär kui elustiku \"mikrokosmos\". Erinevate taimeliikide mõju mulla orgaanilise aine käibele. Mullaelustiku uurimistasandid ja rakendatavad meetodid. Muldade mitmekesisus ja elurikkus. Süsiniku- lämmastikuringet reguleerivad mikroorganismid ja nende aktiivsused erinevates keskkonnaoludes ja mullatüüpides.\nMulla kui elusfääri kaitse. Euroopa Liidu (Soil Strategy) põhiteemad. Muldade saastekoormused. Saastunud muldade tervendamine. Globaalsete muutuste mõju mullastikule."}, "objectives": [{"en": "The course is designed to facilitate critical discussion and analysis of various soil processes, on different scales (micro-biotope, site, landscape) considering soil physical, chemical and biological properties. We improve skills helping evaluate integrated view of the living component of soils and its key role on ecosystem functions and processes. We formed generalized understanding about the interplay among microorganisms, fauna, and plants, the biogeochemical processes, what they carry out in soil. The role of physical and chemical environment will be explained in which their activities take place, and applying this knowledge to address environmental problems and how to mitigate harmful loads.", "et": "Oskus hinnata mulda kui elukeskkonda kompleksselt ja erinevates mastaapides (elupaik, kasvukohatüüp, maastik), arvestades nii mulla füüsikalisi, keemilisi ja bioloogilisi omadusi. Antakse oskused, mis aitavad hinnata muldade füüsikaliste ja keemiliste omaduste ning elusfääride vahelisi seoseid. Kujundatakse tervikpilt keskkonna omaduste ja bioloogiliste protsesside vahel mullas. Sellega luuakse eeldused muldade kui ka üldise keskkonnaseisundi objektiivseks hindamiseks."}], "learning_outcomes": [{"en": "At the end of this course students should be able to describe and explain:\n1) the nature of soil health for various soil types; 2) the extent and importance of soil biodiversity; 3) the influences of belowground processes on soil functions; 4) how biological activity influences soil nutrient availability and losses; 5) know the role of the soil food web in the formation, degradation, and maintenance of organic matter; 6) how to use microorganisms to remediate/rehabilitate highly disturbed or contaminated soil; 7) the potential effects of global environmental changes on soils on local, regional or continental (Europe) level.\nStudents will be able access, understand and introduced appropriate methods for assessing soil sub-system processes (soil science, ecology, biology, microbiology), as they relate and are able to apply knowledge to their own study demands (identifying research questions, challenges and obstacles).", "et": "Luuakse erinevate muldade tervise ja suhtelise bioloogilise väärtuse hindamisvõimekus lähtuvalt kasutuseesmärgist ja majandusviisist. Osatakse valida ja hinnata analüütilisi tunnuseid, sobilike ning otstarbekaid uurimismeetodeid mullapõhiste ökosüsteemide seisundite hindamiseks. Tekib pädevus mullakaitse ja ökosüsteemide maa-aluse osa peateemadest ja valupunktidest lokaalsel, regionaalsel, kontinendi (Euroopa) ja globaalsel tasemel."}], "notes": {}}, "grading": {"independent_work": {"et": "Magistrant teeb ettekande (10-15 min) oma kavandatava magistritööga seonduval teemal, mis haakub kursusel käsitletavate mullateemadega. Võimalik on ka õppejõu poolt pakutav teema."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {}}], "grade_preconditions": {"et": "Seminariettekanne (20% lõplikust hindest)"}, "grade_evaluation": {"et": "Ettekanne (20% lõplikust hindest)\nEksam (80%)"}, "debt_elimination": {"et": "kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "9987b550-742f-4ab3-9356-5abc9fdf36dd", "type": "MOODLE", "code": "LTOM.02.021", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Astover, A., Kõlli, R., Roostalu, H., Reintam, E., Leedu, E. Mullateadus. Õpik kõrgkoolidele. Eesti Loodusfoto OÜ. 2012. 486 lk.\nKanal, A. Pedosfäär. lk 382-418. Üldmaateadus. Õpik kõrgkoolidele. (koost Ü.Mander, Ü. Liiber). 2014.\nLõhmus, E. 2004. Eesti metsakasvukohatüübid. Teine, täiendatud trükk. Loodusfoto. Tartu. 80 lk.", "recommended_materials": "Paal., J. 1997. Eesti taimkatte kasvukohatüüpide klassifikatsioon. Eesti Looduse mitmekesisus. 297 lk.\nPalo, A. 2016. Eesti metsad. Varrak.  223 lk."}, "participants": {"lecturers": [{"person_uuid": "f30a5c1a-f4a7-d7bc-d840-0d2b4ee6fedb", "person_name": "Ivika Ostonen-Märtin", "structural_unit": {"code": "LTOM02LM", "name": {"en": "Chair of Physical Geography and Landscape Ecology", "et": "loodusgeograafia ja maastikuökoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-40.n."}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus. Ökosüsteemi ja mulla uurimise tasandid. Ökosüsteemide ja muldade leviku seaduspärasused. Mulla ruumiline ja tasapinnaline ulatus. Muldkate. Mullakaart. Mullaseire."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Taimestiku ja mullastiku seotus.Ühetaolisi muldi iseloomustab sarnane looduslik taimkate, mis metsavööndis tähendab mullatüübi põhist kasvukohatüüpi. E. Lõhmuse kasvukohatüüpide mudeli tutvustus."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Muld kui füüsikalise ja keemilise elukeskonna kujundaja. Muld kui ökosüsteem."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Mulla reziimid ja seosed ökosüsteemide aineringe ja arenguga. Vee-, õhu- ja toitereziim.Mulla põhilised makroelemendid nende varud, jaotumine ja ringlus. Makroelementide empiirilised omavahelised optimaalsed suhted. Mikroelemendid. Raskmetallid kui biotoksilised mulla komponendid"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Mullaelustik, orgaaniline aine mullas. Troofilised tasemed mullaökosüsteemis."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Mullaelustik. Mikro-, meso ja makrofauna. Elustiku mitmekesisus mullas ja selle roll mulla kui elukeskkonna jätkusuutlikkuses."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Aineringe modelleerimine mullas, seosed ökosüsteemide säilimise ja jätkusuutliku majandamisega.Kvalitatiivsed ja kvantitatiivsed metoodikad ja protokollid mullaelustiku mõõtmiseks erinevatel organisatoorsetel tasemetel."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Keskkonnamuutuste mõju mullaökosüsteemile. Maa- ja mullakasutus. Kliimamuutused."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Keskkonnamuutuste mõju mullaökosüsteemile. Maa- ja mullakasutus. Kliimamuutused."}, "description": {}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Seminariettekanded ja arutelu."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "d7c72019-f7c2-dcd7-37f7-10ccbeefe516", "parent_code": "LTOM.02.021", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}