{"uuid": "9b5ee338-99ea-164b-ddc6-5953d46e58c7", "code": "LTOM.03.034", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Unmanned Vehicles in Earth Sciences", "et": "Mehitamata sõidukite kasutamine maateadustes"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "...", "et": "..."}, "objectives": [{"en": "The participant gets an overview of the use of unmanned vehicles in earth sciences. The most common platforms and sensors that are used on these vehicles for earth science research are introduced. The course also includes an explanation of legislative restrictions on the handling of unmanned vehicles, research planning, and an introduction to the software and methodology used for the primary analysis of the collected data. The course participant is able to independently plan the use of unmanned vehicles to solve various earth science problems.", "et": "Kursuse läbija saab ülevaate mehitamata sõidukite kasutamisest maateadustes. Tutvustatakse enamlevinud platvorme ning sensoreid, mida neil sõidukitel kasutatakse maateaduslike uuringute tegemiseks. Kursuse osaks on ka seadusandlike piirangute selgitamine mehitamata sõidukite käitlemisel, uuringute planeerimine ning kogutud andmete esmase analüüsi jaoks kasutatava tarkvara ja metoodika tutvustus. Kursuse läbija on võimeline iseseisvalt planeerima mehitamata sõidukite kasutamist erinevate maateaduslike probleemide lahendamiseks."}], "learning_outcomes": [{"en": "The graduate of the program is familiar with unmanned aerial vehicles, the regulations governing their use. We familiarize ourselves with most common sensors such as various cameras, laser scanner (lidar) and geophysical instruments. During the course, the practical use of unmanned aerial vehicles in earth sciences and related fields is covered. Entire workflow from flight planning to primary data analysis will be covered. Graduates of the continuing education program can plan the use of drones and their related sensors in various areas and tasks.", "et": "Täiendõppeprogrammi läbija on kursis mehitamata õhusõidukite ja nendne kasutamist reguleerivate regulatsioonide. Tutvutakse enamlevinud sensoritega nagu erinevad kaamerad, laserskänner e lidar ja geofüüsikalised mõõteriistad. Kursuse jooksul käsitletakse mehitamat õhusõidukite praktilist kasutamist loodusteadustes ning lähedastest valdkondades. Selleks tutvustatakse kogu töövoogu alates lennuplaneerimisest kuni esmase andmeanalüüsini. Täiendõppeprogrammi läbija oskab planeerida droonide ning nendega seotud sensorite kasutamist erinevates valdkondades ning mitmesuguste ülesannete täitmisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}