{"uuid": "ca2d4683-0f1f-0dd4-32cf-b0044646b23a", "code": "LTOM.05.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T09:57:21", "title": {"en": "Master's Thesis Seminars in Science Education", "et": "Magistritöö seminarid loodusteaduslikus hariduses"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 4, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Seminars give students an opportunity to analyse and reflect different research stages of their master thesis in science education: planning and carrying out studies, analysing data, making conclusions, and oral and written presentation of results.", "et": "Seminarid võimaldavad üliõpilastel analüüsida ja reflekteerida magistritöö planeerimist, uuringute läbiviimist, tulemuste analüüsi ja järelduste tegemist ning nende suulist ja kirjalikku esitamist loodusteadusliku hariduse magistritöös."}, "objectives": [{"en": "The main goal of seminars is to acquire knowledge and skills for planning research, carrying out studies, analysing results, making conclusions and executing results linked to the composing master thesis in the field of science education.", "et": "Saada teadmised ja oskused loodusteadusliku hariduse magistritöö planeerimiseks, uuringute läbiviimiseks, tulemuste analüüsiks ja järelduste tegemiseks ning vormistamiseks."}], "learning_outcomes": [{"en": "A graduate student:", "et": "Õppeaine läbinu:"}, {"en": "1. Applies his/her knowledge and skills in formulating scientific problems, planning and carrying out studies, making conclusions based on the results of master thesis, and presents these in an oral or written form in the field of science education", "et": "1. Oskab rakendada omandatud teadmisi ja oskusi probleemide sõnastamisel, uuringute planeerimisel ja läbiviimisel, kogutud andmete põhjal järelduste tegemisel ning nende kirjalikul ja suulisel esitamisel loodusteadusliku hariduse magistritöös"}, {"en": "2. Can find and analyze scientific information and synthesizes new scientific knowledge in science education based on this information and collected experimental data in master thesis.", "et": "2. Oskab leida ja analüüsida teaduslikku infot ning suudab sellest ja enda poolt kogutud eksperimentaalsetest andmetest sünteesida uusi erialaseid teadmisi loodusteaduslikus hariduse magistritöös."}, {"en": "3. Holds a general overview of quantitative and qualitative research methods and their specific features in science education and applies them in composing master thesis.", "et": "3. Omab üldülevaadet kvalitatiivse ja kvantitatiivse uurimistöö meetoditest ja nende eripärast loodusteaduslikus hariduses ning oskab neid rakendada magistritöö koostamisel."}, {"en": "4. Is familiar with main principles of scientific ethics and can evaluate research level in science education", "et": "4. Tunneb teaduseetika üldprintsiipe ning oskab hinnata uuringute teaduslikku taset ja rakenduslikku väärtust loodusteaduslikus hariduses "}, {"en": "5. Is scientifically prepared for continuing his/her studies at doctoral level.", "et": "5. Omab teaduslikku ettevalmistust õpingute jätkamiseks doktoriõppes."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}