{"uuid": "a3220ec2-b9c0-f717-29f9-9324d9de8c89", "code": "LTOM.02.047", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Material Cycles and Energy Flows", "et": "Aineringed ja energiavood"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces various approaches and methods used in landscape and climate change studies. The students practice the use of complex study and data analysis methods in physical geography.", "et": "Kursusel käsitletakse erinevateid lähenemisi ja meetodeid maastiku-uuringutes ning kliimamuutuse avaldumise ja selle loodusgeograafiliste mõjutuste analüüsil. Õpitakse loodusgeograafiliste kompleksuuringute ja kogutud andmestiku analüüsimise meetodeid praktilise tegevuse kaudu."}, "objectives": [{"en": "The aim of the course is introduce the mutual relations of various environmental elements and processes of landscape ecology, to give an overview of the contemporary problems an methods in physical geography and landscape ecology as well as skills to solve them.", "et": "Aine eesmärk on tutvustada erinevate keskkonnategurite vastastikust koosmõju ja maastikuökoloogilisi protsesse, anda ülevaade tänapäeva loodusgeograafia ja maastikuökoloogia peamistest probleemidest ja meetoditest ning oskused nende lahendamiseks."}], "learning_outcomes": [{"en": "The student will", "et": "Aine läbinud üliõpilane:"}, {"en": "1)\tunderstand the development patterns of natural features and their mutual relations;", "et": "1)\tsaab aru looduslike komponentide kujunemise seaduspärasustest ja nendevahelistest koostoimest;"}, {"en": "2)\tknow the terminology of physical geography and landscape ecology and is able explain the principles of the functions of main natural complexes;", "et": "2)\tvaldab loodusgeograafia ja maastikuökoloogia terminoloogiat ja suudab lahti seletada peamiste looduslike komplekside toimimise põhimõtteid;"}, {"en": "3)\tknow the main flows of matter in natural landscapes on local, regional, and global scale;", "et": "3)\ttunneb peamisi ainevoogusid loodusmaastikus lokaalsel, regionaalsel ja globaalsel skaalal;"}, {"en": "4)\tknow the development of contemporary landscapes and is able to characterize regional units of landscape;", "et": "4)\ttunneb tänapäevaste maastike kujunemist ja arengutegureid ning oskab iseloomustatakse suuremaid regionaalseid maastikuüksusi;"}, {"en": "5)\tknow the causes and effects of global environmental changes;", "et": "5)\tteab globaalsete keskkonnamuutuste peamisi põhjuseid ja tagajärgi;"}, {"en": "6)\tbe acquainted with the main datasets of physical geography and be able to analyse these;", "et": "6)\ttunneb peamisi loodusgeograafilisi  andmestikke ja oskab neid analüüsida;"}, {"en": "7)\tknow the main methods of analysis in physical geography;", "et": "7)\tteab peamisi statistilisi andmeanalüüsi meetodeid loodusgeograafias;"}, {"en": "8)\tknow the evaluation methods of landscape structures and the methods of data analysis in this field.", "et": "8)\tteab maastiku struktuuri hindamise meetodeid ja selles valdkonnas kasutatavaid andmeanalüüsi meetodeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}