{"uuid": "fbcdf373-d776-5467-c4e8-97a484b2549e", "code": "lt-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-27T14:20:47", "title": {"en": "Spatial Data on the Web", "et": "Ruumiandmed veebis"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "25/26 S regular LT Eng", "et": "25/26 K PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 6, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course covers foundational concepts of geodata on the web, exploring spatial data portals, standards, and services. Students learn to work with web services in desktop GIS environments, and focus on practical implementation of OGC standards. \nWhile prior programming experience is not mandatory it is highly preferred. Students without any prior coding experience will have to be ready to put extra work into the assignments and already should engage in Python/programming basics before the start of the course (please inquire ahead of time alexander.kmoch@ut.ee ). Ideally, this course is taken together with LTOM.02.041.\n\nThe course will cover geospatial metadata management, including catalogue services and metadata creation based on international standards.\nBuilding on database fundamentals, students explore GeoServer for spatial data publication, using WMS functionality and map styling using SLD styling. The course will cover data modeling concepts including GML and UML, with particular emphasis on INSPIRE compliance and XML schemas. Practical sessions reinforce these concepts through hands-on implementation of a WFS service with a custom GML schema.\n\nStudents learn about the foundational web technologies (HTML, CSS, JavaScript). Through practical sessions, students learn to integrate various data delivery methods including WMS, GeoJSON, REST APIs, and vector tiles (MVT). The course will explore of cloud-native geospatial concepts, including STAC (SpatioTemporal Asset Catalogs), modern data search and access patterns, and exploring a server-side WebGIS implementation through pygeoapi.\n\nA significant component of the course is dedicated to the web mapping project where students apply their knowledge in developing a comprehensive web-based geospatial application. Throughout the course, emphasis is placed on understanding the evolution from traditional SDIs to modern cloud-native approaches, preparing students for both current and emerging geospatial web technologies.", "et": "Antakse ülevaade peamistest kontseptsioonidest ruumiandmete veebis esitamiseks, hõlmates nii ruumiandmete geoportaale, standardeid ja veebiteenuseid. Õpitakse kasutama veebiteenuseid töölaua GIS-keskkondades ja keskendutakse OGC standardite praktilisele rakendamisele.\nVarasem programmeerimiskogemus ei ole kohustuslik, kuid on soovitatav. Ilma eelneva koodikirjutamise kogemuseta tudengid peavad olema valmis pühendama märkimisväärselt lisatööd ülesannete täitmiseks ning soovitatavalt tutvuma Pythoni/programmeerimise põhialustega enne kursuse algust (lisainfo: alexander.kmoch@ut.ee). Ideaalis tuleks see kursus läbida koos kursusega LTOM.02.041.\nKursus annab oskuse ruumiandmete metaandmete haldamiseks, hõlmates kataloogiteenuseid ja metaandmete loomist rahvusvaheliste standardite alusel. Õpitakse kasutama GeoServerit ruumiandmete veebis avaldamiseks, kasutades WMS-funktsionaalsust ja kaartide kujundamist SLD-stiilide abil. Lisaks õpitakse andmemodelleerimise kontseptsioone, sealhulgas GML-i ja UML-i, rõhutades INSPIRE-ühilduvust ja XML-skeeme. Praktikumides õpitakse kontseptsioone rakendada rakendada WFS-teenust koos kohandatud GML-skeemiga.\nÕpitakse veebitehnoloogiate (HTML, CSS, JavaScript) aluseid, et seda hiljem kasutada andmete esitamiseks veebis. Praktiliste sessioonide käigus WMS, GeoJSON, REST API-d. Kursus lõpeb pilvepõhiste ruumiandmete kontseptsioonide tundma õppimisega: STAC (SpatioTemporal Asset Catalogs), kaasaegsete andmete otsingu- ja juurdepääsuvõimalustega ning serveripoolse WebGIS-i rakendamisega pygeoapi abil.\nOluline osa kursusest on veebikaardi loomise projekt, kus tudengid rakendavad oma kursuses omandatud teadmisi tervikliku veebipõhise ruumiandmete rakenduse arendamisel. Kursuse vältel pannakse rõhku arusaamisele traditsioonilistest ruumiandmete infrastruktuurist üleminekule kaasaegsete pilvepõhiste lähenemisteni, valmistades tudengeid ette nii olemasolevate kui uute ruumiandmete veebitehnoloogiate kasutamiseks"}, "objectives": [{"en": "To provide a comprehensive introduction into modern web-based geospatial technologies, spanning traditional spatial data infrastructures (SDI) to contemporary web mapping and cloud-native geospatial solutions. ", "et": "Anda põhjalik sissejuhatus kaasaegsetesse tehnoloogiatesse ruumiandmete hoidmiseks, esitamiseks ja leidmiseks veebis.  Tehnoloogiad hõlmavad traditsioonilisi ruumiandmete infrastruktuure (SDI, Spatial Data Infrastructure) kuni tänapäevaste veebikaardistamise ja pilvepõhiste ruumiandmete lahendusteni. "}, {"en": "To develop theoretical understanding and practical implementation skills in web-based spatial data management, standardization, access, sharing, visualization, and processing,", "et": "Arendada teoreetilist arusaama ja praktilisi oskusi veebipõhises ruumiandmete halduses, standardiseerimises, juurdepääsus, jagamises, visualiseerimises ja töötlemises."}, {"en": "To provide an overview of the evolution from conventional SDIs to the modern geospatial ecosystem.", "et": "Anda ülevaade üleminekust traditsioonilistest ruumiandmete infrastruktuurist kaasaegsesse ruumiandmete ökosüsteemi."}], "learning_outcomes": [{"en": "*\tDemonstrate handling of web-based geospatial concepts and technologies. They will understand and implement OGC web services and standards and cloud-native geospatial technologies for mapping, visualising, discovering and sharing spatial datasets.", "et": "*\tDemonstreerib veebipõhiste ruumiandmete kontseptsioonide ja tehnoloogiate käsitlemise oskusi. Nad mõistavad ja rakendavad OGC (Open Geospatial Consortium)  veebiteenuseid ja standardeid ning pilvepõhiseid ruumiandmete tehnoloogiaid kaardistamiseks, visualiseerimiseks, andmekogumite avastamiseks ja jagamiseks."}, {"en": "*\tHave proficiency in spatial metadata management", "et": "*\tOskab ruumiandmete metaandmeid hallata"}, {"en": "*\tTo know which technologies and services to use for which use cases e.g. visualising spatial data on the web vs analysing feature data.", "et": "*\tTeab, milliseid tehnoloogiaid ja teenuseid kasutada erinevate juhtumite puhul nt ruumiandmete kuvamine veebis vs vektorandmete analüüs veebis "}, {"en": "*\tHave practical skills in both consuming and providing geospatial web services and develop a web mapping application, while understanding the theoretical frameworks that underpin these technologies.", "et": "*\tOmab praktilisi oskusi nii ruumiandmete veebiteenuste tarbimisel kui ka pakkumisel ning oskab luua veebipõhiseid kaardirakendusi, mõistes samal ajal nende tehnoloogiate aluseks olevaid teoreetilisi raamistikke."}], "notes": {}}, "grading": {"independent_work": {"et": "in Moodle"}, "grade_preconditions": {"et": "successful completion of all the lab sessions and final test"}, "grade_evaluation": {"et": "successful completion of all the lab sessions and final test"}, "debt_elimination": {"et": "needs to be agreed with the tutors"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "851f4f98-e6ce-5ed8-ce9f-9b4e82363a83", "person_name": "Valentina Sagris", "structural_unit": {"code": "LTOM02GK", "name": {"en": "Chair of Geoinformatics and Cartography", "et": "geoinformaatika ja kartograafia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "65e07dbe-ccf1-886b-3a5a-05840c95d2fc", "person_name": "Alexander Kmoch", "structural_unit": {"code": "LTOM02GK", "name": {"en": "Chair of Geoinformatics and Cartography", "et": "geoinformaatika ja kartograafia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "bf20c02c-cf35-7871-ae23-700d02dc7b73", "person_name": "Ats Remmelg", "structural_unit": {"code": "LTOM02GK", "name": {"en": "Chair of Geoinformatics and Cartography", "et": "geoinformaatika ja kartograafia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "26.-38.n."}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction into Spatial Data Infrastuctures,  OGC web services and geoportals\n-Alexander Kmoch"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Catalogue services, CSW\n-Alexander Kmoch"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction to WMS/WFS/WCS web services, their use under QGIS\n-Alexander Kmoch"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "XML based Geographical Markup Language, GML \nGML is essential geographical data encoding tool, which is behind of Web Feature Services. Hands-on practice will make student familiar with XML/GML world. \n-Valentina Sagris"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "UML data modeling, INSPIRE data specifications\nUnified modeling language, UML is foundation for geoinfo data domain modeling and INSPIRE Directive thematic clusters\n-Valentina Sagris"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Setting WFS with customer GML schema, geegree software\ndeegree software implements user-defined GML schema and publishes it as the Web Feature Service. \n-Valentina Sagris"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Geoserver/SOS/OGC API\n-Alexander Kmoch"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Styling in web services, Geoserver/degree software\nDifferent OGC standards for styling geodata and how to work with them.\n-Alexander Kmoch/Valentina Sagris"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "617a04dd-6645-20a1-e396-d3c8cf21892c", "parent_code": "LTOM.02.071", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}