{"uuid": "c1b99398-9a0c-6030-3cb1-7721a25ec757", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-17T09:35:09", "title": {"en": "Practical Training in Entrepreneurship in Environmental Governance", "et": "Ettevõttepraktika keskkonnajuhtimises"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 156}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "During the internship, job opportunities in the field of geology and / or environmental technology are introduced in the laboratory of a research group, company, state agency or other non-university work environment under the guidance of specialists. The student gets acquainted with the daily work and activities of the chosen organization and acquires practical skills in solving tasks based on real problems. An internship report is prepared about what has been experienced and learned during the internship, and a thorough self-analysis of the gained experience is performed, which enables the student to make sense of the professional experience gained. The supervisor from the internship base gives the university supervisor feedback on the coping and development of the internship. At the end of the course, the student gives a public presentation introducing the internship experience. If necessary, the organization of the internship is regulated by bilateral or tripartite agreements, which are concluded between the student, the university and the representative of the internship base before the internship takes place. The internship course is supervised by the university and the internship base supervisor.", "et": "Praktika käigust tutvutakse geoloogia ja/või keskkonnatehnoloogia valdkonna töövõimalustega mõne uurimisrühma laboris, ettevõttes, riigiaasutuses või muus ülikoolivälises töökeskkonnas erialaspetsialistide juhendamisel. Tudeng tutvub valitud organisatsiooni igapäevase töö ja tegevustega ning omandab praktilised oskused reaalsetel probleemidel põhinevate ülesannete lahendamisel. Praktikal kogetu ja õpitu kohta koostatakse praktikaaruanne ning teostatakse põhjalik eneseanalüüs saadud kogemuste kohta, mis võimaldab tudengil mõtestada saadud erialast kogemust. Praktikabaasipoolne juhendaja annab ülikoolipoolsele juhendajale tagasidet praktikani toimetulekust ja arengust. Kursuse lõpus teeb tudeng praktikakogemust tutvustava avaliku ettekande. Praktikakorraldust reguleeritakse vajadusel kahe- või kolmepoolsete lepingutega, mis sõlmitakse enne praktika toimumist tudengi, ülikooli ning praktikabaasi esindaja vahel. Praktikakursust juhendavad ülikoolipoolne ja praktikabaasipoolne juhendaja."}, "objectives": [{"en": "The aim is to give the student practical work experience in environmental governance-related research or work groups or in a company outside the university. The aim is to provide the student with the skills to act as a specialist in their field. The subject provides an opportunity to decipher professional skills in order to find the highest quality solution for a given specific task.", "et": "Eesmärgiks on anda üliõpilasele praktiline töökogemus keskkonnajuhtimise valdkonnas uurimis- või töögrupis või ettevõttes väljaspool ülikooli. Eesmärk on anda üliõpilasele oskused tegutseda omal erialal spetsialisti ametikohal. Aine annab võimaluse lahti mõtestada erialaoskused kvaliteetseima lahenduse leidmiseks, etteantud erialspetsiifilistel ülesannetel."}], "learning_outcomes": [{"en": "A student who has passed the course:", "et": "Kuruse läbinud üliõpilane:"}, {"en": "1) has an idea and is able to give an overview of the daily work and activities of a research group, enterprise, or state agency in his or her field;", "et": "1) omab ettekujutust ja oskab anda ülevaate oma valdkonna uurimisrühma, ettevõtte või riigiasutuse igapäevatööst ja -tegevustest;"}, {"en": "2) is able to point out what he or she has learned during the internship;", "et": "2) oskab välja tuua, mida ta on praktika jooksul õppinud;"}, {"en": "3) acquires the necessary experience of communication and public speaking and obtains initial contacts with representatives of his or her field at universities, agencies, and companies.", "et": "3) omandab vajaliku suhtlus- ja avaliku esinemise kogemuse ning saab esmased kontaktid oma valdkonna esindajatega ülikoolides, asutustes ning ettevõtetes."}, {"en": "4) has work experience in the field and is able to analyze and interpret it", "et": "4) omab töökogemust erialal ja oskab seda analüüsida ja mõtestada"}, {"en": "5) conduct a self-analysis and prepare a practice report", "et": "5) viib läbi eneseanalüüsi ning koostab praktikaaruande"}, {"en": "6) develops public speaking skills when presenting an internship report to others", "et": "6) arendab avaliku esinemise oskuseid praktikaaruande presenteerimisel kursusekaaslastele"}], "notes": {}}, "grading": {"independent_work": {}, "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "39c79343-4470-2f50-206e-01fdaa20888c", "person_name": "Margit Kõiv-Vainik", "structural_unit": {"code": "LTOM02LM", "name": {"en": "Chair of Physical Geography and Landscape Ecology", "et": "loodusgeograafia ja maastikuökoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}}, "parent_uuid": "10476dab-a93f-ed9b-55ba-691c443dfe5d", "parent_code": "LTOM.03.028", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}