{"uuid": "c7f82452-39e9-b448-a45f-425745d61605", "code": "LTOM.01.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Global Change, Nature and People", "et": "Globaalmuutused, looduskeskkond ja inimene"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM01", "structural_unit_name": {"en": "Department of Botany", "et": "botaanika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM01", "name": {"en": "Department of Botany", "et": "botaanika osakond"}, "phone": "+372 737 6222", "address": "J. Liivi 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi 2", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Course gives overview of global change and its impact on nature and human societies. Course focuses on climate change and biodiversity loss, tackling their direct drivers such as emissions, land-use change, invasive species, pollution, resource use, but also indirect drivers such as economic, demographic, cultural, technological and political conditions. Students who have passed the course understand the complexity of global change, recognize the drivers of global change and their interrelated complexities, and are able to understand and advocate means and practices needed to halt and mitigate negative impacts of global change. They also understand the impacts of climate and biodiversity crises in our surrounding environment and know how to take them into account in their future activities.", "et": "Aine raames käsitletakse põhjalikult kliimamuutuste, maakasutuse muutuste, invasiivsete liikide leviku, saastekoormuse ning ülemäärase ressursikasutuse mõju looduskeskkonnale ning seeläbi ka inimühiskondadele. Aine läbinud üliõpilased orienteeruvad globaalmuutuste valdkonnas, on teadlikud globaalmuutuste põhjustest ning globaalmuutuste leevendamiseks ja nendega kohanemiseks vajalikest tegevustest ja praktikatest, tunnevad ära globaalmuutustest tulenevaid tagajärgi looduskeskkonnale ja inimühiskondadele ning oskavad neid oma edaspidises elus arvesse võtta."}, "objectives": [{"en": "The course aims to build an up-to-date and in-depth understanding of the causes and impacts of global change, including climate and biodiversity crisis. The course gives an overview of complex relationships between nature and people, tackles the drivers and outcomes of climate change and biodiversity loss and focuses on their interrelated impacts on biological systems, social systems and vital ecosystem services.", "et": "Aine eesmärgiks on anda värskeim ülevaade globaalmuutustest, sealhulgas kliima- ja elurikkuse kao kriisist. Aine keskendub suureskaalaliste keskkonnamuutuste, looduskeskkonna ja inimeste omavahelistele seostele. Oluline fookus on globaalmuutuste mõjul looduskeskkonna ja ökosüsteemide toimimisele ning nende poolt pakutavatele ökosüsteemiteenustele. Kursuse käigus arendatakse üldpädevustest teadusliku informatsiooni otsimist ja teksti kirjutamist, kriitilist mõtlemist, meeskonnatöö oskuseid, probleemilahenduse oskust ning eestikeelset väljendusoskust."}], "learning_outcomes": [{"en": "After completing the course, student:\n1) knows the drivers and underlying causes of global change;\n2) knows the key Earth system indicators;\n3) understands the impact of climate and biodiversity crisis on natural systems, ecosystem services and on human societies in general;\n4) knows the actions and means that help to tackle and mitigate the threats related to climate change and biodiversity loss.", "et": "Kursuse läbinud üliõpilane:\n1) teab globaalmuutuste olemust ning seda põhjustavaid tegureid;\n2) teab Maa süsteemide seisundi võtmeindikaatoreid;\n3) oskab hinnata kliimakriisi ja elurikkuse kao mõju looduskeskkonnale, ökosüsteemiteenustele ning inimühiskondadele;\n4) tunneb globaalmuutuste leevendamiseks vajalikke rahvusvahelisi leppeid ning orienteerub erinevates tegutsemisvõimalustes.\n5) oskab teaduslikku infot otsida, kirjutada akadeemilist teksti\n6) oskab kriitiliselt mõelda, lahendada probleemülesandeid\n7) oskab meeskonnas töötada ja suuliselt end väljendada."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}