{"uuid": "02dc0271-f8ad-20eb-a592-4915ebdfa947", "code": "LTOM.00.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Training in Environmental Monitoring and Sampling", "et": "Keskkonnaseiremeetodid praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The aim of the course is to give a general overview of the principles and methods of monitoring the environment. The following will be addressed: environmental monitoring objectives, methods, parameters; measuring instruments; basic contact monitoring, and remote sensing technologies. The graduate has practical experience in the use of basic monitoring methods and has become acquainted with different types of monitoring through various presentations and demonstrations. The course provides an opportunity to practice real work techniques as an environmental specialist or analyst. The internship takes place partly in cooperation with professional organizations outside the university.", "et": "Kursuse eesmärk on anda üldine ülevaade maa-, õhu- ja veekeskkonna seisundi seire põhimõtetest ja meetoditest. Käsitlemist leiavad: keskkonnaseire eesmärgid, meetodid, parameetrid; mõõtmisvahendid; kontakt- ja kaugseire põhitehnoloogiad. Kursuse läbinu omab praktilist kogemust põhiliste seiremeetodite kasutamise kohta ning on tutvunud erinevate seire liikidega läbi erinevate tutvustuste ja demonstratsioonide. Kursus annab võimaluse praktiseerida reaalseid töövõtteid keskkonnaspetsialisti või -analüüsijana. Praktika toimub osaliselt koostöös erialaorganisatsioonidega väljaspool ülikooli."}, "objectives": [{"en": "The aim of the course is to give the student experience of project-based practice in using the basic methods of environmental monitoring, to introduce the basic concepts related to the field, to practice the basic techniques of an environmental monitoring specialist, and to provide practical sampling and environmental monitoring experience.", "et": "Kursuse eesmärk on anda üliõpilasele projektipõhise praktika kogemus keskkonnaseire põhimeetodite kasutamisel, tutvustada erialaga seonduvaid põhimõisteid, võimaldada praktiseerida keskkonnaseire spetsialisti põhilisi töövõtteid ning anda praktiline proovivõtu ja keskkonnaseire kogemus."}], "learning_outcomes": [{"en": "A student who has completed the course: ", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- knows the main objectives of environmental monitoring and national monitoring obligations and requirements arising from European Union legislation", "et": "- teab põhilisi keskkonnaseire eesmärke ja Euroopa Liidu õigusaktidest tulenevaid riiklikke seirekohustusi ning nõudeid"}, {"en": "- knows what environmental monitoring is and knows the basic methods of environmental monitoring in atmospheric, hydrosphere, lithosphere, and biosphere monitoring", "et": "- teab, mis on keskkonnaseire ning tunneb põhilisi keskkonnaseire meetodeid atmosfääri, hüdrosfääri, litosfääri ja biosfääri seires"}, {"en": "- knows the main parameters measured and recorded by environmental monitoring", "et": "- teab põhilisi keskkonnaseire abil mõõdetavaid ja registreeritavaid parameetrid"}, {"en": "- knows the types and methods of basic environmental observations and sampling", "et": "- tunneb põhiliste keskkonnavaatluste ja proovivõtu liike ja meetodeid"}, {"en": "- knows how to correctly collect, process and store observational data and analyze the results.", "et": "- teab, kuidas korrektselt vaatlusandmeid koguda, töödelda ja säilitada ning tulemusi analüüsida"}, {"en": "- has an overview of the types, uses and basic principles of remote sensing and contact monitoring", "et": "- omab ülevaadet kaugseire ja kontaktseire liikidest, kasutusvõimalustest ja põhiprintsiipidest"}, {"en": "- knows basic measuring instruments", "et": "- tunneb põhilisi mõõtmisvahendeid"}, {"en": "- can through practical experience correctly take environmental samples, e.g. water, gas, soil, plant biomass samples according to the parameters to be determined", "et": "- oskab läbi praktilise kogemuses korrektselt võtta keskkonnaproove, nt vee-, gaaside, pinnase-, taimede biomassi proove vastavalt määratavatele parameetritele"}, {"en": "- is able to analyze how the experience and knowledge gained during the internship has supplemented his / her university education", "et": "- oskab analüüsida, kuidas praktikal omandatud kogemused ja teadmised on täiendanud tema ülikooliharidust"}, {"en": "- is able to perform self-analysis on the basis of practical experience, which allows the student to interpret the gained practical experience", "et": "- oskab teha praktilise kogemuse põhjal eneseanalüüsi, mis võimaldab tudengil mõtestada saadud praktilist kogemust"}, {"en": "- can work in a team.", "et": "- oskab töötada meeskonnas."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}