{"uuid": "2f7781f1-c563-b234-2102-c64718c1e1c9", "code": "LTOM.00.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:31:20", "title": {"en": "Introduction to Studies in Biology and Biodiversity Conservation Speciality", "et": "Sissejuhatus bioloogia ja elustiku kaitse õpingutesse"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LT", "structural_unit_name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course the students are introduced to different options for passing the curriculum and different aspects related to the study regulations. Moodle course combines the most important information that is necessary for passing the curriculum in the most meaningful way (information about choosing a minor specialty, learning mobility, finding a supervisor, defending the thesis, in addition, about practice opportunities and career days). Invited alumni speak about their career paths.", "et": "Õppeaines tutvustatakse tudengitele erinevaid õppekava läbimise võimalusi ja õppekorralduslikke aspekte. Moodle kursus koondab endasse olulisema info, mis on vajalik õppekava mõtestatud läbimiseks (info kõrvaleriala valimise, õpimobiilsuse, juhendaja valimise ja kaitsmiste kohta, lisaks praktikavõimaluste ja karjääripäevade kohta). Esinema kutsutud vilistlased räägivad oma karjääriteedest."}, "objectives": [{"en": "The aims of the course are:", "et": "Aine eesmärgiks on:"}, {"en": "1) introduce the topics related to study regulations in the University of Tartu;", "et": "1) teavitada tudengeid Tartu Ülikooli õppekorraldusega seotud teemadest;"}, {"en": "2) to introduce different options for passing the curriculum (incl. enhancement modules, selecting minor specialty, finding a supervisor, defending the thesis etc.);", "et": "2) selgitada valikuvõimalusi õppekavas (sh erialavalik, võimendusmoodulid, kõrvaleriala valimine, juhendaja leidmine, lõputöö kaitsmine jne);"}, {"en": "3) introduce the opportunities for mobility and practice;", "et": "3) tutvustada võimalusi õpimobiilsuseks ja praktikakogemuse saamiseks;"}, {"en": "4) talk about effective learning, managing time, how to avoid burning out.", "et": "4) rääkida efektiivsest õppimisest, ajaplaneerimisest, kuidas vältida läbipõlemist."}], "learning_outcomes": [{"en": "The student:", "et": "Üliõpilane:"}, {"en": "Knows important rules regulating the studies;", "et": "Teab olulisi õppekorralduslikke reegleid;"}, {"en": "Knows how to use the Study Information System and is able to find information related to the studies;", "et": "Tunneb ÕISi ja oskab leida õpingutega seotud infot;"}, {"en": "Knows about different choices in the curriculum (incl. selecting a minor specialty, mobility);", "et": "On teadlik erinevatest valikuvõimalustest oma õppekavas (sh kõrvaleriala valimine, õpimobiilsus);"}, {"en": "Knows about the opportunities for practice;", "et": "On teadlik praktikavõimalustest;"}, {"en": "Knows about career options and the events that are organized by the University to introduce career options", "et": "On teadlik karjäärivõimalustest ja karjäärivõimalusi tutvustavatest üritustest, mis toimuvad Tartu ülikoolis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}