{"uuid": "2885a22c-1a03-2732-6125-a6478fad4e96", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-11T11:11:52", "title": {"en": "Phycology", "et": "Algoloogia"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM01", "name": {"en": "Department of Botany", "et": "botaanika osakond"}, "phone": "+372 737 6222", "address": "J. Liivi 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi 2", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 A regular LT Eng", "et": "24/25 S PÕ LT Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "LTOM01", "structural_unit_name": {"en": "Department of Botany", "et": "botaanika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 40, "practice": 0, "seminar": 0, "independent_work": 116, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}, {"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is an eye-opener to understand the hidden, often enigmatic life of algae, their structure, function, and role in the ecosystem. The course starts with lectures, and proceeds intermingled with seminars. A mandatory part of the course is written seminar work, which also has to be presented as an oral talk (max 10 min). This trains writing and presentation skills, as well as giving feed-back to others presentations. The course material is made available electronically. The seminar work requires analysis of a few regular research papers, which can be chosen by the student, or will be given by the tutor.", "et": "Kursus õpetab nägema silmale sageli varjatud, kuid biosfääri toimimisel oluliste organismirühmade funktsiooni, ehitust ja elutegevust. Kursus koosneb loengutest ja seminaridest.\nKursuse kohustuslik osa on referatiivne seminaritöö ja selle ettekandmine, mille läbi arendatakse kirjalikku ja suulist eneseväljendus- ja esinemisoskust ning esineja tagasisidestamist läbi kiituse ja kriitika. Tudengite seminariettekanded toimuvad loenguaegadel, algavad 7-8 loengu ajal ja võtavad seejärel ca pool iga loengu ajast. \nPeamised õppematerjalid on lektori koostatud elektroonilised konspektid ja loenguslaidid. Seminaritöö sooritamine eeldab paari enda poolt valitud või etteantud teadusartikli läbitöötamist."}, "objectives": [{"en": "An overview about the evolutionary systematics of algae, their role in the biosphere and ecosystem. Environmental problems and health hazards caused by algae, as well as their biotechnological perspectives, food and energy production.", "et": "Ülevaade vetikate olemusest, evolutsioonilisest süstemaatikast, rollist Maa biosfääris ja ökosüsteemis. Erikäsitlus vetikate põhjustatud probleemidest ja biotehnoloogilistest võimalustest."}], "learning_outcomes": [{"en": "1. Understand the very nature of algae, what distincts them from other organism groups, and what are the common features", "et": "1. Sõnastab vetikate olemuse, erinevused ja ühisosa teiste organismirühmadega"}, {"en": "2. Name the main groups of algae, their structural, physiological and ecological features", "et": "2. Nimetab olulisemaid vetikate suur-rühmi, nende ehituslikke, füsioloogilisi ja ökoloogilisi eripärasid"}, {"en": "3. Describe the role of algae in global biogeochemistry and in the formation of biosphere", "et": "3. Kirjeldab vetikate rolli Maa biogeokeemias ja biosfääri kujundamisel"}, {"en": "4. Describe the functioning of algae as part of aquatic ecosystem", "et": "4. Kirjeldab vetikate toimimist veekogude ökosüsteemi osana"}, {"en": "5. List the fundamental differences between the functioning of aquatic and terrestrial ecosystems", "et": "5. Nimetab olulisemaid erinevusi veekogude ja maismaa ökosüsteemide toimimises"}, {"en": "6. Evaluates the health and environmental risks caused by algae", "et": "6. Oskab hinnata vetikatega seotud terviseriske ja keskonnaprobleeme"}, {"en": "7. Describe the potential of algae in biotechnology, energy and food production", "et": "7. Nimetab vetikate eeliseid biotehnoloogia, energia- ja toiduainete tootmise valdkondades"}], "notes": {}}, "grading": {"independent_work": {"et": "vaata veebipõhisest õpikeskkonnast"}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "The final grade will be according to the proportion of correct answers ( A > 90% ; B > 80; C > 70; D > 60; E > 50)"}}], "grade_preconditions": {"et": "You need to deliver a written seminar paper. It has to be accepted by the lecturer. Therafter you you give a short, 10-15 min talk, where you present your seminar topic. Discussion will follow. The written and oral presentations are prerequisite to get to the final exam.\nkirjaliku seminaritöö esitamine ja suuline ettekandmine"}, "grade_evaluation": {"et": "The seminar paper and talk will not affect the final grade, but are prerequisites to get to the final exam. Exam is in writing. The student can choose between answering a llst of + or + questions, or longer narrative questions. The final grade will be according to the proportion of correct answers ( A > 90% ; B > 80; C > 70; D > 60; E > 50)\nEksamile pääsu eeldus on seminaritöö esitamine ja suulise ettekande pidamine. Seminar ei mõjuta eksami hinnet. Eksam on kirjalik, saab valida valikvastustega või jutustavate küsimustega variandi vahel. Eksamiküsimused sisalduvad kordamisküsimustes (sõnastus võib muutuda). Positiivne hinne (A-E) eeldab > 50% õigeid vastuseid. Positiivsete hinnete eristus (A-E) lähtub õigesti vastatud küsimuste protsendist (vastavalt A > 90% ; B > 80; C > 70; D > 60; E > 50)."}, "debt_elimination": {"et": "fix a time with the lecturer\nkokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://kodu.ut.ee/~olli/al/", "is_moodle_connected": false, "mandatory_materials": "vaata veebipõhisest õpikeskkonnast", "recommended_materials": "vaata veebipõhisest õpikeskkonnast"}, "participants": {"lecturers": [{"person_uuid": "05cb3e09-a470-7cf0-0560-94309d65fff4", "person_name": "Kalle Olli", "structural_unit": {"code": "LTOM01BO", "name": {"en": "Chair of Botany", "et": "botaanika õppetool"}, "address": "J. Liivi 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi 2", "zip": "50409", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "3, 6, 9, 12, 15, 20"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introductory lecture. Course structure and requirements. The very nature of algae, life cycles, functional traits.\nSissejuhatav loeng, kursuse ja eksami korraldus. Vetikate olemus, ehitustüübid, elutsüklid. Olulisemad funktsionaalsed tunnused."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Overivew of aquatic environments and algal life forms. Plankton, benthos, epiphytes. Fresh water and oceanic habitats. Stratification, oligotrophic vs eutrophic habitats. Upwelling in the Ocean\nVetikate elukeskkonnad. Plankton, bentos, epifüüton. Magevesi ja ookean. Kihistumine. Oligotroofia ja apvelling."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "All you need to know about cyanobacteria. Main features, cell structure, pigments, life cycle, reproduction, ecology. Cyanobacteria in fresh water environments and in the oceans. Cyanotoxins and toxic cyanobacteria. Most important taxa-\nKõik vajaminev sinivetikatest. Tunnused, struktuur, pigmendid, spoorid, paljunemine, ökoloogia. Sinivetikad magevees ja ookeanis. Toksiinid ja toksilised õitsengud. Oluliseamd perekonnad."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Diatoms. Cell structure, features. The role of diatoms in the biogeochemistry of the Earth. Global Si cycle. Most important taxa. Toxic diatoms.\nRänivetikad. Olemus, ehitus, tunnused ja eripära. Tekkimine ja roll Maa biogeokeemias. Oluliseamd perekonnad. Biogeense räni setted. Toksilised ränivetikad."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Dinoflagellates. Cell structure, features. Diversity and cell types. Life cycles. Ecology, red tides. Toxins and toxic blooms. \nVaguviburlased. Olemus, ehitus, tunnused ja eripära. Oluliseamd perekonnad. Toksiinid ja õitsengud."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Chrysophytes and cryptophytes. Diversity cell structure, and ecology, life cycles. Most important taxa.\nWe start with seminars.\nKoldvetikad ja krüptofüüdid.  Olemus, ehitus, tunnused ja eripära. Oluliseamd perekonnad.\nAlgavad seminariettekanded."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Haptophytes. Cell structure, diversity, main functional groups and taxa. Coccolithophorides, toxic haptophytes, Phaeocystis and global S cycle, climate regulation.\nSeminar talks.\nHaptofüüdid. Olemus, ehitus, tunnused ja eripära. Oluliseamd funktsionaalsed rühmad, perekonnad. Roll globaalses väävliringes ja Maa biogeokeemias ning kliima regulatsioonis.\nSeminariettekanded"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Smaller groups: euglenids, glaucophytes, xantophytes. Characters and ecology. More important taxa.\nKeep up with seminar talks.\nEugleniidid, tribofüüdid, glaukofüüdid. Olemus, ehitus, tunnused ja eripära. Oluliseamd perekonnad.\nSeminariettekanded"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Toxic algae and algal toxins. Globally, and what to fear in Estonia. What to avoid, how to behave.\nSeminars continue.\nMürgised vetikad ja vetikamürgid. Globaalselt ja Eestis. Mida peaks teadma ja kuidas hoiduda.\nSeminariettekanded"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Carbon concentration mechanisms in algae. Why is it needed and how it functions.\nSeminars continue\nVetikate süsihappegaasi kontsentreerimise mehhanismid. Miks seda vaja on, kuidas toimib.\nSeminariettekanded"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Cross comparison of aquatic and terrestrial ecosystems. What are most different, what are similarities in the phsical and chemical environments, and in biology. Production pyramid, ecological efficiency.\nSeminars continue\nMaismaa ja veekogude ökosüsteemide võrdlus. Produktsioon, ökoloogiline effektiivsus.\nSeminariettekanded"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Some ecological theories, which are most relevant to phytoplankton, what determines the community structure and dynamics. Exponential growth and it's mathematical expressions.\nSeminars continue.\nOlulisemad ökoloogia teooriad mis puudutavad vetikate koosluse struktuuri ja kujunemist. Kasv ja selle matemaatiline väljendamine.\nSeminariettekanded"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Algal pigments in a nutshell. Algae and biotechnology. What can we produce, what are the markets. What are the main limitations.\nVetikate pigmendid ja värvikirevus. Vetikad ja biotehnoloogia.\n\nSeminariettekanded."}}]}, "registration_info": {"audience": {}, "min_students": 0, "max_students": 45}, "parent_uuid": "d4a993d3-d2b4-f1fc-7f3f-0d69f779ab02", "parent_code": "LTOM.01.011", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}