{"uuid": "92233210-d3c5-27de-7a28-b297c0a99776", "code": "LTOM.00.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "General and Methodological Principles in Scientific Research", "et": "Teadustöö üldised ja metodoloogilised printsiibid"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will give a general overview about scientific approach, its elements and implementation. The course will give ability to plan and conduct scientific project in biological and ecological systems, and how to communicate the results of such a project. In addition, It will give a general understanding about the quality measurements of science and scientific literature.", "et": "Kursus tutvustab lühidalt teadusliku lähenemise olemust, selle elemente ja rakendaust. Õpitakse tundma andmekogumise kõige üldisemaid printsiipe ja nende rakendamist ökoloogias ja teistes bioteadustes. Kursus annab vajalikud oskused, et planeerida ja sooritada uurimustöö bioloogias või ökoloogias ning õpetab ka saadud tulemusi kirjalikult ja suuliselt esitama. Lisaks annab kursus ülevaate üldistest printsiipidest ja kvaliteedinäitajatest, mida rakendatakse teadlaste ja teaduskirjanduse hindamisel."}, "objectives": [{"en": "Allow systematic view about scientific method in general, introduce main principles of planning, successful conduction and ways of dissemination of a scientific approach. Allow understanding nature of science, main principles and special features of scientific activities", "et": "Võimaldada süsteemse nägemuse omandamist loodusteadusliku meetodi olemusest, teadusliku töö planeerimise, eduka sooritamise ja saadud tulemuste esitamise erinevatest võimalustest. Anda vajalik ettekujutus teaduse olemusest, teadusliku tegevuse kõige üldisematest printsiipidest ja eripärasustest."}], "learning_outcomes": [{"en": "After the course, attendee will be able:", "et": "Kursuse läbinu:"}, {"en": "1.\tUnderstand the essence of scientific method and define its elements - characterization of an observation, defining questions, posing hypotheses, making predictions and testing those in experiments.", "et": "1.Saab aru (loodus)teadusliku meetodi olemusest ning oskab defineerida selle elemente (nähtuste iseloomustamine, küsimuste esitamine, hüpoteeside püstitamine, ennustuste tegemine, eksperiment). "}, {"en": "2.\t Is capable to plan observational and/or manipulative experimental scientific work in biology and ecology. Is familiar with randomization, pseudoreplication, various experimental methods and correct measurements practices. The attendee will prepare the plan of their master thesis (practical exercise).", "et": "2.Oskab planeerida bioloogilist/ökoloogilist nii vaatlustel kui manipulatiivsetel eksperimentidel põhinevat teadusliku tööd. Teab mis on juhuslikustamine, pseudoreplikatsiooni vältimine, erinevate eksperimentaalsete meetodite rakendamine ja korrektne mõõtmine. Koostab oma magistritöö kava (praktiline töö)."}, {"en": "3.\tPossess elementary data gathering and handling techniques and will understand general ethical aspects in connection with data collection and management. ", "et": "3.Valdab elementaarseid andmete kogumise ja haldamise võtteid ning mõistab andmete kogumisega kaasnevaid üldisi eetilisi aspekte. "}, {"en": "4.\tWill understand general principles behind scientific writing (including how this style differs from other written expressions) and will be able to use scientific writing skills in their thesis preparation.", "et": "4.Ta saab aru teadusartikli kirjutamise üldistest põhimõtetest (sh mispoolest teadusartikkel erineb muust kirjalikust eneseväljendusest) ning oskab neid rakendada, nt magistritöö kirjutamisel."}, {"en": "5.\tWill have an understanding about scientometric principles behind the evaluation of the quality of science, scientists and scientific journals.", "et": "5.Saab aru miks ja kuidas teadustöö kvaliteeti, teadlasi ja teadusajakirju hinnatakse ja mõõdetakse (scientomeetria)."}, {"en": "6.\tWill know the quality requirements of a scientific presentation and is able to list and avoid general faults.", "et": "6.Teab teaduslikule ettekandele ja selle esitamisele ning visualiseerimisele esitatavaid nõudmisi ning oskab loetleda põhilisi komistuskive. "}, {"en": "7.\tIs able to use reference software of web based databases (ISI WOS, PubMed, Google Scholar) for literature search, management and citation of references.", "et": "7.Oskab kasutada viitehaldustarkvara interneti-andmebaasidest (ISI WOS, PubMed, Google Scholar) kirjandusviidete leidmiseks, haldamiseks ja viitamiseks. Koostab viidete andmebaasi (praktiline töö)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}