{"uuid": "d0d42b6c-1090-f4f7-a49e-4884d20b90f5", "code": "LTOM.02.049", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Big Data in Landscape Studies", "et": "Suurandmed maastiku-uuringutes"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of the techniques of big data analysis in biogeochemical cycles at ecosystem and landscape level (e.g. data analysis derived from eddy covariance method used for greenhouse gas investigations, analysis of data from modern techniques used for the investigations of microorganisms controlling carbon and nutrient cycling in soils), and includes several hands-on exercises. The course provides students with skills necessary to investigate patterns of biogeochemical cycles of ecosystems and landscapes.", "et": "Ülevaatekursus maastikuökoloogias ja loodusgeograafias kasutatavatest suurandmete analüüsi meetoditest, mis leiavad rakendamist erinevates ökosüsteemi- ja maastikuuuringutes (nt. turbulentse õhuvoolu meetodi andmeanalüüs kasvuhoonegaaside uurimisel, mullas süsiniku ja toitainete ringet kontrollivate mikroorganismide geeniandmete analüüs). Tüüpiliste ülesannete praktiline läbiproovimine, kasutades R, MatLab ja kaugseire andmete töötlemise tarkvara."}, "objectives": [{"en": "The aim of the course is to provide overview and understanding of the main techniques for big data analysis used in landscape biogeochemical studies. The course provides students with skills necessary to investigate main biogeochemical cycles in ecosystem and landscape level studies.", "et": "Saada ülevaade kaasaegsest maastiku aineringete uuringuteks kasutatavatest suurandmete analüüsimeetoditest ning sooritada rida praktilisi harjutusi valitud meetodite paremaks omandamiseks ja kasutuskogemuste saamiseks."}], "learning_outcomes": [{"en": "A successful student has a systematic overview of the main ideas of big data analysis and main methods used in landscape, including ecosystem studies. Student has practical experience of solving big data analysis tasks by means of the common software packages of statistical data analysis.", "et": "Õppeaine edukalt läbinud üliõpilane omab süsteemset ülevaadet maastikuuuringutes kasutatavate suurandmete analüüsi põhilistest ideedest ning lihtsamatest meetoditest tüüpiliste ülesannete lahendamisel. Tal on niisuguste ülesannete praktilise lahendamise kogemus levinuma andmetöötluse tarkvaraga."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}