{"uuid": "e6599c90-c13c-62d8-0e13-6876c02ac2aa", "code": "lt-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-27T13:39:56", "title": {"en": "Planning Project", "et": "Planeerimise projekt"}, "credits": 15, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "25/26 S regular LT Eng", "et": "25/26 K PÕ LT Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 22, "practice": 10, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 318, "individual_work": 14, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Students will learn modern planning theoretical framework and methods, and apply this knowledge in preparing a planning project as a group work. The general topic of each group project is given by lecturers. During the course, fieldwork is done and a public discussion of the planning solution is simulated, at the end of the course the group work will be presented and defended. The course is divided into three stages (theoretical context of spatial planning, empirical analysis, preparation of a planning solution) and is taught by different lecturers. The results of the statistical analysis are learned to be used as a justification for the planning solution.\n1. Contemporary spatial planning\nIn the first phase, students acquire knowledge of the basic concepts of planning and the most relevant topics in contemporary spatial planning (for example sustainability, mobility, etc.). In addition to this, students become acquainted with the main topics, regulations and spatial plans of the area under study. In the course of the work, suitable theoretical framework for solving the planning project are found. By the end of the first phase, the main goal and task of the Planning Project for each group are formulated.\n2. Statistical analysis\nIn the second phase, each group performs a quantitative analysis based on their specific group-work task. This is done using statistical analysis methods. The goal is to conduct an empirical data analysis and implement the results in the Planning Project. At the end of the second phase, students present their analysis results.\n3. Compilation of a spatial plan\nIn the third phase, the planning solutions and policy recommendations are developed based on the task of the planning project and the analysis performed. A planning map with an explanatory text will be prepared.\n\n\nNB! Previous experience with GIS softwares (maps) is needed", "et": "Tudengid tutvuvad erinevate planeerimisteooriate ja meetoditega ning rakendavad neid teadmisi planeerimisprojektis grupitööna. Oluline osa grupitööst on õppida tegema koostööd ja osalema kommunikatsiooniprotsessis planeeringute koostamisel. Iga rühma planeerimisprojekti üldine teema on paika pandud õppejõudude poolt. Kursuse käigus tehakse välitöid ja toimub planeeringulahenduse avaliku arutelu simulatsioon, lõpus kaitstakse välja töötatud planeeringulahendust. Kursus on jaotatud kolme etappi (ruumilise planeerimise teoreetiline kontekst, analüüs, planeeringulahenduse ja -kaardi koostamine), mida annavad erinevad õppejõud. Statisilise analüüsi tulemusi õpitakse kasutama planeeringulahenduse põhjendusena.\n1. Planeerimise olemus Lääne maailma kontekstis.\nEsimeses etapis omandavad tudengid teadmisi planeerimise olemusest ja aktuaalsematest ruumilise planeerimise teemadest (nt jätkusuutlikkus, mobiilsus jm). Lisaks tutvutakse uurimisaluse piirkonna oluliste teemade, regulatsioonide ja planeeringutega. Töö käigus leitakse sobivad teoreetilised lähtekohad planeerimisprojekti lahendamiseks. Esimese etapi lõpuks sõnastatakse iga grupi/töörühma planeerimisprojekti peaeesmärk ja lähteülesanne.\n2. Statistiline analüüs.\nTeises etapis teostab iga grupp kvantitatiivse analüüsi, mis lähtub etteantud planeeringuprojekti teemast. Selleks kasutatakse statistilisi andmeanalüüsi meetodeid. Eesmärgiks on läbi viia empiiriline andmeanalüüs, et selle tulemusi rakendada planeerimisülesandes. Teise etapi lõpus esitavad tudengid enda analüüsi tulemusi.\n3. Planeeringulahenduse koostamine\nKolmandas etapis töötatakse välja planeeringulahendused ja poliitikasoovitused põhinedes planeerimisprojekti lähteülesandele ja teostatud analüüsile. Koostatakse planeeringukaart koos seletuskirjaga.\n\nNB! Eelnev kogemus GIS tarkvaraga (QGiS või ArcGIS) on vajalik."}, "objectives": [{"en": "This course aims to provide knowledge on how to use spatial data and analysis in urban and regional planning. During the course, students will gain practical experience in the process of preparing spatial plans.", "et": "Kursuse eesmärk on anda teadmisi, kuidas kasutada ruumiandmeid ja analüüsi ruumilisel planeerimisel. Kursuse käigus saadakse praktiline kogemus planeeringu koostamise protsessist ja valmib planeeringulahendus."}], "learning_outcomes": [{"en": "Upon completing the course a student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1) knows the principles of contemporary spatial planning and is able to discuss them from different cultural contexts;", "et": "1) tunneb kaasaegse planeerimisteooria põhiseisukohti ja oskab neid analüüsida erinevatest kultuurikontekstidest lähtuvalt;"}, {"en": "2) is able to use relevant datasets for analyzing social-spatial processes and for preparing spatial plans;", "et": "2) oskab kasutada erinevaid andmeallikaid sotsiaal-ruumiliste protsesside analüüsimiseks ja planeeringute koostamiseks;"}, {"en": "3) has an overview of the main quantitative and qualitative methods used in spatial planning;", "et": "3) omab ülevaadet põhilistest planeerimises rakendavatest kvantitatiivsetest ja kvalitatiivsetest meetoditest;"}, {"en": "4) has skills for academic writing;", "et": "4) on omandanud teadusteksti kirjutamise oskused;"}, {"en": "5) is able to select and apply appropriate GIS and visualization tools for spatial planning;", "et": "5) oskab valida ja rakendada planeeringute koostamiseks sobivaid GISi ja visualiseerimise vahendeid;"}, {"en": "6) is able to develop general planning solutions (explanatory text and maps) based on analysis;", "et": "6) oskab välja töötada üldisema planeeringu lahendusi (seletuskirja ja kaarte) tuginedes analüüsile;"}, {"en": "7) is able to compile spatial plan and design planning maps;", "et": "7) oskab koostada planeerimisdokumente ja planeeringukaarte;"}, {"en": "8) understands the concept of participatory planning and is able to select appropriate involvement methods;", "et": "8) saab aru kaasava planeerimise kontseptsioonist ja oskab valida sobivad kaasamismeetodid; "}, {"en": "9) has  skills to conduct a public discussion and to introduce publicly the planning solutions;", "et": "9) on omandanud oskused avaliku arutelu läbiviimiseks ja planeeringulahenduse avalikuks tutvustamiseks;"}, {"en": "10) has participated in group work in international team.", "et": "10) on kaasalöönud rahvusvahelise liikmeskonnaga grupitöös."}], "notes": {"et": "Students who enrol to this course have to have previous experience with GIS softwares and making maps."}}, "grading": {"independent_work": {"et": "Phase 1: Written assignment\nPhase 2: Empirical study, individual conversation, presentations, defence and review\nPhase 3: Compilation of planning project and spatial plan map, public presentation simulation and defence"}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Phase 1: overview of the planning area & aim and vision of the plan  (group assessment, 2 points); analysis of spatial mobility plans (individual assessment, 3 points)  Individual contribution assessment (individual assessment, pass/fail)"}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Phase 2: empirical study (group assessment, 30 points); individual conversation (individual assessment, 15 points);  individual contribution assessment (individual assessment, pass/fail); writing and presenting a review of other group's study (group assessment, pass/fail)"}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "Phase 3: planning project  (group assessment, 30 points) spatial plan maps (individual assessment, 20 points), individual contribution assessment (individual assessment, pass/fail)"}}], "min_points_from_tests": 50, "grade_preconditions": {"et": "All presentations must be delivered. At least 51% of points must be obtained from each phase of the course."}, "grade_evaluation": {"et": "Maximum 100 points can be received. \nThe grade consists of several group-works, presentations and individual assignments:\nPhase 1 (5%, 5 points): overview of the planning area & aim and vision of the plan (group assessment), analysis of spatial mobility plans  (individual assessment), individual contribution (pass/fail, individual assessment)\nPhase 2 (45%, 45 points): empirical study (30 points, group assessment), individual conversation (15 points, individual assessment),  review (presentation and submission of written document) of other group's work (pass/fail, group assessment)), individual contribution (pass/fail, individual assessment)\nPhase 3 (50%, 50 points): planning project (30 points, group assessment), spatial plan map(s) (20 points, individual assessment), individual contribution (pass/fail, individual assessment)\n\nA: 91-100 points, B: 81-90 points, C: 71-80 points, D: 61-70 points, E: 51-60 points, F: 0-50 points.\n\nIn phase 1 we evaluate:\n1) overview of the planning area & aim and vision of the plan;\n2) analysis of spatial mobility plans;\n\nIn phase 2 final study report we evaluate:\n1) introduction and conclusions; \n2) theoretical overview; \n3) data and methods; \n4) results;\n5) discussion;\n6) formatting;\n7) defence: final presentation and discussion.\n\nIn phase 3 planning project we evaluate:\n1) substantive adequacy;\n2) the use of different visualisation methods and techniques;\n3) the development of the plan during the course;\n4) formatting;\n5) presentations and defence;\n6) spatial plan map\n\nRegarding the presentation we evaluate:\n- structure of the presentation and presentation of the case,\n- argumentation,\n- justification of chosen viewpoints and solutions."}, "debt_elimination": {"et": "In agreement with the lecturers."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "22b66351-e0da-44e2-78f2-10842cadebe9", "person_name": "Pille Metspalu", "structural_unit": {"code": "LTOM02GR", "name": {"en": "Chair of Human Geography", "et": "inimgeograafia ja regionaalplaneerimise õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "bdac3cfa-c7e6-bd71-da48-9a527e0f5b38", "person_name": "Siiri Silm", "structural_unit": {"code": "LTOM02GR", "name": {"en": "Chair of Human Geography", "et": "inimgeograafia ja regionaalplaneerimise õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "a7e0ea01-bbd2-1faf-0386-59fb7ac139e6", "person_name": "Ingmar Pastak", "structural_unit": {"code": "LTOM02GR", "name": {"en": "Chair of Human Geography", "et": "inimgeograafia ja regionaalplaneerimise õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "ddc075ca-1380-cf77-1d17-ff62f09013cc", "person_name": "Ago Tominga", "structural_unit": {"code": "LTOM02GR", "name": {"en": "Chair of Human Geography", "et": "inimgeograafia ja regionaalplaneerimise õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM02"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-38.n."}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 24-25. In the first part, students acquire knowledge of the basic concepts of planning and the most relevant topics in spatial planning (for example sustainability, mobility, etc.). The first part consists mostly of lectures and seminars. Detailed time-table is in Moodle."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Week 26-32. In the second part, each group carries out an empirical study based on their specific group work task. The second part consists mostly of computer lab sessions, seminars and of a few lectures. Detailed time-table is in Moodle."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 33-38. In the third part, planning solution, spatial plan map and policy recommendations will be developed based on the goals and analysis results from previous phases. A planning map is designed together with the text of a spatial plan to set out the goals of spatial development for area under study. In the end of the course, each group presents their spatial plan. Detailed time-table is in Moodle."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "9d67024c-05a1-9b7a-1a8b-0352b4769106", "parent_code": "LTOM.02.010", "parent_credits": 15, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}