{"uuid": "89585cd5-e16e-569b-4b33-51da3268dc74", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T18:06:47", "title": {"en": "Ethics and Alternatives for Animal Use in Research", "et": "Loomuuringute eetika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM04", "name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "webpage_url": "https://zooloogia.ut.ee", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM04", "structural_unit_name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 3, "colloquium": 0, "web_learning": 0, "independent_work": 75, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The ethics of animal research is one of the cornerstones of natural and medical sciences, and without this knowledge, the education received in the university remains incomplete. This statement is not an exaggeration and animal research ethics is one of those critical topics that almost every person involved in natural or medical sciences comes into contact in his later professional work. There exist a number of different ethical positions about the methods used in animal research and a student should know these in order to make a well-considered decision whether to use methods for animal studies that require slaughter of animals (still a rather common practice) or to choose methods that do not require such cruelty. This is crucial. During the course, the core issues in animal research ethics and various methods that allow animal studies to be carried out without killing animals are introduced. The number of such methods has grown considerably in recent years and can replace many cruel methods. Based on the knowledge gained from the course, each student can formulate his or her own position and make a choice, which methods to use. Thus, the course on animal research provides the necessary background knowledge on which the student can make a well-considered decision.", "et": "Loomuuringute eetika on loodus- ja meditsiiniteaduste üheks nurgakiviks ja ilma sellealaste teadmisteta jääb ülikoolist saadav haridus selgelt poolikuks. Loomuuringute eetika on üks neist kriitilistest teemadest, mis on muutumas järjest aktuaalsemaks ja millega pea iga loodus- või meditsiiniuuringutega tegelev inimene oma erialases töös varem või hiljem kokku puutub. Loomade uurimise meetodite suhtes on erinevaid eetilisi seisukohti, kuid üldjuhul neist ei räägita. Seetõttu puudub üliõpilasel võimalus kaalutletud otsuseks, kas kasutada loomuuringutel meetodeid, mis eeldavad loomade tapmist (paraku üsna levinud praktika) või valida hoopis sellised meetodid, mis loomade tapmist ei nõua. Tegemist väga põhimõttelise otsusega, mis nõuab vastava temaatika head tundmist. Kuna üliõpilasel tuleb juba stuudiumi varases staadiumis teha oma valik, millise töörühmaga liituda ja milline uurimisteema valida, siis oleks hea, kui iga loodus- ja meditsiiniteaduste üliõpilane  omandaks võimalikult varakult vajalikud teadmised loomuuringute eetikast. Kursuse käigus tutvustatakse loomuuringute eetika sõlmprobleeme ja erinevaid meetodeid, mis võimaldavad loomuuringuid läbi viia ilma loomi tapmata - selliste meetodite hulk on viimastel aastatel oluliselt kasvanud ja nendega on võimalik asendada paljusid vanu meetodeid, mis on oma nii teaduslikust kui eetilisest seisukohast ära elanud. Kursusel omandatud teadmiste põhjal saab iga üliõpilane kujundada oma seisukoha ning vastavalt sellele teha oma valikud, milline uurimisteema ja meetodid valida. \nLoomuuringute eetika kursus annab vajalikud baasteadmised, mille põhjal üliõpilane saab teha kaalutletud otsuse, mis pikas perspektiivis on igaühe jaoks äärmiselt oluline. \nKursuse temaatika on põnev, praktiline ja arendav. Ja seda mitte ainult erialast haridust silmas pidades, vaid ka igaühe üldist vaimset arenguteed."}, "objectives": [{"en": "The course provides an overview of the different problems and views in the field of animal research ethics. Seminars include PP presentations of term papers and discussions that address the controversy and contradictions of different approaches in animal studies. Also, new non-lethal methods of animal research will be introduced, as well as the current legislation of the European Union. The course is very well suited also for the students of medical faculties, as it addresses the problems of animal research in the field of biomedicine and provides examples of alternative methods, the transition to which seems critical if the aim is to develop new therapies to protect human health as effectively and safely as possible.", "et": "Loengud annavad ülevaate erinevatest seisukohtadest ja probleemidest loomuuringute eetika vallas. Tutvustatakse ka uuemaid mitte-letaalseid loomuuringute meetodeid ning käsitletakse Eesti ja Euroopa Liidu kehtivat seadusandlust. Seminarides toimuvad referaatide kuulamised ja arutelud, kus vaagitakse loomuuringutega seotud eri lähenemiste poolt- ja vastuargumente. Kursus sobib väga hästi ka arstiteaduskonna tudengitele, kuna muude oluliste teemade hulgas käsitletakse ka biomeditsiini valdkonna loomuuringute probleeme ning tuuakse näiteid alternatiivsetest meetoditest, millele üleminek näib olevat vältimatu, kui soovime võimalikult efektiivselt ja ohutult inimeste tervise kaitseks uusi ravimeetodeid välja töötada"}], "learning_outcomes": [{"en": "A student who has completed the course: 1) has acquired basic knowledge of animal research ethics; 2) knows a variety of methods that allow for animal studies to be carried out without the killing of animals, i.e. using alternative approaches; 3) can formulate an opinion on the methods used in animal research, can critically evaluate different methods and is open to novel approaches", "et": "Loengukursuse läbinud üliõpilane: 1) omandab loomuuringute eetika vajalikud baasteadmised; 2) teab erinevaid meetodeid, mis võimaldavad loomuuringuid läbi viia kas ilma loomi surmamata, kasutades alternatiivseid lähenemisi; 3) kujundab oma arvamuse loomuuringutel kasutatavate meetodite suhtes, oskab kriitiliselt hinnata erinevaid meetodeid ning on avatud uutele lähenemistele  \n ."}], "notes": {"et": "Õpe toimub valdavalt iseseisva tööna. Auditoorse õppena toimuvad vaid seminarid, milles kursusel osalejad teevad ettekande referaadi põhjal ja kus toimub arutelu. Kui epidemioloogiline olukord seminariks kokkusaamist ei võimalda, siis toimuvad seminaris interneti vahendusel. Seminaride arv sõltub kursusele registreerunute arvust. \nÕpe algab kohe semestri alguses. Kogu vajamineva info leiad kursuse Moodle lehelt. \n--------------------------------\nÜldine kursuse läbimise skeem on järgmine:\n1) Essee kirjutamine (2-3 lk)\n2) Panopto videoloengute 1-6 põhjal õppimine, millele järgneb kontrolltöö\n3) Referaadi kirjutamine (4-5 lk) ja seminaris selle põhjal ettekande tegemine\n4) Panopto videoloengute 7-9 põhjal õppimine\n5) Eksam"}}, "grading": {"independent_work": {"et": "Õpe toimub valdavalt iseseisva tööna, milleks on:\n(i) Essee kirjutamine enda valitud teemal, kuid õppejõu poolt suunatud teemavaldkonnas \n(ii) Õpe videoloengute põhjal nii kontrolltööks kui eksamiks. Panopto videod leiad kursuse Moodle lehelt\n(iii) Referaadi kirjutamine enda valitud teemal, kuid õppejõu poolt suunatud teemavaldkonnas ja referaadi põhjal ettekande tegemine seminaris"}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik test, ca 20 küsimust, mis katavad kogu läbitud materjali. Essee ja referaat annavad lisapunkte, mida arvestatakse eksamihinde kujundamisel."}}], "grade_preconditions": {"et": "Kontrolltöö edukalt sooritatud, essee ja referaat esitatud ning referaadi põhjal ettekanne tehtud."}, "grade_evaluation": {"et": "Kirjalik test. Kuni 20 küsimust, mis katavad kogu läbitud materjali. Väga hästi sooritatud kontrolltöö, sisukas essee ja referaat annavad lisapunkte, mida arvestatakse eksamihinde kujundamisel"}, "debt_elimination": {"et": "Vastavalt üliõpilase ja õppejõu vahelisele kokkuleppele"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "8099acde-e7c2-46a5-bd90-fa4fe514e634", "type": "MOODLE", "code": "LTOM.04.004", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Videoloengud (Panopto) - need on üles pandud kursuse Moodle lehele. Sealt leiad ka kogu muu olulise info", "recommended_materials": "(1) Armstrong SJ, Botzler RG (toim.). 2017. The Animal Ethics Reader. Routledge. 737 lk. \nPõhjalik kogumik, mis sisaldab artikleid eriala parimatelt spetsialistidelt nii loomuuringute eetika kui ka teistel loomade eetikaga seotud teemadel (esindatud nii loomuuringute pooldajate kui vastaste seisukohad).\n \n(2) Garrett JR (toim.). 2012. The Ethics of Animal Research: Exploring the Controversy. MIT Press. 344 lk.\nKogumik, mis sisaldab loomuuringuid käsitlevaid artikleid eriala tunnustatud asjatundjatelt (esindatud nii loomuuringute pooldajate kui vastaste seisukohad).\n\n(3) Irving D. 2014. The Cruel Science: Animal Research from Aristotle to the 21st Century. Showalter Press. 263 lk. \nKäsitleb loomuuringute ajalugu ja arutleb teistel loomuuringutega seotud olulistel teemadel.\n."}, "participants": {"lecturers": [{"person_uuid": "d72ad421-880f-418c-a5fc-b25c54a02f00", "person_name": "Urmas Saarma", "structural_unit": {"code": "LTOM04TR", "name": {"en": "Chair of Mammalogy", "et": "terioloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM04"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-36"}, "entries": [{"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Kursuse raames tuleb edukalt sooritada üks kontrolltöö, mille tegemiseks on 2 aega.  Ajakava leiad kursuse Moodle lehelt."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminaride arv sõltub kursusele registreerunute arvust. Seminaride ajakava leiad kursuse Moodle lehelt."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Panopto videoloengute kuulamise ajakava leiad kursuse Moodle keskkonnast"}}]}, "registration_info": {"audience": {"et": "Vaba kõigile. Eriti oluline on kursus loodusteaduste ja biomeditsiiniga seotud tudengitele"}, "min_students": 1, "max_students": 108}, "parent_uuid": "434f3d63-b8d0-3cc4-8000-c0007737d1de", "parent_code": "LTOM.04.004", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}