{"uuid": "ce0004d2-ce52-9c05-4d39-7b53357d663f", "code": "LTOM.00.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Seminar", "et": "Magistriseminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Master's Seminar contains the following parts and ECTS:\n1) Attending to the seminars (at least 12 seminars in a semester; 4 semesters x 0.5 ECTS = 2 ECTS). The seminars of a student's chair are compulsory, the other seminars (seminars of other chairs and department of botany/zoology should be attended to gain at least 10 seminar visits (in total) in a semester. The scientific meetings held outside of Tartu University can also be visited, but they must be related to ecology and approved by the supervisor.\n2) Attending to the workgroup/chair's work meetings (1 ECTS). It is compulsory to discuss the workflow of the student's thesis (in the first meetings, the student presents the work plan of the thesis)\n3) Giving an oral presentation on the Master thesis in the 2nd semester (2 ECTS). \n4) The pre-defense of the Master thesis in the 4th semester (1 EAP).\n \n\n\nIt is very important to continuously record the visited seminars and other activities in the Master's seminar report. The following information should be included in a table of the report: date, type of the seminar (chair/department/other), title/topic of the seminar, name of the presenter and duration of the event (in hours). Discussions with the supervisor and other members of the workgroup should be reported in the similar way. \nThe Master's seminar report should be sent at least two weeks before the end of the each semester to the email of Karin Kaljund (karin.kaljund@ut.ee) (in the Department of Botany) or to Margret Sisask (margret.sisask@ut.ee) (in the Department of Zoology).", "et": "Magistriseminar koosneb järgmistest kohustuslikest osadest ja EAPdest:\n(1) Seminaridest osavõtt (osalemine vähemalt 12 seminaril ühes semestris, s.o. 0.5 EAPd; 4 semestrit x 0.5 EAPd = 2 EAPd). Üliõpilase enda õppetooli seminarid on kohustuslikud; teiste õppetoolide ja botaanika/zooloogia osakonna seminarides tuleb (kooskõlastatult juhendajaga) nii palju osaleda, et ühes semestris oleks kokku osaletud vähemalt 12 seminaril. Sobilikud on ka väljaspool Tartu Ülikooli toimuvad erialased teaduskogunemised (need samuti eelnevalt kooskõlastada oma juhendajaga).\n(2) Töörühma/õppetooli spetsiifilistes tööaruteludes osalemine (1 EAP). Kohustuslik on sealjuures üliõpilase magistritöö plaani arutamine (tööarutelu algab enda plaane tutvustava ettekandega). \n(3) Suulise ettekande tegemine enda magistritöö põhjal 1. õppeaasta kevadsemestril (2 EAPd). See võimaldab instituudi töötajatel ning ka kraadiõppuritel olla vastastikku kursis kõrvalerialal toimuva tööga, samuti kraadiõppurite teadustöö laiemat sisulist arutamist.\n(4) Magistritöö eelkaitsmine 2 a. kevadsemestril (1 EAP).\n\nEAPde arvestamiseks on äärmiselt oluline jooksvalt täita Magistriseminari aruannet. Aruande tabelisse märkida järgnev info: kuupäev, seminariliik (õppetooli/osakonna/mujal toimunud üritus), seminari pealkiri/teema, esineja nimi ja kestvus (tundides). Magistritööteemalised arutelud oma juhendajaga ja töörühma spetsiifilised arutelud märkida samuti sarnasel viisil aruandesse. \n\nMagistriseminari aruanne tuleb esitada hiljemalt 2 nädalat enne iga semestri lõppu botaanika osakonnas e-postile: karin.kaljund@ut.ee ja zooloogia osakonnas e-postile: margret.sisask@ut.ee"}, "objectives": [{"en": "Seminar will give a broad overview of ecological research. During the course, students will develop their Master thesis and improve scientific discussion and presentation skills.", "et": "Kursuse eesmärgiks on toetada tudengeid omandamaks teadmisi ja oskusi, mis on vajalikud magistriprogrammi läbimiseks. Seminaridel osalemine aitab kaasa erialaste õpivalikute tegemisel, väliskülaliste kaasamine annab sh. ülevaate erialaste karjäärivõimaluste kohta. Magistriseminar toetab järgmisi oskusi: oma eriala, aga ka naabererialade uurimistulemuste ja probleemidega kursis olemine, akadeemiline lugemine ja kirjutamine, uurimistehnikad ja meetodid, arutlemisoskus, avalik esinemine ja presentatsioonid. Lisaks sellele on kursuse eesmärgiks tagada toetav õpikeskkond, mis aitab kaardistada üliõpilaste isiklikke õpivajadusi ja analüüsida õppimiskogemust."}], "learning_outcomes": [{"en": "The MSc student will become familiar with current research questions in ecology. By the end of the course the student can analyze scientific literature, participate in scientific discussions and give scientific presentations on his/her speciality.", "et": "Magistriseminari edukalt läbinud üliõpilane: (1) orienteerub kaasaegse ökoloogia aktuaalsetes probleemides, enda õpivalikutes, aga ka edasistes õppimis- ja töövõimalustes; (2) kavandab enda õppimisprotsessi ja oskab valida sobiva töörühma magistritöö kirjutamiseks; (3) reflekteerib isikliku õppimiskogemuse üle; (4) esitab selgelt ja seostatult suulisi presentatsioone; (5) kasutab erinevaid teaduslikke uurimismeetodeid; (6) analüüsib kirjanduses välja toodud olulisi argumente, selgitab analüüsi tulemusi, teeb kokkuvõtteid ja järeldusi; (7) analüüsib keerulisi ökoloogilisi mõisteid ja probleeme, sh. on võimeline andma ja saama konstruktiivset kirjalikku ja suulist tagasisidet; (8) suhtleb töörühmaliikmetega saavutamaks ühiseid eesmärke ja osalemaks efektiivselt grupitöös."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}