{"uuid": "7186e8a4-07df-f6ea-ad54-fd99b8f5065f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T18:08:14", "title": {"en": "Biogeography", "et": "Biogeograafia"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM04", "name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "webpage_url": "https://zooloogia.ut.ee", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM04", "structural_unit_name": {"en": "Department of Zoology", "et": "zooloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "hours": {"lecture": 36, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course gives an overview about the modern biogeography as a highly interdisciplinary research field and introduces the main biogeographical concepts (such as biomes, biogeographical regions, the patterns of distribution of species and communities etc.) and processes (speciation, extinction, dispersal).", "et": "Biogeograafia kui kaasaegse evolutsioonilise ja ökoloogilise teaduse olemus. Maa elukeskkonna jaotus, bioomid ja biogeograafilised regioonid. Biogeograafilised protsessid: liikide teke, väljasuremine ja levimine. Liikide ja koosluste leviku seaduspärad."}, "objectives": [{"en": "To review the basic principles and research problems in biogeography as well as processes affecting the\ndistibution of organisms and formation of communities", "et": "Anda ülevaade biogeograafia põhimõistetest ja uurimisprobleemidest ning organismide geograafilist levikut ja koosluste kujunemist mõjutavatest protsessidest"}], "learning_outcomes": [{"en": "After finishing the course successfully, the student can give an overview of the main trends and rules concerning geographic distribution and dispersal of organisms, has a knowledge of the main terms used in the biogeographic literature, can give an overview of the main research topics concerning distribution and dispersal of organisms, can raise, analyse and critically evaluate the hypotheses in the field of biogeography, can give an overview of the main methods and techniques that are used in biogeography, can apply the knowledge related to the distribution and dispersal of animals in the other fields (e.g. in conservation biology).", "et": "Õppeaine edukal läbimisel\n1) oskab üliõpilane anda ülevaate organismide leviku seaduspärasustest ja neid kujundavatest protsessidest\n2) on kursis biogeograafilises kirjanduses kasutatavate põhimõistetega\n3) oskab esitada organismide leviku ja levimisega seotuid tähtsamaid uurimissuundi\n4) oskab püstitada, analüüsida ja kriitiliselt hinnata biogeograafilisi hüpoteese\n5) omab ülevaadet biogeograafias kasutatavatest peamistest meetoditest ja tehnikatest\n6) oskab rakendada organismide leviku ja levimisega seotud teadmisi teistes valdkondades (näiteks looduskaitses)."}], "notes": {"et": "Täpsem info kursuse kohta, osalejate Moodle'isse kandmine ja ettekandeteemade loosimine toimub kevadsemestri alguses."}}, "grading": {"independent_work": {"et": "*\tLoenguettekanne (üks ettekanne rühmatööna kolmele õppurile teadusartikli põhjal loengutes 2-13, artikli saab valida vastava loengu kaustast kursuse moodle'ist, loengu saab valida rühmavaliku kaudu; 2. loengus artikli kaitsmine ja oponeerimine annab 2 lisapunkti, 3. loengus 1 lisapunkt).\n*\tOponeering (üks oponeering rühmatööna kahele õppurile teadusartikli põhjal loengutes 2-13, artikli valivad kaitsjad).\n*\tMaismaabioomi ja bioomisisese piirkonna ettekanne (üks ettekanne rühmatööna kahele õppurile etteantud maismaabioomide hulgast valitud bioomi(de) ja seda bioomi sisaldava vabalt valitud piirkonna taimestiku, loomastiku ja biogeograafia kohta). \n*\tIseseisev töö: \n-\tenne igat loengut (va esimene loeng!) iseseisev tutvumine loenguslaididega (kursuse moodle'is üleval hiljemalt loengueelse päeval kell 17.00), mille tulemuseks on vähemalt üks teema/ aspekt slaididelt, mis teie arust vajaks selgitamist või on nii huvitav, et vajaks täiendavat avamist ning aspekt(id), mis on selge(d) ja täiendavat selgitamist ei vaja (juhul kui selliseid on)."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teadusartikli kokkuvõte - kaitsmine. Kursusel osalejad esitavad rühmatööna (kolmeliikmelised rühmad, kõik rühmad kaitsevad ühte tööd) enne loenguid 2-13 kirjalikult loenguteemaga seotud hiljutise teadusartikli kokkuvõtte (seis valdkonnas enne uurimust, uurimuse eesmärk, millist lünka uurimus täidab, põhitulemused, järeldused), kannavad selle loengus ette (5-10 minutit), vastavad oponentide küsimustele ja diskuteerivad oponentide ning auditooriumiga artikli teemal. Edukas esitus annab 10 punkti igale rühma liikmele. Teemad loositakse välja kevadsemestri alguses, konkreetse artikli saab valida mitmete väljapakutud artiklite hulgast."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teadusartikli kokkuvõte - oponeerimine. Kursusel osalejad esitavad rühmatööna (iga rühm ühe korra) enne loenguid 2-13 kirjalikult loenguteemaga seotud hiljutise teadusartikli retsensiooni (uurimuse tugevad küljed, nõrgad küljed, vähemalt kolm küsimust), kannavad selle loengus ette (kuni 6 minutit) ja väitlevad kaitsja(te)ga. Edukas oponeering annab 8 punkti igale rühma liikmele. Teemad loositakse välja kevadsemestri alguses, konkreetse artikli valivad mitmete väljapakutute hulgast kaitsjad."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Ettekanne etteantud bioomi vabalt valitud piirkonna biogeograafiast. Kursusel osalejad peavad rühmatööna (iga rühm ühel korral) 6.-13. loengus 8-12 minutilise ettekande organismide levikust, levimisest ja/või muudest biogeograafiaga seotud aspektidest enda poolt valitud piirkonnas, mis jääb etteantud bioomi piiresse. Bioomid ja ettekandmise ajad loositakse välja kevadsemestri alguses. Edukas ettekanne annab 17 punkti igale rühma liikmele."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Eksam koosneb valikvastustega küsimustest (kogu materjali, sh ettekannete kohta) ja pikematest küsimustest (loengutes käsitletud materjal). Eksam annab kuni 65 punkti."}}], "min_points_from_tests": 0, "grade_preconditions": {"et": "Iseseisev töö (kaitsmine, oponeering, bioomiettekanne) annab 35 punkti (sajast). Eksam annab 65 punkti ja ilma iseseisvat tööd tegemata on maksimumhindeks D."}, "grade_evaluation": {"et": "*\tEksam (kuni 65 puntki): loengumaterjalid + ettekannete materjalid; Kokku kuni 65 punkti - testiosa 35 punti (14 4-variandiga küsimust, üks vastus õige), pikad küsimused 30 punkti (3 küsimust).;\n*\tArtikli kaitsmine (kolmeliikmelistes rühmades rühmatööna, 10 punkti rühmaliikme kohta);\n*\tOponeering (kolmeliikmelistes rühmades rühmatööna, 5 punkti rühmaliikme kohta);\n*\tBioomi & bioomisisese piirkonna ettekanne (kolmeliikmelistes rühmades rühmatööna, 20 punkti);\n*\tA > 90,5p; B: 80,5 - 90p; C: 70,5 - 80p; D: 60,5 - 70p; E: 50,5 - 60p; F < 50p"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga on võimalik ettekande esitamise aega nihutada, pärast loengute lõppu ettekandeid järele teha ei saa. Eksamit on võimalik järele teha järeleksamil."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "3f9a8665-e1b1-46d0-8675-e62defb101af", "type": "MOODLE", "code": "LTOM.04.008", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Loenguslaidid.", "recommended_materials": "Lomolino et al. 2010. Biogeography, 4th ed. Sinauer Associates Inc."}, "participants": {"lecturers": [{"person_uuid": "968baa81-a762-f82a-dbb9-a2244f54b515", "person_name": "Toomas Esperk", "structural_unit": {"code": "LTOM04EN", "name": {"en": "Chair of Entomology", "et": "entomoloogia õppetool"}, "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM04"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}}, "parent_uuid": "6a386077-3d9a-4c97-93af-eaed1d43e753", "parent_code": "LTOM.04.008", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}