{"uuid": "053d4875-2bfa-7d19-6949-4a99598cf29c", "code": "LTOM.02.030", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Demography, Global Migration and Contemporary Cities", "et": "Demograafia, globaalne ränne ja linnad"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will combine international perspective to migration with the local demographic processes, and place European and Estonian urban trends within the context of the global urbanization. The main migration and demographic approaches and concepts will be discussed: types of migration and intra-urban residential mobility,  socio-economic and ethnic segregation, lifecourse theories, transnationalism. Practical exercises and discussions will be carried out during the course, with an aim to develop students' analytical skills and capabilities to independently carry out fieldwork in the field of urban geography. Different pedagogic methods will be applied to combine individual exercises with teamwork, discussion seminars with lectures. During the course meetings will be organized with the key persons among Estonian urban and immigration policy implementors. In this way students will be able to combine theoretical knowldedge with the practical outputs. The course will partly be carried out in combination with a related course \"Demography and Urban Social Geography\" (4EAP, LOOM.02.341) within the Master programmes in the field of human geography. The mix of students with different backgrounds in both courses provides added value to the study outputs.", "et": "Kursuse raames seotakse rahvusvahelise rände makroperspektiiv lokaalsete rahvastiku- ja linna arengu protsessidega ning paigutatakse Euroopa ja Eesti linnade trendid globaalsesse linnastumise konteksti. Käsitletakse järgmisi rände ja demograafia lähenemisi ja põhikontseptsioone: erinevad rände- ja elukohamobiilsuse tüübid, sotsiaalmajanduslik ja etniline segregatsioon, elukaare teooriad, hargmaisus. Aine käigus viiakse läbi praktilisi harjutusi ja arutelusid, mille eesmärk on arendada üliõpilaste analüüsioskusi ja võimet iseseisvalt läbi viia linnageograafilisi uurimistöid. Rakendatakse erinevaid pedagoogilisi võtteid, kombineerides individuaalseid töid meeskonnatööga, aruteluseminare loengutega. Kursuse käigus kohtutakse Eestis linnapoliitikaid kujundavate ja pagulaste integreerumist korraldavate võtmeisikutega, tugevdades nii üliõpilaste võimet siduda teoreetilisi teadmisi praktiliste väljunditega.\nÕppeaine põhiosa (4EAP) õpetatakse koos TÜ geograafia osakonna eestikeelse magistriõppekava ja ingliskeelse magistriõppekava \"GIS in urbanized society\" tudengitele (aine \"Demography and Urban Social Geography\", 4EAP, LOOM.02.341). Selliselt osalevad aines väga erineva geograafilise tausta ja linnalise kogemusega tudengid."}, "objectives": [{"en": "The aim is to get overview of the global population trends and their relationship to urban development and planning", "et": "Aine eesmärk on anda ülevaade globaalsetest rahvastikutrendidest ja nende seostest linnade arengu ja planeerimisega."}], "learning_outcomes": [{"en": "After completing the course the student will                                                          ", "et": "Kursuse läbinu"}, {"en": "1) understand the development of global population trends in different regions of the globe;                                                                                                    ", "et": "1) saab aru, kuidas kujuneb linnade rahvastik erinevates maailma regioonides;"}, {"en": "2) understand the relationship between migration, social inequalities and urban spatial segregation;                                                                                                                              ", "et": "2) saab aru, kuidas on omavahel seotud ränne, sotsiaalne ebavõrdsus ja ruumiline segregatsioon;"}, {"en": "3) know the main concepts in demography, migration and segregation            ", "et": "3) valdab demograafia, rände ja segregatsiooni valdkonna põhikontseptsioone;"}, {"en": "4) obtain analytical skills in the field, including composing population forecast, measure segregation and evaluate life quality in urban neighbourhoods;", "et": "4) omab valdkonna analüütilisi oskusi, sh oskab koostada rahvastikuprognoose, mõõta segregatsiooni ning hinnata linnanaabruskondade elukvaliteeti."}, {"en": "5) reflect on the differences and common values shaping migrant integration across cultures and societies", "et": "5) oskab arutleda erinevuste ja sarnaste väärtuste üle erinevates kultuurides ja ühiskondades"}, {"en": "6) be able to place Estonia and Europe among the global framework of urbanization and migration trends;", "et": "6) oskab paigutada Eesti ja Euroopa eri regioonide linnade arengu globaalsesse linnastumise ja rändevõrgustike konteksti, sh oskab eristada erinevaid rahvusvahelisi rändevooge ja mõistab nende mõju linnadele;"}, {"en": "7) obtain practical knowledge on urban and migration policy.", "et": "7) on saanud praktilisi teadmisi linnapoliitikate ja rändepoliitika kujundamisest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}