{"uuid": "e3c1f10c-5bcf-60ed-1af4-2834d4b9f111", "code": "LTOM.02.055", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 30, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The MSc thesis is an independent written work that is based on an experimental and theoretical scientific research.\n\nMaster's seminars based on independent assignments will support the composition of Master's thesis. During the first three semesters, the student will present three assignments and actively participate in at least 66% of the seminars, analysing and giving feedback to fellow students' presentations.\n\nIn Part 1 (1EAP) the student will write a popular science paper based upon a master's thesis defended at the Dept. Geography, UT. In addition, the student must actively participate in at least 66% of the seminars. Here and hereafter, the listener has a duty to ask questions, comment and make suggestions to the presented papers.\n\nIn Part 2 (1EAP), the student will present the study plan of her/his master's thesis in 10-15 minutes. The study plan must contain the following parts: 1. theoretical introduction (including relevance of topic, its relationship with the research field, and previous literature), 2. objective (including its theoretical and practical motivation), 3. material, and 4. methods. In addition, the student must participate in at least 66% of the seminars, analysing and giving feedback to the fellow students' presentations.\n\nIn Part 3 (1EAP), the student will present in 15-20 minutes either her/his thesis's full theoretical introduction or demonstrate the material and methods. In addition, the student must participate in at least 66% of the seminars, analysing and giving feedback to the fellow students' presentations.\n\nA pre-defence will take place a month before the official defence. For this purpose, the student will present a draft Master's thesis to the responsible lecturer one week before the scheduled pre-defence. At the pre-defence, the student will present a 15-minute talk, after which she or he will receive feedback from a pre-reviewer, the fellow students and lecturers.", "et": "Magistritöö on eksperimentaalse ja teoreetilise teadusliku uurimuse põhjal koostatud iseseisev kirjalik töö.\n\nMagistritöö valmimise protsessi toetavad erinevate iseseisvate töödega seminarid. Kolme esimese semestri jooksul on vaja üliõpilasel teha kolm iseseisvat tööd ning osaleda aktiivselt vähemalt 66% seminaridest, analüüsides kaastudengite töid.\n\nSeminari esimeses osas (1 EAP) tuleb koostada populaarteaduslik artikkel ühe geograafia osakonnas kaitstud magistritöö põhjal ning analüüsida kaasüliõpilaste töid. Lisaks tuleb osaleda aktiivselt vähemalt 66% seminaridest. Siin ja edaspidi on kuulaja kohustus esitada küsimusi, kommentaare ja soovitusi.\n\nSeminari teises osas (1 EAP) tuleb esitada oma magistritöö uurimiskava 10-15 min. ettekandena, mille kohustuslikud osad on 1. teoreetiline sissejuhatus (sh. teema olulisus, seos teadusvaldkonnaga ja varasem uuritus), 2. eesmärk (sh. selle teoreetiline ja praktiline põhjendus), 3. andmestik ja 4. metoodika. Lisaks tuleb osaleda aktiivselt vähemalt 66% seminaridest, analüüsides ja tagasisidestades kaasüliõpilaste ettekandeid.\n\nSeminari kolmandas osas (1 EAP) tuleb esitada põhjalik 15-20 min. ettekanne oma magistritöö teoreetilisest sissejuhatusest või esitleda andmestikku ja metoodikat. Lisaks tuleb osaleda aktiivselt vähemalt 66% seminaridest, analüüsides ja tagasisidestades kaasüliõpilaste ettekandeid.\n\nKuu aega enne magistritöö kaitsmist toimub eelkaitsmine. Selleks saadab tudeng nädal enne eelkaitsmist vastutavale õppejõule magistritöö mustandi. Eelkaitsmisel tuleb esitada 15 min. ettekanne, mille järel saab tagasisidet eelretsensendilt, kaastudengitelt ja õppejõududelt."}, "objectives": [{"en": "There will be created conditions that are needed for understanding specifics of the research in a certain speciality, for carrying out research work, and for presenting results.", "et": "Luuakse tingimused ülevaate saamiseks erialase uurimistöö spetsiifikast ning vastavasisulise uurimistöö läbiviimisest ja tulemuste esitamisest."}], "learning_outcomes": [{"en": "Within the framework of the compilation of Master's thesis, the student must participate in Master's seminars. The student will possess the following skills after the seminars: ", "et": "Magistritöö koostamise raames peab tudeng osalema magistriseminarides. Selle tulemusena üliõpilane: "}, {"en": "1) knows how to write a popular science paper; ", "et": "1) oskab koostada populaarteaduslikku artiklit;"}, {"en": "2) designs and manages the progress of her/his thesis;", "et": "2) kavandab ja juhib oma magistritöö käiku;"}, {"en": "3) knows how to present ongoing research;", "et": "3) oskab esitleda tegemisel olevat teadustööd; "}, {"en": "4) knows how to give feedback to ongoing research;", "et": "4) oskab tegemisel olevale teadustööle anda tagasisidet;"}, {"en": "5) has an overview of master-level research at the Department of Geography.", "et": "5) evib ülevaadet geograafia osakonna magistritaseme teadusest."}, {"en": "As a result of the defence the student:", "et": "Lõputöö kaitsmise tulemusena üliõpilane:"}, {"en": "1) can apply acquired knowledge in formulating scientific problems, in planning and conducting research, in making conclusions based on collected data, and in presenting results in written and oral form,", "et": "1) oskab rakendada omandatud teadmisi teadusprobleemide sõnastamisel, vastavate uuringute planeerimisel ja läbiviimisel, kogutud andmete põhjal järelduste tegemisel ning nende kirjalikul ja suulisel esitamisel;"}, {"en": "2) is able to find and analyse scientific information and can synthesise new knowledge for the speciality based on the previously available and collected scientific data,", "et": "2) oskab leida ja analüüsida teaduslikku infot ning suudab sellest ja enda poolt kogutud teaduslikest andmetest sünteesida uusi erialaseid teadmisi;"}, {"en": "3) have skills for composing and conducting a presentation in public and to express himself/herself in his/her speciality in written and oral form and to defend his/her thoughts,", "et": "3) oskab koostada ja pidada avalikku ettekannet ning end väljendada oma erialal nii suuliselt kui ka kirjalikult ja kaitsta oma seisukohti;"}, {"en": "4) understands the basic principles of ethics of science and is able to evaluate scientific value and applicability of studies in his/her speciality.", "et": "4) tunneb teaduseetika üldprintsiipe ning oskab hinnata oma valdkonna uuringute teaduslikku taset ja rakenduslikku väärtust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}