{"uuid": "dd27e64a-6609-6bd0-ca4f-3674b0f4c3de", "code": "LTOM.00.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice", "et": "Praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students will undergo practical training in the workplace or in the laboratory or as a  teaching assistant in a subject. Afterwards, a tutor will help analyzing and assessing problem situations and solutions found by the student, further study and career options in this field will be analyzed.", "et": "Üliõpilased läbivad praktika töökohal või laboris või õppeassistendina mõne õppeaine juures, kus töötamiseks on vajalikud õpitaval erialal omandatud teadmised ja oskused. Ülikoolipoolse juhendajaga analüüsitakse praktikal lahendatud probleemsituatsioone ning antakse hinnang üliõpilase poolt leitud lahendusstrateegiatele; analüüsitakse õpi -ja karjäärivõimalusi selles valdkonnas ning sellest lähtuvalt tehakse edasisi valikuid."}, "objectives": [{"en": "The subject is designed to offer the student the opportunity to acquire practical professional experience (1) in  the company; (2) as a teaching assistant for some other subject (3) in the various laboratories of the University of Tartu. During the practical experience the student can evaluate if his/her current skills are at the needed level and is aware of his/her future carrier opportunities.", "et": "Aine eesmärk on pakkuda tudengile võimalust omandada praktilise erialase töö kogemust (1) ettevõttes;  (2) õppeainete assistendina; (3) erinevates Tartu Ülikooli laborites. Üliõpilane saab praktikal olles ülevaate oma teadmiste vastavusest ja taseme sobivusest, tulevase karjääri võimalustest sel alal ja edasise enesearengu vajadustest."}], "learning_outcomes": [{"en": "After passing the subject, student: (1) is either able to find a company / lab to gain professional experience in the chosen professional field or subject, where teaching assistant is needed; (2) can plan his/her practical work schedule and understand the aims of the practical work; (3) is able to gain practical work experience outside the academic environment in the chosen specialty or acquire team-working skills as a teaching assistant; (4) is able to work in a team; (5) is able to adapt to the daily work routines; (6) has an overview of a particular institution/company, its operating environment, and career opportunities in this institution, as well as company-specific practical aspects of corporate governance; (7) is able to give a report about his/her activities in the company: problem setup, goals of the training, specific task of the trainee, the results of work; (8) is able to analyze what practical knowledge can he/she apply in his/her following career/job; (9) is able to make career choices (finds suitable specialization, topic for thesis, or a job); (10) is able to do periodic self-reflection about his/her practical work experience and career-plans.", "et": "Aine läbinud üliõpilane: (1) oskab leida ettevõtte/labori praktilise erialase töö kogemuse saamiseks valitud erialases valdkonnas või õppeaine, mille juures õppeassistendina töötada; (2) oskab planeerida oma praktikat ja mõtestada, mida soovib praktika kaudu õppida; (3) omandab praktilise töö kogemuse väljaspool akadeemilist keskkonda valitud eriala valdkonnas või omandab meeskonnatöö tegemise oskused õppeassistendina; (4) oskab töötada meeskonnas; (5) oskab kohaneda igapäevase töörutiiniga; (6) omab ülevaadet konkreetsest asutusest/ettevõttest, selle töökeskkonnast ja karjäärivõimalustest selles asutuses, (7) anda ülevaadet oma rollist antud asutuses: ülevaade probleemist, praktika eesmärgid, praktikandi spetsiifilised ülesanded, töötulemused; (8) oskab analüüsida, mida saab tudeng praktikal õpitust tulevikus enda karjääriteel/tööelus rakendada; (9) teeb praktika kogemuse kaudu teadlikke karjäärivalikuid (lõputöö teema valik, edasised õpingud, töö valik) ja astub konkreetseid samme selle suunas; (10) oskab teha perioodilisi enesereflektsioone praktika ja karjääriplaanide kohta."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}