{"uuid": "aa68a26d-744b-d305-5fc0-bfcbec1c84d8", "code": "LTOM.05.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Genetics and Evolution for Teachers", "et": "Geneetika ja evolutsioon õpetajatele"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of the most important topics and regularities of basic school and upper secondary school genetics and bioevolution in the amount corresponding to the biology curriculum of general education schools, comparing them analytically and substantiating their interrelationships. Critical thinking is promoted to ensure the development of science-based understandings and the recognition of pseudoscientific views and rebuttal skills. An overview of professions that would facilitate the choice of genetics and evolutionary disciplines in career choice .", "et": "Õppeaines antakse ülevaade üldhariduskooli bioloogia ainekavale vastavas mahus põhikooli ja gümnaasiumiastme geneetika ning bioevolutsiooni tähtsamatest teemadest ning seaduspärasustest, neid analüütiliselt võrreldes ja nende omavahelisi seoseid põhjendades. Arndatakse kriitilist mõtlemist, tagamaks teaduspõhiste arusaamade kujunemine ja pseudoteaduslike seisukohtade äratundmine ning ümberlükkamise oskuse. Antakse ülevaade elukutsetest, mis karjäärivalikus soodustaksid geneetika ja evolutsiooniga seotud erialade valikut."}, "objectives": [{"en": "To give an overview of the topics of genetics and evolution in basic school and high school. To introduce the regularities of classical genetics, the molecular-genetic bases of heredity and the nature of hereditary and non-hereditary variability, the laws of inheritance and hereditary diseases and genetically modified organisms. Develop critical and analytical thinking to ensure the development of a science-based biological worldview and the ability to refute pseudoscientific views. Understands the close connection between the evolution of genetics and the role of evolution in the formation of wildlife. Professions related to genetics and evolution will be introduced so that they can be taken into account in career choices.", "et": "Anda ülevaade geneetika ja evolutsiooni teemadest põhikoolis ja gümnaasiumis. Tutvustada klassikalise geneetika seaduspärasusi, pärilikkuse molekulaar-geneetililisi aluseid ning päriliku ja mittepärilku muutlikuse olemust, pärandusmise seaduspärasusi ning pärilikke haigusi ning geneeetiliselt muundatud organisme. Kujundada kriitilist ja analüütilist mõtlemist, et tagada teaduspõhise bioloogilise maailmavaate kujunemine ja pseudoteaduslike seisukohtade ümberlükkamise oskus. Mõistab geneetika evolutsiooni tihedat seost ning evolutsiooni rolli eluslooduse kujunemisel. Tutvustatkse geneetikaga sja evolutsiooniga seotud elukutseid, et neid saaks arvestada karjäärivalikutes."}], "learning_outcomes": [{"en": "1. Knows the basic standpoints of lower and upper secondary school biology curricula of genetics;", "et": "1. Tunneb põhikooli ja gümnaasiumi bioloogia kursustes käsitletavaid geneetika põhiseisukohti;"}, {"en": "2. Knows basic standpoints of lower and upper secondary school biology curricula of evolution and understands the mechanisms of biological evolution;", "et": "2. Mõistab evolutsiooniteooria kujunemist ja evolutsiooni põhiseisukohti;"}, {"en": "3. Understands the relationships between genetics and evolution;", "et": "3. Suudab analüüsida geneetika ja evolutsiooni omavahelisi seoseid;"}, {"en": "4. Has obtained a science-based biological worldview and is able to distinguish between scientific and pseudoscientific positions in fields related to biology.", "et": "4. On teaduspõhise bioloogilise maailmavaaatega ning suudab eristada teaduslikke ja pseudoteaduslikke seisukohti bioloogiaga seotud valdkondades."}, {"en": "5. Has gained an overview of professions related to genetics and evolution and is able to popularize them as career choices.", "et": "5. On saanud ülevaate geeetikaga ja evolutsiooniga seotud elukutsetest ning suudab neid populariseerida elukutsevalikutena."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}