{"uuid": "71529414-6656-ee7b-4dbe-e57f7e81b6ae", "code": "lt-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-14T15:14:56", "title": {"en": "Geotechnical Engineering Project", "et": "Ehitusgeoloogia projekt"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course is composed of four separate modules: 1. lectures; 2. fieldwork; 3. compilation of an engineering geology investigation report; 4. laboratory practicum.\n1. Theoretical and guest lectures. The theoretical lectures address the basic investigation methods in engineering geology and the key physical and mechanical properties of soils. The guest lectures provide insight into the everyday life of engineering geologists.\n2. Fieldwork. The students visit real fieldwork with an engineering geology company to study the main investigation methods and to collect soil samples for laboratory practicum if possible. The fieldwork visit lasts at least four hours, and it probably takes place outside the fixed schedule. The time of visit is scheduled with the students. The students have to compile a short report about the fieldwork\n3. Engineering geology investigation report. The students compile an investigation reported using data provided by the lecturer. The data is complemented by information collected by the students from digital spatial information databases. The most important results are presented in a seminar.\n4. Laboratory practicums. Three laboratory tasks include the determination of different soil properties and solving a practical problem related to these properties.\nThe modules take place in parallel. Most of the curriculum is accomplished independently under the guidance of specialists. The internship takes place in an intra-university learning environment, but the students have to take the role of a specialist and a laboratory assistant. During the internship, students solve real engineering geology problems following the accepted regulations and standards of the industry. As a result of the course, a report of a construction geological survey, a report of fieldwork, and tasks solved on the basis of laboratory internships are presented, to which the student receives feedback to enable him to analyze the professional experience gained.", "et": "Aine koosneb neljast eraldiseisvast moodulist: 1. loengud; 2. välitöö; 3. ehitusgeoloogilise uuringu aruande koostamine: 4. laboripraktikumid.\n1. Loengud. Teooria- ja külalisloengud. Teoorialoengutes käsitletakse insenergeoloogia uurimismeetodeid ning tähtsamaid pinnase füüsikalisi ja mehaanilisi omadusi. Külalisloengutes esinevad valdkonna praktikud.\n2. Välitöö. Külastatakse ehitusgeoloogia ettevõtte poolt läbi viidavat reaalset välitööd, kus tutvutakse peamiste uuringumeetoditega ja võetakse võimalusel pinnaseproove laboripraktikumide jaoks. Välitöö külastus kestab vähemalt neli tundi ja toimub tõenäoliselt väljaspool loenguaegu. Aeg lepitakse osalejatega eelnevalt kokku. Välitöö kohta koostatakse lühiraport.\n3. Ehitusgeoloogilise uuringu aruande koostamine. Etteantud andmete ja digitaalsetest andmebaasidest-rakendustest kogutud info põhjal koostatakse aruanne ning kantakse tähtsamad tulemused seminaris ette.\n4. Laboripraktikumid. Kolmes laboripraktikumis määratakse pinnaseomadusi ja lahendatakse vastavate omadustega seotud praktiline ülesanne.\nMoodulid toimuvad osaliselt paralleelselt. Suurema osa aine mahust moodustab iseseisev töö erialaspetsialistide juhendamisel. Praktika toimub ülikoolisiseses õppekeskkonnas, kuid üliõpilasel on täita tavapärasest erinev roll spetsialisti ja laborandina. Praktika käigus lahendavad üliõpilased reaalseid ehitusgeoloogia ülesandeid, järgides valdkonna regulatsioone ja standardeid. Kursuse tulemusena esitatakse ehitusgeoloogilise uuringu aruanne, välitööde raport ja laboripraktikumide põhjal lahendatud ülesanded, millele üliõpilane saab tagasidet, et võimaldada tal analüüsida saadud erialast kogemust."}, "objectives": [{"en": "1. To provide students knowledge about geological factors and properties of soils and rock that influence planning and building activities.", "et": "1. Anda üliõpilasele teadmised geoloogilistest teguritest ja pinnaste-kivimite omadustest, mis mõjutavad ehitustegevust ja planeeringuid."}, {"en": "2. To provide students with know-how on how to convert theoretical knowledge into practical skills by preparing engineering geology reports, performing a laboratory internship, participating in fieldwork, and solving practical engineering geology problems under the guidance of specialists.", "et": "2. Anda üliõpilastele oskused teoreetiliste teadmiste rakendamiseks läbi praktiliste ehitusgeoloogilise uuringu aruande koostamise, laboripraktikumide sooritamise, välitöödel osalemise ning erialaste probleemülesannete lahendamise erialaspetsialistide juhendamisel."}], "learning_outcomes": [{"en": "After completing the course, a student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Understands and can describe the main issues in engineering geology, the basic investigation methods, and their uses. A student employs theoretical knowledge in analyzing and solving engineering geological problems in specific geological and hydrogeological conditions.", "et": "1. Tunneb ja oskab kirjeldada peamisi insenergeoloogilisi probleeme, uuringumeetodeid ja nende kasutusvõimalusi. Oskab teoreetilisi teadmisi rakendada, analüüsides ja lahendades konkreetsetes geoloogilistes ja hüdrogeoloogilistes tingimustes esinevaid insenergeoloogilisi probleeme."}, {"en": "2. Understands the concept and relations of physical and mechanical properties of soils, and can calculate soil properties that are used for construction design based on field- and laboratory studies.", "et": "2. Mõistab pinnase füüsikaliste ja mehaaniliste omaduste sisu ja omavahelisi seoseid, oskab projekteerimiseks vajalikke pinnaseomadusi väli- ja laborikatsete andmete põhjal arvutada."}, {"en": "3. Can find and organize relevant data from public digital spatial databases and combine this data with results of field- and laboratory studies. A student can compile a geotechnical model of the study area based on the gathered data.", "et": "3. Oskab otsida ja süstematiseerida vajalikku infot avalikest digitaalsetest ruumiandmete andmebaasidest ja rakendustest, kombineerida seda väli- ja laborikatsete tulemustega ja koostada konkreetse ala geotehniliste tingimuste mudelit."}, {"en": "4. Can draw digital logs, geological profiles, and location maps using drawing software.", "et": "4. Oskab joonestusprogrammi kasutades koostada digitaalseid uuringupunktide logisid, geoloogilisi profiile ning asendiplaani."}, {"en": "5. Can compile a systematized report based on the above-mentioned information, and point out the main results in an oral presentation.", "et": "5. Oskab eelnevates punktides nimetatud informatsiooni põhjal koostada ülevaatliku aruande ja tähtsamad tulemused ette kanda."}, {"en": "6. Has experience with the practical output of construction geology and is able to analyze and make sense of primary work experience.", "et": "6. Omab kokkupuudet ehitusgeoloogia praktilise väljundiga ja oskab esmast töökogemust analüüsida ja mõtestada."}, {"en": "7. Participates in laboratory group works.", "et": "7. Osaleb laboratoorsetes grupitöödes."}], "notes": {}}, "grading": {"independent_work": {"et": "Kõik vajalikud juhendid, algmaterjalid, tähtajad ja muu info on toodud Moodle keskkonnas; seal toimub ka ülesannete esitamine ning tagasiside saamine.\n1. Välitöö raport (10%). Külastatud ehitusgeoloogilise uuringu välitöö kohta tuleb koostada raport, mis sisaldab ülevaadet uuringuala asukohast, planeeritavast ehitisest, uuringute eesmärgist ja mahust, välitööde teostajast, välitöödel kasutatud metoodikast, lühiülevaadet uuritud pinnastest jms. Raporti koostamisel on abiks juhend, millega tuleb tutvuda enne välitööle minekut.\n2. Ehitusgeoloogilise uuringu aruanne (60%). Aruande koostamine toimub suures osas individuaalse tööna, lisaks toimuvad ühised arvutipraktikumid, kus tutvutakse erinevate veebipõhiste ruumiandmete andmebaaside ja rakendustega, õpitakse kasutama joonestusprogrammi Strater. Aruande koostamine on jagatud osadeks, mis tuleb jooksvalt Moodle keskkonnas esitada. Tähtaegselt esitatud osadele saab tagasisidet, mida aruande kokkupanekul arvesse võtta. Samuti on eelnevaid osasid vaja järgnevate ülesannete täitmisel, st eelneva etapi töö on aluseks järgmises etapis. Aruande hindamine toimub lõpus, kui kõik osad on kokku pandud, viimistletud ja seminaris ette kantud.\n3. Laboripraktikumid (3 x 10% = 30%). Kolmes laboripraktikumis tuleb geoloogia osakonna laboris juhendi järgi määrata erinevaid pinnaseomadusi ja iseseisva tööna lahendada vastava omadusega seotud praktiline ülesanne. \nLaboripraktikum 1: savipinnase plastsusomadused ja veesisaldus;\nLaboripraktikum 2: savipinnase kokkusurutavusomadused (kompressioonikatse ödomeetris);\nLaboripraktikum 3: liiva või segapinnase Proctori tihedus."}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Ehitusgeoloogilise uuringu välitöö külastamine ja raporti esitamine (10%). Hindamiskriteeriumid: Välitööde info on korrektselt ja täielikult dokumenteeritud, loogilise ülesehitusega ning sisaldab kõiki juhendis nõutud osasid."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Ehitusgeoloogilise uuringu aruanne (60%). Hindamiskriteeriumid: Kõik ettenähtud peatükid on olemas ja proportsioonis, aruande tekst on keeleliselt ladus ja korrektne, kõik kasutatud allikad on viidatud. Etteantud välitööde ja laborikatsete andmed on süstematiseeritud ja varasemate uuringute andmetega täiendatud, nende põhjal on koostatud uuringuala geotehniline kirjeldus. Ala üldine iseloomustus, välitööde metoodika ja maht on piisava põhjalikkusega esitatud, asjakohased probleemid on välja toodud ja lahendused koos põhjendustega välja pakutud, graafilised lisad on korrektsed, selgelt loetavad, pinnaseomadused on korrektselt arvutatud."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Laboripraktikum 1 (10%). Savipinnase plastsusomadused ja veesisaldus. Hindamiskriteeriumid: Laborikatsed on vastavalt juhendile läbi viidud, tulemused on laboriprotokollis dokumenteeritud ja nõutud näitajad on korrektselt arvutatud, arvutuskäigud ja valemid on välja toodud. Praktikumi teemaga seotud praktiline ülesanne on korrektselt lahendatud ning esitatud koos lahenduskäikude ja selgitustega."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Laboripraktikum 2 (10%). Savipinnase kokkusurutavusomadused (kompressioonikatse ödomeetris). Hindamiskriteeriumid: Laborikatsed on vastavalt juhendile läbi viidud, tulemused on laboriprotokollis dokumenteeritud ja nõutud näitajad on korrektselt arvutatud, arvutuskäigud ja valemid on välja toodud. Praktikumi teemaga seotud praktiline ülesanne on korrektselt lahendatud ning esitatud koos lahenduskäikude ja selgitustega."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Laboripraktikum 3 (10%). Liiva või segapinnase Proctori tihedus. Hindamiskriteeriumid: Laborikatsed on vastavalt juhendile läbi viidud, tulemused on laboriprotokollis dokumenteeritud ja nõutud näitajad on korrektselt arvutatud, arvutuskäigud ja valemid on välja toodud. Praktikumi teemaga seotud praktiline ülesanne on korrektselt lahendatud ning esitatud koos lahenduskäikude ja selgitustega."}}], "grade_preconditions": {"et": "Positiivse hinde saamiseks peab kõikide iseseisvate tööde eest saama vähemalt 50% punktidest."}, "grade_evaluation": {"et": "10% ehitusgeoloogilise uuringu välitööl osalemine ja lühiraporti koostamine\n60% ehitusgeoloogilise uuringu aruande koostamine etteantud andmete põhjal ja ettekandmine seminaris\n30% laboripraktikumid"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "b75c31d3-38aa-4819-8f95-4b81f5e365d8", "type": "MOODLE", "code": "LTOM.03.009", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "99db77b5-fffc-e1db-0f30-a62fd66b689c", "person_name": "Riho Mõtlep", "structural_unit": {"code": "LTOM06", "name": {"en": "Earth Resources Centre, University of Tartu", "et": "maapõueressursside arenduskeskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "7c00a220-62c5-00ac-1fa0-f7652e257973", "person_name": "Annette Talpsep", "structural_unit": {"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "n. 24-33"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus ainesse. Veebis."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ehitusgeoloogilised uuringud. Veebis."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: üldosa"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Olulisemad pinnaseomadused. Veebis."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: välitöö andmete süstematiseerimine. NB! Individuaaltööna. 25.02 on Moodles juhend kättesaadav. Ühist praktikumi ei toimu."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Külalisloeng (Urmas Uri, AS Kobras). Veebis."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: välitöö andmete süstematiseerimine. Veebis."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: jooniste tegemine"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Laboripraktikum I"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: jooniste tegemine"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Laboripraktikum II"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: pinnaste kirjeldamine, omaduste arvutamine"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Laboripraktikum III"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogilise aruande koostamine: eriprobleemid, lahendused"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Külalisloeng?"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Ehitusgeoloogia ettevõte poolt läbiviidava reaalse välitöö külastamine ja lühiraporti koostamine. \nAeg selgub."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ehitusegoloogilise uuringu aruannete ettekanded.\nAeg selgub."}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "d1f16291-025e-7a8d-c42e-d1008f32e25d", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "fe020629-5fac-4f18-8726-9318cb4616c0", "parent_code": "LTOM.03.009", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}