{"uuid": "597c4cb6-7628-8b9d-485c-e9997b022ac6", "code": "LTOM.02.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Social and Regional Planning", "et": "Sotsiaalne ja ruumiline planeerimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is divided into four sections: (a) spatial planning as a means to leading the way for change, (b) social expectations and values as the basis of spatial planning, (c) the dynamics between parties invlolved in planning and (d) putting the planning strategy into practice. In-person lectures, online lectures and independent reading materials provide a theoretical background and place Estonian planning practices onto an international comparison scale. Through different tasks, groups of 4-5 students will carry out an analysis of a local government Master Plan approved recently and elaborate policy recommendations for the respective municipality. Meetings in the auditorium are complemented by groups meeting via an online meeting platform (e.g. Miro). The mission of this course is to provide participants with a better understanding of how spatial planning plays out in real governance situations - how social values are brought into the planning process, and what is the role of every involved party in this process.", "et": "Kursus on jaotatud nelja tsüklisse: (a) ruumiplaneerimine kui muutuste juhtimine vahend, (b) ühiskonna ootused ja väärtused kui planeerimise alus, (c) ruumiplaneerimise osaliste dünaamika (kes teeb plaani) ja (d) planeeringust ruumimuutuseni (mis saab pärast plaani). Loengud, e-loengud ja iseseisev lugemine annavad teoreetilise tausta ja asetavad Eesti planeerimispraktika rahvusvahelisse võrdlusse. Läbi erinevate ülesannete viivad osalejad 4-5-liikmelistes gruppides läbi ühe valitud 2021. aastal valminud kohaliku omavalitsuse üldplaneeringu analüüsi ja töötavad välja selle KOVi planeerimisvaldkonna poliitikasoovitused. Kohtumised auditooriumis vahelduvad grippide e-õppe kohtumistega digitaalses koosloomekeskonnas (Miro vms. Kursuse peamine missioon on anda osalejatele tunnetus, kuidas toimub kohtade ruumiplaneerimine reaalses valitsemissituatsioonis - kuidas väärtuseid planeeringutesse ja ruumi viia ning milline on selles protsessis erinevate osapoolte roll."}, "objectives": [{"en": "The aim of the course is learning to think of social expectations through a spatial lens. The course will approach spatial planning as a means to lead change. We will learn to recognise opportunities for the currently dominating social values, in concurrence with various involved stakeholders and participants, to emerge into spatial planning decisions. Furthermore, we will practice critical evaluation of finalized planning documents and strategies as well as their long-term reliability, and prepare ourselves for creating spatial planning processes that are adaptable to the changing nature of social values.", "et": "Kursuse eesmärk on õppida ruumiliselt mõtestama sotsiaalseid ootusi. Ruumiplaneerimist käsitleme sellel kursusel kui muutuste juhtimise vahendit ja vahendajat. Õpitakse nägema võimalusi, kuidas ühiskonnas valitsevad väärtused jõuavad erinevate osaliste koosmõjus planeeringutesse ning ruumiotsusteni. Samuti õpime kriitiliselt hindama valmis planeeringute töökindlust ning valmistame ennast ette kujundama ruumiplaneerimise protsesse, mis suudavad ajas muutuvate väärtustega kohaneda."}], "learning_outcomes": [{"en": "After completing this course, the student is expected to: (1) understand the role of spatial planning in local and regional governance, and in leading and enabling social change; (2) identify the prevalence of widely established social values (or lack thereof) in spatial planning programmes and recognise the need for adaptability to changing social values; (3) is capable of accommodating spatial decisions with social expectations in a systematic, identifiable and inclusive way while taking different roles in the planning process; (4) is capable of critically analysing the reliability and performance of finalised spatial plans and spatial decisions outside the formal planning process.", "et": "Kursuse läbinu: (1)\tsaab aru, milline on ruumiplaneerimise roll koha ja regiooni valitsemisel, ühiskondlike muutuste juhtimisel ja võimaldamisel; (2) oskab planeeringutes ja ruumiotsustes ära tunda laiemaid ühiskonnas sõnastatud väärtusi, või nende puudumist, ning tunneb ära vajaduse ruumikorraldust muutuvate väärtustega kohandada; (3) suudab süsteemselt, äratuntavalt ja osapooli kaasavalt juhtida sotsiaalsete ootuste vahendamist ruumiotsustesse, olles seejuures planeerimisprotsessi erinevates rollides; (4) oskab kriitiliselt analüüsida valmis planeeringute toimimist ning valdab ruumilise sekkumise keelt ka väljaspool formaalset planeeringuprotsessi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}