{"uuid": "b982c8d4-acf5-7e94-a545-e69b2aff49bc", "code": "LTOM.02.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Economic Geography", "et": "Majandusgeograafia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM02", "structural_unit_name": {"en": "Department of Geography", "et": "geograafia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM02", "name": {"en": "Department of Geography", "et": "geograafia osakond"}, "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course discusses thoroughly the processes taking place in the spatial and temporal development of world economy. The course will give an overview of theories, geography and the changing organizational structure of globalizing world economy, concentrating especially on the analysis of the activities of international giant companies and world economy organizations. Development of new and most important branches of economy and the specificity and perspectives of important regions of world economy will be looked at more closely. Required literature includes the most recent information and analysis from the global organizations and media.", "et": "Kursus käsitleb maailma majanduse ruumilises ja ajalises arengus toimuvaid protsesse. Kursus annab ülevaate globaliseeruva maailma majanduse kultuuriliselt taustast, muutuvast organisatoorsest struktuurist ja geograafiast, keskendudes eriti rahvusvaheliste hiidettevõtete ja maailma majandusorganisatsioonide tegevuse analüüsile. Põhjalikuma vaatluse alla võetakse olulisemate majandusharude areng ning maailmamajanduse regioonide omapära ja perspektiivid. Kursuse lektüüri hulka kuulub värskeim info maailmaorganisatsioonidelt ja meediast."}, "objectives": [{"en": "The course is useful for teachers for better understanding of the economic processes in the world.", "et": "Vajalik õpetajatele maailmas toimuvate protsesside mõistmiseks."}], "learning_outcomes": [{"en": "Students will understand the main driving forces of the world economy and know most important theories analysing international economic processes, changing geography and futures trends.\nThe group work trains digging out new information and application for strategic analyse.", "et": "Kursuse läbinu mõistab maailma riikide ja regioonide majandust mõjutavaid protsesse: kultuuri, keskkonnategureid, demograafilist arengut, ettevõtete tegevust, riikide poliitikaid ja organisatsioonide tegevust. Üliõpilased tunnevad olulisemaid maailma majandust mõjutavaid teooriaid, maailma majanduse geograafia ajalugu ja olulisemaid tulevikku mõjutavaid trende. Harjutustööde raames õpitakse hankima uusimat infot ja seda rakendama strateegilise analüüsi tarvis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}