{"uuid": "a4f63e3a-b5e4-9bb1-49c0-9b03598ff29b", "code": "LTOM.03.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Mineral Resources of Future and Mining Technologies", "et": "Tulevikumaavarad ja -kaevandustehnoloogiad"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The main task of the course \" Mineral Resources of Future and Mining Technologies \" is to introduce potential future Earth resources in general and assess the Estonian resource potential. In this course resource criticality will be assessed and a brief introduction will be given into the future demand of technological metals in the progress of societal sustainability. Potential Estonian Earth resources will be introduced. The main exploration methods and mining technologies will be acquired. An overview about the natural and socio-economic principles of exploitation of Earth' resources will be provided.", "et": "Kursuse eesmärgiks on anda ülevaade tulevikumaavaradest üldiselt ja Eesti võimalustest selles vallas, defineerida kriitilise toorme olemus ja tutvustada säästvale arengule üleminekul olulisi metalle ja teisi maapõuevarasid. Õpitakse tundma Eesti potensiaalseid tulevikumaavarasid. Kursuse raames tutvustatakse põhilisi ja uusi maapõueressursside uuringumeetodeid ja võimalikke tuleviku kaevandamismeetodeid. Antakse ülevaade looduslikest ja sotsiaal-majanduslikest piirangutest maapõueressursside kasutamisel."}, "objectives": [{"en": "Overview about the future Earth resources, as a general approach and as in Estonian perspective, resource criticality and global policy, about the metals which are important in support of sustainable development, new exploration and mining technologies.", "et": "Ülevaade tulevikumaavaradest üldiselt ja Eesti võimalustest, kriitilisest toormest, globaalsest maavarapoliitikast, säästvale arengule üleminekul olulistest loodusvaradest, tehnoloogiatest, maavarade uuringute ja kaevandamise uutest lahendustest."}], "learning_outcomes": [{"en": "Successful student:", "et": "Aine läbinud tudeng:"}, {"en": "1. knows the most important future Earth' resources", "et": "1. Tunneb olulisi tulevikumaavarasid"}, {"en": "2. knows the concept of critical raw materials and assessment bases for Earth resources criticality", "et": "2. Teab kriitilise toorme kontseptsiooni ja ressursside kritikaalsuse aspekte"}, {"en": "3. knows the main trends of global natural resource policy", "et": "3. Tunneb põhilisi arengutrende globaalses maavarapoliitikas"}, {"en": "4. knows the main and new exploration methods and mining technologies", "et": "4. Teab põhilisi ja uusi uuringu- ja kaevandamismeetodeid"}, {"en": "5. knows potential future mineral resources of Estonia", "et": "5. Tunneb potensiaalseid Eesti tulevikumaavarasid"}, {"en": "6. knows geological and socio-economic principles of exploitation of natural resources", "et": "6. Teab loodusvarade kasutamise looduslikke ja sotsiaal-majanduslikke kriteeriume"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}