{"uuid": "3027761f-df09-7d26-d147-7af84d2bd6d0", "code": "lt-2018-autumn-fulltime-c3", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "The Human Anatomy and Physiology at School", "et": "Inimese anatoomia ja füsioloogia koolis"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "label": {"en": "18/19 A regular LT", "et": "18/19 S PÕ LT"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 8, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The overview of all of the human organ systems (epithelial system, bones and muscles, nervous system and senses, digestive system, respiratory and excretion system, reproduction and endocrine system) structure and physiology are given during the course. The human body is taught as a whole, the relationships between anatomical structures and their functions are taught. The most important regulation mechanisms of human body are dealt with and the practical works of human body and physiology are carried through. Critical and analytical thinking, problem solving and reasoned decision making are developed. Misconceptions and the possibilities of their prevention in the field of human anatomy and physiology are explained", "et": "Kursuses käsitletakse kõikide inimese organsüsteemide (katteelundkond, tugi- ja liikumiselundkond, närvisüsteem ja meelelundid, seedeelundkond, vereringeelundkond, hingamiselundkond,  erituselundkond, sigimiselundkond, sisenõreelundkond) ehitust ja talitlust. Käsitletakse inimese organismi kui tervikut, seostades inimese elundkondade anatoomilist ehitust nende ülesannetega ning tutvustatakse tähtsamaid inimese organismi regulatsioonimehhanisme. Antakse ülevaade tervislike eluviiside mõjust inimese organismile kui tervikule.  Kirjeldatakse peamiseid infovahetuse mehhanisme organismi ja keskkonna vahel. Viiakse läbi kooli tingimustes tehtavaid praktilisi töid anatoomia ja füsioloogia valdkonnas. Kujundatakse kriitilist ja analüütilist mõtlemist, probleemide lahendamist ning põhjendatud otsuste tegemist. Selgitatakse  väärarusaamasid ning ning nende ennetamise võimalusi inimese anatoomia ja füsioloogia valdkonnas."}, "objectives": [{"en": "To give an overview of the cells, tissues, organs and organ systems, their structure and physiology covered in basic school and upper secondary school biology courses. To introduce the person as a whole organism and to give an overview of the most important regulatory mechanisms of the person as a whole organism. Show the connections between construction and function and explain the physico-chemical background of life processes. To develop critical and analytical thinking, problem solving and reasoned decision making. To explain misconceptions and the possibilities of their prevention in the field of human anatomy and physiology.", "et": "Anda ülevaade põhikooli ja gümnaasiumi bioloogiakursustes käsitletavatest rakkudest, kudedest, organitest ning organsüsteemidest, nende ehitusest ja füsioloogiast. Tutvustada  inimest kui tervikorganismi ning anda ülevaade inimese kui tervikorganismi tähtsamatest regulatsioonimehhanismidest. Näidata seoseid ehituse ja talitluse vahel ning selgitada eluprotsesside füüsikalis-keemilist tausta. Kujundada kriitilist ja analüütilist mõtlemist, probleemide lahendamist ning põhjendatud otsuste tegemist. Selgitada väärarusaamasid ning ning nende ennetamise võimalusi inimese anatoomia ja füsioloogia valdkonnas."}], "learning_outcomes": [{"en": "1)\tknows all the human organ systems' structure and their physiology;", "et": "1) tunneb põhikooli ja gümnaasiumi bioloogiakursustes käsitletavaid tähtsamaid organsüsteeme ja nende füsioloogiat;"}, {"en": "2)\tunderstands the human body as a whole and knows the relationships between the structure and function of organs and organ systems;", "et": "2) mõistab inimese organismi kui tervikut ja mõistab eluviiside mõju organismile;"}, {"en": "3)\tKnows the most important regulation mechanisms of human body;", "et": "3)  teab tähtsamaid organsüsteemide regulatsioonimehhanisme;"}, {"en": "4) is able to think critically and analytically, use his or her knowledge in solving problems and making reasoned decisions;", "et": "4) oskab kriitiliselt ja analüütiliselt mõtelda, kasutada oma teadmisi probleemide lahendamiselning põhjendatud otsuste tegemisel;"}, {"en": "5) is able to elucidate misunderstandings and the possibilities of their prevention in the field of human anatomy and physiology.", "et": "5) oskab elgitada väärarusaamasid ning ning nende ennetamise võimalusi inimese anatoomia ja füsioloogia valdkonnas."}], "notes": {}}, "grading": {"independent_work": {"et": "Koostada esitlus ühest valitud inimese elundkonnast."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {}}], "grade_preconditions": {"et": "Loengutel osalemine,\nesitluse koostamine ja ette kandmine."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb vastavalt eksami tulemusele"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Bioloogia 9. klassile 1. osa  Avita\nBioloogia 9.klassile 2. osa. Avita\nBioloogia Gümnaasiumile III osa. Avita", "recommended_materials": "Nienstedt jt. (2005). Inimese füsioloogia ja anatoomia. Medicina"}, "participants": {"lecturers": [{"person_uuid": "da2fae6d-831e-0c4c-83a8-58c1e64ff041", "person_name": "Ana Valdmann", "structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "605668cf-5227-371d-419d-ea0f32a84402", "person_name": "Anne Laius", "structural_unit": {"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "9-16"}, "entries": [{"time": "2018-11-24", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus ainesse. Inimese elundkonnad ja nende ülesanded.\nNaha ehitus ja ülesanded.\nTugi- ja liikumiselundkond. Luude ja lihaste osa inimese ning teiste selgroogsete loomade tugi- ja liikumiselundkonnas. Luude ehituse iseärasused. Luudevaheliste ühenduste tüübid ja tähtsus. Inimese luustiku võrdlus teiste selgroogsete loomadega. Lihaste ehituse ja talitluse kooskõla. Luu- ja lihaskoe mikroskoopiline ehitus ning selle seos talitlusega. Treeningu mõju tugi- ja liikumiselundkonnale. Luumurdude, lihasvenituste ja -rebendite olemus ning tekkepõhjused."}}, {"time": "2019-01-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seedimine ja eritamine. nimese seedeelundkonna ehitus ja talitlus. Organismi energiavajadust mõjutavad tegurid. Tervislik toitumine, üle- ja alakaalulisuse põhjused ning tagajärjed. \nHingamiselundkonna ehituse ja talitluse seos. Sisse- ja väljahingatava õhu koostise võrdlus. Hapniku ülesanne rakkudes. Organismi hapnikuvajadust määravad tegurid ja hingamise regulatsioon. Treeningu mõju hingamiselundkonnale. Hingamiselundkonna levinumad haigused ning nende ärahoidmine.Põhimõisted: hingetoru, kopsutoru, kopsusomp, hingamiskeskus, rakuhingamine.rude üldine tööpõhimõte vere püsiva koostise tagamisel. Kopsude, naha ja soolestiku eritamisülesanne.\n\n\nHingamiselundkond ja selle ülesanded."}}, {"time": "2019-01-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Vereringeelundkond ja selle ülesanded. Südame ning suure ja väikese vereringe osa inimese aine- ja energiavahetuses. Inimese ning teiste imetajate vereringeelundkonna erisused võrreldes teiste selgroogsete loomadega. Erinevate veresoonte ehituslik ja talitluslik seos. Vere koostisosade ülesanded.\nVere osa organismi immuunsüsteemis. Immuunsuse kujunemine: lühi- ja pikaajaline immuunsus. Immuunsüsteemi ja vaktsineerimise osa bakter- ja viirushaiguste vältimisel. Immuunsüsteemi häired, allergia, AIDS. Treeningu mõju vereringeelundkonnale. Südamelihase ala- ja ülekoormuse tagajärjed. Veresoonte lupjumise ning kõrge ja madala vererõhu põhjused ja tagajärjed\nNärvisüsteem ja meeleelundid. Humoraalne regulatsioon."}}, {"time": "2019-01-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Inimese paljunemine ja areng. Mehe ja naise suguelundkonna ehituse ning talitluse võrdlus. Muna- ja seemnerakkude küpsemine. Suguelundkonna tervishoid, suguhaiguste levik, haigestumise vältimise võimalused. Munaraku viljastumine, loote areng, raseduse kulg ja sünnitus. Pere plaanimine, abordiga kaasnevad riskid. Inimorganismi talitluse muutused sünnist surmani.\nEksam"}}]}, "registration_info": {"audience": {"et": "Gümnaasiumi loodusteaduste õpetaja"}, "min_students": 5}, "parent_uuid": "8406881b-79e9-10e4-5955-7bdab9403870", "parent_code": "LTOM.05.005", "parent_credits": 3, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}