{"uuid": "6d831c9c-6b22-b48e-903f-9834f7bfea95", "code": "LTOM.00.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice Abroad", "et": "Välispraktika"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 4, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "***", "et": "Välispraktika on õpiväljundite saavutamiseks korraldatav üliõpilase sihipärane tegevus rahvusvahelises töökeskkonnas välisjuhendaja juhendamisel. Kõik tegevused tuleks eelnevalt kooskõlastada programmijuhiga (kersti.riibak@ut.ee) ja enda juhendajaga. Välispraktika sooritatakse väljaspool Eestit.\nVälismaale praktikale minek eeldab üliõpilase enese aktiivsust ja iseseisvust. Asutuse ja sihtmaa valikul tuleb lähtuda ennekõike oma õppekavast ja iseenda huvidest. Praktikakoht tuleb tudengil endal leida (konsulteerige instituudiga ning tutvuge praktikanõuetega). Tutvu muuhulgas järgnevate kodulehega:\nhttps://ut.ee/et/praktikale-voi-suvekooli\nhttps://harno.ee/kristjan-jaagu-stipendium#vahetusopingud"}, "objectives": [{"en": "The course is for practicing knowledge and skills acquired during the study at the university in working environment outside of Estonia.", "et": "Välispraktika eesmärk on anda üliõpilastele praktilist töö- või teaduskogemust bioloogia erialal või keskkonnaga seotud valdkonnas. Arendada nende ülekantavad oskusi (sh projektijuhtimine, ajaplaneerimine, enesejuhtimine jne). Harjutada erinevates õppeainetes õpitu rakendamist töökeskkonnas ja arendada vastavaid vilumusi. Arendada oskust õpitut praktikakogemuse põhjal analüüsida ja kriitiliselt hinnata.\nVälispraktika täpne sisu määratakse individuaalselt ning sõltub üliõpilase taustast ning huvidest, praktika tegevus peab langema ühte allpool kirjeldatud kategooriasse:\n1) Ettevõtluspraktika. Tudeng läheb praktikale mõne organisatsiooni juurde Eestist välja. Talle määratakse praktikakoha poolt juhendaja. Ta sooritab praktikakohas talle ettenähtud tööülesanded.\n2) Projektipõhine praktika. Tudeng osaleb ühe konkreetse projekti meeskonna töös välismaal. \n3) Õppeassistendi ja/või teadustöö praktika. Tudeng assisteerib õppejõudu välisülikoolis ühe konkreetse õppeaine läbiviimise või teadustöö tegemise juures."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "After successful completion of the practice the student: (1) have gained practical work experience outside of Estonia; (2) is able to work in a team; (3) is able to adapt to the daily work routines; (4) has an overview of a particular institution/company, its operating environment, market potential, career opportunities in this institution, as well as institution-specific practical aspects of corporate governance; (5) is able to give a report about his/her activities in the company: problem setup, goals of the training, specific task of the trainee, the results of work; (6) is able to analyze what it is in the university lessons learned from makes practical use to him/her, which has benefited and what would be necessary to modify or customize in the learning process; (7) is able to analyze how the institution/company gained the experience and knowledge has furthered his education in the university; (8) is able to do periodic self-reflection of how the objectives set have been completed and is able to set new goals for the next reflection period.", "et": "Aine läbinud üliõpilane: (1) on omandanud erialase praktilise töö kogemuse välisülikoolis või välismaal paiknevas ettevõttes/asutuses; (2) oskab erialateadmisi ja -oskusi loovalt töökeskkonnas rakendada sh. arendab ülekantavaid oskusi (näiteks meeskonnatöö, ajaplaneerimine, projektijuhtimine jt); (3) oskab kohaneda igapäevase töörutiiniga; (4) omab ülevaadet konkreetsest asutusest, selle töökeskkonnast, karjäärivõimalustest selles asutuses või valdkonnas, konkreetse ettevõtte, aga ka ettevõtte/asutuse juhtimise praktilistest külgedest üldiselt; (5) anda ülevaadet oma rollist antud asutuses või ettevõttes: ülevaade probleemist, praktika eesmärgid, praktikandi spetsiifilised ülesanded, töötulemused; (6) oskab analüüsida, mida ülikoolis õpitust on ta praktilisest tegevuses kasutanud, mis on tulnud kasuks ja mida oleks vajalik muuta või kohendada õppeprotsessis; (7) oskab analüüsida, kuidas ettevõttes või asutuses omandatud kogemused ja teadmised on täiendanud tema ülikooliharidust; (8) oskab teha perioodilisi enesereflektsioone, kuidas seatud eesmärgid on täitunud ja oskab seada eesmärke uueks reflektsiooniperioodiks, annab tagasisidet juhendajale ja kaastudengitele."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}