{"uuid": "98c61e17-2d5c-751a-ab73-0a9734d0578f", "code": "LTOM.03.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Mineral Prospecting and Exploration", "et": "Maavarade geoloogia ja uurimismeetodid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course provides knowledge and practical skills to conduct mineral prospecting and exploration works. Together with one of the Estonian exploration company master students have a possibility to participate in mineral exploration project including geological fieldworks, sampling and quality assessments of the samples. Students will learn, how to write exploration report and to calculate mineral reserves and resources.", "et": "Kursus annab teadmisi ja praktilisi oskusi maavarade otsingu ja uuringu läbiviimiseks ning maavara varude hindamiseks. Kursus koosneb teoreetilisest ja praktilisest osast. Praktilises osas omandatakse oskused välitööde läbiviimiseks, setete ja kivimite nõuetekohaseks kirjeldamiseks ja dokumenteerimiseks ning proovide kogumiseks. Arvutipraktikumides õpitakse kasutama geoinfosüsteeme uuringuplaanide ja läbilõigete koostamisel ning maavara lausundite kontuurimisel ja kvaliteedi hindamisel. Magistrandil on võimalus koostöös ühe geoloogilisi uuringuid teostava Eesti ettevõttega osaleda geoloogilise uuringu läbiviimisel sh välitöödel, proovide võtmisel ja analüüsil ning osaleda uuringutulemuste vormistamisel."}, "objectives": [{"en": "To give knowledge and practical skills to conduct mineral prospecting and exploration.", "et": "Aine eesmärgiks on anda teadmisi ja praktilisi oskusi maavarade otsingu ja uuringu läbiviimiseks ning maavara varude hindamiseks."}], "learning_outcomes": [{"en": "1.\tThe student knows geological methods for mineral exploration and prospecting.\n2.\tThe student knows international codes for classification of mineral resources and reserves.\n3.\tThe student knows how to apply differrent exploration and prospecting tehqniques to study different mineral deposits.\n4.\tThe student knows how to document and analyze field work data and how to present geological exploration results.\n5.\tThe student knows how to write geological exploration reports and have practical skilles to compile maps of the mineral reserves and geological cross-sections.", "et": "\"Aine läbinud üliõpilane: \n1.      Tunneb maavarade otsingu- ja uuringumeetodeid.\n2.      Tunneb maavara varude hindamise ja klassifitseerimise rahvusvahelisi standardeid.\n3.      Oskab ära tunda, raekndada ja luua interdistsiplinaarseid seoseid maavarade otsingu ja uuringumeetodites erinevate maavara geneetiliste tüüpide jaoks.\n4.      Oskab kirjeldada ja dokumenteerida välitöödega kogutud andmestikke ning analüüsida ja esitleda maavara laboratoorsete määrangute tulemusi.\n5.      Oskab koostada maavara geoloogilise uuringu ja otsingu aruandeid ning nõuetele vastavaid plaane ning geoloogilisi läbilõikeid.\""}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}