{"uuid": "a96ed845-e760-d3fe-7b84-6750aa3d2430", "code": "LTOM.05.020", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Inquiry Teaching in Science", "et": "Uurimuslikud tööd loodusainete õpetamisel"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "cdfb2559-528e-06e0-9657-3e9300128d62", "code": "LOLO.00.074", "title": {"en": "Science Didactics I", "et": "Loodusteaduste didaktika I"}, "credits": 2, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The subject deals with the inquiry in the school's science subjects and the supervision of students' inquiry. Attention is also paid to the development of the learner's digital competences.  The essential general skills are developed such as critical and creative thinking, analytical and reasoning skills, time planning, self-analysis and reflection for the development of a self-directed learner, collaboration and communication skills, and career awareness.", "et": "Õppeaines käsitletakse uurimuslike tööde olemust kooli loodusainetes, nende läbi viimist ja õpilaste uurimistööde juhendamist. Samuti pööratakse tähelepanu õppija digipädevuste kujunemisele ning olulistele üldoskustele nagu kriitiline ja loov mõtlemine, analüüsioskus ja põhjendamine, aja planeerimine, eneseanalüüs ning refleksioon ennastjuhtiva õppija kujundamiseks, koostöö- ja kommunikatsioonioskused ning karjääriteadlikkus."}, "objectives": [{"en": "The purpose of the subject is to develop the ability to understand the nature of inquiry in basic school and upper secondary school, different levels of inquiry, planning and carrying it out. In addition, the student is able to supervise students' inquiry in basic school and upper secondary school and develops an understanding of the digital competencies necessary for the work of a teacher. The focus is on developing general skills that teachers can pass on to their prospective students: critical and creative thinking, analytical and reasoning skills, time management, self-analysis and reflection on the development of a self-directed learner, collaboration and communication skills, and career awareness.", "et": "Õppeaine eesmärk on kujundada arusaamist uurimuslikust õppest põhikoolis ja gümnaasiumis, selle kavandamisest ja läbi viimisest. Lisaks käsitletakse õpilaste uurimistööde juhendamist põhikoolis ja gümnaasiumis. Tähelepanu pööratakse õpetajatele vajalike digipädevuste kujundamisele ning üldoskuste arendamisele, mida õpetajad suudaksid edasi anda ka oma tulevastele õpilastele: kriitiline ja loov mõtlemine, analüüsioskus ja põhjendamine, aja planeerimine, eneseanalüüs ning refleksioon ennastjuhtiva õppija kujundamiseks, koostöö- ja kommunikatsioonioskused ning karjääriteadlikkus."}], "learning_outcomes": [{"en": "1) Understands the nature inquiry and its different levels;", "et": "1) Mõistab uurimusliku töö olemust ja selle erinevaid tasemeid;"}, {"en": "2) Is able to plan and carry out inquiry in basic school and upper secondary school;", "et": "2) Oskab kavandada ja läbi viia uurimuslikku tööd põhikoolis ja gümnaasiumis;"}, {"en": "3) Is able to supervise students' inquiry in basic school and upper secondary school;", "et": "3) Oskab juhendada õpilaste uurimistööd põhikoolis ja gümnasiumis;"}, {"en": "4) is able to evaluate students inquiry;", "et": "4) Oskab hinnata uurimuslikku tööd:"}, {"en": "5) Understands the importance of digital competences in teaching;", "et": "5) Mõistab digipädevuste olulisust õpetajatöös;"}, {"en": "6) Has acquired general skills: critical and creative thinking, analytical skills and reasoning, time planning, self-analysis and reflection for the formation of a self-directed learner, cooperation and communication skills and career awareness.", "et": "6) On omandanud üldoskused: kriitiline ja loov mõtlemine, analüüsioskus ja põhjendamine, aja planeerimine, eneseanalüüs ning refleksioon ennastjuhtiva õppija kujundamiseks, koostöö- ja kommunikatsioonioskused ning karjääriteadlikkus."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}