{"uuid": "07dcf9d7-ca36-4abf-b770-a0d10807f9ee", "code": "LTOM.05.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Supervising Science Related Activities in Non-formal Settings", "et": "Teadushuviringi juhendamine"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM05", "structural_unit_name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM05", "name": {"en": "Centre for Science Education", "et": "loodusteadusliku hariduse keskus"}, "email": "loodusteaduslikharidus@ut.ee", "phone": "+372 737 5083", "address": "Vanemuise 46\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Vanemuise 46", "zip": "51003", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In this course the task of non-formal  and formal education  similarities and  differences will be studied, It deals with  non-formal science course planning in accordance with the laws and meaningful carrying out the course.", "et": "Õppeaines  käsitletakse  mitte-formaalse ja formaalse hariduse erinevusi ja sarnasusi, teadushuviringi vormilist planeerimist vastavalt seadustele ning sisulist läbiviimist."}, "objectives": [{"en": "The general goal of the Supervising Science Related Activities in Non-formal Settings  Course is to develop students knowledge  and skills  for successful supervision of activities in non-formal  settings course.", "et": "Aine  üldeesmärgiks on anda tulevastele teadushuviringi juhendajatele vajalikud teadmised ja oskused ringi juhendamiseks."}], "learning_outcomes": [{"en": "By the end of the course the student:", "et": "Õppeaine edukalt läbinud üliõpilane:"}, {"en": "1. knows the similarities and differences of  non-formal and formal  education and  understand how to support student development;", "et": "1.\tteab mitteformaal- ja formaalhariduse erinevusi ja sarnasusi ning võimalusi nende kaudu  toetada noorte arengut;"}, {"en": "2. is aware  of the laws that regulate youth-work in Estonia and is able to draw up a curriculum and action plan for non-formal science course;", "et": "2.\ttunneb teadushuviringide tööd reguleerivat seadustikku ning oskab kirjutada teadushuviringi töökava;"}, {"en": "3. is aware of the term \"scientific literacy\"  and is able  to support the development of scientific literacy with different teaching and learning methods ", "et": "3.\tteadvustab loodusteadusliku kirjaoskuse kujundamise vajadust teadushuviringi tunnis ning oskab kasutada erinevaid meetodeid loodusteadusliku kirjaoskuse arendamisel; "}, {"en": "4. is aware  of the national curriculum  and is able to  support the development of general  and field specific competences with non-formal science course.", "et": "4.\tomab ülevaadet põhikooli ja gümnaasiumi riiklikust õppekavast ning oskab seda seostada teadushuviringi  tegevuskavaga"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}