{"uuid": "fe116c05-1e1f-7d2f-ce46-9e0b040acfb9", "code": "LTOM.00.016", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "European Union Green Deal", "et": "Euroopa Liidu rohelepe"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM", "structural_unit_name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM", "name": {"en": "Institute of Ecology and Earth Sciences", "et": "ökoloogia ja maateaduste instituut"}, "email": "om@ut.ee", "phone": "+372 737 5835", "webpage_url": "https://omi.ut.ee", "address": "J. Liivi tn 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "J. Liivi tn 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The main task of the course \" European Union Green Deal\" is to introduce the aim and main targets of the European Green Deal and related policies. In this course, main policy areas, motivation, and support mechanisms will be highlighted in addition to understanding the concept of climate neutrality and mechanisms of natural and possibly human-caused environmental changes. The main areas and possible activities in Estonia to support the Deal will be discussed. Future demand for technological natural resources and the basics of their economics will be highlighted.", "et": "Euroopa Liidu Roheleppe kursuse eesmärgiks on tutvustada Euroopa Liidu Roheleppe peamisi eesmärke, alavaldkondi ja eesmärkide elluviimist võimaldavat poliitikat. Kursuses käsitletakse Roheleppe toetavaid mehhanisme, kliimaneutraalsuse sisu ja saavutamise võimalusi ja keskkonnamuutustega seonduvaid looduslikke ja inimtekkelisi protsesse. Tutvustatakse Eesti võimalikku osa Roheleppes ning näidatakse põhilisi valdkondi, mis leppe täitmist puudutavad. Antakse ülevaade Roheleppega seonduvast loodusressursside võimalikust kasutamisvajadusest."}, "objectives": [{"en": "Overview about the European Green Deal, deal's contents and its targets, resource usage in order to support development's sustainability into green economy and climate neutrality.", "et": "Ülevaade EL Roheleppe sisust, Roheleppe valdkondadest ja valdkondlikest põhieesmärkidest, ressursside kasutamisest jätkusuutlikuse ja rohelise ülemineku ja kliimaneutraalsuse tagamisel."}], "learning_outcomes": [{"en": "Successful student:", "et": "Aine läbinud tudeng:"}, {"en": "1. knows the aim and content of the European Green Deal, policy areas, and targets", "et": "1. teab Euroopa Liidu Roheleppe põhieesmärke, sisu, valdkondi ja nende alaeesmärke"}, {"en": "2. knows the trends of acquiring the main targets of the Deal", "et": "2. tunneb põhilisi arengutrende strateegia eesmärkide saavutamiseks"}, {"en": "3. knows the supporting policies and mechanisms of the Deal", "et": "3. tunneb Roheleppe toetavaid mehhanisme ja strateegiaid"}, {"en": "4. knows the content and policies of climate neutrality", "et": "4. tunneb kliimaneutraalusega seonduvaid valdkondi"}, {"en": "5. knows processes related to environmental changes", "et": "5. mõistab keskkonnamuutusi esilekutsuvaid protsesse"}, {"en": "6. knows the main targets and activities in Estonia to support the Green Deal aims", "et": "6. teab Roheleppe eesmärkide saavutamiseks vajaminevaid tegevusi Eestis"}, {"en": "7. understands the relationship between societal resource usage and green economics.", "et": "7. mõistab ühiskonna ressursikasutuse ja ressursside rohemajanduse omavahelisi seoseid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}