{"uuid": "63abeac8-1a5e-d59d-5924-1ba3ee4d3f70", "code": "LTOM.03.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of Life: Mechanisms and Patterns of Evolution", "et": "Elu ajalugu: evolutsiooni mehhanismid ja mustrid"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTOM03", "structural_unit_name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTOM03", "name": {"en": "Department of Geology", "et": "geoloogia osakond"}, "phone": "+372 737 5891", "webpage_url": "https://geoloogia.ut.ee", "address": "Ravila 14a\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 14a", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTOM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "After completing this course you should have understood that the history of Earth and life was not a nice straightforward road but a process with such a complexity that however in-depth university course would still be comparable with prying into a keyhole.", "et": "Pärast selle kursuse läbimist peaksid Sa mõistma, et Maa ja elu ajalugu ei ole olnud lihtne sirgjooneline teekond, vaid sedavõrd keerukas ja kompleksne protsess, et kuitahes põhjalikuna loodud ülikoolikursuse käigus sellele heidetud pilk on ikkagi võrreldav vaid läbi lukuaugu piilumisega."}, "objectives": [{"en": "The aim of the course is, first, to demonstrate that - from the evolutionary point of view - humans are much less important than it is usually percieved. Among all these billions of creatures who have ever inhabited the Earth or will do so in the future, our species is but a minor actor.\nSecond, to demonstrate, that he/she himself/herself is a heir of much more successful ancestors than he/she has ever been assuming - all his/her ancestors have been fortunate enough to live up to the adulthood  and have managed to pass their genes to the offspring.", "et": "Kursuse eesmärgiks on anda õppijale teadmus sellest, et\n* evolutsioonilisest vaatepunktist on inimene palju tähtsusetum, kui tavapäraselt arvatakse. Kõigi nende miljardite elusolendite seas, kes Maad kunagi asustanud on või kes seda tulevikus asustavad, on inimene vaid tühine tegelane.\n* ta ise on palju saavutusrikkamate esiisade pärija, kui on seni arvanud - kõik tema lugematud esivanemad on olnud piisavalt edukad, et elada täiseani ning jõudnud oma geenid järeltulijatele edasi anda."}], "learning_outcomes": [{"en": "This course ", "et": "See kursus"}, {"en": "*\tinspires to ask questions about the origin of the modern biological diversity ", "et": "* inspireerib esitama küsimusi meid ümbritseva elurikkuse päritolu kohta"}, {"en": "*\tteaches how to join the view on modern life with the view on the life that has disappeared long time ago", "et": "* annab oskuse ühendada vaade kaasaegsele elule vaatega ammukadunud maailma"}, {"en": "*\tdirects to notice how the million-year-old evolutionary patterns are reflected in the modern world ", "et": "* aitab õppida nägema, kuidas peegelduvad tänases maailmas sadade miljonite aastate tagused mustrid"}, {"en": "*\tadvises to avoid the anthropocentric view on our planet, but", "et": "* suunab vältima inimesekeskset vaatepunkti meie planeedile, kuid"}, {"en": "*\thelps to notice how the evolutionary processes are connected with our own species and our civilization", "et": "* aitab märgata, kuidas on evolutsioonilised protsessid seotud meie enda liigi ja tsivilisatsiooniga "}, {"en": "*\tshows how the methods and concepts of different disciplines are employed to understand the history of life", "et": "* õpetab, kuidas ühendatakse elu ajaloo mõistmiseks paljude erinevate teadusharude meetodeid ja kontseptsioone"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}