{"uuid": "54711367-2ea7-a232-8e95-9955456dc186", "code": "LTTO.00.024", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Seminar in Astrophysics", "et": "Magistriseminar astrofüüsikas"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTTO", "structural_unit_name": {"en": "Tartu Observatory", "et": "Tartu observatoorium"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTTO", "name": {"en": "Tartu Observatory", "et": "Tartu observatoorium"}, "webpage_url": "https://kosmos.ut.ee/", "address": "Observatooriumi 1\n61602 Tõravere alevik, \nNõo vald, Tartumaa \nEST", "city": "Tõravere alevik", "street": "Observatooriumi 1", "zip": "61602", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The seminar is an addition to the courses of astrophysics. Topical reviews on the problems of modern astrophysics are  presented by different lecturers. The main form of the work for a student is the preparation of a report on some topical problem of astrophysics based on the analysis literature or on her/his own scientific research.\nAlthough the seminar is comprised of two part (1st part in autumn and 2nd in spring), the parts themselves are structured identically and one can attend them in either order.", "et": "Eriseminaris käsitletakse astrofüüsika huvipakkuvaid ja aktuaalseid probleeme. Toimuvad ka õppejõu(dude) ülevaateloengud. Põhiline töövorm on teadusliku kirjanduse ja/või iseseisva uurimistöö alusel referaatide koostamine, ettekandmine ja analüüsimine.\nSeminar koosneb küll kahest eraldi ainest (1. osa sügissemestril ning 2. osa kevadsemestril), kuid kuna nende ülesehitused on identsed võib seminaril käimist alustada ka kevadest."}, "objectives": [{"en": "The purpose of the seminar is to give students an experience of working through scientific information and presenting it in an oral presentation with slides. Another aim of the seminar is to broaden the students' understanding of various topics in astrophysics.", "et": "Seminari eesmärgiks on anda üliõpilastele kogemus teadusinformatsiooni läbitöötamisest ja esitamisest suulise ettekandena ning süvendada nende erialaseid teadmisi astrofüüsikast."}], "learning_outcomes": [{"en": "student acquires", "et": "üliõpilane"}, {"en": "- an experience in working through scientific information and preparing it for presentation in logical manner,", "et": "- omandab teadusinformatsiooni läbitöötamise ning süstemaatiliseks ja loogiliseks esitamiseks ettevalmistamise kogemuse,"}, {"en": "- an experience in giving a presentation with astrophysical content,", "et": "- omandab astrofüüsikalise sisuga suulise ettekande pidamise kogemuse,"}, {"en": "- an experience in giving an oral presntation using computer slides or blackboard,", "et": "- omandab kogemuse, kuidas ettekannet saata arvutipresentatsiooniga või üleskirjutusega tahvlil,"}, {"en": "- broader view into a range of current problems in astrophysics.", "et": "- täiendab oma teadmisi astrofüüsika aktuaalsetest probleemidest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}