{"uuid": "8d52e371-018c-addc-af89-91519b00db4f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-07T10:45:58", "title": {"en": "Large-Scale Physics", "et": "Globaalfüüsika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTTO", "name": {"en": "Tartu Observatory", "et": "Tartu observatoorium"}, "webpage_url": "https://kosmos.ut.ee/", "address": "Observatooriumi 1\n61602 Tõravere alevik, \nNõo vald, Tartumaa \nEST", "city": "Tõravere alevik", "street": "Observatooriumi 1", "zip": "61602", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTTO", "structural_unit_name": {"en": "Tartu Observatory", "et": "Tartu observatoorium"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 34, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 44, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "d9c042dc-c235-4ed6-9c9a-9ba4e3ba4056", "code": "LOFY.01.121", "title": {"en": "Physics and Engineering", "et": "Füüsika ja tehnika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "5809cd50-bdef-d0b1-1e75-4209c5564c99", "code": "LOFY.01.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "d8d6267d-49b7-25bc-cdb2-31249425aaf0", "code": "LOFY.01.091", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Nature, Observer and Physics", "et": "Füüsikaline maailmapilt"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course, an overview will be given of the main geophysical and cosmic objects, their evolvement and development, and physical methods used to investigate those. The following topics are discussed: a) origin and evolution of the large-scale objects; b) physical properties and chemical composition of the Earth's interior, atmosphere and oceans; c) Sun and other solar system components, d) physics of stars, our Galaxy, other galaxies and the whole Universe. The connections of large-scale physics course with the other courses of the physics bachelor programme are also presented.", "et": "Antakse ülevaade olulisematest geofüüsikalistest ja kosmilistest objektidest, nende uurimise füüsikalistest meetoditest, nende tekke ja arengu füüsikast. Detailsemalt käsitletakse Maa sisemuse, atmosfääri ja Maailmamere füüsikalisi omadusi ja keemilist koostist. \nKosmilistest objektidest vaadeldakse lähemalt Päikest ja Päikesesüsteemi komponente, käsitletakse tähtede parameetreid ja arengufaase, meie Galaktika, teiste galaktikate ning Universumi struktuuri ja arengut. Tutvustatakse kosmoloogia aluseid, tuuakse välja globaalfüüsika seosed teiste füüsikakursustega."}, "objectives": [{"en": "The course aims to introduce the large-scale physical systems (i.e., those not accessible in the ordinary laboratory experiment), and their qualitative and quantitative physical descriptions. The course helps students to recognize their previously acquired knowledge as a part of a global physical context.", "et": "Tutvustada suuremastaabilisi (laboratoorsetes tingimustes mitte uuritavaid) füüsikalisi süsteeme ning nende kvalitatiivset ja kvanti-tatiivset kirjeldamist. Aidata üliõpilastel füüsika bakalaureuseõppe käigus omandatavaid teadmisi mõtestada globaalses kontekstis"}], "learning_outcomes": [{"en": "Upon completion of this course, the student is expected to:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. Know the main geophysical and cosmic objects, their location, dimensions and structure;", "et": "1. Tunneb olulisemaid geofüüsikalisi ja kosmilisi uurimisobjekte, nende paigutust, mõõtmeid ning struktuuri;"}, {"en": "2. Know by order of magnitude the typical values of main physical parameters used to characterize these objects (such as density, pressure or temperature);", "et": "2. Teab suurusjärguliselt nende objektide peamiste füüsikaliste parameetrite (tihedus, rõhk, temperatuur) tüüpilisi väärtusi;"}, {"en": "3. Describe the mechanical, thermal, electromagnetic and chemical processes where these objects are involved in;", "et": "3. Oskab kirjeldada mehaanilisi, soojuslikke, elektromagnetilisi ja keemilisi protsesse, milles need objektid osalevad;"}, {"en": "4. Know the physical  methods providing information about these objects and processes, and be able to estimate the reliability of these methods;", "et": "4. Tunneb füüsikalisi meetodeid, mille vahendusel me saame infot nimetet objektide ja protsesside kohta ning modelleerime neid, oskab anda hinnanguid meetodite usaldatavusele;"}, {"en": "5. Describe the chronological evolution of the large-scale physical objects;", "et": "5. Oskab kirjeldada globaalfüüsikaliste uurimisobjektide ajalist evolutsiooni ja teab nende olulisemaid arengufaase;"}, {"en": "6. Solve the problems considering the large-scale physical objects within the level of the example problems presented.", "et": "6. Suudab lahendada globaalfüüsikalisi objekte käsitlevaid arvutusülesandeid aine näidisülesannetega määratletud tasemel."}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisva töö juhised ja iseseisvalt lahendamisele kuuluvad ülesanded paiknevad vastavate loengute konspektide lõpus või siis omaette ühikuna aine õppematerjalide lehel."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Üliõpilaselt hindamisel oodatavad teadmised ja oskused: \n1. Reprodutseerida planeetide kiirgustemperatuure, kasvuhooneefekti, kosmilisi ja orbitaalkiirusi. Teada Maa sisemuse, atmosfääri ja Maailmamere stratifikatsiooni ning teada olulistemate füüsikaliste ja keemiliste parameetrite suurusjärke kihtides;\n2. Tunda atmosfääri keemilist koostist ning lisanditena käsitletavate komponentide (niiskus, osoon jne) füüsikalist rolli;\n3. Kasutada atmosfääri mudeleid (ideaalne gaas, homogeenne atmosfäär, standardatmosfäärid) ning võtteid niiske õhu käsitlemiseks ideaalse gaasina (virtuaalne temperatuur);\n4. Orienteeruda UV-kiirguse intensiivsuse ja bioloogilise mõju parameetrites (doosid, nahatüübid, indeks);  \n5. Tunda tsiviil- ja aktinomeetrilisi ajasüsteeme (Juliuse ja Gregoriuse kalendrid, troopiline aasta ja täheaasta, täheööpäev ja päikeseööpäev, lisapäeva teke, kevadpunkti nihe, GMT, UTC, vööndiajad, kohalik keskmine aeg, tõeline päikeseaeg) \n6. Mõista Maa pöörlemise mõju õhu ja vee liikumistele, tunda tsüklonaalse ja antitsüklonaalse liikumise kujunemist,  Maa orbiidi parameetreid, kliimavööndite, passaatide ja jugavoolude kujunemist, kasvuhooneefekti;\n7. Teada Maailmamere soolsusliku koostise püsivuse reeglit, osmoosi bioloogilist toimet, soolsuse ja temperatuuri profiile (ka Läänemeres), mõista termokliini ja halokliini teket;\n8. Kirjeldada Kuu, Päikese, planeetide, komeetide, asteroidide, tähtede, galaktikate, galaktikaparvede, udukogude paigutust, mõõtmeid, tähtsamaid füüsikalis-keemilisi komponente ning teada neid objekte iseloomustavate füüsikaliste parameetrite (tihedus, rõhk, temperatuur) suurusjärke;\n9. Kirjeldada olulisemaid kosmilisi protsesse (Päikesesüsteemi komponentide liikumine, tähtede liikumine meie Galaktikas, energia ning aine muundumised ja liikumised tähtedes, Universumi paisumine);\n10. Tunda peamisi füüsikalisi meetodeid info saamiseks kosmiliste objektide ja protsesside kohta (geomeetrilise optika meetodid, triangulatsioon, teleskoobid, spektraalanalüüs, kauguse määramise meetodid, seismiline sondeerimine), osata hinnata nende meetodite usaldatavust. \n11. Tunda kosmiliste objektide (Universum tervikuna, udukogud, galaktikad, tähed, planeedid, asteroidid, eriti aga Päike, Maa ja Kuu) tekkehüpoteese (Suur Pauk, nebulaar- ja katastroofihüpoteesid, maakoore teke);\n12. Tunda Universumi ja Maa arengu olulisi faase (Universumi kolm ajastut, Universumi paisumisfaasid, aatomite tekkimine, galaktikate ja tähtede tekkimine ning arenemine, Päikese evolutsioon ning Maa formeerumine;"}}], "grade_preconditions": {"et": "Eritingimused puuduvad."}, "grade_evaluation": {"et": "10% lõpptulemusest annavad geofüüsika Moodle testid, 40% geofüüsika osa eksamitöö ja 50% kosmofüüsika osa eksamitöö, kusjuures kõigi osade tulemused peavad olema positiivsed. See tähendab, et peab saama üle poole maksimaalselt võimalikust punktisummast. Kosmosefüüsika mittekohustuslike lisaülesannete lahendamine annab boonuspunkte, mis tõstavad lõpphinnet."}, "debt_elimination": {"et": "Eksami kordussooritus on võimalik üks kord enne järgneva semestri algust."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a62df4a3-8112-42bc-aef7-83957bdfb519", "type": "MOODLE", "code": "LTTO.00.025", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Loengukonspektid ja loenguslaidid Moodles", "recommended_materials": "1. Veskimäe, Rein (toimetaja), 1997: Universum, 384 lk.\n2. Nestor, H., Raukas, A., Veskimäe, R. (toim.), 2004: Maa Universumis. Möödanik, tänapäev, tulevik, 328 lk. \n3. Veismann, U., Veskimäe, R. (toim.), 2005: Universum valguses ja vihmas, 343 lk."}, "participants": {"lecturers": [{"person_uuid": "6ad92a8f-e0e9-de0b-2c6e-8675d0e5ebf6", "person_name": "Lauri Juhan Liivamägi", "structural_unit": {"code": "LTTO02", "name": {"en": "Department of Physics of Galaxies and Cosmology", "et": "galaktikate füüsika ja kosmoloogia osakond"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTTO"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "8ff51f91-40c9-da11-4596-260683b193a4", "person_name": "Erko Jakobson", "structural_unit": {"code": "LTTO03", "name": {"en": "Department of Remote Sensing", "et": "kaugseire osakond"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "LTTO"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-39. n. 2L n-s  => E"}, "entries": [{"course_week": 1, "time": "2025-02-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. <B> Sissejuhatus ainesse. Planeedi Maa üldkirjeldus. </B> Globaalfüüsika koht füüsikahariduses. Aine õpiväljundid ja nende kontrollimine. Planeedi Maa vertikaalne kihistus. Rõhk, tihedus ja temperatuur kihtides. Puuraugud, seismiline sondeerimine ja laamtektoonika.\n- - -"}}, {"course_week": 1, "time": "2025-02-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "2. <B> Päikese kiirgus Maal. Kasvuhooneefekt. Maa energiabilanss.</B>  Solaarkonstant, päikesekiirguse spekter, Päikese valguskonstant. Maa albeedo, kasvuhooneefekti modelleerimine.\n- - -"}}, {"course_week": 1, "time": "2025-02-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "3. <B>Gaia hüpotees. Atmosfääri üldkirjeldus.</B> Meteoroloogilised elemendid, gaasi rõhu valemid, atmosfääri vertikaalne ulatus ja kihistus, atmosfääri mudelid, standardatmosfäärid.\n- - -"}}, {"course_week": 1, "time": "2025-03-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "4. <B>UV-kiirgus ja osoon atmosfääris.</B>  UV-kiirguse ja osooni vastastikmõju, Dobsoni ühik, osoon Eesti kohal. Biodoos, nahatüübid, tõeline päikeseaeg, ajavõrrand, biodoosi kogunemise kiirus, UV-indeks.\n- - -"}}, {"course_week": 1, "time": "2025-03-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "5. <B>Kuiv ja niiske õhk.</B>  Vesi kui erandlik aine. Vee mikrostruktuur, soolsus ja osmoos. Ideaalse gaasi ja kuiva õhu olekuvõrrand, veeauru olekuvõrrand, virtuaalne temperatuur. Õhuniiskuse karakteristikud.\n- - -"}}, {"course_week": 1, "time": "2025-03-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "6. <B>Temperatuuri vähenemine kõrgusega.</B>  Temperatuur homogeenses atmosfääris. Kuiv- ja märgadiabaatiline gradient.  Mäestikutuuled.\n- - -"}}, {"course_week": 1, "time": "2025-03-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "7. <B>Maa tiirlemine ja pöörlemine.</B>  Maa orbiit, aastaajad, kalender, kliimavööndid. Troopiline aasta ja täheaasta. Lõuna- ja põhjapoolkera erinev kiirgusrežiim. Päikese- ja täheööpäev.\n- - -"}}, {"course_week": 1, "time": "2025-04-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "8. <B>Maa mitteinertsiaalse taustsüsteemina.</B>  Coriolise kiirendus.  Püsivad planetaarsed tuulesüsteemid ja hoovused. Tsüklonite, antitsüklonite ja Ekmani liikumise kujunemine. Jugavoolud.\n- - -"}}, {"course_week": 1, "time": "2025-04-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "9. <B>Maailmamere soolsus ja temperatuur.</B>  Maailmamere soolsusliku koostise püsivuse reegel. Soolsuse profiil, seos sademete ja aurumisega.  Temperatuuriprofiili sesoonsus. Läänemere soolsus ja temperatuur.\n- - -"}}, {"course_week": 1, "time": "2025-04-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "10. <B>Astrofüüsika uurimismeetodid. Lähimad kosmilised objektid. </B>  Näiv taevas ja taevakoordinaadid. Süsteem Maa-Kuu-Päike. Varjutused. Planeetide näiv ja tegelik liikumine. Kepleri seadused. Spektroskoopilised meetodid.\n- - -"}}, {"course_week": 1, "time": "2025-04-22", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "11. <B>Vaatlusastronoomia. Päikesesüsteem. </B>  Teleskoopide kasutamine erinevates spektraalpiirkondades. Päikesesüsteemi struktuur.  Maa-tüüpi planeedid. Gaasilised hiidplaneedid. Planeetide kaaslased. Asteroidid, meteoroidid ja komeedid. Kuiperi vöö ja Oorti pilv.\n- - -"}}, {"course_week": 1, "time": "2025-04-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "12. <B>Päikesesüsteemi tekkehüpoteesid ja areng. </B> Päikesesüsteemi tekke teooriad. Päikesesüsteemi arengufaasid. Päike kui tüüpiline täht. Päikese siseehitus ja atmosfäär. Päikese aktiivsus. Päikesetuul. \n- - -"}}, {"course_week": 1, "time": "2025-05-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "13. <B>Teised tähed.</B> Kaugused tähtedeni. Tähtede heledused ja värvused. Tähespektrite klassifikatsioon. Hertzsprung-Russelli diagramm. Tähtede massid. Tähtedevaheline keskkond. Tähtede tekkimine ja arenemine. Neutrontähed ja mustad augud.\n- - -"}}, {"course_week": 1, "time": "2025-05-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "14. <B>Linnutee ja teised galaktikad. </B> Galaktika üldine ehitus. Ketta ja halo tähed. Galaktika ketta struktuur. Galaktika spiraalharud. Galaktika dünaamika ja mass. Galaktika keskosa. Tume aine. \n- - -"}}, {"course_week": 1, "time": "2025-05-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "15. <B>Kosmoloogia üldkirjeldus. </B> Universum - mudelid ja vaatlused. Klassikaline staatiline Universum ja selle paradoksid. Hubble'i seadus. Paisuv universum. Üldrelatiivsusteooria. Einsteini, de Sitteri ja Friedmanni mudelid. Suur Pauk. Kosmiline taustkiirgus.\n- - -"}}, {"course_week": 1, "time": "2025-05-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "16. <B>Kauged galaktikad. Universumi suuremastaabiline struktuur. </B> Kaugused teiste galaktikateni. Galaktikate klassifikatsioon ja täheline koostis. Galaktikate massid. Aktiivsed galaktikad. Kohalik galaktikate grupp. Universumi suuremastaabiline struktuur.\n- - -"}}, {"course_week": 1, "time": "2025-06-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "17. <B>Kaasaegne kosmoloogia.</B> Kaasaegse kosmoloogia kujunemine. Universumi paisumine. Standardne Universumi mudel. Kosmoloogiline printsiip. Aegruumi kõverus. Inflatsiooniline arengufaas. Tume energia.\n- - -"}}]}, "registration_info": {"audience": {"et": "Füüsika, keemia ja materjaliteadus: bak (füüsika erialamoodul)"}, "min_students": 5, "max_students": 40}, "parent_uuid": "db55b1e5-e3f1-f8fb-7126-687b8e20e9b6", "parent_code": "LTTO.00.025", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}