{"uuid": "136c8d54-7156-31da-7275-9d141f88e2b2", "code": "MJCV.00.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Entrepreneurial Pre-Incubation", "et": "Ettevõtluse eelinkubatsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ02", "structural_unit_name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The student applies the basic knowledge and practical skills related to the business model and plan preparation, product and service development, and company launch. Their short-term and long-term goals are agreed upon with the team, and the necessary activities are mapped out, which are evaluated in a monthly conversation (four conversations in total). The subject ends with introducing ideas and presenting the further action plan to the committee", "et": "Õppija rakendab ärimudeli ja -plaani koostamise, toote- ja teenuse arenduse  ning  ettevõtte käivitamisega seotud põhiteadmisi ja praktilisi oskuseid. Meeskonnaga lepitakse kokku nende lühi- ja pikaajalised eesmärgid ning kaardistatakse vajalikud tegevused, mida hinnatakse kord kuus toimuva vestlusega (kokku neli vestlust). Aine lõpeb ideede tutvustamise ja edasise tegevuskava esitamisega komisjonile."}, "objectives": [{"en": "Students put into practice their basic knowledge and practical skills for designing, starting, developing and leading business plans and projects.", "et": "Õppijad rakendavad praktikas omandatud teadmisi äriplaanide ja projektide koostamiseks, käivitamiseks, arendamiseks ja juhtimiseks."}], "learning_outcomes": [{"en": "A student who has passed the subject:", "et": "Aine läbinud üliõpilane:"}, {"en": "- is able to set short- and long-term goals and knows how to achieve them;", "et": "- oskab püstitada lühi- ja pikaajalisi eesmärke ning teab, kuidas neid saavutada;"}, {"en": "- can manage the team, himself, and development activities related to the business idea;", "et": "- oskab juhtida meeskonda, iseennast ja äriideega seotud arendustegevusi;"}, {"en": "- knows how to define and analyze problems, set strategic goals, and implement them;", "et": "- oskab määratleda ja analüüsida probleeme, seada strateegilisi eesmärke ja neid ellu viia;"}, {"en": "- can find and analyze important background information for his business model/business plan draft", "et": "- oskab leida ja analüüsida oma ärimudeli/äriplaani kavandi jaoks olulist taustainformatsiooni"}, {"en": "- knows the principles of intellectual property and can assess the need for intellectual property protection;", "et": "- teab intellektuaalomandi põhimõtteid ning oskab hinnata intellektuaalomandi kaitse vajadust; "}, {"en": "- have tested their business idea or prototype on potential customers;", "et": "- on testinud oma äriideed või prototüüpi potentsiaalsete klientide hulgas;"}, {"en": "-has developed his presentation skills and prepared a sales pitch.", "et": "- on arendanud enda esinemisoskuseid ja koostanud müügikõne."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}