{"uuid": "1cdf4cd7-ded0-1684-dad4-8eba8d28db60", "code": "MJCV.00.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Developing Social Enterprise", "et": "Sotsiaalse ettevõtluse alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ02", "structural_unit_name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Students are able to understand basic knowledge, principles and implementation possibilities of social entrepreneurship. The course will be structured around three elements that will be interwoven throughout:\n1.The field of social entrepreneurship. \n2.The players and business structures used by social entrepreneurs.\n3.The mechanics, tensions, and realities of starting and/or managing a social enterprise.", "et": "Õppijad omandavad alusteadmised sotsiaalse ettevõtluse olemusest, põhimõtetest ja rakendusvõimalustest. Kursuse jooksul käsitletakse kolme omavahel lõimunud teemat:\n1.sotsiaalse ettevõtluse tööpõld\n2.sotsiaalses ettevõtluses osalejad ja ettevõtluse ning äri oskused, mida kasutatakse sotsiaalses ettevõtluses\n3.mehhanismid, probleemid ja tegelikkus sotsiaalse ettevõtte käivitamisel või selle arendamisel."}, "objectives": [{"en": "Students are able to understand basic knowledge, principles and implementation possibilities of social entrepreneurship.", "et": "Õppijad omandavad alusteadmised sotsiaalse ettevõtluse olemusest, põhimõtetest ja rakendusvõimalustest."}], "learning_outcomes": [{"en": "After passing the course the student:\n* Has gained an understanding of the field of social entrepreneurship and understand many of the opportunities, challenges and issues faced by social entrepreneurs.\n* Is competent to choose between different types of  enterprises and business models; having long-term goal of sustainable social enterprise and being able to evaluate its impact for the society.\n* Is able to analyse and design entrepreneurial process, its prerequisites and components.\n* Is able to implement innovative processes for his/her projects of study field, including development of product and/or service.\n* Is able to find, create, analyse and communicate business or/and project idea.\n* Is able to compose business concept for a social enterprise.", "et": "* Mõistab sotsiaalse ettevõtluse olemust ning näeb sotsiaalse ettevõtluse rakendamiseks võimalusi ja väljakutseid.\n* Suudab valida erinevate ettevõtlusvormide ja ärimudelite vahel tagamaks sotsiaalse ettevõtte jätkusuutlikus ning suudab hinnata selle mõju ühiskonnas.\n* Oskab analüüsida ja kavandada ettevõtlusprotsessi, selle eeldusi ning komponente. \n* Oskab  rakendada innovatsiooniprotsesse oma erialaprojektides, sh toote/teenuse arendamine.\n* Oskab leida, luua, analüüsida ja kommunikeerida äri- ja/või projektiideed.\n* Suudab koostada sotsiaalse ettevõtluse ärikontseptsiooni."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}