{"uuid": "b3109482-fb37-8332-77c8-fbf520177827", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T08:51:15", "title": {"en": "Performance Management Effectiveness", "et": "Töösoorituse ja tulemuslikkuse juhtimine"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course, the topics of employee performance management, inc. performance appraisal, remuneration, motivation and development are discussed. The focus is on practical issues of performance management, and knowledge and skills of feedback and group coaching are acquired, which are useful for managing oneself and others based on the development and efficiency of the team and organization. Analyzing theoretical and practical models and methods, their connections with management and leadership are discussed.  ", "et": "Kursuse käigus käsitletakse töötajate töösoorituse juhtimise, sh töösoorituse hindamise, töötasustamise (tulemustasustamise), motiveerimise ja arendamise teemasid. Keskendutakse töösoorituse juhtimise praktilistele küsimustele ning omandatakse teadmisi ja oskusi tagasisidestamisest ja grupi coachingust, mis on kasulikud nii enese kui teiste juhtimiseks tiimi ja  organisatsiooni arendamisest ja efektiivsusest lähtuvalt. Teoreetiliste ja praktiliste mudelite ja meetodite analüüsimisel käsitletakse nende seoseid juhtimise ja eestvedamisega."}, "objectives": [{"en": "The aim of course is to acquire knowledge about performance management (performance appraisal, compensation and development) theories and performance management skills (feedback, group coaching) in the context of employees, teams and organization development and effectiveness.", "et": "Aine eesmärgiks on omandada teadmisi ja oskusi töötajate töösoorituse juhtimise (töösoorituse hindamise, töötasustamise ja arendamise) uuematest käsitlustest ning töö tulemuslikkuse tagasisidestamisest ja töötajate arendamisest. Aine raames omandatakse praktilised oskused grupicoachingu metoodika rakendamisel töötajate, tiimi ja organisatsiooni arendamisel."}], "learning_outcomes": [{"en": "Understands the role of performance management in development of organisation from the manager's and the employee's perspective and in the context of organization effectiveness.", "et": "Mõistab ja oskab analüüsida töösoorituse juhtimise komponente ja kohta organisatsiooni arendamisel, nii töötaja kui juhi töö spetsiifikast ja organisatsiooni tulemuslikkusest lähtuvalt."}, {"en": "Understands the role of performance development and feedback (group coaching) from the manager's and the employee's perspective.", "et": "Mõistab ja oskab rakendada töösoorituse arendamise ja tagasisidestamise meetodeid (sh grupicoachingut) nii töötaja kui juhi töö spetsiifikast lähtuvalt. "}, {"en": "Can analyze performance management both theoretically and practically and relate it to organizational management and leadership. ", "et": "Oskab analüüsida töösoorituse juhtimist nii teoreetiliselt kui praktiliselt ning seostada seda organisatsiooni juhtimise ja eestvedamisega."}, {"en": "Can analyse theoretical and practical issues of performance management (appraisal, remuneration, motivation) and foresee positive and negative effects performance management.", "et": "Oskab analüüsida töösoorituse hindamise, töötasustamise ja motiveerimise teoreetilisi ja praktilisi küsimusi ning prognoosida töösoorituse juhtimise positiivseid ja negatiivseid tagajärgi organisatsioonis."}, {"en": "Acquires group coaching methodology and can use it creatively in solving team and group work cases. ", "et": "Omandab grupi coachingu metoodika ning oskab seda loovalt kasutada tiimi ja grupi tööjuhtumite lahendamisel."}, {"en": "Acquires practical skills in the areas of performance management at organizational, team and individual level. ", "et": "Omandab praktilised oskused töösoorituse juhtimise valdkondades organisatsiooni, tiimi ja indiviidi tasandil."}], "notes": {}}, "grading": {"independent_work": {"et": "Iga magistrant peab läbi viima  grupicoachingu (GC) projekti koostöös kursusekaaslas(t)ega (2-3 liikmelistes tiimides), mille käigus lahendatakse töösoorituse juhtimise alane tööjuhtum (TJ) GC metoodikaabil oma või tiimikaaslase organisatsioonis. Selle põhjal tuleb koostada ühine kirjalik kodutöö, mille ülesehitus on esitaud tagapool ja näidiskodutöö failis. Üksinda pole lubatud projekti ja kodutööd teha. TJ pole vaja õppejõuga kooskõlastada, kuid see tuleb eelnevalt üles laadida moodle foorumis (selle kohta antakse tagasisidet). \nGC läbi viimisel oleks soovitatav, et oleksite GC protsessi juhtideks ning teie poolt koostatud TJ esitajaks oleks keegi teie kolleegidest, kes on selle TJ seotud. TJ arutelu grupi optimaalne suurus organisatsioonis võiks olla 4-5 organisatsiooni töötajat + teie tiimi liikmed.\nGC kodutöö teoreetilises osas (2 lk) tuleb kasutada vähemalt viit teadusallikat, sh kolme viimasel kahel aastal avaldatud GC teemalist teadusartiklit. Teoreetiline osa peab olema analüüsiv ja sünteesiv ning sisaldama tabelit GC erinevate käsitluste võrdlemiseks. Kasutatud allikad tuleb viidata (Autor, aasta) ja lisada loeteluna töö lõppu.\nKodutöö praktilises osas keskenduge GC metoodika rakendamisele TJ lahendamisel ja esitage see aruandena: 1) Tööjuhtumi iseloomustus (pool lk). 2) Tööjuhtumi lahendamise protsess GC meetodiga: osalejad, läbi viimise etappide lühikirjeldused näidetega, probleemid (kokku 2,5 lk). 3) Lisad: Missugust mõju avaldas GC teile ja missuguseid isikuomadusi ja oskusi võimaldas arendada. Kasutage selleks tabelit: Türk.2023.GC.Lisa.\nKodutöö pikkuseks on 5 lehekülge + lisad (tähesuurus 12, single, tiitelleheta, pealkirja all autorite nimed, kodutöö osad üksteise järel). Kodutöö Word (!) fail nimetage Perenimed ning laadige moodlesse või saatke meiliga õppejõule (kui soovite tagada selle konfidentsiaalsuse) hiljemalt 24 tundi enne kolmandat kohtumist."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kodutöö tuleb teha 2-3 magistrandi koostööna GC projekti (eksperimendi) põhjal, oma või tiimikaaslase organisatsioonis (vt nõuded kodutööle). Esmalt käsitlege GC teoreetilisi aluseid teaduskirjanduse põhjal ning siis kirjeldada tööjuhtumi läbi viimist GC metoodika abil oma või tiimikaaslase organisatsioonis. \nTeoreetilise osa koostamisel tuleb kasutada vähemalt viit teadusallikat, sh kolme viimasel kahel aastal avaldatud GC alast teaduspublikatsiooni, mis tuleb viidata ning nende loetelu lisada töö lõppu. \nKodutöö tuleb esitada moodles hiljemalt 24 tundi enne kolmandat kohtumist. Kodutööd ei tule esitlemisele ja neile antakse õppejõu poolt tagasisidet seminari käigus ning kirjalikult meili teel."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Aine sooritamine eeldab õppematerjalide omandamist igaks kohtumiseks ja õppetööst osa võtmist. Puudumise korral tuleb koostada kirjalik kodutöö puudutud teemadel (valite ise alateemad, 3 lk, seostades seda praktikaga).\n1) GC metoodika omandamiseks tuleb kindlasti osaleda GC seminaris ning viia läbi koostöös magistrandiga(tidega) eksperimentaalne GC projekt ja koostada selle põhjal kodutöö. Põhjendatud puudumine tuleb enne seminari kooskõlatada õppejõuga meili või telefoni (5036542) teel. \n2) Kirjaliku arvestustöö sooritamine aines käsitletud teemade kohta - esimene võimalus vahetult peale neljanda kohtumise lõppu (30 min, kordamisküsimusteks on lenguslaidid). Arvestustöö toimub kirjalike avatud materjalidega (elektroonilisi materjale ei lubata kasutada) ning eeldab töösoorituse juhtimise alaste teadmiste omandamist ja nende sidumist praktikaga. Slaidikomplekt on väljaprinditav ka kuuestes plokkides."}}], "grade_preconditions": {"et": "Kirjaliku kodutöö tegemine\nKursuse raames tuleb koostada üks kodutöö 2-3 magistrandi koostööna töösoorituse juhtimise teemal GC metoodikat kasutades.\nAine sooritamiseks on vaja osa võtta õppetööst. Puudumise korral tuleb koostada 3 lk pikkune kodutöö teid enam huvitava(te) alateema(de) kohta. Kodutöö peab olema analüütiline ning seotud praktika ja teie kogemustega."}, "grade_evaluation": {"et": "Kirjaliku kodutöö tegemine\nKursuse raames tuleb koostada üks kodutöö 2-3 magistrandi koostööna TSJ teemal GC metoodikat kasutades. \nArvestuse sooritamine eeldab lisaks kodutööle õppetööst osavõttu ning puudumise korral täiendava kodutöö tegemist. \nGC seminarist (teisest kohtumisest) osavõtt on kohustuslik, muidu pole võimalik GC metoodikat omandada. Põhjendatud puudumine tuleb enne seminari kooskõlatada õppejõuga meili või telefoni (5036542) teel. \nKirjaliku arvestustöö sooritamine aines käsitletud teemade kohta - esimene võimalus vahetult peale neljanda kohtumise lõppu (30 min, kordamisküsimusteks on loenguslaidid). Arvestustöö toimub kirjalike avatud materjalidega (elektroonilisi vahendeid kasutamata) ning eeldab töösoorituse juhtimise alaste teadmiste omandamist ja nende sidumist praktikaga. Täiendav arvestuse sooritamine toimub suuliselt veebi teel, mille aeg lepitakse kokku personaalselt."}, "debt_elimination": {"et": "Vastavalt tunniplaanile"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a1b1eda6-511c-42fe-97a0-ba21c2af4449", "type": "MOODLE", "code": "MJJV.03.183_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Türk, K. 2024. Töösoorituse ja tulemuslikkuse juhtimine. Slaidid/Õppematerjal."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Türk, K. 2005. Inimressursi juhtimine. Tartu Ülikooli Kirjastus, lk. 182-201, 215-290."}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": true}, {"name": {"et": "Tulemusjuhtimise (agiilse hindamise ja töötasustamise alapeatükid). Personali juhtimise käsiraamat. PARE 2020."}, "type": {"code": "studybook", "et": "Õpik", "en": "Studybook"}, "required": true}, {"name": {"et": "Türk, K., Saue, K. 2021. Töötajate arendamine ja grupikootsing: Selle võimalused ja tulemuslikkus. Akadeemia, 3."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Türk, K. 2019. Tagasisidestamine ja arendamine. Video."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Pink, D. Video. Motiveerimine. Video."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "McChesney, C. The 4 Disciplines of Execution in a Nutshell. Video."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Holmström, B. Pay for Performance and Beyond. Nobel lecture. Video."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Saue, K., Türk, K. 2024. GC metoodika."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}]}, "participants": {"lecturers": [{"person_uuid": "ad26d3b6-0b3c-e92f-0da1-525baf2edaae", "person_name": "Maria Kütt", "structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "4a66c600-c2de-e0f4-46db-cd6da486f0e2", "person_name": "Kulno Türk", "structural_unit": {"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 3, "time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Loeng/seminar (4 tundi) - Kulno Türk\nTöösoorituse juhtimine: komponendid ja arengud. Töösoorituse hindamine kui  organisatsiooni arendamise instrument. Väljavõtted videotest. Palun lugege ja mõelge läbi: \n1. TSJ. K. Türk 2024. Slaidid/õppematerjal. \n2. G. Dessler 2017. Human Resource Management - alapeatükk Performance Management (moodles). \nNeed, kes pole käsitletava teemaga kokku puutunud võivad kasutada ka K. Türk Inimressursi juhtimine. 2005. lk. 183-202 ja 214-251. \n3. Agiilne tulemusjuhtimine (agiilne hindamine ja tagasisidestamine). Personali juhtimise käsiraamat. PARE 2020."}}, {"course_week": 7, "time": "2024-10-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "Seminar - Kulno Türk (4 tundi). Grupicoachingu (GC) metoodika omandamine. Kahes rühmas; rühmad kujundatakse esimesel kohtumisel. Osavõtt kohustuslik (ilma seminarita pole võimalik GC projekti/eksperimenti läbi viia). Põhjendatud puudumine tuleb kooskõlastada õppejõuga enne seminari (vajadusel tel teel 5036542). \nPalun seminariks moodustada 2-3 liikmelised tiimid, kellega plaanite GC projekti läbi viia ja kodutöö teha. Koostage seminariks ühine tööjuhtum (TJ) töösoorituse juhtimise (hindamise ja/või tasustamise ja/või motiveerimise ja/või arendamise) teemal oma või tiimikaaslase organisatsioonis (kuni pool lk) ning postitage see moodle foorumisse hiljemalt 48 tundi enne GC seminari (vastan teile meili teel). \nÄrge võtke laia teemat (!). Sobib lihtne TJ, mis on ühe GC raames lahendatav ja võimaldab paremini GC metoodikat omandada.\nPeale seminari tuleb viia koostöös tiimiga läbi GC oma või tiimikaaslase organisatsioonis. Soovitavalt 4-5 liikmelises grupis + teie tiim. GC põhjal koostage ühine kodutöö, mille palun laadida moodlesse (või saata õppejõule meiliga kui soovite tagada selle konfidentsiaalsuse) hiljemalt 24 tundi enne kolmandat kohtumist. Üksinda pole lubatud GC projekti (eksperimenti) ja kodutööd teha.\nPalun lugege ja mõelge läbi: \n1. Saue-Türk. 2024. GC metoodiline juhend \n2. TSJ.K.Türk.2024. Slaidid/õppematerjal.\n3. Vaadake videot: K. Türk. 2019. Tagasisidestamine ja arendamine.\n4. Türk-Saue. 2021. Grupikootsing. Akadeemia.\n5. Valmistage ette kuni(!) poole leheküljeline tööjuhtum (TJ) ja laadige see moodlesse (TJ ei pea õppejõuga kooskõlastama)."}}, {"course_week": 9, "time": "2024-11-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "Seminar - Kulno Türk ja Maria Kütt (Riigikantselei tippjuhtide kompetentsikeskuse juhataja).\nGC kodutööde reflektsioon (kodutööd ettekandmisele ei tule, tagasiside antakse kirjalikult). Töösoorituse hindamine ja tagsisidestamine. Kompetentside põhine hindamine ja juhtimine.  \nPalun lugege ja mõelge läbi: \n1. TSJ.K.Türk.2024. Slaidid/õppematerjal.\n2. G. Dessler 2017. Human Resource Management. lk 382-383, 405-412 (va USA seaduste ja näidetega seonduv osa); või neile, kes pole teemaga varem kokku puutunud: K. Türk Inimressursi juhtimine. 2005. lk. 253-307.\n3. Vaadake Daniel Pink video Motivatsioonist ja sooritage enesehindamise test.\n4. Vaadake vähemalt kahte Armin Trost videot agiilsest hindamisest ja  töötasustamisest (vt moodle).\nLisaallikad\nBonneywell, S., Gannon, J. 2021. Maximising Female Leader Development … Individual and Group Coaching. IJTRP.\nBrandmo jt. 2021. Group Coaching … Self-Efficacy and Role Clarity … SJER.\nMann jt. 2022. Group Coaching .. Online.\nFischer jt. 2022. Development and Evaluation … Group Coaching. JHS.\nGyllensten, K. 2020. The Experience Executive Group Coaching ...\nWiddowson, L. 2020. Bridging Team Coaching ..."}}, {"course_week": 11, "time": "2024-11-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "Seminar (4 tundi) - Kulno Türk\nTöösoorituse ja tulemuslikkuse agiilne juhtimine. Arutame Pink, Holmström ja McChesney videoid.\nKontrolltöö (arvestustöö) sooritamise võimalus õppetöö käigus käsitletud teemal (vahetult peale seminari lõppu, 30 min). Kontrolltöö toimub kirjalike avatud materjalidega (elektroonilisi materjale ei saa kasutada) ning eeldab töösoorituse juhtimise alaste teadmiste omandamist ja nende sidumist praktikaga. \nPalun lugege ja mõelge läbi:\n1. TSJ.K.Türk.2024. Slaidid/õppematerjal. \n2. Agiilne tulemusjuhtimine (agiilne hindamine ja tagasisidestamine). Personali juhtimise käsiraamat. PARE 2020.\n3. Vaadake Bengt Holmström Pay for Performance and Beyond. Nobel lecture 2016 (abiks on Holmströmi slaidid).\n4. Vaadake Chris McChesney video. 2016. The 4 Disciplines of Execution in a Nutshell.\n5. Sooritage kahe viimase video kohta enesehindamise testid."}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 26}, "parent_uuid": "c908ce51-eac2-c1d3-842b-d6a26adc0a72", "parent_code": "MJJV.03.183", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}