{"uuid": "a193a209-287c-c3e0-ec6d-dbfec8ea9cf7", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-07T13:15:28", "title": {"en": "Human Resource Management and Leadership", "et": "Personalijuhtimine ja eestvedamine"}, "credits": 5, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course covers topics related to human resource/personnel management, including recruitment and selection, as well as performance appraisal, feedback, and remuneration. Has acquired practical experience in the areas of human resource development, including co-vision and group coaching methodologies. The leadership topics such as leadership style and power are also considered. This course gives knowledge and practical experience, which enables better to manage the participants' themselves and the others.", "et": "Kursuse käigus käsitletakse inimressursi/personali juhtimise, sh personali värbamise ja valiku ning hindamise, tagasisidestamise ja töötasustamise teemasid. Omandab praktilisi kogemusi inimressursi arendamise valdkondades, sh kovisiooni ja grupicoachingu metoodika. Eestvedamise teema raames uuritakse juhi/liidri omadusi ja juhtimisstiili ning mõjuvõimu rakendamise eripärasid. Kursuse käigus pööratakse tähelepanu eestvedamise praktilistele küsimustele ning omandatakse teadmisi ja oskusi, mis on kasulikud nii enese kui teiste juhtimiseks."}, "objectives": [{"en": "The aim of this course is to develop knowledge and skills about leadership and human resources management.", "et": "Arendada teadmisi ja vilumusi inimressursi/personali juhtimisest ja eestvedamisest."}], "learning_outcomes": [{"en": "A student who has successfully passed this course:", "et": "Aine edukalt läbinud üliõpilane:"}, {"en": "* Understands the role of human resource management and the concept of leadership in development of organisation from both the manager's and the employee's perspective. ", "et": "* Mõistab inimressursi juhtimise ja eestvedamise sisu ja kohta organisatsiooni arendamisel,  nii töötaja kui juhi töö spetsiifikast lähtuvalt."}, {"en": "* Can relate human resource management and leadership with management as a whole from both perspectives: theoretical and practical.", "et": "* Oskab seostada inimressursi juhtimist ja eestvedamist nii teoreetiliselt kui praktiliselt juhtimise kui tervikuga."}, {"en": "* Can analyse theoretical and practical issues of human resources management and leadership and foresee positive and negative effects of human resource management.", "et": "* Oskab analüüsida personali juhtimise ja eestvedamise teoreetilisi ja praktilisi küsimusi ning prognoosida inimressursi juhtimise positiivseid ja negatiivseid tagajärgi."}, {"en": "* Has acquired practical experience practical experience in the areas of human resource management and development, including co-vision and group coaching methodologies.", "et": "* Omandab praktilisi kogemusi inimressursi juhtimise ja arendamise valdkondades, sh kovisiooni ja grupicoachingu metoodika."}], "notes": {"et": "Juhul kui õppetöö peaks toimuma veebis (BBB-s), siis antakse sellest aegsasti teada.  BBB ikoon on õppeaine moodle alguses, kust saate ennas sisse logida kas Google Chrome või Firefox brauseri kaudu. Vajalik on mikrofon ja kaamera."}}, "grading": {"independent_work": {"et": "1. Kaasus \nIga aines osaleja peab koostama kokku ühe (1) kaasuse koostöös grupikaaslasega oma või grupikaaslase organisatsioonis õppeaine teemal (näidisteemade loetelu moodles; teemat ei pea õppejõuga kooskõlastama). Kaasus tuleb koostada 6-7 slaidil ja see tuleb esitada seminaris arutamiseks 6-7 minutise ettekande raames, millele järgneb diskussioon. Kaasus tuleb teha ühe tiimikaaslase organisatsiooni kohta, kus ühel slaidil käsitlege ka teise tiimikaaslase organisatsiooni eripära. Viimasel slaidil esitage käsitletava teema arendamise ettepanekud organisatsioonile. Slaidid siduge ka teooria ja/või õppeaine slaididega. \nSlaidid saatke õppejõule hiljemalt 24 tundi enne vastava teema seminari (faili nimes perenimed). Juhul kui kaasusi saadetakse ühe teema kohta rohkelt, siis ei pruugi kõik jõuda oma kaasust tutvustada (õppejõud annab tagasiside).\n2. Grupicoachingu (GC) eksperiment ja kodutöö 2-3 liikmelistes tiimides, mis tuleb läbi viia peale märtsi sessiooni koostöös grupikaaslasega (üksinda pole lubatud seda teha; vt moodle).\nIgal tiimil palun koostada märtsi sessiooniks õppeainega seonduval teemal üks tööjuhtum (TJ) oma või tiimikaaslase organisatsioonis (kuni poolel leheküljel; teemat ei pea õppejõuga kooskõlastama; vt nõuded moodlest). TJ laadige hiljemalt 24 tundi enne seminari moodle foorumisse (õppejõud annab tagasiside).\nGC eksperimendi alternatiivseteks töödeks on: a) GC läbi viimine aines osalejate 4-5 liikmelises grupis, üldtuntud kaasuse (TJ) põhjal; b) viia üksinda läbi oma organisatsioonis aine teemaga seonduv uuring ja koostada selle põhjal 3-4 leheküljeline kodutöö. Alternatiivid palun eelnevalt kooskõlastada õppejõuga."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "1) Üks kaasus, vabalt valitud teemal koostöös grupikaaslasega (6-7 slaidil).\n2) Grupicoachingu (GC) eksperiment (projekt) ja kodutöö koostöös grupikaaslasega (2 või 3 liikmeline tiim). GC eksperimendi ja kodutöö juhend on moodles. GC eksperimendi alternatiivideks on: a) GC aines osalejate 4-5 liikmelises grupis üldtuntud kaasuse (TJ) põhjal b) viia üksinda oma organisatsioonis läbi aine teemaga seonduv uuring ja koostada selle põhjal 3-4 leheküljeline kodutöö.  "}}], "grade_preconditions": {"et": "1) Ühe kaasuse koostamine koostöös kaasmagistrandiga (6-7 slaidil) ja selle aruteluks esitamine vastava teemaga seminaris (6-7 min jooksul + diskussioon). \n2) GC eksperimendi läbiviimine ja kodutöö koostöös kaasmagistrandiga enda või tiimikaaslase organisatsioonis (2 või 3 liikmelises tiimis; üksinda pole lubatud GC eksperimenti ja kodutööd teha). GC eksperimendi alternatiivseteks töödeks on: a) viia läbi üldtuntud kaasuse (TJ) arutelu aines osalejate 4-5 liikmelises grupis GC metoodikaga ja koostada vastav kodutöö; b) viia läbi üksinda oma organisatsioonis aine teemaga seonduv uuring ja koostada 3-4 leheküljeline kodutöö, tuginedes viimase kahe aasta teaduskirjandusele. Alternatiivsed tööd palun õppejõuga eelnevalt kooskõlastada."}, "grade_evaluation": {"et": "Arvestuse sooritamiseks tuleb.\n1. Koostada kokku üks (1) kaasus koostöös grupikaaslasega (6-7 slaidil) ja esitada see aruteluks vastavas seminaris (6-7 min jooksul + diskussioon). \n2. Viia läbi GC eksperiment oma või tiimikaaslase organisatsioonis koostöös grupikaaslasega ning koostada GC alane ühine kodutöö (vt nõuded aineinfos). GC eksperimendi alternatiivideks on:  a) viia läbi aines osalejate 4-5 liikmelises grupis mingi üldtuntud kaasuse (TJ) arutelu GC metoodikaga ning koostada selle põhjal vastav kodutöö; b) viia üksinda oma organisatsioonis läbi aine teemaga seonduv uuring ja koostada 3-4 leheküljeline kodutöö. Alternatiivsed tööd eeldavad õppejõuga kooskõlastamist.\n3. Sooritada kolm enesehindamise testi (Pink. Holmström, McChesney)."}, "debt_elimination": {"et": "Aine viimasel õppesessioonil."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "cac666fd-933f-4b79-9dc2-9161d8556888", "type": "MOODLE", "code": "MJJV.03.124_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Türk, K. 2025. Personali juhtimine ja eestvedamine. Slaidid ja õppematerjal."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Agiilne tulemusjuhtimine. PARE 2020. "}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Türk, K. 2005. Inimressursi juhtimine."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Türk, K., Saue, K. 2021. Töötajate arendamine ja grupikootsing. Akadeemia, 3."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Saue, K., Türk, K. 2024. Grupicoachingu metoodika."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Holmström, B. Pay for Performance. Nobel Lecture. Slaids."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Pritchard, M. The 4 Disciplines of Execution. Univ Colorado (Chris McChesney video)"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Video: Chris McChesney. Power to Become"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Video: Türk, K. 2019. Tagasisidestamine ja arendamine."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Video: Daniel Pink. Hindamine, motiveerimine ja tasustamine."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Video: Martin Herem - Võim kui juhi tööriist."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Fischer, E. et al. 2022. Development and Evaluation of a Prospective Group Coaching ... . JHS."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Rees, G., French, R. 2022. Strategic People Management and Development. &th Ed. Delta raamatukogus."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Peters, B., Göhlich, M. 2024. Transformative Learning through Group Coaching."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Proches, C. jt. 2024. ... Group Coaching ... Transformative Leadership .Development in Disruptive Times."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Türk, K., Saue, K. 2019. Employee Development through Groupcoaching ... EDEP."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Videod: Homström, B. Pay For Performance. Nobel Lecture. "}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "4a66c600-c2de-e0f4-46db-cd6da486f0e2", "person_name": "Kulno Türk", "structural_unit": {"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "veebruar-juuni"}, "entries": [{"course_week": 24, "time": "2025-02-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. Lugege ja mõelge läbi Kulno Türk personali värbamise-valiku ja arendamise slaidid. Slaidid täidavad õppematerjali ülesannet ning on sellepärast infomahukad.\n2. Tutvuge Kulno Türk õpiku Inimressursi juhtimine vastavate osadega (eelkõige need, kes pole teemaga varem kokku puutunud) või välismaise originaalõpiku vastavate osadega ja/või PARE 2020 vastava osaga. Soovitan kasutada nt Gary Dessler HRM ja Richard Daft Leadership (laenutatavad Delta raamatukogust; mõned peatükid ka moodles). Kulno Türk õpik ning PARE 2020 vastavad osad on elektrooniliselt kätte saadavad moodlest.\n\nÕppeaines osaleja peab koostama koostöös kursusekaaslasega kokku ühe(1) kaasuse (6-7 slaidi) oma või kursusekaaslase organisatsioonis õppeaines käsitletaval teemal (vt kodutööd). Kaasuse tutvustamiseks antakse 6-7 minutit (palun ajast kinni pidada) + diskussioon. \nVeebruari sessiooniks on võimalik koostada värbamise-valiku kaasus ka erandkorras üksinda, mis eeldab aga kindlasti selle eelnevat kooskõlastamist õppejõuga (hiljem seda teemat enam ei käsitleta). Slaidid palun saata meiliga (kulno.turk@ut.ee) hilljemalt 24 tundi enne seminari."}}, {"course_week": 28, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "GC seminar: 1.R. - 14.03; 2.R. - 16.03. Seminari rühmad kujundatakse esimeses loeng-seminaris."}, "description": {"et": "Grupicoachingu (GC) seminar kahes rühmas, mis tagab GC metoodika parema omandamise. Osavõtt kohustuslik, sest muidu on keeruline GC metoodikat omandada ja eksperimenti läbi viia. Kulno Türk (4S). \nPalun eelnevalt:\n1. Tutvuge ja mõelge läbi Kulno Türk personali arendamise ja (grupi)coachingu slaidid.\n2. Soovitavalt vaadake Kulno Türk videot tagasisidestamisest ja arendamisest.\n3. Tutvuge: Saue, Türk. 2023. Grupicoachingu metoodika.\n4. Tutvuge: Türk, Saue. 2021. Töötajate arendamine ja grupikootsing .... Akadeemia.\n5. Seminariks palun koostage koostöös grupikaaslasega (tiimikaaslasega) üks tööjuhtum (TJ) oma või tiimikaaslase organisatsioonis õppeainega seonduval teemal (kuni pool lk; teemat pole vaja kooskõlastada) ning laadige see moodlesse hiljemalt 24 tundi enne seminari. TJ peab olema seotud teie või tiimikaaslase tööalase küsimusega (vt moodle). \n\nNB Peale seminari toimumist tuleb TJ arutelu (eksperiment) läbi viia oma või tiimikaaslase organisatsioonis koostöös tiimikaaslasega GC metoodikaga (4-5 kolleegiga grupis + teie kahekesi protsessijuhtidena) ning koostada kodutöö (vt moodle).\nGC eksperimendi alternatiivid: a) viia läbi mingi kaasuse (TJ) arutelu GC metoodikaga 4-5 liikmelises õppegrupis ja koostada vastav kodutöö; b) viia üksinda läbi aine teemal põhinev uuring oma organisatsioonis ning koostada kodutöö, mis on seotud viimase kahe aasta teaduskirjandusega. Alternatiivsed kodutööd eeldavad nende eelnevat kooskõlastamist õppejõuga.\n"}}, {"course_week": 32, "time": "2025-04-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"et": "Töösoorituse hindamine ja arendamine"}, "description": {"et": "GC kodutööde reflektsioon (kodutööd esitlemisele ei tule, neile antakse kirjalik tagasiside).\nTöösoorituse hindamine ja arendamine. Vaatame ja arutame väljavõtteid Vijay Govindarajan ja Patric Lencioni videotest. \nPalun tutvuge: \n1. Kulno Türk personali hindamise ja arendamise slaididega. \n2. Vaadake Daniel Pink videot ning vastake Pink enesehindamise testile. \n3. Personali hindamise ja/või arendamise kaasus koostöös grupikaaslasega neile, kes valivad selle teema.\nTäiendavad allikad:\nKulno Türk 2015. Töösoorituse juhtimine ... Akadeemia.\nSoovitavalt Armin Trost videod: Agiilne hindamine, tagasisidestamine jt.\nSoovitavalt Kulno Türk 2005. Inimressursi juhtimine õpiku vastavad osad või HRM õpik.\n\nVõimalus koostada koostöös grupikaaslasega töötajate töösoorituse/tulemuslikkuse hindamise ja/või tagasisidestamise alane kaasus neile, kes valivad selle teema (oma või grupikaaslase organisatsioonis). Kaasuse (6-7 slaidi) tutvustamiseks antakse 6-7 minutit + diskussioon. Valitud teemat pole vaja õppejõuga kooskõlastada; slaidid saatke meiliga (kulno.turk@ut.ee) hiljemalt 24 tundi enne seminari."}}, {"course_week": 36, "time": "2025-05-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "Töösoorituse juhtimine (hindamine, tasustamine ja arendamine). Täideviimine (XQ; McChesney järgi) ja eestvedamine. Kulno Türk (4S). \n1. Vaadake ja mõelge veel kord läbi Kulno Türk personalijuhtimise slaidid. \n2. Tutvuge Tulemusjuhtimine (agiilne hindamine ja tagasisidestamine; ptk 7). Pare.2020. \n3. Vaadake Holmström videot ja vastake Holmström enesehindamise testile.\n\nVõimalus koostada koostöös grupikaaslasega töösoorituse juhtimise \n ning hindamise ja tasustamise alane kaasus neile, kes valivad selle teema (oma või grupikaaslase organisatsioonis). Kaasuse (6-7 slaidi) tutvustamiseks antakse 6-7 minutit + diskussioon. Valitud teemat pole vaja õppejõuga kooskõlastada; slaidid saatke meiliga (kulno.turk@ut.ee) hiljemalt 24 tundi enne seminari."}}, {"course_week": 40, "time": "2025-06-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "Eestvedamine.  Kulno Türk (4S).\nJuhi pädevused ja enesekehtestamine. Mõjuvõim. Eesti parimate juhtide juhtimiskogemused.\nTippjuhtide kompetentsimudel - Maria Kütt (Riigikantselei tippjuhtide kompetsikeskuse juhataja). \n1. Lugege ja mõelge läbi Kulno Türk eestvedamise slaidid.\n2. Vaadake Martin Herem ja Chris McChesney videoid.\n3. Vastake McChesney enesehindamise testile. \n\nVõimalus koostada koostöös grupikaaslasega eestvedamise kaasus neile, kes valisid selle teema (oma või grupikaaslase organisatsioonis). Kaasuse (6-7 slaidi) tutvustamiseks antakse 6-7 minutit + diskussioon. Valitud teemat pole vaja õppejõuga kooskõlastada; slaidid saatke meiliga (kulno.turk@ut.ee) hiljemalt 24 tundi enne seminari."}}]}, "registration_info": {"audience": {"et": "Strateegiline juhtimine, 2. aasta"}, "min_students": 10, "max_students": 17}, "parent_uuid": "6c95ea1c-128b-57b4-ab71-ff226ca5a574", "parent_code": "MJJV.03.124", "parent_credits": 5, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}