{"uuid": "84d93ea8-7625-4961-6ec5-edb29e02fc6a", "code": "MJJV.03.178", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Organizational Culture and Change Management", "et": "Organisatsioonikultuur ja muutuste juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The rapidly changing environment puts high standards for organizations, especially in regard with adaptability, which is analyzed from the perspective of organizational culture and change management. Organizational culture theories enable better to manage customer orientation, quality, the employees' motivation, teamwork etc. The sources and development of organizational culture are focused in this course. The factors influencing change are under consideration as well as the techniques of change management. Several practical tasks are solved in order to analyze the participants' personal experience and to acquire the methods of analysis of organizational culture and teambuilding for change management.", "et": "Kiirelt muutuv organisatsioonikeskkond esitab organisatsioonide kohenemisvõimele kõrgeid nõudeid. Organisatsioonide kohanemisvõimelisust analüüsitakse organisatsioonikultuuri ja muutuste juhtimise perspektiivist. Organisatsioonikultuuri seaduspärasuste tundmine võimaldab juhtida tarbijakesksust, kvaliteeti, töötajate motivatsiooni, meeskonnatööd jne. Aines käsitletakse, kuidas kujuneb organisatsioonikultuuri ning uuritakse selle suunamise võimalusi. Vaatluse alla võetakse muutuste mõjutegurid organisatsioonis ja muutuste juhtimise seaduspärasused. Ainekursuse vältel lahendatakse mitmesuguseid praktilisi ülesandeid, mis võimaldavad omandada organisatsioonikultuuri analüüsimise ja muutustega seotud meeskonnatöö korraldamise võtteid."}, "objectives": [{"en": "The main aim of this course is to offer knowledge about organizational cultures in order to provide experiences and skills for analysis, understanding, and solving important problems that are related to design and implementation of changes.", "et": "Aine üldeesmärkideks on luua võimalused  organisatsioonikultuuri tundma õppimiseks, võimaldamaks üliõpilasel analüüsida, mõista  ja lahendada olulisi küsimusi, mis mõjutavad  organisatsiooni muutusi ja nende juhtimist."}], "learning_outcomes": [{"en": "A student who has successfully passed this course:\nUnderstands and knows theoretical and practical aspects of organizational culture and change management from the different perspectives (i.e. employee, manager). \nKnows how to analyze organizational culture from different perspectives.\nKnows what aspects of organizational culture would be considered in the consultancy of organization.\nGains experiences for assessment and analysis of organizational culture.\nLearns experiences how to organize teamwork for analyzing organizational problems.", "et": "Aine edukalt läbinud üliõpilane:\nMõistab organisatsioonikultuuri  ja muutuste juhtimise teoreetilisi ning praktilisi küsimusi nii töötaja kui juhi töö spetsiifikast lähtuvalt.\nTeab, kuidas analüüsida organisatsioonikultuure erinevatest vaatepunktidest.\nTeab milliseid organisatsioonikultuuri aspekte tuleb arvestada organisatsiooni konsulteerimisel.\nTeab, kuidas kujundada organisatsioonikultuuri ja juhtida muutusi.\nOmandab kogemused organisatsioonikultuuri analüüsimiseks ja hindamiseks.\nOmandab kogemused, kuidas teha koostööd organisatsiooni probleemide analüüsimisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}