{"uuid": "c908ce51-eac2-c1d3-842b-d6a26adc0a72", "code": "MJJV.03.183", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Performance Management Effectiveness", "et": "Töösoorituse ja tulemuslikkuse juhtimine"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The various topics of performance management investigated in this course, while the themes of performance appraisal, compensation and development are more focused among others. This course gives knowledge and practical experience, which enables better to manage the participants' themselves and the others in the context on feedback and group coaching at the context of organization development and effectiveness. Theoretical and practical models (management methods) and their relationship focused in respect with management practice.", "et": "Kursuse käigus käsitletakse töötajate töösoorituse juhtimise, sh töösoorituse hindamise, töötasustamise (tulemustasustamise) ja arendamise teemasid. Keskendutakse töösoorituse juhtimise praktilistele küsimustele ning omandatakse teadmisi ja oskusi tagasisidestamisest ja grupi coachingust, mis on kasulikud nii enese kui teiste juhtimiseks organisatsiooni arendamisest ja efektiivsusest lähtuvalt. Teoreetiliste ja praktiliste mudelite ja juhtimismeetodite analüüsimise kõrval pööratakse tähelepanu nende seostele juhtimispraktikaga."}, "objectives": [{"en": "The aim of course is to acquire knowledge about performance management (performance appraisal, compensation and development) theories and performance management skills (feedback, group coaching) in the context of employees and organization development and effectiveness.", "et": "Aine eesmärgiks on omandada teadmisi ja oskusi töötajate töösoorituse juhtimise (töösoorituse hindamise, töötasustamise ja arendamise) uuematest käsitlustest ning töö tulemuslikkuse tagasisidestamisest ja töötajate arendamisest. Aine raames omandatakse praktilised oskused grupicoachingu metoodika rakendamisel töötajate ja organisatsiooni arendamise perspektiividest lähtuvalt."}], "learning_outcomes": [{"en": "Understands the role of performance management in development of organisation from the manager's and the employee's perspective and in the context of organization effectiveness.", "et": "Mõistab ja oskab analüüsida töösoorituse juhtimise komponente ja kohta organisatsiooni arendamisel, nii töötaja kui juhi töö spetsiifikast ja organisatsiooni tulemuslikkusest lähtuvalt."}, {"en": "Understands the role of performance development and feedback (group coaching) from the manager's and the employee's perspective.", "et": "Mõistab ja oskab rakendada töösoorituse arendamise ja tagasisidestamise meetodeid (sh grupicoachingut) nii töötaja kui juhi töö spetsiifikast lähtuvalt. "}, {"en": "Can relate performance management with management as a whole from both perspectives: theoretical and practical. ", "et": "Oskab seostada ja analüüsida töösoorituse juhtimist nii teoreetiliselt kui praktiliselt organisatsiooni juhtimise kui tervikuga. "}, {"en": "Can analyse theoretical and practical issues of performance management and foresee positive and negative effects performance management.", "et": "Oskab analüüsida töösoorituse hindamise ja töötasustamise teoreetilisi ja praktilisi küsimusi ning prognoosida töösoorituse juhtimise positiivseid ja negatiivseid tagajärgi organisatsioonis."}, {"en": "Has acquired practical experience of group coaching.", "et": "Omandab grupi coachingu metoodika ning oskab seda loovalt kasutada meeskonna juhtimises tööjuhtumite lahendamisel."}, {"en": "Has acquired practical experience of performance management.", "et": "Omandab praktilised oskused töösoorituse juhtimise valdkondades organisatsiooni, meeskonna ja indiviidi tasandil."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}