{"uuid": "27a15197-0f67-ccf8-7bd3-f6a87759e256", "code": "sv-2025-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-26T15:58:28", "title": {"en": "Innovation Management", "et": "Innovatsiooni juhtimine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ07", "name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "25/26 A regular SV Eng", "et": "25/26 S PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ07", "structural_unit_name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 20, "independent_work": 108, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course provides a definition of innovation and its categories. It takes a systemic approach to innovations. Innovation systems are introduced on several different levels. Attention is drawn to industry-level and regional-level innovation systems. The course compares Estonian innovation policy with those of other countries. The experiences of EU, Finland and Ireland in creation of innovation policies and systems will be investigated in greater detail. The second part of the course provides an understanding about innovation management in a company. It discusses the principles of innovation strategy formation, the processes of product and service innovations, and the impact of organizational structures on the success of innovation processes.", "et": "Loengukursuse käigus avatakse innovatsiooni mõiste ja selle erinevad liigid. Seejärel tuuakse sisse innovatsiooni süsteemse käsitluse temaatika. Tutvustatakse erinevaid tasandeid innovatsioonisüsteemide käsitlemisel. Eraldi tuuakse välja sektoraalsed ja regionaalsed innovatsioonisüsteemid. Seejärel analüüsitakse võrdlevalt Eesti innovatsioonipoliitikat teiste riikidega. Põhjalikumalt analüüsitakse Euroopa Liidu, Soome ja Iirimaa tegevust innovatsioonipoliitika kujundamisel ja innovatsioonisüsteemi arendamisel. Kursuse teine pool annab tervikliku ettekujutuse innovatsiooni juhtimisest ettevõttes. Avatakse innovatsioonistrateegiate kujundamise põhimõtted, tutvustatakse toodete ja teenuste innovatsiooniprotsesside põhimõtteid ja selgitatakse ettevõtte organisatsioonilise ülesehituse mõju innovatsiooniprotsesside edukusele."}, "objectives": [{"en": "The general objective of the course is: ", "et": "Kursuse eesmärgiks on: "}, {"en": "a)to form understanding about the multilevel character of the innovation as a process; ", "et": "1.kujundada arusaam innovatsiooni kui protsessi mitmetasandilisest iseloomust."}, {"en": "b)to provide a vision of relationships between national innovation policy and innovation processes of companies;", "et": "2.tuua nägemus riikliku innovatsioonipoliitika ja ettevõtete innovatsiooniprotsesside seostest."}, {"en": "c)to give knowledge about innovation management on different (national, industry and company) levels of economy;", "et": "3.anda teadmised innovatsiooni juhtimisest majanduse erinevatel (rahvamajanduse, sektori ja ettevõtte) tasanditel."}, {"en": "d)to create via discussions experiences for interpretation and transfer of earlier innovation practices.", "et": "4.luua arutluste käigus kogemusi innovatsioonikogemuste tõlgendamiseks ja ülekandmiseks."}], "learning_outcomes": [{"en": "a) knowledge of main notion concerning innovation management;", "et": "a)innovatsiooni juhtimise valdkonna põhimõistete tundmine;"}, {"en": "b) comprehension of innovation management mechanisms on national, industry and company levels;", "et": "b)arusaam innovatsioonijuhtimise mehhanismist nii rahvamajanduse, majandussektori kui ka ettevõtte tasandil;"}, {"en": "c) knowledge about innovation systems and -policies in Estonia and in other EU member-states;", "et": "c)teadmised nii Eesti kui ka Euroopa Liidu teiste riikide innovatsioonisüsteemidest ja innovatsioonipoliitikast;"}, {"en": "d) ability to evaluate the importance of innovation management in a company and for the country's development in general;", "et": "d)oskus hinnata innovatsioonijuhtimise tähtsust nii ettevõtte kui riigi arengus tervikuna;"}, {"en": "e) capability to analyze company's innovation process and to implement measures for its governance;", "et": "e)suutlikus analüüsida ettevõtete innovatsiooniprotsessi ja rakendada meetmeid nende protsesside suunamiseks;"}, {"en": "f) capability to evaluate the efficiency of Estonian innovation system and innovation policy;", "et": "f)suutlikus hinnata Eesti innovatsioonisüsteemi ja innovatsioonipoliitika tõhusust;"}, {"en": "g) competence to use the acquired knowledge and skills in the analysis and management of innovation processes.", "et": "g)oskus rakendada omandatud teadmisi ja oskusi innovatsiooniportsesside analüüsimisel ja juhtimisel; "}, {"en": "h) capability to recognize relationships between the national innovation policy and the possibilities for the management of innovation processes in a company.", "et": "h)võime näha seoseid riigi innovatsioonipoliitika ja ettevõtete innovatsiooniportsesside juhtimise võimaluste vahel."}], "notes": {}}, "grading": {"independent_work": {"et": "*\tIndividual reading of the compulsory study materials, e.g. book chapters and articles.  Compulsory readings will be provided in Moodle.\n*\tIndividual analysis of an article about innovation management, and its short presentation in the class. Sample articles will be provided in Moodle.\n*\tGroup home assignment - a 10 page report (note: note more than 10 pages including everything) about a concept of a new product, service, marketing activity, business process or business model, and its presentation in the class.\nDetailed instructions will be given in the class and uploaded in Moodle."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "EXAM and FINAL GRADE. The assessment is based on the student's knowledge about the innovation management main concepts and terminology. These include, but are not limited to, innovation management at the macro- and micro level, innovation systems, innovation policy mechanisms, the role of innovation in the development, innovation processes in firms, and the interrelations between the above. The written exam at the end of the course gives 50% of the final grade and home assignments with presentations and two unannounced test will take 50%. Home assignments have to be submitted by the set deadline, otherwise, 1 point will be deducted for each delayed day. "}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Detailed description in the Moodle\n\n\nYour task is to analyse the innovation history of a product or a service. Everything that is common today has been new some time ago. The range of possible products/services for review is very broad, it may be a consumer product, a B2B service, an application, etc. It is advised to go through available materials before making the choice as the information available may vary a lot. You may also conduct some expert interviews by yourself, but these may not be the only data sources.\n\nIt is advised to divide the analysis into thematic sections, following either geographical, historical or some other dimension. The analysis should also cover to some extent the changes that took place in the context, which accelerated the diffusion of that particular innovation. The final section should cover your arguments and vision about how this product/service will continue to develop in the next 10 years, these may be written also as alternative scenarios. Throughout the analysis, it is advised to consider all types of innovation, not just product innovation. Please try to be analytical and avoid the simple \"copy-paste\" style"}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "PRESENTATION OF THE GROUP HOME ASSIGNMENT. The group will also make a short presentation about their home assignment, this gives a maximum of 10% of the final grade.\n\nTwo dates for homework presentation:\n25.11.2024\n(02.12.2024)"}}], "grade_preconditions": {"et": "Individual and group home assignments with presentations are a precondition for exam."}, "grade_evaluation": {"et": "Max 100 points:\n50 points for the written final assignment (exam)\n40 points for group home assignment\n10 points for group home assignment presentation in the class\nPoints will be deducted if the home assignments are not submitted on time and plagiarism is detected.\nExtra 10 points available for 4-5 article reviews in October-November"}, "grade_conditions": {"A": {"et": "91-100"}, "B": {"et": "81-90"}, "C": {"et": "71-80"}, "D": {"et": "61-70"}, "E": {"et": "51-60"}, "F": {"et": "<=50"}}, "debt_elimination": {"et": "At least one exam resit option will be given to redo the exam during the same semester."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "55c39113-3de0-de05-7199-d2d29cfad50d", "person_name": "Liina Joller-Vahter", "structural_unit": {"code": "SVMJ07", "name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "451fff03-1c95-43d7-8ffc-d3a653376c5d", "person_name": "Priit Vahter", "structural_unit": {"code": "SVMJ07", "name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "3-14"}, "entries": [{"course_week": 3, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Introduction to the course; What is innovation? Why it matters? Basic concepts and types (Liina Joller-Vahter)"}}, {"course_week": 4, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Global trends in world economy and innovation (Prof. Urmas Varblane)  (Postponed)"}}, {"course_week": 5, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Innovation process. Open innovation. (Liina Joller-Vahter)"}}, {"course_week": 6, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Theory behind 'chasm' (Liina Joller-Vahter); Practical examples on 'crossing the chasm' in private and public sector innovations (guest lecturer Pille Muni)"}}, {"course_week": 7, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Theory behind 'validation' (Liina Joller-Vahter); Testing the innovative idea and validating it on the client (guest lecturer Kalev Kaarna)"}}, {"course_week": 8, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "E-learning (2h) & Failures (guest lecturer Oliver Lukason) (2h) NB! Class starts at 12:15"}}, {"course_week": 9, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Business model innovation (Liina Joller-Vahter) lecture 2h + seminar 2h"}}, {"course_week": 10, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Contemporary topics in innovation economics (Prof. Priit Vahter)"}}, {"course_week": 11, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Adoption and diffusion of innovations (Liina Joller-Vahter)"}}, {"course_week": 12, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "TBD"}}, {"course_week": 13, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Groupwork presentations (first batch)"}}, {"course_week": 14, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Groupwork presentations (second batch) "}}, {"course_week": 16, "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {}, "description": {"et": "EXAM (Resit, if necessary, on 13th January)"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "06da4c94-496f-ede0-807a-3710f3bf2b05", "parent_code": "MJJV.07.083", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}