{"uuid": "38b55a0e-8079-4c2a-2d7d-76ae7a913f4e", "code": "MJJV.03.174", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teams in Organization", "et": "Meeskonnad organisatsioonis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "\"Teams in Organizations\" is an intensive, interactive and experiential course focusing on various aspects of the teamwork. Even though it is a theory-based course, it applies highly practical approach to the subject matter. The course is designed to provide students with essential understanding of teamwork fundamentals to become more effective and productive team member.", "et": "\"Meeskonnad organisatsioonis\" on intensiivne, interaktiivne ja praktiline kursus, mille keskmeks on meeskonnatöö erinevad aspektid. Kursus põhineb küll teoreetilistel alustel, kuid teemasid käsitletakse praktilises võtmes erinevate aktiivõppe meetodite kaudu. See võimaldab tudengitel paremini teadvustada peamisi meeskonnatöö elemente, et olla tõhus ja tulemuslik meeskonna mängija."}, "objectives": [{"en": "To give an overview of the basic fundamentals of teamwork, both the central concepts as well as the main processes of teamwork will be covered. Practicums provide students with an opportunity to raise their practical awareness about key factors and skills essential for teamwork in order to become more effective team member.", "et": "Anda ülevaade peamistest meeskonna toimimise alustest, meeskonnatöö võtmekontseptsioonidest ja -protsessidest. Praktikumide kaudu tõsta tudengite praktilist teadlikkust meeskonnatöö võtmeteguritest ja -oskustes, et olla veelgi tõhusam meeskonna liige."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbimisel tudeng:"}, {"en": "- understands the essence of teamwork, incl. the main concepts and processes driving effective teamwork;", "et": " - mõistab meeskonnatöö olemust organisatsioonis, sh peamisi meeskonnatööga seotud kontseptsioone ja protsesse;"}, {"en": "- is more aware of his/ her contribution to the teamwork and analyze the team's effectiveness and performance.", "et": "- on võimeline teadlikumalt osalema meeskonnatöös ning analüüsima selle tõhusust ja tulemuslikkust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}