{"uuid": "916cbe4f-9bbc-1bf4-6082-7eefdd870794", "code": "MJJV.02.092", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Marketing", "et": "Turundus"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ09", "structural_unit_name": {"en": "Chair of Marketing", "et": "turunduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ09", "name": {"en": "Chair of Marketing", "et": "turunduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Marketing environment, tools, methods and general principles of creating strategies for product, pricing, distribution and promotion are examined. Internetmarketing.", "et": "Käsitletakse turunduse põhimõisteid ja kontseptsioone, turunduskeskkonda ja turunduse seost teiste ettevõtte valdkondadega. Antakse ülevaade turunduse infosüsteemi struktuurist ja tarbija ostukäitumisest. Sihtturgude valimine ja positsioneerimine. Turundus kompleks: toode, hind, jaotus ja edustus: olemus, eesmärgid, strateegiad. Internetiturundus"}, "objectives": [{"en": "Students are able to understand basic knowledge and principles of marketing and  it' s connections with other areas of the company.", "et": "Õppijad omandavad alusteadmised turunduse olemusest, põhimõtetest ja seostest teiste ettevõtte tegevusvaldkondadega."}], "learning_outcomes": [{"en": "Passed students are able to:", "et": "Aine läbinud üliõpilane:"}, {"en": "*understand basic concepts of marketing and knows how to associate it with other areas of the company;", "et": "* teab ja mõistab turunduse põhimõistete olemust ning omavahelist seost,"}, {"en": "*understand the importance of the segmentation of customers;", "et": "* oskab seostada aines omandatud teadmisi teiste ettevõtte tegevusvaldkondadega,"}, {"en": "*design target markets;", "et": "* oskab esile tuua turunduse rolli ettevõtte edukas tegevuses ja arengus,"}, {"en": "*identify and analyse the marketing mix ; ", "et": "*mõistab turgude segmenteerimise vajalikkust ja sihtturgude kujundamise võimalusi,"}, {"en": "*understand the importance of marketing ensuring the success of the company;", "et": "* teab, kuidas analüüsida ning kujundada terviklik turunduskompleks,"}, {"en": "*use basic knowledge for further specialisation in marketing;", "et": "* on omandanud olulised baasteadmised edasiseks spetsialiseerumiseks turunduse valdkonnas;"}, {"en": "*use gained knowledge in his/her profession.", "et": "* oskab rakendada omandatud teadmisi oma erialases töös."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}