{"uuid": "fef6a4a4-3157-7a81-736a-ae6549777871", "code": "sv-2018-autumn-fulltime-c6-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Econometrical Analysis", "et": "Ökonomeetriline analüüs"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "18/19 A regular SV Eng", "et": "18/19 S PÕ SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 12, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Econometric modeling with implementation of different methodological tools and methods. Properties and analysis of estimators. Regression analysis with cross-sectional data, panel data, pooled data, time series, micro- and macro data.  Multiple regression analysis with qualitative information. Preparing and discussing of an econometric project using  software package R.", "et": "Õppeaines käsitletakse ökonomeetriliste meetodite kasutamise võimalusi majandus- ja sotsiaalprotsesse iseloomustavate  erinevate andmevalimite (ristandmed, aegread, paneelandmed; ühendatud andmed, mikro- ja makroandmed) korral. Võimalik on saada  teadmisi ökononomeetrilisel modelleerimisel kasutatavatest erinevatest metodoloogilistest lähenemistest ja meetoditest, klassikalisest ökonomeetrilisest modelleerimist, mikroökonomeetrilistest meetoditest,  paneelandmete ja aegridade analüüsist. Ökonomeetrilise analüüsi läbiviimine toimub statistikapaketi STATA baasil. Tuleb koostada ökonomeetriline projekt ning diskuteerida selle tulemusi."}, "objectives": [{"en": "To develop theoretical and practical knowledge and skills for applying econometric tools for analysing economic and social processes and implementing software package R by using different types of data: cross-sectional data, time series, pooled data, panel data, macro data, micro data.", "et": "Omandada  süvendatud teadmisi ja oskusi ökonomeetriliseks modelleerimiseks kasutades  selleks tarkvarapaketi STATA võimalusi ning erinevaid andmeid: ristandmed, aegread, paneelandmed, ühendatud andmed, mikro- ja makroandmed.."}], "learning_outcomes": [{"en": "Knowledge  on the methodology and  methods for buiding,  estimating and analysing econometric models relying on different types of data: micro- and macro data, cross-sectional data, time series, pooled data, panel data. \nSkills of implementing software package R for estimation, analysis and diagnostics of econometric models. \nSkills to  collect and analyse socio-economic data, to correctly specify, estimate  and analyse econometric models, to discuss the results of econometric modelling, preparing and presenting econometric projects.", "et": "Teadmised ökonomeetrilise modelleerimise metodoloogiast ja ökonomeetriliste mudelite hindamise meetoditest ning nende matemaatilis-statistilisest tagapõhjast. \nTeadmised ja oskused ökonomeetrilise analüüsi läbiviimiseks kasutades tarkvarapaketti STATA ning erinevat tüüpi  andmeid: makro- ja mikroandmed, ristandmed, aegread, ühendatud andmed, paneelandmed.   \nSüvendatud oskused selliste probleemipüstituste formuleerimiseks, kus lahenduste leidmisel on abi ökonomeetrilisest modelleerimisest. \nOskus komplekteerida sobivaid andmevalimeid ning viia läbi ökonomeetrilist analüüsi ja mudelite diagnostikat erinevat tüüpi andmevalimite  korral.\nKogemused ökonomeetriliste mudelite püstitamiseks, hindamiseks, analüüsimiseks ning tulemuste sisuliseks tõlgendamiseks ja diskuteerimiseks koostades ja kaitstes ökonomeetrilist projekti."}], "notes": {}}, "grading": {"independent_work": {"et": "Econometrics project. The instructions will be given in class and online."}, "independent_work_assessments": [{"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "Project will consist of three steps\n1.\t(10 points) A written report will be due on 29.11.2017. The report should clearly discuss the problem and motivation. The data should be explained well and some descriptive statistics should be given. Outline of the methodology should be discussed. There should be a small literature review as well.\n2.\t(15 points) Complete work is due on 20.12.2017. The report of step 1 should be developed in to a complete work. So in addition to the work of report in step 1, the final methodology should be discussed well. Results should be presented and there should be comments on the results. Final conclusions of the project should be explained. R code and output should be attached to the final work.\n3.\t (5 points) The project will be presented in class by a group member chosen by the group on 15.12.2017.\n\nThe project is encouraged to be a group work of preferably 3 people. Failure to meet the deadlines will result in a decrease of the corresponding points by 50%. (Late submissions are penalized!)"}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "(10 points) A quiz will be made in class. It will consist of several questions related to class material."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "(60 points) Final exam will be in class. It consists of both theoretical questions and numerical exercises."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "The final grade (maximum 100 points) will consist of a term project (20 points), 2 quizes in class (10 points in total), 4 homeworks (20 points in total), a midterm exam (20 points) and a final exam (30 points). To obtain a PASS grade, the student should obtain at least 51 points in total, submit a term project and should obtain at least 16 points (out of 30 points) from the final exam. The final grade will be calculated based on the sum of the points of course work. The scale of final grade is as follows: A (91-100 points), B (81-90 points), C(71-80 points), D (61-70 points) and E (51-60) points. Attendance to lectures continuously is highly recommended."}, "debt_elimination": {"et": "Date of the final exam will be set during the course. If a student fails in this final exam or simply doesn't take this final exam, then there will be the repetition of the final exam in January 2018. The exact date will be decided during the course."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "NB! The topics list in the syllabus is preliminary and depending on the speed of the lectures the dates at which these topics are discussed may change. \n\nLecture notes covered in class.\nJeffrey M. Wooldridge Introductory Econometrics. A Modern Approach", "recommended_materials": "Greene, W.H. Econometric Analysis, Prentice Hall International, Inc\nBaltagi, Badi. Econometric Analysis of Panel Data \nArellano, Manuel, Panel Data Econometrics\nGujarati, Damodar N. Basic Econometrics\nHansen, Bruce, Econometrics\nKleiber, C., Zeileis, A. Applied Econometrics with R\nColonescu, C. Principles of Econometrics with R"}, "participants": {"lecturers": [{"person_uuid": "d97a0918-deb3-cece-2b04-335b0a8bfed6", "person_name": "Nataliia Ostapenko", "structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "3868d78f-9c03-8654-ec0b-18c68209d2ce", "person_name": "Mustafa Hakan Eratalay", "structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction, causal relationships, data types, partial effects, partial elasticity, conditional expectation, law of iterated expectations, conditional variance, linear projections and properties"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Data types, discussion of ceteris paribus effects, simple regression models, ordinary least squares estimation, properties of OLS estimation, goodness of fit, effect of measurement units, functional forms, unbiasedness of OLS estimators"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Simple regression models (continued), homoscedasticity, heteroscedasticity, estimating error variance, variance and standard errors of OLS estimators, regression through origin, examples with R output."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Multiple regression models, motivation for multiple regression, ceteris paribus effects of variables, interpreting partial effects in multiple regression, partialling out interpretation, comparing simple and multiple regression estimates, goodness of fit, regression through origin, unbiasedness of OLS estimators in multiple regression, perfect collinearity, omitted variable bias"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Multiple regression models (continued), variance of the OLS estimators, components of OLS variances, multicollinearity, variances in misspecified models, estimating the standard errors of OLS estimators, Gauss-Markov theorem."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "LAB class, Natalia Ostapenko: R examples on simple and multiple regression, on single and joint coefficient testing"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "NB! QUIZ IN CLASS!\n\nExercises on multiple regression analysis and inference. Large sample behavior of OLS estimators, consistency and asymptotic normality of OLS estimators. Asymptotic inference."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "LAB class, Natalia Ostapenko, exercises related to multiple regression analysis. Rexamples on multiple regression and inference."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Dummy variables and partial effects. Heteroscedasticity."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Discrete response models: logit and probit."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Presentations for econometrics projects, consultation"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "LAB class, Natalia Ostapenko: R examples on logit and probit models."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "1. Final exam. All students can take this exam. Official registration is obligatory."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "2. Final exam. All students who haven't taken the final exam on 18.12.2017 or who have failed the final exam on 18.12.2017 can take this exam. Official registration is obligatory. Retake exam"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Retake exam."}}]}, "registration_info": {"audience": {"et": "Innovation and Technology Management 1st year; Sociology"}, "min_students": 10}, "parent_uuid": "02c3d5f7-4dfd-8a55-c2e7-4164452d16d3", "parent_code": "MJRI.02.075", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}