{"uuid": "eeda430c-49d5-2a74-469d-3adde689bf69", "code": "sv-2018-autumn-fulltime-p1-c3-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Research Methods in Business and Economics", "et": "Uurimismeetodid majanduses"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "18/19 A regular part 1 3 CP SV Eng", "et": "18/19 S PÕ 1. osa 3 EAP SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course gives an overview of the process of social research: from research design to data collection, to quantitative and qualitative data analysis and interpretation of results. It outlines the ways, how to gather data, revising different method's strengths and weaknesses. Data analyse topics range over quantitative and qualitative approaches and combine practical considerations with philosophical issues.", "et": "Kursuses antakse ülevaade majandus- ja sotsiaalteaduste valdkonnas kasutatavatest uurimis- ja analüüsimeetoditest, alustade uurimuse disainist, andmete kogumisest ja lõpetades erinevate kvalitatiivsete ja kvantitatiivsete analüüsimeetoditega."}, "objectives": [{"en": "Course will give students knowledge and skills of the main quantitative and qualitative research and data analysis methods in the field of economics and social sciences and give experiences of applying these methods in solving different research questions.", "et": "Võimaldada üliõpilastel omandada teadmised majandus- ja sotsiaalteaduste valdkonnas enamkasutatavatest kvalitatiivsetest ja kvantitatiivsetest uurimis- ja analüüsimeetoditest ning saada kogemusi nende praktiliseks kasutamiseks."}], "learning_outcomes": [{"en": "The students who have passed the course have acquired:", "et": "Õppeaine läbinud üliõpilased on omandanud:"}, {"en": "* Knowledge about the nature of scientific research and specifics of economics and business research, about different research strategies and design, as well about stages of the research process;", "et": "* Teadmised teadusuuringute olemuse ja majandusuuringu spetsiifika, uurimisstrateegiate, uuringu disaini ja uurimisprotsessi osade kohta."}, {"en": "* Knowledge about qualitative and quantitative data gathering and analysis methods;", "et": "*Teadmised kvalitatiivsete ja kvantitatiivsete andmete kogumise ja analüüsimise meetoditest."}, {"en": "* Skills how to apply different qualitative and quantitative data gathering and analysis methods;", "et": "* Oskus rakendada erinevaid kvalitatiivsete ja kvantitatiivsete andmete kogumise ja analüüsimise meetodeid."}, {"en": "* Skills how to interpret and generalize results of data analysis and how to present research findings.", "et": "* Oskus sisuliselt tõlgendada analüüsitulemusi ning neid üldistada ja uurimistulemusi esitada."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Different home assignments, composed of tests in Moodle and individual assignments for seminars. More detailed description of the homework and deadlines can be found in Moodle. In total, home assignments give 55% of the final grade. Information about assignments' feedback options is provided during the course."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Final written exam (45% of the grade). Possibility to get feedback on the times announced by the lecturer."}}], "grade_preconditions": {"et": "In order to pass the course, student has to gain at least 25 points from the home assignments and 25 points from exam (in total, 50% of graded activities)."}, "grade_evaluation": {"et": "The final grade will be the sum of the following requirements: homework (55%) and exam (45%)."}, "debt_elimination": {"et": "In agreement with lecturers"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Bryman, A., Bell, E. Business research methods. Oxford University Press, 2003/2007.", "recommended_materials": "Organizing literature review:\nWebster, J. and Watson, R. T. Analyzing the past to prepare for the futuure: Writing a literature review. - MIS Quarterly, 2002, Vol. 26, No. 2, pp. xiii-xxiii.\n\nOpen or closed questions:\nFalthzik, A. M., Carroll, S. J. jr. Rate of return for closed versus open-ended questions in a mail questionnaire survey of industrial organizations. - Psychological Reports, 1971, Vol. 29, No. 3, pp. 1121-1122.\nSchuman, H., Presser, S. The Open and Closed Question. - American Sociological Review, 1979, Vol. 44, No. 5, pp. 692-712\n\nQuestionnaires:\nBoynton, P. M., Greenhalgh. Hand-on guide to questionnaire research: Selecting, designing, and developing your questionnaire. - BMJ, 2004, Vol. 328, pp. 1312-1315.\nLeung, W.-C. How to design a questionnaire. - BMJ, 2001, Vol. 9, pp. 187-189.\n\nFocus groups:\nBlackburn, R., Stokes, D. Breaking Down the Barriers: Using Focus Groups to Research Small and Medium Sized Enterprises. - International Small Business Journal, 2000, Vol. 19., No. 1, pp. 44-67.\nDilshad, R. M., Latif, M. I. Focus Group Interview as a Tool for Qualitative Research: An Analysis. - Pakistan Journal of Social Sciences, 2013, Vol. 33, No. 1, pp. 191-198.\nFolch-Lyon, E., Trost, J. F. Conducting Focus Group Sessions. - Studies in Family Planning, 1981, Vol. 12, No. 12, pp. 443-449.\nKitzinger, J. Qualitative research: Introducing focus groups. - BMJ, 1995, Vol. 311, pp. 299-302.\nMorgan, D. L. Focus groups. - Annual Review of Sociology, 1996, Vol. 22, pp. 129-152\nSim, J. Collecting and analysing qualitative data: issues raised by the focus group. - Journal of Advanced Nursing, 1998, Vol. 28, No. 2, pp. 345-352.\nWilliams, A., Katz, L. The Use of Focus Group Methodology in Education: Some Theoretical and Practical Considerations. - International Electronic Journal for Leadership in Learning, 2001, Vol. 5, No. 3. \n\n\nEthnographic study:\nAshcraft, K. Managing maternilty leave: A qualitative analysis of temporary executive succession. - Administrative Science Quarterly, 1999, Vol. 44, pp. 240-280.\n\nStorytelling:\nBailey, P. H., Tilley, S. Storytelling and the interpretation of meaning in qualitative research. - Journal of Advanced Nursing, 2002, Vol. 38, No. 6, pp. 574-583.\nMcKee, R. Storytelling that moves people. - Harvard Business Review, June 2003, pp. 51-55.\n\nCase study:\nYin, R. K. A (very) brief refresher on the case study method. Applications of Case Study Research, 3rd ed. Sage Publications, 2002, pages 3-20.\nHarris, S. G., Sutton, R. I. Functions of partying ceremonies in dying organizations. - The Academy of Management Journal, 1986, Vol. 29, No. 1, pp. 5-30.\n\nScenario building:\nMietzner, D., Reger, G. Advantages and disadvantages of scenario approaches for strategic foresight. - International Journal of Intelligence and Planning, 2005, Vol. 1, No. 2, pp. 220-239.\nShoemaker, P. J. H. Scenario planning: A tool for strategic thinking. - Sloan Management review, 1995, Vol 36, No. 2, pp. 25-40.\n\nTriangulation:\nKelle, U. Sociological Explanations between Micro and Macro and the Integration of Qualitative and Quantitative Methods. - Forum: Qualitative Social Research, 2001, Vol. 2, No. 1."}, "participants": {"lecturers": [{"person_uuid": "51d569ed-b487-624f-97ca-cb7bc2521b2d", "person_name": "Helen Poltimäe", "structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "6ebc02d9-4dc4-4881-ea64-84f02870cb30", "person_name": "Eneli Kindsiko", "structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-13"}}, "registration_info": {"audience": {"et": "Business Administration 3rd year"}, "min_students": 15}, "parent_uuid": "b861342a-c28d-b984-8464-aaca033d1d7b", "parent_code": "MJRI.01.032", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}