{"uuid": "218f942f-fa97-a757-c839-69d169faa648", "code": "MTAT.03.310", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Business Analysis", "et": "Ärianalüüs"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Topics covered by the course include: The role of a business analyst; business analysis lifecycle; strategy analysis; stakeholder analysis; data gathering techniques; business modelling; defining business requirements; defining business improvement options; feasibility studies; risk assessment; business case development.", "et": "Kursusel kaetavad teemad sisaldavad: ärianalüütiku rolli, ärianalüüsi elutsüklit, strateegia analüüsi, huvigruppide analüüsi, andmete kogumise võtteid, äri modelleerimist, ärinõuete määratlemist, äri parandamise variantide määratlemist, tasuvusuuringuid, riskianalüüsi, talituslugude loomist."}, "objectives": [{"en": "Business analysis is, at its core, about \"delivering business value\" and is defined as \"the practice of enabling change in an enterprise by defining needs and recommending solutions that deliver value\". This simply means to analyze needs or problems of a specific business for the purpose of designing, developing and implementing a solution to fill that need or solve the problem. Value is very often delivered by means of IT-intensive solutions. Although the work of business analysis can take on a multitude of forms, in the end, it is about understanding the current state and through a set of activities, bring the business to desired future state that is of higher value.\n\nThis course provides an overview of business analysis when primarily engaged in delivering business value through software related solutions and investments. By the end of this course, you will be able to identify a problem, elicit relevant information, evaluate and select the best-suited alternative. You will also become acquainted with the role of an analyst in designing, delivering and, evaluating the final solution and results. In short, you will learn about analysis to ensure the fit of an IT-solution to its context so it delivers value. This course is perfect for students who seek to gain a fundamental understanding of the profession of business analysis.", "et": "Kursus annab tudengitele ülevaate ärianalüüsi alustest, põhimõtetest ja võtetest rõhuga ärianalüüsil IT süsteemide kontekstis."}], "learning_outcomes": [{"en": "On successful completion of this course, students will able to:", "et": "Aine läbinud üliõpilane on võimeline:"}, {"en": "1. Identify, analyze, and work with a need, problem, opportunity", "et": "1) Tuvastama ja sõnastama ärivajadusi ja võimalusi organisatsioonis."}, {"en": "2. Collect, organize, and synthesize input and documentation from different sources for the purpose of solving a problem or satisfying a business need", "et": "2) Koguma, organiseerima ja looma tuvastatud ärivajadusega või -võimalusega seotud dokumentatsiooni ja sisendit organisatsiooni huvigruppidelt."}, {"en": "3. Design and assess options to improve business systems, in relation to an identified business need or opportunity.", "et": "3) Kujundama ja hindama valikuid ärisüsteemide parandamiseks lähtudes ärivajadusest või -võimalusest."}, {"en": "4. Conduct a feasibility study, architectural assessment and risk assessment for an IT system development project, in relation to a business need or opportunity.", "et": "4) Läbi viima IT süsteemi arendusprojekti tasuvusuuringut, arhitektuurilist hindamist ja riskianalüüsi lähtudes ärivajadusest või -võimalusest."}, {"en": "5. Prepare and present business cases for IT system development projects.", "et": "5) Ette valmistama ja esitama majandusliku põhjenduse IT süsteemide arendusprojektidele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}