{"uuid": "8be57415-2df4-d972-d53e-3aaca24b303d", "code": "MTAT.08.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Intelligent Transportation Systems", "et": "Arukad transpordisüsteemid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT06", "structural_unit_name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT06", "name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This class will include but not limited to the following topics:\n*Introduction to Intelligent Transportation Systems\n*Advanced Transportation management systems\n*Advanced Travel Information Systems\n*Safety and Advanced Driver Assistance Systems\n*Environmental Aspect of ITS\n*Communication Technology and Applications in ITS\n*ITS Standards and Architecutre \n*ITS Telecommunication\n*Mobile Applications\n*ITS and Security\n*ITS Policy Issues\n*Careers in the ITS Field", "et": "Õppeaines käsitletakse muuhulgas järgmisi teemasid:\n*Sissejuhatus arukatesse transpordisüsteemidesse\n*Avanseeritud transpordihalduse süsteemid\n*Avanseeritud reisi-informatsiooni süsteemid\n*Turvalisus ja avanseeritud juhi-abi süsteemid\n*ITS keskkonna-aspektid\n*Kommunikatsioonitehnoloogia ja selle rakendamine ITS-s\n*ITS standardid ja arhitektuur\n*ITS telekommunikatsioon\n*Mobiilsed rakendused\n*ITS ja turvalisus\n*ITS reeglistike temaatika\n*Karjäär ITS vallas"}, "objectives": [{"en": "This is an introductory course to the field of Intelligent Transportation Systems (ITS). The course aims to enlighten the importance of using information and communications technologies in transport through ITS. The course will introduce the basic concepts and principles of systems integration and technology implementation applied to intelligent transportation systems. Moreover, the course will cover the key technologies in sensing, communication, and data management and techniques for system evaluation, including automatic vehicle location and identification, dynamic control systems, travel information systems, and incident detection systems. In addition, the course gives an overview of ITS products and services as well as economic, social, and environmental issues in ITS implementation.", "et": "Aine eesmärgiks on heita valgust info- ja kommunikatsioonitehnoloogia kasutamise tähtsusele transpordi vallas läbi arukate transpordisüsteemide (ITS - Intelligent Transportation Systems). Kursusel tutvustatakse süsteemide integreerimise ja tehnoloogiakasutuse  põhikontseptsioone ja printsiipe rakendatuna arukates transpordisüsteemides. Lisaks katab kursus võtmetehnoloogiaid nii seires, kommunikatsioonis ja andmehalduse vallas kui ka tehnoloogiaid süsteemide hindamisel, sealhulgas automaatset sõidukite positsioneerimist ja tuvastust, dünaamilisi juhtimissüsteeme, reisi-info süsteeme ning juhtumite avastamissüsteeme. Lisaks annab kursus ülevaate ITS teenustest ja lahendustest, sealhulhas majanduslikest, sotsiaalsetest ja keskkonna-alastest aspektidest ITS realisatsioonides."}], "learning_outcomes": [{"en": "At the completion of this course the students will be able to:\n*demonstrate a clear understanding of the role of ITS and where technology solutions have succeeded and failed.\n*demonstrate critical thinking in evaluating the range of technologies implemented in ITS applications.\n*develop the ability to assess how technology solutions can be used to solve transportation issues or problems\n*develop the ability to evaluate the social and environmental impact of the use of new technologies in ITS.\n*plan, design and manage the implementation of an ITS project\n*explore ITS applications at world wild level.", "et": "Kursuse läbinud tudeng:\n*omab head arusaama ITS rollist ning olukordadest, kus vastavad tehnoloogilised lahendused on õnsuudab mõelda kriitiliselt hinnates ITS rakendustes realiseeritud teholoogiaid\n*on arendanud välja võime hinnata tehnoloogiliste lahenduste kasutatavust transpordiprobleemide lahendamisel\n*oskab hinnata sotsiaalseid ja keskkonna mõjusid uute ITS tehnoloogiate kasutamisel\n*oskab planeerida, kujundada ja hallata ITS projekti realisatsiooni\n*suudab uurida ITS rakandusi globaalsel tasemel"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}