{"uuid": "e76558f2-9bb2-625c-359c-603938c9e70c", "code": "MTAT.03.227", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Machine Learning", "et": "Masinõpe"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT02", "structural_unit_name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT02", "name": {"en": "Chair of Data Science", "et": "andmeteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course of machine learning is about methodologies and algorithms allowing computer programs to learn from data (examples) and by this become better in solving some given task. The course covers the main principles of machine learning, concentrating on supervised learning algorithms. Acquaintance will be made with the main types of models, such as decision trees, linear models, distance-based models, probabilistic models, ensemble models and artificial neural networks. Practical assignments will be given to build a deeper understanding of the material.", "et": "Masinõppe kursus käsitleb metoodikaid ja algoritme mille abil arvutiprogrammid õpivad andmete (näidete) baasil mingit ülesannet järjest paremini lahendama. Kursusel käsitletakse masinõppe põhiprintsiipe, keskendudes juhendatud õppe (supervised learning) algoritmidele. Tutvutakse masinõppe peamiste mudelitüüpidega, näiteks otsustuspuud, lineaarsed mudelid, kaugus-põhised mudelid, tõenäosuslikud mudelid, ansambelmudelid ja tehisneurovõrgud. Kursuse raames viiakse õpitu kinnistamiseks läbi praktilisi kodutöid."}, "objectives": [{"en": "The main objective of the course is to study principles and methods of machine learning from theoretical and practical aspects.", "et": "Kursuse üldeesmärk on tutvuda masinõppe printsiipide ja meetoditega teoreetilisest ja praktilisest aspektist."}], "learning_outcomes": [{"en": "Upon successful completion of this course, students should be able to:", "et": "Kursuse edukalt läbinud üliõpilane on võimeline:"}, {"en": "- recognize situations where machine learning methods could be applied;", "et": "- tundma ära olukorrad, kus võiks kaaluda masinõppe meetodite rakendamist;"}, {"en": "- for a given task recognize which subfield of machine learning it belongs to;", "et": "- etteantud ülesande puhul tundma ära, millisesse masinõppe alamvaldkonda see kuulub;"}, {"en": "- describe the principles behind the main supervised learning algorithms and explain the meaning of assumptions made by these algorithms for a particular application field;", "et": "- kirjeldama enimkasutatud juhendatud õppe algoritmide tööpõhimõtteid ning selgitama, mida nende algoritmide tehtavad eeldused konkreetse rakendusvaldkonna jaoks tähendavad;"}, {"en": "- in practice implement a solution using supervised machine learning algorithms.", "et": "- oskama praktikas teostada juhendatud masinõppe algoritme rakendavat lahendust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}