{"uuid": "d629e3bb-f66b-63af-3d72-5b767514b144", "code": "MTAT.07.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Applied Cryptography", "et": "Rakenduslik krüptograafia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT04", "structural_unit_name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT04", "name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The use of cryptographic libraries for encrypting files and communication, authentication methods, integrity protection, public key infrastructures, composition of secure protocols, secure methods for obtaining random bits, smartcards, digital signatures.", "et": "Levinud tarkvareteekide kasutamine failide ja muu andmeside krüpteerimiseks, autentimine, dokumentide võltsimiskindluse tagamine, avaliku võtme infrastruktuurid, turvaliste protokollide koostamine, juhubittide turvaline kogumine, kiipkaardid, digitaalsed allkirjastamisprotokollid."}, "objectives": [{"en": "Students taking the course will know how to correctly use cryptographic primitives like hash functions, signatures, symmetric and asymmetric encryption in practical software development.", "et": "Aine läbinud üliõpilased oskavad tarkvarasüsteemide arendamisel korrektselt kasutada krüptograafia primitiive nagu räsifunktsioonid, signatuurid, sümmeetrilised ja asümmeetrilised krüptosüsteemid."}], "learning_outcomes": [{"en": "Students will learn how to use popular programming tools to implement various cryptographic constructions. They get practical experiences how to employ cryptographic protocols and public key infrastructure for enforcing practical security goals.", "et": "Üliõpilane oskab kasutada levinud programmeerimisvahendeid erinevate krüptograafiliste konstruktsioonide realiseerimiseks. Üliõpilane omandab praktilise kogemuse, kuidas kasutada krüptograafilisi protokolle ja  avaliku võtme infrastruktuuri erinevate turvaeesmärkide saavutamiseks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}