{"uuid": "77e7f0c5-d6fc-2d26-dde9-661c626cafc8", "code": "MTAT.03.325", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Software Product Management", "et": "Tarkvaratoodete juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course provides an introduction to digital product management. We begin with the business model of a digital product, discuss how to come up with ideas and innovate digital products, learn about customers' needs via user research, manage requirements and work with the concept of MVP, how to do user testing, manage the product roadmap, manage risks, and discuss product metrics.", "et": "Kursus tutvustab tehnikaid ärimudelite genereerimiseks, ärijuhtude analüüsiks, prioriteetide määramiseks, toote strateegia väljatöötamise ja tarkvara väljalasete planeerimiseks."}, "objectives": [{"en": "This course introduces the fundamentals of software product management, beginning with an initial idea, the business model, aspects of customer perspectives, minimum viable product, continuous development, and measuring various aspects, for successful management of a software product. The course is well suited for students who seek to gain a fundamental understanding of digital product management or who wish to pursue a career as a product manager.", "et": "See kursus tutvustab tarkvaratoodete haldamise põhialuseid, alustades algsest ideest, ärimudelist, kliendi perspektiivide aspektidest, minimaalsest elujõulisest tootest, pidevast arendusest ja erinevate aspektide mõõtmisest tarkvaratoote edukaks haldamiseks. Kursus sobib hästi üliõpilastele, kes soovivad saada põhjapanevaid teadmisi digitaalsest tootejuhtimisest või kes soovivad teha karjääri tootejuhina."}], "learning_outcomes": [{"en": "Upon completing this course, students will be able to:", "et": "Kursuse edukal lõpetamisel omandab tudeng oskused:"}, {"en": "* Describe, analyze, and develop a business model for a digital product", "et": "* Kirjeldada, analüüsida ja arendada digitaalse toote ärimudelit"}, {"en": "* Apply different ideation techniques for product innovation, and conduct user research to understand user needs", "et": "* Rakendada erinevaid tooteinnovatsiooni tehnikaid ja viia läbi kasutajauuringuid, et mõista kasutaja vajadusi"}, {"en": "* Elicit and formulate requirements for digital products, and understand what constitutes a good user experience", "et": "* Lihtsustada ja sõnastada nõudeid digitaalsetele toodetele ning mõista, mis on hea kasutajakogemus "}, {"en": "* Define and determine the minimum viable product of a digital product", "et": "* Määratleda ja määrata digitaalse toote minimaalne elujõuline toode"}, {"en": "* Conduct user testing, manage risks associated with digital products, and work with a roadmap of the digital product", "et": "* Teostada kasutaja testimist, hallata digitaalsete toodetega seotud riske ja töötada digitaalse toote teekaardiga"}, {"en": "* Use quantifiable data to monitor, analyze, and assess the performance of a digital product", "et": "* Kasutage mõõdetavaid andmeid digitaalse toote tulemuslikkuse jälgimiseks, analüüsimiseks ja hindamiseks"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}