{"uuid": "256e15c7-a8be-8cee-7857-b572759d5577", "code": "MTAT.05.082", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Coding Theory", "et": "Kodeerimisteooria"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT04", "structural_unit_name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT04", "name": {"en": "Chair of Security and Theoretical Computer Science", "et": "andmeturbe ja teoreetilise arvutiteaduse õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course covers the following topics: communications model, channels, Hamming distance, maximum-likelihood decoding, linear codes, Hamming code, concatenated codes, the Singleton bound, the Hamming bound, the Gilbert-Varshamov bound, Reed-Solomon codes, decoding of RS codes, Tanner graphs, expander codes, network coding.", "et": "Kursus katab järgnevaid teemasid: kommunikatsiooni mudel, kanalid, Hammingu kaugus, maksimaalse tõepära dekodeerimine, lineaarsed koodid, Hammingu koodid, Liitkoodid, Singeltoni tõke, Hammingu tõke, Gilbert-Vashamovi tõke, Reed-Solomoni koodid ja nende dekodeerimine, Tanneri graafid, Ekspanderkoodid, võrkude koodid."}, "objectives": [{"en": "To provide  students with the basic tools from the area of coding theory, which can be later used in computer communications, communication networks, cryptography and data storage.", "et": "Tutvustada tudengitele kodeerimisteooria põhilisi tööriistu, mida saab hiljem kasutada rakendusteks kommunikatsiooni, võrkude, krüptograafia ja andmete arhiveerimise valdkondades."}], "learning_outcomes": [{"en": "After completing this course, the student will be able:", "et": "Pärast kursuse läbimit oskab tudeng:"}, {"en": "*  to use basic concepts in the area of coding theory, such as linear codes, generator and parity-check matrices, decoding algorithms. ", "et": "*  kasutada kodeerimisteooria põhitööriistu, nagu lineaarsed koodid, generaator ja paarsuskontrollimaatriksid ning dekodeerimisalgorimtid;"}, {"en": "*  to read and understand medium-difficulty mathematical and engineering texts in the area;", "et": "*  lugeda ja mõista keskmise raskusega matemaatilisi ja insenertehnilisi teadusartikleid antud valkdonnas;"}, {"en": "*  to construct appropriate codes and decoding methods for a variety of applied problems.", "et": "*  Konstrueerida erinevate praktikas tekkivate olukordade jaoks sobivaid kodeerimis ja dekodeerimismeetodeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}