{"uuid": "618a4529-2175-9a63-4011-19dfa067c460", "code": "MTAT.08.020", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Parallel Computing", "et": "Paralleelarvutused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT06", "structural_unit_name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT06", "name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Motivation for parallel computing. Classification of parallel computers in different aspects, supercomputers, beowulf clusters and HPC. Motivation for parallel computing. Classification of parallel computers in different aspects, supercomputers, linux clusters and HPC. Different approaches and tools for parallel programming. Main applications of parallel computing, problems of linear algebra, graph partitioning methods. Parallel performance estimation. Parallel algorithm design, classification and examples. Optimality of parallel algorithms..", "et": "Paralleelarvutuste motivatsioon. Paralleelarvutite klassifikatsioon eri vaatenurkadest, superarvutid, linux-klastrid ja HPC. Paralleelprogrammeerimise vahendid ja erinevad lähenemisviisid. Põhilised rakendused kus läheb vaja paralleelarvutusi, lineaaralgebra ülesanded, graafide partitsioneerimise erinevaid meetodeid. Paralleelprogrammide jõudluse hindamine. Paralleelalgoritmide iseärasused, paralleelalgoritmide klassifikatsioon ja näited. Paralleelalgoritmide optimaalsuse küsimus."}, "objectives": [{"en": "The course gives an overview of parallel computing in theory and practice. Parallel algorithms together with different parallel programming models are discussed in the view of different parallel computer architectures. The studying process assumes the students to participate actively in the programming classes on linux workstations using MPI (Message Passing Interface) and OpenMP libraries.", "et": "Kursus annab ülevaate paralleelarvutuste põhimõtetest nii teoorias kui ka praktikas. Käsitletakse paralleelalgoritme koos erinevate paralleelprogrammeerimise mudelitega eri tüüpi\nparalleelarhitektuuridele. Õppetöö eeldab regulaarset iseseisvat tööd linux-tööjaamadel kasutades MPI (Message Passing Interface) ja OpenMP teeke."}], "learning_outcomes": [{"en": "Elementary skills for writing parallel programs using a high level programming language and message passing library. Different parallelisation techniques and environments are learned. Skills for designing parallel algorithms is developed.", "et": "Omandatakse elementaarne paralleelprogrammide kirjutamisoskus kasutades kõrgetasemelist programmeerimiskeelt ja teateedastusteid. Omandatakse teadmised erinevatest paralleliseerimistehnikatest ja keskkondadest. Areneb võime iseseisvalt disainida paralleelalgoritme."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}