{"uuid": "ecd1cb2e-219f-4556-b9e9-e2ac37f0c9e9", "code": "MTAT.08.024", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Distributed Systems Seminar", "et": "Hajussüsteemide seminar"}, "credits": 12, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT06", "structural_unit_name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT06", "name": {"en": "Chair of Distributed Systems", "et": "hajussüsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 4, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Distributed systems are becoming more and more important in current scientific and IT developments. The goal of this seminar is to get an insight into the distributed world of possibilities (such as GRID, Peer-to-Peer, parallel computing etc), solutions and open scientific problems development. Participants will have to to prepare one talk or a survey paper per semester and to take an active part in discussions.", "et": "Hajussüsteemid on on saamas oluliseks osaks tänapäevase teaduse ja infotehnoloogia arengus. Antud seminari eesmärgiks on tutvuda erinevate võimaluste, lahenduste ning teaduslike probleemidega erinavate hajussüsteemide arengus (GRID, P2P, paralleelarvutused jne). Seminaril osalejailt oodatakse ühe ettekande tegemist või ülevaateartikli koostamist semestris ja aktiivset osalemist aruteludes."}, "objectives": [{"en": "Topics of the seminar are GRID, P2P, distributed systems and computations on these architectures. The aim is to study various distributed systems, to work with modern technical and scientific literature, to carry out tests and computer experiments, to write an overview article and to practice oral presentation skills.", "et": "Seminari teemaks on GRID-, P2P-, hajus- ja parallellarvutused ning -süsteemid. Eesmärgiks on töötada iseseisvalt tehniliste ning teaduslike materjalidega, sooritada arvutieksperimente ning teste hajussüsteemidel, koostada ülevaateartikleid, harjutada suulise ettekande esitust."}], "learning_outcomes": [{"en": "Students will develop the skills to carry out research in the area of distributed systems. The goal is to learn working with the most recent scientific literature in distributed systems, as well as advance the presentation and scientific writing skills.", "et": "Tudeng omandab oskuse läbi viia teaduslikku uurimisprojekti hajussüsteemide valdkonnas. Eesmärk on õppida töötama kõige värskema teaduskirjandusega hajussüsteemide valdkonnast ning harjutada nii esinemisoskust kui ka teadulikku kirjaoskust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}