{"uuid": "bb0b8113-c34b-629f-7c2b-ff51c7ce46b6", "code": "MTAT.03.083", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Systems Modelling", "et": "Süsteemide modelleerimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT05", "structural_unit_name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT05", "name": {"en": "Chair of Software Engineering", "et": "tarkvaratehnika õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course will impart in-depth knowledge of software-intensive systems modeling techniques. The practice sessions will develop skills required by system analysts and software architects. Formal methods that can find subtle bugs in a system design will be introduced.", "et": "Kursus annab põhjalikke teadmisi tarkvara-intensiivsete süsteemide modelleerimise tehnikate kohta.  Praktikumides arendatakse süsteemianalüütikutele ja tarkvaraarhitektidele vajalikke oskusi. Tutvustatakse formaalmeetodeid, millega saab tuvastada raskestileitavaid vigu süsteemi disainis."}, "objectives": [{"en": "The objectives of the course are:", "et": "Kursuse eesmärgid on järgmised:"}, {"en": "- To provide in-depth knowledge of modeling and formal specification languages for software-intensive systems.", "et": "- Jagada põhjalike teadmisi tarkvara-intensiivsete süsteemide modelleerimisest ja formaalsest spetsifitseerimisest."}, {"en": "- To provide methodological skills for using models to design, analyze, and implement software systems.", "et": "- Õpetada metodoloogilisi oskusi mudelite kasutamiseks tarkvarasüsteemide projekteerimisel, arendamisel ja hooldamisel."}, {"en": "- To introduce formal methods for simulation and verification of software models.", "et": "- Tutvustada formaalseid meetodeid mudelite simuleerimiseks ja verifitseerimiseks."}], "learning_outcomes": [{"en": "On successful completion, students should be able to:", "et": "Aine edukalt läbinud tudeng oskab..."}, {"en": "1. Apply standard system modeling techniques, specifically the main types of diagrams in UML, at an advanced level of proficiency.", "et": "1. Rakendada edasijõudnu tasemel standardseid süsteemide modelleerimise tehnikaid, eelkõige levinumaid UML diagrammi liike."}, {"en": "2. Explain major issues that arise when translating fuzzy business requirements and statements into a model that is precise enough to be used for implementing a software system addressing such requirements.", "et": "2. Kirjeldada olulisemaid probleeme, mis tekivad hägusate ärinõuete teisendamisel mudeliks, mis on piisavalt täpne nende nõuetele vastava tarkvarasüsteemi teostamiseks."}, {"en": "3. Formalize the behavior and requirements of a software system in order to apply computer-aided verification tools.", "et": "3. Formaliseerida tarkvarasüsteemi käitumist ja nõudmisi, et saaks rakendada arvutipõhiseid verifitseerimisvahendeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}