{"uuid": "7d9d9254-d685-bbe3-7d82-180b7b2a7304", "code": "MTAT.03.312", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Informatics at School", "et": "Informaatika koolis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT03", "structural_unit_name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT03", "name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Informatics is handled and viewed as a separate subject in the Estonian national curriculum and as a subject integrated to other lessons. Learner's digital competence is developed as a capability of using digital technology and to evaluate how relevant and trustworthy used digital devices are. Various aspects of office software (wordprocessing, spreadsheets, presentations) and the usability of the software in the comprehensive school level is discussed. A brief introductory overview of the programming concepts and capabilities is given. Audio, image and video editing programs are introduced. An overview of computer science research at school is given. The theats on the Internet are explained and various techniques for searching for information are introduced.", "et": "Käsitletakse ja vaadeldakse informaatikat kui õppeainet Eesti riiklikes õppekavades nii eraldi õppeainetena kui lõimituna teiste õppeainetega. Arendatakse õppuri digipädevust kui suutlikkust kasutada digitehnoloogiat ning hinnata digivahendite asjakohasust ja usaldusväärsust. Käsitletakse kontoritarkvara erinevaid programme (tekstitöötlus, tabelitöötlus, esitlustarkvara) ja nende rakendatavust üldhariduskoolides. Antakse põgus ülevaade programmeerimise olemusest ja võimalustest. Käsitletakse heli-, pildi- ja videotöötluse programme. Antakse ülevaade informaatika-alastest uuringutest koolis. Selgitatakse ohtusid, mis internetis varitsevad ja tutvustatakse erinevaid võtteid info otsimiseks."}, "objectives": [{"en": "Goal of the course is to give the participants an overview of the informatics at school.", "et": "Kursuse eesmärgiks on anda osalejatele ülevaade informaatika käsitlemisest üldhariduskoolides."}], "learning_outcomes": [{"en": "Student who has passed this course:", "et": "Kursuse läbinud üliõpilane"}, {"en": "* knows and is capable of naming the regulations of informatics according to the national curricula;", "et": "* tunneb ja suudab nimetada informaatika aine nõudeid riiklikes õppekavades;"}, {"en": "* knows and is able to describe the content of informatics taught at school;", "et": "* on kursis ja suuteline kirjeldama üldhariduskoolis õpetatava informaatika sisu;"}, {"en": "* is capable of doing reasonable choice to study becoming informatics teacher;", "et": "* on suuteline tegema mõtestatud valiku informaatikaõpetajaks õppimise suhtes;"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}