{"uuid": "834a5df7-5c24-148d-f95e-7239f648a17c", "code": "MTAT.03.104", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Seminar on Informatics Didactics", "et": "Informaatika didaktika seminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT03", "structural_unit_name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTAT03", "name": {"en": "Chair of Programming Languages and Systems", "et": "programmeerimiskeelte ja -süsteemide õppetool"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "LTAT"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course takes place as an active learning seminar. The following topics will be addressed: research strategies, qualitative, quantitative, and mixed methods research; research ethics. In the seminars, specific master's theses to be performed will be analyzed.", "et": "Kursus toimub aktiivõppe seminarina. Käsitlemisele tulevad: uurimistrateegiad, kvalitatiivsed, kvantitatiivsed ja kombineeritud uurimused; uurimistöö eetika. Seminarides analüüsitakse konkreetseid teostatavaid magistritöid."}, "objectives": [{"en": "The aim of the seminar is to prepare students for independent research. They get to know and critically read the specialized literature related to the topic. The main stages of doing and writing research (incl. developmental research) are introduced.", "et": "Seminari eesmärk on valmistada üliõpilasi ette iseseisvaks uurimistööks. Õpitakse tundma ja kriitiliselt lugema teemaga seonduvat erialakirjandust. Tutvutakse uurimistöö (s.h arendusuuringu) tegemise ja kirjutamise peamiste etappidega."}], "learning_outcomes": [{"en": "After passing this course the student\nA student who has completed the course:\n- is able to plan the research and its various stages,\n- knows the main research strategies and methods used in pedagogy, their possibilities, and limitations,\n-  in the creation of academic texts uses scientific language, including the rules of reference and citation,\n- knows the terminology of didactics of informatics,\n- is able to evaluate the correctness and limitations of the performed research,\n- is able to carry out research with the assistance of a supervisor,\n- can make an academic presentation.", "et": "Kursuse läbinud üliõpilane: \n- planeerida uurimistööd ja selle erinevaid etappe, \n- teab põhilisi pedagoogikas kasutavaid uurimisstrateegiaid ja -meetodeid, nende võimalusi ja piiranguid,\n- juhindub akadeemilisi tekste luues teaduskeele tavadest, sh refereerimis- ja viitamisreeglitest,\n- tunneb informaatika didaktika alast terminoloogiat,\n- oskab hinnata teostatud uurimuste korrektsust ja vigu,\n- on võimeline juhendaja kaasabil viima läbi uurimusi,\n- oskab teha akadeemilist ettekannet."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}