{"uuid": "46dea6aa-56f5-8a94-5b88-da6ab6fb091e", "code": "MTAT.00.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Doctoral Thesis", "et": "Doktoritöö"}, "credits": 180, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTAT", "structural_unit_name": {"en": "Institute of Computer Science", "et": "arvutiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "LTAT", "name": {"en": "Institute of Computer Science", "et": "arvutiteaduse instituut"}, "email": "unitartucs@ut.ee", "phone": "+372 737 5445", "webpage_url": "https://cs.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 8, "assessment_scale": {"code": "defence", "et": "Kaitsmine", "en": "defence"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The PhD studies will be performed in written form according to demands of University of Tartu. The PhD studies and disputation will be declared officially successful after the scientific council of the Institute of Computer Science has delivered positive judgement and attested it.", "et": "Doktoritöö vormistatakse kirjalikult vastavalt Tartu Ülikoolis kehtestatud doktoritöödele esitatavatele nõuetele. Doktoritöö tulemused ja avaliku kaitsmise protseduur loetakse edukaks kui vastava otsuse on teinud ja kinnitanud Tartu Ülikooli arvutiteaduse  instituudi nõukogu."}, "objectives": [{"en": "PhD students' research aims to acquire the skills and technical competence necessary for planning and conducting research and present his/her results of study. Research must lead to completion of independent study proposing an original solution to a substantial problem in a particular research field, which presupposes the publication of at least three research papers in leading international journals.", "et": "Doktorandi teadustöö eesmärgiks on omandada uurimistöö läbiviimise oskused ja tehnilised võtted. Teadustöö tulemusena valmib iseseisev uurimus, milles on esitatud konkreetse teadusvaldkonna mõne olulise probleemi argumenteeritud originaalne lahendus, mille tulemusena on võimalik avaldada vähemalt kolm uurimuslikku artiklit vastava eriala juhtivates rahvusvahelise levikuga väljaannetes."}], "learning_outcomes": [{"en": "PhD student who had succesfully completed the course:", "et": "Kursuse edukalt läbinud doktorant:"}, {"en": "-has deep knowledge in his/her field of study, is well informed about new developments of research", "et": "- omab põhjalikke teadmisi oma erialal ning on kursis uuemate uurimissuundadega"}, {"en": "-is capable to identify and formulate research problems", "et": "- on võimeline loovalt püstitama ja sõnastama uurimisküsimusi"}, {"en": "-is capable to design and initiate research projects that will lead to new knowledges and solutions", "et": "- on võimeline kavandama ja algatama uurimis- ja arendusprojekte, mis viivad uute teadmiste ja lahendusteni"}, {"en": "-is able to analyse and synthesize information found in the process of reasearch and known before", "et": "- suudab analüüsida ja sünteesida uurimistöö käigus saadud ning juba olemasolevat teaduslikku informatsiooni"}, {"en": "-is able to evaluate results of his/her research in broader background", "et": "- oskab hinnata oma uurimisvaldkonna teadustulemusi laiemas kontekstis ja neid teiste valdkondadega siduda"}, {"en": "-is able to perform the study results into the form of internationally accepted publication", "et": "- oskab uurimistöö tulemusi esitada rahvusvahelisel tasemel teadusartiklina"}, {"en": "-is well informed about the process of publishing scientific articles in international pre-reviewed journals", "et": "- teab kuidas toimub teadusartiklite avaldamine rahvusvahelistes eelretsenseeritavates ajakirjades"}, {"en": "-is able to evaluate and analyse his/her study results", "et": "- oskab olemasolevaid ning enda poolt saadud teadustulemusi kriitiliselt hinnata ja analüüsida"}, {"en": "-is able to take ethical position and understands the responsibility in creating and using the results of research", "et": "- oskab anda eetilisi hinnanguid ning saab aru, milline on vastutus teadustulemuste loomisel ja kasutamisel"}, {"en": "-is able to estimate the impact of scientific achievements in the broader background of society", "et": "- on võimeline hindama teadussaavutuste mõju laiemas ühiskondlikus kontekstis"}, {"en": "-is able to make independently strategic desicions", "et": "- on suuteline iseseisvalt langetama strateegilisi otsuseid"}, {"en": "-is able to work in international scientific team", "et": "- on võimeline töötama rahvusvahelises töö- ja õpikeskkonnas"}, {"en": "-is able to present and argue for his/her scientific results in international scientific events", "et": "- oskab esitada ja põhjendada oma teadustulemusi rahvusvahelistel teadusüritustel"}, {"en": "-has good communication, management and public speaking skills.", "et": "-omab häid suhtlemis-, juhtimis- ja koostööoskusi"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}