{"uuid": "78a7303f-4b71-f52f-0c99-a2a26f564ce7", "code": "MTMM.00.354", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Combinatorics", "et": "Kombinatoorika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Combinatorial counting (factorials, estimates), double-counting (Sperner's lemma and theorem, Brouwer's fixed point theorem), Eulerian and planar graphs (five-color problem), trees and spanning trees, extremal graph theory (Turan's theorem), finite projective planes (Fano plane, orthogonal latin squares), finite probability spaces, Ramsey theory (Ramsey theorem, lower bound for Ramsey numbers).", "et": "Kombinatoorne loendamine (faktoriaalid, hinnangud), topeltloendamine (Sperneri lemma ja teoreem, Brouweri püsipunktiteoreem), Euleri ja tasandilised graafid (viievärviprobleem), puud ja aluspuud, ekstremaalne graafiteooria (Turani teoreem), lõplikud projektiivsed tasandid (Fano tasand, paarikaupa ristuvad ladina ruudud), lõplikud tõenäosusruumid, Ramsey teooria (Ramsey teoreem, Ramsey arvude alamtõke)."}, "objectives": [{"en": "The goal of the course is to expose students to a number of different subfields of combinatorics and develop their problem-solving ability in those areas.", "et": "Kursuse eesmärgiks on tutvustada üliõpilastele mitmesuguseid erinevaid kombinatoorikavaldkondi ja arendada neisse valdkondadesse kuuluvate ülesannete lahendamise oskust."}], "learning_outcomes": [{"en": "Graduates of the course know and can apply basic combinatorial methods, including counting, double-counting, estimates, basic graph theory (Eulerian and planar graphs, trees, spanning trees, some extremal graph theory, Turan's theorem). They are familiar with finite projective planes, finite probability spaces and some Ramsey theory.", "et": "Kursuse läbinud üliõpilased teavad ja oskavad rakendada põhilisi kombinatoorika meetodeid, sealhulgas loendamist, topeltloendamist, hindamist, lihtsamat graafiteooriat (Euleri ja tasandilised graafid, puud, aluspuud, ekstremaalne graafiteooria, Turani teoreem). Nad tunnevad lõplikke projektiivseid tasandeid, lõplikke tõenäosusruume ja sissejuhatavat osa Ramsey teooriast."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}