{"uuid": "3d37f3db-24e2-1069-a5f9-cc986aefd6f6", "code": "MTMM.00.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-31T10:13:25", "title": {"en": "Algebra I", "et": "Algebra I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "d6d05e46-8ca2-8d6a-3329-b82476787db5", "code": "MTMM.00.342", "title": {"en": "Transition to Advanced Mathematics", "et": "Matemaatiline maailmapilt"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-02T13:22:30"}]}, "overview": {"description": {"en": "Basic algebraic structures (group, ring, field, vector space) on the level of definitions and examples. Linear algebra (base of vector space, Laplace's theorem on determinants, rank of matrix, systems of linear equations, linear mappings, eigenvectors and eigenvalues of linear transformations, inner product spaces). Elementary theory of complex numbers and polynomials in one variable.", "et": "Kursus annab mõistete ja näidete tasemel ülevaate põhilistest algebra struktuuridest (rühm, ring, korpus, vektorruum), süvendab teadmisi lineaaralgebrast (vektorruumi baas, Laplace`i teoreem, maatriksi astak, homogeense lineaarvõrrandite süsteemi lahendite fundamentaalsüsteem, lineaarkujutuse maatriks, lineaarteisenduse omavektorid ja omaväärtused),  tutvustab kompleksarve ja ühemuutuja polünoome (jäägiga jagamine, juured, kordsed tegurid) ja eukleidilisi ruume."}, "objectives": [{"en": "The aim of the course is to give basic knowledge in abstract algebra that is a necessary counterpart of any university education in mathematics. To support the ability of critical thinking, developing mathematical oral self-expression skills. The student develops learning skills related to numbers and calculation throughout the topics and exercise types covered in the course. The student has gained support during preparation for oral examination.", "et": "Anda algebra-alased baasteadmised, mis moodustavad igasuguse matemaatilise kõrghariduse hädavajaliku koostisosa. Kriitilise mõtlemise oskuse toetamine, matemaatilise suulise eneseväljendusoskuse arendamine. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes. Toetada õppijat suuliseks eksamiks valmistumisel."}], "learning_outcomes": [{"en": "After passing the course a student knows:\n1. what is an algebraic operation and how to check its main properties;\n2. the basic algebraic structures and their most important examples, understands the meaning of isomorphism;\n3. the operations with complex numbers, both in algebraic and trigonometric form;\n4. how to check that the given vector system is a base of a vector space;\n5. what is the rank of a matrix and how to find it;\n6. how to solve a system of linear equations and to represent a solution in vector form;\n7. the main properties of polynomials and algebraic operations with them,\nin particular division with remainder;\n8. the basics of the division theory of commutative rings with no zero divisors (invertible, irreducible, associated element);\n9. Euclid algorithm;\n10. what is a root of a polynomial and the multiplicity of a root;\n11. what is a linear mapping and its matrix, is able to check linearity and to find the matrix of a linear transformations in a given basis;\n12. is able to find eigenvalues and eigen vectors of a given linear transformation;\n13. knows the Gram-Schmidt ortogonalization method ;\n14. is able to find a diagonal form of a real symmetric matrix;\n15. chooses suitable mathematical conceptions for problems, and applies these conceptions while solving problems;\n16. investigates and compiles logic reasonings within the framework of course material;\n17. has discussed on mathematical conceptions (essence, proof, examples) in oral exam.", "et": "Selle kursuse läbinud üliõpilane:\n1.teab, mis on algebraline tehe ja oskab kontrollida tehete tähtsamaid omadusi;\n2. tunneb tähtsamate algebraliste struktuuride mõisteid ja nende olulisemaid näiteid, saab aru isomorfismi mõiste tähendusest;\n3. oskab teostada arvutusi kompleksarvudega, selleks neid vajaduse korral trigonomeetrilisele kujule viies;\n4. tunneb erinevaid vektorruumi baasi defineerimise võimalusi, oskab kindlaks teha, kas antud vektorite süsteem on lineaarselt sõltumatu või moodustajate süsteem;\n5. teab maatriksi astaku mõistet ja selle omadusi ning oskab seda leida;\n6. oskab lahendada lineaarvõrrandisüsteeme ja esitada nende üldlahendeid vektorkujul; \n7.tunneb polünoomide omadusi ja oskab nendega arvutada, sealhulgas teostada ühemuutuja polünoomide jäägiga jagamist;\n8. teab kommutatiivsete ringide jaguvuse teooria algeid (nullitegurid, pööratavad ja taandumatud elemendid, elementide assotsieeritus), oskab tuua sobivaid näiteid täisarvude ja polünoomide ringides; \n9. valdab Eukleidese algoritmi;\n10. teab, mis on polünoomi juur ja juure kordsus, tunneb seost polünoomide juurte ja jaguvuse vahel, oskab eraldada kordseid juuri;\n11. tunneb lineaarkujutuse mõistet osates kindlaks teha, kas antud kujutus on lineaarne, tunneb seost lineaarkujutuste ja maatriksite vahel, oskab leida lineaarteisenduse maatriksit;\n12. oskab leida lineaarteisenduse omaväärtusi ja omavektoreid;\n13. tunneb Gram-Schmidti ortogonaliseerimisprotsessi;\n14. oskab leida reaalarvulise sümmeetrilise maatriksiga sarnast diagonaalmaatriksit;\n15. valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid ning rakendab neid ülesannete lahendamisel;\n16. uurib ja koostab loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames;\n17. on arutlenud suulisel lõpueksamil matemaatiliste kontseptsioonide olemuse, tõestuse ja näidete üle."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}