{"uuid": "c23543a7-4d2e-fe69-c98d-c62f8e3e89f4", "code": "MTMM.00.340", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Calculus I", "et": "Kõrgem matemaatika I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Linearalgebra. Functions, limits and continuity. Derivatives and applications of derivatives. Antiderivatives, linear first order differential equations. Definite integrals and their applications, improper integrals. Vectors in space, their dot and vector product. Lines and planes in space. Complex numbers.", "et": "Kõrgema matemaatika kursus, milles käsitletakse järgmisi teemasid: maatriksid, determinandid, lineaarvõrrandisüsteemid, funktsioonid, funktsiooni piirväärtus ja pidevus, jadad, funktsiooni tuletis ja diferentsiaal, määramata integraal, määratud integraal, päratud integraalid, lineaarsed I järku diferentsiaalvõrrandid, vektorid ruumis, skalaarkorrutis, vektorkorrutis, sirgeda ja tasandid ruumis, kompleksarvud."}, "objectives": [{"en": "This course gives basic knowledge in higher mathematics which has important role in nature sciences. The student develops learning skills related to numbers and calculation throughout the topics and exercise types covered in the course.", "et": "See kursus annab algteadmised kõrgemas matemaatikas. Kursusel on rakenduslik tähtsus loodusteadustes. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes."}], "learning_outcomes": [{"en": "After passing this course the student:\t", "et": "Selle kursuse läbinud üliõpilane:"}, {"en": "1. Knows definitions of matrix, inverse matrix; is able to multiplicate matrices and find inverse matrix. Knows properties of determinants, is able to evaluate determinants. ", "et": "1. Teab maatriksi, pöördmaatriksi mõistet ja oskab teostada tehteid maatriksitega ning leida pöördmaatriksit. Oskab arvutada n-ndat järku determinanti, teab determinantide põhiomadusi."}, {"en": "2. Is able to solve systems of linear equations.  ", "et": "2. Oskab lahendada lineaarseid võrrandisüsteeme. Teab Gaussi meetodit."}, {"en": "3. Knows the definition of the function and general classes of functions and their graphs.", "et": "3. Teab funktsiooni mõistet, funktsioonide liigitust. Oskab ära tunda põhiliste elementaarfunktsioonide  graafikuid."}, {"en": "4. Is familiar with the main properties of the limit, is able to find limits. Knows, what is continous function.", "et": "4. Oskab arvutada piirväärtust ja teab piirväärtuse põhiomadusi. Teab pideva funktsiooni mõistet."}, {"en": "5. Is familiar with the notions of the derivative, the differential; is able to find derivatives and differentials; knows the most important applications of derivatives.", "et": "5. Teab tuletise ja diferentsiaali mõisteid; teab tuletise põhilisi omadusi ja oskab neid leida; teab tuletise ja diferentsiaali tähtsamaid rakendusi;"}, {"en": "6. Knows the l'Hospital rule and knows how to use it;", "et": "6. Teab L'Hospitali reeglit ja oskab seda rakendada;"}, {"en": "7. Knows how to investigate functions, when they are decreasing/increasing and curved/concave.", "et": "7. Oskab uurida funktsiooni ja teab, mis on kasvavad/kahanevad, kumerad/nõgusad funktsioonid;"}, {"en": "8. Knows, what is antiderivates and how to find them in simpler case.", "et": "8. Teab algfunktsiooni mõistet ja oskab leida määramata integraali lihtsamal juhul;"}, {"en": "9. Is able to solve linear first order ordinary differential equations.", "et": "9. Oskab lahendada I järku lineaarseid diferentsiaalvõrrandeid."}, {"en": "10. Knows, what is a Riemann sum and how to calculate it.", "et": "10. Teab, mis on Riemanni summa ja määratud integraal ning oskab neid arvutada."}, {"en": "11. Knows applications of definite integral.", "et": "11. Tunneb määratud integraali rakendusi."}, {"en": "12. Knows, what is improper integral and how to find it.", "et": "12. Teab päratu integraali mõistet ja oskab neid leida."}, {"en": "13. Is able to find vectors dot product, cross product, triple product in space and knows their applications.", "et": "13. Oskab leida ruumivektorite skalaarkorrutist, vektorkorrutist, segakorrutist ning teab nende rakendusi."}, {"en": "14. Is able to construct equation formulas for lines and planes in space, find their position.", "et": "14. Oskab koostada sirgete ja tasandite võrrandeid ruumis ning leida nende vastastikust asendit."}, {"en": "15. Knows complex numbers, their algebraic, geometric and trigonometric formulas, unary and binary operations of them, knows the Euler Formula.", "et": "15. Teab, mis on kompleksarv, selle algebraline, geomeetriline, trigonomeetriline kuju, oskab teostada tehteid kompleksarvudega, teab Euleri valemit."}, {"en": "16. Chooses suitable mathematical conceptions (formulae) for problems, and applies these conceptions while solving problems.", "et": "16. Valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}