{"uuid": "429626fb-46ac-2975-d029-72c7fcfea3ab", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T16:57:33", "title": {"en": "Differential Geometry", "et": "Diferentsiaalgeomeetria"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "LT", "name": {"en": "Faculty of Science and Technology", "et": "loodus- ja täppisteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "label": {"en": "24/25 S regular LT", "et": "24/25 K PÕ LT"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": false, "uuid": "3457dd86-02ae-e75c-6ca3-71eba2e65e51", "code": "MTMM.00.214", "title": {"en": "Differential Equations", "et": "Diferentsiaalvõrrandid"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": false, "uuid": "faff6d17-88e2-3a15-594f-3fbdfa2ec4e0", "code": "MTMM.00.327", "title": {"en": "Analytic Geometry", "et": "Analüütiline geomeetria"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The present course of lectures can be divided into three parts. In the first part the notions of a hypersurface and a vector field are considered. Hypersurface is defined as the level surface of a smooth function. In the first part of lectures we also consider the following structures: the integral curve of a vector field; the vector field on a hypersurface; the tangent space of a hypersurface and an orientation of a hypersurface; Gauss mapping; covariant derivative of a vector field; geodesic curve; the parallel translation of a vector on hypersurface; the shape operator (Weingarten's mapping); the normal curvature; the Gaussian and mean curvatures of a hypersurface. In the second part we consider the algebra of differential forms determined on the space IR^n. We define wedge product of differentials forms and exterior differential. The main structure of the last part of lectures is a parametric surface. We prove the theorem, which states that any hypersurface considered in the first part of lectures is locally diffeomorphic to a parametric surface. This theorem enables us to introduce the local coordinates on a hypersurface. The following structures are also considered in the last part of lectures; first fundamental form of a hypersurface; minimal hypersurfaces; area and volume of a hypersurface; Gauss-Bonnet theorem.", "et": "Diferentsiaalgeomeetria kursus on jaotatud kolmeks osaks.  Esimese osa põhimõisted on hüperpinna mõiste ja vektorvälja mõiste. Hüperpind defineeritakse sileda funktsiooni tasemepinna mõiste abil. Esimeses osas vaadeldakse järgmisi struktuure: vektorvälja  integraaljoon ja tema olemasolu, sile vektorväli hüperpinnal, hüperpinna puutujaruum ja orientatsioon, Gaussi kujutus, vektorvälja hüperpinnal kovariantne tuletis, geodeetiline joon hüperpinnal, paralleelvektorväli hüperpinnal ja paralleelülekanne, Weingarteni kujutus, hüperpinna normaalkõverus ja Gaussi kõverus. Teises osas käsitletakse diferentsiaalvorme n-mõõtmelises ruumis R~n. Vaadeldakse diferentsiaalvormide väliskorrutist, välisdiferentseerimist, integreerimist ja diferentsiaalvormi väärtust vektorväljal. Näidatakse seost vektoranalüüsiga. Kolmanda osa põhiobjekt on parameetriline pind. Tõestatakse, et esimeses osas käsitletud hüperpinna mõiste on lokaalselt ekvivalentne parametriseeritud  pinna mõistega (lokaalsed koordinaadid). Vaadeldakse järgmisi struktuure: esimene fundamentaalvorm, minimaalpind, pinna pindala ja ruumala, eksponentsiaalkujutus, Gauss-Bonnet teoreem."}, "objectives": [{"en": "The aim of the present course of lectures is to explain the methods of studying geometrical objects, which can be developed on the base of differential and integral calculus. The fundamental notions of the present course is the notion of a hypersurface, which is defined as the level surface of a smooth function, and the notion of a vector field. This approach, where hypersurface is considered as the set of solutions of an equation, is very familiar in theoretical physics. Hence the present course of lectures will be useful not only for mathematics students, but also for students of the Faculty of Physics and Chemistry.", "et": "Antud loengute kursuse eesmärk on anda üliõpilastele ettekujutus sellest, millised geomeetriliste objektide uurimismeetodid tekivad diferentsiaal- ja integraalarvutuse baasil. Geomeetria seisukohalt on loengute põhiobjekt hüperpind ja tema uurimismeetodid tuginevad vektorvälja mõistele. Hüperpind on funktsiooni tasemepind ja antud loengute kursuses teda vaadeldakse mistahes dimensiooniga ruumis. Pinna selline käsitlus, kus pind on teatud võrrandi lahendite punktihulk, on väga lähedane teoreetilisele füüsikale ja seetõttu antud loengute kursus võib huvi pakkuda ka füüsika-keemiateaduskonna üliõpilastele."}], "learning_outcomes": [{"en": "Having passed this course of lectures a student\n1. knows the basic notions of a parametrized curve and regular surface;\n2. is able to find the velocity vector, acceleration vector, arc length,\ncurvature and torsion of a parametrized curve;\n3. knows the notions of a natural parameter and the natural parametrization\nof a curve and is able to find the natural parametrization of a curve;\n4. knows the Frenet-Serret-Bartels equations and is able to use the method\nof moving frame;\n5. knows the notion of a vector field and is able to compute the covariant\nderivative of a vector field;\n6. knows the notion of a differential form in the three dimensional space\nand is able to find the wedge product of differential forms and to calculate\nthe exterior differential of a differential form;\n7. knows the notion of a shape operator and its properties;\n8. is able to find the mean curvature, normal curvature and Gaussian\ncurvature of a surface;\n9. recognizes the equation of a geodesic and is able to find the geodesics\non a surface;\n10. knows the Gauss-Bonnet theorem and is able to find the Euler\ncharacteristic of a surface.", "et": "Selle kursuse läbinud üliõpilane:\n1. teab parameetrilise joone ja regulaarse pinna mõisteid;\n2. oskab leida joone kiirusvektorit, kiirendusvektorit, kaarepikkust,\nkõverust ja väänet;\n3. teab, mis on joone loomulik parameeter ja oskab leida joone\nparameetrilist võrrandit, kui parameetriks on           loomulik parameeter;\n4. teab Frenet-Setter-Bartelsi valemeid ja oskab kasutada liikuva reeperi\nmeetodit;\n5. teab, mis on vektorväli ja oskab arvutada vektorvälja kovariantset\ntuletist;\n6. teab, mis on diferentsiaalvorm kolmemõõtmelises ruumis ja oskab arvutada\ndiferentsiaalvormide väliskorrutist ja välisdiferentsiaali;\n7. teab, mis on Weingarteni operaator, ja selle omadusi;\n8. oskab leida regulaarse pinna peakõverust, keskmist kõverust ja Gausi\nkõverust;\n9. teab geodeetilise joone võrrandit ja oskab leida geodeetilist joont\npinnal;\n10. tunneb Gauss-Bonnet teoreemi ja oskab arvutada pinna Euleri\nkarakteristikut."}], "notes": {}}, "grading": {"independent_work": {"et": "Kaks kirjalikku kodutööd (vastavalt joonte teooria ja pinnateooria kohta), loengumaterjalide iseseisev läbitöötamine.\nTwo written homeworks (on the theory of curves and the theory of surfaces), review independently  lecture notes."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Esimese kodutöö põhiteemaks on tasandiliste ja ruumiliste joonte uurimine diferentsiaalarvutuse meetodite abil.\nThe main topic of a first homework is a study of a curve by means of methods of differential calculus."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teise kodutöö põhiteemaks on pindade uurimine diferentsiaalgeomeetria meetoditega. \nThe main topic of the second homework is a study of a surface by means of the methods of differential geometry."}}], "grade_preconditions": {"et": "Iga kodutöö annab maksimaalselt 15 punkti. Eksamile pääseb kui mõlemad kodutööd on sooritatud vähemalt 50% ulatuses, st neid on hinnatud vähemalt 7.5 punktiga.\nEach homework assignment gives maximum 15 points. Admittance to the exam is granted if at least 50% of both homeworks are completed (both of them are graded with at least 7.5 points)."}, "grade_evaluation": {"et": "Kodutööd annavad kuni 30 punkti, kirjalik eksamitöö kuni 70 punkti. Lõplik hinne kujuneb nende kahe summa põhjal.\nFinal grade is composed from the results of written exam (up to 70 points) and homeworks (up to 30 points)."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga.\nAccording to the agreement with lecturer."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Ü. Lumiste, Diferentsiaalgeomeetria.", "recommended_materials": "A. Gray, Modern Differential Geometry of Curves and Surfaces with Mathematica. 1998."}, "participants": {"lecturers": [{"person_uuid": "173621a3-81fc-1b5f-6e4f-c7351ba3f7a9", "person_name": "Viktor Abramov", "structural_unit": {"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "is_responsible": true, "is_teaching": true}], "assistants": ["80a8aa0e-a45b-ef90-3842-c7003f1a4ed6", "b6fe8d94-1b2b-3472-4a2b-4a115459e9c8"]}, "schedule": {"weeks": {"et": "24.-39."}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1. Tasandilised jooned. Joone parameetriline võrrand. Joone kaare pikkus ja kõverus. Vektorväli piki joont.\n1. Plane curves. The parametric equation of a curve. Arc length and curvature of a curve. Vector fields along a curve."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "2. Tasandilise joone evoluut ja evolvent. Kuulsad tasandilised jooned: aheljoon, tsükloid, logaritmiline spiraal, poolkuupparabool, Archimedese spiraal.\n2. The evolute and involute of a plane curve. Famous plane curves: catenary, cycloid, logarithmic spiral, semi-cubic parabola, spiral of Archimedes."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3. Eukleidilise ruumi isomeetriate rühm. Tasandilise joone loomulik võrrand. Tasandiliste joonte fundamentaalne teoreem.\n3. The group of isometries of Euclidean space. The natural equation of a parametrized plane curve. The fundamental theorem of the theory of plane curves."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4. Jooned ruumis. Ruumilise joone kõverus ja vääne. Kruvijoon ja tema üldistused. Viviani joon.\n4.Curves in the space. The curvature and torsion of a space curve. Helix and its generalizations. Viviani's curve"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5. Vektorväljad ruumis IR^n+1. Vektorvälja integraaljoon. Integraaljoone olemasolu. Üheparameetriline teisenduste rühm.\n5. Vector fields in |R^n+1. The integral curve of a vector field. An existence of an integral curve. The one-parameter group of diffeomorphisms."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "6. Pinnad eukleidilises ruumis. Funktsiooni tasemepind. Tasemepinna puutujatasand. Orientatsioon. Vektorväli tasemepinnal. Hüperpind ruumis IR^n+1. Gaussi kujutus.\n6. A notion of a surface in Euclidean space. Level surfaces of a function. The tangent plane of a level surface. A notion of an orientation of a surface. Vector fields on a surface. Hyper surface. The Gauss mapping."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7. Parameetriline n-pind ruumis IR^n+k. Kujutus ja tema diferentsiaal. Jacobi maatriks. Koordinaatjooned. Esimene fundamentaalvorm.\n7. A parametrized n-surface in a space |R^n+1. A tangent mapping and its Jacobi matrix. Coordinate lines. First fundamental form of a surface."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "8. Hüperpinna lokaalne struktuur. Lokaalsed koordinaadid ja lokaalne kaart.\n8. The local structure of a hyper surface. Local coordinates and local chart."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9. Kovariantse tuletise mõiste. Geodeetilised jooned. Geodeetilise joone võrrand. Geodeetilise joone olemasolu.\n9. A notion of a covariant derivative. Geodesics of a surface. The equation of a geodesic. An existence of a geodesic."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "10. Paralleelvektorväljad hüperpinnal. Paralleelülekanne mööda joont.\n10. Parallel transportation of a tangent vector along a curve on a hyper surface."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "11. Hüperpinna Weingarteni operaator. Teoreemid Weingarteni operaatorist. Weingarteni operaatori omaväärtused ja omavektorid.\n11. The shape operator of a hyper surface. Theorems about shape operator. The eigenvectors and eigenvalues of a shape operator."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "12. Hüperpinna normaalkõverus, peakõverus ja peasiht. Hüperpinna Gauss-Kroneckeri kõverus. Gauss-Kroneckeri kõveruse valem.\n12. The normal, principal and mean curvature of a surface. Principal directions. The Gauss curvature of a hyper surface. The formula for computing the Gauss curvature of a surface."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "13. Hüperpinna pindala.\n13. The area of a hyper surface."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14. Minimaalpinnad. Katenoid.\n14. Minimal surfaces. Catenoid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "15. Diferentsiaalvormi mõiste. Väliskorrutis. Välisdiferentsiaal.\n15. A notion of a differential form. Wedge product of differential forms. Exterior differentiation."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "16. Diferentsiaalvormide integreerimine. Stokes`i teoreem. Gauss-Bonnet teoreem.\n16. Integration of differential forms. Stokes' theorem. Gauss-Bonnet theorem."}}]}, "registration_info": {"audience": {}, "min_students": 7, "max_students": 30}, "parent_uuid": "3becece5-b7e2-5c9e-ff4c-1b3b442e889e", "parent_code": "MTMM.00.060", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}