{"uuid": "d6d05e46-8ca2-8d6a-3329-b82476787db5", "code": "MTMM.00.342", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-02T13:22:30", "title": {"en": "Transition to Advanced Mathematics", "et": "Matemaatiline maailmapilt"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Main notions of propositional calculus: tautology, logically equivalent formulae, disjunctive normal form of formulae. Set theory: Notion of a set, operations with sets, relations, relations of equivalence and partitions to the classes, cardinality of a set, ordered sets. Injective, surjective and bijective functions. Number theory: divisibility, division algorithm, fundamental theorem of arithmetic, infiniteness of the set of primes", "et": "Lausearvutuse põhimõisted: loogilised tehted, samaselt tõesed valemid, samaväärsed valemid, valemite järeldumine, täielik disjunktiivne normaalkuju. Hulgateooria põhimõisted: hulk, tehted hulkadega, seosed, ekvivalentsusseosed ja klassijaotused, hulga võimsus, järjestatud hulgad. Funktsiooni injektiivsus, sürjektiivsus, bijektiivsus. Arvuteooria põhimõisted: jaguvus, jäägiga jaguvus, aritmeetika põhiteoreem, algarvude hulga lõpmatus."}, "objectives": [{"en": "Giving first knowledge to the students about modern mathematics of application general notions and methods. Supporting the ability of critical thinking, developing mathematical oral self-expression skills.", "et": "Üliõpilastele esmaste teadmiste andmine kaasaegse matemaatika üldistest mõistetest, nende kasutamisharjumuste treenimine. Kriitilise mõtlemise oskuse toetamine, matemaatilise suulise eneseväljendusoskuse arendamine."}], "learning_outcomes": [{"en": "After passing the course students", "et": "Peale kursuse läbimist üliõpilane"}, {"en": "1. know main notions of propositional calculus, set theory and number theory", "et": "1. tunneb põhilisi lausearvutuse, hulgateooria ja arvuteooria mõisteid"}, {"en": "2. can use them in solving simple problems", "et": "2. oskab neid kasutada lihtsamate ülesannete lahendamisel"}, {"en": "3. are prepared to use them in other disciplines", "et": "3. on ette valmistunud nende mõistete kasutamiseks teistes õppeainetes"}, {"en": "4. can relate operations of propositional calculus with natural language propositions", "et": "4. oskab seostada lausearvutuse tehteid loomuliku keele lausetega"}, {"en": "5. is familiar with different proof methods", "et": "5. on tutvunud erinevate tõestusmeetoditega"}, {"en": "6. know main notions of functions and relations and can use them in exercises", "et": "6. tunneb põhilisi funktsioonide ja seostega seotud mõisteid ja oskab neid kasutada ülesannete lahendamisel"}, {"en": "7. know main notions of cardinalities of sets", "et": "7. tunneb hulkade võimsusega seotud mõisteid, oskab määrata lihtsamate hulkade võimsuseid"}, {"en": "8. investigate and compile logic reasonings within the framework of course material", "et": "8. uurib ja koostab loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames"}, {"en": "9. have discussed on a mathematical conception (essence, proof, examples) in oral midterm and oral part of final exam", "et": "9. on arutlenud suulisel vaheeksamil ja lõpueksami suulises osas matemaatilise kontseptsiooni olemuse, tõestuse ja näidete üle"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}