{"uuid": "cd6abef7-db2a-d03b-9043-4440c904a581", "code": "MTMS.01.099", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Mathematical Statistics", "et": "Matemaatiline statistika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In the part of probability theory the  random events and properties of classical probability are considered. The course covers the theory of random variables and their distributions as well. In the part of mathematical statitics the course covers basics of the statistical inference. First, a point estimator, its properties and methods for finding it are considered. Also the interval estimation and testing of statistical hypotheses are treated.", "et": "Tõenäosusteooria osas tutvutakse tõenäosusteooria meetoditega ja õpitakse tundma klassikalisi tõenäosusjaotusi. Matemaatilise statistika osa käsitleb statistilise hindamisülesande aluseid. Vaadeldakse punkthinnangut, hinnangu leidmise meetodeid ja omadusi. Seejärel vaadeldakse vahemikhinnangut ja statistiliste hüpoteeside kontrolli."}, "objectives": [{"en": "To give knowledge and experience in probability and statistics, which enables to attend higher level courses on stochastic modelling in master studies.", "et": "Anda üliõpilastele teadmised ja oskused tõenäosusteoorias ja matemaatilises statistikas, mis võimaldavad magistriõppes läbida kõrgema taseme kursusi stohhastilise modelleerimise alal."}], "learning_outcomes": [{"en": "After passing the course a student", "et": "Õppeaine edukal läbimisel üliõpilane:"}, {"en": "· knows design of modern probability theory;", "et": "· tunneb kaasaegse tõenäosusteooria ülesehitust;"}, {"en": "· knows the concept of random variables and some most common probability distributions and is able to compute various numerical parameters related to both discrete and continuous random variables;", "et": "· tunneb juhusliku suuruse mõistet ja klassikalisi tõenäosusjaotusi ning oskab leida juhuslike suuruste arvkarakteristikuid nii diskreetsete kui ka pidevate juhuslike suuruste korral;"}, {"en": "· knows basic methods of estimation and testing theory;", "et": "· tunneb hindamis- ja testimisteooria põhilisi meetodeid;"}, {"en": "· understands the entity of the estimate and are able to characterize it by the corresponding properties (unbiasness, efficiency, consistency);", "et": "· mõistab punktihinnangu olemust ja oskab iseloomustada seda vastavate omaduste abil (nihketus, efektiivsus, mõjusus);"}, {"en": "· knows the basic methods for  deriving estimates and are able to apply them (the maximum likelihood, least-squares methods and the method of moments);", "et": "· teab põhimeetodeid hinnangute leidmiseks ja oskab neid rakendada (suurima tõepära, vähimruutude ja momentide meetodid);"}, {"en": "· understand the entity of the hypothesis and are able to construct them in different situations;", "et": "· mõistab statistilise hüpoteesi olemust ja oskab selle sõnastada lähtuvalt ülesandest;"}, {"en": "· is able to construct interval estimates and handle non-normal data;", "et": "on võimeline konstrueerima vahemikhinnanguid ja töötama mitte-normaaljaotusega andmetega;"}, {"en": "· has received training in mathematical statistics that is appropriate for studying different econometric methods.", "et": "· on saanud vajaliku matemaatilise statistika alase ettevalmistuse erinevate ökonomeetriliste meetodite omandamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}