{"uuid": "9dca7ac5-442e-c13b-3518-2dc185f66651", "code": "MTMS.02.051", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Life Insurance Mathematics I", "et": "Elukindlustusmatemaatika I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "First an overview of mathematics of interest, specially about annuities is given. After that the survival models and life tables are discussed. Using the results of interest and survival theory the actuarial present values (APV) for elementary life insurances and life annuities are introduced.  By giving the total loss as a difference between APV of benefits and APV of premiums the equivalence principle is defined. By using equivalence principle the formulas for net premiums and net premium reserves  are derived. All the theory is illustrated with examples and exercises.", "et": "Antakse ülevaade intressiteooriast ja eluea kui juhusliku suuruse kirjeldamisest. Arutletakse elukindlustuse hüvitiste ja eluannuiteetide põhitüüpe ja esitatakse mudelid, hüvitiste ja preemiate nüüdisväärtuste arvutamiseks kui aeg sõltub kindlustatu tulevasest elueast (juhuslik suurus). Seejärel defineeritakse hüvitiste ja preemiate nüüdisväärtuste vahe kaofunktsioonina, mille keskväärtuse võrdustamist nulliga nimetatakse ekvivalentsusprintsiipiks. Defineeritud ekvivalentsusprintsiipi kasutatakse netopreemiate arvutamisel ning netopreemia reservide leidmiseks."}, "objectives": [{"en": "The aim of the course is to provide an overview of the basic concepts of life insurance mathematics and elementary insurance types by combining risk theory, economics and population theory.", "et": "Aine eesmärgiks on \n- anda ülevaade elukindlustusmatemaatika arvutuspõhimõtetest ja baasmudelitest,\n- näidata tõenäosus- ja majandusteooria ning elukestusanalüüsi ühisrakendusi."}], "learning_outcomes": [{"en": "Passing through the module, a participant", "et": "Aine läbinud  üliõpilane "}, {"en": "- has an overview of the theory of interest and knows different types of interest rates;", "et": "- Omab ülevaadet intressiteooriast ja tunneb erinevaid intressimäärasid majandusteoorias;"}, {"en": "- can describe the model of future lifetime and has an overview of the corresponding analytical distributions and Life Table;", "et": "- oskab kirjeldada tulevase eluea mudelit ja omab ülevaadet vastavatest analüütilistest jaotustest ja elutabelist;"}, {"en": "- knows elementary life insurance types and life annuities and can calculate their present values;", "et": "- teab elukindlustuse ja elukindlustusannuiteetide baastüüpe ja oskab leida vastavaid nüüdisväärtusi;"}, {"en": "- understands the concept of equivalence principle and can calculate net premiums and net premium reserves;", "et": "- teab ekvivalentsusprintsiipi ning oskab selle põhjal arvutada netopreemiaid ja netopreemia reserve;"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}