{"uuid": "d54ddc0e-5418-3b67-6bfa-f9e80f4dc296", "code": "MTMS.02.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Simulation Methods in Financial Mathematics", "et": "Simulatsioonimeetodid finantsmatemaatikas"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "LTMS", "structural_unit_name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "LTMS", "name": {"en": "Institute of Mathematics and Statistics", "et": "matemaatika ja statistika instituut"}, "email": "ltms@ut.ee", "phone": "+372 737 5863", "webpage_url": "https://math.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course gives an overview of and practical experiece in the different aspects of applying Monte-Carlo methods for pricing different derivative securities. Several methods of speeding up Monte-Carlo computations are studied", "et": "Tutvutakse simulatsioonimeetodite rakendusvõimalustega optsioonide hindade ja hinnatuletiste arvutamisel ning vaadeldakse nõutud täpsusega tulemuste saavutamise erinevaid võtteid"}, "objectives": [{"en": "The goals of the course are", "et": "Aine eesmärgiks on "}, {"en": "- To give an overview of the possibilities of using simulation methods (Monte-Carlo methods) for pricing various assets, especially finanancial options", "et": "- Anda ülevaade simulatsiooni- ehk Monte Carlo meetodite kasutusvõimalustest finantsmatemaatika, eriti tuletisväärtpaberite hindamisega seotud küsimuste lahendamisel"}, {"en": "- To give practical skills in effective application of simulation methods for numerical solutions of various problems of mathematical finance.", "et": "- Anda praktilised oskused simulatsioonimeetodite efektiivseks kasutamiseks finantsmatemaatika ülesannete lahendamisel."}], "learning_outcomes": [{"en": "After completing the course the students\n-Know the principles and practical error estimates of the Monte-Carlo method; is able to generate the trajectories of the solutions of stochastic differential equations (especially stock price trajectories) and knows how to use the skill in constructing simulation methods for pricing financial options\n- Knows several variance reductions methods for speeding up the Monte-Carlo simulation (antithetic variates, control variables, stratified sampling) and is able to use them in option pricing\n- Knows the concept of the quasai-random variables and is able to use them in option pricing.", "et": "Aine läbinud  üliõpilane \n- teab Monte-Carlo meetodi põhimõtteid ning veahinnanguid; \n- oskab genereerida stohhastiliste diferentsiaalvõrrandite lahendite, sealhulgas aktsiahinna, trajektoore mitmesuguste turumudelite korral ning teab, kuidas seda oskust kasutada simulatsioonimeetodite konstrueerimiseks;\n- tunneb Monte-Carlo meetodi koonduvuse kiirendamise võtteid (antiteetiliste juhuslike suuruste kasutamine, kontrollmuutujate kasutamine, kihtvalimi meetod) ning oskab neid rakendada finantsoptsioonide hindade ja hinnatuletiste arvutamisel simulatsioonimeetoditega;\n- teab kvaasijuhuslike arvude mõistet ning kasutamise põhimõtteid, oskab neid kasutada optsioonide hindade arvutamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}