{"uuid": "50376551-5b99-fea3-5907-d27efd83175b", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T15:32:29", "title": {"en": "Surgery Practice", "et": "Kirurgia praktika"}, "credits": 12, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "label": {"en": "25/26 S regular MV Eng", "et": "25/26 K PÕ MV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MV", "structural_unit_name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 312}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The practical course in surgery lasts 8 weeks (4+4) and can be passed at the departments of general surgery, abdominal surgery, paediatric surgery surgical oncology, traumatology, urology, thorasic and vascular surgery. In addition to daily clinical work, the students have to train practical skills necessary for physician and, when possible, ta take part in seminars.\nThe subject deals with the investigation of the surgical patient, designing of the treatment plan, assessment of the treatment course and results, documentation of the data and their presentation.\nWithin the course, the students have to fill in the diary of medical training (surgery).\nAt least 100 corresponding AMBOSS platform cases must be solved during the surgery practice cycle, the completion will be checked up on at the end of the semester.", "et": "Kirurgia praktika kestab 8 nädalat (4+4), mida võib sooritada abdominaalkirurgia, lastekirurgia, onkokirurgia, traumatoloogia,  uroloogia, veresoontekirurgia, torakaalkirurgia ning üldkirurgia osakondades. \nLisaks kliinilisele igapäevatööle tuleb üliõpilasel praktika raames tegeleda arstile vajalike praktiliste oskuste harjutamisega ning võimalusel võtta osa seminaridest. \nKäsitletakse kirurgilise haige uurimist, raviplaani koostamist, ravikäigu ja tulemuste hindamist, andmete dokumenteerimist ning ettekandmist.\nPraktika käigus tuleb täita praktikapäevikut.\nÜliõpilasel on kohustus lahendada kirurgia tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust. Küsimuste lahendamist kontrollitakse semestri lõpus."}, "objectives": [{"en": "The practical course integrates the theoretical knowledge, acquired during the 5 study years, in practical medicine and serves as a natural interim stage before special studies in residency. The aim of the practical course in surgery is to upgrade the knowledge of surgery, being a subject requiring previous full acquisition of theoretical knowledge for implementing it in practice.The course can be started after completion of the mandatory clinical subjects of the 5th year. \nAims:\n- to study the diagnosing of surgical diseases, optimal application of diagnostic methods, designing of the treatment plan (diagnostic and treatment algorithm), assessment of treatment results, prognosis and prophylaxis;\n- to study the documenting of the investigation, diagnostics and treatment of the patient; to study the presenting of patient's diagnostics, course of treatment and condition at department meetings and during physician rounds;\n- to study and analyse contemporary treatment options, short- and long-term results, prognosis and prophylaxis of the studied patients on the basis of literature data.", "et": "Praktika integreerib 5 õppeaasta jooksul omandatud teoreetilised teadmised praktilisse meditsiini ning on loomulikuks vaheetapiks enne erialaõpinguid residentuuris. Kirurgia praktika eesmärgiks on täiendada õppuri kirurgiaalaseid teadmisi, olles eelnevalt täies mahus omandatud teoreetilisi teadmisi nõudev ja rakendav õppeaine, millega saab alustada pärast 5. kursuse kohustuslike kliiniliste õppeainete läbimist.\nEesmärgid:\n-õppida kirurgiliste haiguste diagnoosimist, optimaalset diagnostiliste meetodite rakendamist ja nende tulemuste hindamist, raviplaani koostamist (diagnostiline ja ravi algoritm) ning ravitulemuste hindamist, prognoosi ja profülaktikat\n-õppida haige uurimise, diagnostika ja ravi dokumenteerimist\n-õppida patsiendi diagnostika, ravikäigu ja seisundi ettekandmist osakonna nõupidamisel, visiitidel\n-tutvuda ja analüüsida kirjanduse põhjal uuritud haigete kaasaegseid ravivõimalusi, lähi -ja kaugtulemusi, prognoosi ja profülaktikat"}], "learning_outcomes": [{"en": "After completing the course, the student", "et": "Praktikal osalenud üliõpilane"}, {"en": "1) is able to take the anamnesis, examine patients objectively, prescribe optimal / supplementary diagnostic investigations and evaluate the results of the investigations.", "et": "1) on võimeline koguma haigetelt antud haiguse anamneesi, teostama haigele objektiivset uuringut, ordineerima optimaalseid / täiendavaid diagnostilisi uuringuid ning oskab hinnata uuringute tulemusi."}, {"en": "2) in the case of cutaneous and subcutaneous infections, is able to analyse clinical symptoms of the disease and to establish final clinical diagnosis;", "et": "2) oskab naha- ja nahaaluskoe infektsioonide korral analüüsida diferentsiaaldiagnostiliselt haiguste kliinilisi sümptomeid ja formuleerida lõpliku kliinilise diagnoosi."}, {"en": "3) knows the etiopathogenesis, classification, clinical symtpomatology, diagnostic investigation methods and treatment algorithm of a disease;", "et": "3) teab antud haiguste etiopatogeneesi, klassifikatsiooni, kliinilist sümptomaatikat, diagnostilisi uurimismeetodeid ja ravi algoritmi."}, {"en": "4) has an understanding of the surgical treatment of presented diseases.", "et": "4) omab ettekujutust antud haiguste kirurgilisest ravist."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Praktikapäeviku täitmine ja esitamine"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Üliõpilasel on kohustus lahendada kirurgia tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust.\nKüsimuste lahendamist kontrollitakse semestri lõpus. Kui üliõpilasel on vastava semestri minimaalne küsimuste maht lahendamata, jääb praktikaaine arvestamata.\nPraktikaaine on arstiõppe kohustuslik aine, vastavalt õppekorralduseeskirja punktile 76 kehtib arstiõppes kursusesüsteem. Kursusesüsteemi alusel õppides peab üliõpilane läbima õppeained õppekavas kehtestatud järjekorras ning täitma semestri lõpuks õppekava järgi täitmisele kuuluva kohustusliku õppe mahust 100%. Seega juhul kui semestri lõpuks on kohustuslik ülesannete hulk lahendamata kohalduvad õppekorralduseeskirja punktid 150 ja 150.3.1, mille kohaselt toimub ülikooli algatusel eksmatrikuleerimine õppeprorektori korraldusega õppeprodekaani otsuse alusel semestri lõpuks õppekava minimaalses lubatud mahus täitmata jätmisel punktis 76 nimetatud juhul."}}], "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "7dea5923-377a-e105-820c-33cb7bc8ee19", "person_name": "Ceith Nikkolo", "structural_unit": {"code": "MVCM03", "name": {"en": "Department of Surgery", "et": "kirurgiakliinik"}, "phone": "+372 731 8238", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/kirurgiakliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-23."}}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "2dbd1340-6b80-1595-5db2-e35a52a74a51", "parent_code": "MV00.00.004", "parent_credits": 12, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}