{"uuid": "e5e96c74-c549-ea3c-8634-0073b2850ccd", "code": "mv-2018-autumn-fulltime-c12", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Family Medicine Practice", "et": "Peremeditsiini praktika"}, "credits": 12, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "label": {"en": "18/19 A regular MV", "et": "18/19 S PÕ MV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MV", "structural_unit_name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 312}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The purpose of the practice is to complement the student's knowledge of general medicine, to assure strong and extensive basic knowledge that will allow the student to study any specialty of their choice. Clinical practice is a subject which needs and applies the previously acquired theoretical knowledge. During clinical practice, you can participate in appointments and solve most common problems the patients come to the family physician with, participate in planning and conducting prophylactic work and do home visits.\nYou need to finish 8 weeks of family medicine cycle in a family medicine practice. For the family medicine practice, the student needs to find a suitable practice place on their own. Every family physician or family medicine practice in Estonia or an abroad representor of the specialty or facility with a similar profile is suitable. Family medicine can additionally be taken as an extracurricular cycle and the prerequisite is the practice base's agreement to take the student.\nSeminaries of family medicine cycle will be carried out electronically in the study environment of Moodle, where you need to choose and analyse 1 cases and present them for discussion in a set work group. Additional assignments are specified under the relevant chapter of the diary.\nEverything that the student has learned during the five years can be used in practical work in family medicine. During the family medicine practice the student can do family doctor`s everyday work: resolve different problems in different age and gender groups, make home visits and do preventive work and give advice towards changing patient lifestyle.\nThe student has to solve at least 100 specialty questions on AMBOSS study platform during the family medicine cycle. Solving the questions will be checked at the end of the semester.", "et": "Praktika eesmärgiks  on  aga  täiendada  õppuri  üldarstlikke  teadmisi,  tagamaks  tugevad  ning  laiad baasteadmised mis võimaldavad edasi õppida mistahes valitud erialal. Kliiniline praktika on eelnevalt täies mahus omandatud teoreetilisi teadmisi nõudev ja rakendav õppeaine. Kliinilise praktika raames on võimalus osaleda vastuvõtul ja lahendada sagedasemaid probleeme, millega patsiendid pöörduvad perearstikeskusesse, osaleda profülaktilise töö planeerimisel ja läbiviimisel ja teostada koduvisiite.\nPerearstipraksises tuleb läbida 8 nädala pikkune peremeditsiini tsükkel. Peremeditsiinipraktikaks tuleb üliõpilasel endal sobiv praksis leida. Selleks sobib iga Eestis registreeritud  perearst  või  perearstikeskus  ning  välismaal  asuv  sarnase  profiiliga erialaesindaja või asutus. Peremeditsiini võib veel lisaks teha ka valiktsüklina ja   sooritamise  eelduseks  on  praktikabaasi nõusolek üliõpilane vastu võtta. \nPeremeditsiini  tsüklile  vastavad  seminarid  viiakse  läbi  elektroonselt Moodle õpikeskkonnas, kus tuleb valida ja analüüsida iseseisvalt 1 haigusjuht ja esitada kirjalikult aruteluks määratud töögrupis. Lisaülesanded on  täpsustatud päeviku vastava peatüki all.\nÜliõpilasel on kohustus lahendada peremeditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust. Küsimuste lahendamist kontrollitakse semestri lõpus."}, "objectives": [{"en": "Practice goals: \n to integrate the theoretical knowledge accumulated during the studies and to acquire practical skills required in everyday work.\nto introduse the management of different age and gender groups in primary health care, to elaborate communication skills with patients.\nto expand understanding of an influence of a community and a family to an individual, and how toeffectively prevent illnesses in primary health care. to introduce the principles management of chronically ill patients in individual level but also in the level of the whole family.\nIn addition to everyday clinical work the student must practice the practical skills and take part in seminars. These activities are reflected in separate chapters at the end of the practice logbook.\nhttp://meditsiiniteadused.ut.ee/et/oppimine/info-vi-kursusele", "et": "Praktika eesmärgiks on  integreerida 5 õppeaasta jooksul omandatud teoreetilised teadmised praktilisse meditsiini.  \n Praktika üldeesmärgiks  on täiendada  õppuri  üldarstlikke  teadmisi ja praktilisi oskusi nii haiguste diagnoosimisel kui ka ennetamisel arvestades patsientide east ja soost tulenevalt erisusi. Õpetada mitme samaaegse kroonilise haigusega patsiendi käsitlust nii üksikindiviidi kui ka perekonna aspektist lähtuvalt.\nPraktika tagab  tugevad  ning  laiad baasteadmised mistahes edasisel õpitaval erialal. Kliiniline praktika on eelnevalt täies mahus omandatud teoreetilisi teadmisi nõudev ja rakendav õppeaine, millega saab alustada pärast 5. kursuse  kohustuslike  kliiniliste  õppeainete  läbimist."}], "learning_outcomes": [{"en": "1. knows andis able to use patient-centred consultation methods in different age and gender groups of the patients and knows the core principles of the management of the chronically ill patients.\n2. knows and is able to solve most common health problems in family practice (in different age and gender groups of the patients).\n3. knows and is able to use most important prevention methods in family practice.\n4. is able to give advice in changing patient lifesyle.\n5 .knows the most important differential diagnosis principles in family medicine.\n6. is able to choose and interpret the results of the most important laboratory analysis and other investigations used in family medicine.\n7. knows the core principles of the management of the chronically ill patient.\n8. knows how to use literature and to use evidence-based approach in family medicine.\n9. fill the practice logbook  with purpose to help to achieve these goals. \nWe have tried to include as few as possible fields that are used to check the sole performance of practice. You should fill out the practice logbook so that it would be a job for you and for no-one else!\nIn addition to everyday clinical work the student must practice the practical skills , make homevisits and take part in seminars. \nFamily medicine has its seminars in Moodle. \nExceptions in the practice arrangement will be decided individually by the Family Medicine Practice supervisor Dr Heli Tähepõld", "et": "Üliõpilasel on võimalus  perearstipraktika  raames erinevate ea ja soogruppide probleemikeskse käsitluse omandamine ja arstile vajalike praktiliste oskuste harjutamine haiguste diagnoosimisel ja ennetamisel. \nPraktikal olnud üliõpilane \n1.Oskab kasutada õpitud kommunikatsioonioskuseid arvesse võttes patsientide vanust, sugu ja haigusest tingitud eripära ja kroonilise haigusega patsiendi käsitluse printsiipe.  \n2. Oskab lahendada sagedasemaid probleeme, millega pöörduvad perearsti vastuvõtule erinevates vanuse ja soogruppides patsiendid.\n3. Oskab kasutada põhilisi preventsioonimeetodeid sõltuvalt patsiendi vanusest ja soost.\n4. Oskab nõu anda patsiendile elustiili muutmisel ja haiguste ennetamisel.\n5. On võimeline iseseisvalt teostama esmatasandi patsientide ambulatoorset vastuvõttu: on võimeline koguma haigetelt anamneesi, teostama objektiivset uuringut, ordineerima optimaalseis/täiendavaid nii diagnostilisi kui ka profülaktilisi uuringuid ning oskab ka analüüsida uuringute tulemusi, diagnoosida haigusi ja määrata ravi.  \n6. Oskab patsiendile määrata ravi ka mitmete haiguste koosesinemise korral  arvestades kõrvaltoimeid.\n7. Oskab käsitleda patsienti kui tervikut ja  anda omapoolseid hinnanguid ja soovitusi ravi ja profülaktiliste uuringute osas aga ka patsientide elukvaliteedi osas, \n8. Oskab kasutada tõenduspõhist kirjandust, orienteerub esmatasandile mõeldud ravijuhendites  ja  oskab määrata ja soovitada kaasaegseid ravimeetodeid.\n9. Täidab praktikapäevikut ja iga tsükli käigus jooksvalt täidab vastavat peatükki ning nende juurde kuuluvat praktiliste oskuste osa päeviku lõpus ja analüüsib antud juhtumeid. \n\nErandite  üle  praktika  korralduses  otsustab  üksikjuhtumite  kaupa  peremeditsiini praktika juhendaja, Dr Heli Tähepõld"}], "notes": {}}, "grading": {"independent_work": {"et": "Peremeditsiini praktika läbimiseks on vajalik osaleda ka kahes e-seminaris. Seminarid viiakse läbi Moodles. \nE-seminarid teemadel: Meditsiiniliselt seletamatud sümptomid ja Multimorbiidsus.\nSeminarid toimuvad veebipõhiselt rühmades. Iga õppija valib ühe haigusjuhu, analüüsib seda vastavalt juhisele ja esitab analüüsi foorumisse.\nSeminarid läbinud üliõpilane:\n- teab, mis on meditsiiniliselt seletamatud sümptomid (medically unexplained physical symptoms, MUPS);\n- teab, mis on multimorbiidsus ja sellega probleemid arsti ja patsiendi jaoks;\n- oskab leida strateegiaid probleemide lahendamiseks;\n- oskab süstemaatiliselt kaaluda ravi valikute kasusid ja kahjusid ning informeerida sellest patsienti;\n- oskab kaasata patsienti otsustusprotsessi ning kohandada raviotsuseid lähtuvalt patsiendi eelistustest.\nMoodles e-kursuse nimi Peremeditsiini praktika (MV00.00.005). Täpsem juhis iseseisvateks töödeks leitav Moodles.\nOluline on seminarid sooritada praktika ajal, sest seminari iseseisva töö jaoks on Teil vaja leida ja esitada reaalsete patsientide juhtumid.\nNB! Kes ei ole registreeritud ÕISi kaudu kursusele, palun võtke ühendust õppekorralduse spetsialistiga liis.pold@ut.ee"}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Praktikapäeviku täitmine ja esitamine"}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "- Haigusjuht nr. 1 (meditsiinilised seletamatud sümptomid) analüüsimisel hinnatakse patsiendi käsitluse terviklikkust, patsiendi kaasatust, võimalike diagnoosimise ja ravistrateegiate mõtestamist lähtuvalt konkreetsest patsiendist.\n- Haigusjuht nr. 2 (multimorbiidsus) analüüsimisel hinnatakse patsiendi käsitluse terviklikkust, patsiendi kaasatust, ravi efektiivsuse, kasude ja riskide hindamise oskust.\nKõiki tegevusi hinnatakse kursusel skaalal arvestatud/mittearvestatud."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Üliõpilasel on kohustus lahendada peremeditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust.\nKüsimuste lahendamist kontrollitakse semestri lõpus. Kui üliõpilasel on vastava semestri minimaalne küsimuste maht lahendamata, jääb praktikaaine arvestamata.\nPraktikaaine on arstiõppe kohustuslik aine, vastavalt õppekorralduseeskirja punktile 76 kehtib arstiõppes kursusesüsteem. Kursusesüsteemi alusel õppides peab üliõpilane läbima õppeained õppekavas kehtestatud järjekorras ning täitma semestri lõpuks õppekava järgi täitmisele kuuluva kohustusliku õppe mahust 100%. Seega juhul kui semestri lõpuks on kohustuslik ülesannete hulk lahendamata kohalduvad õppekorralduseeskirja punktid 150 ja 150.3.1, mille kohaselt toimub ülikooli algatusel eksmatrikuleerimine õppeprorektori korraldusega õppeprodekaani otsuse alusel semestri lõpuks õppekava minimaalses lubatud mahus täitmata jätmisel punktis 76 nimetatud juhul."}}], "grade_preconditions": {"et": "E- seminaride läbimine on kohustuslik praktika osa! Patsiendi juhtumid peavad olema esitatud Moodle e-kursusel oma rühmale määratud tähtaja jooksul. "}, "grade_evaluation": {"et": "Peremeditsiini praktika on läbitud positiivsele tulemusele:\n- kui on esitatud õigeaegselt iseseisva tööna patsiendi juhtumid, mis oleksid  õppejõudude poolt jälgitavad, suunatavad ning hinnatavad; \n- kui on vaja täiendada esitatud haigusjuhte, siis peab olema vastatud juhendaja poolt esitatud küsimusetele;\n- esitatud praktika läbimise kohta päevik."}, "debt_elimination": {"et": "Kui on praktika ajal jäänud seminar tegemata, tuleb Moodles foorumi vahendusel õppejõuga ühendust võtta ja leppida kokku, kuidas olukord lahendada. Initsiatiiv selleks peab tulema õppija poolt."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=3443", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "cd0a3e2d-18e6-ebcd-49c9-708269850eb2", "person_name": "Heli Tähepõld", "structural_unit": {"code": "MVPT01", "name": {"en": "Department of Family Medicine", "et": "peremeditsiini õppetool"}, "email": "peremed@ut.ee", "phone": "+372 731 9211", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-23."}}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "43311be2-2eda-1b20-9f11-3634eab91c59", "parent_code": "MV00.00.005", "parent_credits": 12, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}