{"uuid": "c88c5903-b9df-6a4e-44a7-9f98c7a30f45", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T15:31:38", "title": {"en": "Internal Medicine Practice", "et": "Sisemeditsiini praktika"}, "credits": 12, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "label": {"en": "25/26 S regular MV Eng", "et": "25/26 K PÕ MV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MV", "structural_unit_name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 312}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The practical course in internal medicine lasts 8 weeks and can be passed at one or in multiple internal medicine divisions. Addition to daily clinical work, the students have to train practical skills necessary for physician and to take part in seminars and conferences.\nThe subject deals with the investigation of the medical patient, investigations, diagnosis formulation, designing of the treatment plan, assessment of the treatment course and results, documentation of the data and their presentation. Within the course, the students have to fill in the diary of medical training and form epicrisis.\nAt least 100 corresponding AMBOSS platform cases must be solved during the internal medicine cycle, the completion will be checked up on at the end of the semester.", "et": "Sisemeditsiini praktika kestab 8 nädalat, mida võib sooritada ühes või erinevates sisehaiguste osakondades. Sisemeditsiini praktika raames saab tudeng arstiabina tegeleda arstile vajalike praktiliste oskuste õppimise ja täiendamisega ning lihtsamate protseduuride läbiviimisega. Juhendaja abil saab harjutada haige uurimist, diagnoosi tegemist, raviplaani koostamist, haige pika-aegse käsitluse koostamist, haigusjuhu andmete dokumenteerimist ning kolleegidele haigusjuhu ettekandmist. Praktikant võtab osa osakonnas ja kliinikus toimuvatest seminaridest, konverentsidest. Praktika käigus tuleb täita praktikapäevikut ja teha sisehaigete kohta epikriisid.\nÜliõpilasel on kohustus lahendada sisemeditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust. Küsimuste lahendamist kontrollitakse semestri lõpus."}, "objectives": [{"en": "General aim of internal medicine practical course is to implement to practice the theoretical knowledge acquired during the studies. The course can be started after the completion of the mandatory clinical subjects of the 5th year.", "et": "Sisemeditsiini praktika üldiseks eesmärgiks on stuudiumi jooksul omandatud teoreetiliste teadmiste integreerimine praktilisse meditsiini arstiabi praktika raames, millega saab alustada pärast 5. kursuse kohustuslike kliiniliste õppeainete läbimist."}, {"en": "Aims:", "et": "Sisemeditsiini praktika peamisteks eesmärkideks on:"}, {"en": "-\tTo use in the routine clinical work the basic clinical terminology, skills of interviewing and physical examination as well as to study the medical documentation;", "et": "-\tsisemeditsiini-alaste teadmiste täiendamine, sisemeditsiini-alase terminoloogia kasutuse arendamine ning meditsiinilise dokumenteerimisoskuste õppimine;"}, {"en": "-\tTo learn general aspect of common internal diseases, to learn to simple investigations and monitoring of patients;", "et": "-\tsisehaige objektiivse uurimise ja lihtsamate uuringute läbiviimise oskuste täiendamine ning haige kliinilise seisundi dünaamilise jälgimisoskuse õppimine; "}, {"en": "-\tTo learn differential diagnostics of internal diseases and optimal application of diagnostic methods;", "et": "-\tsagedasemate sisehaiguste diagnoosimise algoritmide ja võimalustega tutvumine ning individuaalsete  haigete korral erinevate uuringute ratsionaalse valiku tegemise õppimine; "}, {"en": "-\tTo study contemporary internal medicine diseases treatment guidelines and individual options of the studied patients on the basis of literature data;", "et": "-\tsagedasemate sisehaiguste kaasaegsete ravijuhendite ja praktilise käsitlusega tutvumine ja nende kohandamise õppimine konkreetsetel haigetel;"}, {"en": "-\tTo design of the management of individual patient including diagnostics, short- and long-term maintenance treatment, assessment of treatment targets and prognosis.", "et": "-\thaigete monitooringu järjepidevuse tagamise õppimine ja suhtlemisoskuste arendamine kolleegidega."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Praktikal osalenud üliõpilane:"}, {"en": "-\tis able to take the anamnesis, examine patients with various internal diseases objectively, prescribe optimal diagnostic investigations and evaluate the results of the investigations;", "et": "-\ton võimeline sisehaiget uurima, määrama ratsionaalselt diferentsiaaldiagnostilisi uuringuid individuaalsele haigele ja hindama uuringute tulemusi ning tegema lihtsamaid uuringuid;"}, {"en": "-\thave learn general aspects common internal disease and able to analyse clinical symptoms of the disease and to establish final clinical diagnosis;", "et": "-\ton õppinud tundma sagedasemate sisehaiguste käsitlust, meditsiiniterminoloogiat ja lõpliku kliinilise diagnoosi formuleerimist;"}, {"en": "-\tknows the treatment algorithms and guidelines of long-term management of internal diseases;", "et": "-\ton tutvunud sisehaiguste ravijuhenditega ning suudab määrata ravi sisehaigele kasutades vajadusel kirjandust;"}, {"en": "-\tis able to present patient case to colleagues using appropriate medical terminology, to do necessary documentation and write an epicrisis (a critical or analytical summing up of a medical case history).", "et": "-\tsuudab ette kanda haige käsitlust kolleegidele kasutades vajalikku meditsiiniterminoloogiat, dokumenteerida haigusjuhu andmeid ja vormistada haigusjuhu kohta epikriisi."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Praktikapäeviku täitmine ja esitamine"}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Praktikatsükli jooksul kureeritud patsientide kohta tuleb koostada 8 epikriisi. Epikriisid tuleb vormistada tekstifailina (šrift Times New Roman, kirjasuurus 12, reavahe 1,0), seejuures ühe epikriisi pikkus võib olla kuni 200 sõna. Epikriisid tuleb saata sisemeditsiini erialajuhendaja Mai Rosenbergile e-posti teel mai.rosenberg@kliinikum.ee"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Üliõpilasel on kohustus lahendada sisemeditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust.\nKüsimuste lahendamist kontrollitakse semestri lõpus. Kui üliõpilasel on vastava semestri minimaalne küsimuste maht lahendamata, jääb praktikaaine arvestamata.\nPraktikaaine on arstiõppe kohustuslik aine, vastavalt õppekorralduseeskirja punktile 76 kehtib arstiõppes kursusesüsteem. Kursusesüsteemi alusel õppides peab üliõpilane läbima õppeained õppekavas kehtestatud järjekorras ning täitma semestri lõpuks õppekava järgi täitmisele kuuluva kohustusliku õppe mahust 100%. Seega juhul kui semestri lõpuks on kohustuslik ülesannete hulk lahendamata kohalduvad õppekorralduseeskirja punktid 150 ja 150.3.1, mille kohaselt toimub ülikooli algatusel eksmatrikuleerimine õppeprorektori korraldusega õppeprodekaani otsuse alusel semestri lõpuks õppekava minimaalses lubatud mahus täitmata jätmisel punktis 76 nimetatud juhul."}}], "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "44d233e7-06d5-d5a5-f431-36efd24ba9b9", "person_name": "Mai Rosenberg", "structural_unit": {"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "e523ff7e-f515-5900-28a9-5ea7e4921841", "parent_code": "MV00.00.003", "parent_credits": 12, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}