{"uuid": "a0349865-6bda-1818-6997-54528e3f822b", "code": "mv-2018-autumn-fulltime-c12", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Emergency Medicine Practice", "et": "Erakorralise meditsiini praktika"}, "credits": 12, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "label": {"en": "18/19 A regular MV", "et": "18/19 S PÕ MV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MV", "structural_unit_name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 312}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The emergency medicine practice cycle is focused on primary assessment and treatment of acutely ill or injured patients in emergency department. Students will learn about the organisation of emergency medicine, triage and obtain practical skills for initial management of emergency patient. \nAt least 100 corresponding AMBOSS platform cases must be solved during the emergency medicine cycle, the completion will be checked up on at the end of the semester.", "et": "EM praktika põhitähelepanu on pööratud erakorraliste seisundite esmasele diagnostikale ja ravile erakorralise meditsiini osakonnas. Osalemise eelduseks on arstiõppe viie esimese kursuse läbimine. Üliõpilased õpivad tundma erakorralise meditsiini organisatsiooni ja patsientide tiraaži põhimõtteid, omandavad kliinilise kogemuse ja praktilised oskused erakorraliste haigete esmasel haiglakäsitlusel. \nÜliõpilasel on kohustus lahendada erakorralise meditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust. Küsimuste lahendamist kontrollitakse semestri lõpus."}, "objectives": [{"en": "The goal of emergency medicine practice cycle is to provide a clinical experience in emergency department: organisation of emergency medicine, incl. patient triage principles, the recognition, differential diagnosis and primary treatment of acutely ill or injured patient, incl. major trauma.", "et": "Erakorralise meditsiini praktika eesmärk on omandada praktilised oskused ja teadmised erakorraliste haigete esmasel käsitlemisel erakorralise meditsiini osakonnas. Õpitakse tundma erakorralise meditsiini korraldust, sh haigete tiraaži põhimõtteid, omandatakse praktilist kogemust erinevate erakorraliste seisundite diferentsiaaldiagnostikas ja esmases ravis. Omandatakse erakorralise kirurgilise haige (sh raske trauma) ja kriitiliste seisundite esmase käsitluse põhimõtted."}], "learning_outcomes": [{"en": "After completing the emergency medicine cycle the Student:", "et": "EM praktika läbinud üliõpilane"}, {"en": "- knows the organisation of emergency medicine and is able to perform triage in emergency department", "et": "-\torienteerub erakorralise meditsiini korralduses, tunneb erakorralise meditsiini osakonna haigete tiraaži põhimõtteid ja oskab määrata tiraaži kategooria"}, {"en": "- is able to contact with the patient and to collect disease history, is able to perform objective examination of the patient and to assess the results of investigation or analysis", "et": "-\toskab koguda haiguse, trauma ja mürgistuse anamneesi, teostada patsiendi objektiivse uurimise ja hinnata patsiendi elulisi näitajaid"}, {"en": "- is able to perform basic medical manipulations and investigations according to recommendation of clinical practice logbook", "et": "-\toskab teostada lihtsamaid kliinilisi protseduure ja uuringuid ning tõlgendada nende tulemusi (vt. praktilised oskused kliinilise praktika päevikus)"}, {"en": "- knows the primary management of a patient in critical condition (cardiac arrest, major trauma, life-threatening arrhythmias, acute coronary syndrome, acute respiratory failure, acute renal failure, coma and shock)", "et": "-\ttunneb kriitilises seisus patsiendi esmase käsitluse põhimõtteid (kliiniline surm, raske trauma, eluohtlik südame rütmihäire, äge koronaarsündroom,  äge hingamispuudulikkus, äge neerupuudulikkus, kooma ja šokk)"}, {"en": "- knows how to complete medial documentation in emergency department", "et": "-\tteab, kuidas täita arstliku dokumentatsiooni erakorralise meditsiini osakonnas"}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Praktikapäeviku täitmine ja esitamine"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Üliõpilasel on kohustus lahendada erakorralise meditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust.\nKüsimuste lahendamist kontrollitakse semestri lõpus. Kui üliõpilasel on vastava semestri minimaalne küsimuste maht lahendamata, jääb praktikaaine arvestamata.\nPraktikaaine on arstiõppe kohustuslik aine, vastavalt õppekorralduseeskirja punktile 76 kehtib arstiõppes kursusesüsteem. Kursusesüsteemi alusel õppides peab üliõpilane läbima õppeained õppekavas kehtestatud järjekorras ning täitma semestri lõpuks õppekava järgi täitmisele kuuluva kohustusliku õppe mahust 100%. Seega juhul kui semestri lõpuks on kohustuslik ülesannete hulk lahendamata kohalduvad õppekorralduseeskirja punktid 150 ja 150.3.1, mille kohaselt toimub ülikooli algatusel eksmatrikuleerimine õppeprorektori korraldusega õppeprodekaani otsuse alusel semestri lõpuks õppekava minimaalses lubatud mahus täitmata jätmisel punktis 76 nimetatud juhul."}}], "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "883e8c1d-63bd-f39d-0bd7-a36d1fc3aaaa", "person_name": "Aleksander Sipria", "structural_unit": {"code": "MVCM01", "name": {"en": "Department of Anesthesiology and Intensive Care", "et": "anestesioloogia ja intensiivravi kliinik"}, "phone": "+372 731 8405", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/anestesioloogia-intensiivravi-kliinik", "address": "L. Puusepa 8 - G1. 209\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8 - G1. 209", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-23."}}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "e086de8d-0fe1-db30-9e64-d4b257ea953f", "parent_code": "MV00.00.006", "parent_credits": 12, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}