{"uuid": "eb9e594e-3d7a-199b-04c7-cbea90ea925c", "code": "MVBS.10.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Clinical Pathology II", "et": "Kliiniline patoloogia II"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS10", "structural_unit_name": {"en": "Department of Pathological Anatomy and Forensic Medicine", "et": "patoloogilise anatoomia ja kohtuarstiteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVBS10", "name": {"en": "Department of Pathological Anatomy and Forensic Medicine", "et": "patoloogilise anatoomia ja kohtuarstiteaduse osakond"}, "email": "patol@ut.ee", "phone": "+372 737 4300", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/patoloogilise-anatoomia-ja-kohtuarstiteaduse-osakond", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "e979d518-d3bb-d364-882f-b96ebf9d7c40", "code": "MV00.00.015", "title": {"en": "Internal Medicine", "et": "Sisehaigused"}, "credits": 28, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-01T15:19:05"}, {"required": true, "uuid": "21eb468a-9a12-43e0-94c7-78a7cf4ff623", "code": "AR00.00.066", "title": {"en": "Surgery", "et": "Kirurgia"}, "credits": 12, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-01T15:21:36"}]}, "overview": {"description": {"en": "The course provides theoretical and practical knowledge about pathological diagnostics of surgical, oncological and other gynecological and skin diseases, required for independent work as a general practitioner. In addition, a brief overview is given about cytopathology. The sources of theoretical knowledge are the textbooks and presentations, video lectures and self-assessment tests represented in the Moodle learning platform. For learning of microscopic alterations, the database of digital microscopy slides with tutorial videos is available in the Moodle, grouped according to the topics. In the seminars, discussions of independently learned materials takes place and drawing associations with clinical significance.", "et": "Kursus annab kirurgiliste, onkoloogiliste ja muude günekoloogiliste ning nahahaiguste patoloogilisest diagnostikast teoreetilise ja praktilise teabe, mis on vajalik iseseisvaks tööks üldarstina. Lisaks tutvustatakse tsütoloogiliste uurimismeetodite võimalusi. Teoreetilisi teadmisi õpitakse õpikute ning Moodle õppeinfosüsteemi baasil olevate konspektide, videoloengute ja enesetestide abil. Mikroskoopiliste muutuste õppimine toimub digitaalsete histopreparaatide alusel, mis on kättesaadavad Moodle infosüsteemis koos õppevideotega teemade kaupa grupeeritud andmebaasidena. Seminarides toimub iseseisvalt omandatud teabe kinnistamine ja seostamine kliiniliste haigusjuhtudega."}, "objectives": [{"en": "The goal of clinical pathology course II is to provide deeper theoretical and practical knowledge about gynecological pathology, dermatopathology and cytology, in accordance with the program of V year. The aim is to provide an understanding of the causes, nature and diagnosis of diseases using morphological methods (microscopic examination of tissue samples, cells and body fluids), interpreting of histological diagnosis and integrating this into comprehensive medical reasoning. In addition, the aim is to provide understanding of proper sampling (biopsies and cytological material).", "et": "Kliinilise patoloogia II osa õppeaine eesmärgiks on anda süvendatud teoreetilisi ja praktilisi teadmisi naistehaiguste patoloogias, nahahaiguste patoloogias ning tsütoloogias, kooskõlas V kursuse kliiniliste tsüklitega. Eesmärgiks on anda arusaam haiguste põhjustest, olemusest, haiguste diagnoosimisest morfoloogiliste meetodite abil (koeproovide, rakkude ja kehavedelike mikroskoopiline uurimine), patoloogilise diagnoosi interpreteerimisest ja selle integreerimisest arstlikku mõtlemisse. Lisaks anda arusaam, milline peaks olema histoloogiliseks diagnoosimiseks hästi võetud koeline materjal (bioptaadid ja tsütoloogiline materjal)."}], "learning_outcomes": [{"en": "The student who graduated the course getting at least the minimal grade: knows principles of tissue sampling, knows the causes and pathogenesis of diseases, is able to understand the meaning of histological diagnoses, understands the most important morphological changes of diseases, and as a result is capable of apply this knowledge in daily medical practice.", "et": "Õppeaine läbinu vähemalt miinimumhindele omab ülevaadet uuringumaterjalide kogumise põhimõtetest, teab haiguste tekkepõhjuseid ja patogeneesi, suudab aru saada histoloogiliste diagnooside tähendusest, mõistab haiguste tähtsamaid morfoloogilisi muutusi ja suudab kokkuvõttes seda teavet rakendada igapäevases arstlikus töös."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}