{"uuid": "632b6026-1966-2a67-7002-2a5de3ed1535", "code": "MVBS.02.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Laboratory Biosafety", "et": "Laboratoorne bioohutus"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS02", "structural_unit_name": {"en": "Department of Pharmacology", "et": "farmakoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVBS02", "name": {"en": "Department of Pharmacology", "et": "farmakoloogia osakond"}, "phone": "+372 737 4350", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/farmakoloogia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is completely web-based and takes place in the Moodle environment. The course is divided into 6 modules: Introduction, Legislation and Biosafety, General Principles, Specific Pathogens, Self-Education and Testing. The course has one forum for all announcements and questions / answers; the discussion can be initiated by anyone, and the staff will try to find solutions to all questions as soon as possible. You can find mandatory materials at every module of course.", "et": "Kursus on täielikult veebipõhine ja toimub Moodle'i keskkonnas. Kursus on jaotatud 6 mooduliks: sissejuhatus, seadusandlus ja bioohutus, üldpõhimõtted, spetsiifilised patogeenid, iseseisvaks õppimiseks mõeldud materjalid ja teadmiste kontroll. Kursusel on üks foorum kõigi teadete ja küsimuste/vastuste jaoks; arutelu võib algatada igaüks ning kursuse õppejõud üritavad leida lahendusi kõigile küsimustele esimesel võimalusel. Iga mooduli juures on üles pandud kohustuslik õppematerjal."}, "objectives": [{"en": "The aim of the course is to provide those interested with basic knowledge in the field of laboratory biosafety. Participation in the course does not require previous knowledge of biosafety and the course is open to anyone interested.", "et": "Kursuse eesmärgiks on anda huvilistele põhiteadmised laboratoorse bioohutuse alal. Kursusel osalemine ei eelda varasemaid teadmisi bioohutuse kohta ning kursus on avatud kõigile huvitatutele."}], "learning_outcomes": [{"en": "The completion of the course is a prerequisite for working in a Category 2 biosafety (BSL2) laboratory. Completion of the course allows informing the Health Board and the Labor Inspectorate that the employee is competent to work in BSL2.", "et": "Kursuse läbimine on eelduseks 2. kategooria bioohutuse taseme (BSL2) laboris töötamisele. Kursuse läbimine võimaldab informeerida terviseametit ja tööinspektsiooni, et töötaja on pädev BSL2 laboris töötama."}, {"en": "After completing the course:", "et": "Pärast kursuse läbimist:"}, {"en": "*\tYou are familiar with the concepts and regulations related to biosafety in laboratories", "et": "*\tTunned laboratoose bioohutusega seotud mõisteid ja regulatsioone "}, {"en": "*\tYou know the general principles of working in the BSL2 laboratory.", "et": "*\tTead BSL2 laboris töötamise üldiseid printsiipe."}, {"en": "*\tYou know the risks involved in working in a BSL2 laboratory", "et": "*\tOmad ettekujutust BSL2 laboris töötamisega kaasnevatest riskidest"}, {"en": "*\tThe Health Board and the Labor Inspectorate may be informed that the employee is competent to work in the BSL2 laboratory.", "et": "*\tVõib informeerida terviseametit ja tööinspektsiooni, et töötaja on pädev BSL2 laboris töötama."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}