{"uuid": "cf4d5a9b-a97e-1323-2c3b-289bd178a821", "code": "MVBS.02.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-30T09:50:39", "title": {"en": "Image analysis in Biosciences", "et": "Pildianalüüs bioteadustes"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS02", "structural_unit_name": {"en": "Department of Pharmacology", "et": "farmakoloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVBS02", "name": {"en": "Department of Pharmacology", "et": "farmakoloogia osakond"}, "phone": "+372 737 4350", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/farmakoloogia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "1) Over the course of the day, students will work alongside the lecturers and their assistants, as various types of analyses are discussed. Thus, the students will create a small dataset and will become familiar with analysis tools and commands. Software: ImageJ, CellProfiler, QuPath, Inkscape, NumPy and Tensorflow/PyTorch.\n2) Students will be asked to interpret their data during the course of the day - this is a vital step that will ensure that they understand the importance of careful understanding of their analyses and commands. \n3) The students will create a \"publication ready\" figure, using Inkscape and the data they generated during the course of the day. This will serve as a model when students create their own figures in the future, in a thesis or publication. \n4) Students will take these datasets and figures with them at the end of the day. They will serve as a basis for further learning.", "et": "1) 1-päevase kursuse jooksul töötavad üliõpilased koos lektorite ja nende assistentidega ning arutavad mitmesuguseid analüüsitüüpe. Üliõpilased koostavad väikese andmekogumi ja tutvuvad analüüsivahendite ja käskudega. Tarkvara: ImageJ, CellProfiler, QuPath, Inkscape, NumPy and Tensorflow/PyTorch\n2) Üliõpilastel palutakse tõlgendada oma andmeid ühepäevase kursuse jooksul - see on väga oluline etapp, mis kinnitab, et nad on aru saanud oma analüüsiprotsessist\n3) Üliõpilased loovad publitseerimisvalmis joonise, kasutades Inkscape ja andmeid, mis nad on saanud 1-päevase kursuse jooksul. See on üliõpilastele mudeliks oma enda jooniste loomiseks tulevikus teeside või publikatsiooni jaoks.\n4) Üliõpilased võtavad 1-päevase kursuse lõpus enda poolt loodud andmekogumid ja joonised endaga kaasa. Need on aluseks edaspidisteks õpinguteks."}, "objectives": [{"en": "Introduction to automated and semi-automated image analysis for biosciences.\nStudents will be introduced to software including ImageJ, CellProfiler, QuPath, artificial-intelligence based analysis in    NumPy and Tensorflow/PyTorch, and the creation of publication-ready images using Inkscape.", "et": "Tutvustada automatiseeritud ja poolautomatiseeritud pildianalüüsi bioteadustes. Üliõpilastele tutvustatakse tarkvara, sealhulgas ImageJ, CellProfiler, QuPath, tehisarul põhinevat analüüsi NumPy ja Tensorflow/PyTorch ning publitseerimisvalmis piltide loomist, kasutades InkScape"}], "learning_outcomes": [{"en": "Students will create a dataset using ImageJ, CellProfiler, QuPath, NumPy and Tensorflow/PyTorch and will create a publication-ready figure using InkScape", "et": "Üliõpilane peab koostama andmekogumi, kasutades programme ImageJ, CellProfiler, QuPath, NumPy and Tensorflow/PyTorch ning looma publitseerimisvalmis joonise, kasutades InkScape"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}