{"uuid": "63258b4c-3fe6-b9e4-211e-e2eddb19893e", "code": "MVBS.03.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Neuroscience", "et": "Närviteadus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS03", "structural_unit_name": {"en": "Department of Physiology", "et": "füsioloogia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVBS03", "name": {"en": "Department of Physiology", "et": "füsioloogia osakond"}, "phone": "+372 737 4330", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/fusioloogia-osakond", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Neuroscience course is oriented for both Ph.D. and master degree students. Theoretical course provides the overview about the general and conceptual approaches in neuroscience. The following topics are covered during the course: bioelectrical processes in the nervous system, signal transduction, sensory systems, motor systems, and the integrative functions of central nervous system. Aim of practical courses is to study the selected research methods applied in the behavioural neuroscience.", "et": "Närviteaduse kursus on mõeldud nii doktori- kui ka magistriõppele. Teoreetilises osas antakse ülevaade närviteaduse olulisematest teemadest. Käsitletakse närvisüsteemis toimuvaid bioelektrilisi protsesse, sünaptilist ülekannet, meelesüsteeme, motoorseid süsteeme, samuti vaadeldakse kesknärvisüsteemi integratiivseid funktsioone. Praktiliste tööde raames omandatakse valik närviteaduses käsitletavaid uurimismeetodeid."}, "objectives": [{"en": "Main aim of current course is to give the overview for master degree students in biomedicine about the conceptual and methodological approaches in neurosciences applied for study of brain function and behaviour.", "et": "Aine eesmärk on tutvustada biomeditsiini magistrantidele neuroteaduse olulisemaid kontseptsioone ja meetodeid, mida kasutatakse ajutalitluse ja käitumise uurimiseks."}], "learning_outcomes": [{"en": "After completion of current course the student is able to present the main conceptual approaches in neurosciences. Also the students have the understanding about the relevant methods for study of brain functions and behaviour.", "et": "Peale kursuse läbimist oskab üliõpilane kirjeldada olulisemaid neuroteaduse kontseptsioone. Samuti omab ta teadmisi olulisematest uurimismeetoditest ajutalitluse ja käitumise uurimiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}