{"uuid": "9187388f-ef6c-2834-9787-039f75be4aed", "code": "MVBS.10.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Pathological Anatomy", "et": "Patoloogiline anatoomia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVBS10", "structural_unit_name": {"en": "Department of Pathological Anatomy and Forensic Medicine", "et": "patoloogilise anatoomia ja kohtuarstiteaduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVBS10", "name": {"en": "Department of Pathological Anatomy and Forensic Medicine", "et": "patoloogilise anatoomia ja kohtuarstiteaduse osakond"}, "email": "patol@ut.ee", "phone": "+372 737 4300", "webpage_url": "https://biomeditsiin.ut.ee/et/sisu/patoloogilise-anatoomia-ja-kohtuarstiteaduse-osakond", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVBS"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "0cb65e5e-f622-5ab6-b075-e61f05031e62", "code": "ARBK.01.030", "title": {"en": "Medical Biochemistry", "et": "Meditsiiniline biokeemia"}, "credits": 11, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "4956b9f5-c5fa-8d7f-199b-2aff3f054d4c", "code": "ARFS.01.030", "title": {"en": "Human Physiology", "et": "Inimese füsioloogia"}, "credits": 12, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "08062000-550e-51cc-0072-7fdd19958710", "code": "ARMB.01.020", "title": {"en": "Medical Microbiology", "et": "Meditsiiniline mikrobioloogia"}, "credits": 9, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The course provides theoretical and practical basis of knowledge about general pathological processes and pathomorphological alterations, necessary for proceeding into the study of clinical disciplines. In the course the basic mechanisms and morphological changes of general pathological processes (cell injury, adaptations, the body's means of response and reparation, circulatory disorders) and tumors will be covered, emphasizing practical diagnostic meaning of these changes in most wide-spread diseases such as cardiovascular, inflammatory and neoplastic. \nThe study is perfomed in team based learning seminars. For independent study serve the textbooks and presentations, videolectures and self-assessment tests represented in the Moodle learning platform. For learning of microscopic alterations, the database of digital microscopy slides with tutorial videos is available in the Moodle, grouped according to the topics. In the practical classes, discussions of independently learnt materials takes place and drawing associations with pathogenesis of disease as well as clinical significance.\nMacroscopic alterations are mostly introduced in practical classes by using the native preparations. For recapitulation of theoretical material, a database of macroscopic preparations is available in the Moodle. In seminars and practical classes, description of cases, their analysis and integrating into formulation of diagnostic hypothesis is practiced both orally and in group activities.\nParticipation in seminars and practical classes is mandatory. The students have to complete all tests, assessments and practical tasks by terms.", "et": "Kursus annab olulisematest haiguslikest protsessidest ja haiguslikest muutustest teoreetilise ja praktilise baasteabe, mis on vajalik kõigi kliiniliste distsipliinide järgnevaks omandamiseks. Aines õpitakse üldpatoloogiliste protsesside (rakukahjustus, adaptatsioon, paranemisprotsessid, põletik, vereringehäired) ja kasvajate patogeneesi ja morfoloogia põhialuseid ning nende praktilist tähendust levinumate haiguste korral, sealhulgas südame-veresoonkonnahaigused, põletikud ja kasvajalised haigused.\nTeoreetilisi teadmisi õpitakse rühmatöö seminarides ja iseseivalt õpiku ning Moodle õppeinfosüsteemi baasil konspektide, videoloengute ja enesetestide abil. Mikroskoopiliste muutuste õppimine toimub digitaalsete histopreparaatide alusel, mis on kättesaadavad Moodle süsteemis koos õppevideotega teemade kaupa grupeeritud andmebaasidena. Praktikumides toimub iseseisvalt omandatud teabe kinnistamine ja seostamine haigusprotsessidega ning kliiniliste tähendustega.  Makroskoopiliste muutuste põhiline õpe toimub praktikumides natiivsete preparaatide alusel. Teoreetiliseks kordamiseks on Moodles loodud makropreparaatide kirjelduste andmebaas. Praktikumides ja seminarides harjutatakse suuliste vastuste ja grupitegevustena juhupõhiste patomorfoloogiliste muutuste kirjeldamist, analüüsi ja integreerimist diagnoosihüpoteeside püstitamisse.\nPraktikumides ja seminarides osalemine on kohustuslik. Üliõpilased peavad tähtajaks olema sooritanud kõik testid, arvestused ja praktilised ülesanded."}, "objectives": [{"en": "The goal of pathological anatomy course is to provide integrated theoretical and practical knowledge about the causes (etiology), the mechanisms by which a causative agent leads to disease (pathogenesis) and the associated alterations of structure (pathomorphology). In the study, the student will develop the skills of observation, interpretation, and integration needed to analyze human disease; to develop comprehensive medical reasoning so that the student would become able to explain the pathogenesis of morphological lesions and understand their clinical symptoms and consequences.  The course is a prerequisite for clinical disciplines in 4.-5. years and preparing for work as a general practitioner.", "et": "Patoloogilise anatoomia õppeaine eesmärgiks on anda integreeritud teoreetilisi ja praktilisi teadmisi haiguste põhjustest (etioloogiast), nende toimel haiguse kujunemist (patogeneesist) ning haiguseprotsessis tekkivatest struktuurilistest (patomorfoloogilistest) muutustest organismais ja organites. Õppimise käigus saab üliõpilane ülevaate haigustunnuste uurimisest, tulemuste interpreteerimisest, mõistab seoseid haiguslike muutuste ja kliiniliste avalduste vahel, kujundades seoselist arstlikku mõtlemist. Õppeaine annab 4.-5.õppeaasta kliinilisteks tsükliteks vajalikud teadmised patoloogilisest anatoomiast ja on osaks ettevalmistusest tööks üldarstina."}], "learning_outcomes": [{"en": "The student who graduated the course getting at least the minimal grade: knows terms, definitions and names of most important diagnoses in pathological anatomy; is able to make associations between macroscopic or microscopic pathomorphological changes and their etiopathogenetic mechanisms as well as clinical symptoms and functional consequences to the organism; can formulate logically the pathogenetic reasoning of the diseases; is able to distinguish pathomorphological changes of the most frequent diseases from normal findings, create diagnostic hypotheses and evaluate them in the context of clinical classifications; has experience of collaboration within a group; is adaptable and motivated of self-development.", "et": "Õppeaine läbinu vähemalt miinimumhindele teab patoanatoomias kasutatavaid mõisteid, definitsioone ja olulisemaid diagnoose; oskab luua seoseid makro- ja mikroskoopiliste patomorfoloogiliste muutuste ja nende tekkemehhanismide ning kliiniliste sümptomite ja organismi talituslike tagajärgede vahel;  formuleerib loogiliselt haiguste patogeneetilisi põhjendusi; suudab eristada levinumatele haigustele iseloomulikke patomorfoloogilisi muutusi normist ja püstitada diagnoosihüpoteese; omab meeskonnatöökogemust; on kohaemisvõimeline ja valmis ennast edasi arendama."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}