{"uuid": "ccc84496-9fa6-a9f9-2021-60174f666d19", "code": "MVCM.13.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Clinical Science 1 - Data", "et": "Kliinilise teaduse sissejuhatus 1 - andmed"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM13", "structural_unit_name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The module provides practical examples of data and data interpretation. Each day includes a variety of teaching methods, including lectures and interactive seminars. Students analyse published works and pre-compiled data sets. Students are expected to evaluate the literature critically and determine its value within the overall evidence base. They are instructed in the use of basic statistical methods. Learners are also tested informally through short interactive tests; analysis of the group's responses is also important. \nThese are transferable skills that would be of benefit to all clinical researchers.", "et": "Kursus pakub praktilisi näiteid andmetest ja andmete tõlgendamisest. Iga õppepäev sisaldab erinevaid õpetamismeetodeid, sealhulgas  loenguid ja interaktiivseid seminare. Üliõpilased analüüsivad avaldatud töid ja koostatud andmekogumeid. Üliõpilastelt oodatakse kirjanduse kriitilisi hinnanguid ja selle väärtuse kindlaksmääramist üldises tõendusbaasis. Neid juhendatakse statistiliste põhimeetodite kasutamisel. Õppijaid testitakse ka mitteametlikult lühikeste interaktiivsete testide abil; oluline on vastuste analüüs rühmiti.  Need on ülekantavad oskused, millest oleks kasu kõigile kliinilistele teadlastele."}, "objectives": [{"en": "The goal is to provide the student with a scientific toolbox that facilitates an understanding of clinical science. The aim is to provide exposure to different types of data and different ways of interpreting the data, focusing on the most appropriate interpretation of published literature.", "et": "Eesmärk on anda üliõpilasele teaduslik tööriistakast, mis võimaldab mõista kliinilist teadust. Eesmärk on pakkuda kokkupuudet erinevat tüüpi andmetega ja erinevate andmete tõlgendamise viisidega, keskendudes avaldatud kirjanduse asjakohasele tõlgendamisele."}], "learning_outcomes": [{"en": "The student completing the module:", "et": "Mooduli läbinud üliõpilane:  "}, {"en": "* is familiar with health records and obtaining nutritional data ", "et": "* tunneb terviseandmete säilitamist ja toitumisalaste andmete hankimist"}, {"en": "* understands the importance of confidentiality and data protection ", "et": "* saab aru konfidentsiaalsuse ja andmekaitse olulisusest"}, {"en": "* knows about quantitative and qualitative data ", "et": "* tunneb kvantitatiivseid ja kvalitatiivseid andmeid"}, {"en": "* understands the principles of medical research (including randomised controlled trials, meta-analysis, etc.) ", "et": "* mõistab meditsiiniuuringute põhimõtteid (sh randomiseeritud kontrollitud uuringud, metaanalüüs jne)"}, {"en": "* understands and is able to use simple parametric and non-parametric statistical tools", "et": "* saab aru ja oskab kasutada tavalisi parameetrilisi ja mitteparameetrilisi statistilisi tööriistu"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}