{"uuid": "5b53890e-8a75-ebe7-d652-38264ac29c0c", "code": "MVCM.13.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-04T09:41:40", "title": {"en": "Master's Research and Thesis", "et": "Magistritöö"}, "credits": 30, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM13", "structural_unit_name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "For the research, the student is supported through previous literature, with assistance in the development and implementation of the methodology, if necessary through in-service training, and then to ensure the capture of meaningful results. For the dissertation, the student is shown how to use the literature, how to describe his/her methodology, how to present the results and how to discuss them intelligently.", "et": "Uurimistöö jaoks toetatakse üliõpilast kaasaegse kirjanduse kaudu, aidatakse metoodika väljatöötamisel ja rakendamisel, vajaduse korral täiendkoolitusega ning seejärel sisukate tulemuste püüdmise tagamiseks. Lõputöö jaoks juhendatakse üliõpilast kasutama kirjandust, juhendatakse kuidas kirjeldada oma metoodikat, kuidas tulemusi esitada ja kuidas neid arukalt arutada."}, "objectives": [{"en": "The aim of the master's project is to develop the student's independent research skills within the framework of a clinical nutrition research project.", "et": "Õppeaine eesmärgiks on üliõpilase iseseisva teadustöö oskuste arendamine kliinilise toitmise teadusprojekti raames."}], "learning_outcomes": [{"en": "The student completes his or her master's work with the dissertation. This is done in a field of clinical nutrition and may be of a practical nature (data collection, analysis). The student can also do a \"library thesis\", during which a systematic review or meta-analysis is performed.\nIn all cases, the student submits a paper suitable for publication, the student demonstrating an ability for self direction.\nHe/she should be able to explain (orally and in writing) why the work was undertaken (background), and exactly what was done (methods).  He/she should be able to describe the results clearly and be able to interpret them and put them in context (debate/discussion).", "et": "Magistritöö tehakse kliinilise toitmisega seotud valdkonnas ja võib olla praktilise loomuga (andmete kogumine, analüüs). Üliõpilane otsib, valib, süstematiseerib, analüüsib teemakohast teaduskirjandust, mille käigus viiakse läbi süsteemne ülevaade või metanalüüs. Kõigil juhtudel esitab üliõpilane avaldamiseks sobiva töö. Eeldatakse, et üliõpilane demonstreerib iseseisvalt töötamise oskust. Oskab sõnastada suuliselt ja kirjalikult uurimustöö valikut, tausta ja suudab täpselt seletada kuidas uurimustöö läbi viidi, meetodid.\nOskab tulemusi selgelt kirjeldada ja tõlgendada ja panna need õigesse konteksti (arutelu)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}