{"uuid": "30befb96-1723-7b5d-5d32-8e7be0ca22d7", "code": "MVCM.18.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Clinical Genetics", "et": "Kliiniline geneetika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM18", "structural_unit_name": {"en": "Department of Clinical Genetics", "et": "kliinilise geneetika keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM18", "name": {"en": "Department of Genetics and Personalized Medicine", "et": "geneetika ja personaalmeditsiini kliinik"}, "phone": "+372 731 9491", "address": "L. Puusepa 2\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 2", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During this course will give the knowledge about the organisation of genetic service in Estonia and their ethical aspects. Thoroughly will be studied different investigation methods in clinical genetics and their interpretation. Separately we will handle the investigation methods of chromosomes, genes and metabolites. Study will focus on most common inherited disorders and/or patient's groups, their diagnostics, counselling and treatment (infertility, familiar cancer, prenatal diagnostics for pregnant women, monogenic and multifactorial disorders, neurogeneterative disorders in adulthood). Finally, we will give the information about the treatment options for inherited disorders and their practical application in Estonia.", "et": "Antud kursuse raames õpetatakse kliinilise geneetika korraldust Eestis meditsiinisüsteemis ja selle eetilisi aspekte. Põhjalikult õpitakse tundma erinevate geneetiliste testide teostamise võimalusi ja interpreteerimist. Eraldi käsitletakse kromosoomide, geenide ja metaboliitide uurimist. Õpitakse sadeasemate pärilike haiguste ja/või patsiendi gruppide diagnostikat, nõustamist ja ravi (infertiilsus, perekondlik vähk, sünnieelne diagnostika rasedatele, monogeensed ja multifaktoriaalsed haigused, neurodegeneratiivsed haigused täiskasvanu eas). Lõpetuseks käsitletakse pärilike haiguste erinevaid ravi võimalusi ja praktilist rakendust Eestis."}, "objectives": [{"en": "To give detailed overview about all areas of clinical genetics, the diagnostics and treatment of genetic diseases, and the organisation of genetic service in Estonia to the students of Master of Science in biomedicine.", "et": "Anda biomeditsiini magistriõppe üliõpilastele detailne ülevaade kliinilise geneetika alamvaldkondadest, geneetiliste haiguste diagnostika ja ravivõimalustest ning geneetilise teenistuse korraldusest Eesti meditsiinisüsteemis."}], "learning_outcomes": [{"en": "After passing this study a student of Master of Science in biomedicine knows the basic knowledge of clinical genetics and is prepared to work in cytogenetic, molecular diagnostic and/or in metabolic laboratory.", "et": "Õppeaine läbimise järgselt omab biomeditsiini magistrant baasteadmisi kliinilise geneetika valdkonnast, et olla ette valmistatud töötamiseks tsütogeneetika, molekulaardiagnostika või ainevahetushaiguste laborites."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}