{"uuid": "ef084620-e114-57f5-63fd-655d0d862791", "code": "MVCM.13.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Clinical Nutrition 1", "et": "Sissejuhatus kliinilisse toitmisesse 1"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM13", "structural_unit_name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The module provides practical examples of the activities of nutritionists and their role in the treatment team. Different teaching methods are used. Several times a week, students are expected to work on prepared clinical case material and clinical data. Students are expected to present their findings individually and also as members of their own group. Based on practical examples, the course thus provides an overview of how clinical nutritionists can contribute to the optimization of treatment regimens by using and applying their knowledge. Learners are tested using short interactive tests, in which the analysis of answers plays an important role. The aim at this stage is to increase confidence in solving problems. The student is introduced to macro- and micronutrients and their main biochemical properties. There will be demonstration and analysis of methods for screening and assessing nutritional status and methods for determining body composition.\nThe basic concepts of nutrition intervention are introduced together with the practical possibilities.", "et": "Kursus annab praktilisi näiteid toitmisspetsialistide tegevusest ja nende rollist ravimeeskonnas. Kasutatakse erinevaid õpetamismeetodeid. Mitu korda nädalas oodatakse õpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmete kallal. Üliõpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühmatööna. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitmisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Õppijaid testitakse  lühikeste interaktiivsete testide abil, kus vastuste analüüsil on suur roll. Selle etapi eesmärk on suurendada enesekindlust probleemide  lahendamisel.   Üliõpilasele tutvustatakse makro- ja mikrotoitaineid ning nende peamisi biokeemilisi omadusi. Demonstreeritakse ja analüüsitakse toitumise sõeluuringuid ja hindamise meetodeid ning keha koostise määramise meetodeid.\nToitumisalase sekkumise põhimõisteid tutvustatakse koos praktiliste võimalustega."}, "objectives": [{"en": "The aim of the module is to give an overview of all aspects of clinical nutrition, to show how basic science determines the patient's requirements, and how to realise these requirements.", "et": "Kursuse eesmärk on anda ülevaade kliinilisest toitmisest ja näidata, kuidas baasteadusest lähtuvalt määratleda patsiendi toitmisalased vajadused ning kuidas neid realiseerida."}, {"en": "The student will be taught to identify the key issues needed to assess patients and their needs, placing this process in the context of the medical team's activities.", "et": "Üliõpilane omandab võtmeoskused, mis on vajalikud patsientide ja nende vajaduste hindamiseks, asetades selle protsessi ravimeeskonna tegevuse konteksti."}, {"en": "The objective is to apply a practical approach to gathering the necessary clinical information and to balance it with the learned properties of nutrients in their various natural and artificial presentations.", "et": "Eesmärk on praktilise lähenemisviisi rakendamine vajaliku kliinilise teabe kogumisel ja selle tasakaalustamine toitainete omadustega nende erinevates looduslikes ja kunstlikes kogumites."}, {"en": "The module will provide the student with the materials needed for compiling simple general nutrition prescriptions, which can later be expanded to form the basis of clinical practice.", "et": "Kursus annab üliõpilasele vajalikud teadmised lihtsate üldiste toitumis-retseptide koostamiseks, mis on hiljem laiendatavad kliinilise praktika aluseks."}, {"en": "The course provides knowledge about what is in the various therapeutic preparations, so that later it will be easier to understand why problems arise and how to overcome them.", "et": "Kursus annab teadmisi erinevate terapeutiliste preparaatide kohta, samuti võimalike probleemide ja nende lahendamise kohta."}], "learning_outcomes": [{"en": "The student completing the module:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "* Knows the principles of clinical nutrition", "et": "* Teab kliinilise toitmise põhimõtteid"}, {"en": "* Understands the differences between screening and assessment and is able to do both", "et": "* Mõistab sõeluuringute ja hindamise erinevusi ning suudab mõlemat teha"}, {"en": "* Has a practical understanding of body composition measurement", "et": "* Omab praktilist arusaama keha koostise mõõtmisest"}, {"en": "* Understands the nature of disease-related malnutrition", "et": "* Mõistab haigusega seotud alatoitmise olemust"}, {"en": "* Has working knowledge of the biochemis-try & physiology of macro- & micronutrients", "et": "* Omab töökogemust makrotoitainete ja mikrotoitainete biokeemias ning füsioloogias"}, {"en": "* Understands the composition of artificial enteral and parenteral feeds", "et": "* Mõistab kunstliku enteraalse ja parenteraalse toimise koostisest"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}