{"uuid": "bd5054f3-fc57-bc1c-223d-514f65286cdf", "code": "MVCM.13.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Clinical Science 2 - Presentation", "et": "Kliinilise teaduse sissejuhatus 2 - esitlusoskused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM13", "structural_unit_name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Different teaching techniques are used in the module. The lectures give a general overview of the topics. For each possible task (giving an oral presentation, writing an ethics application, etc), the student has the opportunity to work on examples. They are then used as group work material and to support the general improvement of students' skills. \nThese are also transferable skills that will benefit all clinical researchers.", "et": "Kursusel kasutatakse erinevaid õpetamistehnikaid. Loengutes antakse teemadest üldine ülevaade. Iga võimaliku ülesande (suulise ettekande pidamine, eetikarakenduse kirjutamine jne) jaoks on üliõpilasel võimalus tuua oma näiteid. Seejärel kasutatakse neid rühmatöö materjalina ja õpilaste oskuste üldise parandamise toetamiseks.  Need on ka ülekantavad oskused, millest oleks kasu kõigile kliinilistele teadlastele."}, "objectives": [{"en": "The objective is to help the student to develop into a clinical researcher who can use this new set of skills to make intelligent evaluations of the literature.", "et": "Selle eesmärk on aidata üliõpilasel arendada endas oskusi uurimistööks, mida saaks kasutada kirjanduse kriitliste ülevaadete tegemiseks."}, {"en": "The aim is to improve the student's presentation skills in the typical oral and written assignments that are important in every academic field.", "et": "Eesmärk on parandada õpilase esinemisoskust tüüpilistes suulistes ja kirjalikes ülesannetes, mis on olulised igas akadeemilises valdkonnas."}], "learning_outcomes": [{"en": "The student completing the module:", "et": "Aine läbinud üliõpilasel on:    "}, {"en": "* will have the ability to interpret research and evaluate its value on the basis of objective criteria", "et": "* oskus tõlgendada teadustööd ja hinnata selle väärtust objektiivsete kriteeriumide alusel"}, {"en": "* has a complete overview of the peer review process", "et": "* on täielik ülevaade vastastikuse eksperdihinnangu protsessist  "}, {"en": "* has an ability to give a clear oral presentation using appropriate visual aids", "et": "* oskus teha selge suulise ettekande, kasutades sobivaid visuaalseid abivahendeid"}, {"en": "* has the ability to write different types of scientific papers (conference abstracts, grant applications, papers for publication, etc).", "et": "* oskus koostada erinevat tüüpi teaduslikke kirjutisi (konverentsi kokkuvõte, stipendiumitaotlus, avaldamiseks mõeldud dokument jne)"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}