{"uuid": "6772c137-26c8-14cf-5895-aaaa59cc1ac7", "code": "MVCM.13.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Metabolic Response to Stress", "et": "Ainevahetusreaktsioon stressile"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVCM13", "structural_unit_name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Different teaching methods are used. Several times a week, students are expected to work on prepared clinical case material and clinical data. Students are expected to present their findings individually and also as members of their group. Based on practical examples, the module thus provides an overview of how clinical nutritionists can contribute to the optimisation of treatment regimens by using and applying their knowledge. As before, learners are tested informally with short interactive quizzes. The metabolic response to stress is a large part of what determines disease-related malnutrition. The module focuses on the aspects that are most important in clinical practice.", "et": "Kasutatakse erinevaid õpetamismeetodeid. Mitu korda nädalas oodatakse õpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmete. Üliõpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühmaga. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitmisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Nagu varemgi, testitakse õppijaid mitteametlikult lühikeste interaktiivsete viktoriinidega.  Metaboolne reaktsioon stressile on suur osa sellest, mis määratleb haigusega seotud alatoitumise. Moodul keskendub aspektidele, mis on kliinilises praktikas kõige olulisemad."}, "objectives": [{"en": "The goal is to ensure that the student understands why insulin resistance is so important when metabolism is impaired and why it is nutritionally important in all sick people.", "et": "Eesmärk on tagada, et üliõpilane mõistaks, miks insuliiniresistentsus on nii oluline, kui ainevahetus on häiritud, ja miks see on oluline kõigi haigete inimeste toitumises."}, {"en": "Special attention to patients with cancer and perioperative patients is used to bring a clinical focus to the pathophysiological phenomena.", "et": "Patofüsioloogilise nähtuse kliinilise fookuse toomiseks kasutatakse vähihaigete ja perioperatiivses seisundis olevate patsientide erilist tähtsust."}], "learning_outcomes": [{"en": "The student completing the module:", "et": "Aine läbinud üliõpilane: "}, {"en": "* knows the principles of metabolic response to stress", "et": "* teab metaboolse reageerimise põhimõtteid stressile"}, {"en": "* knows the importance of insulin resistance", "et": "* teab insuliiniresistentsuse tähtsust"}, {"en": "* is able to apply this knowledge in the nutritional management of patients with cancer, having surgery, and in the emergency department", "et": "* oskab neid teadmisi rakendada vähihaigete, operatsioonil olevate ja kriitilise abi osakonnas olevate patsientide toitmisalases juhtimises"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}