{"uuid": "b72d6022-0230-3cb6-9413-7400241175dc", "code": "MVFA.00.062", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-26T10:58:35", "title": {"en": "Entrepreneurship for a Pharmacist", "et": "Ettevõtluse alused farmaatsias"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "In the course of the subject, an overview of pharmacy management and the aspects necessary for starting a pharmacy business are given. In order to pass the subject, three independent written works must be submitted, one of which is a team work. It is necessary to participate in all seminars, about which the student makes entries in his study diary during the seminar. An elevator speech must be presented regarding the business plan based on teamwork, according to the given topics and the agreement within the team. If the deadlines for independent work are not met or it is not possible to participate in the seminar, additional written assignments will be added.", "et": "Õppeaine käigus antakse ülevaade apteegi juhtimisest ja apteegiäri alustamiseks vajalikest aspektidest. Aine läbimiseks tuleb esitada kolm iseseisvat kirjalikku tööd, millest üks on meeskonnatöö. Osaleda on vajalik kõikidel seminaridel, mille kohta õpilane teeb seminari käigus sissekanded oma õppepäevikusse. Äriplaani kohta tuleb esitada liftikõne meeskonnatööl põhineva, etteantud teemade ja meeskonnasisese kokkuleppe järgi. Kui iseseisva töö tähtaegadest ei peeta kinni või ei ole võimalik seminaril osaleda, lisanduvad täiendavad kirjalikud tööd."}, "objectives": [{"en": "The subject provides an overview of pharmacy management and business, including quality and personnel management.", "et": "Aine annab ülevaate apteegi juhtimisest ja äritegevusest, sh kvaliteedi- ja personalijuhtimisest."}], "learning_outcomes": [{"en": "A student who has passed the subject:", "et": "Üliõpilane, kes on aine läbinud:"}, {"en": "* has knowledge of various principles of management (including personnel management)", "et": "* omab teadmisi erinevatest juhtimise põhimõtetest (sh personalijuhtimisest)"}, {"en": "* understands how to implement quality management in the organization", "et": "* mõistab, kuidas kvaliteedijuhtimist organisatsioonis rakendada"}, {"en": "* understands the general principles of marketing and sales", "et": "* mõistab turunduse ja müügi üldisi põhimõtteid"}, {"en": "* can prepare quality indicators (Donabedian model, ISO standard)", "et": "* oskab koostada kvaliteedinäitajaid (Donabedia mudel, ISO standard)"}, {"en": "* can prepare key business performance indicators ", "et": "* oskab koostada äritegevuse põhinäitajaid"}, {"en": "* can assess the regional market and competition situation", "et": "* oskab hinnata piirkondlikku turgu ja konkurentsiolukorda"}, {"en": "* understands the principles of pharmacy management", "et": "* mõistab apteegi juhtimise põhimõtteid"}, {"en": "* can prepare the primary budget of the pharmacy, taking into account costs and revenues (including investments)", "et": "* oskab koostada apteegi esmast eelarvet, arvestades kulusid ja tulusid (sh investeeringuid)"}, {"en": "* orients himself in the legal space related to the provision of pharmacy services", "et": "* orienteerub apteegiteenuse osutamisega seotud õigusruumis"}, {"en": "* can prepare an initial action plan to start providing pharmacy services.", "et": "* oskab koostada esialgse tegevuskava apteegiteenuse osutamise alustamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}