{"uuid": "2c7e1edf-a39a-9c5e-f41a-d0127f5fe87b", "code": "MVFA.00.053", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T15:00:53", "title": {"en": "Treatment of Pain and Infections", "et": "Valu ja infektsioonide ravi"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Based on practical examples, the subject gives an overview of how the clinical pharmacist can contribute to the optimization of the treatment regimens of patients with infectious diseases and in pain management. As homework, students solve clinical cases about optimizing a patient's treatment regimen. In the webinar, there will be a discussion based on clinical cases.", "et": "Õppeaine annab praktilistele näidetele tuginedes ülevaate sellest, kuidas kliiniline apteeker saab kaasa aidata nakkushaigustega patsientide raviskeemide optimeerimisele ja valu leevendamisele. Kodutööna lahendavad õpilased kliinilisi juhtumeid patsiendi raviskeemi optimeerimise kohta. Veebiseminaril toimub arutelu kliiniliste juhtumite põhjal."}, "objectives": [{"en": "The aim of the subject is to provide an overview of the most common infectious diseases and to discuss the peculiarities of drug administration and the role of the clinical pharmacist in optimizing treatment regimens for patients with infections.The purpose of the module is to provide an overview about use of analgetics and the role of clinical pharmacist in the pain management team.", "et": "Õppeaine eesmärk on anda ülevaade levinumatest nakkushaigustest ning arutleda ravimite manustamise iseärasuste ja kliinilise apteekri rolli üle infektsioonihaigete raviskeemide optimeerimisel. Mooduli eesmärk on anda ülevaade valuvaigistite kasutamisest ja kliinilise apteekri rollist valujuhtimismeeskonnas."}], "learning_outcomes": [{"en": "A student who has passed the subject:", "et": "Üliõpilane, kes on aine läbinud:"}, {"en": "* knows the principles of practicing clinical pharmacy in the treatment of pain and infections", "et": "* tunneb kliinilise farmaatsia praktiseerimise põhimõtteid valu ja infektsioonide ravis"}, {"en": "* has the necessary knowledge of the principles of antimicrobial and antiviral treatment for a clinical pharmacist", "et": "* omab kliinilisele apteekrile vajalikke teadmisi antimikroobse ja viirusevastase ravi põhimõtetest"}, {"en": "* knows analgetics and  the principles of their use and selection", "et": "* tunneb analgeetikume ning nende kasutamise ja valiku põhimõtteid"}, {"en": "* has knowledge of how to advise doctors, nurses and patients regarding pain treatment and pharmacological treatment for infectious diseases ", "et": "* omab teadmisi, kuidas nõustada arste, õdesid ja patsiente valuravi ja nakkushaiguste farmakoloogilise ravi osas "}, {"en": "* knows the principles of antimicrobial resistance management and can apply them", "et": "* tunneb antimikroobse resistentsuse juhtimise põhimõtteid ja oskab neid rakendada"}, {"en": "* identifies and analyzes bottlenecks in pharmacotherapy from a clinical pharmacist's point of view.", "et": "* Tuvastab ja analüüsib farmakoteraapia kitsaskohti kliinilise apteekri vaatenurgast."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}