{"uuid": "a4a943ab-8772-ecd4-908f-0f17e6844c58", "code": "MVFA.00.054", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-26T14:01:45", "title": {"en": "Chronic Diseases I (Neurological, Cardiovascular, Endocrinological Diseases)", "et": "Kroonilised haigused I (neuroloogilised, kardiovaskulaarsed, endokrinoloogilised haigused)"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Based on practical examples, the subject gives an overview of how the clinical pharmacist can contribute to the optimization of the treatment regimens in patients with neurological, cardiovascular, endocrinological diseases. As homework, students solve clinical cases about optimizing a patient's treatment regimen. In the webinar, there will be a discussion based on clinical cases.Treatment of hypertension, angina pectoris, myocardial infarction, heart failure, diabetes, thyroid disease, osteoporosis, epilepsia, Parkinson disease will be covered.", "et": "Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline apteeker saab kaasa aidata neuroloogiliste, kardiovaskulaarsete, endokrinoloogiliste haigustega patsientide ravirežiimide optimeerimisele. Kodutööna lahendavad õpilased kliinilisi juhtumeid patsiendi raviskeemi optimeerimise kohta. Veebiseminaril arutletakse kliiniliste juhtumite põhjal.Arutletakse hüpertensiooni, stenokardia, müokardiinfarkti, südamepuudulikkuse, diabeedi, kilpnäärmehaiguste, osteoporoosi, epilepsia, Parkinsoni tõve ravi."}, "objectives": [{"en": "The aim of the subject is to provide an overview of the most common neurological, cardiovascular and endocrinological diseases and to discuss the peculiarities of drug administration and the role of the clinical pharmacist in optimizing treatment regimens for patients with these diseases.", "et": "Õppeaine eesmärk on anda ülevaade enamlevinud neuroloogilistest, kardiovaskulaarsetest ja endokrinoloogilistest haigustest ning arutleda ravimite manustamise iseärasuste ning kliinilise apteekri rolli üle nende haigustega patsientide raviskeemide optimeerimisel."}], "learning_outcomes": [{"en": "A student who has passed the subject:", "et": "Üliõpilane, kes on aine läbinud:"}, {"en": "* knows the principles of practicing clinical pharmacy in the treatment of patients with neurological, cardiovascular, endocrinological diseases", "et": "* tunneb kliinilise farmaatsia praktiseerimise põhimõtteid neuroloogiliste, kardiovaskulaarsete, endokrinoloogiliste haigustega patsientide ravis"}, {"en": "* can notice and analyze the bottlenecks of pharmacotherapy from the point of view of a clinical pharmacist", "et": "* oskab märgata ja analüüsida farmakoteraapia kitsaskohti kliinilise apteekri vaatenurgast"}, {"en": "* knows the principles of pharmacotherapy of the diseases covered in the subject and knows the principles of the use and selection of drugs for these diseases", "et": "* tunneb aines käsitletavate haiguste farmakoteraapia põhimõtteid ning teab nende haiguste ravimite kasutamise ja valiku põhimõtteid"}, {"en": "* has the necessary knowledge for a clinical pharmacist about the selection and dosage of drugs ", "et": "* omab kliinilisele apteekrile vajalikke teadmisi ravimite valiku ja doseerimise kohta "}, {"en": "* has knowledge of how to advise doctors, nurses and patients on the pharmacotherapy of the diseases covered in the subject.", "et": "* omab teadmisi, kuidas nõustada arste, õdesid ja patsiente aines käsitletavate haiguste farmakoteraapias."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}