{"uuid": "e9ac5177-68e8-02d0-3329-f657a5ebf2a6", "code": "MVFA.00.049", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-04T14:33:08", "title": {"en": "Clinical Pharmacy in Practice - Introduction", "et": "Sissejuhatus kliinilisse farmaatsiasse"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Using practical examples, the subject provides an overview of what a clinical pharmacist does and what the clinical pharmacist's unique role is in the multidiciplinary team, how the clinical pharmacist works and what aids he uses in his work. In the forum of the course, the students bring out a situation from their daily practice where clinical pharmacy knowledge has had to be applied and what additional knowledge would have been needed to solve the situation successfully. Based on practical examples, the subject provides an overview of how the clinical pharmacist can contribute to the optimization of treatment regimens by using and applying knowledge of pharmacokinetics and pharmacodynamics. As homework, students solve a clinical case on optimizing a patient's treatment plan. Based on practical examples, the subject provides an overview of how the clinical pharmacist can contribute to the optimization of treatment regimens for patients with renal dysfunction. In the webinars, discussion takes place based on situational tasks and clinical cases.", "et": "Õppeaine annab praktiliste näidete varal ülevaate, mida teeb kliiniline proviisor ja mis on kliinilise proviisori unikaalne roll ravimeeskonnas, kuidas kliiniline proviisort öötab ja millisied abivahendeid oma töös kasutab. Õppijad toovad kursuse foorumis välja situatsiooni oma tööelust, kus kliinilise farmaatsia-alaseid teadmisi on tulnud rakendada ja milliseid teadmisi oleks olnud vaja juurde, et olukorda edukalt lahendada.                                                                                    Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline proviisor saab panustada raviskeemide optimeerimisse, kasutades ja rakendades teadminsi farmakokineetikast ning farmakodünaamikast. Õppijad lahendavad kodutööna näidisülesande patsiendi raviskeemi optimeerimise kohta. Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline proviisor saab panustadaneerufunktsiooni häirega patsientide raviskeemide optimeerimisse. Veebiseminarides toimub situatsioonülesannete ja näidishaigusjuhtude  põhjal arutelu."}, "objectives": [{"en": "The aim of the subject is to provide an overview of clinical pharmacy and the role of the clinical pharmacist in the multidisciplinary team and to teach students to systematically solve pharmacotherapy problem situations using medical databases. The goal is to practice finding evidence-based solutions to pharmacotherapy questions in the treatment of the most common diseases and individualizing patient treatment. The subject provides an overview of the principles of pharmacokinetics and pharmacodynamics and provides an introduction to the principles of clinical pharmacokinetics and their application. The subject provides knowledge and skills on how to identify and resolve pharmacokinetic issues in treatment regimens and to determine the effect of diseases and health conditions and other drugs on pharmacokinetics and thus on changes in treatment response. The purpose of the subject is to provide an overview of the most important laboratory analyzes that affect the dosage of drugs or the choice of drugs. In addition, the aim is to introduce the most common kidney diseases, the effect of drugs on kidney function and the optimization of treatment regimens in patients with kidney failure. Aim of the subject is also develop and expant communication skills relevant to efficiently communicate with the patients and medical personnell.", "et": "Õppeaine eesmärk on anda ülevaade kliinilisest farmaatsiast ja kliinilise proviisori rollist ravimeeskonnas. Õpetada tudengeid süstemaatiliselt lahendama farmakoteraapia probleemsituatsioone, kasutades meditsiinilisi andmebaase. Eesmärk on harjutada enimlevinud haiguste ravis esinevate farmakoteraapia-alastele küsimustele tõenduspõhiste lahenduste leidmist ning patsientide ravi individualiseerimist.                                                       Õppeaine annab ülevaate farmakokineetika ja farmakodünaamika põhimõtetest ning annab sissejuhatuse kliinilise farmakokineetika põhimõtetesse ning nende põhimõtete rakendamisse. Õppeaine annab teadmised ja oskused, kuidas tuvastada ja lahedada farmakokineetika-alaseid küsimusi raviskeemides ning teha kindlaks haiguste ja terviseseisundi ning teiste ravimite mõju farmakokineetikale ning seega ravivastuse muutumisele.                                                                                    Õppeaine eesmärk on anda ülevaade olulisematest laborianalüüsidest, mis mõjutavad ravimite annustamist või ravimite valikut. Lisaks on eesmärgiks tutvustada enamlevinud neeruhaigusi, ravimite mõju neerufunktsioonile ning raviskeemide optimeerimist neeruhaigusega patsientidel."}], "learning_outcomes": [{"en": "After passing the course student\nA student who has passed the subject: \n* knows the principles of practicing clinical pharmacy\n* has the necessary knowledge for a clinical pharmacist about the pharmacokinetics and pharmacodynamics of drugs, laboratory medicine, the effect of kidney function on the dosage and selection of drugs\n* notices and analyzes pharmacotherapy issues from the clinical pharmacist point of view          \n* knows the principles of optimizing medicines use\n* can assess  treatment regimens and make suggestions for optimizing treatment regimens \n* knows the risks associated with polypharmacotherapy and knows how to optimize the corresponding treatment regimens  \n* knows the principles of clinical pharmacokinetics and pharmacodynamics \n* knows the general principles of laboratory medicine\n* can interpret the most important laboratory analyzes and make recommendations for changing treatment regimens based on the change in the health status detected by laboratory analyzes\n* understands the effect of medication use on laboratory tests\n* can use the knowledge of pharmacokinetics and pharmacodynamics in optimizing the patient's medication use * knows more frequent kidney diseases, the effect of drugs on kidney function\n* can interpret kidney function analyzes and optimize treatment regimens based on kidney function  \n* has achieved communication skills relevant to the clinical pharmacy service", "et": "Õppeaine läbinud õppija:\nAine läbinud üliõpilane:                                                                                                                         \n* tunneb kliinilise farmaatsia praktiseerimise põhimõtteid \n* omab kliinilise proviisori jaoks vajalikke teadmisi ravimite farmakokineetikast ja farmakodünaamikast, laborimeditsiinist, neerufunktsiooni mõjust ravimite annustamisele ja valikule\n* omab kliinilise proviisori jaoks vajalikke teadmisi ravimite valikust ja annustamisest eakatele ja lastele\n* märkab ja analüüsib farmakoteraapia kitsaskohti kliinilise proviisori vaatepunktist                \n* teab ravimikasutuse optimeerimise põhimõtteid\n* oskab hinnata raviskeemide kitsaskohti ja teha ettepanekuid raviskeemide optimeerimiseks.                                                                                                                                                  * teab kliinilise farmakokineetika ning farmakodünaamika põhimõtteid                                          \n* teab laborimeditsiini üldpõhimõtteid\n* oskab interpreteerida olulisemaid laborianalüüse ja teha soovitusi raviskeemide muutmiseks lähtudes laborianalüüside abil tuvastatud terviseseisundi muutusest\n* mõistab ravimite kasutamise mõju laborianalüüsidele\n* oskab farmakokineetika- ja farmakodünaamika alaseid teadmisi kasutada patsiendi ravimikasutuse optimeerimisel.                                                                                                                       \n* tunneb  sagedasemaid neeruhaigusi, ravimite mõju neerufunktsioonile\n* oskab interpreteerida neerufunktsiooni analüüse ja optimeerida raviskeeme lähtuvalt neerufunktsioonist"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}