{"uuid": "2c5ef88b-8ad9-3205-d014-e0a034114188", "code": "MVFA.00.050", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:59:55", "title": {"en": "Concepts in Research in Clinical Pharmacy", "et": "Uuringud kliinilises farmaatsias"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The subject provides an overview of research works in the field of clinical pharmacy and the methods of their implementation. Completing the subject gives student the opportunity to choose the topic of the master's thesis and the methodology of its implementation.", "et": "Aine annab ülevaate kliinilise farmaatsia valdkonna uurimistöödest ja nende teostamise meetoditest. Aine läbimine annab võimaluse valida magistritöö teema ja selle teostamise metoodika."}, "objectives": [{"en": "The aim is to provide knowledge and skills to plan research work in the field of clinical pharmacy and forms students' readiness to conduct research. Students will gain practical experience by preparing a scientific research paper. Communication skills relevant for research will be discussed and practiced.", "et": "Eesmärk on anda teadmised ja oskused kliinilise farmaatsia valdkonna teadustöö planeerimiseks ning kujundada üliõpilaste valmisolekut teadustöö tegemiseks. Õpilased saavad praktilise kogemuse koostades teadusliku uurimistöö. Arutatakse ja harjutatakse uurimistöö jaoks olulisi suhtlemisoskusi."}], "learning_outcomes": [{"en": "A student who has passed the subject: ", "et": "Õppeaine läbinud üliõpilane: "}, {"en": "* knows various principles and methods of conducting research in the field of clinical pharmacy ", "et": "* tunneb erinevaid kliinilise farmaatsia valdkonna uuringute läbiviimise põhimõtteid ja meetodeid "}, {"en": "* can choose an appropriate research methodology in the field of clinical pharmacy and systematically plan the conduct of a study ", "et": "* oskab valida sobiva kliinilise farmaatsia valdkonna uurimismetoodika ning planeerida süstemaatiliselt uuringu läbiviimist "}, {"en": "* knows the main data collection and analysis methods and uses them accordingly when conducting research ", "et": "* tunneb põhilisi andmekogu ja analüüsimeetodeid ning kasutab neid vastavalt uuringute läbiviimisel "}, {"en": "* can consciously collect data suitable for data analysis", "et": "* oskab teadlikult koguda andmeanalüüsiks sobivaid andmeid"}, {"en": "* applies analysis and generalization skills when conducting research and interprets research results ", "et": "* rakendab uurimistöö tegemisel analüüsi- ja üldistusoskusi ning tõlgendab uurimistulemusi "}, {"en": "* possesses communication and cooperation skills necessary for research ", "et": "* omab uurimistööks vajalikke suhtlemis- ja koostööoskusi "}, {"en": "* can interpret and generalize the results obtained from data analysis", "et": "* oskab tõlgendada ja üldistada andmeanalüüsist saadud tulemusi"}, {"en": "* can formalize the results of the study as a research paper", "et": "* oskab vormistada uuringu tulemused uurimistööna."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}