{"uuid": "60ad050b-7da5-0b40-6e23-2f9e72c59dae", "code": "MVFA.00.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Medicines Down to Earth", "et": "Ravimitest maakeeli"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "We all use medicines - you, me, our families, friends. The availability of medicines is good, their safety, effectiveness and quality is under strict control. At the same time large amounts of information is just beyond a click. Unfortunately not all of that information is true. Therefore, it is important for everyone to have a basic knowledge on medicines to be able to critically analyse this information and thereby protect one's health. And this course aims to give everyone such knowledge.", "et": "Me kõik tarvitame vahel ravimeid - mina, Sina, meie pered, sõbrad, tuttavad. Elame ajas, kus ravimid on kättesaadavad, nende ohutus, efektiivsus ja kvaliteet on kontrollitud. Samal ajal on ka tohutu infohulk meist vaid ühe näpuliigutuse kaugusel, kuid kaugeltki kogu see informatsioon ei ole õige. Seepärast on oluline, et igaühel meist oleksid põhiteadmised ravimite kohta, et oskaksime eristada tõde ja väära ning seeläbi kaitsta enda ja oma lähedaste tervist. Ja just sellist põhiteadmist ravimite kohta püüabki e-kursus \"Ravimitest maakeeli\" Sulle anda."}, "objectives": [{"en": "The objective is to give basic knowledge on medicines.", "et": "Kursuse eesmärgiks on anda põhiteadmisi ravimite alal."}], "learning_outcomes": [{"en": "After the course the student:", "et": "Pärast kursuse läbimist:"}, {"en": "Knows the main periods in the history of medicines.", "et": "Tunned tähtsamaid etappe ravimite kasutamise aja- ja kujunemisloos."}, {"en": "Is aware of the main principles in medicines manufacturing and main dosage forms.", "et": "Omad ettekujutust sellest, kuidas valmivad ravimid ning milliseid ravimvorme on olemas. "}, {"en": "Understands the composition of medicines and also the terms active substance and excipient.", "et": "Mõistad ravimite koostist ning tead, mis on raviaine ja abiaine."}, {"en": "Is aware of how medicines act and knows the different routes of administration.", "et": "Omad ettekujutust sellest, kuidas ravimid toimivad ja kuidas ravimeid manustatakse."}, {"en": "Understands the concept of a pharmacy and the importance of consulting in pharmacy.", "et": "Mõistad apteegi olemust ning oskad apteekrilt ravimialast nõu küsida."}, {"en": "Knows the main principles of medicines consumption.", "et": "Tead ravimite kasutamise üldiseid põhimõtteid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}