{"uuid": "ed211f09-81cf-6060-c107-4c8e03563b38", "code": "MVFA.00.052", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-24T14:27:40", "title": {"en": "Care of the Elderly and Paediatric Medicines Use", "et": "Eakate ja laste farmakoteraapia iseärasused"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVFA", "structural_unit_name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVFA", "name": {"en": "Institute of Pharmacy", "et": "farmaatsia instituut"}, "email": "pharmacy@ut.ee", "phone": "+372 737 5286", "webpage_url": "https://farmaatsia.ut.ee", "address": "Nooruse 1\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Nooruse 1", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Based on practical examples, the subject gives an overview of how the clinical pharmacist can contribute to the optimization of the treatment regimens of elderly and children. As homework, students solve clinical cases about optimizing a patient's treatment regimen. In the webinar, there will be a discussion based on clinical cases.", "et": "Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline apteeker saab kaasa aidata eakate ja laste ravirežiimide optimeerimisele. Kodutööna lahendavad õpilased kliinilisi juhtumeid patsiendi raviskeemi optimeerimise kohta. Veebiseminaril toimub arutelu kliiniliste juhtumite põhjal."}, "objectives": [{"en": "The aim of the subject is to introduce and practice the principles of optimizing treatment regimens for the elderly and children in order to ensure safe and effective treatment for those age groups. The aim is to provide an overview of developmental pharmacology, off-label drug use in pediatrics and related risks, the possibility of finding drug information for children, and suitable dosage forms and extemporaneous drug preparation. In addition, the bottlenecks of pharmacotherapy of pregnant and lactating mothers are also briefly introduced.", "et": "Õppeaine eesmärk on tutvustada ja praktiseerida eakate ja laste ravirežiimide optimeerimise põhimõtteid, et tagada neile vanuserühmadele ohutu ja efektiivne ravi. Eesmärk on anda ülevaade arengufarmakoloogiast, off-label ravimite kasutamisest pediaatrias ja sellega seotud riskidest, laste ravimiinfo leidmise võimalusest ning sobivatest ravimvormidest ja ekstemporaalsest ravimi valmistamisest. Lisaks tutvustatakse põgusalt ka rasedate ja imetavate emade farmakoteraapia kitsaskohti."}], "learning_outcomes": [{"en": "A student who has passed the subject:", "et": "Üliõpilane, kes on aine läbinud:"}, {"en": "* knows the specific issues of medication use in elderly", "et": "* tunneb eakate ravimite kasutamise spetsiifilisi küsimusi"}, {"en": "* can evaluate treatment regimens for the elderly based on the characteristics of the pharmacotherapy ", "et": "* oskab hinnata eakate raviskeeme lähtuvalt farmakoteraapia eripäradest "}, {"en": "* knows the peculiarities of drug use in children", "et": "* tunneb laste uimastitarbimise iseärasusi"}, {"en": "* can identify the bottlenecks in administering medicines to children and recommend dosage forms and ways of administering medicines suitable for the age group", "et": "* oskab tuvastada kitsaskohti lastele ravimite manustamisel ning soovitada vanuserühmale sobivaid ravimvorme ja -viise"}, {"en": "* understands the principles of developmental pharmacology and age-related changes in pharmacotherapy.", "et": "* mõistab arengufarmakoloogia põhimõtteid ja vanusega seotud muutusi farmakoteraapias."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}