{"uuid": "0e2bbe1e-62d5-a72b-ca27-9e49eea8c23b", "code": "MVMV.00.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Doctoral Studies at the Faculty of Medicine", "et": "Sissejuhatus doktoriõpingutesse meditsiiniteaduste valdkonnas"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVMV", "structural_unit_name": {"en": "Dean's Office, Faculty of Medicine", "et": "meditsiiniteaduste valdkonna dekanaat"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVMV", "name": {"en": "Dean's Office, Faculty of Medicine", "et": "meditsiiniteaduste valdkonna dekanaat"}, "email": "med@ut.ee", "phone": "+372 737 5326", "webpage_url": "https://meditsiiniteadused.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course begins with the information day organized by the Centre for Doctoral Studies. The following lectures and seminars introduce the aims and organization of doctoral studies at the University of Tartu, planning one's studies, with the regulations related the position of junior researcher, annual progress review, types of theses (article thesis and monograph), sources and databases, reference management tools.", "et": "Õppeaine algab doktoriõppe keskuse korraldatava infopäevaga. Järgnevate loengute ja seminaride käigus tutvutakse doktoriõpingute korralduse ja eesmärkidega TÜs, doktoriõpingute planeerimisega, nooremteaduri positsiooniga kaasnevate regulatsioonidega, atesteerimisega, väitekirjade liikide (artikliväitekiri ja monograafia), andmeallikate ja -baasidega, viitehaldussüsteemidega."}, "objectives": [{"en": "The aim of the course is to provide first-year PhD students an overview of the goals and organization of doctoral studies at the University of Tartu, planning their studies, annual progress review, types of theses (article thesis and monograph), sources and databases, reference management tools, to help them set goals and make informed choices about their studies and research.", "et": "Aine eesmärk on anda esimese aasta doktorantidele ülevaade doktoriõpingute korraldusest ja eesmärkidest Tartu Ülikoolis, doktoriõpingute planeerimisest, atesteerimisest, doktoritöö liikidest, andmeallikatest ja -baasidest, viitehaldussüsteemidest ja aidata neil teha informeeritud valikuid oma õpingute ja teadustööga seotud küsimustes."}], "learning_outcomes": [{"en": "After completing the course, PhD students", "et": "Kursuse läbinud doktorant:"}, {"en": "-understand documents regulating doctoral studies and the good practice of doctoral studies and research", "et": "- mõistab doktoriõpet reguleerivaid õigusakte ning doktoriõppe ja teaduse hea tava põhimõtteid"}, {"en": "-can purposefully plan their doctoral studies and subsequent (academic) careers and set achievable aims", "et": "- oskab doktoriõpinguid ja järgnevat (teadlas)karjääri sihipäraselt planeerida ja teostatavaid eesmärke seada"}, {"en": "-systematically use research databases and reference management tools in their research", "et": "- rakendab oma töös sihipäraselt teadustööd koondavaid ja reguleerivaid andmebaase ning viitehaldusprogramme"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}