{"uuid": "06fd5e99-6d64-4c3d-02e9-a8f38dea6c74", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-12T17:36:38", "title": {"en": "Introduction to Global Health", "et": "Globaalse tervise alused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT", "name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "email": "dph@ut.ee", "phone": "+372 737 4190", "webpage_url": "https://tervis.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "label": {"en": "24/25 S regular MV Eng", "et": "24/25 K PÕ MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "MVPT", "structural_unit_name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Global Health is a discipline that places a priority on improving health and achieving equity in health for all people worldwide. \nThis new Global Health course is a collaboration project between the Masaryk University in Brno, Czechia and the University of Tartu, Estonia. \nThis elective course aims to share knowledge, train analytical thinking skills, and spark exciting discussions among learners about the vast array of topics related to global health. Innovation and collaboration are keywords used to describe this course as student cohorts in Masaryk and Tartu university will be studying together being connected in class via a video stream. The teachers and tutors for this course are from both universities with additional expert guest speakers being invited for specific seminars of this course. \nStudents from Czechia and Estonia participating in this Global Health course are guided to collaborate closely with each other throughout the duration of the course. They will also be working in mixed groups for planning and writing their final course assignment- a global health project.", "et": "Globaalne tervis on teadusala, mis tegeleb tervise edendamisega ning võrdõiguslikkuse tagamisega tervishoius ülemaailmsel tasandil. \nSee uus globaalse tervise kursus on koostöö projekt Brno Masaryki ülikooli ning Tartu Ülikooli vahel.\nAntud valikkursuse eesmärkideks on jagada teadmisi, treenida tudengite analüütilist mõtlemist ning kutsuda esile huvitaid arutelusid erinevatel globaalse tervisega seonduvatel teemadel. Innovatsioon ja koostöö on olulised märksõnad, et kirjeldada seda kursust, kus Masaryki ja Tartu tudengid õpivad samal ajal koos, olles ühendatud videokõne kaudu üksteisega. Selle kursuse õppejõud on samuti mõlemast ülikoolist, lisaks on kavas kutsuda  külalisõppejõude eri teemadel vestlema.\nTšehhi ja Eesti tudengid saavad sel kursusel koos õppida ning koos ka kursuse lõputööd, globaalse tervise projekti, koostada."}, "objectives": [{"en": "1. To equip learners from the field of health and related disciplines with knowledge about the key concepts of global health.", "et": "1. Tutvustada globaalse tervise alustalasid ning põhiprintsiipe tervishoiu ja seotud erialade tudengitele."}, {"en": "2. To introduce key project design concepts for developing interventions aimed at strengthening health systems.", "et": "2. Tutvustada globaalse tervise projekti kavandamise etappe eesmärgiga tugevdada tervishoiu süsteeme. "}, {"en": "3. To compare the burden of disease and inequities in health in relation to social and environmental determinants of health.", "et": "3. Võrrelda globaalset haiguskoormust ning ebavõrdsust tervishoius läbi ühiskondlike ja keskkondlike tervisemõjurite."}], "learning_outcomes": [{"en": "1. Learners have knowledge to describe the history, values, and functions of global health.", "et": "1. Tudengid oskavad kirjeldada globaalse tervise ajalugu, põhiprintsiipe ja eesmärke."}, {"en": "2. Learners have obtained practical skills and knowledge to apply in health project planning and management.  ", "et": "2. Tudengid on omandanud praktilised oskused ja teadmised, et kavandada ja läbi viia tervise projekte."}, {"en": "3. Learners can analyse health systems and policies from an equity and human rights' viewpoint.", "et": "3. Tudengid suudavad analüüsida eri riikide tervishoiu süsteeme lähtudes võrdsuse ja inimõiguste printsiipidest."}, {"en": "4. Learners can explain how social, economic, environmental, and cultural determinants contribute to population and individual health.", "et": "4. Tudengid suudavad selgitada, kuidas ühiskond, majandus, keskkond ja kultuuriruum mõjutavad üksikindiviidi ja kogukonna tervist."}], "notes": {}}, "grading": {"independent_work": {"et": "The independent work for this course consists of getting acquainted with the compulsory and recommended study materials and completing multiple choice tests on Moodle before each seminar in Tartu."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Moodle tests: 1 point for passing an online test after each seminar, maximum 10 points if all tests are completed (minimum to pass: 7 points)."}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "Final group assignment: maximum 10 points for the final group work (minimum to pass: 7 points).\n-\tLearners must submit a health project plan and a presentation done as group work by the exact deadline communicated by the course instructors. \n-\tThe project plan and presentation must include the requirements set by the course instructors.\n-\tThe project plan and presentation must reflect the students' gained knowledge throughout the global health course and depict their skills in analytical thinking and problem solving for health improvement and impact.\n\nA detailed explanation of the final assessment requirements will be provided in the seminar \"Project design for strengthening health systems.\""}}], "min_points_from_tests": 14, "grade_preconditions": {"et": "- The student has attended at least 7 out of 10 in-class seminars in Tartu before the final group work presentation seminars (week 37, 38)\n- The student has completed at least 7 out of 10 tests on Moodle."}, "grade_evaluation": {"et": "The course assessment comprises of 3 parts:\n-\tAttendance: 1 point for each in-class attended seminar in Tartu, maximum 10 points if all thematic seminars are attended (minimum to pass: 7 points)\n-\tMoodle tests: 1 point for passing an online test after each seminar, maximum 10 points if all tests are completed (minimum to pass: 7 points)\n-\tFinal group assignment: maximum 10 points for the final group work (minimum to pass: 7 points)\n\nIn order to \"Pass\" this course, the following criteria must be met:\n\n-\tLearners must receive at least 7 points for each of the 3 assessment parts in order to pass the course (21 points or more)."}, "debt_elimination": {"et": "Overdue submission of the final assessment is possible upon written justification. Exceptions are managed on individual basis based on a written communication between the student and course instructor.  Upon mutual agreement based on a situation analysis, there is a possibility to extend the submission timelines for the project plan."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "7359de21-3373-41bb-96f0-94c15c463127", "type": "MOODLE", "code": "MVPT.04.005_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "1. Kruk, M. E., Gage, A. D., Arsenault, C., Jordan, K., Leslie, H. H., Roder-DeWan, S., ... & Pate, M. (2018). High-quality health systems in the Sustainable Development Goals era: time for a revolution. The Lancet global health, 6(11), e1196-e1252.\n2. Marmot, M., & Bell, R. (2012). Fair society, healthy lives. Public health, 126, S4-S10.\n3. Delevic, M. (2011). Guide to the logical framework approach. This brochure covers the project planning activities discussed during the seminar and provides additional information to support successful project preparation and finalization.\n4. World Health Organization (2020). Global spending on health 2020: weathering the storm. World Health Organization.", "recommended_materials": "1. World Health Organization. (2021). Global monitoring report on financial protection in health 2021.\n2. Abubakar, I., Aldridge, R. W., Devakumar, D., Orcutt, M., Burns, R., Barreto, M. L., ... & Zhou, S. (2018). The UCL-Lancet Commission on Migration and Health: the health of a world on the move. The Lancet, 392(10164), 2606-2654.\n3. Läderach, P., Ramirez-Villegas, J., Caroli, G., Sadoff, C., & Pacillo, G. (2021). Climate finance and peace-tackling the climate and humanitarian crisis. The Lancet Planetary Health, 5(12), e856-e858.\n4. Ibrahim, H., Liu, X., Zariffa, N., Morris, A. D., & Denniston, A. K. (2021). Health data poverty: an assailable barrier to equitable digital health care. The Lancet Digital Health.\n5. European Commission. 2017 RARE DISEASES - A major unmet medical need. Link: https://op.europa.eu/s/vgvT"}, "participants": {"lecturers": [{"person_uuid": "7de1959a-0dc1-a4a0-07f9-cfa01c9a6229", "person_name": "Mikk Jürisson", "structural_unit": {"code": "MVPT04", "name": {"en": "Department of Public Health", "et": "rahvatervishoiu õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": false}, {"person_uuid": "928f575a-0e1c-8b47-7641-c90305880acb", "person_name": "Ave Põld", "structural_unit": {"code": "MVPT04", "name": {"en": "Department of Public Health", "et": "rahvatervishoiu õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "26-37 õn"}, "entries": [{"course_week": 1, "time": "2025-02-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "1.\tIntroduction to Global Health"}, "description": {"et": "We will be focusing in this very first seminar of the Global Health course on the origins of what we call \"global health\". \nYou will hear about the fascinating history of global health, train your skills in lateral thinking about health, investigate key concepts and do some interactive activities in class.\n"}}, {"course_week": 2, "time": "2025-03-05", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 2, "topic": {"et": "2.\tProject Design for Strengthening Health Systems"}, "description": {"et": "This seminar focuses on providing students essential knowledge about system thinking in health. In addition to training critical and comprehensive thinking skills also various analysis and project planning tools will be presented and explained to the learners. Knowledge and foundational skills of the project planning modalities presented in this seminar are essential for the successful completion of the final assessment for the Global Health course. This entails writing a health project utilising the tools and techniques explained in this seminar.\n..."}}, {"course_week": 3, "time": "2025-03-12", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 3, "topic": {"et": "3.\tHealthcare Financing"}, "description": {"et": "This seminar talks about a very important area related to access to health and the provision of health services- money.\nIn order to achieve Universal Health Coverage, countries must ensure that their health financing systems are established in a manner that ensures equitable and fair access to health services to all members of society.\n..."}}, {"course_week": 4, "time": "2025-03-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "4.\tGlobal immunization "}, "description": {"et": "This seminar explores the critical challenges and strategies in global vaccination, focusing on overcoming vaccine hesitancy and ensuring equitable vaccine distribution across diverse populations. We will discuss innovative approaches to build public trust, improve accessibility, and enhance global health outcomes."}}, {"course_week": 5, "time": "2025-03-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"et": "5.\tColonialism and neocolonialism: key concepts"}, "description": {"et": "Colonialism has impacted the world in multiple ways including across the field of health and education. In this seminar we will be looking into the historical background of global health with a special focus on colonialism. We will be explaining through real-life examples the colonial continuities that can be witnessed across global health today, the origins and processes of neocolonialism. "}}, {"course_week": 6, "time": "2025-04-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {"et": "6.\tRefugee health"}, "description": {"et": "This seminar addresses the unique health challenges faced by refugees, emphasizing access to healthcare, mental health support, and disease prevention in displaced populations. We will discuss healthcare systems and policies to improve health equity and outcomes for refugees."}}, {"course_week": 7, "time": "2025-04-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"et": "7. Student session: humanitarian projects "}, "description": {"et": "Special session where students talk about their experiences attending voluntary work in global health and other fields."}}, {"course_week": 8, "time": "2025-04-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 8, "topic": {"et": "8.\tPandemic preparedness and IHR"}, "description": {"et": "This seminar will introduce to students key aspects of pandemic preparedness, highlighting the importance of strengthening global health systems and adhering to the International Health Regulations (IHR) to prevent and manage future outbreaks. "}}, {"course_week": 9, "time": "2025-04-23", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 9, "topic": {"et": "9.\tDigital Health and telemedicine in low-resourced settings"}, "description": {"et": "This seminar examines the transformative potential of digital health and telemedicine in improving healthcare access and outcomes in low-resource settings. We will discuss strategies to address challenges such as infrastructure limitations, workforce shortages, and health inequities."}}, {"course_week": 10, "time": "2025-04-30", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 10, "topic": {"et": "10.\tGlobal Surgery    "}, "description": {"et": "This seminar talks about the critical role of global surgery in addressing the unmet surgical needs of low- and middle-income countries, where access to safe, timely, and affordable surgical care remains a challenge. We will explore capacity building and policy interventions to improve surgical outcomes and reduce health disparities."}}, {"course_week": 11, "time": "2025-05-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 11, "topic": {"et": "11.\tProject presentation seminar I"}, "description": {"et": "In this seminar learners will be presenting their course final assignment done as group work- global health projects.\n..."}}, {"course_week": 12, "time": "2025-05-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 12, "topic": {"et": "12.\tProject presentation seminar II"}, "description": {"et": "In this seminar learners will be presenting their course final assignment done as group work- global health projects.\n..."}}]}, "registration_info": {"audience": {"et": "For students from national and international programs studying health or health-related disciplines (i.e., public health, medicine, pharmacy, dentistry, nursing, etc.)."}, "min_students": 25, "max_students": 36}, "parent_uuid": "99b569f5-b1f1-ffd5-9a65-e1589cfeb165", "parent_code": "MVPT.04.005", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}