{"uuid": "c73dba56-259f-3068-c57c-dc850fc09e46", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-04T09:51:06", "title": {"en": "Philosophical Issues in Nursing Science", "et": "Õendusteaduse filosoofilised aspektid"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "24/25 A block mode MV", "et": "24/25 S SÕ MV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Core concepts and fundamental issues of philosophy and ethics. Different conceptions of science. The position of nursing science in the classification of sciences. The impact of different philosophical approaches on the development of nursing science. Objectives of nursing science and nursing science research, and relations between nursing science and nursing practice.", "et": "Filosoofia ning eetika põhimõisted ja -probleemid. Erinevad teaduse käsitused. Õendusteaduse asukoht teaduste klassifikatsioonis. Erinevate filosoofiliste suundade mõju õendusteaduse arengule. Õendusteaduse ja õendusteadusliku uurimistöö eesmärgid ning õendusteaduse ja -praktika seosed."}, "objectives": [{"en": "To deepen the knowledge of nursing science and its philosophical and ethical fundamentals. To deepen the knowledge of the objectives of nursing science research, principal issues and trends of nursing science. To develop an understanding of the impact of philosophical viewpoints on the development of nursing science knowledge, nursing practice, nursing management, nursing education and research.", "et": "Süvendada teadmisi õendusteadusest ning selle filosoofilistest ja eetilistest alustest. Süvendada teadmisi õendusteadusliku uurimistöö eesmärkidest, õendusteaduse põhiprobleemidest ja arengusuundadest. Kujundada arusaam filosoofiliste seisukohtade mõjust õendusteadusliku teabe arengule, õenduspraktikale, -juhtimisele, -haridusele ja uurimistööle."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- understands the philosophical and ethical issues of nursing science and knows the relevant core concepts;", "et": "- mõistab filosoofilisi ning eetilisi probleeme õendusteaduses ning teab asjakohaseid põhimõisteid;"}, {"en": "- is able to explain the impact of different philosophical approaches on the development of nursing science and evidence-based practice;", "et": "- oskab selgitada erinevate filosoofiliste suundade mõju õendusteaduse ja tõenduspõhise praktika arengule;"}, {"en": "- knows and understands the objectives and trends of nursing science and nursing science research.", "et": "- teab ja mõistab õendusteaduse ja õendusteadusliku uurimistöö eesmärke ning arengusuundi."}], "notes": {"et": "Õppejõul on õigus vajadusel teha teemade käsitlemise järjekorras muudatusi, teavitades sellest eelnevalt õppijaid.\n\nKirjalike tööde puhul ei ole lubatud kasutada tekstirobotit (nt. ChatGPT). Tekstiroboti loodud teksti esitamine enda nime all on akadeemiline\npetturlus.\n\nVastutava õppejõu meiliaadress: \nmerle.seera-erstu@ut.ee"}}, "grading": {"independent_work": {"et": "1. Iseseisev töö  koos kaasüliõpilasega Moodle'is\n2. Kaasüliõpilaste ühe töö tagasisidestamine koos kaasüliõpilasega Moodle'is \n3. Uurimistöö päeva eelne iseseisev materjalide lugemine ja lühikirjelduse koostamine\n4. Seminaride eelne iseseisev materjalide lugemine (õendusteadusliku uurimistöö suunad)\n5. Iseseisev grupitöö, epistemoloogiliste ja ontoloogiliste küsimuste analüüs magistritöö põhjal\n6. Ühe grupitöö tagasisidestamine Moodle'is \n7. Seminaride eelne iseseisev materjalide lugemine (eetilised dilemmad õendusjuhtimises, -pedagoogikas, -praktikas ja -uurimistöös)\n8. Iseseisev individuaalne töö, potentsiaalse uurimisteema tutvustamine ja uurimisprobleemi väljaselgitamine\n9. Kaasüliõpilaste iseseisvate töödega tutvumine ja aruteluks ettevalmistumine\n\nIseseisvate tööde juhendid, esitamistähtajad ning tööde mahud on leitavad Moodle'i keskkonnast."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Õendusteaduse ja selle põhimõistete defineerimine ning nende seostamine üliõpilase igapäevapraktiga.  \nDefineerida järgmised mõisted: õendus, õendusteadus, õendusfilosoofia, õendusteadusfilosoofia, eetika, dilemma, paradigma\nKõik mõisted on defineeritud maksimaalselt nelja lausega ning kasutatud iga mõiste defineerimiseks vähemalt kahte erinevat tõenduspõhist allikat. Seejärel arutlege, kuidas teie hinnangul on omavahel seotud õendus, ja õendusteadus, samuti tooge näide ühe defineeritud mõiste esinemise kohta Teie igapäevatöö kontekstis (arutlus kokku maksimaalselt 10-12 lauset). Töö koostatakse kahe üliõpilase paaristööna. Mitteeristav hindamine. \n\nDefinitsioonideks kasutatud allikatele viidatakse korrektselt mõiste juures ning lisatakse töö lõppu kasutatud kirjanduse loetellu.  Iseseisva töö koostamiseks leiate tuge kaustast \"Soovituslikud materjalid\" kuid lisaks neile võite juurde otsida ka omaltpoolt tõenduspõhised allikaid."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Moodle'is valida kaasüliõpilaste tööde hulgast üks töö ning võrrelge mõistete definitsioone enda koostatud definitsioonidega, kui leiate, et saate mõnda definitsiooni täiendada või saite ise mõnest definitsioonist enda tööle täiendust, lisage see kommentaaridesse. Samuti andke tagasisidet kaasüliõpilaste arutelupunktile (milline on seos õenduse ja õendusteaduse ning toodud näidete kohta). Tagasiside pikkus ühele mõistele ja arutelule maksimaalselt viis lauset.  Kõik üliõpilased peavad saama tagasisidet. Mitteeristav hindamine."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Uurimistöö päeva eelne iseseisev materjalide lugemine ja kirjaliku 7-10 lauselise lühikokkuvõtte koostamine UNESCO juhendi \"Guidance for generative AI in education and research\" peatükki 2 \"Controversies around generative AI and their implications for education\" lk 14-17 ja peatükki 6  \"GenAI and the future of education and research\" lk 36-38 põhjal. Koostada \"Telegramm\" sõbrale \"Eetilised väljakutsed AI kasutamisel hariduses ja teadustöös.\" Kirjutis koosneb 6-9 lauselisest kokkuvõttest, mis kirjeldab Sinu arusaama eetilistest väljakutsetest AI kasutamisel hariduses ja uurimistöös. Esita vähemalt kaks olulist aspekti, mida tahaksid sõbrale selgitada. Võta kirjutis uurimistöö päevale kaasa ning uurimistöö päeval lühike ettekanne grupikaaslastele. Mitteeristav hindamine."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Seminarieelne iseseisev materjalide lugemine ning valmistumine loetu põhjal seminaris tehtavaks grupitööks (õendusteadusliku uurimistöö eesmärgid ja arengusuunad).  Grupitöö käigus arutletakse õendusteadusliku uurimistöö eesmärkide ja hetkel õenduses ning õendusteaduslikus uurimistöös valitsevate arengusuundade üle. \nSeminari grupitööd tehakse \"kohviku meetodil\" ning grupitöö liikmed vahetavad 30 minuti järel kohviku lauda ning vestluskaaslasi. Igas lauas arutatakse, kuidas toetab õendusteaduslik uurimistöö tõenduspõhise õendusabi osutamist ning mis on rahvusvahelisel ning Eesti tasandil peamised õendusteadusliku uurimistöö suunad. Lubatud on kohvikus kasutada kodus loetud materjale. Arutelust tehakse kirjalik kokkuvõte.\nGrupitöö lõppeb 30 minutise kõigi üliõpilaste ühise aruteluga. Hinnatakse arutelus osalemise aktiivsust ning õppejõud juhib ning vajadusel küsib lisaküsimusi üliõpilastelt arutelu käigus. Mitteeristav hindamine"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kolmeliikmelise rühma grupitöö. Defineeritud on mõisted: a) epistemoloogia  ja b) ontoloogia.  Kirjeldatud on: a) millised on epistemoloogilised küsimused? b) millised on ontoloogilised küsimused?\nValitud on üks Moodle'i keskkonnas ette antud teadusartikkel ning analüüsitud: a) kuidas ja milliseid epistemoloogilisi ja ontoloogilisi aspekte on artiklis käsitletud; b) millised epistemoloogilised ja ontoloogilised küsimused artiklit lugedes tekkisid? c) miks on uurimistööd koostades vaja teada ja käsitleda ontoloogiliste ja epistemoloogiliste aspekte?\nHindamiskriteeriumid:\n- töös kajastub grupitöö liikmete seisukohtade võrdlust, kriitilist hindamist ja analüüsi, \n- töö pikkus 6-7 lk (ilma kasutatud kirjanduse loeteluta),\n- töö on struktureeritud vastavalt käsitletavatele teemadele,\n- töö vastab kirjalike tööde vormistamise juhendile,\n- töös kasutatud materjalidele on viidatud ning esitatud kasutatud kirjanduse loetelus,\n- töö on esitatud õigeaegselt.\nMitteeristav hindamine."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Iga grupp tagasisidestab ühe grupi koostatud kodutööd kuni 15 lauselise siutiheda konstruktiivse kokkuvõttega. Tuuakse välja töödes esinevaid sarnasused, erinevused ning grupitöö käigus tekkinud ideid. Tagasiside on analüütiline grupitöö tulemusena koostatud vastus. \n Mitteeristav hindamine. "}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Seminarieelne iseseisev materjalide lugemine ja seminaris tehtavaks grupitööks ettevalmistamine. Moodustatakse neli gruppi ja iga grupp saab arutlemiseks ühe teema. Teemadeks on dilemmad õendusjuhtimises, -pedagoogikas, -praktikas ja -uurimistöös ning tuginedes kodus loetud materjalidele koostatakse käsitletava teema kohta poster. Postril esitatakse milliseid dilemmasid grupp arutas ning grupitöö lõpus esitletakse kaasüliõpilastele 10 minutine ettekanne arutelust, millele järgneb 5 minutine ühine arutelu. Õppejõud juhib ühiarutelu ning küsib vajadusel ettekandjatelt lisaküsimusi. Hinnatakse aktiivset osalust arutelus ja teema valdamist. Mitteeristav hindamine."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kirjalik arutlus teemal, millist uut teadmist oleks  Sinu hinnangul eriala arenguks vaja. Arutluses on käsitletud:\n- lühidalt probleemi olemust ning millist teadmist oleks probleemi lahendamiseks Sinu hinnangul vaja,\n- kasutatud on kolme teemat kajastavat teadusartiklit ning kajastatud, mida nähtuse kohta teada saadi,\n- kirjeldatud, kuidas andmeid loetud artiklis koguti,\n- milliste uuristöö eetiliste aspektidega võib uurimistöö käigus kokku puutuda,\n- kas antud teema uurimine haakub riikliku ja rahvusvahelise õenduse uurimissuundadega ning õendusteaduse õppetool uurimisstrateegiaga\n- millised küsimused uurijal tekkisid tööd tehes?\nHindamiskriteeriumid:\nTöös on arutletud kõigi etteantud punktide üle, arutelu on loogiline ning kajastab kursuselt saadud teadmisi.\nTöö pikkus 2-3 lk.\nTöö vastab kirjalike tööde vormistamise juhendile.\nTöös kasutatud materjalidele on viidatud ja kajastatud kasutatud kirjanduse loetelu.\nTöö on esitatud õigeaegselt."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Seminarieelne 5 kaasüliõpilase iseseisva töö lugemine, kirjalikult küsimuste ja kommentaaride koostamine loetud töödele ja valmistumine seminaris vabas vormis aruteluks. Ühist arutelu suunab õppejõud ning vajadusel küsib lisaküsimusi ettekandjalt ja kaasüliõpilastelt. Mitteeristav hindamine."}}], "grade_preconditions": {"et": "Kursus lõpphinne on mitteeristav (arvestatud/mittearvestatud), lõpphindamisele saamise eeltingimuseks on loengutes ja seminarides osalemine, grupitööde ja individuaalse töö õigeaegne esitamine ja võlgnevuste puudumine."}, "grade_evaluation": {"et": "Kursus saab arvestatud kui arvestusele pääsemise eeltingimused on täidetud ning esitatud grupitööd ja individuaalne töö vastavad ainekavas kirjeldatud hindamiskriteeriumitele."}, "debt_elimination": {"et": "* Kui hindamisele pääsemise tingimused on õppeaine lõpuks täitmata, siis võlgnevuste likvideerimiseks tuleb kontakteeruda õppejõuga ning vajadusel koostada võlgnevuse likvideerimiseks individuaalne iseseisev töö. Võlgnevuste likvideerimine peab toimuma nädala jooksul peale töö esitamise kuupäeva, kui õppejõud ei ole otsustanud teisiti.\n* Kui sooritatud grupitöö ja/või individuaalne töö ei vasta ainekavas kirjeldatud hindamiskriteeriumitele, on üliõpilas(t)el õigus oma tööd õppejõu poolt määratud aja jooksul üks kord täiendada."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "bdb5ccc9-17ec-47a8-85f2-5b20831c4c4f", "type": "MOODLE", "code": "MVPT.02.005_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Loengumaterjalid, leitavad Moodle´ist."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Hopia, H., Heikkilä, J. (2020). Nursing research priorities based on CINAHL database: A scoping review. Nursing Open. 2020;7:483–494"}, "type": {"code": "reference", "et": "Viide", "en": "Reference"}, "required": true}, {"name": {"et": "Munro, C.l., Hope, A.A. (2023) Current Trends in Critical Care Nursing Research. American Jornal of Critical Care, 32(3): 150-152"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Fitch, M.I., Barton-Burke,M,.  Fong, W., Young, A. (2023) Oncology nursing research a global perspective, Ann Palliat Med, 13(1)112-125"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Fowler, D.M., Davis, J.A. (2013). Ethical issues occurring within nursing education. Nursing Ethics\nNursing Ethics, 20(2):126-41.\n"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Giannetta, N., Villa, G., Pennestrì, F. et al (2021). Ethical Problems and Moral Distress in Primary Care: A\nScoping Review. Int. J. Environ. Res.Public Health, 18, 7565."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Peter, E., (2015). The ethics in qualitative health research: Special considerations. SciElo, 20 (9): 2625-2630."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Aitamaa E., Suhonen R., Puukka P., Leino-Kilpi H. (2019). Ethical problems in nursing management - a cross-sectional survey about solving problems. BMC Health Serv Res,24;19(1):417."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Soovituslikud õppematerjalid on iseseisvate tööde koostamiseks ja lisalugemiseks kättesaadavad Moodle´ist. "}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "0380423f-5fde-fc4d-d61d-5d52fffea9cb", "person_name": "Merle Seera-Erstu", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "833d5519-ea11-6cf6-7e37-67fceea9a903", "person_name": "Helle Peterson", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "9eaefff5-7b24-e4e6-f395-fd5bbaf6417e", "person_name": "Gerli Mõts", "structural_unit": {"code": "MVPT", "name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "email": "dph@ut.ee", "phone": "+372 737 4190", "webpage_url": "https://tervis.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-22. õppenädal, toimub tsüklitena. Vt õppesessioonide nädalaid ja tunniplaani ka www.tervis.ut.ee"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatus ainesse, õpieesmärgid ja-tegevused, iseseisvad tööd, tööde vormistamise nõuded, tööde ja kursuse hindamise põhimõtted ja vahendid (1)\nTeadus ja teaduslik mõtlemine, filosoofia ja teadusfilosoofia, teadusfilosoofilised valikud õendusteaduses (2)\nFilosoofilised ja eetilised küsimused teaduses ja õendusteaduses, teadusfilosoofilised valikud õenduses (3)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Teadeadustöö loogika ja protsess. Kaitstud magistritöödega tutvumine, teemade valimise  ja magistritöö koostamine põhimõtted (2)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimistöö päev (katab 6 seminari aines)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Epistemoloogia ja ontoloogia olemus ja küsimused (2) - Gerli Mõts"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Epistemoloogia ja ontoloogia olemus ja küsimused (2) - Gerli Mõts"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimisstrateegiad ja nende valimine õendusteaduses (4)"}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Eetilised dilemmad õendusjuhtimises, -pedagoogikas, -praktikas ja -uurimistöös (4) - Gerli Mõts"}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Arutelud iseseisvate tööde põhjal: potentsiaalsete uurimistöö teemad. Magistritöö teema valimine ja edasised arengud. Kursuse lõpetamine (5) Helle Peterson, (1) Merle Seera"}}]}, "registration_info": {"audience": {"et": "Õendusteaduse magistriõppe 1. aasta üliõpilased"}, "min_students": 10, "max_students": 21}, "parent_uuid": "1cddcf04-2553-6a03-7701-ae71a512cce8", "parent_code": "MVPT.02.005", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}