{"uuid": "6dbff9ba-6ce2-d4a4-324a-2e866b876675", "code": "MVPT.02.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Professional Practical Training", "et": "Erialapraktika"}, "credits": 8, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Familiarisation visits to an educational institution: a health care college as a social institution, workplace, learning environment. Performance of learning and teaching under the supervision of a supervisor and independently. Familiarisation visits to a health care institution. Observation and analysis of the activities of a nurse manager. Fulfilment of the duties of a nurse manager both with the help of a supervisor and independently, and evaluation of the activities. Work shadowing day with a social worker. If possible, participation in the development activities of the health care and/or educational institution. Reflection of one's own professional development.", "et": "Tutvumine õppeasutusega: tervishoiukõrgkool kui sotsiaalne institutsioon, töökoht, õpikeskkond. Õppetöö teostamine ja hindamine juhendaja järelevalve all ja iseseisvalt. Tutvumine tervishoiuasutusega. Õendusjuhi tegevuse vaatlemine ja analüüs. Õendusjuhi tööülesannete täitmine juhendaja abiga ja iseseisvalt ning tegevuse hindamine. Töövarjupäev sotsiaaltöötajaga. Võimaluse korral osalemine tervishoiu- ja/või haridusasutuse arendustegevuses. Erialase arengu refleksioon."}, "objectives": [{"en": "To develop readiness to plan, implement and evaluate the learning process; to give readiness to organise and develop evidence-based nursing care.", "et": "Kujundada valmidus planeerida, ellu viia ja hinnata õppeprotsessi; kujundada valmidus korraldada ja arendada tõenduspõhist õendusabi."}], "learning_outcomes": [{"en": "The student who has passed specialised practice:", "et": "Erialapraktika läbinud üliõpilane:"}, {"en": "- is able to analyse and evaluate the duties of nurse teachers in the systems of health care and education, and put forward proposals for supporting their professional growth; ", "et": "- oskab analüüsida ja hinnata õendusõppejõudude ülesandeid tervishoiu- ja haridussüsteemis ning teha ettepanekuid nende professionaalse arengu toetamiseks; "}, {"en": "- is able to plan, perform and evaluate pedagogical activities at higher education institution as well as in hospital;", "et": "- oskab planeerida, teostada ja hinnata pedagoogilist tegevust nii kõrgkoolis kui ka haiglas;"}, {"en": "- is able to analyse a health care institution as a work, treatment and care environment on the basis of organisation and management theories; ", "et": "- oskab analüüsida organisatsiooni- ja juhtimisteooriate alusel tervishoiuasutust kui töö-, ravi- ja hoolduskeskkonda; "}, {"en": "- is able to analyse nursing management and the aspects that influence it; ", "et": "- oskab analüüsida õendusjuhtimist ja seda mõjutavaid aspekte; "}, {"en": "- is able to critically evaluate the needs for the organising and developing of nursing care, and put forward proposals for improvement; ", "et": "- oskab kriitiliselt hinnata õendusabi korraldamise ja arendamise vajadusi ning teha parendusettepanekuid; "}, {"en": "- is able to evaluate their own readiness to work as a nurse teacher and as a nurse manager.", "et": "- oskab hinnata oma valmidust töötada nii õendusõppejõu kui ka õendusjuhina."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}