{"uuid": "b1108e33-7395-822a-ff33-0128cdcb5a9b", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-19T10:40:14", "title": {"en": "Patient-centredness and Clinical Health Promotion", "et": "Patsiendikesksus ja kliiniline tervisedendus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "24/25 A block mode MV Eng", "et": "24/25 S SÕ MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 3, "practice": 0, "seminar": 17, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Quality of health services and patient-centred health care: concepts and principles. Clinical health promotion, health service standards 2 and 3 of health-promoting hospitals: supporting and informing, empowering patients. Collecting and analyzing feedback from health care users and planning development activities for service improvement in co-operation with a team.", "et": "Tervishoiuteenuste kvaliteet ja patsiendikeskne tervishoid: mõisted ja põhimõtted. Kliiniline tervisedendus, tervist edendavate haiglate terviseteenuste standardid 2 ja 3: patsientide toetamine, informeerimine ja sekkumine/võimestamine. Tervishoiuteenuste kasutajatelt tagasiside kogumine ja analüüsimine ning arendustegevuse kavandamine teenuse parendamiseks koostöös meeskonnaga."}, "objectives": [{"en": "To develop an understanding of the principles and efficiency of patient-centred health care, and to develop the skills, including co-operation skills to evaluate health services patient-centredness and design patient-centred services.", "et": "Kujundada arusaam patsiendikeskse tervishoiu põhimõtetest ja tulemuslikkusest ning arendada oskusi, sh koostööoskusi tervishoiuteenuste patsiendikesksuse hindamiseks ja patsiendikesksete teenuste kavandamiseks."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- understands the principles, possibilities, and importance of patient-centred health care and clinical health promotion;", "et": "- mõistab patsiendikeskse tervishoiu ja kliinilise tervisedenduse põhimõtteid, võimalusi ning olulisust;"}, {"en": "- has skills to analyse and critically evaluate health services individually and in cooperation with co-students, following the principles of patient-centredness and clinical health promotion;", "et": "- oskab nii iseseisvalt kui ka koostöös kaasõppijatega analüüsida ja kriitiliselt hinnata tervishoiuteenuseid, lähtudes patsiendikesksuse ja kliinilise tervisedenduse põhimõtetest; "}, {"en": "- is able within a team to design a quality program/development plan for the improvement of health services.", "et": "- oskab meeskonnas töötades planeerida kvaliteediprogrammi/tegevuskava tervishoiuteenuste arendamiseks."}], "notes": {"et": "If a student is absent from the first seminars, a reflection task from Moodle (assignment No. 4) has to be done as a supplementary task. It consists of submitting an essay summarising all case analyses (5) (according to the general assessment criteria).\n\nNB! \n* The course is in English when at least 4 foreign students participate.\n* The forms of learning and teaching can be changed during the course depending on the learning needs of participating students.\n\nLecturers' e-mail:\n- ere.uibu@ut.ee\n- kaja.polluste@ut.ee\n- signe.asi@ut.ee"}}, "grading": {"independent_work": {"et": "Independent work (59 hours):\n- Reading materials and reflecting them in a Moodle - 19 hours\n- Reading case descriptions (Soovituslikud õppematerjalid) and preparing to present and discuss the problems of the case descriptions as a pair or group work - 4 hours;\n- Drawing up a group work and PowerPoint presentation - activity plan for improving services in a particular field of health care - 36 hours\n*****************************************************************\nGuidelines for independent work are accessible in Moodle.\n\n*****************************************************************"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Assignment No. 1\nThe reading task with answering questions about the materials read in the e-learning environment before the first seminars. The assessment follows the system of Fail/Pass. The general assessment criteria for independent work are the following:\n* The paper has been submitted by the fixed deadline;\n* Answers to the questions prepared are based on the materials read;\n* Answers express analytical thinking skills;\n* Language usage in the paper is correct;\n* The sources used are referred to and listed in a correct manner."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Assignment No. 2\nGiving an overview in a seminar of the case read. In a pair or group, initiating a discussion about the problematic issues, expressing opinions, and suggesting solutions in a seminar. The assessment follows the system of Fail/Pass. The general assessment criteria for pair or group work are the following:\n* All group members have made themselves familiar with the materials;\n* A brief overview of the case read is given in a seminar;\n* 3-4 relevant discussion topics are opened up;\n* All group members express their opinions and suggestions, being guided by the principles of patient-centered health care."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Assignment No. 3\nA written paper \"Development plan of a patient-centered service\" prepared as group work in accordance with the guidelines (accessible in Moodle) and its oral presentation in a seminar.  The general assessment criteria of the paper are the following:\n* The paper presents a general description of the healthcare service selected for development, which is explained on a process-by-step basis, a matrix and a flowchart are attached.\n* The process description (including the matrix and flow chart) shows the service bottlenecks based on the principles of healthcare quality, including patient-centeredness.\n* A fishbone diagram has been used to analyze the causes of problem areas in the health care service.\n* The selected quality criteria and objectives are based on the results of the critical analysis and seek to eliminate the bottlenecks and identified problem causes.\n*  In order to achieve the quality goals, it is planned to involve specialists from special fields, cooperate and, if possible, integrate services.\n*  The oral presentation is given by the group in the seminar."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Assignment No. 4 (SUPPLEMENTARY TASK)\nIf a student is absent from the case analysis seminars, a reflection task from Moodle must be done as a supplementary task. It consists of submitting an essay summarizing all case analyses (5) (according to the general assessment criteria). The assessment follows the system of Fail/Pass. The general assessment criteria for independent work are the following:\n* The written paper has been submitted by the fixed deadline (5 working days after the seminar in which the cases were analyzed);\n* All the cases (5) have been briefly described and 5-6 relevant discussion topics have been raised from the cases, these have been analyzed from the bases of the principles of patient-centredness in health care;\n* Language usage in the paper is correct;\n* The sources used are referred to in a correct manner."}}], "grade_preconditions": {"et": "Uploading independent and group work in Moodle on time."}, "grade_evaluation": {"et": "Formation of the final result: the subject will be passed if the student has applied assignment No. 2 or No. 4, assignment No 1. and assignment No. 3."}, "debt_elimination": {"et": "Possible problems which may have an influence on the final result has to be discussed by independent consultation with the responsible lecturer and they must be cleared by the last seminar."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "* Bélanger, L., Bussières, S., Rainville, F., Coulombe, M., Desmartis, M. (2017). Hospital visiting policies - impacts on patients, families and staff: A review of the literature to inform decision making. Journal of Hospital Administration, 6(6): 51-62.\n* Fulford, K. W. M., Ersser, S., Hope, T. (Eds) (1996). Essential practice in patient-centered care. Blackwell Science, Oxford (chapter 8).\n* Jaensch, D., Baker, N., Gordon, S. (2019). Contemporaneous patient and health professional views of patient-centred care: a systematic review. International Journal for Quality in Health Care, 31(10): 165-173.\n* The New Haven Recommendations on partnering with patients, families and citizens to enhance performance and quality in health promoting hospitals and health services (http://www.hph-hc.cc/fileadmin/user_upload/HPH_Declarations/New-Haven-Recommendations.pdf)\n* Declaration on: Patient-Centred Healthcare, © 2006 IAPO\n\n************************************************\n* In addition, tasks and materials referred to and available in the e-learning environment Moodle.\n\n************************************************\nCASE DESCRIPTIONS\n1) Dill, K. & Gance-Cleveland, B. (2005). With you until the end: Family presence during failed resuscitation. Journal for Specialists in Pediatric Nursing (JSPN), 10(4): 204-207.\n2) Fine, R.L. (2010). Keeping the patient at the centre of patient- and family-centred care. Journal of Pain and Symptom Management, 40(4): 621-625.\n3) Lineham, K. (2010). Caring for young people with chronic illness: a case study. Paediatric Nursing, 22(1): 20-23.\n4) Moran, P. (2011). Patient-centred care: Anna's Story. Professional Case Management, 16(5): 256-257.\n5) Van Dell, T. (2011). Patient- and family-centred care in the Neonatal Intensive Care Unit in our own words: One family's story. AACN Advanced Critical Care, 22(4): 298-300.", "recommended_materials": "* Aro, I., Oolo, T. (toim.) (2015). Patsiendikesksus Eesti tervishoius - patsientide ja nende lähedaste vaatekohad. Artikleid õendusteaduslikest uurimistöödest. Tartu Ülikool. http://dspace.ut.ee/bitstream/handle/10062/45219/Artiklikogumik_Patsiendikesksus_30012015.pdf?sequence=1&isAllowed=y\n* Epstein, R. M., Street, R. L. (2011). The Values and Value of Patient-Centered Care. Annals of Family Medicine, 9(2): 100-103.\n* Gerteis, M., Edgman-Levitan, S., Daley, J., Delbanco, T.L. (Eds) (1993). Through the Patient's Eyes: Understanding and Promoting Patient-centered Care. Jossey-Bass Inc, San Francisco (pages 1-15: Introduction).\n* Kitson, A., Marshall, A., Bassett, K., Zeitz, K. (2012). What are the core elements of patient-centered care? A narrative review and synthesis of the literature from health policy, medicine and nursing. Journal of Advanced Nursing, 69(1): 4-15.\n* Quality of care: a process for making strategic choices in health systems. World Health Organization (2006).\n* What is patient-centred healthcare? A review of definitions and principles. International Alliance of Patients' Organizations (IAPO). London, 2007."}, "participants": {"lecturers": [{"person_uuid": "cfc79174-fcf4-9acf-0d82-5cf457796ef4", "person_name": "Signe Asi", "structural_unit": {"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "6b6da9fa-ae35-1068-e592-800020456448", "person_name": "Kaja Põlluste", "structural_unit": {"code": "MVCM13", "name": {"en": "Department of Internal Medicine", "et": "sisekliinik"}, "phone": "+372 731 8607", "webpage_url": "https://kliinilinemeditsiin.ut.ee/et/sisekliinik", "address": "L. Puusepa 8\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 8", "zip": "50406", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVCM"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "2dbffc25-e102-2ba5-0d25-b7105f242a83", "person_name": "Ere Uibu", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1.-22. nädal, toimub tsüklitena. Vt õppesessioonide nädalaid ja tunniplaani ka www.tervis.ut.ee"}, "entries": [{"course_week": 3, "time": "2024-09-16", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"en": "PRELIMINARY WORK: VIDEO LECTURE ON MOODLE - The concept of patient-centeredness and its framework", "et": "EELTÖÖ: VIDEOLOENG MOODLES - Patsiendikesksuse mõiste ja selle taustraamistik"}, "description": {"en": "Content, background and meaning of patient-centeredness, opportunities and obstacles of patient-centered healthcare (1) Ere Uibu\nFamiliarizing oneself with the materials and tools of the Moodle environment", "et": "Patsiendikesksuse sisu, taust ja tähendus, patsiendikeskse tervishoiuteenuse võimalused ja takistused (1) Ere Uibu\nMoodle keskkonna materjalide ning vahenditega tutvumine"}}, {"course_week": 3, "time": "2024-09-16", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 2, "topic": {"en": "PRELIMINARY WORK: VIDEO LECTURE IN MOODLE - Clinical health promotion", "et": "EELTÖÖ: VIDEOLOENG MOODLES - Kliiniline tervisedendus"}, "description": {"en": "Quality management and clinical health promotion (1)\nHealth-promoting hospitals and health services: promotion of human-centred healthcare and patient involvement (1) Kaja Põlluste", "et": "Kvaliteedijuhtimine ja kliiniline tervisedendus (1)\nTervist edendavad haiglad ja terviseteenused: inimkeskse tervishoiu edendamine ja patsientide kaasamine (1) Kaja Põlluste"}}, {"course_week": 3, "time": "2024-09-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"en": "Introduction to the course", "et": "Sissejuhatus ainesse"}, "description": {"en": "Patient-centeredness as a prerequisite for the quality healthcare - reflection and discussion based on the read materials and video lecture (1) Signe Asi", "et": "Patsiendikesksus kui kvaliteetse tervishoiuteenuse eeltingimus - refleksioon ja arutelu loetud materjalide ning videoloengule tuginedes (1) Signe Asi"}}, {"course_week": 3, "time": "2024-09-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"en": "Compliance of human and patient-centeredness of Estonian healthcare institutions with the 3rd substandard of the international standards of HPH (1) Signe Asi", "et": "Eesti tervishoiuasutuste inim- ja patsiendikesksuse vastavus rahvusvahelise TEH 3. alastandardile (1) Signe Asi"}}, {"course_week": 5, "time": "2024-10-01", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"en": "Human-centred healthcare and patient engagement", "et": "Inimkeskne tervishoid ja patsientide kaasamine"}, "description": {"en": "Collecting feedback from health care service users to assess experience and satisfaction (2) Signe Asi", "et": "Tagasiside kogumine tervishoiuteenuse saajatelt kogemuse ja rahulolu hindamiseks (2) Signe Asi"}}, {"course_week": 9, "time": "2024-10-30", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"en": "Patient-centeredness in health care based on case studies", "et": "Patsiendikesksus tervishoius juhtumianalüüsidele tuginedes"}, "description": {"en": "Summaries and discussion of case studies with the planning of initial aims for group work. (4) Ere Uibu", "et": "Juhtumianalüüside kokkuvõtted ja arutelu koos lähteülesannete/-eesmärkide püstitamisega grupitööks. (4) Ere Uibu"}}, {"course_week": 12, "time": "2024-11-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"en": "Input from patient experience to practice", "et": "Patsiendikogemuse teabe praktikasse rakendamine"}, "description": {"en": "Using feedback to evaluate services, analyze activities and plan and implement necessary changes (4) Signe Asi", "et": "Tagasiside kasutamine teenuste hindamiseks, tegevuse analüüsiks ja vajalike muudatuse planeerimiseks ning rakendamiseks (4) Signe Asi"}}, {"course_week": 12, "time": "2024-11-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {"en": "Health care service development through a quality program", "et": "Tervishoiuteenuse arendamine läbi kvaliteediprogrammi"}, "description": {"en": "E-seminars for discussing preliminary versions of coursework in groups (2) Ere Uibu", "et": "E-seminarid kursusetööde eelversioonide arutamiseks rühmades (2) Ere Uibu"}}, {"course_week": 16, "time": "2024-12-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"en": "Programs designed for the development of patient-centered healthcare services - PRESENTATIONS", "et": "Patsiendikesksete tervishoiuteenuste arendamiseks koostatud programmid – ESITLUSED"}, "description": {"en": "Seminars for presenting group work. Course summary and feedback (3) Ere Uibu, Kaja Põlluste", "et": "Grupitööde esitamise seminarid. Ainekursuse kokkuvõte ja tagasiside (3) Ere Uibu, Kaja Põlluste"}}]}, "registration_info": {"audience": {"et": "Nursing master's students starting from the 2nd year onwards and medical students from the 3rd year onwards"}, "min_students": 10, "max_students": 21}, "parent_uuid": "c32a7d7b-d648-bec7-a253-454b039b52b3", "parent_code": "MVPT.02.011", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}