{"uuid": "c9d4c4bb-c708-01aa-61eb-a4fbf9b97f62", "code": "mv-2018-spring-openuniv-p1-c5", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-07T10:01:15", "title": {"en": "Basics of Research Methodology", "et": "Teadustöö metodoloogilised alused"}, "credits": 5, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 5, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "18/19 S block mode part 1 5 CP MV", "et": "18/19 K SÕ 1. osa 5 EAP MV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 13, "practice": 3, "seminar": 23, "colloquium": 0, "web_learning": 0, "independent_work": 91, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Written assignments help the students to apply the principles of scientific research (including academic language usage) when planning their own master's thesis, and to get an understanding of the process, stages and types of research. The discussions carried out in seminars provide the students with an understanding of the principles of choosing research subjects or research material in accordance with the research plan and the principles of ensuring the trustworthiness of research. In practical classes, students practise searching scientific databases for sources of literature. In seminars, critical evaluation of sources of literature on the basis of checklists is also practised as well as producing arguments with regard to their own evaluations. An overview of the literature for the planned master's thesis is prepared individually. Practical written assignments enable the students to practise the planning of a research paper, drawing up a research plan and evaluating it critically, involving peer review. Documents needed to apply for research approvals are prepared.", "et": "Kirjalike ülesannete kaudu õpitakse rakendama teadusliku uurimistöö (sh teaduskeelele) põhimõtteid oma magistritöö planeerimisel ja saavutatakse arusaamine uurimistöö protsessist, etappidest ning uurimistöö tüüpidest. Seminari aruteludes omandatakse arusaam uuritavate või uuritava materjali valiku printsiipidest lähtuvalt uurimisplaanist ning uurimistöö usaldusväärsuse tagamise põhimõtetest. Praktikumides harjutatakse kirjandusallikate otsingut teadusandmebaasides. Harjutatakse kirjandusallikate kriitilist hindamist kontroll-lehtede alusel ja oma hinnangute argumenteerimist seminaris. Individuaalselt koostatakse kirjanduse ülevaade planeeritud magistritöö teemal. Praktiliste kirjalike tööde kaudu harjutatakse uurimistöö planeerimist, uurimiskavandi koostamist ja selle kriitilist hindamist vastastiktagasiside kaudu. Valmistatakse ette dokumendid uurimistöö kooskõlastuste taotlemiseks."}, "objectives": [{"en": "To deepen the knowledge of the principles, requirements, and stages of scientific research, and the main types of research in nursing science. Through practical written tasks to develop the skills to search for scientific literature, to evaluate literature critically and to use it for one's own research; to plan and draw up a research plan and evaluate it critically. To deepen the students' knowledge and develop a practical skill of applying for research approvals from the research environment and the human research ethics committee.", "et": "Süvendada teadmisi teadustöö põhimõtetest, nõuetest ja etappidest ning peamistest uurimistöö tüüpidest õendusteaduses. Praktiliste kirjalike ülesannete kaudu arendada teaduskirjanduse otsimise, kirjanduse kriitilise hindamise ja enda uurimistööks kasutamise oskusi; planeerida ja koostada uurimiskava ning seda kriitiliselt hinnata. Süvendada teadmisi ja arendada praktilisi oskusi, mis on vajalikud uurimistöö kooskõlastuste saamiseks uurimiskeskkonnast ning inimuuringute eetika komiteelt."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows the stages and requirements of scientific research, the main types of research used in nursing science, and the general principles of selecting the research subjects according to the type of research;", "et": "- teab teadustöö etappe ja nõudeid, peamisi õendusteaduses kasutatavaid uurimistöö tüüpe ning neist lähtuvaid üldisi uuritavate / uuritava materjali valiku põhimõtteid;"}, {"en": "- is able to apply the principles of scientific research for the preparation of the background framework for a research topic;", "et": "- oskab rakendada teadustöö põhimõtteid uurimisteema taustraamistiku koostamisel;"}, {"en": "- is able to find out about the applicability-related, philosophical and theoretical problems of research; ", "et": "- oskab välja selgitada uurimistöö rakenduslikud, filosoofilised ja teoreetilised probleemid; "}, {"en": "- is able to formulate the research problem and set the objective for research;", "et": "- oskab sõnastada uurimisprobleemi ja püstitada uurimistöö eesmärki;"}, {"en": "- is able to plan, draw up and critically evaluate a research plan;", "et": "- oskab planeerida, koostada ja kriitiliselt hinnata uurimiskavandit; "}, {"en": "- knows how to store, manage, protect digital data, information and content;", "et": "- teab digitaalsete andmete kogumise, haldamise ja kaitse põhimõtteid, "}, {"en": "- understands the principles of human research ethics;", "et": "- mõistab inimuuringute eetika põhimõtteid;"}, {"en": "- is able to apply for a research approval.", "et": "- oskab koostada uurimistöö avaldust kooskõlastuste taotlemiseks."}], "notes": {"et": "Kui üliõpilane puudub auditoorsest õppetööst, tuleb tal:\n* kooskõlastatult õppejõuga auditoorselt käsitletud teemad iseseisvalt läbi töötada ning vajadusel esitada täiendav iseseisev töö.\n* lõpuseminaridest puudumise tõttu kuulmata jäänud kirjanduse ülevaated tuleb iseseisvalt läbi töötada ja kirjutada vähemalt kahe ülevaate kohta analüüsiv essee, milles on toodud ettepanekud tööde arendamiseks. Essee tuleb saata õppejõu e-posti aadressile ühe nädala jooksul vastava seminari toimumise päevast.\n\nNB! Kõigi uurimismetoodika õppeainete õppematerjalid on kättesaadavad Moodle-s kogu magistriõpingute ajal. Moodle-isse sisenemiseks ei pea olema registreerunud õppeainele ÕIS-is. Õppeaine nimi Moodle-is on \"Uurimismetoodika õendusteaduses\".\n\nNB! KURSUSE TEEMADE LÄBIMISE JÄRJEKORD JA VORM VÕIB SÕLTUVALT KURSUSEL OSALEJATE ÕPIVAJADUSTEST MUUTUDA KA KURSUSE KÄIGUS!\n\nÕppejõudude kontaktandmed:\n* anja.terkamo-moisio@uef.fi\n* ere.uibu@ut.ee*"}}, "grading": {"independent_work": {"et": "Iseseisev töö (91): \n- iseseisev lugemine Moodle'is (25); \n- teadusartikli kriitiline hindamine ja retsensiooni kirjutamine (10 tundi); \n- iseseisev kirjanduse ülevaate koostamine magistritöö teema taustraamistiku loomiseks (56).\n\n***********************************************************************************************\nNB! Iseseisva töö juhendid on kättesaadavad Moodle'is: TEADUSTÖÖ METODOLOOGILISED ALUSED (MVPT.02.006)\n        All the study materials for the course are availible in Moodle\n***********************************************************************************************"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Written assignment: CRITICAL EVALUATION OF A SCIENTIFIC ARTICLE.\nPass-fail evaluation:\n- a written assignment is a critical analysis of a peer-reviewed article based on an internationally recognized guide to the type of research;\n- the decisions made towards the article are logical and relevant, the criticism is adequate and justified;\n- an assignment is made in accordance with the guideline and uploaded in Moodle on time."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Iseseisva tööna koostatud KIRJANDUSE ÜLEVAADE ja selle kokkuvõtte SUULINE ESITAMINE seminaris.\nMitteeristav hindamine: arvestatud/mittearvestatud.\nHindamiskriteeriumid:\n-\tkirjanduse ülevaade on uuritavat nähtust käsitlevate teaduslike allikate analüütiline, kriitiline ning loogiliselt\nsüstematiseeritud, selge ja ühemõtteline ülevaade;\n-\tkirjanduse ülevaade koosneb osadest: pealkiri, sissejuhatus, metoodika, tulemused (teemakohased\npeatükid), kokkuvõte, kasutatud kirjanduse loetelu ja lisad;\n-\ttöö pealkirja (uurimistöö teema) sõnastus vastab nõuetele;\n-\ttöö sissejuhatuses on põhjendatud teema valikut ning kirjeldatud teema aktuaalsust ja olulisust;\n-\tmetoodika osa sisaldab: kirjanduse otsingustrateegia kirjeldust (otsingu teostamise aeg, andmebaasid,\notsingusõnad, piirangud jms), uuritava materjali valiku kriteeriumeid ja allikate selekteerimise protsessi\nkirjeldust ning otsingu tulemusi (esialgne ja lõplik kirjandusallikate arv);\n-\tkirjanduse otsingu ja selekteerimise protsessi kirjeldus on asjakohane, loogiline ja jälgitav ning selles\nväljendub autoripoolne allikakriitilisus;\n-\ttulemuste osa moodustavad teemakohased alapeatükid sisaldavad: töö kesksete mõistete määratlusi ja\nnende valiku põhjendusi, teoreetiliste lähtekohtade kirjeldust, võrdlust ja valiku põhjendust ning varasemate\nuurimistulemuste võrdlust ja järeldusi;\n-\ttöö kokkuvõte sisaldab: lühikest kokkuvõtet allikate analüüsi tulemusest (mis on teema kohta teada), sellest\ntuletatud uurimisprobleemi (mida pole uuritava teema kohta teada) ja probleemist tuletatud uurimistöö\neesmärki (kuidas teadmiste lünk täidetakse, kuidas uurimisprobleem lahendatakse);\n-\tuurimisprobleem on selgelt piiritletud ja ühemõtteliselt esitatud;\n-\tuurimistöö eesmärgi sõnastus vastab nõuetele ning eesmärk võimaldab lahendada uurimisprobleemi;\n-\ttöös on kasutatud vähemalt 8 teema suhtes olulist ja usaldusväärset teaduslikku kirjandusallikat;\n-\ttöö eri osad on omavahel loogilises kooskõlas ja tekst moodustab integreeritud terviku;\n-\ttöö kogupikkus ei ületa 10 lehekülge (ilma lisadeta) ning töö struktuur ja vormistus on nõuetekohased;\n-\ttööle lisatud lisad on nõuetekohased ja sisaldavad andmeid kõigi töös hinnatud ja kasutatud teadusartiklite\nkohta."}}], "grade_preconditions": {"et": "Lõpphindamisele pääsemiseks tuleb sooritada lugemisülesanded Moodle'is ning esitada iseseisvad tööd kokkulepitud tähtaegadeks. Lõpphindamine toimub lõpuseminarides (erandjuhul kuni üks nädal pärast viimast seminari).\n\n* NB! Lõpphindamisele pääsemise tingimuste mittetäitmist käsitletakse võlgnevustena."}, "grade_evaluation": {"et": "Õppeaine esimene osa (5 EAP) on arvestuslik ning arvestuse saamine kujuneb kirjalike iseseisvate tööde hindamiskriteeriumitele vastavuse alusel."}, "debt_elimination": {"et": "* Kui esitatud ülesanded või iseseisvad tööd ei vasta nõuetele (hindamiskriteeriumitele), on üliõpilasel õigus oma tööd üks kord täiendada ning järelesitada.\n* Kui hindamisele pääsemise tingimused on aine lõpuseminariks täitmata, on võlgnevusi võimalik likvideerida aasta möödumisel (osaledes kursusel koos noorema kursuse üliõpilastega)."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "* Burns, N. & Grove, S.K. (2001) või (2005). The Practice of Nursing Research. Conduct, Critique & Utilization. Elsevier, St. Louis (Moodle'is viidatud peatükid).\n* Euroopa teadlaste eetikakoodeks, tõlge: Eesti Teaduste Akadeemia (versioon 05.05.2017), http://www.akadeemia.ee/_repository/file/AKADEEMIA/Eetikakoodeks_2017.pdf.\n* Hea teadustava, Eetikaveeb, Tartu Ülikool, https://www.eetika.ee/et/eesti-hea-teadustava.\n* Liberati, A., Altman, D. G., Tetzlaff, J., Mulrow, C., Gøtzsche, P. C., Ioannidis, J. P. S., Clarke, M., Devereaux, P. J., Kleijnen, J., David Moher, D. (2009). The PRISMA Statement for Reporting Systematic Reviews and Meta-Analyses of Studies That Evaluate Health Care Interventions: Explanation and Elaboration. Open access in PLoS Medicine, Annals of Internal Medicine, and BMJ Web sites.\n* Magistritöö nõuded ja kaitsmise kord instituudi kodulehe õendusteaduse õppekava all: https://tervis.ut.ee/et/oppimine/magistritoo-1\n* Price, B. (2009) Guidance on conducting a literature search and reviewing mixed literature. Nursing Standard. 23(24): 43-49.\n* Simera, I., Moher, D., Hoey, J., Schulz, K. F., Altman, D. G. (2010). A catalogue of reporting guidelines for health research. European Journal of Clinical Investigation, 40(1): 35-53.\n* Whittemore, R. (2005). Combining Evidedence in Nursing Research. Methods and Implications. Nursing Research, 54(1): 56-62.\n* Young, J.M., Solomon, M.J. (2009). How to critically appraise an article. Nature Clinical Practice Gastroenterology & Hepatology. 6(4): 82-91.\n\nNB! Õppematerjalid on kättesaadavad Moodle-is ainult õppeainele \"Teadustöö metodoloogilised alused I osa (5 EAP)\" registreerunud üliõpilastele.\n\nMoodle'i kursus \"Uurimismetoodika õendusteaduses\" on mõeldud toeks kogu õpingute vältel ja sinna sisenemiseks ei pea olema registreerunud õppeainele ÕIS-is.", "recommended_materials": "* du Prel, J-P., Röhrig, B., Blettner, M. (2009). Critical Appraisal of Scientific Articles. Deutsches Ärzteblatt International, 106(7): 100-105.\n* Holopainen, A., Hakulinen-Viitanen, T., Tossavainen, K. (2008). Systematic review - a method for nursing research. Nurse Researcher, 16(1): 72-83.\n* European Textbook on Ethics in Research 2010 (http://ec.europa.eu/research/science-society/document_library/pdf_06/textbook-on-ethics-report_en.pdf).\n* Hutton, B., Salanti, G., Caldwell, D. M., Chaimani, A., Schmid, C. H., Cameron, C., Ioannidis, J. P. A., Straus, S., Thorlund, K., Jansen, J. P., Mulrow, C., Catala' -Lo' pez, F., Gøtzsche, P. C., Dickersin, K., Boutron, I., Altman, D. G., Moher, D. (2015). The PRISMA Extension Statement for Reporting of Systematic Reviews Incorporating Network Meta-analyses of Health Care Interventions: Checklist and Explanations. Annals of Internal Medicine, 162:777-784. doi:10.7326/M14-2385\n* Trochim, W.M.K. (2006). The Research Methods Knowledge Base. (Comprehensive web-based textbook.) (http://www.socialresearchmethods.net/kb/contents.php)."}, "participants": {"lecturers": [{"person_uuid": "2dbffc25-e102-2ba5-0d25-b7105f242a83", "person_name": "Ere Uibu", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "7f913a76-472a-7cfa-577e-7ce6543758ef", "person_name": "Anja Kyllikki Terkamo-Moisio", "structural_unit": {"code": "MVPT", "name": {"en": "Institute of Family Medicine and Public Health", "et": "peremeditsiini ja rahvatervishoiu instituut"}, "email": "dph@ut.ee", "phone": "+372 737 4190", "webpage_url": "https://tervis.ut.ee", "address": "Ravila 19\n50411 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ravila 19", "zip": "50411", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-43. õppenädal, toimub tsüklitena. Vt õppesessioonide nädalaid ja tunniplaani ka www.tervis.ut.ee"}, "entries": [{"time": "2019-02-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Introduction, course aims and study outcomes, an overview of the independent work, assignments and evaluation (1)"}}, {"time": "2019-02-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The nature and stages of research work. Basic concepts in research. (2)"}}, {"time": "2019-02-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Research methodologies. Research design (including combining and non-traditional research designs) (2)"}}, {"time": "2019-02-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Bioethics and its' principles in research. (2)"}}, {"time": "2019-02-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar work: Deciding the research questions and using a decision tree for selecting a research design. (4)"}}, {"time": "2019-02-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Scientific article and its requirements. The characteristics of an influential scientific journals. (2)"}}, {"time": "2019-04-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminars: Critical evaluation of a scientific article - discussions based on the students' individual assignments. (4)"}}, {"time": "2019-04-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Different review types, systematic and integrative review, stages of conducting a review. (3)"}}, {"time": "2019-04-10", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Workshop: systematical search in databases, search strategy, critical evaluation of studies. (3)"}}, {"time": "2019-04-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Magistritöö nõuded õendusteaduse õppetoolis, magistritöö juhendamine. Magistritöö koostamise etapid. (2) Ere Uibu"}}, {"time": "2019-05-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kirjanduse ülevaade uuritava teema kohta - tagasiside esialgsetele tulemustele: kirjandusallikate otsing ja kogutud materjal, küsimused ja arutelu. (4) Ere Uibu"}}, {"time": "2019-06-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kokkuvõtvad seminarid: kirjanduse ülevaade - ettekanded ja arutelu. (4) Ere Uibu"}}, {"time": "2019-06-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kokkuvõtvad seminarid: kirjanduse ülevaade - ettekanded ja arutelu. (6) Ere Uibu"}}]}, "registration_info": {"audience": {"et": "Õendusteaduse magistriõppe 1. aasta üliõpilased"}, "min_students": 10, "max_students": 20}, "parent_uuid": "f97ebe2f-520a-9637-5801-617b5d438300", "parent_code": "MVPT.02.006", "parent_credits": 8, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}