{"uuid": "a3613133-46d9-2c6f-f9c9-1bd6d24ccc4c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-20T17:49:41", "title": {"en": "Basics of Research Methodology", "et": "Teadustöö metodoloogilised alused"}, "credits": 5, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 5, "faculty": {"code": "MV", "name": {"en": "Faculty of Medicine", "et": "meditsiiniteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "label": {"en": "24/25 S block mode part 1 5 CP MV Eng", "et": "24/25 K SÕ 1. osa 5 EAP MV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 10, "practice": 6, "seminar": 18, "independent_work": 96, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Written assignments help the students to apply the principles of scientific research (including academic language usage) when planning their own master's thesis, and to get an understanding of the process, stages and types of research. The discussions carried out in seminars provide the students with an understanding of the principles of choosing research subjects or research material in accordance with the research plan and the principles of ensuring the trustworthiness of research. In practical classes, students practise searching scientific databases for sources of literature. In seminars, critical evaluation of sources of literature on the basis of checklists is also practised as well as producing arguments with regard to their own evaluations. An overview of the literature for the planned master's thesis is prepared individually. Practical written assignments enable the students to practise the planning of a research paper, drawing up a research plan and evaluating it critically, involving peer review. Readiness in preparing documents for requesting research approvals will be gained.", "et": "Kirjalike ülesannete kaudu õpitakse rakendama teadusliku uurimistöö (sh teaduskeelele) põhimõtteid oma magistritöö planeerimisel ja saavutatakse arusaamine uurimistöö protsessist, etappidest ning uurimistöö tüüpidest. Seminari aruteludes omandatakse arusaam uuritavate või uuritava materjali valiku printsiipidest lähtuvalt uurimisplaanist ning uurimistöö usaldusväärsuse tagamise põhimõtetest. Praktikumides harjutatakse kirjandusallikate otsingut teadusandmebaasides. Harjutatakse kirjandusallikate kriitilist hindamist kontroll-lehtede alusel ja oma hinnangute argumenteerimist seminaris. Individuaalselt koostatakse kirjanduse ülevaade planeeritud magistritöö teemal. Praktiliste kirjalike tööde kaudu harjutatakse uurimistöö planeerimist, uurimiskavandi koostamist ja selle kriitilist hindamist vastastikuse tagasiside kaudu. Saadakse valmidus dokumentide ettevalmistamisest uurimistöö kooskõlastuste taotlemiseks."}, "objectives": [{"en": "To deepen the knowledge of the principles, requirements, and stages of scientific research, and the main types of research in nursing science. Through practical written tasks to develop the skills to search for scientific literature, to evaluate literature critically and to use it for one's own research; to plan and draw up a research plan and evaluate it critically. To deepen the students' knowledge and develop a practical skill of applying for research approvals from the research environment and the human research ethics committee.", "et": "Süvendada teadmisi teadustöö põhimõtetest, nõuetest ja etappidest ning peamistest uurimistöö tüüpidest õendusteaduses. Praktiliste kirjalike ülesannete kaudu arendada teaduskirjanduse otsimise, kirjanduse kriitilise hindamise ja enda uurimistööks kasutamise oskusi; planeerida ja koostada uurimiskava ning seda kriitiliselt hinnata. Süvendada teadmisi ja arendada praktilisi oskusi, mis on vajalikud uurimistöö kooskõlastuste saamiseks uurimiskeskkonnast ning inimuuringute eetika komiteelt."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows the stages and requirements of scientific research, the main types of research used in nursing science, and the general principles of selecting the research subjects according to the type of research;", "et": "- teab teadustöö etappe ja nõudeid, peamisi õendusteaduses kasutatavaid uurimistöö tüüpe ning neist lähtuvaid üldisi uuritavate / uuritava materjali valiku põhimõtteid;"}, {"en": "- applies the knowledge acquired about scientific research for the preparation of the background framework for own research;", "et": "- rakendab saadud teadmisi teadustöö tegemisest oma uurimisteema taustraamistiku koostamisel;"}, {"en": "- finds out the applicability-, philosophy- and theories-related problems of research;", "et": "- selgitab välja oma uurimistöö rakenduslikud, filosoofilised ja teoreetilised probleemid;"}, {"en": "- formulates the research problem and sets the objective for their own planned research;", "et": "- sõnastab uurimisprobleemi ja püstitab uurimistöö eesmärgi oma planeeritavale uurimistööle;"}, {"en": "- is able to plan, draw up and critically evaluate a research plan;", "et": "- oskab planeerida, koostada ja kriitiliselt hinnata uurimiskavandit;"}, {"en": "- knows how to store, manage, protect digital data, information and content;", "et": "- teab digitaalsete andmete kogumise, haldamise ja kaitse põhimõtteid,"}, {"en": "- understands the principles of human research ethics;", "et": "- mõistab inimuuringute eetika põhimõtteid;"}, {"en": "- is able to apply for a research approval.", "et": "- oskab koostada uurimistöö avaldust kooskõlastuste taotlemiseks."}], "notes": {"et": "General principles:\nIf the student is absent from online lectures and seminars related to the lesson plan, he must independently work through the topics discussed, and, if necessary, submit additional independent work.\n\n* THE SEQUENCE AND FORM OF COURSE TOPICS MAY CHANGE DURING THE COURSE, AS IT DEPENDS ON THE LEARNING NEEDS OF THE PARTICIPANTS IN THE COURSE!\n\n\nResponsible lecturer contact: ere.uibu@ut.ee"}}, "grading": {"independent_work": {"et": "Independent work (96 academic hours): \n- Watching video lectures, familiarizing oneself with guidelines, and self-control test after reading in Moodle (1 h);\n- Independent assignment: a critical evaluation and written peer-review of the research article (10 h); \n- Conducting a systematic literature review for one's own master's thesis background framework and presenting the review to other course participants  (76 h);\n- Creating an infographic to give an overview of the work done and presenting it in the final seminars to fellow students (about 7 hours).\n\n\n***********************************************************************************************\n*Guidelines for independent assignments are available in Moodle platform for the course \"Teadustöö medodoloogilised alused I osa\": http://moodle.ut.ee\n  \n***********************************************************************************************"}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Written assignment: CRITICAL EVALUATION OF A SCIENTIFIC ARTICLE.\nPass-fail evaluation:\n- a written assignment is a critical analysis of a peer-reviewed article based on an internationally recognized guide to the type of research;\n- the decisions made towards the article are logical and relevant, the criticism is adequate and justified;\n- an assignment is made in accordance with the guideline and uploaded in Moodle on time."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "LITERATURE REVIEW for the background of one's own research.\nPass-fail evaluation:\n-\tthe work submitted is an analytical, critical, and logically systematized review of scientific sources on the phenomenon under study;\n-\tthe work consists of the following sections: title, introduction, methodology, results (thematic subchapters), summary, references, and appendices;\n-\tthe formulation of the title of the work (the topic of the planned research) meets the requirements and contains the required parts;\n-\tin the introduction of the work, the choice of the research topic and the actuality of the topic, and the importance of the research are briefly explained;\n-\tthe methodology part includes: description of literature search strategy (search date(s), at least 2-3 databases, search words, limitations, etc.), criteria for selection of research material, and description of articles selection process and search results;\n-\tthe description of the literature search and selection process is relevant, logical, and observable, and it expresses the author's criticality of the source;\n-\tthe thematic subchapters that form part of the results include explanations of the key concepts of the work and justifications for the selection, a description of the theoretical starting points, and comparison and conclusions of previous research results;\n-\tthe summary includes: a brief summary of the result of the analysis of the sources (which is known about the topic), the derived research problem (which is not known about the research topic), and the aim of the research derived from the problem (how the knowledge gap is filled, how the research problem will be solved);\n-\tthe research problem is clearly defined and formulated;\n-\tthe formulation of the research aim meets the requirements and it allows to solve the research problem;\n-\tat least 8 relevant and reliable scientific literature sources have been used in the work;\n-\tthe different parts of the work are logically coherent and the text forms an integrated whole;\n-\tthe total length of the work does not exceed 5 pages (without a title page, references list, and appendices) and the structure and format of the work are in line with relevant guidelines;\n-\tthe appendices attached to the work are appropriate and contain data on all scientific articles evaluated and used for the literature review."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "INFOGRAPHIC. \nPass-fail evaluation:\n- the infographic explains why and what was done for looking up for the literature and what was found;\n- the infographic is prepared according to the instructions, submitted for evaluation by the given deadline and presented to fellow students in the final seminar.\n\n\n"}}], "grade_preconditions": {"et": "For the final assessment, a student has to complete the reading task in Moodle and submit independent works by the agreed deadlines. The final evaluation takes place within about a week after the submission of the final version of the literature review.\n\n*Failure to meet the conditions for the final assessment is treated as arrears."}, "grade_evaluation": {"et": "* The course's final evaluation is not distinguished: pass/fail.\n\n* For passing the subject, the assignments have to be in compliance with the evaluation criteria of the submitted independent works."}, "debt_elimination": {"et": "* If the submitted assignments do not meet the requirements (evaluation criteria), the student has the right to supplement and resubmit his work once.\n* If the conditions for access to the evaluation have not been met by the final seminar, it is possible to liquidate the debts after a year has passed (by participating in the course with younger students)."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "* Burns, N. & Grove, S.K. (2001) või (2005). The Practice of Nursing Research. Conduct, Critique & Utilization. Elsevier, St. Louis (Moodle'is viidatud peatükid).\n* Estonian Code of Conduct for Research Integrity. Eetikaveeb, University of Tartu, https://www.eetika.ee/sites/default/files/www_ut/hea_teadustava_eng_trukis.pdf.\n* Liberati, A., Altman, D. G., Tetzlaff, J., Mulrow, C., Gøtzsche, P. C., Ioannidis, J. P. S., Clarke, M., Devereaux, P. J., Kleijnen, J., David Moher, D. (2009). The PRISMA Statement for Reporting Systematic Reviews and Meta-Analyses of Studies That Evaluate Health Care Interventions: Explanation and Elaboration. Open access in PLoS Medicine, Annals of Internal Medicine, and BMJ Web sites.\n* Price, B. (2009). Guidance on conducting a literature search and reviewing mixed literature. Nursing Standard. 23(24): 43-49.\n* Simera, I., Moher, D., Hoey, J., Schulz, K. F., Altman, D. G. (2010). A catalogue of reporting guidelines for health research. European Journal of Clinical Investigation, 40(1): 35-53.\n* Whittemore, R. (2005). Combining Evidence in Nursing Research. Methods and Implications. Nursing Research, 54(1): 56-62.\n* Young, J.M., Solomon, M.J. (2009). How to critically appraise an article. Nature Clinical Practice Gastroenterology & Hepatology. 6(4): 82-91.\n\n*Additional materials are available in Moodle platform for the course \"Teadustöö medodoloogilised alused I osa\": http://moodle.ut.ee", "recommended_materials": "* du Prel, J-P., Röhrig, B., Blettner, M. (2009). Critical Appraisal of Scientific Articles. Deutsches Ärzteblatt International, 106(7): 100-105.\n* Holopainen, A., Hakulinen-Viitanen, T., Tossavainen, K. (2008). Systematic review - a method for nursing research. Nurse Researcher, 16(1): 72-83.\n* European Textbook on Ethics in Research 2010 (http://ec.europa.eu/research/science-society/document_library/pdf_06/textbook-on-ethics-report_en.pdf).\n* Hutton, B., Salanti, G., Caldwell, D. M., Chaimani, A., Schmid, C. H., Cameron, C., Ioannidis, J. P. A., Straus, S., Thorlund, K., Jansen, J. P., Mulrow, C., Catala' -Lo' pez, F., Gøtzsche, P. C., Dickersin, K., Boutron, I., Altman, D. G., Moher, D. (2015). The PRISMA Extension Statement for Reporting of Systematic Reviews Incorporating Network Meta-analyses of Health Care Interventions: Checklist and Explanations. Annals of Internal Medicine, 162:777-784. doi:10.7326/M14-2385\n* Trochim, W.M.K. (2006). The Research Methods Knowledge Base. (Comprehensive web-based textbook.) (http://www.socialresearchmethods.net/kb/contents.php)."}, "participants": {"lecturers": [{"person_uuid": "2dbffc25-e102-2ba5-0d25-b7105f242a83", "person_name": "Ere Uibu", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "78afbe35-4cb3-0c94-d4de-20f6d5357902", "person_name": "Liisi Mägi", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "833d5519-ea11-6cf6-7e37-67fceea9a903", "person_name": "Helle Peterson", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24.-43. õppenädal, toimub tsüklitena. Vt õppesessioonide nädalaid ja tunniplaani ka www.tervis.ut.ee"}, "entries": [{"course_week": 24, "time": "2025-02-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": " INTRODUCTION TO THE COURSE"}, "description": {"et": "Introduction, course aims and study outcomes, an overview of the independent work, assignments, and evaluation. (1) Ere Uibu"}}, {"course_week": 24, "time": "2025-02-12", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Watch the video lecture in Moodle: stages of writing a master's thesis (~20 minutes). Then complete the self-chek task (total time 45 minutes) Ere Uibu"}}, {"course_week": 24, "time": "2025-02-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "SCIENTIFIC RESEARCH AND RESEARCH ETHICS"}, "description": {"et": "Nature and stages of research work. Basic concepts in research. (2) Helle Peterson"}}, {"course_week": 24, "time": "2025-02-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Bioethics and its' principles in research. (2) Helle Peterson"}}, {"course_week": 24, "time": "2025-02-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Research design planning from draft to final conduct. (1) Ere Uibu"}}, {"course_week": 24, "time": "2025-02-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Own research planning - starting from literature review. (1) ere Uibu"}}, {"course_week": 27, "time": "2025-03-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "WORK WITH SCIENTIFIC LITERATURE"}, "description": {"et": "Different review types. Systematic and integrative review, stages of compilation, critical evaluation of sources. (1) Liisi Mägi"}}, {"course_week": 27, "time": "2025-03-04", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Creating a literature search strategy based on the topic of your master's thesis. (2) Liisi Mägi"}}, {"course_week": 27, "time": "2025-03-06", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Workshops: systematic searches in databases. (4) Liisi Mägi"}}, {"course_week": 27, "time": "2025-03-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "CRITICAL APPRAISAL OF PREVIOUS RESEARCH"}, "description": {"et": "Requirements for a research article based on the type of research. (2) Ere Uibu"}}, {"course_week": 30, "time": "2025-03-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "A critical evaluation of the scientific articles - presentations and discussions based on the students' individual assignments. (4) Ere Uibu"}}, {"course_week": 30, "time": "2025-03-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "COMPILING A LITERATURE REVIEW"}, "description": {"et": "Formalizing the methodology of the literature review and presenting the results. (1) Ere Uibu"}}, {"course_week": 30, "time": "2025-03-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Workshop to formalize the literature review methodology. (2) Ere Uibu"}}, {"course_week": 33, "time": "2025-04-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Results of the literature review - discussions and feedback on the students' first drafts. (4) Ere Uibu"}}, {"course_week": 33, "time": "2025-04-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Communicating research: presenting the research need, plan or results with an infographic. (1) Ere Uibu"}}, {"course_week": 38, "time": "2025-05-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Written assignments overview, final feedback and summing up the course. (6) Ere Uibu"}}]}, "registration_info": {"audience": {"et": "Õendusteaduse magistriõppe 1. aasta üliõpilased, õendusteaduse välisüliõpilased"}, "min_students": 10, "max_students": 21}, "parent_uuid": "f97ebe2f-520a-9637-5801-617b5d438300", "parent_code": "MVPT.02.006", "parent_credits": 8, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}