{"uuid": "c32a7d7b-d648-bec7-a253-454b039b52b3", "code": "MVPT.02.011", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Patient-centredness and Clinical Health Promotion", "et": "Patsiendikesksus ja kliiniline tervisedendus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVPT02", "structural_unit_name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Quality of health services and patient-centred health care: concepts and principles. Clinical health promotion, health service standards 2 and 3 of health-promoting hospitals: supporting and informing, empowering patients. Collecting and analyzing feedback from health care users and planning development activities for service improvement in co-operation with a team.", "et": "Tervishoiuteenuste kvaliteet ja patsiendikeskne tervishoid: mõisted ja põhimõtted. Kliiniline tervisedendus, tervist edendavate haiglate terviseteenuste standardid 2 ja 3: patsientide toetamine, informeerimine ja sekkumine/võimestamine. Tervishoiuteenuste kasutajatelt tagasiside kogumine ja analüüsimine ning arendustegevuse kavandamine teenuse parendamiseks koostöös meeskonnaga."}, "objectives": [{"en": "To develop an understanding of the principles and efficiency of patient-centred health care, and to develop the skills, including co-operation skills to evaluate health services patient-centredness and design patient-centred services.", "et": "Kujundada arusaam patsiendikeskse tervishoiu põhimõtetest ja tulemuslikkusest ning arendada oskusi, sh koostööoskusi tervishoiuteenuste patsiendikesksuse hindamiseks ja patsiendikesksete teenuste kavandamiseks."}], "learning_outcomes": [{"en": "The student who has completed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- understands the principles, possibilities, and importance of patient-centred health care and clinical health promotion;", "et": "- mõistab patsiendikeskse tervishoiu ja kliinilise tervisedenduse põhimõtteid, võimalusi ning olulisust;"}, {"en": "- has skills to analyse and critically evaluate health services individually and in cooperation with co-students, following the principles of patient-centredness and clinical health promotion;", "et": "- oskab nii iseseisvalt kui ka koostöös kaasõppijatega analüüsida ja kriitiliselt hinnata tervishoiuteenuseid, lähtudes patsiendikesksuse ja kliinilise tervisedenduse põhimõtetest; "}, {"en": "- is able within a team to design a quality program/development plan for the improvement of health services.", "et": "- oskab meeskonnas töötades planeerida kvaliteediprogrammi/tegevuskava tervishoiuteenuste arendamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}