{"uuid": "3eaa2885-fa09-06ad-8c8d-89c49e33833f", "code": "MVST.00.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Oral and Maxillofacial Surgery III", "et": "Suu- ja näolõualuukirurgia III"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVST", "structural_unit_name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVST", "name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "phone": "+372 731 9856", "webpage_url": "https://hambaarstiteadus.ut.ee", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "c915b5ce-1d70-7bf6-5719-fff7d730a109", "code": "ARST.01.070", "title": {"en": "Oral and Maxillofacial Surgery II", "et": "Suu- ja näolõualuukirurgia II"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "768cc64f-b679-936a-ec65-c32921672d6f", "code": "ARST.01.069", "title": {"en": "Oral and Maxillofacial Surgery I", "et": "Suu- ja näolõualuukirurgia I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The subject gives basic knowledge of the malignant tumours in the maxillo-facial region. The specific characteristics and treatment modalities of these tumours are discussed. Attention is paid on the diagnosis and treatment of trigeminal and facial nerve diseases. An overview of reconstructive surgery of congenital and acquiered defects in maxillo-facial region is discussed. The course consists of the academic lectures and practical training in out- and inpatient clinic. The student has to present an academic patient case history. The clinical work performed by the student has been analyzed with the tutor, the student has received feedback and the work has been included in the student's e-portfolio.", "et": "Aine annab põhiteadmised pahaloomuliste kasvajate iseloomust, nende eripärast, diagnostika ja ravi võimalustest näo-lõualuude piirkonnas. Käsitletakse ka kolmiknärvi ja näonärvi haiguste diagnostikat ja ravi. Antakse ülevaade rekonstruktiivse kirurgia võimalustest näo-lõualuude piirkonna kaasasündinud ja omandatud defektide ravis. Õppetöö toimub akadeemiliste loengutena ja praktikumidena. Praktikumid toimuvad polikliinikus ning statsionaaris. Üliõpilane koostab ja esitab akadeemilise haigusloo. Üliõpilane teeb iseseisvalt kliinilist tööd, analüüsib igat oma tööd praktikat juhendava õppejõuga, tagasisidestatud protseduurid kannab oma e-portfooliosse."}, "objectives": [{"en": "The aim of the subject is to give basic knowledge of the malignant tumours in the maxillo-facial region, its treatment modalities and stomatological nerve diseases. To give an overview of reconstructive surgery in maxillo-facial region in case of congenital and acquiered defects.", "et": "Aine eesmärgiks on anda põhiteadmised näo-lõualuude piirkonnas esinevatest prekantseroosidest, hea- ja pahaloomulistest kasvajatest, nende diagnostikast ja ravist. Käsitletakse plastilise kirurgia üldprintsiipe ja rakendamisvõimalusi. Anda ülevaade näo-lõualuude piirkonna rekonstruktiivsest kirurgiast kaasasündinud ja omandatud defektide ravis. Antakse teadmised stomatoloogilistest närvihaigustest."}], "learning_outcomes": [{"en": "1) knows medical deonthology", "et": "1) teab arstlikku deontoloogiat"}, {"en": "2) knows benign and malignant tumours,tumour-like lesions, precancerous lesions and stomatological nerve diseases in the maxillofacial region, knows diagnostics, clinical feature and principles of treatment of these diseases", "et": "2) teab näo-lõualuude piirkonna prekantseroose, hea- ja pahaloomulisi kasvajaid, teab stomatoloogilisi närvihaigusi ning teab nende haiguste diagnostikat, kliinilist pilti, diagnostikat ja ravipõhimõtteid"}, {"en": "3) is able to examine the patient, to compose the treatment plan and knows differential diagnostics of these diseases", "et": "3) oskab patsienti uurida, koostada raviplaani ja diferentseerida teistest näo-lõualuupiirkonna haigustest"}, {"en": "4) knows technique of extracion in lower and and upper jaw", "et": "4) teab hammaste eemaldamist erinevates hambagruppides üla- ja alalõuas"}, {"en": "5) is able to perform atypical tooth, knows indications and general principles of atypical extractions and incisions on the oral mucosa", "et": "5) teab atüüpiliste ekstraktsioonide näidustusi ja üldpõhimõtteid, oskab teha intsisioone suuõõne erinevates piirkondades"}, {"en": "6) knows first aid and treatment of the complicated dentition of the wisdom-tooth", "et": "6) teab esmaabi raskendatud suhulõikumisega tarkusehammaste korral"}, {"en": "7) knows treatment of the operated patients, is able to give advise to the patient about treatment possibilities after procedure in maxillo-facial region", "et": "7) teab opereeritud patsientide järelravi, oskab patsienti nõustada"}, {"en": "8) has to present an academic patient case history, report or scientific work", "et": "8) oskab vormistada kliinilist haiguslugu, referaati ja uurimustööd suu- ning näolõualuukirurgia erialal"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}