{"uuid": "614b1f07-25a4-76ad-d41e-0ffb8650df6a", "code": "MVST.00.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-04T12:17:47", "title": {"en": "Promotion of Oral Health", "et": "Suutervise edendamine"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVST", "structural_unit_name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVST", "name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "phone": "+372 731 9856", "webpage_url": "https://hambaarstiteadus.ut.ee", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will take place in the autumn semester from September to December, and will take up to 26 hours (1 ECTS) to work on the materials. The course is composed by lectures from the Institute of Dentistry of the University of Tartu and directed by Assistant Professor Rita Nõmmela. Specialists of different fields will answer all of your questions.The course is web-based and materials about the can be found at www.ut.ee/tervis/hambad as well as in Moodle.\nThe student will get acquainted with the materials, present homework, solve situational tasks and perform tests (assessment is non-differentiated).\nThe test is done positively if 100% of the answers are correct. The final test can be performed an unlimited number of times.\nWe hope that you yourself will visit the dentist twice a year and recommend doing the same to your family and acquaintances.\nDuring the course, students will confirm and update their knowledge on dental disease prevention, understand the difference between the group and individual consultations and the importance of having good consultation skills in medical practice. The practical part of the course includes a lecture delivery in public in a childcare institution.", "et": "Kursus on koostatud Tartu Ülikooli hambaarstiteaduse instituudi õppejõudude poolt. Kursuse toimumise ajal hoiab silma peal Riina Runnel. Teie küsimustele annavad vastuseid meie erinevate erialade spetsialistid.\nSügissemestri käigus täiendavad üliõpilased oma teadmisi suu- ja hambahaiguste olemusest ja ennetusest ning õpivad suutervisealaste teadmiste edasiandmist erinevatele sihtgruppidele. Tõstame ausse nõustamise oskuse vajalikkuse arsti praktikas. Tegemist on kombineeritud kursusega, mis koosneb auditoorsest õppest, e-loengutest, praktikumist ja seminarist. Kursus sisaldab tudengi valikul kas suutervisealase loengu pidamist või artikli kirjutamist. \n\nKevadsemestril on aine 100% veebipõhine. Üliõpilane tutvub materjalidega, esitab kodutöö, lahendab situatsioonülesandeid ning sooritab testid (hindamine on mitteeristav). On vaja tutvuda nii Moodles kui ka veebilehel aadressiga www.suukool.ee oleva materjaliga. Uute hambapastade kohta leiate lisainfot antud materjalide hulgast. Ülesannete kirjeldused on toodud kursuse avalehel. Lõpuks tuleb sooritada lõputest. Test on sooritatud positiivselt, kui 100% vastustest on õiged. Lõputesti saab sooritada piiramatu arv kordi.\nLoodame, et edaspidi käite ise ja soovitate ka oma sõpradel-tuttavatel külastada hambaarsti kaks korda aastas.\nAlustan kursuse tutvustamist moodsa vanasõnaga: \"Aita ennast ise, siis aitab sind ka hambaarst.\"\nTeadmised hammaste hoolduse eripära kohta erinevatel eluperioodidel võiksid olla igal inimesel, et hoolitseda enda ja oma lähedaste eest. Lihtsustatud ülevaade muutustest suulimaskestal võiks aidata inimestel kiiremini jõuda hambaarstile. Väiksemad mured - lihtsamad lahendused.\nEestis tuleb täiskasvanute hambaravi puhul rääkida ka rahast. Samas laste hammaste ravi eest tasub Eesti Haigekassa ja ka seda suurepärast võimalust ei kasutata maksimaalselt.\nKokkuvõtteks: loodame teile anda ülevaate hambaraviga seotud teemadest."}, "objectives": [{"en": "Information about oral healt and prevention of oral diseases is necessary to every high educated person. The aim on the subject is to get knowledges about dental disesases, treatment possibilities and payment of dental service. To pass on basic knowledge needed for teaching mouth hygiene (also in lecture form) to children, as well as adults.", "et": "Suu tervise ja haiguste ennetamise kohta esitatud informatsioon on vajalik igale kõrgharidusega inimesele. Eesmärgiks on teadmiste omandamine hambahaiguste vältimisest, millised on hambaravi võimalused ja milline on hambaravi teenuste eest tasumine. Õpetada baasteadmisi suutervisealaste teadmiste edasiandmisest (k.a loengu vormis) nii lastele kui täiskasvanutele."}], "learning_outcomes": [{"en": "Students who have passed the course\n* knows methods for prevention of oral and dental diseases\n* knows dental services compensated for health Service\n* knows more about possibilities of dental treatment in different ages\n* it is possible to use additional web-based fails giving knowledges to children how to clean the teeth and give advice about nutrition\nThe student will be able to:\n* make necessary arrangements and deliver a lecture on oral hygiene at school or kindergarten\n* prepare a lecture plan\n* use teaching aids (pictures, demonstrational materials, presentation software)", "et": "Kursuse lõpetanu\n* teab hambahaiguste vältimise võimalusi\n* teab täpselt, milliste hambaraviteenuste eest tasub Eesti Haigekassa ja milliseid hüvitisi makstakse\n* teab rohkem hambaravi võimalustest ja vajadustest eri eluperioodidel\n* saab kasutada kursuse materjalide hulgas olevaid faile, et õpetada väikelapsele, algklassiõpilastele õiget toitumist ja hammaste pesemist\n* oskab pakkuda suutervisealast loengut lasteaeda või kooli ja loengut seal ka läbi viia\n* oskab koostada loenguplaani\n* okab kasutada loengu läbiviimiseks õppevahendeid (pildid, näitlikustav materjal, slaidiprogramm)"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}