{"uuid": "cb19a39f-d7a7-9f8a-d19f-f05a2bf4fe5b", "code": "MVST.00.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching the Basics of Oral Health", "et": "Õpetan suutervist hoidma"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "MVST", "structural_unit_name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "MVST", "name": {"en": "Institute of Dentistry", "et": "hambaarstiteaduse instituut"}, "phone": "+372 731 9856", "webpage_url": "https://hambaarstiteadus.ut.ee", "address": "L. Puusepa 1a\n50406 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "L. Puusepa 1a", "zip": "50406", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "MV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In this course the students shall improve their knowledge about the nature and prevention of dental and gum\ndiseases. They shall get answers to the basic questions concerning oral health: How are cavities formed? What kind\nof toothpaste to use? What is the correct way of brushing the teeth? What is fluoride? What is xylitol? What is\ntartar? etc. Having taken the course, the students shall be able to explain the above subjects to others in\nsimple terms. As part of the course the students shall either deliver a lecture or write an article about oral health.", "et": "Kursuse käigus täiendavad üliõpilased oma teadmisi suu- ja hambahaiguste olemusest ning ennetusest. Üliõpilased saavad vastuse kõige tavalisematele suutervist puudutavatele küsimustele: kuidas tekivad hambaaugud?, millist hambapastat valida?, kuidas õigesti hambaid pesta?, mis on fluoriid?, mis on ksülitool?, mis on hambakivi? jne. Kursuse lõpus oskab üliõpilane neid teemasid ka lihtsate sõnadega teistele selgitada. Kursus sisaldab tudengi valikul kas suutervisealase loengu pidamist või artikli kirjutamist."}, "objectives": [{"en": "Acquiring basic knowledge about oral health and the most effective ways of conveying the knowledge to both children\nand adults.", "et": "Õpetada suutervisealaseid baasteadmisi ning nende teadmiste edastamise oskust nii lastele kui täiskasvanutele."}], "learning_outcomes": [{"en": "The student will be able to:\n1. The student understands the mechanism of how cavities develop and is able to explain this to others in simple terms.\n2. The student understands how to prevent dental and gum diseases.\n3. By using the basic knowledge concerning oral health the student is able to carry out various preventive activities\n(delivering a lecture or writing an article about oral health).", "et": "1. Üliõpilane saab aru hambaaugu tekkemehhanismist ning oskab lihtsate sõnadega seda ka teistele selgitada. \n2. Üliõpilane teab, kuidas ennetada hamba- ja igemehaigusi.\n3. Kasutades suutervisealaseid baasteadmisi oskab üliõpilane viia läbi erinevaid ennetustegevusi (suutervisealase loengu pidamine või artikli kirjutamine)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}