{"uuid": "d1f521bf-c752-4055-d369-60d5add74d2a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-29T13:47:38", "title": {"en": "International Criminal Law", "et": "Rahvusvaheline kriminaalõigus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI03", "name": {"en": "Department of Penal Law", "et": "karistusõiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVOI03", "structural_unit_name": {"en": "Department of Penal Law", "et": "karistusõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "5c8f3be1-f640-e4c7-5b45-59bae7efedf5", "code": "P2OG.02.085", "title": {"en": "Criminal Law", "et": "Karistusõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "d2b6fa55-d0e4-3ce4-633e-d575ab262161", "code": "OIAO.01.046", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Criminal Law", "et": "Karistusõigus"}, "credits": 9, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "45c4a70b-401e-3678-acaa-8db9eb68ffd1", "code": "OIAO.01.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Criminal Law", "et": "Karistusõigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "805f53f8-3458-5549-0f05-e709bb994e88", "code": "P2OG.02.180", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Criminal Law", "et": "Karistusõigus"}, "credits": 9, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": true, "uuid": "86b8d1f8-ffa4-71eb-bf52-f8ed480fd87f", "code": "P2OG.02.156", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "f931a25a-73b1-a954-b808-72a6af66d26d", "code": "P2OG.02.070", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "General Course on International Law", "et": "Rahvusvahelise õiguse põhikursus"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "b0de99d2-3021-2b15-f2c7-3ad4e63207cf", "code": "OIAO.07.025", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basic Course on International Law", "et": "Rahvusvahelise õiguse põhikursus"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "a49a7d97-c7c5-073c-9588-d8ffb68640ed", "code": "OIAO.07.075", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will draw attention to the essence, principles and definitions of international crimes, as well as to various possibilities to handle them on international or internal level. Special attention will be drawn to definitions and procedural aspects of international crimes in Estonia.", "et": "Vaadeldakse rahvusvaheliste kuritegude olemust, põhimõtteid ja kuriteokoosseise, samuti rahvusvaheliste kuritegude menetlemise võimalusi rahvusvahelisel ja ka siseriiklikul tasandil. Eraldi tähelepanu pööratakse rahvusvaheliste kuritegude koosseisudele ja menetluslikele aspektidele Eestis."}, "objectives": [{"en": "To give an overview of the progressively developing discipline of international criminal law: to introduce students with respective international instruments, court practice and academic writings. To teach students to see and analyze the theoretical and practical issues of international criminal law.", "et": "Anda ülevaade progresseeruvalt arenevast õigusharust - rahvusvahelisest kriminaalõigusest: viia üliõpilased kurssi asjakohase rahvusvahelise normatiivmaterjali, kohtupraktika ja erialakirjandusega. Õpetada nägema ja analüüsima rahvusvahelise kriminaalõiguse teoreetilisi ja praktilisi probleeme."}], "learning_outcomes": [{"en": "By the end of the course students have to:", "et": "Kursuse lõpuks peab üliõpilane olema:"}, {"en": "- be able to explain the principles and fundamental concepts of international criminal law;", "et": "- võimeline selgitama rahvusvahelise kriminaalõiguse põhimõtteid ja põhimõisteid;"}, {"en": "- be aware of topical issues of international criminal law and be able to discuss them;", "et": "- teadlik rahvusvahelise kriminaalõiguse aktuaalsetest probleemidest ja suutma nende üle arutleda;"}, {"en": "- be able to orientate in the relevant institutions and instruments", "et": "- võimeline orienteeruma rahvusvahelise kriminaalõiguse olulistes institutsioonides ja normatiivdokumentides"}], "notes": {}}, "grading": {"independent_work": {"et": "Essee vabalt valitud rahvusvahelise kriminaalõiguse aktuaalset problemaatikat käsitleval teemal. Essee maht on 15000 tähemärki. NB! See käib essee sisu kohta, arvestamata bibligraafiat, tiitellehte jms.\nEssee tuleb saata e-maili aadressile andres.parmas@ut.ee 1. detsembriks.\n\nEssay on a topical issue of International criminal law (based on student's own choice) - 15 000 letters. NB! The letter-count does not include the title page, bibliography etc, only the pure text of the essay is taken into account.\nEssay has to be sent to the e-mail: andres.parmas@ut.ee by 1 December.\n\nKursuse lehele moodle'sse üles laetud kaasuste lahendamine - lahendused tuleb üles laadida vastava teema kollokviumi toimumise päevaks.\n\nSolving of cases that are available on Moodle page for the course. The solutions have to be uploaded by the day of colloquium in respective topic."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Essee\nvormistuse korrektsus ja nõuetele vastavus,\nanalüütilisus, seoste loomine, tõlgendamise tase\nteemakäsituse loogilisus ja terviklikkus.\n\nE - vormistus üldjoontes nõuetekohane ja korrektne, analüüsi ja iseseisva tõlgendamise elemendid olemas, kuid ebakindlad ja pinnapealsed, teemakäsitus üldjoontes loogiline, ent seosed lünklikud;\nD - vormistus nõuetekohane ja üldjoontes korrektne, analüüs ja iseseisev tõlgendamine arusaadav, ent kohati ebakindel, teemakäsitus üldjoontes loogiline ja seostatud;\nC - vormistus nõuetekohane ja korrektne, analüütilised seosed  ja tõlgendused korralikud, kindlus seoste loomisel, teemakäsitus loogiline, ent terviku seisukohalt täheldatavad mõned nõrgad kohad;\nB - vormistus eeskujulik, seoste ja viidete põhjalik analüüs, tõlgendamine julge ja seostele tuginev, teemakäsitus tervikuna loogiline ja ladus;\nA -  vormistus eeskujulik, analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, teemakäsitus uudne, loogiline, tekst tervikuna silmapaistev saavutus\n\nEssay\nConformity of the drafting with the formal requirements and correctness of it, analytical skills, creation of connections between various issues, the level of Juridical interpretation, consistency of the approach\n\nE - the text generally conforms to the formal requirements, there are elements of analysis and independent interpretation traceable in the text, but the text is inconsistent\nD - the text generally conforms to the formal requirements, the text contains independent analysis and interpretaion, but it remains hazy at times, the chosen approach is generally consistent\nC - the text generally conforms to the formal requirements, analytical skills demonstrated and interpretation offered is credible, the chosen approach is generally consistent, but there are some weaknesses when looking at the text as a whole\nB - the text conforms to the formal requirements, the chosen approach is consistent, it is based on thorough analysis of the references, the writing is smooth\nA - the text conforms to the formal requirements, the level of analysis is outstanding, connections made are resourceful, the approach is fresh, the text is consistent and remarkable as a whole"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik eksam\nküsimustele vastamise korrektsus ja ammendavus\nvaldkonna terminoloogia tundmine\nanalüüsioskus\n\nWritten examination\nThe correctness and exhausitveness of the answer, knowledge of the terminology, presentation of analytical skills\n\nE - right answers to more than 50% of the questions, there are several mistakes in the responses and terminology is used wrongly on several occasions\nD - most of the questions are answered correctly, there are several mistakes in the given responses, the terminology is used wrongly on several occasions\nC - most of the questions are answered correctly, there are some mistakes, the student wobbles somewhat with terminology\nB - the answers to the questions are mostly axhaustive, there are only some small mistakes\nA - the answers to the querstions are exhaustive, virtually no mistakes\n\n\nE - tudeng oskab õiged vastused anda enam kui pooltele küsimustele, vastustes esineb mitmeid eksimusi ja terminoloogiat kasutatakse suures osas ebaõigesti\nD - küsimustele on vastatud rahuldavalt, s.t enamikule neist teatakse õigeid vastuseid, vastustes esineb mitmeid eksimusi, terminoloogia kasutamises on mitmeid eksimusi\nC - küsimustele vastamine heal tasemel, vastustes esineb eksimusi, terminoloogia kasutamises on ebakindlust ja eksimusi\nB - küsimustele ammendavate vastuste andmine, vastustes väheolulised ebatäpsused, üksikud puudujäägid õigusnormidele viitamises\nA - Vastused küsimustele on ammendavad, ei esine praktiliselt mingeid ebatäpsusi, viidatakse kõigile asjassepuutuvaile normidele"}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Kollokvium\nIgaks korraks üles antud materjali iseseisev läbitöötamine\nOsalemine diskussioonis\n\nE - üliõpilane on omandanud iseseisvaks läbitöötamiseks materjali lünklikult, osaleb diskussioonis harva, tema oskus analüüsida ja seoseid luua on elementaarsel tasemel\nD - üliõpilane on iseseisvaks läbitöötamiseks antud materjali suuremas osas omandanud, osaleb aeg-ajalt diskussioonis, suutes üldjoontes seoseid luua ning probleeme analüüsida, kuid on selles mõneti ebakindel \nC - üliõpilane on iseseisvaks läbitöötamiseks antud materjali omandanud, osaleb diskussioonis aktiivselt, tema arutlus on üldjoontes asjakohane, suudab analüüsida ning seoseid luua \nB - üliõpilane on iseseisvaks läbitöötamiseks antud materjali omandanud ning hankinud lisateadmisi ka soovituslikest materjalidest, osaleb diskussioonis aktiivselt ja püstitab iseseisvalt küsimusi, tema arutlus on asjakohane, loogiline, analüüsivõime ning seoste loomise oskus väga heal tasemel\nA - üliõpilane on iseseisvaks läbitöötamiseks antud materjali omandanud ning hankinud lisateadmisi ka soovituslikest materjalidest, osaleb diskussioonis aktiivselt, sh iseseisvalt küsimusi püstitades, tema arutlus on asjakohane, loogiline, analüüsivõime ning seoste loomise oskus silmapaistev\n\nColloquium\nIndependent reading for each class, participation in the class-room discussion\n\nE - The student has learnt the information from the reading material with gaps, participates in discussions only rarely, his or her ability to analyse and to create connections is only on elementary level\nD - The student has learnt most of the information from the reading material, participates in the discussion from time to time, being generally able to create connections and to analyse the problems, but being somewhat hesitant at that\nC - the student has learnt the information from the reading material, actively participates in the discussion, his or her utterances are generally to the point, he or she is able to present analysis and create connections\nB - the student has learnt the information from the reading material and acquired additional information from suggested materials, he or she actively participates in the class-room discussions, poses questions, his or her reasoning ist o the point, logical, the ability to create connections and present analysis is on a very good level\nA - the student has learnt the information from the reading materialand acquired additional information from suggested materials, he or she actively participates in the class-room discussions, põses questions, his or her reasoning ist o the point, logical, the ability to create connections and present analysis is on outsanting level"}}], "grade_preconditions": {"et": "Osalemine vähemalt 75% kollokviumidest; essee ja kaauste lahenduste tähtaegne esitamine.\nThe students have to participate at least in 75% of the classes; the essay has to be submitted on time; the exercises on the web-platform have to be submitted on time"}, "grade_evaluation": {"et": "Lõpphinde kujunemisel võetakse hinnet tõstva elemendina arvesse kollokviumidel diskussioonis osalemist; 40% ulatuses sõltub lõpphinne essee hindest ning 60% ulatuses eksamikaasuse hindest.\n\nFor the final grade participation in the class-room discussions will be taken into account as a bonus. The essay gives 40% and the written examination gives 60% of the final grade."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga, üldjuhul tuleb liiga suure puudumiste arvu korral kursus uuesti läbida. Essee hilinenud esitamisel langeb sellele antav hinne iga hilinetud päeva kohta ühe palli. Samuti langeb hinne ühe palli iga puuduoleva 1000 tähemärgi kohta nõutavast mahust.\n\nOnly as agreed with the lecturer. As a rule, when the number of allowed absence is exceeded, the course has to be taken anew. In case of delayed submission of the essay, the mark is lowered by one grade for each delayed day and by one grade for each missing 1000 letters in the text as compared to the required letter-count."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "3c2b459a-fb05-40c2-a2b3-3edcc18e3fda", "type": "MOODLE", "code": "OIAO.07.043", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "e161c60e-2449-6c51-09dd-afd5ca4bcd50", "person_name": "Sandra Võsaste", "structural_unit": {"code": "SVOI03", "name": {"en": "Department of Penal Law", "et": "karistusõiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "3f25c76c-46fe-5b1b-b3ad-717ab700e886", "person_name": "Andres Parmas", "structural_unit": {"code": "SVOI03TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI03"}, "is_responsible": true, "is_teaching": true}], "assistants": ["52fd96f0-1c6c-36d1-0878-33fe4713505f"]}, "schedule": {"weeks": {"et": "2, 8, 11, 13 - auditoorse õppetöö nädalad võivad muutuda. Sellest teatan osalejatele semestri jooksul piisavalt ette"}, "entries": [{"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus, ajalugu, rahvusvahelise kriminaalõiguse mõiste, allikad, piiritlemine\r\nIntroduction, history of icl, concept of icl, sources, delimitation"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Printsiibid, üldosa\r\nPrinciples, general part of icl"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Eriosa: genotsiid, inimsusevastased kuriteod\r\nSpecial part of icl: genocide, crimes against humanity"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Eriosa: sõjakuriteod, agressioon, muud rahvsuvahelised kuriteod\r\nSpecial part of icl: war crimes, aggression, other crimes"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Rahvusvahelised kriminaalkohtud \r\nInternational criminal courts"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Siseriiklikud kohtud, rahvusvahelistatud kohtud, tõe- ja leppimiskomisjonid\r\nNational and internationalized criminal courts, truth and reconciliation commissions"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Menetlus, rahvusvaheline koostöö \r\nProcedure, international cooperation"}}, {"course_week": 1, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {}, "description": {"et": "Kokkuvõttev kollokvium \r\nConcluding colloquium"}}]}, "registration_info": {"audience": {}, "min_students": 10}, "confirmation_process": {"confirmation_uuid": "ac2a8f88-d59b-a2ca-e6e0-9d557826068f", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "05653ac7-8054-d27d-35df-286596df581b", "parent_code": "OIAO.07.043", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}