{"uuid": "07ab349a-425f-fa9c-3e7f-0ba38c6727b7", "code": "OIAO.05.074", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Human Rights and Information Technology", "et": "Inimõigused infotehnoloogia valdkonnas"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "*\tWe live in a digital era and this requires adapting the legal system for the cyber 'realm'. \n*\tThe students should understand how the Internet works, who plays which role in Internet ecosystem, how it influences human rights, what challenges exist for the rule of law online. \n*\tThe course focuses on teaching how to use the European Convention for the Protection of Human Rights and Fundamental Freedoms (ECHR), other international legal instruments and case law of the European Court of Human Rights (ECtHR) in daily practice in cases related to Internet usage; it focuses on developing skills of identifying human rights in legal cases; and on interpreting and evaluating the national legal rules with regard to Internet;\n\nStructure:\no\tIntroduction to Internet eco-system            \no\tHuman Rights online        \no\tAccess and non-discrimination\no\tFreedom of expression and information      \no\tAssembly, association and participation     \no\tPrivacy and data protection\no\tEffective remedies             \n              \n* The structure will be adapted pursuant to the level of knowledge of participants.", "et": "*\tEksisteerime digitaalses ajajärgus ning see nõutab õigussüsteemi kohandamist küber \"alale\";\n*\tÜliõpilased peaksid mõistma, kuidas see uus reaalsus inimõigusi mõjutab ning millised on uued väljakutsed; \n*\tAine keskendub kohtunikud teadmiste andmisele selles, kuidas kasutada Euroopa Inimõiguste Konventsiooni, teisi rahvusvahelisi õigusinstrumente ning Euroopa Inimõiguste Kohtu praktikat igapäevases praktikas; aine keskendub selliste oskuste arendamisele, mis aitavad tuvastada inimõigused õiguskaasuses ning tõlgendada ning hinnata riiklike õigusreegleid arvestades internetiga.\n\nAine ülesehitus:\no\tSissejuhatus Interneti ökosüsteemi \no\tInimõigused digitaalses ühiskonnas \no\tÕigus ühendusele ning mittediskrimineerimine\no\tVäljendusvabadus \no\tÜhinemisvabadus \no\tPrivaatsus ja andmekaitse \no\tEfektiivsed õiguskaitsevahendid \n\n* Aine ülesehitus kohandub vastavalt ainest osavõtjate tasemele."}, "objectives": [{"en": "The objective of this course is to give students the knowledge and understanding of the conflict of human rights in the area of information technology based in the legislation of Council of Europe and the practice of European Court of Human Rights.", "et": "Aine eesmärk on anda üliõpilastele teadmised ning arusaam inimõiguste konfliktist infotehnoloogia valdkonnas Euroopa Nõukogu õigusloome ja Euroopa Inimõiguste Kohtu praktika näitel. "}, {"en": "On completion of this course the student will understand and know the instruments of European human rights in information technology, is able to critically analyze and evaluate the \"real life situations\" by identifying the relevant human rights and court practice in order to interpret the relevant legal norms.", "et": "Aine läbimisel mõistab ja teab üliõpilane, mis on Euroopa inimõiguste instrumendid infotehnoloogia valdkonnas; oskab kriitiliselt analüüsida ja hinnata \"päriselu situatsioone\" identifitseerides relevantsed inimõigused ning kohtupraktika tõlgendamaks relevantseid õigusnorme. "}, {"en": "On completion of this course, participants are able to:", "et": "Pärast aine läbimist on osaleja võimeline:"}, {"en": "(a) recall, comprehend and implement basic knowledge of Internet ecosystem of European human rights instruments in the Internet field, and of challenges to rule of law online;", "et": "(a) ära tundma, hoomama ja rakendama baasteadmisi interneti valdkonda kuuluvatest Euroopa inimõiguste instrumentest interneti süsteemis;"}, {"en": "(b) critically  analyse and evaluate 'real life situations', identify the relevant human rights and appropriate case-law of the ECtHR for interpreting legal provisions and their applications.", "et": "(b) kriitiliselt analüüsima ja hindama päris-elulisi situatsioone, tuvastama puudutatud inimõigused ja vastava Euroopa Inimõiguste Kohtu kohtupraktika tõlgendamaks õigusnorme ja nende kohaldamist."}], "learning_outcomes": [{"en": "In a course three different aspects of the learning process are distinguished:", "et": "Õppeprotsessis eristatakse kolme erinevat teadmiste omandamise aspekti:"}, {"en": "(a)\tKnowledge of the Council of Europe human rights instruments, relevant case-law of the ECtHR, specifics of legal relations across Internet and rule of law online;", "et": "(a) Teab Euroopa Nõukogu inimõiguste instrumente, relevantset Euroopa Inimõiguste Kohtu praktikat, õigussuhete spetsiifikat infotehnoloogia valdkonnas;"}, {"en": "(b)\tSkills in identifying a human rights issue, researching relevant legal rules to apply the law to a given situation and applicable case-law of the ECtHR;", "et": "(b) Oskab tuvastada inimõiguste problemaatika ning otsida relevantsed õigusreeglid ja Euroopa Inimõiguste Kohtu praktika, mida rakendada konkreetsele tegelikule olukorrale"}, {"en": "(c)\tValues: to commit oneself to values such as equality and non-discrimination, respect for human dignity, pluralism, tolerance and the rule of law.", "et": "(c) Mõistab väärtusi nagu võrdsus, mitte-diskrimineerimine, inimväärikuse austamine, pluralism, tolerantsus ja õigusriiklus"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}