{"uuid": "57ca933e-6104-f644-7038-9b1917d57401", "code": "OIAO.06.068", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "System and Method of Law", "et": "Õiguse süsteem ja meetod"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is offering an overview of the fundamental legal concepts, system and principles inherent for the Continental-European legal culture, including the concept of law and emergence of law, sources of law, legal norms, structure and system of legal order, legal relationships, realisation and implementation of law and using of legal entities in legal argumentation", "et": "Kursuse aineks on mandri-euroopalikule õiguskultuurile omaste põhimõistete, süsteemi ja printsiipide käsitlemine, sh õiguse mõiste ja tekke, õiguse allikate, õigusnormide, õiguskorra struktuuri ja süsteemi, õigussuhte olemuse ja tüüpide, õiguse realiseerimise ja rakendamise käsitlus ning kõige selle seos õigusliku argumentatsiooniga."}, "objectives": [{"en": "The general objective of the course is: \n1) to provide an overview of the fundamental legal concepts, types of norms, legal system, principles and legal forms, inherent for the Continental-European legal culture; \n2) to instruct students to think, scrutinize and use legal concepts, dogmatics and interpretation in well-structured manner; \n3) to lay down a theoretical basis for practical analysis of the situations having legal connotation, grounded on the theories, concepts and methodology of contemporary jurisprudence (in the broad meaning).", "et": "Anda süsteemne ülevaade mandri-euroopalikku õigus-kultuuri kuuluvatest õiguse põhimõistetest, normitüüpidest, süsteemist, printsiipidest ja vormidest; 2) õpetada üliõpilasi korrastatult mõtlema ja arutlema, tuginedes juriidilistele kategooriatele ja dogmaatikale; 3) anda teoreetiline alus õigust pälvivate olukordade praktiliseks analüüsiks ja normide tõlgendamiseks, lähtudes tänapäeva jurisprudentsi teooriatest, kategooriatest ja metodoloogiast."}], "learning_outcomes": [{"en": "The student, who has taken the course, has coherent understanding and knowledge about: \n- the origin of law as a social phenomenon; \n- the nature, sources and structure of the Continental-European legal culture; \n- the nature, structure and types of legal norms and the procedures and processes of the creation of legal norms; \n- the structure and system of the legal order as well as the basic principles of the democratic state of law; \n- the characteristics of legal relationships and the place of legal relationships in the regulation of human behaviour; \n- implementation of law as a part of the state power actions in realisation of law; \n- legal forms (incl. forms of contracts) at the digital age; \n- basics of giving proof and legal argumentation. \nThe student, who has taken the course, has the following skills: \n- capacity to define the basic concepts of the Continental- European legal culture; \n- capacity to analyse and define the elements of the contemporary concept of law; \n- to use the sources of law and describe the development of the sources of law in Continental Europe; \n- to assess the quality of legal norms according to the social implications of the norms and the relationship of the norm with the other legal norms in the system of the legal order; \n- to construct legal sentences in accordance with all formal requirements; \n- to analyse independently realisation of law and especially implementation of law in the concrete cases.", "et": "Üliõpilane, kes on aine läbinud, omab terviklikku ettekujutust ja teadmisi alloleva teemakava teemadest, sh: \n- õiguse kui sotsiaalse fenomeni kujunemisest; \n- mandri-euroopaliku õiguskultuuri olemusest, allikatest ja struktuurist; \n- õigusnormide olemusest, struktuurist ja tüüpidest ning õigusloome menetlustest ja protsessidest; \n- õiguskorra struktuurist ja süsteemist ning demokraatliku õigusriigi alustest ja põhimõtetest; - õigussuhete omadustest ja kohast inimkäitumise vahetul korrastamisel; \n- õiguse rakendamisest kui riiklik-võimualasest tegevusest õiguse realiseerimisel; \n- õiguse (sh tehingu) vormidest digiajastu kontekstis; \n- tõendamispõhise õigusliku argumenteerimise alustest.\n Aine läbinu oskab: \n- sisustada mandri-euroopaliku õiguskultuuri põhimõisteid; \n- analüüsida ja sisustada tänapäevase õiguse mõistesse kuuluvaid elemente; \n- kasutada õiguse allikaid ning tundma nende arenguid mandri-Euroopas; \n- hinnata õigusnormide kvaliteeti nii nende sotsiaalse sisu alusel kui ka õiguskorra enda süsteemset iseloomu aluseks võttes; \n- konstrueerida õiguslauseid teades nende aluseks olevaid formaalseid tingimusi; \n- iseseisvalt analüüsida ja hinnata õiguse realiseerimist, eriti õiguse rakendamist konkreetsetes kaasustes"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}