{"uuid": "c2268e05-5538-e953-c0ff-ea4b05437911", "code": "sv-2018-autumn-fulltime-c6-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "History and Theory of International Law", "et": "Rahvusvahelise õiguse ajalugu ja teooria"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "18/19 A regular SV Eng", "et": "18/19 S PÕ SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 142, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "86b8d1f8-ffa4-71eb-bf52-f8ed480fd87f", "code": "P2OG.02.156", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "f931a25a-73b1-a954-b808-72a6af66d26d", "code": "P2OG.02.070", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "General Course on International Law", "et": "Rahvusvahelise õiguse põhikursus"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "b0de99d2-3021-2b15-f2c7-3ad4e63207cf", "code": "OIAO.07.025", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basic Course on International Law", "et": "Rahvusvahelise õiguse põhikursus"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "a49a7d97-c7c5-073c-9588-d8ffb68640ed", "code": "OIAO.07.075", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "In seminars, various texts related to the history and theory of international law are discussed, on the basis of which the student will writes an original essay in the end.\nThe seminar is meant for students who are interested in theory and history of international law. It is not necessarily an easy seminar because some of the readings are quite heavy. In any case, you should tune yourself in the mood of continuous work from September to December.", "et": "Aines toimuvate seminaride jooksul käsitletakse erinevaid rahvusvahelise õiguse ajalugu ja filosoofiat puudutavaid tekste, millest inspireerituna kirjutab tudeng lõpuks essee.\nTegemist on teoreetilise suunitlusega seminariga, mille eesmärgiks on aidata paremini mõista rahvusvahelise õiguse olemust ja kaasaegseid suunitlusi rahvusvahelise õiguse teoorias, metodoloogias ning filosoofias. Käsitletakse ka rahvusvahelise õiguse ajaloo probleeme. Seminar on eelkõige mõeldud neile tudengitele, kes soovivad süvendatult tegeleda rahvusvahelise õiguse probleemidega ning vajavad magistri- või doktoritöö kirjutamiseks tugevat üldteoreetilist ettevalmistust."}, "objectives": [{"en": "The aim of the course is make students familiar with the historical development of public international law and its science and to introduce them to the philosophical  and methodological problems of the discipline.", "et": "Õppeaine eesmärk on tutvustada üliõpilastele rahvusvahelise õiguse (ja selle teaduse) ajaloolist kujunemislugu, samuti selle distsipliini filosoofilisi ja metodoloogilisi põhiprobleeme."}, {"en": "The main purpose of the course is to give to the students an in-depth knowledge of the history and theory of international law. After this course, you should without difficulties be able to follow discussions on similar topics in leading globally oriented law schools.", "et": "Kursuse eesmärk on anda tudengitele võimalikult laiapõhjaline ja maailmas konkurentsivõimeline teadmine rahvusvahelise õiguse teooriast ja ajaloost."}], "learning_outcomes": [{"en": "Upon the completion of the course the student should be able to orientate himself/herself in fundamental questions of international law and understand better what is \"behind\" the debates, solutions and individual problems of international law.", "et": "Õppeaine läbimisel peaks üliõpilane orienteeruma rahvusvahelise õiguse üldistes; küsimustes ja mõistma paremini, mis on rahvusvahelise õiguse debattide, lahenduste ning üksikprobleemide \"taga\"."}], "notes": {"et": "... 8.11 seminar questions: How does Onuma see the 'treaties' that European powers concluded with the Africans in the later 19th century? What was the main importance of the China-Japan peace treaty of 1895 in the history of international law? What does Onuma mean when he criticizes the Eurocentrism of the history writing of international law?\n\nBakalaureuseastmes lubatud üksnes 3.aasta üliõpilastele, registreerimiseks palun saata e-mail merike.vellend@ut.ee.\nÜleülikoolilisi doktorante registreerib ainele Katri Holst (katri.holst@ut.ee)."}}, "grading": {"independent_work": {"et": "- Independent work with study materials\n - Writing a research paper\nIn the research paper, the student analyses critically one problem related to the history and/or theory of international law. The selected problem should be registered electronically (lauri.malksoo@ut.ee) by 1 December 2016. The instructor may ask the student to choose another problem if the chosen problem is not suitable or too many students have already chosen the same problem. The paper should be submitted electronically (lauri.malksoo@ut.ee) as a Word-file no later than on 15 January 2017 at 12:00 (noon). For every started overdue day, the result will be decreased by four points, but papers which are late more than four days are not accepted and the student would not pass the course. The instructor cannot consider papers sent by email.\nThe paper must include title page, table of content, main body and list of used materials. For references, use footnotes. The length of main text (starting from the introduction and ending with the conclusion, excluding footnotes) should be 2000-2500 words. Shorter papers are not accepted or the result is lowered by the discretion of the instructor.\nIndependent identification of clear issues and legal problems is very important. Also, the use of different sources and supportive materials. All used sources must be referred to. In case of internet sources, the full address is necessary, not only the main domain (e.g. www.un.org). A paper based on copy-paste method leads to negative results for both the paper and the exam."}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Research paper\nCriteria\nConsistency, completeness and correctness of the answers to theoretical questions\nCreativeness and consistency of the solutions to hypothetical cases \nDepth of the analysis of problems and applicable norms and principles\nAssociation of theory with state and court practice\nStructure, grammar and formatting\nGrades\nA\tAnalysis of legal problems is detailed and innovative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]\nB\tAnalysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC\tAnalysis of legal problems is good with some deficiencies concerning specific issues; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]\nD\tAnalysis of legal problems is satisfactory with deficiencies is most aspects; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]\nE\tAnalysis of legal problems is shallow with significant deficiencies is most aspects; overall, the coverage of the subject suffers of superficial treatment, poor knowledge of law and unsound presentation [51-60 points]"}}], "grade_preconditions": {"et": "Participation in all classes. It is allowed to miss maximum 3 classes out of 16 but each time the instructor must be informed beforehand.\nIf a student did not participate in the class/seminar, he/she must submit, within a week, a one-page response paper to the material discussed in the particular seminar. Each late submission of a summary decreases the final points by three points.\nTimely submission and positive evaluation of a research paper."}, "grade_evaluation": {"et": "Class attendance and participation (40 points)\n - Attendance\n - Activism and quality of participation\nResearch paper (60 points)"}, "debt_elimination": {"et": "In accordance with the Study Regulations and in consultation with the course instructor"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "03cccadc-e384-4c91-90e5-62ebf5f6dedc", "type": "MOODLE", "code": "OIAO.07.064_Eng", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Materials will be provided in SIS.", "recommended_materials": "Books\nWilhelm Grewe, The Epochs of International Law (Berlin: De Gruyter, 2000)\nSusan Marks (ed.), International Law on the Left: Re-examining Marxist Legacies (Cambridge University Press, 2011)\nYasuaki Onuma, A Transcivilizational Perspective on International Law (Leiden: Brill, 2010)\nOther materials\nSymposium on Method in International Law, AJIL, April 1999."}, "participants": {"lecturers": [{"person_uuid": "67f1346b-205b-ed69-56f1-9e5be48bc597", "person_name": "Lauri Mälksoo", "structural_unit": {"code": "SVOI02TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "9,11,12,13,14,16"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "History of international law: A Transcivilizational Perspective\nTo read: Y. Onuma, A Transcivilizational Perspective on International Law, Martinus Nijhoff Publisher, 2010, pp 266-369.\nQuestions: What were political entities like in pre-modern times and how did they differ from contemporary (or modern) sovereign states? Correspondingly, how was 'international law' different back then? Further, do you agree with Onuma's position that in order to characterize something as law it needs a shared normative consciousness between the parties (p 282)?  How was the European international law 'spread' around the world (p 286)? What, according to Onuma, needs to be studied more in this context (pp 287-8)? Concerning the Muslim world, what is siyar and how was the relationship with non-Muslim world seen? (p 290-1)? How did Sultan Suleiman understand his 'treaty' with France concluded in 1536 (p 293-4)? How did the meaning of consular jurisdiction transform over time in Muslim lands (p 294)? In Europe, how did the just war doctrine relate to non-Christians (p 296)? What did Vitoria argue in De indis (p 298-9)? What was the project of Grotius in De jure belli ac pacis and what helped the 'timing' of his work (p 301)? What significance does Onuma attribute to the independence of the US and, later, Latin American countries (p 303)? What was characteristic to the Sinocentric tribute system in East Asia (p 306-7? How was it different from European/Christian and Muslim regional orders (p 310)? Was pacta sunt servanda understood as universally applicable rule since ancient times (p 315-6)? How does Onuma evaluate the 1793 encounter between Macartney and Ch'ien-lung (p 317-8)? Was there 'international law' in contemporary sense in 1793 then? How did the inclusion of the Ottoman Empire in jus publicum europaeum work out (p 321-2) and what role did the Peace Treaty of Paris of 1856 play? What was the role of the Berlin conference of 1884-1885? Continues in \"muu info\"."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Hugo Grotius\nTo read: Hugo Grotius on the Law of War and Peace. Student edition. Edited and annotated by S. Neff, Cambridge University Press, 2012, pp xiii-19 and M. J. van Ittersum, 'Hugo Grotius. The Making of a Founding Father of International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 82-100."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "US and China in the history of international law\nTo read:  M. Janis, 'North America: American Exceptionalism in International Law', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 525-552; Chi-hua Tang, 'China-Europe', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 701-723 and T. Ruskola, 'China in the Age of the World Picture', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 138-155."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "TWAIL and Marxist Approaches to International Law\nTo read: A. Anghie, 'Imperialism and International Legal Theory', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 156-172 and R. Knox, 'Marxist Approaches to International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 306-326.\n Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 306-326."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Kelsen and Schmitt\nTo read: J. von Bernstorff, 'Hans Kelsen and the Return of Universalism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 192-211 and R. Howse, 'Schmitt, Schmitteanism and Contemporary International Legal Thought', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 212-230."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Realism\nTo read: O. Jütersonke, 'Realist Approaches to International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 327-343."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "International legal positivism\nTo read: J. Kammerhofer, 'International Legal Positivism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 407-426."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "New Haven School\nTo read: H. Saberi, 'Yale's Policy Science and International Law: Between Legal Formalism and Policy Conceptualism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 427-451."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Feminist Approaches to International Law\nTo read: D. Otto, 'Feminist Approaches to International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 488-504."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Comparative international law\nTo read: A. Roberts et al, 'Comparative international law: framing the field', 109 AJIL 2015, pp 467-474."}}]}, "registration_info": {"audience": {"et": "Valikaine - TÜ doktorandid, õigusteaduskonna MA ja BA 3.a, foreign students"}, "min_students": 10, "max_students": 40}, "parent_uuid": "d5934e8b-d867-7e3b-484a-5e1c0c1237b9", "parent_code": "OIAO.07.064", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}