{"uuid": "60c8d103-fd21-61a0-4872-f3fd95c80db0", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-03T15:09:14", "title": {"en": "Public E-Services", "et": "Avalikud e-teenused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 20, "practice": 4, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 44, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "3dada822-0c69-5401-3594-cc7ee3ce0054", "code": "OI00.00.003", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "3dec95b2-2c88-c86f-c7c6-23b73806dc18", "code": "OI00.00.002", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "d0189a81-62f9-c1df-7f42-317da901e0da", "code": "P2OG.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "8d54607c-6f02-53df-0b37-8c456c3ded63", "code": "P2OG.00.003", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}]}, {"required": false, "uuid": "defbedc1-10a5-5ae1-745f-6529b818c3b3", "code": "OIAO.06.060", "title": {"en": "Fundamentals of ICT", "et": "IKT alused"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Majority of the modern services consist of people, processes and products (technology in general). The responsibility of e-service owner is to understand the organizational culture and wider environment, people's behavior, attitude and skills, also realize the basics of process management and business process analysis, also know the architecture of IT (infrastructure) as well as the importance of information security. Each service must have utility and warranty. It means that each service must support users (business) process as well as should be available on agreed time. The service is valuable only then the both requirements (utility and warranty) are fulfilled. \n\nConsidering that, value expectations will change over the time and circumstances, the services must be continuously developed and managed effectively and efficiently. Service development is responsible for creating or changing services according to the user's needs and service management means primarily the maintenance of hardware, software and data and resolving the user request (Service Desk).\n\nThe course covers the public sector use of services as well as familiarizes students with the concepts of e-governance and public administration of ICTs. It maps the concepts of project management and process management as well as applicable legal regimes, also teaches the techniques of business process analysis for process improvements. Furthermore, the course introduces the best practices of service management and support developing understanding of user-friendly, trusted and economically efficient public sector presence online. The course has a practical outcome, where by the end of the course students present a service ptotoype on paper as a result of groupwork.", "et": "Valdav osa tänapäevastest teenustest koosneb inimeste, protsesside ja tehnoloogia kombinatsioonist. E-teenuse toimimise eest vastutaja peab aru saama organisatsiooni kultuurist ja laiemast taustsüsteemist, inimeste oskustest, suhtumisest ja käitumisest, valdama protsessijuhtimise põhitõdesid ja ärianalüüsi tehnikaid (nii kliendi töö- kui IT haldusprotsessid) ning mõistma ka IKT taristu ülesehitust ja valdkondade üleselt infoturbe olulisust. Iga teenus peab olema eesmärgipärane ja kasutatav, see tähendab, toetama kasutaja tööprotsessi ja kättesaadav kokkulepitud ajal. Väärtuslik on teenus kasutajale juhul, kui mõlemad tingimused on täidetud.\n\nArvestades, et kasutajate ootused teenustele ajas ja tingimustes muutuvad, siis vajadustele vastamiseks tuleb teenuseid efektiivselt ja tõhusalt arendada, käimas hoida (hallata) kui ka majutada. Teenuste arendamine vastutab teenuse, infosüsteemi või tarkvara loomise või muutmise eest, ja -haldamine tähendab eelkõige vajaliku riistvara ja rakenduste majutamist ning hooldamist ning kasutajate pöördumiste lahendamist (kasutajatugi).\n\nKursus tutvustab avaliku sektori e-teenuste loomist, kasutamist ja valitsemisest. Kursus käsitleb nii projekti- kui protsessijuhtimisest ja kohalduvaid regulatsioone ning arendab teadmisi IT-teenuste juhtimise parimatest praktikatest. Kursus arendab teadmisi kasutajasõbralikest, usaldusväärsetest ja majanduslikult tõhusatest avalikest e-teenustest. Kursus on praktilise suunitlusega, kus kursuse lõpuks valmib grupitööna uhe valitud teenuse disaini paberil prototüüp."}, "objectives": [{"en": "This course is designed to give an overview of the interaction and communications principles of public e-services as well as their legal regulation.", "et": "Kursus annab ülevaate avalikest e-teenustest, nende loomis- ja haldusprotsessist ja kaasnevast seadusandlusest."}], "learning_outcomes": [{"en": "1. Student understands the lifecycle of developing and managing services and necessary inputs for value creation.", "et": "1. Tudeng mõistab teenuste arendamise ja haldamise elutsüklit ning väärtuse loomise eelduseid."}, {"en": "2. Student knows how to map the service stakeholders and their personas while using the service", "et": "2. Tudeng oskab kaardistada teenust kasutavad huvigrupid ja kirjelda nende teekonda teenuse kasutamisel. "}, {"en": "3. Student can create the process flowchart describing the \"as is\" and \"to be\" situation by using BPMN language. ", "et": "3. Tudeng oskab luua protsessi joonist olemasoleva ja soovitud tuleviku olukorra kirjeldamiseks BPMN märgikeeles."}, {"en": "4. Student can recognize and define the main characteristics of most commonly used Project management methods.", "et": "4. Tudeng teab, mis on projekt, projektijuhtimine ja erinevate peamiste projektijuhtimise metoodikad."}, {"en": "5. In a group students successfully use SCRUM Project management method to decompile, the initial project task into backlog with themes and defined user stories. ", "et": "5. Tudeng oskab koostada SCRUM meetodil projekti koos vastavate kasutuslugude ja visuaalse teostusega. "}, {"en": "6. Student is aware of applicable European and national legislation concerning public e-services and knows how to analyze the effect of the regulations.", "et": "6. Tudeng on teadlik e-teenuseid enim mõjutavatest Euroopa Liidu regulatsioonidest ja riigisisesest õiguskorrast ning oskab analüüsida regulatsioonide mõju."}], "notes": {}}, "grading": {"independent_work": {"et": "More detailed instructions will be given at the lectures. All templates will be available in Moodle and all assignments must be submitted (uploaded) to Moodle.\n\nService Development Idea - One Pager \nDetailed instructions will be given in the class. Individual work.\nDeadline: 10.09.2024 23:55:00 in Moodle.\n\nProject Management Test (Moodle) based on independent reading. Individual work.\nDeadline: 18.09.2024 17:00-19:00 Moodle.\n\nThree Personas Value Proposition Description \nDescription details is given in the lecture. Group work (up to 4 people).\nDeadline: 22.09.2024 23:55:00 Moodle.\n\nProject Management Seminar Work\nGroup work (up to 4 people). Must be submitted in the seminar or latest by TBA via Moodle. \n\nLegal Regulation Analysis\nLegal analysis of the e-service. What are the main requirements on EU/national level that the e-service development and product team needs to keep in mind while developing the e-service (e.g. authentication requirements (eIDAS Regulation), electronic signature requirements (eIDAS Regulation), cybersecurity requirements (NIS Directive), data sharing and processing (GDPR), accessibility (Web Accessibility Directive), cross- border usage (SDG Regulation)). What is the aim of the e-service and what is the legal base? The legal framework overview will be given in the seminar and the task is to pinpoint the main requirements that are applicable for the specific service. National legislative framework is not a must and the analysis document is more of an overview of best practices and recommendations than a description of concrete articles.\nFrom 5-7 pages (1,5 lines, 12 Times New Roman), group work (up to 4 people). \nDeadline: 20.10.2024 23:55:00 Moodle.\n\nE-Service blueprint and process flowchart \nComplete e-service development proposal (one final combined document, consisting of all the previous parts), group work (up to 4 people) on a given template. Max 12-15 pages (1,5 lines, 12 Times New Roman) + as is and to be process flowcharts (separate file, 1+1 pages). \nDeadline: 31.10.2024 23:55:00 Moodle.\n\nFinal Test\nDeadline: 16.11.2024 9:00 Moodle. More information will be given. One try only."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "TESTS\nProject Management Test (10 points) should be done before the project management lecture and it tests your basic knowledge based on reading material. Test will be open for submissions on Moodle during a period of 2 h. During that time student has a chance to retake the test 3 times until he/she reaches minimum of 5 points. If he/she doesn't' reach these points during that time, then achieved points will be counted.\nDate: TBA in Moodle.\n\nFinal Test\nThe Final test is 20 points of final assessment result. Test is in online, written format, closed materials and has 20 questions and multiple-choice answers (each right answer gives you 1 point).\nDate: TBA in Moodle. One try only."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "ASSIGNMENTS:\nService Development Idea - One Pager\n10 points will be given accordingly: one page development proposal, including overall idea related to higher socio-economical goals or challenges (2 points), the list of the problems (3 points) and measuable results descriptions (3 points); and 1-2 minutes presentation/pitch (2 points).\nNote: 80% of the points will be given shortly after the submission and 20% after the e-blueprint submission at the end of the course.\n\nThree Personas Value Proposition Description\nEach Persona description gives you 3 points, extra 1 point is given for overall clarity and diversity. Description details is given in the lecture.\nNote: 80% of the points will be given shortly after the submission and 20% after the e-blueprint submission at the end of the course.\n\nLegal Regulation Analysis will be graded as follows:\n20 points will be given if the analysis gives sophisticate application of analytical and evaluative skills, there are references used and the analysis of the reasons and consequences of legal framework for the owners of e-services is justified and accompanied with own thoughts and ideas about the pros and cons of the framework in place.\n15 points will be given if the analysis gives sound application of analytical and evaluative skills, there are references used and the analysis of the reasons and consequences of legal framework for the owners of e-services is justified. There is no or little input of own thoughts and ideas about the pros and cons of the framework in place.\n10 points will be given if the analysis gives application of analytical or evaluative skills, but there are few references used and there is no or little input of own thoughts and ideas about the pros and cons of the framework in place.\n5 points will be given if the analysis gives little application of analytical or evaluative skills. There are a few references used and there is no input of own thoughts and ideas.\n0 points will be given if the analysis gives no application of analytical or evaluative skills or is not handed in.\nNote: 80% of the points will be given shortly after the submission and 20% after the e-blueprint submission at the end of the course.\n\nE-Service blueprint and process flowchart will be graded as follows:\n20% of the points of the revision of previously submitted assignments to be sure of the comprehensivity of the development idea in general\n- One pager\n- Personas description\n- Legal regulation analysis\n\nAnd 20 points will be given accordingly:\n- Risk analysis (5 points)\n- Cost-Benefit Analysis (5 points)\n- AS IS and TO BE process flowcharts (3+3 points)\n- Data Exchange Description (2 points)\n- Marketing and Communication Plan (2 points)"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "The main idea is to compose a practical and comprehensive service development idea (e-service blueprint) consisting of separate assignments (70 points in total) and 2 tests (30 points in total).\n\nThe final grade will consist of the following parts with the following points:\n1. Service Development Idea - One Pager (10 points)\n2. Project Management basics Test (Moodle) (10 points)\n3. Project Management seminar work (10 points)\n4. Three Personas Value Proposition Description (10 points)\n5. Legal Regulation Analysis (20 points)\n6. E-Service blueprint and process flowchart (20 points)\n7. Final Test (20 points)\n\nAssignments number 1, 2 and 7 are done individually, and assignments 3 to 6 as group works (up to 4 people);\n\nDetails of homework and deadlines of submission will be specified in the lecture.\n\nAssessment criteria that is taken into account for student homework:\nAnalysity and ability to create connections;\nConsistent and logical use of subject;\nCorrect formatting that is meeting the criteria;\nRelevance and scope of references .\n\nAll submissions must include an overview of the contribution of each group member. Each participant of the group is expected to make a significant and equal contribution to the quality of the final submission. Since the equal contribution of every participant in the group must become evident from the submission, the group is expected to describe how they collaborated in a separate section of each homework.\nAll members of the group will receive the same score. In a situation where it becomes evident that one member of the group has contributed significantly less to the overall result in comparison to other members of the group, the scores of the participants may differ. These descriptions do not count towards the capacity of the homework task."}}], "grade_preconditions": {"et": "All homeworks must be submitted (uploaded) to Moodle.\n\nSubmission file name must include the last names of the group members. The header in the file must include the names of all the group members."}, "grade_evaluation": {"et": "Final assessment result combines homeworks, active participation in lectures and seminars and tests. \n\n* A: 91 points or more.\n* B: 81-90 points\n* C: 71-80 points\n* D: 61-70 points\n* E: 51-60 points\n* F: 50 or less points"}, "debt_elimination": {"et": "According to Study Regulations (Õppekorralduseeskiri)\n\nDelay in submitting Assignments of up to each 24 h will result in deduction of 10% of total points in said assignment, that applied to each student individually or as a group, depending on the assignment.\n\nProject Management Test and Assignments are not subject to retakes. Final Test is subject to retake according to Study Regulations."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "b3da830f-e1a2-410d-938c-33377dd2a89a", "type": "MOODLE", "code": "OIAO.05.071_Eng", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Compulsory study materials are in Moodle.\n1. https://e-estonia.com/components/ \n2. https://e-estonia.com/wp-content/uploads/2014/04/Digital-Agenda-2020_Estonia_ENG.pdf", "recommended_materials": "1. https://www.mkm.ee/en/objectives-activities/information-society \n2. https://www.ria.ee/en/\n3. Manifesto for Agile Softare Development: http://agilemanifesto.org/\n4. The Scrum Guide: https://www.scrumalliance.org/why-scrum/scrum-guide\n5. M.Dumas, M. La Rosa, J. Mendling, H.A.Reijers \"Fundamentals of Business Process Management\": https://link.springer.com/book/10.1007%2F978-3-642-33143-5\n6. Ministerial Declaration on eGovernment - the Tallinn Declaration: https://ec.europa.eu/digital-single-market/en/news/ministerial-declaration-egovernment-tallinn-declaration\n7. Directive (EU) 2016/1148 of the European Parliament and of the Council of 6 July 2016 concerning measures for a high common level of security of network and information systems across the Union\n8. Directive (EU) 2016/2102 of the European Parliament and of the Council of 26 October 2016 on the accessibility of the websites and mobile applications of public sector bodies\n9. Regulation (EU) No 910/2014 of the European Parliament and of the Council of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC\n10. Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC"}, "participants": {"lecturers": [{"person_uuid": "0bc780ad-e86b-2f39-bdc3-56bdd9d47320", "person_name": "Martin Öövel", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "aa3f5ac7-cc9c-0e74-105c-105776c2c80c", "person_name": "Laura Kask", "structural_unit": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "2f79da86-11ce-a0b2-549d-1581f56abcf0", "person_name": "Evelin Kasenõmm", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2024-09-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "e-Estonia and Service Management basics (2L, Kasenõmm)"}}, {"time": "2024-09-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Service Development & Process management basics (2L, Kasenõmm)"}}, {"time": "2024-09-12", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Pitching Session"}}, {"time": "2024-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Service Design: Stakeholders Value proposition (Kasenõmm)"}}, {"time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Project Management (2L, Öövel)"}}, {"time": "2024-09-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Project Management (2S, Öövel)"}}, {"time": "2024-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Regulation of Public e-Services (2L, Kask)"}}, {"time": "2024-10-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Regulation of Public e-Services (2S, Kask)"}}, {"time": "2024-10-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Process Management: e-service blueprinting (2L, Kasenõmm)"}}, {"time": "2024-10-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Process Management: e-service blueprinting (1S, Kasenõmm)"}}]}, "registration_info": {"audience": {}, "min_students": 0, "max_students": 20}, "parent_uuid": "9cb46672-f59b-89ac-71b6-b2b155369577", "parent_code": "OIAO.05.071", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}