{"uuid": "0725ed82-abf0-6056-a485-83585b4d82c1", "code": "OIAO.05.056", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Lawyer's Professional Ethics", "et": "Juristi kutse-eetika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course the lawyers will study ethical basis of professional activity. Concerning the specific role and function in the society of each lawyer's profession (judge, attorney, public prosecutor and others) the meaning of professional ethics and its role by achieving the aims in the process of administration of justice will be introduced.", "et": "Kursuse raames õpetatakse juristi kutsetegevuse eetilisi aluseid. Tulenevalt konkreetse juristi elukutse (kohtuniku, advokaadi, prokuröri) spetsiifilisest rollist ja funktsioonist ühiskonnas tutvustakse kutse-eetika tähendust ja osa õigusemõistmise protsessi ja ühiskonna eesmärkide saavutamisel."}, "objectives": [{"en": "To get knowledge about the different professional roles of lawyers and professional ethical behavior. During the course, the the role of professional ethics in general and specific requirements of professional practice are introduced. Considering the specific role and function of lawyers in the process of justice in society, role responsibilities of law professions (judge, advocate, public prosecutor, compliance officer, lawyer in public service) in public and private practice are introduced.", "et": "Omandada teadmised juristi tegevuse eri rollidest ja kutse-eetilisest käitumisest. Kursuse raames saadakse ülevaade kutse-eetika rollist ning üld- ja spetsiifilistest nõuetest kutsepraktikas. Tulenevalt juristi tegevuse spetsiifilisest rollist ja funktsioonist ühiskonnas tutvustakse kutse-eetika tähendust ja osa õigusemõistmise protsessi eesmärkide saavutamisel. Kursuse raames peatutakse juristi erinevate kutsetegevuste nõuetel nii avalikus kui erasektoris (kohtunik, prokurör, notar, advokaat, vastavusametnik, jurist avalikus teenistuses)."}], "learning_outcomes": [{"en": "1.To obtain a knowledge of lawyer's professional ethics comparing to ordinary morality\n2.To obtain a knowledge of differennces of lawyers professional morality in different legal environment;\n3.To understand differences of ethics expectations towards law professions;\n4.To frame a personal understanding of main concepts in lawyers professional ethics like independence; autonomy; loyalty; privacy; confidentiality, conflict of interest.\n5.To obtain a knowledge of ethics normative expectations of law professions;\n6.To form students own independent and personal view of the professional behaviour - communication with the customer, communication with other parties to a proceeding, self-removal from procedure.", "et": "Kursuse läbinud üliõpilane:\n1. omab põhiteadmisi kutse-eetika põhimõtetest ja erinevustest võrreldes tavamoraaliga;\n2. selgitab kutse-eetika erisusi erinevates õiguskordades;\n3. omab põhiteadmisi juristi kutse-eetika spetsiifikast;\n4. on kujundanud isikliku arusaamise ja ettekujutuse juristi kutse-eetika kesksetest mõistetest - sõltumatus, autonoomia, lojaalsus, privaatsuse kaitse, konfidentsiaalsus, huvide konflikt jm\n5. omab teadmisi juristi erinevate kutsepraktikate eetilistest printsiipidest.\n6. on kujundanud isiklikud põhimõtted juristi elukutsele esitatavatest käitumisreeglitest - suhtlemine kliendiga, suhtlemine teiste protsessiosalistega, enesetaandamine menetlusest jm.\n7. omab teadliku karjäärivaliku tegemiseks vajalikke kutse-eetika alaseid teadmisi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}