{"uuid": "9cb46672-f59b-89ac-71b6-b2b155369577", "code": "OIAO.05.071", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Public E-Services", "et": "Avalikud e-teenused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "3dada822-0c69-5401-3594-cc7ee3ce0054", "code": "OI00.00.003", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "3dec95b2-2c88-c86f-c7c6-23b73806dc18", "code": "OI00.00.002", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "d0189a81-62f9-c1df-7f42-317da901e0da", "code": "P2OG.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "8d54607c-6f02-53df-0b37-8c456c3ded63", "code": "P2OG.00.003", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}]}]}, "overview": {"description": {"en": "Majority of the modern services consist of people, processes and products (technology in general). The responsibility of e-service owner is to understand the organizational culture and wider environment, people's behavior, attitude and skills, also realize the basics of process management and business process analysis, also know the architecture of IT (infrastructure) as well as the importance of information security. Each service must have utility and warranty. It means that each service must support users (business) process as well as should be available on agreed time. The service is valuable only then the both requirements (utility and warranty) are fulfilled. \n\nConsidering that, value expectations will change over the time and circumstances, the services must be continuously developed and managed effectively and efficiently. Service development is responsible for creating or changing services according to the user's needs and service management means primarily the maintenance of hardware, software and data and resolving the user request (Service Desk).\n\nThe course covers the public sector use of services as well as familiarizes students with the concepts of e-governance and public administration of ICTs. It maps the concepts of project management and process management as well as applicable legal regimes, also teaches the techniques of business process analysis for process improvements. Furthermore, the course introduces the best practices of service management and support developing understanding of user-friendly, trusted and economically efficient public sector presence online. The course has a practical outcome, where by the end of the course students present a service ptotoype on paper as a result of groupwork.", "et": "Valdav osa tänapäevastest teenustest koosneb inimeste, protsesside ja tehnoloogia kombinatsioonist. E-teenuse toimimise eest vastutaja peab aru saama organisatsiooni kultuurist ja laiemast taustsüsteemist, inimeste oskustest, suhtumisest ja käitumisest, valdama protsessijuhtimise põhitõdesid ja ärianalüüsi tehnikaid (nii kliendi töö- kui IT haldusprotsessid) ning mõistma ka IKT taristu ülesehitust ja valdkondade üleselt infoturbe olulisust. Iga teenus peab olema eesmärgipärane ja kasutatav, see tähendab, toetama kasutaja tööprotsessi ja kättesaadav kokkulepitud ajal. Väärtuslik on teenus kasutajale juhul, kui mõlemad tingimused on täidetud.\n\nArvestades, et kasutajate ootused teenustele ajas ja tingimustes muutuvad, siis vajadustele vastamiseks tuleb teenuseid efektiivselt ja tõhusalt arendada, käimas hoida (hallata) kui ka majutada. Teenuste arendamine vastutab teenuse, infosüsteemi või tarkvara loomise või muutmise eest, ja -haldamine tähendab eelkõige vajaliku riistvara ja rakenduste majutamist ning hooldamist ning kasutajate pöördumiste lahendamist (kasutajatugi).\n\nKursus tutvustab avaliku sektori e-teenuste loomist, kasutamist ja valitsemisest. Kursus käsitleb nii projekti- kui protsessijuhtimisest ja kohalduvaid regulatsioone ning arendab teadmisi IT-teenuste juhtimise parimatest praktikatest. Kursus arendab teadmisi kasutajasõbralikest, usaldusväärsetest ja majanduslikult tõhusatest avalikest e-teenustest. Kursus on praktilise suunitlusega, kus kursuse lõpuks valmib grupitööna uhe valitud teenuse disaini paberil prototüüp."}, "objectives": [{"en": "This course is designed to give an overview of the interaction and communications principles of public e-services as well as their legal regulation.", "et": "Kursus annab ülevaate avalikest e-teenustest, nende loomis- ja haldusprotsessist ja kaasnevast seadusandlusest."}], "learning_outcomes": [{"en": "1. Student understands the lifecycle of developing and managing services and necessary inputs for value creation.", "et": "1. Tudeng mõistab teenuste arendamise ja haldamise elutsüklit ning väärtuse loomise eelduseid."}, {"en": "2. Student knows how to map the service stakeholders and their personas while using the service", "et": "2. Tudeng oskab kaardistada teenust kasutavad huvigrupid ja kirjelda nende teekonda teenuse kasutamisel. "}, {"en": "3. Student can create the process flowchart describing the \"as is\" and \"to be\" situation by using BPMN language. ", "et": "3. Tudeng oskab luua protsessi joonist olemasoleva ja soovitud tuleviku olukorra kirjeldamiseks BPMN märgikeeles."}, {"en": "4. Student can recognize and define the main characteristics of most commonly used Project management methods.", "et": "4. Tudeng teab, mis on projekt, projektijuhtimine ja erinevate peamiste projektijuhtimise metoodikad."}, {"en": "5. In a group students successfully use SCRUM Project management method to decompile, the initial project task into backlog with themes and defined user stories. ", "et": "5. Tudeng oskab koostada SCRUM meetodil projekti koos vastavate kasutuslugude ja visuaalse teostusega. "}, {"en": "6. Student is aware of applicable European and national legislation concerning public e-services and knows how to analyze the effect of the regulations.", "et": "6. Tudeng on teadlik e-teenuseid enim mõjutavatest Euroopa Liidu regulatsioonidest ja riigisisesest õiguskorrast ning oskab analüüsida regulatsioonide mõju."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}