{"uuid": "c8629bea-3fab-6c51-aa39-3706790fcf00", "code": "OIAO.06.050", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Information Literacy", "et": "Infopädevuse alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVHV", "structural_unit_name": {"en": "Dean's Office, Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkonna dekanaat"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVHV", "name": {"en": "Dean's Office, Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkonna dekanaat"}, "email": "hv.dekanaat@ut.ee", "phone": "+372 737 5341", "webpage_url": "https://humanitaarteadused.ut.ee", "address": "Jakobi 2, r 116-121\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, r 116-121", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course discusses the following themes: Overview of scientific information sources. Databases. Principles and strategy of information search. Search in the e-catalogue ESTER and in the Estonian articles databases. Research databases accessible for the University of Tartu. Search in different search environments. Information search on the Internet. Evaluation of the quality of information sources. Avoiding plagiarism.", "et": "Kursusel käsitletakse järgmisi teemasid: Ülevaade teadusinformatsiooni allikatest. Infootsingu põhimõtted ja strateegia. Otsing e-kataloogis ESTER ja Eesti artiklite andmebaasides.  Tartu Ülikoolile avatud teadusandmebaasid. Otsing erinevates otsikeskkondades. Infootsing Internetis. Infoallikate kvaliteedi hindamine. Plagiaat ja selle vältimine."}, "objectives": [{"en": "The aim of the course is to offer knowledge and practical skills in searching professional scientific  information from electronic information sources.", "et": "Kursuse eesmärgiks on anda teadmisi ja praktilisi oskusi erialase teadusinformatsiooni otsimiseks."}], "learning_outcomes": [{"en": "After completing the course the students \nare familiar with information search principles and advanced search techniques and are able to apply them effectively in different search environments;\nare familiar with and can successfully use  important research databases and are able to find open access research information on the Internet;\nare familiar with and can use the reference manager  Zotero.", "et": "Kursuse lõpetanud tunnevad infootsingu põhimõtteid ja päringu koostamise tehnikaid ning rakendavad neid efektiivselt erinevates otsingukeskkondades;\ntunnevad ja oskavad kasutada olulisi teadusinfo andmebaase;\ntunnevad ja oskavad kasutada teadusinfo otsingukeskkondi internetis;\noskavad hinnata infoallikate usaldusväärsust;\noskavad vältida plagiaati;\ntunnevad ja oskavad kasutada viidetete haldamise ja bibliograafia koostamise vahendit Zotero."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}