{"uuid": "716575b9-099a-a08b-70b3-00dfdc4d7a17", "code": "OIAO.05.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-08T10:50:45", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course, the following four subject blocks will be addressed: general questions; fundamental principles of the Constitution; constitutional institutions and their interrelations; fundamental rights.", "et": "Kursuse raames käsitletakse nelja suurt blokki: üldküsimused; põhiseaduse aluspõhimõtted; riigikorraldus; põhiõigused."}, "objectives": [{"en": "The subjects of the course are the legal construction of the state, legal relations between persons and the state based on the fundamental rights and the relations between the constitution and the law of the European Union. The further subjects are the nature of the constitution, its functions and fundamental principles as well as their forms of realization. In addition to the theoretical basis, the participants will be acquainted with the acts of parliament and the jurisprudence in question.", "et": "Riigiõiguse kursuse esemeks on riigi õiguslik ülesehitus, põhiõigussuhted isiku ja riigi vahel ning põhiseaduse ja Euroopa Liidu õiguse vahekord. Aines käsitletakse põhiseaduse olemust, funktsioone ja aluspõhimõtteid ning nende rakendusvorme. Lisaks teoreetilistele alustele õpitakse tundma vastavaid õigusakte ja kohtupraktikat."}], "learning_outcomes": [{"en": "After having participated in the course, the student is able to recognize the constitutional problem where it exists, and to solve it by using the methods of constitutional interpretation. The student is able to convincingly argue for or against the violation of the Constitution. Additionally, the student must, by the end of the course, have acquired the skill to read and analyse important sources of Estonian constitutional law, especially the constitutional review decisions of the Supreme Court. In addition, by the end of the course, the student should have an overview of the constitutional institutions of Estonia as well as of their relations with each other and the relationship between the constitution and the EU Law.", "et": "Üliõpilane oskab pärast õppeaine omandamist ära tunda põhiseadusliku probleemi, kus see eksisteerib, ning on suuteline seda lahendama põhiseadusõiguslikku argumentatsiooni kasutades. Üliõpilane suudab veenvalt põhjendada, kas konkreetsel juhtumil on põhiseadust rikutud või mitte. Lisaks on üliõpilane kursuse lõpuks omandanud oskuse lugeda ja analüüsida olulisi riigiõiguse allikaid, iseäranis Riigikohtu põhiseaduslikkuse järelevalve alaseid otsuseid. Kursuse lõpuks on üliõpilasel ülevaade Eesti põhiseaduslikest institutsioonidest ja nende vahelistest suhetest ning Eesti ja Euroopa Liidu õiguse omavahelistest suhetest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}