{"uuid": "97140944-400e-7b34-82ef-572c8fa02a60", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-25T11:29:03", "title": {"en": "Administrative Law", "et": "Haldusõigus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 112, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "716575b9-099a-a08b-70b3-00dfdc4d7a17", "code": "OIAO.05.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-08T10:50:45", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The subject deals with following topics of general part of administrative law: the object, constitutional principles, terms and sources of administrative law; administative organisation; types of administrative activities; administrative procedure; administrative enforcement, administrative control and foundations of tort liability of public authorities.", "et": "Õppeaines käsitletakse haldusõiguse üldosa probleeme: haldusõiguse eset, haldusõiguse mõistet, põhiseaduslikke printsiipe ja põhimõisteid, allikaid, haldusorganisatsiooni, haldustegevuse vorme, haldusmenetlust, haldussundi, halduse kontrolli ja õiguskaitsevahendeid halduse õigusvastase tegevuse vastu."}, "objectives": [{"en": "The aim of this subject is to deliver the theoretical basic knowledge of general part of administrative law; to explain the the object, constitutional principles and terms of administrative law; to give an overview of sources of administrative law, including the position of international public law and European law among the sources of administrative law; to provide knowledge of administative organisation, administrative activities and their types. This course also introduces the principles of administrative procedure, the legal nature of administrative control and foundations of tort liability of public authorities. Finally, the methodology for solving the case studies on general part of administrative law will be taught.", "et": "Õppeaine eesmärgiks on õpetada haldusõiguse üldosa teoreetilisi alusteadmisi, selgitada haldusõiguse eset, põhiseaduslikke printsiipe ja põhimõisteid. Anda ülevaade haldusõiguse allikatest s.h rahvusvahelise õiguse ja Euroopa Liidu õiguse kohast haldusõiguse allikate süsteemis, haldusorganisatsioonist, haldustoimingutest ja nende vormidest. Selgitada haldusmenetluse põhimõtteid, halduskontrolli olemust ning õiguskaitsevahendeid halduse õigusvastase tegevuse vastu. Õpetada haldusõiguse üldossa kuuluvate praktiliste kaasuste lahendamise metoodikat."}], "learning_outcomes": [{"en": "Student having participated in this subject:", "et": "Aine läbinud üliõpilane peab olema võimeline:"}, {"en": "1)\tIs able to explain the constitutional principles and basic terms of administrative law;", "et": "1)\tselgitama haldusõiguse põhiseaduslikke printsiipe ja põhimõisteid;"}, {"en": "2)\tUnderstands the relationship between the general and special part of the administrative law and the characteristics of their implementation;", "et": "2)\tmõistma haldusõiguse üldosa ja eriosa seoseid ning kohaldamise spetsiifikat;"}, {"en": "3)\tIs able to distinguish different types of administrative activities and is aware of their prerequisites;", "et": "3)\trakendama erinevaid tõlgendamismeetodeid haldusõigusnormi sisu ja eesmärkide selgitamiseks;"}, {"en": "4)\tHas a good knowledge of principles and implementation of administrative procedure;", "et": "4)\ttundma haldusorganisatsiooni ja selle funktsioneerimise põhimõtteid;"}, {"en": "5)\tIs ready to explain the legal nature of administrative enforcement and the principles of its implementation;", "et": "5)\toskama eristada erinevaid haldustegevuse vorme ja teadma neile esitatavaid nõudeid;"}, {"en": "6)\tIs familiar with the administrative organisation and with its operating principles;", "et": "6)\tteadma haldusmenetluse põhimõtteid ja menetlust;"}, {"en": "7)\tIs able to explain the legal nature and necessity of administrative control;", "et": "7)\tselgitama haldussunni (haldustäite) olemust ja selle rakendamise põhimõtteid;"}, {"en": "8)\tHas an owerview of legal remedies against illegal actions of public authorities;", "et": "8)\tselgitama halduskontrolli olemust ja vajalikkust;"}, {"en": "9)\tCan use different interpretation methods to explain the content and purposes of administrative law rules;", "et": "9)\tomama ülevaadet õiguskaitsevahenditest avaliku halduse tegevuse vastu ja nende aluseks olevatest materiaalõiguslikest nõuetest (riigivastutusnõuded)"}, {"en": "10)\tIs prepared to take an advantage of the legal literature and case law for solving the case studies;", "et": "10)\tkasutama õiguskirjandust ja kohtupraktikat kaasuste lahendamisel"}, {"en": "11) Is able to analyse and solve the cases on general part of administrative law according to the respective methodology.", "et": "11)\tesitama haldusõiguse üldosa õppekaasuse analüüsi ja lahenduskäigu vastavalt etteantud metoodikale."}], "notes": {}}, "grading": {"independent_work": {"et": "Haldusõiguse aine raames tuleb üliõpilasel:\n1) töötada iseseisvalt läbi kohustuslik kirjandus ja asjakohane kohtupraktika;\n2) töötada kirjaliku online-testi jaoks läbi esitatud kirjandus ning läbida kokku neli online-testi (igas testis tuleb vastata õigesti vähemalt 90% valikvastustega küsimusele);\n3) valmistuda igaks seminariks;\n4) nõuetekohaselt lahendada ning ettenähtud tähtajaks kirjalikult esitada kodukaasus, lähtudes seejuures kaasuste lahendamise metoodikast (kodukaasuse nõuded täpsustatakse kodukaasuse ülesandepüstituses);\n5) nõuetekohaselt hinnata kaasüliõpilase kodutöö ning ettenähtud tähtajaks kirjalikult esitada tagasiside kodutööle."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Hindamine toimub järgmiste kriteeriumide alusel:\n- teoreetilistele küsimustele vastamise korrektsus ja ammendavus;\n- kaasuse õiguslike probleemide eesmärgipärane ja loov lahendamine;\n- õiguse rakendamise meetodite oskus;\n- kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete kasutamise oskus;\n- kaasuse lahendamisel ekspertstiilili kasutamise oskus kõigi asjakohaste nõuete analüüsimisel;\n- asjakohaste nõuete analüüsi tase; \n- küsimuste vastustes ja kaasuse analüüsi tase on selline, et töös ei esine nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel (vt hinde E kriteeriumit).\n"}}], "grade_preconditions": {"et": "1. Nelja online-testi läbimine. Online-test viiakse läbi Moodle'is. Iga testi läbimiseks tuleb vastata vähemalt 90% valikvastustega küsimustest õigesti. Iga testi lahendamiseks antakse kindel ajavahemik (täpsustatakse eelnevalt Moodle'is). Selle ajavahemiku jooksul saab testi sooritada korduvalt uuesti. Test tuleb läbida tähtaegselt. Tähtaega ei pikendata. Testi sooritamiseks võib olla vajalik eelnevalt teada antud ja kättesaadavaks tehtud kirjandusmaterjalide läbitöötamine. \n\n2. Kodukaasuse lahenduse tähtaegne ja nõuetekohane kirjalik esitamine. Tähtaega ei pikendata.\nKodukaasuse nõuded:\n- kaasus peab olema lahendatud täielikult (vt ülesandepüstitusi);\n- lahenduskäiguna esitatakse puhtand, s.t täislausetega vormistatud ja liigendatud tekst; lubatud ei ole märksõnaline lahenduskäik, mustandid, skitseeringud vms;\n- lahenduskäigu koostamisel tuleb arvesse võtta haldusõigusliku kaasuse lahendamise juhendit, sh asjakohaseid skeeme; \n- kodukaasuse lahendamine on individuaalne ülesanne, s.t identsete või suures osas identsete lahenduskäikude esitamine mitme üliõpilase poolt ei ole lubatud;\n- kaasuse lahendus vastab vormistusnõuetele (täpsustatud ülesandepüstituses). \n\n3. Kaasüliõpilase kodukaasuse lahenduskäigule tagasiside koostamine ning tagasiside tähtaegne ja nõuetekohane kirjalik esitamine. Tähtaega ei pikendata. Tagasiside andmise kord, sh töö, millele tagasiside antakse, täpsustatakse eelnevalt Moodle'is.\n\n4. Osavõtt kõigist seminaridest. Selleks on nõutud seminariks antud kaasuste ettevalmistamine ning seminarist aktiivne osavõtmine. Seminaridest on lubatud puududa üksnes mõjuval põhjusel kuni kahest seminarist. Seminar tuleb sellisel juhul vastata järele (vt detaile all võlgnevuste likvideerimise all)."}, "grade_evaluation": {"et": "Kirjalik lõpphindamine. Eksam kestab kokku 3 täistundi.\nEksam koosneb kaasusest ning sellele lisatud teooriaküsimus(t)est. Eksami raskuskese on kaasuse lahendamine.\nEksamil võib kasutada üksnes õppejõu poolt lubatud seadusetekste. Muud abivahendid ei ole lubatud."}, "grade_conditions": {"A": {"et": "Kaasuse õiguslike probleemide silmapaistev ja loov lahendamine. Õiguse rakendamise meetodite silmapaistvalt hea oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete väga head taset ületav kasutamine. Ekspertstiili on kasutatud kõigi asjakohaste nõuete analüüsimisel, analüüs on silmapaistvalt heal tasemel. \n\nKõikidele teoreetiliste küsimustele silmapaistev ja täpne vastamine.\n\nKüsimuste vastustes ja kaasuse analüüsis ei esine ühtegi nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "B": {"et": "Kaasuse õiguslike probleemide eesmärgipärane ja loov lahendamine. Õiguse rakendamise meetodite väga heal tasemel oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete väga heal tasemel kasutamine. Ekspertstiili on kasutatud kõigi asjakohaste nõuete analüüsimisel, analüüs on väga heal tasemel. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused. \n\nKõikidele teoreetilistele küsimustele ammendav vastamine. \n\nKüsimuste vastustes ja kaasuse analüüsis ei esine ühtegi nii olulist viga, mis seaks kahtluse alla, kas  üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "C": {"et": "Kaasuse õiguslike probleemide eesmärgipärane lahendamine. Õiguse rakendamise meetodite heal tasemel oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete heal tasemel kasutamine. Ekspertstiili on kasutatud kõigi asjakohaste nõuete analüüsimisel, analüüs on heal tasemel. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas avaldub ebakindlus ja ebatäpsus. \n\nKõikidele teoreetilistele küsimustele vähemalt heal tasemel vastamine.\n\nKüsimuste vastustes ja kaasuse analüüsis ei esine ühtegi nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "D": {"et": "Kaasuse õiguslike probleemide lahendamine tüüpolukordades. Õiguse rakendamise meetodite piisaval tasemel oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete piisaval tasemel kasutamine. Analüüs on piisaval tasemel. Teadmiste ja oskuste kasutamine on piisav tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus, vastustes esineb mitmeid eksimusi. \n\nEnamikule teoreetilistele küsimustele vähemalt keskmisel tasemel vastamine.\n \nKüsimuste vastustes ja kaasuse analüüsis ei esine ühtegi nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "E": {"et": "Kaasuse õiguslike probleemide lahendamisel, sh tüüpolukordades ilmneb teadmiste ja oskuste piiratud viisil kasutamine, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus, vastustes esineb mitmeid eksimusi. Üliõpilane peab siiski saavutama vähemalt miinimumtasemel õpiväljundites nimetatud teadmised ja oskused. \n\nMiinimumtaseme saavutamiseks peab üliõpilane: tundma haldusõiguse riigiõiguslikke aluseid; oskama määratleda haldustegevuse liigile vastavad õiguspärasuse nõuded ning teadma nende nõuete sisu; oskama tuvastada haldustegevuse volitusnormi ja määratleda selle koosseisu ning õigusliku tagajärje ning oskama subsumeerida; oskama ära tunda, millal on haldustegevuseks vajalik seaduslik alus, sh oskama tuvastada põhiõiguste riiveid.\n\nEnamikule teoreetilistele küsimustele vähemalt pinnapealne vastamine. Küsimuste vastustes ei esine ühtegi nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "F": {"et": "Õppija on omandanud olulisemad õpiväljundites nimetatud teadmised ja oskused miinimumtasemest madalamal tasemel. "}}, "debt_elimination": {"et": "Seminarist puudumise korral (aktsepteeritud on kuni kaks põhjusega puudumist) tuleb esitada õppejõu määratud seminarikaasus(t)e lahenduskäik õppejõuga kokkulepitud tähtajaks e-mailile: andra.laurand@ut.ee."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "e997b0d1-6855-4a4d-ab45-388889835719", "type": "MOODLE", "code": "OIAO.05.039", "base_url": "undefined", "linked_to_groups": ["6f987cca-1be8-c18e-8f1e-786d6488cb4f", "b8e03e81-d8ec-e8a5-00da-2c05cb66b6a1", "7ae6861d-d6b7-494b-8b4b-52a16764c164"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "fbb327a8-287e-19f9-729d-d1ab16366d51", "person_name": "Mattias Jõgi", "structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "e58a782b-9cb8-8afd-a0d3-5c6c71748ce0", "person_name": "Tanel Saar", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"II rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "2795e10c-8bad-dd4d-bfb4-ad8b94bf22bf", "person_name": "Janar Jäätma", "structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"I rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}, {"person_uuid": "e09d8a2d-8fb3-db76-e09c-a510ad7e64ed", "person_name": "Andra Laurand", "structural_unit": {"code": "SVOI02TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"III rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}], "study_groups": [{"uuid": "6f987cca-1be8-c18e-8f1e-786d6488cb4f", "code": "I rühm", "max_size": 35}, {"uuid": "7ae6861d-d6b7-494b-8b4b-52a16764c164", "code": "II rühm", "max_size": 35}, {"uuid": "b8e03e81-d8ec-e8a5-00da-2c05cb66b6a1", "code": "III rühm", "max_size": 36}]}, "schedule": {"weeks": {"et": "Loengud: 1,2,5,6,9,10,13,15; Seminarid: 2,5,6,8,9,10,13,14"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Vt. Ainekava Õppematerjalide all."}}]}, "registration_info": {"audience": {}, "max_students": 106}, "parent_uuid": "2ea2e501-5cb6-9215-52ca-4328cb1c6a66", "parent_code": "OIAO.05.039", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}