{"uuid": "2ea2e501-5cb6-9215-52ca-4328cb1c6a66", "code": "OIAO.05.039", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-27T08:42:31", "title": {"en": "Administrative Law", "et": "Haldusõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "716575b9-099a-a08b-70b3-00dfdc4d7a17", "code": "OIAO.05.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-08T10:50:45", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}]}, "overview": {"description": {"en": "The subject deals with following topics of general part of administrative law: the object, constitutional principles, terms and sources of administrative law; administative organisation; types of administrative activities; administrative procedure; administrative enforcement, administrative control and foundations of tort liability of public authorities.", "et": "Õppeaines käsitletakse haldusõiguse üldosa probleeme: haldusõiguse eset, haldusõiguse mõistet, põhiseaduslikke printsiipe ja põhimõisteid, allikaid, haldusorganisatsiooni, haldustegevuse vorme, haldusmenetlust, haldussundi, halduse kontrolli ja õiguskaitsevahendeid halduse õigusvastase tegevuse vastu."}, "objectives": [{"en": "The aim of this subject is to deliver the theoretical basic knowledge of general part of administrative law; to explain the the object, constitutional principles and terms of administrative law; to give an overview of sources of administrative law, including the position of international public law and European law among the sources of administrative law; to provide knowledge of administative organisation, administrative activities and their types. This course also introduces the principles of administrative procedure, the legal nature of administrative control and foundations of tort liability of public authorities. Finally, the methodology for solving the case studies on general part of administrative law will be taught.", "et": "Õppeaine eesmärgiks on õpetada haldusõiguse üldosa teoreetilisi alusteadmisi, selgitada haldusõiguse eset, põhiseaduslikke printsiipe ja põhimõisteid. Anda ülevaade haldusõiguse allikatest s.h rahvusvahelise õiguse ja Euroopa Liidu õiguse kohast haldusõiguse allikate süsteemis, haldusorganisatsioonist, haldustoimingutest ja nende vormidest. Selgitada haldusmenetluse põhimõtteid, halduskontrolli olemust ning õiguskaitsevahendeid halduse õigusvastase tegevuse vastu. Õpetada haldusõiguse üldossa kuuluvate praktiliste kaasuste lahendamise metoodikat."}], "learning_outcomes": [{"en": "Student having participated in this subject:", "et": "Aine läbinud üliõpilane peab olema võimeline:"}, {"en": "1)\tIs able to explain the constitutional principles and basic terms of administrative law;", "et": "1)\tselgitama haldusõiguse põhiseaduslikke printsiipe ja põhimõisteid;"}, {"en": "2)\tUnderstands the relationship between the general and special part of the administrative law and the characteristics of their implementation;", "et": "2)\tmõistma haldusõiguse üldosa ja eriosa seoseid ning kohaldamise spetsiifikat;"}, {"en": "3)\tIs able to distinguish different types of administrative activities and is aware of their prerequisites;", "et": "3)\trakendama erinevaid tõlgendamismeetodeid haldusõigusnormi sisu ja eesmärkide selgitamiseks;"}, {"en": "4)\tHas a good knowledge of principles and implementation of administrative procedure;", "et": "4)\ttundma haldusorganisatsiooni ja selle funktsioneerimise põhimõtteid;"}, {"en": "5)\tIs ready to explain the legal nature of administrative enforcement and the principles of its implementation;", "et": "5)\toskama eristada erinevaid haldustegevuse vorme ja teadma neile esitatavaid nõudeid;"}, {"en": "6)\tIs familiar with the administrative organisation and with its operating principles;", "et": "6)\tteadma haldusmenetluse põhimõtteid ja menetlust;"}, {"en": "7)\tIs able to explain the legal nature and necessity of administrative control;", "et": "7)\tselgitama haldussunni (haldustäite) olemust ja selle rakendamise põhimõtteid;"}, {"en": "8)\tHas an owerview of legal remedies against illegal actions of public authorities;", "et": "8)\tselgitama halduskontrolli olemust ja vajalikkust;"}, {"en": "9)\tCan use different interpretation methods to explain the content and purposes of administrative law rules;", "et": "9)\tomama ülevaadet õiguskaitsevahenditest avaliku halduse tegevuse vastu ja nende aluseks olevatest materiaalõiguslikest nõuetest (riigivastutusnõuded)"}, {"en": "10)\tIs prepared to take an advantage of the legal literature and case law for solving the case studies;", "et": "10)\tkasutama õiguskirjandust ja kohtupraktikat kaasuste lahendamisel"}, {"en": "11) Is able to analyse and solve the cases on general part of administrative law according to the respective methodology.", "et": "11)\tesitama haldusõiguse üldosa õppekaasuse analüüsi ja lahenduskäigu vastavalt etteantud metoodikale."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}