{"uuid": "79f76668-9fbf-9c6b-63ca-7b2cbf1054d6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-12T09:33:59", "title": {"en": "International Banking and Finance", "et": "Rahvusvaheline pangandus ja finantsteenused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will cover different aspects of banking and finance in an international context, including private and public lending, deposit and international transfer of funds and cross-border financial transactions. Students will acquire knowledge of the risks associated with counterparties to transactions and risk mitigation mechanisms. The course will also address regulatory issues (compliance checks) in international transactions.", "et": "Ainekursusel käsitletakse panganduse ja rahanduse erinevaid aspekte rahvusvahelises kontekstis, sealhulgas erasektori ja riigi poolt laenude andmist, hoiustamist ja välisarveldusi ning piirüleseid finantstehinguid. Tudengid omandavad mh teadmisi tehingute osapooltega seotud riskidest ja riskide vähendamise mehhanisme. Ainekursusel käsitletakse ka rahvusvaheliste tehingute regulatiivseid probleeme (vastavuskontroll)."}, "objectives": [{"en": "This course will be a survey of the fundamentals of international banking and finance. ", "et": "Kursus annab ülevaate rahvusvahelise panganduse ja rahanduse põhialustest. "}, {"en": "It will include the underlying theories and policies. It will discuss attributes of these types of transactions and provide some of categories of risk and exposure found in these activities, and possible mechanisms to mitigate those risks. Discussions of the problems will be based on some actual examples of international transactions.", "et": "Kursus hõlmab rahvusvahelise panganduse ja rahanduse aluseks olevaid teooriaid ja poliitikaid. Kursuse raames käsitletakse eri liiki finantstehingute omadusi, tehingute riskikategooriaid ja -positsioone ning võimalikke mehhanisme nende riskide vähendamiseks. Ainekursus sisaldab ka arutelusid rahvusvaheliste tehingute näitel."}], "learning_outcomes": [{"en": "Students will", "et": "Üliõpilased"}, {"en": "- gain a fundamental understanding of various types of international transactions, both private and government- sponsored,", "et": "- omandavad põhiteadmised erinevat tüüpi rahvusvahelistest tehingutest, nii era- kui ka valitsuse rahastatud tehingutest"}, {"en": "- understand the reasons customers and financial institutions engage in international finance,", "et": "- mõistavad, miks kliendid ja finantsasutused tegelevad rahvusvahelise finantseerimisega,"}, {"en": "- acquire knowledge about the attributes of types of transactions covered in the course, ", "et": "- omandavad teadmisi kursusel käsitletavate tehingutüüpide peamiste omaduste kohta,"}, {"en": "- understand risks involved and regulatory concerns with this category of transactions.", "et": "- mõistavad tehingutega seotud riske ja regulatiivseid probleeme."}], "notes": {"et": "The course will be taught by Professor David Zarski who has 40 years of experience as an Illinois-licensed attorney and compliance officer in bank and other financial institution regulation and transactions, deposit products, payment systems and GPR cards, consumer credit and mortgage programs, and commercial financing arrangements and lending. He has represented and advised banks, thrifts, state-licensed lenders, debt collectors, fintech companies, and service providers."}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Final assessment will be based on class preparation and participation over the entire course."}}], "grade_preconditions": {}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "ffffff79-c2f4-43b5-cff2-656bb117675c", "person_name": "Irene Kull", "structural_unit": {"code": "SVOI04TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI04"}, "is_responsible": true, "is_teaching": false}, {"person_uuid": "906260bb-1ea8-f1bd-3353-d509689b6365", "person_name": "David E. Zarski", "structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "31.03 - 10.04.2025 "}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 1 \n\nIntroduction\nWhy study this?\t\nWhat is a BANK and what function does it serve?\nWhy are financing arrangements appealing to companies?\nInternational banking\t\nA bank is divided into two main categories of operations\nDeposits and payment functions\nFinance and lending\nSpecial aspects and considerations in an international setting"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 2\n\nDeposits and payments\nA bank/financial institution does not maintain all deposit at the institution\nIt only maintains a portion of it deposits in liquid assets, based on its projections of cash needs and regulatory requirements\nTaking deposits is a highly regulated activity\nAs banking has become more international, regulator concerns over \"bad actors\" using the banking and payments systems for  illegal activities or to hide profits of these activities has put the burden on financial institutions to take steps to identify Anti-Money Laundering (AML)  and Know Your Customer  (KYC) due diligence"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 3\n\nHistorically, international payment and international business first used precious metals such as gold and silver for international trade\nRapid development of payment platforms, the concept of \"deposit\" has gotten muddled\nPayment platforms have expanded  rapidly over the past several years\nThe speed of transfers has become almost instantaneous\nHowever, international transfers are more difficult if not nonexistent in most payment systems\nHowever, the protections afforded depositors is not as strong as with financial institution deposit accounts\nPayments platforms are not subject to the same regulatory oversight that banks and other financial institutions are"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 4\n\nFinance and Lending has many aspects and types\nThe first type worth noting is equity or debt\nThere are variations on forms of both debt and equity\nThere are also hybrid arrangements where an investment has attributes of both debt and equity\nYou will usually see this in startup companies with so-called \"angel investors\" who will extend a loan to the startup for a specific return but also get an equity portion and usually one or more seats on the board of directors\nThe equity portion can be quite significant, in some cases a majority interest in the company"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 5\n\nMost equity, especially for startups or younger is not traded on any public exchange, but rather in private transactions. \nIt is therefore very important to know the investment laws of the jurisdiction where the startup is located and the jurisdiction where it is organized (which often times is different)\nIt is also very important to look at the investment laws where the investors are located. These laws will often apply as well if care is not taken by the company counsel to structure the investment carefully"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 6\n\t\nIn lending arrangements, they may be bilateral or multilateral\nThis will apply to the lenders involved and not the borrowers\nA bilateral arrangement is between one lender and on (or more borrowers\nA multilateral arrangement is between two or more lenders and one (or more borrowers\nThere are several ways a multi-lateral arrangement can be structured\nIt is not uncommon to lenders to insist on the parent or significant affiliate of the borrower to be an obligor as well, or at least a guarantor\nFacilities can be secured or unsecured"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 7\nAsset securitization\nOther forms of structured finance"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Some variations around the world\nOverall trends\nQuestions /open discussion"}}]}, "registration_info": {"audience": {"et": "Degree students of the University of Tartu (Bachelor 3rd year or Master), foreign students"}, "min_students": 10, "max_students": 35}, "parent_uuid": "a1015f46-949d-90f9-324e-cfba6a8483dd", "parent_code": "OIEO.06.004", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}