{"uuid": "853548c5-0f5c-4c3f-e1e4-9fab08032c9b", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-04T09:43:22", "title": {"en": "Competition Law and Market Regulation in Digital Economy", "et": "Konkurentsiõigus ja tururegulatsioon digimajanduses"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "3dada822-0c69-5401-3594-cc7ee3ce0054", "code": "OI00.00.003", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "3dec95b2-2c88-c86f-c7c6-23b73806dc18", "code": "OI00.00.002", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "d0189a81-62f9-c1df-7f42-317da901e0da", "code": "P2OG.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "8d54607c-6f02-53df-0b37-8c456c3ded63", "code": "P2OG.00.003", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}]}, {"required": false, "uuid": "72bcaebc-2234-3639-ffc5-6341ae0ecd3a", "code": "OIEO.06.005", "title": {"en": "Competition Law", "et": "Konkurentsiõigus"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": false, "uuid": "77d8480c-54b7-d1da-f86c-6e806a913e2b", "code": "P2OG.02.209", "title": {"en": "European Union Law", "et": "Euroopa Liidu õigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Competition law and market regulation in digital economy will include two learning blocks: first, the general material competition law in digital economy (i.e. Articles 101 and 102 TFEU, merger control based on the Merger Regulation); second, second, the DSA and DMA Regulations on market regulation rules for digital markets.\n\nThis course will cover various aspects of competition law and market regulation in digital markets, including:\nI.\tBasic competition law in digital era \n1.\tNotion of undertaking and market definition, conglomerate markets in digital markets;\n2.\tVarious aspects and assessment of Article 101 TFEU in digital markets;\n3.\tVarious aspects and assessment of Article 102 TFEU in digital markets;\n4.\tMerger control in digital markets (including vertical and conglomerate effects), issues with the present set of rules.\n\nII.\tMarket regulation for digital economy\n5.\tOverview of already existing set of rules (such as P2B Regulation);\n6.\tDSA and DMA.", "et": "Konkurentsiõigus ja turu regulatsioon digitaalmajanduses hõlmab kaht õppeteemat: esiteks üldine materiaalne konkurentsiõigus digitaalmajanduses (st ELTL artiklid 101 ja 102, koondumiste määrusel põhinev koondumiste kontroll); teiseks digiteenuste õigusakti (DSA) ja digiturgude õigusakti (DMA) algatused, mis käsitlevad turu reguleerimise eeskirjade loomist digiturgude jaoks. \n\nSee kursus hõlmab konkurentsiõiguse ja turu reguleerimise erinevaid aspekte digitaalsetel turgudel, sealhulgas: \nI. Põhiline konkurentsiõigus digitaalajastul\n1. Ettevõtja mõiste ja turu määratlus, konglomeraaditurud digitaalsetel turgudel; \n2. ELTL artikli 101 eri aspektid ja hindamine digitaalturgudel; \n3. ELTL toimimise lepingu artikli 102 eri aspektid ja hindamine digitaalturgudel; \n4. Ühinemiste kontroll digitaalturgudel (sealhulgas vertikaalne ja konglomeraatne mõju), probleemid praeguste eeskirjadega. \n\nII. Turu reguleerimine digitaalmajanduse jaoks\n5. Ülevaade juba olemasolevatest eeskirjadest (nt ettevõtjatevaheline määrus); \n6. Digiteenuste õigusakti (DSA) ja digiturgude õigusakti (DMA) käsitlevad algatused."}, "objectives": [{"en": "This course familiarises participants with the European Union competition law rules specialising on case practice of the European Commission, the case law of the European Union Courts and more recent and pertinent case law from some Member States concerning digital markets. This includes platform economy, software licencing, use of personal data and AI related tools in business practices etc. Additionally, the course delves into upcoming legislative initiatives of the European Union in relation to the digital transformation initiative, including legislation proposals for the Digital Services Act (DSA) and Digital Markets Act (DMA) with the emphasis on the market regulation part of these acts. The great variety of competition law related problems shall be analysed in combination with different legal topics to provide students with real-life problem-solving skills and a wider understanding of the functioning of the competition rules in digital markets.", "et": "Sellel kursusel tutvustatakse osalejatele Euroopa Liidu konkurentsiõiguse norme, mis on spetsialiseerunud Euroopa Komisjoni praktikale, Euroopa Liidu kohtute praktikale ning mõne liikmesriigi hiljutisemale ja asjakohasemale kohtupraktikale seoses digitaalsete turgudega. See hõlmab platvormimajandust, tarkvara litsentsimist, isikuandmete ja tehisintellektiga seotud vahendite kasutamist äritavades jne. Lisaks suunatakse kursus Euroopa Liidu tulevastesse seadusandlikesse algatustesse, mis on seotud digiülemineku algatusega, sealhulgas õigusaktide ettepanekutesse digiteenuste õigusakti (DSA) ja digiturgude õigusakti (DMA) kohta, rõhuasetusega nende õigusaktide osal turu reguleerimisel. Konkurentsiõigusega seotud väga erinevaid probleeme analüüsitakse koos erinevate õigusteemadega, et anda õpilastele tegelik probleemide lahendamise oskus ja laiem arusaam konkurentsieeskirjade toimimisest digitaalsetel turgudel."}], "learning_outcomes": [{"en": "The student will:\n\n*understand the basic primary and secondary law on competition, including the soft law.\n\n*understand the concept of market definition and know how to define both the relevant product market and the geographic scope of the market (understanding the basic logic for defining digital markets);\n\n*understand the basic elements and criteria of European Union competition law, know the difference between antitrust and cartels and understand the common conditions for merger control in digital markets;\n\n*have the latest overview on the market regulation trend within the European Union, including the recent legislation (DSA and DMA);\n\n*is able to analyse and solve new problems by applying principles from case law and other materials learnt during the course.", "et": "Üliõpilane: \n\n*õpib kohaldama konkurentsi käsitlevaid esmaseid ja teiseseid õigusakte, sealhulgas mittesiduvaid õigusakte. \n\n*õpib mõtlema turu määratluse kontseptsiooni ja teadma, kuidas määratleda nii asjaomane kaubaturg kui ka turu geograafiline ulatus (pidades silmas digitaalsete turgude määratlemise põhiloogikat); \n\n*õpib mõistma Euroopa Liidu konkurentsiõiguse põhielemente ja kriteeriume, teadma turgu valitseva seisundi ja kartellide vahelist erinevust ning mõistma tingimusi koondumiste kontrollimiseks digitaalsetel turgudel; \n\n*saab ülevaate uusimatest turu reguleerimise suundadest Euroopa Liidus, kaasa arvatud hiljutine seadusandlus (DSA ja DMA);\n \n*õpib analüüsima ja lahendama probleeme, kohaldades kohtupraktika põhimõtteid ja muid kursuse käigus saadud materjale ja teadmisi."}], "notes": {}}, "grading": {"independent_work": {"et": "The course shall include 2 marked multiple-answer tests on the first block.\n* Test 1: test on competition law basics in digital economy, \n* Test 2: test on merger control\n\nThird component of the final grade is an essay for the second block concerning market regulation. The students can choose between 3 given subjects for the essay. \n\nActive participation during seminars will be marked with up to 9 extra points, which form a part of the final grade. Participation in the compulsory seminars towards obtaining the points involves active participation and engagement in the discussions in person.\n\nTest 1: test on competition law basics in digital economy - 10 points\nTest 2: test on merger control - 10 points\nEssay: market regulation - 30 points\n\nActive participation in compulsory seminars may be rewarded with up to 9 points. For more information on the point system, please see \"Assessment Results\" below.\n\n1.Legal essay\n\nEXAMPLE:\nAssessment criteria\n-correctness of formalisation and compliance with the requirements;\n-relevance and extent of references to legal acts, case law, other relevant documents;\n-level of analysis, establishing connections, level of interpretation;\n-logic and integrity of covering the subject.\n\nE - the form is, in general, in compliance with the requirements and correct; references are minimal and insecure; the elements of analysis and independent interpreting are there; the coverage of the subject is, in general, logical, but the connections are full of gaps;\n\nD - the form is in compliance with the requirements and, in general, correct; references are minimal, but relevant; the analysis and independent interpreting is understandable, but at times insecure; the coverage of the subject is logical and associated;\n\nC - the form is in compliance with the requirements and correct; references are relevant and sufficient; analytical connections and interpretations are proper and there is certainty in creating connections; the treatment of the subject is logical, but there are some weaknesses from the point of view of the whole;\n\nB - the form is excellent; the choice, amount and association of references with the text is very good; thorough analysis of connections and references; bold interpretation based on connections; the treatment of the subject as a whole is logical and smooth;\n\nA - the form is excellent; the choice, amount and association of references with the text is creative; the depth of the analysis and the level of independent interpretation is remarkable; the connections are thorough-going and creative; the treatment of the subject is innovative and logical; the text is a remarkable achievement on the whole.\n\n\n2.Multiple answer tests (Test 1 and Test 2)\n\nE - 51-60%, at least 8 correct answers\nD - 61-70%, at least 9 correct answers\nC - 71-80%, at least 10 correct answers\nB - 81-90%, at least 12 correct answers\nA - 91-100%, at least 14 correct answers"}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2024-03-17", "description": {"et": "Test 2: test on merger control - 10 points"}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2024-03-17", "description": {"et": "Test 1: test on competition law basics in digital economy - 10 points"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Active participation in compulsory seminars may be rewarded with up to 9 points. For more information on the point system, please see \"Assessment Results\" below."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "due_date": "2024-03-31", "description": {"et": "Essay: market regulation - 30 points"}}], "grade_preconditions": {"et": "Compulsory in person participation in 3 seminars; at least 51% on 2 compulsory tests each, submission and positive score in legal essay. \n\nParticipation in the compulsory seminars towards obtaining the points involves active participation and engagement in the discussions in person."}, "grade_evaluation": {"et": "Final score of the subject (total 50 points plus additional 9 points from active participation in seminars) shall be composed as followings:\n1) Participation in compulsory seminars (3 seminars may provide in total 9 points);\n- Participation in marked 3 seminars is compulsory;\n- In every compulsory seminar the student may collect maximum 3 points for the active participation (participation in the discussions);\n- Participation in the compulsory seminars towards obtaining the points involves active participation and engagement in the discussions in person;\n2) Test 1 provides maximum 10 points;\n3) Test 2 provides maximum 10 points;\n4) Legal essay assignment provides maximum of 30 points with the allocation as follows: \n\nE - 51-60%, at least 15 points\nD - 61-70%, at least 18 points\nC - 71-80%, at least 21 points\nB - 81-90%, at least 24 points\nA - 91-100%, at least 27 points"}, "debt_elimination": {"et": "According to the Study Regulations (Õppekorralduseeskiri)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "6d5b0696-cb1d-40b8-bc62-3e046afe0013", "type": "MOODLE", "code": "OIEO.06.095_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "011e8db4-282b-c156-da9b-b035beb39793", "person_name": "Birgitta Ots", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}], "assistants": ["0336e9b7-7056-ed67-b995-6c2c73d85dd3"]}, "schedule": {"weeks": {"et": "24-26"}}, "registration_info": {"audience": {}, "min_students": 0, "max_students": 36}, "parent_uuid": "a2711845-5f60-e09f-7a4e-e78cf38f3d4d", "parent_code": "OIEO.06.095", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}