{"uuid": "1c382587-b119-b329-4e94-d97703170449", "code": "OIEO.04.096", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Civil Law Special Seminar for Doctoral Students II", "et": "Tsiviilõiguse eriseminar doktorantidele II"}, "credits": 8, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The substance will be examined within the framework of the research topics of the faculty on various topical issues in relation to the civil law institutes. Presentations by doctoral students provide them possibilities to share their opinions, discuss and defend their main ideas and research outcomes.", "et": "Aine raames uuritakse teaduskonnas tehtava uurimistöö eri valdkonna aktuaalseid probleeme seoses tsiviilõiguse instituutidega. Doktorandid koostavad ettekanded, esitavad need oponeerimiseks kaasdoktorantidele ning diskuteerivad oma uurimistöö põhiseisukohtade üle seminaris."}, "objectives": [{"en": "Objective of the second-year doctoral student expected level:", "et": "Aine eesmärk on teise aasta doktrandilt oodataval tasemel"}, {"en": "1) upgrading skills of formulation of research problems in the field of private law", "et": "1) tsiviilõiguse aktuaalsete probleemide sõnastamise kogemuste omandamine"}, {"en": "2) gaining experience in handling of contemporary private law problems in connection with the PhD thesis", "et": "2) aktuaalsete probleemide käsitlemise kogemuste omandamine"}, {"en": "3) upgrading of skills in drafting scientific legal texts", "et": "3) õigusteadusliku teksti koostamise oskuste täiendamine"}, {"en": "4) gaining experiences required to gather materials for the article, and the erection of a research tasks to compose text", "et": "4) kogemuste omandamine iseseisvalt artikli jaoks materjalide kogumiseks, uurimisülesande püstitamiseks ja teksti koostamiseks"}, {"en": "5) to provide doctoral students with knowledge of the foundational underpinnings of civil law, while developing their abilities in presenting and defending their positions.", "et": "5) suulise ettekande koostamise ja esitamise oskuste omandamine"}], "learning_outcomes": [{"en": "The second-year doctoral candidate is expected at the level:", "et": "Teise aasta doktorandilt oodataval tasemel:"}, {"en": "1) PhD student orientates in contemporary legal literature and is able to formulate a topical problems", "et": "1) doktorant tunneb kaasageset õiguskirjandust ja oskab sõnastada aktuaalseid probleeme"}, {"en": "2) is able to use the resources to draw up presentation based on scientific studies", "et": "2) doktorant oskab kasutada allikaid uurimustliku ettekande koostamiseks"}, {"en": "3) is able to analyze scientific texts and to formulate questions of the surface", "et": "3) doktorant oskab analüüsida õigusteaduslikku teksti ning formuleerida selle pinnalt küsimusi"}, {"en": "4) is able to convincingly present their views and defend them", "et": "4) doktorant oskab veenvalt esitada oma seisukohti ning neid kaitsta"}, {"en": "5) has an overview of the different research questions in the field of civil law", "et": "5) doktorant omab ülevaadet erinevatest uurimisküsimustest tsiviilõiguse valdkonnas"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}