{"uuid": "3798c22d-62c4-2084-fd1a-684de38c431e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-31T14:16:59", "title": {"en": "Roman Private Law", "et": "Rooma eraõiguse alused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course provides an overview of the Roman Private Law (8th century BC-6th century AD), which provided the basis for the further development of the civil law tradition.\nThe course tackles all the important areas of the Roman Private Law of persons, family law, procedual law, property law, law of obligations and the heritage law in connection with the contemporary private law.", "et": "Antakse ülevaade Vana-Roomas 8. sajandist e.Kr. kuni 6.sajandini p.Kr. kehtinud õigussüsteemi ühest osast--eraõigusest, mille alusel kujunes välja hilisem tsiviilõiguslik traditsioon. Käsitletakse kõiki põhilisi Rooma eraõiguse valdkondi: isikuõigust, perekonna- ja protsessiõigust, asja-, võla - ja pärimisõigust võrdlevalt tänapäeva Eesti ja muude Rooma õigusel põhinevate õigussüsteemidega. Selgitatakse erinevate eraõiguse süsteemide põhimõtteid ja käsitletakse mõistete kujunemislugu ning tähendusmuutusi erinevates õigussüsteemides."}, "objectives": [{"en": "The student should in the end of the course have an overview of the Roman  Law,  particularly the Private Law and its basic concepts, structure and the basics of the functioning, which forms the basis of the legal systems of Continental Europe, including Estonia, as compared to the private law of today. The student has become acquainted with the basic concepts of private law, with their formation and origin in Roman law and learned how to write a scientific paper (abstract).", "et": "Õppeaine läbinud üliõpilasel on ülevaade Kontinentaal-Euroopa õigussüsteemide, k.a. Eesti õiguse aluseks oleva Rooma õiguse ühest osast - eraõigusest - ning selle põhimõistetest, struktuurist ning toimimisalustest võrdlevalt tänapäevaga. Üliõpilane on tutvunud eraõiguse põhimõistete ning nende tekke/tekkepõhjustega Roomas ning õppinud kaasuse lahendamist."}], "learning_outcomes": [{"en": "To finish the course successfully the student should be able to explain the content of the basic concepts of the Roman private law (and Estonian valid private law), the principles and functioning of these concepts. He should be able to orientate int the system of private law on the basis of the Institutes of Gaius. The student should be able to understand norm, to which area of private law this norm belongs to and to put the norm into the context of relevant private law institute. He should be able to compare generally the Roman norms with those of valid today (using the laws of the Estonia) and to discuss about the origin, formation and needs of the institutes of private law. The student should have acquired the basic rules of writing a scientific paper and should be able to put them into practice.", "et": "Õppekava edukal läbimisel peab üliõpilane oskama:\n* selgitada Rooma eraõiguse (ja Eesti kehtiva eraõiguse) põhimõistete sisu;\n* eraõiguse põhimõtteid ning toimimisaluseid;\n* orienteeruda Rooma eraõiguse süsteemis Gaiuse Institutsioonide alusel;\n* aru saada normist, selle kuuluvusest teatud valdkonda;\n* paigutada normi vastava eraõiguse instituudi konteksti.\n* ühtlasi olema võimeline üldistatult võrdlema Rooma norme tänapäevastega (kasutades EV seadusi) ning arutlema eraõiguse instituutide tekke/tekkimispõhjuste/vajaduste üle;\n* lahendada õigusliku probleemiga kaasust Rooma õiguse allikate alusel ja argumenteerida allikate pinnalt;\n* olema omandanud algtasemel ja oskama praktiliselt rakendada üliõpilastööde viitamise ja teadusliku käsitluse põhireegleid;\n* mõistma rühmatöö koostamise ja vormistamise, ajaplaneerimise ja tulemuste suulise esitamise põhimõtteid."}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisvad tööd: kirjalik kaasuse lahendus, ettekanne, kontrolltöö. \nKaasuse lahendamise ja ettekande juhendid üleval moodles õppematerjalide all."}, "independent_work_assessments": [{"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Kaasuse lahendamine nii kontrolltöös kui ka kodutööna: Õiguslike probleemide lahendamise eesmärgipärasus ja loovus; Asjassepuutuvatele õigusnormidele (ja kirjandusele) viitamine ja nende tõlgendamine; Sätete analüüsi sügavus; Lahenduste täpsus. A - õiguslike probleemide silmapaistev ja loov lahendamine, viitamine kõikidele asjassepuutuvatele sätetele, sätete sügavutiminev õiguslik analüüs,(asjakohase kirjanduse käsitlemine). B - õiguslike probleemide eesmärgipärane ja loov lahendamine, viitamine kõikidele asjassepuutuvatele sätetele, sätete õiguslik analüüs väga heal tasemel, väheolulised ebatäpsused spetsiifiliste probleemide lahendamisel. C - tüüpprobleemide tõrgeteta lahendamine, viitamine enamikule asjassepuutuvatest sätetest, sätete õiguslik analüüs heal tasemel, mitmed eksimused spetsiifilisemate probleemide lahendamisel. D - tüüpprobleemide korrektne lahendamine, viitamine enamikule asjassepuutuvatest sätetest, sätete õiguslik analüüs pinnapealne, eksimused ja ebakindlus väljaspool tüüpolukordi. E - lihtsamate tüüpprobleemide korrektne lahendamine, viitamine põhilistele asjassepuutuvatele sätetele, sätete õiguslik analüüs pinnapealne, eksimused väljaspool tüüpolukordi.\nkirjaliku kodutöö nõudeid vt lähemalt moodlest, nõuded ja juhendid 2023."}}], "grade_preconditions": {"et": "Aine lõpphinne kujuneb jooksvalt: tegema peab ettekande, kirjaliku kaasuse lahenduse ja kontrolltöö"}, "grade_evaluation": {"et": "Lõpphinne kujuneb jooksvalt: 60% kaasuse kirjalik lahendus, ettekanne - arvestatud, 40% kontrolltöö. Ettekande esitamata jätmisel läheb 1 hindepall maha kaasuse lahenduse hindest."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine kokkuleppel õppejõuga. Lubatud on puududa ühest seminarist."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "8207fbe9-bf5e-4578-9fac-67f4b573378c", "type": "MOODLE", "code": "OIEO.01.026", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Põhiline õppevahend Rooma eraõigusest:\nE. Ilus. Rooma eraõiguse alused. Toim. H. Pisuke. 2000. Kasutada võib ka varasemaid väljaandeid aastatest 1960 ja 1969 ja 1987. a. väljaannet nimetuse all \"Rooma tsiviilõiguse alused: õppemetoodiline materjal õigusteaduskonna üliõpilastele. (Koost. P. Kask, E. Ilus).\n\nH. Siimets-Gross, M. Ristikivi. Fontes iuris romani. Rooma õiguse allikate kogumik. Tartu: Tartu Ülikooli kirjastus 2019.\nH. Siimets-Gross. Rooma eraõigus. Loengukonspekt.\nH. Siimets-Gross. Rooma õiguse kujunemine ja õitseng. - Juridica. 2002, nr 9, 626-634. (ka õisis)", "recommended_materials": "Täiendav kirjandus:\n1.\tT. Säärits. Appellatio - kas esimene edasikaebevahend tsiviilprotsessis? - Juridica 2011, nr 9, 701-713; \n2. K. Kiirend. Capitis deminutio minima: Rooma õiguse allikad vs. senine uurimistraditsioon. - Juridica 2011, nr 2, 139-147).\n3. M. Kaser. Römisches Privatrecht, I.-II, München: Beck, 1971, 1975.\n4.\tBehrends, O. Skript zur Vorlesung Römische Rechtsgeschichte, Göttingen: DAF, 1999\n5.\tR. Zimmermann. The Law of Obligations Roman Foundations of the Civilian Tradition. Kluwer. 1992 (Väga soovitatav kasutada võlaõiguslike kaasuste lahendamisel).\n6.\tB. Nicholas. An Introduction to Roman Law. Clarendon Press. Oxford 1991.\n7.\tA. Borkowski. Textbook on Roman Law. Blackstone Press Limited: London 1994 ja 2nd Edition 1997.\n8.\tR. W. Lee. The Elements of Roman Law with a tradition of the Institutes of Justinian. Fourth ed. London. Sweet & Maxwell Limited 1956. Sixth Impression 1993.\n8.\tH. Honsell. Römisches Recht. Zweite, erg. und überarb. Aufl. Springer-Verlag. Berlin, Heidelberg, New York, London u.a. 1992.\n9.\tA. A. Podoprigora. Osnovõ Rimskovo grazhdanskovo prava. Kiev: Võsha Shkola, 1990\n10.\tI. B. Novitski. Rimskoe pravo. Moskva.: 1996.\n11.\tIvo Puhan, Mirjana Polenak-Akimovskaja. Rimskoje pravo (bazovõi utšebnik). Perevod s makedonskogo d. jur. n. prof. V. A. Tomsinova i J. V. Filippova / Pod. red. V. A. Tomsinovo. - M: Izdatelstvo ZERTSALO, 1999. \n12.\tRimskoe tsastnoe pravo / Pod red. prof. I. B. Novitskogo I prof. I. S. Pereterskogo. M.: Jurist, 1994.\n13.\tT. Mayer-Maly. Römisches Privatrecht. Springers Kurzlehrbücher der Rechtswissen-schaft. Springer-Verlag: Wien, New York, 1991.\n14.\tTamm, Ditlev. Roman law and European legal history. Copenhagen : DJOF Publishing, 1997.\n14.\tM. Rainer, J. Filip-Fröschl. Texte zum Römischen Recht. Fallbeispiele für das Studium. Schwerpunkt Schuld- und Sachenrecht. Wien, New York: Springer, 1998.\n16.\tCorpus Iuris Civilis. Text und Übersetzung. I Institutionen. Gemeinschaftlich übersetzt von Okko Behrends, Rolf Knütel, Berthold Kupisch, Hans Hermann Seiler. 2., verbesserte und erweiterte Auflage. Heidelberg: C. F. Müller Verlag, 1997.\n17.\tInstitutsii Justiniana. Perevod D. Rassnera. Pod red. L. L. Kofanova, V. A. Tomsinova. Moskva: ZERTSALO, 1998, 399 lk.\n\nNormatiivmaterjalid:\nPõhiseadus (RT 1992, 26, 349)\nTsiviilseadustiku üldosa seadus (RT I 2002, 35, 216)\nVõlaõigusseadus (RT I 2002, 60, 374)\nAsjaõigusseadus (RT I 1993, 39, 590)\nPerekonnaseadus (RT I 2009, 60, 395)\nPärimisseadus (RT I 2008, 7, 52)"}, "participants": {"lecturers": [{"person_uuid": "11212224-4bba-a9e6-bb60-449d945ab1ae", "person_name": "Hesi Siimets-Gross", "structural_unit": {"code": "SVOI02TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "2ab5e827-8f20-deb6-ff62-39d0eb1c9da6", "person_name": "Maris Valtin", "structural_unit": {"code": "SVOI02TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Loengud: 25; Seminarid: 27, 31, 34"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "4 h ja 2 h külalisõppejõu loeng"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "8 h"}}]}, "registration_info": {"audience": {"et": "BA valikaine"}, "min_students": 10, "max_students": 30}, "parent_uuid": "86c322a7-76c9-1174-4f4a-a8b31de97ed5", "parent_code": "OIEO.01.026", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}