{"uuid": "0847ea23-1eb0-021d-6cc3-a90fc9101ff9", "code": "sv-2025-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-06T09:32:06", "title": {"en": "Development of Social Rights in Estonia: Right to Work and Right to Social Security", "et": "Sotsiaalsete õiguste areng Eestis: õigus tööle ja õigus sotsiaalkindlustusele"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "25/26 A regular SV Eng", "et": "25/26 S PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course is meant mainly for foreign students. During the course the development of social rights - right to work and to social security - in Estonia will be dealt with. The development will be observed starting from the re-independence till to present day. Main purpose is to give to the students an overview about the development and protection of social rights in transition country. Also the principles of legal regulation of social security and labour relations in Estonia will be dealt with.", "et": "Loengukursus on suunatud eelkõige välisüliõpilastele. Loengukursuse raames käsitletakse\nsotsiaalsete õiguste - õigus tööle ja sotsiaalkindlustusele - arengut Eestis alates\nEesti taasiseseisvumisest  kuni tänaseni. Loengukursuse peamine eesmärk on anda üliõpilastele ülevaade sotsiaalsete õiguste kujundamisest ja tagamisest ülemineku riigis. Samuti käsitletakse õppeaine raames erinevaid õiguslikke mehhanisme sotsiaalsete õiguste - õigus tööle ja õigus sotsiaalkindlustusele -tagamiseks. Õliõpilased saavad teadmised Eesti tööõiguse ja sotsiaalkindlustuse peamistes instituutidest."}, "objectives": [{"en": "Aim of the course is to give to the students knowledge about the Estonian labour law and social security law, about the constitutional guarantees of the right to work and right to social security in Estonia.", "et": "Üldeesmärgiks on anda üliõpilastele teadmised Eesti tööõigusest ja sotsiaalkindlustusõigusest,\npõhiseaduslikest garantiidest õigusele tööle ja õigusele sotsiaalkindlustusele."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "At the end of the course a student is able to: \n- characterise constitutional guarantees for the right to work and right to social security in Estonia; \n- explain different institutes of Estonian labour law and the principles of legal regulation of employment relations in Estonia; \n- explain different institutes of Estonian social security law and the principles of legal regulation social security.", "et": "Kursuse lõpus on üliõpilane võimeline:\n- Iseloomustama Eesti põhiseaduslikke garantiisid õigusele tööle ja õigusele sotsiaalkindlustusele; \n- Selgitama Eesti tööõiguse põhiinstituute ning Eesti töösuhete õigusliku reguleerimise põhimõtteid; \n- Selgitama Eesti sotsiaalkindlustuse põhiinstituute ning sotsiaalkindlustuse harude õigusliku\nreguleerimise põhimõtteid Eestis."}], "notes": {}}, "grading": {"independent_work": {"et": "Independent work with literature and court cases."}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"en": "A - The depth of the analysis and the level of independent interpretation are outstanding, the connections are comprehensive and inventive, the concept of the topic is novel, logical, the text as a whole is an outstanding achievement.\n\nB - Analysis of various connections, interpretation is bold and based on connections, the concept of the topic as a whole is logical and fluent.\n\nC - Analytical connections and interpretations are correct, confidence in creating connections, the concept of the topic is logical, but some weak points can be observed from the point of view of the whole.\n\nD - Analysis and independent interpretation comprehensible, but sometimes uncertain, the concept of the topic generally logical and connected.\n\nE - The elements of analysis and independent interpretation are present, the concept of the topic is generally logical, but the connections are patchy.\n\nF - No analysis, unclear treatment of the topic, no connections.\n", "et": "A - Analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, teemakäsitus uudne, loogiline, tekst tervikuna silmapaistev saavutus.\n\nB - Erinevate seoste analüüs, tõlgendamine julge ja seostele tuginev, teemakäsitus tervikuna loogiline ja ladus.\n\nC - Analüütilised seosed ja tõlgendused korralikud, kindlus seoste loomisel, teemakäsitus loogiline, ent terviku seisukohalt täheldatavad mõned nõrgad kohad.\n\nD - Analüüs ja iseseisev tõlgendamine arusaadav, ent kohati ebakindel, teemakäsitus üldjoontes loogiline ja seostatud.\n\nE - Analüüsi ja iseseisva tõlgendamise elemendid olemas, teemakäsitus üldjoontes loogiline, ent seosed lünklikud.\n\nF - Analüüs puudub, teemakäsitlus ebaselge, seosed puuduvad."}}], "grade_preconditions": {"et": "Participation in educational activities."}, "grade_evaluation": {"et": "The final grade will depend on the answers to the questions that will be asked during the oral examination."}, "grade_conditions": {"A": {"en": "The depth of the analysis and the level of independent interpretation are outstanding, the connections are comprehensive and inventive, the concept of the topic is novel, logical, the text as a whole is an outstanding achievement.", "et": "Analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, teemakäsitus uudne, loogiline, tekst tervikuna silmapaistev saavutus."}, "B": {"en": "Analysis of various connections, interpretation is bold and based on connections, the concept of the topic as a whole is logical and fluent.", "et": "Erinevate seoste analüüs, tõlgendamine julge ja seostele tuginev, teemakäsitus tervikuna loogiline ja ladus."}, "C": {"en": "Analytical connections and interpretations are correct, confidence in creating connections, the concept of the topic is logical, but some weak points can be observed from the point of view of the whole.", "et": "Analüütilised seosed ja tõlgendused korralikud, kindlus seoste loomisel, teemakäsitus loogiline, ent terviku seisukohalt täheldatavad mõned nõrgad kohad."}, "D": {"en": "D - Analysis and independent interpretation comprehensible, but sometimes uncertain, the concept of the topic generally logical and connected.", "et": "Analüüs ja iseseisev tõlgendamine arusaadav, ent kohati ebakindel, teemakäsitus üldjoontes loogiline ja seostatud."}, "E": {"en": "E - The elements of analysis and independent interpretation are present, the concept of the topic is generally logical, but the connections are patchy.", "et": "Analüüsi ja iseseisva tõlgendamise elemendid olemas, teemakäsitus üldjoontes loogiline, ent seosed lünklikud."}, "F": {"en": "F - No analysis, unclear treatment of the topic, no connections.\n", "et": " Analüüs puudub, teemakäsitlus ebaselge, seosed puuduvad."}}, "debt_elimination": {"et": "Repeating of the examination will be possible taking into account the internal rules of University of Tartu."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "materials": [{"name": {"et": "I-M. Orgo. Labour Law Reform in Re-independent Estonia. Juridica International 1996, pp 99-109."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "M. Muda. Improving Estonian Labour Legislation on Integration with Europe - Juridical International, 1996, pp 109-114."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "M.Muda. Prohibition of Discrimination in Labour Relations - Juridica International 1999, pp 189 - 199."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "T.Annus, A.Nõmper. The Right to Health Protection in the Estonian Constitution - Juridica International 2002, pp. 117-126."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Labor Markets and Social policy in Central and Eastern Europe, World Bank 2005."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Estonian report on Social Charter. Available: http://www.coe.fr Link - human rights."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "http://www.coe.fr"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Your Social Security Rights in Estonia. European Commission, 2022."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "d67d5c0e-9f1d-8adb-318f-bceb6ba57f15", "person_name": "Gaabriel Tavits", "structural_unit": {"code": "SVOI04TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI04"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Nädalad"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Schedule of lessons\nI Development of Social Rights: from ESSR to European Union 4hrs;\nII Right to work 8hrs;\nIII Right to social security 8hrs"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "ebbcc9a5-3ca8-ceb2-bab3-576e27d25c3d", "parent_code": "OIEO.05.031", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}