{"uuid": "f634376e-5407-fbb2-0e3a-13f9f842c684", "code": "OIEO.06.091", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-18T14:55:53", "title": {"en": "Artificial Intelligence and Law", "et": "Tehisintellekt ja õigus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "3dada822-0c69-5401-3594-cc7ee3ce0054", "code": "OI00.00.003", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "3dec95b2-2c88-c86f-c7c6-23b73806dc18", "code": "OI00.00.002", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "d0189a81-62f9-c1df-7f42-317da901e0da", "code": "P2OG.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "8d54607c-6f02-53df-0b37-8c456c3ded63", "code": "P2OG.00.003", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}]}]}, "overview": {"description": {"en": "The course provides an overview of the ethical and legal challenges of AI systems, (smart) robots and the  (European) legal framework, especially the AI Act.", "et": "Kursus annab ülevaate eetilistest ja õiguslikest väljakutsetest tehisintellekti süsteemide ja (tarkade) robotite kasutamisest kehtivas (Euroopa) õigusnormistikus ning (tulevikus) kehtivatest võimalustest nende tehnoloogiate kasutamist reguleerida."}, "objectives": [{"en": "Rapid progress in Artificial Intelligence (AI) and robotics (often operating with a form of AI) is challenging the traditional boundaries of law. AI systems are widely employed to make decisions that have an increasingly far-reaching impact on individuals and society. \nThis course examines the opportunities, but also the challenges of AI systems to the existing (European) legal order. Moreover, it provides an analysis of the recently adopted Artificial Intelligence Act of the European Union as well as several key initiatives at the international levels on AI ethics and regulation.", "et": "Kiire areng tehisintellekti (TI) ja robootika valdkonnas (mis tihti töötab teatud vormis TI tehnoloogial) esitab väljakutseid traditsioonilisele õiguse valdkonnale. TI süsteemid on laialdaselt kasutusel, võtmaks vastu otsuseid, mille kaugele ulatuvad tulemid avaldavad mõju indiviididele ja ühiskonnale.\nAinekursus uurib võimalusi, aga ka väljakutseid, mida TI süsteemid esitavad praegu kehtivale (Euroopa) õiguskorrale.\nLisaks annab see ülevaate mitmest võtmetähtsusega initsiatiivist eetika ja õigusregulatsioonide osas rahvusvahelisel ja Euroopa tasemel."}], "learning_outcomes": [{"en": "By the end of the course, students who have passed the subject will have knowledge and understanding of: ", "et": "Tudengid, kes läbivad õppeaine, on omandanud teadmised ja arusaamise: "}, {"en": "- the recent technological developments in the field of AI and robotics;", "et": "- viimase aja tehnoloogia arengutest TI ja robootika valdkonnas;"}, {"en": "- the most urgent ethical and legal issues raised by the use of AI systems and (smart) robotics;", "et": "- aktuaalsematest eetilistest ja õiguslikest küsimuskohtadest, mis on tekkinud TI süsteemide ja (tarkade) robotite kasutamisega;"}, {"en": "- applicable legislation, concepts, principles and regulation of AI systems and robotics within the European regulatory framework, especially the AI Act, and the case law of the Court of Justice of the European Union and the European Court of Human Rights in the relevant fields;", "et": "- kohaldatavast õigusnormistikust, kontseptsioonidest, printsiipidest ning TI süsteemidele ja robootikale kohaldatavatest Euroopa õigusraamistiku regulatsioonidest ning Euroopa Kohtu ja Euroopa Inimõiguste Kohtu viimasest kohtupraktikast;"}, {"en": "- key initiatives at the international levels on AI ethics and regulation;", "et": "- võtmetähtsusega eetika ja regulatsioonide initsiatiividest rahvusvahelisel ja Euroopa tasandil;"}, {"en": "- how to analyse legal questions regarding AI and robotics as well as understanding the economic, political and social implications of these technologies.", "et": "- kuidas analüüsida tehnisintellekti ja robootikat puudutavaid õiguslikke küsimusi, saades sealjuures aru nende süsteemide kasutamise majanduslikest, poliitilistest ja sotsiaalsetest mõjuteguritest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}