{"uuid": "1595eae7-980d-3782-bdd1-24d52a559534", "code": "sv-2024-spring-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-25T13:07:15", "title": {"en": "Environmental Law", "et": "Keskkonnaõigus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 8, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "2ea2e501-5cb6-9215-52ca-4328cb1c6a66", "code": "OIAO.05.039", "title": {"en": "Administrative Law", "et": "Haldusõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-27T08:42:31", "alternatives": [{"uuid": "69c6f551-0cd9-31b1-7f99-a18d8db57af5", "code": "P2OG.02.154", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Administrative Law", "et": "Haldusõigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The topics of the lectures and seminars of the Environmental Law course include the development of environmental law, the goals of environmental protection and environmental values, the main concepts and principles of environmental law, the levels of environmental regulation, the means of regulating environmental law, the rights and obligations related to the environment, compliance with environmental norms and verification thereof, environmental responsibility, and the foundations of regulating the most important fields of the special part of environmental law. The course includes learning about the court practice of the European Court of Human Rights, the Court of Justice of the European Union, and Estonian courts.", "et": "Keskkonnaõiguse loengute ja seminaride raames käsitletakse keskkonnaõiguse kujunemist, keskkonnakaitse eesmärke ja keskkonnaväärtusi, keskkonnaõiguse põhimõisteid ja põhimõtteid, keskkonnaalase regulatsiooni tasandeid, keskkonnaõiguse reguleerimisvahendeid, keskkonnaalaseid õigusi ja kohustusi, keskkonnaalaste normide täitmise jälgimist ja kontrolli, keskkonnavastutust ning keskkonnaõiguse eriosa olulisemate valdkondade regulatsiooni põhialuseid. Ainekursus hõlmab Euroopa Inimõiguste Kohtu, Euroopa Liidu Kohtu ja Eesti vastava kohtupraktika tundmaõppimist."}, "objectives": [{"en": "The aim of the Environmental Law course is to teach the theoretical bases of environmental law, explain the main concepts and principles of environmental law and the system of environmental rights and obligations, as well as to give an overview of the means of regulating environmental law and the most important levels of legal control over environmental nuisances.", "et": "Keskkonnaõiguse õppeaine eesmärk on õpetada keskkonnaõiguse teoreetilisi põhialuseid, selgitada keskkonnaõiguse põhimõisteid, põhimõtteid ning keskkonnaalaste õiguste ja kohustuste süsteemi. Samuti anda ülevaade keskkonnaõiguse reguleerimisvahenditest ja keskkonnahäiringute õigusliku kontrolli olulisematest tasanditest."}], "learning_outcomes": [{"en": "By the end of the course, the student:", "et": "Kursuse lõpuks üliõpilane: "}, {"en": "1. Explains the basic concepts and key principles of environmental law and uses them to solve environmental problems.", "et": "1. Selgitab keskkonnaõiguse põhimõistete ja olulisemate põhimõtete sisu ning kasutab neid keskkonnaõiguslike probleemide. lahendamisel."}, {"en": "2. Understands the different levels of environmental law (international, EU, national), their interrelationships and can choose the appropriate level of law for addressing an environmental issue.", "et": "2. Eristab keskkonnaõiguse regulatsiooni erinevaid tasandeid (rahvusvaheline, EL, siseriiklik), seostab neid omavahel ja oskab valida keskkonnaõigusliku probleemi lahendamiseks sobiva tasandi õigusakti."}, {"en": "3. Differentiates between regulatory instruments of environmental law and is able to assess the applicability of the legal regime of different regulatory instruments to specific life circumstances.", "et": "3. Teeb vahet keskkonnaõiguse reguleerimisvahenditel ning oskab hinnata erinevate reguleerimisvahendite õigusliku režiimi kohaldatavust konkreetsetele elulistele asjaoludele."}, {"en": "4. Knows the system of legal instruments to control environmental nuisances and understands its functioning.", "et": "4. Tunneb keskkonnahäiringute kontrolli õiguslike vahendite süsteemi ja mõistab selle toimimist."}, {"en": "5. Has an overview of the basic principles of the regulation of the most important areas of specialised environmental law.", "et": "5. Omab ülevaadet keskkonnaõiguse eriosa olulisemate valdkondade regulatsiooni põhialustest."}, {"en": "6. Can assess the role of teamwork in solving tasks and his/her own role in teamwork (key competences).", "et": "6. Oskab hinnata meeskonnatöö rolli ülesannete lahendamisel ning enda osatähtsust meeskonnatöös (võtmepädevused)."}], "notes": {}}, "grading": {"independent_work": {"et": "Seminaride ja loengute materjalide läbitöötamine\nIndividuaalsete koduste testide sooritamine\nKodutööna antud kaasusülesande lahendamine\nEksamiks ettevalmistamine\n\nDetailsemad juhised on Moodle'is."}, "grade_preconditions": {"et": "Eksamile pääsemise/hinde saamise tingimuseks on esimesel neljal seminarisessioonil osalemine ja arvestatud kirjalik kodutöö (kaasusülesande lahendamine). Kodutöö loetakse arvestatuks, kui see on esitatud tähtaegselt ning vastab kodutöö tegemise nõuetele (juhised on Moodle'is)."}, "grade_evaluation": {"et": "Maksimaalselt on võimalik koguda aines 100 hindepunkti, millest hinne kujuneb järgmises skaalas:\n100-91=A, 90-81=B, 80-71=C, 70-61=D, 60-51=E, 50-0=F.\nTudengid saavad kogu õppetöö jooksul hindepunkte ning eraldi hindepunkte annab ka eksam.\n\nÕppetöö jooksul on võimalik koguda kuni 44 punkti järgmiselt:\n1. Individuaalne kodune test (neli testi) - kuni 4 punkti, kokku individuaalsete testide eest kuni 16 punkti.\n2. Kollektiivne test seminaris (neli testi) - kuni 3 punkti, kokku kollektiivsete testide eest kuni 12 punkti.\n3. Seminari rühmatööd - ühe seminari rühmatööde eest kokku kuni 3 punkti, kokku rühmatööde eest kuni 12 punkti.\n4. Vastastikhindamine (rühmaliikmed hindavad üksteise panust rühmatöös) - kuni 4 punkti.\n\nTestide puhul on kõik küsimused võrdse kaaluga. MOODLE-i süsteem arvestab punktid automaatselt. Seminari rühmatööde puhul arvestatakse punkte eksami hindamiskriteeriumite alusel (3/2,25/1,5/0,75/0).\n\nEksam toimub auditooriumis ja suletud materjalidega. See koosneb kahest avatud küsimusest teooria kohta, mis eeldavad võrdlemist ja/või analüüsi. Iga vastus annab kuni 28 punkti. Hindamiskriteeriumid ühe küsimuse lõikes on järgmised:\n\n28 punkti - Küsimusele silmapaistev vastamine, ebatäpsusi praktiliselt ei esine.\n21 - Küsimusele ammendava vastuse andmine, väheolulised ebatäpsused.\n14 - Küsimusele vastamine heal tasemel, vastuses esineb olulisi ebatäpsusi.\n7 - Vastuses mitmed eksimused, vastus on vaid üldjoontes asjakohane.\n0 - Vastus ei ole asjakohane."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "f24750cc-0a74-45fb-bdbc-97d91197c942", "type": "MOODLE", "code": "OIEO.02.013_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "19500a91-551e-05b6-bbb3-284409105ed0", "person_name": "Mirjam Vili", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25, 29, 31, 38"}}, "registration_info": {"audience": {}, "min_students": 10}, "parent_uuid": "74f2f2fe-d7b1-46af-b363-75747670c027", "parent_code": "OIEO.02.013", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}