{"uuid": "fce3d867-7856-39aa-29a4-6838bb85562e", "code": "OIEO.04.141", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-23T11:40:41", "title": {"en": "Basics of Legal Research and Academic Communication Skills", "et": "Õigusteadusliku uurimistöö alused ja akadeemiline väljendusoskus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "To write a research paper on whichever level (research project, MA thesis, scientific article) one must have understanding on what constitutes scientific research and which are its requirements. This course prepares students for writing a research papers, i.e. it first provides students with overview of nature of scientific research and second which requirements students have to follow while writing a research paper. The latter include requirements for sources and for acknowledgement of such sources, requirements for different types of scientific papers, for formatting and for writing style. As in the course of writing a research paper students receive feedback, this course also deals with both receiving and giving feedback. In addition, advice is given on how to orally present ones ideas. As writing a research paper is a process, practical tips are given for planning time in a way that the scientific paper that meets all requirements is ready on time.", "et": "Mistahes tasemel õigusteadusliku uurimistöö (uurimistöö, magistritöö, teadusartikkel jne) koostamine eeldab arusaamist sellest, mis on õigusteadusliku uurimistöö olemus ja millised on sellisele tööle  esitatavad nõuded. Käesolev aine valmistab üliõpilase ette uurimistöö sisuliseks kirjutamiseks, st annab esmalt ülevaate sellest, millist uurimistööd saab üldse pidada õigusteaduslikuks ning seejärel sellest, milliste nõuetega tuleb arvestada uurimistööd kirjutama asudes. Viimased nõuded hõlmavad nii nõudeid kasutatavatele allikatele ja nendele viitamisele, nõudeid töö liigile (olenevad sellest, kas tegemist on uurimistööga, magistritööga, doktoritööga vms) ja vormistamisele ning nõudeid töö stiilile (sh sõnastusele). Kuivõrd uurimistöö kirjutamine eeldab ka sellele esitatud tagasiside vastuvõtmise oskust, käsitletakse käesolevas aines tagasisidestamisega (sh nii selle andmise kui ka vastuvõtmisega) seonduvat. Samuti antakse aines juhtnööre selles osas, kuidas enda uurimistöö teemapüstitust suuliselt esitleda. Kuna üliõpilastöö kirjutamine on protsess, antakse praktilisi nõuandeid selle kohta, mil viisil planeerida oma ajakasutust sel viisil, et etteantud tähtajaks valmiks õigusteaduslikule tööle esitatavatele nõuetele vastav töö."}, "objectives": [{"en": "The course gives an overview of the nature of academic legal research, of the requirements for used sources and correct acknowledgment of such sources, of different types of student research papers, of formal requirements for such papers and of proper academic style. Next to this, basic principles of giving oral presentations, of giving and receiving feedback, and of time management are dealt in the context of academic research.", "et": "Õppeaine annab ülevaate õigusteadusliku uurimistöö olemusest, sellise uurimistöö koostamisel kasutatavatele allikatele ja nendele viitamisele esitatavatest nõuetest, üliõpilastöö liikidest ja vormistamisnõuetest ning akadeemilise õigusteadusliku uurimistöö stiilinõuetest. Samuti käsitletakse õppeaines töö suulise esitlemise ja tagasisidestamise põhimõtteid ning ajakasutuse oskust akadeemilise uurimistöö kirjutamise kontekstis."}], "learning_outcomes": [{"en": "The student who successfully passes the course:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "- can describe nature of academic research;", "et": "- oskab selgitada akadeemilise uurimistöö olemust;"}, {"en": "- finds sources from legal and library databases necessary for his/her legal research", "et": "- leiab õigusalastest ja raamatukogu andmebaasidest enda uurimistööks vajalikke allikaid;"}, {"en": "- is able to critically assess if found source is suitable for academic research;", "et": "- hindab kriitiliselt leitud allika akadeemiliseks uurimistööks kasutamise kohasust; "}, {"en": "- is able to evaluate if a piece of writing meets academic style;", "et": "- oskab hinnata enda ja teiste tekstide vastavust akadeemilise stiili nõuetele;"}, {"en": "-  is aware and applies in practice formal requirements of law students' written papers depending on type of research paper;", "et": "- tunneb ja rakendab õigusteaduskonna üliõpilastöödele kehtestatud vorminõudeid sõltuvalt üliõpilastöö liigist;"}, {"en": "- knows general ethic requirements for compiling academic texts and is able to avoid plagiarism;", "et": "- teab akadeemiliste tekstide koostamise põhilisi eetilisi nõudeid ning oskab vältida plagiaati;"}, {"en": "- is able to plan time for preparing a research paper that meets requirements for academic writing on time;", "et": "- oskab õigusteaduslikule uurimistööle esitatavatele nõuetele vastava töö kirjutamist planeerida;"}, {"en": "- is able to present ones research orally;", "et": "- oskab kirjaliku teksti põhjal koostada suulise ettekande;"}, {"en": "- knows how to give and receive feedback.", "et": "- oskab vastu võtta ja anda tagasisidet."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}