{"uuid": "ebbcc9a5-3ca8-ceb2-bab3-576e27d25c3d", "code": "OIEO.05.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Developing Social Rights in Estonia: Right to Work and Right to Social Security", "et": "Sotsiaalsete õiguste areng Eestis: õigus tööle ja õigus sotsiaalkindlustusele"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is meant mainly for foreign students. During the course the development of social rights - right to work and to social security - in Estonia will be dealt with. The development will be observed starting from the re-independence till to present day. Main purpose is to give to the students an overview about the development and protection of social rights in transition country. Also the principles of legal regulation of social security and labour relations in Estonia will be dealt with.", "et": "Loengukursus on suunatud eelkõige välisüliõpilastele. Loengukursuse raames käsitletakse\nsotsiaalsete õiguste - õigus tööle ja sotsiaalkindlustusele - arengut Eestis alates\nEesti taasiseseisvumisest  kuni tänaseni. Loengukursuse peamine eesmärk on anda üliõpilastele ülevaade sotsiaalsete õiguste kujundamisest ja tagamisest ülemineku riigis. Samuti käsitletakse õppeaine raames erinevaid õiguslikke mehhanisme sotsiaalsete õiguste - õigus tööle ja õigus sotsiaalkindlustusele -tagamiseks. Õliõpilased saavad teadmised Eesti tööõiguse ja sotsiaalkindlustuse peamistes instituutidest."}, "objectives": [{"en": "Aim of the course is to give to the students knowledge about the Estonian labour law and social security law, about the constitutional guarantees of the right to work and right to social security in Estonia.", "et": "Üldeesmärgiks on anda üliõpilastele teadmised Eesti tööõigusest ja sotsiaalkindlustusõigusest,\npõhiseaduslikest garantiidest õigusele tööle ja õigusele sotsiaalkindlustusele."}], "learning_outcomes": [{"en": "At the end of the course a student is able to: \n- characterise constitutional guarantees for the right to work and right to social security in Estonia; \n- explain different institutes of Estonian labour law and the principles of legal regulation of employment relations in Estonia; \n- explain different institutes of Estonian social security law and the principles of legal regulation social security.", "et": "Kursuse lõpus on üliõpilane võimeline:\n- Iseloomustama Eesti põhiseaduslikke garantiisid õigusele tööle ja õigusele sotsiaalkindlustusele; \n- Selgitama Eesti tööõiguse põhiinstituute ning Eesti töösuhete õigusliku reguleerimise põhimõtteid; \n- Selgitama Eesti sotsiaalkindlustuse põhiinstituute ning sotsiaalkindlustuse harude õigusliku\nreguleerimise põhimõtteid Eestis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}