{"uuid": "14518e4e-c1f5-9349-d9d3-35f26d843149", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-06T16:29:02", "title": {"en": "Legal Steps in IPR Intensive Enterprise Life Cycle", "et": "Intellektuaalsel omandil baseeruva ettevõtte elutsükli õiguslikud aspektid"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 38, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "3dada822-0c69-5401-3594-cc7ee3ce0054", "code": "OI00.00.003", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "3dec95b2-2c88-c86f-c7c6-23b73806dc18", "code": "OI00.00.002", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "d0189a81-62f9-c1df-7f42-317da901e0da", "code": "P2OG.00.007", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Bachelor's Examination", "et": "Bakalaureuseeksam"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, {"uuid": "8d54607c-6f02-53df-0b37-8c456c3ded63", "code": "P2OG.00.003", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis", "et": "Lõputöö"}, "credits": 6, "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Covers various aspects of IPR Intensive Enterprise Lifecycle, including:\n1. IPR intensive enterprise life cycle stages, innovation and such companies business models\n2. IPR intensive business formation and structuring (including internationally)\n3. Key contractual matters in the company (relationships between founders, employees, sub-contractors) (keeping the IP in the company)\n4. Engaging in venture capital during these different stages of a company, negotiations\n5. Public funding (grants, EU funding, investor)\n6. IT company and smart employees: hiring foreign employees, motivation packages, migration issues, share-option plans.\n7. Development of IP Strategy (patents, but even more importantly IP protection without the use of patents)\n8. Taxation\n9. Accounting and Finance Planning\n10. Bankruptcy and IP.", "et": "Tegemist on erinevaid õigusvaldkondi hõlmava koondainega, mis käsitleb järgmiseid teemasid:\n1. IO-l baseeruvate ettevõtete elutsüklite ülevaade, innovatsioon ning erinevad ärimudelid\n2. IO-l baseeriva ettevõtte asutamine ning struktureerimine\n3. Peamised lepingulised suhted ettevõttes, kui eesmärgiks IO adekvaatne kaitse (asutajad, töötajad, alltöövõtjad)\n4. Risikikapitali kaasamine erinevates faasides, läbirääkimised\n5. Avalikud toetused, fondid\n6. IT ettevõte ja nn targad töösuhted: välistööjõu kaasamine, tööjõu motiveerimine, migratsiooniküsimused, optsioonid\n7. Ettevõtte IO strateegia kujundamine\n8. Maksuõiguslikud nüansid IO-l baseeruvas ettevõttes\n9. Raamatupidamine ja finantsarvestus seoses immateriaalse varaga\n10. Maksejõuetusõigus ning IO õigused."}, "objectives": [{"en": "The aim of the subject is to educate the participants to be prepared to consult IPR intensive enterprises in their different development stages. The great variety of  IPR related problems shall be analysed in combination with different legal topics to provide real life problem solving skills. \n\nIntellectual Property Rights (IPR) Intensive Enterprise life cycle comprises following stages: Seed, Start-up, Growth, Established, Expansion, Mature, Exit.\nThis course will prepare students for advising IT companies on legal matters related to establishing and maintaining successful companies during these stages of a company.", "et": "Aine eesmärk on koolitada osalejaid olema valmis nõustama intellektuaalsel omandil baseeruvaid ettevõtteid nende ettevõtete erinevates arengufaasides. Aine raames avatakse intellektuaalse omandi probleemistiku nüansirikkus lõimituna erinevate õigusvaldkondadega, andes võimaluse omandada reaalse elu probleemide lahendamise oskust. \n\nIntellektuaalsel omandil (IO) baseeruvate ettevõtete elutsükkel koosneb tavaliselt järgmistest etappidest: seemne faas, stardifaas, kasvufaas, stabiliseerumine, laienemisfaas, küpsusfaas, väljumine. Antud kursus koolitab osalejaid olema valmis taoliseid IO-l baseeruvaid ettevõtteid nõustama lähtuvalt nimetatud etappide eripäradest."}], "learning_outcomes": [{"en": "The student will:", "et": "Kursuse läbinu:"}, {"en": "* understand the different legal risks related to respective stages of an enterprise life cycle as every stage brings new challenges which require new approaches for successful resolution,", "et": "* mõistab erinevaid õiguslikke riske, mis taolistel ettevõtetel erinevates arengufaasides esineda võivad, ning oskab kujundada vajaliku tegevusstrateegia."}, {"en": "* understands connections between different IPR Intensive Enterprise life cycle parts and the relevant legislation;", "et": "* mõistab seoseid IO-l baseeruva ettevõtte elutsükli ning erinevate õiguse valdkondade vahel,"}, {"en": "* develop all necessary skills to assess and create legal strategies in support of various steps in an IPR Intensive Enterprise lifecycle.", "et": "* oskab hinnata ja luua juriidilisi strateegiaid, millega toetab ettevõtet erinevates arengufaasides."}], "notes": {}}, "grading": {"independent_work": {"et": "Compulsory homework: \nLegal Memorandum, deadline TBA. Online Submission"}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Final \"score A\" requires following:\n\nThe student:\n- Understands the different phases of the IT company life cycle, development of such companies and sees the legal risks related with different phases. Can provide examples how smart application of law may assist the company in different development phases.\n\n- Knows nowadays innovation processes and IT companies business models.\n\n- Knows main legal issues that should be solved during incorporation process and can propose adequate contractual regime. Understands corporate governance issues and can analyse the matters in its own domestic legal regime.  \n\n- Can map the main legal problems, that require contractual regulation inside IT company for securing its intellectual property and know-how. Can compose author's rights contract applicable in the employment relation.\n\n- Knows different possibilities in engaging private investment. Can propose different contractual regimes which can be used.\n\n- Knows different public funding options, which are suitable for encouraging IT companies business. Knows the general legal regime and main conditions relating with the application of the public funding.\n\n- Knows the migration rules applicable for \"smart positions\". Can solve practical exercise relating with the application of the residence permit for the third country employee.\n\n- Can map intellectual property objects and know-how in some sample company. Can distinguish different intellectual property objects. Knows the differences. Knows the main conditions for applying for the protection.\n\n- Can map the main legal risks relating to IP intensive enterprises and related contract services. Understands the meaning and importance of jurisdiction in such agreements. May be able to determine the applicable law in one case study. \n\n- Knows the main tax risks relating with the IT companies, its employees, start-up companies and can minimize such risks with relevant agreements or activities.\n\n- Knows the main principles of bookkeeping and financial reporting relating with the immaterial property.\n\n- Knows the insolvency principles and procedures relating with the immaterial property. Knows the sale process features relating with the immaterial property during the bankruptcy proceeding.\n\n- Knows about the competition law legal risks pursuant European Union laws that relate with the intellectual property intense companies (companies acting in dominant position, prohibited agreements and relation with licensing terms) and knows some contractual methods of minimizing such legal risks"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Final \"score B\" requires following:\n\nThe student:\n- Understands the nature of different phases of the IT company life cycle, development of such companies and connections between different development phases and law.\n\n- Knows nowadays innovation processes and IT companies business models.\n\n- Knows main legal issues that should be solved during incorporation process and map main contractual clauses relevant for ICT companies. Understands corporate governance issues. \n\n- Can map the main legal problems, that require contractual regulation inside IT company for securing its intellectual property and know-how. Can list the main conditions in the author's rights contract applicable in the employment relation.\n\n- Knows different methods in engaging venture capital investment.\n\n- Knows different public funding methods (grants) suitable for supporting the business of IT company. Knows some relevant conditions in the application processes.\n\n- Knows the rules relating with the \"smart employees\" migration. Can stipulate the main conditions, that should be taken into account when applying for the residence permit for the employee coming from third country.\n\n- Can map intellectual property objects and know-how in some sample company. Can distinguish different intellectual property objects. Knows the differences. Knows the main conditions for applying for the protection.\n\n- Can map the main legal risks relating the IP in IPR intensive enterprises. Understands the meaning and importance of jurisdiction in such agreements.\n\n- Knows the main tax risks of IT company (incl relating with its employees) and also tax risks in start-up company.\n\n- Knows the main principles of bookkeeping and financial reporting relating with the immaterial property.\n\n- Knows the insolvency principles and procedures relating with the immaterial property. Is aware of the sale process relating with the immaterial property during the bankruptcy proceeding.\n\n- Can map some competition law legal risks pursuant European Union laws that relate with the intellectual property intense companies (companies acting in dominant position, prohibited agreements and relation with licensing terms etc)."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A final \"score C\" requires following:\n\nThe student:\n- Understands the different phases of IT company life cycle, development of such company and can specify interconnections with law.\n\n- Knows nowadays innovation processes and IT companies business models.\n\n- Knows the main legal issues that should be regulated while establishing ICT focused company.\n\n- Can map the some legal problems, that require contractual regulation inside IT company for securing its intellectual property and know-how.\n\n- Knows different methods/structures for engaging foreign capital.\n\n- Knows different public funding possibilities (grants) that are suitable for supporting IT company business.\n\n- Knows the migration rules relating with the \"smart employees\".\n\n- Can map intellectual property objects and know-how in some sample company. Can distinguish different intellectual property objects. Knows the differences.\n\n- Can map some legal risks relating with the IP in IPR intensive enterprises.\n\n- Knows some tax risks of IT companies (incl. relating with its employees) and also some tax risks relating with start-up companies.\n\n- Knows the principles of bookkeeping and financial reporting relating with the immaterial property.\n\n- Knows the insolvency principles and procedures relating with the immaterial property.\n\n- Can mention some competition law legal risks pursuant European Union laws that relate with the intellectual property intense companies or mention some sample case."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A final \"score D\" requires following:\n\nThe student:\n- Knows nowadays innovation processes and IT companies business models.\n\n- Can map some legal problems that should be regulated during the incorporation.\n\n- Can map the some legal problems that require contractual regulation inside IT company for securing its intellectual property and know-how.\n\n- Can mention some method on engaging foreign capital and some public funding possibility (grant).\n\n- Can mention different intellectual property objects and know-how in some sample company.\n\n- Can mention some tax risks of IT companies (incl. relating with its employees) and also some tax risks relating with start-up companies."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A final \"score E\" requires following:\n\nThe student:\n- Knows some legal issues that should be regulated while establishing ICT focused company. \n\n- Can mention some method on engaging private capital and some public funding possibility (grant).\n\n- Can mention different intellectual property objects and know-how in some sample company and map some legal relationship that requires special regulation inside company for securing company IP rights.\n\n- Knows some tax risks of IT companies (incl. relating with its employees) and also some tax risks relating with start-up companies."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "See under \"Independent work and instructions for performing it\""}}], "grade_preconditions": {"et": "Compulsory participation in 4 seminars: TBA\nSubmission and positive score in legal memo writing (Homework)\n\nParticipation in the compulsory seminars towards obtaining the points involves active participation and engagement in the discussions."}, "grade_evaluation": {"et": "Final score of the subject (total 100 points) shall be composed as followings:\n\n1) Participation in compulsory seminars (4 seminars may provide in total 12 points);\n- Participation in marked 4 seminars is compulsory;\n- In every compulsory seminar the student may collect maximum 3 points for the active participation (participation in the discussions);\n- Participation in the compulsory seminars towards obtaining the points involves active participation and engagement in the discussions;\n\n2) Legal memo assignment provides maximum of 13 points;\n\n3) Final exam in subject: max 75 points.\n\n4) Additional 3 points for participation in legal clinic (if celebrated)"}, "debt_elimination": {"et": "According to the Study Regulations (õppekorralduseeskiri)"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://www.moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "0604a8e2-e043-4f35-90a7-f263284c9b81", "type": "MOODLE", "code": "OIEO.06.081_Eng", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "011e8db4-282b-c156-da9b-b035beb39793", "person_name": "Birgitta Ots", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "9f9e0052-40cc-0bda-00d5-aeb057e36051", "person_name": "Ellen Elvira Tulvik", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "1561bc45-46a1-6620-2912-4d75a44b3b86", "person_name": "Liisi Jürgen", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "682b7dcd-0c26-43b9-d38c-34acd7e06b2a", "person_name": "Mikk Putk", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "df48a101-92c0-769a-4e0e-77d959d3b1e4", "person_name": "Marta Cantero Gamito", "structural_unit": {"code": "SVOI01TR", "name": {"en": "Tartu Office", "et": "üldosakonna Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI01"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture: Introduction & Different ICT business models and business models based legal risk analysis. How to write a legal memo\n\nSuggested reading (not compulsory)\nRobbins-Tiscione, K. K. (2008). From Snail Mail to E-Mail: The Traditional Legal Memorandum in the Twenty-First Century, Journal of Legal Education, 58(1), 32-60."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lectures: Employment matters\n\nCompulsory readings:\n\n1. Directive (EU) 2016/943 of the European Parliament and of the Council of 8 June 2016 on the protection of undisclosed know-how and business information (trade secrets) against their unlawful acquisition, use and disclosure\n\n2. Council Directive 2009/50/EC of 25 May 2009 on the conditions of entry and residence of third-country nationals for the purposes of highly qualified employment\n\n\nRecommended:\n\n1. Proposal for a Directive on the conditions of entry and residence of third-country nationals for the purposes of highly skilled employment"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lectures: Venture capital. Case studies \n\nCompulsory literature:\nFinancing Company_ Venture Deals ­ Be Smarter Than Your Lawyer and Venture Capitalist_Ch 3-6, 8 (pdf will be uploaded on Moodle)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Compulsory Seminar I: Employment matters and venture capital (By TBA students will receive the cases to prepare for the seminar)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture. Company law issues \n\nSuggested literature (before lecture):\n1. John Armour, Legal Capital: An Outdated Concept?\n2. Luca Enriques, Jonathan R. Macey, Article: Creditors Versus Capital Formation: The Case Against the European Legal Capital Rules.\n3. Eilis Ferran, Corporate transactions and financial assistance: shifting policy perceptions but static law\n4. Robert Flannigan, Fiduciary Duties of Shareholders and Directors.\n5. John Hendry, Paul Sanderson, Richard Barker, John Roberts, Responsible Ownership, Shareholder Value and the New Shareholder Activism.\n6.Corporate Governance, Value Creation and Growth - The Bridge between Finance and Enterprise."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture: Company law issues. Compulsory seminar III: Company law issues\n\nSuggested literature (to read before seminar):\n1.Spyridon V. Bazinas, The impact of insolvency on IP licences in the work of UNCITRAL\n2.Mayer Brown, Help! My Licensor/Licensee Has Gone Insolvent - What Can I Do?\n3.Jones Day, (Cross-)License Agreements in German Insolvency Proceedings: An Update\n4.L. P. Harrison III, Eric Stenshoel; Protecting the Rights of IP Licensors, Licensees in Bankruptcy"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture: Accounting and financial reporting. \nIntangible assets"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture: Tax aspects in ICT companies\n\nSuggested literature:\n1.OECD. Model Tax Convention on Income and on Capital. Condensed version 2017. (Official commentaries to the OECD Model Tax Convention). Commentary on Article 12 (royalties). Free of charge online version available here \nAlternatively, possible to download as pdf for £ 53 from the same OECD webpage. The main focus is on Article 12 (royalties) but of course it is useful to read other parts in case of interest.\n2.OECD/G20 Base Erosion and Profit Shifting Project. 2015 Final Reports. Executive Summaries: \nIncludes multiple topics, any of them could be further investigated in case of interest.\n3.Multilateral Convention to Implement Tax Treaty Related Measures to Prevent BEPS - in case of further interest (particularly Explanatory Statement)."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Compulsory homework: (Legal Memorandum) Submission ONLINE. Topic(s)/case study will be published TBA"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture: ICT company IP strategy\n\nGeneral reading materials (to read before the lecture):\n1.Your Guide to IP Management in International Business\n2.Risky business: the five biggest IP mistakes startups make  \n3.Patent protection for software-implemented inventions\n4.Your Guide to IP and Contracts\n\nCase studies\n1.Integrating ICT creates solutions for the Internet of Things\nMore examples on EPO website. \n2.Revolutionizing Digital Content Distribution using Patented Technology\n3.An IP Strategy for Success\nMore examples on WIPO website"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture. New challenges for IPR-intensive enterprises \n\nRequired reading:\n- European Parliament resolution of 20 October 2020 on intellectual property rights for the development of artificial intelligence technologies https://www.europarl.europa.eu/doceo/document/TA-9-2020-0277_EN.html\n\n- K. Stephens and T. Bond (2018), AI - Navigating the IP challenges. Practical Law Magazine. July 2018 https://www.twobirds.com/~/media/pdfs/ai--navigating-the-ip-challenges-plc-magazine-june-2018.pdf?la=en\n\n- Gürkaynak, G., Yilmaz, I., Yesilaltay, B., & Bengi, B. (2018). Intellectual property law and practice in the blockchain realm. Computer law & security review, 34(4), 847-862. [Compulsory only from section 5 'Blockchain's potential areas of use in IP law', p. 856, but the rest of the article is interesting too for background info]. https://www.gurkaynak.av.tr/docs/8c65a-ip-law-and-practice-in-the-blockchain-realm.pdf\n\nAdditional reading:\n- Pearlman, R. (2017). Recognizing artificial intelligence (AI) as authors and investors under US intellectual property law. Rich. JL & Tech., 24, i.\nhttps://heinonline.org/HOL/Page?handle=hein.journals/jolt24&id=213&collection=journals&index=\n\n- Hallevy, Prof. Gabriel, AI v. IP - Criminal Liability for Intellectual Property IP Offenses of Artificial Intelligence AI Entities (November 17, 2015). Available at SSRN: https://ssrn.com/abstract=2691923  or http://dx.doi.org/10.2139/ssrn.2691923 \n\n- Cerka, P., Grigiene, J., & Sirbikyte, G. (2015). Liability for damages caused by artificial intelligence. Computer Law & Security Review, 31(3), 376-389. https://www.sciencedirect.com/science/article/pii/S026736491500062X?casa_token=Q9V1J22gFe8AAAAA:6oPYfpCMsOU0viJfHBL8us8CnY35mcp9uDqDr_ecZ18RI19X8bYbzpZpOELaLEkSeFAVJdDE\n\n- M. Stankovic, Is Intellectual Property ready for Blockchain? Medium, 2019."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Compulsory Seminar IV: Case studies + Legal analysis + legal memorandum writing: feedback and preparation for exam."}}]}, "registration_info": {"audience": {"et": "28-31"}, "min_students": 0, "max_students": 20}, "parent_uuid": "b2df5003-2eb8-9da9-09ae-46c44682c3b6", "parent_code": "OIEO.06.081", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}