{"uuid": "e28d198c-63cb-ad7e-9ae1-27adfab5aa96", "code": "OIEO.06.093", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-30T14:21:24", "title": {"en": "Law of Economics", "et": "Majandusõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces the freedom of economic activities, the applicable restrictions and current\nframework for public as well as private sector activities on the market, and refers to contact points for private and public sectors when operating on the market. The course concerns the following disciplines in equal measure: economic administrative law, competition law and public procurement law.", "et": "Aine tutvustab majandustegevuse vabadust, kaubaturul tegutsemise piiranguid ja reeglistikku nii avaliku kui erasektori jaoks ning osutab avaliku ja erasektori kokkupuutepunktidele kaubaturul tegutsedes. Aine\nkäsitleb võrdväärsetes mahtudes järgmisi õigusvaldkondi: majandushaldusõigus, konkurentsiõigus\nja riigihankeõigus."}, "objectives": [{"en": "The purpose of the course is to introduce the legal framework of operating on the market both for the private and the public sector, by providing the fundamental knowledge of the following disciplines: administrative economic law, law of competition and state aid, public procurement law. The course also gives basis for further individual legal research in the area.", "et": "Aine eesmärgiks on tutvustada kaubaturul tegutsemise õiguslikku raamistikku nii avaliku kui erasekori jaoks, andes alusteadmised järgmistest distsipliinidest: majandushaldusõigus, konkurentsiõigus ja riigiabi, riigihankeõigus. Ühtlasi annab aine alusteadmised edasiseks iseseivaks õigusteaduslikuks uurimistööks õpitud valdkonnas."}], "learning_outcomes": [{"en": "Having successfully passed the course, a student:\n- knows the system of regulatory framework concerning operating on the market, under Estonian law - PS, MSÜS, KonkS, RHS - and on the level of primary and secondary EU law, as well as the related main case-law;\n- can recognize breaches of the area's general principles and apply the law towards typical cases;\n- use a suitable methodology for analyzing the cases in the area, incl. the interaction of national and EU law;\n- can choose a suitable legal remedy or supervision option in the case of typical breaches of law in the area.", "et": "Aine edukalt läbinud tudeng:\n- tunneb kaubaturul tegutsemist puudutava reeglistiku süsteemi nii Eesti õiguses - PS, MSÜS, KonkS, RHS - kui EL esmase ja teisese õiguse tasemel ning sellega seonduvat peamist kohtupraktikat;\n- oskab tuvastada valdkonna üldpõhimõtete rikkumisi ning tüüpiliste kaasuste asjaolusid subsumeerida;\n- kohaldab valdkonna kaasuste analüüsimisel asjakohast metoodikat, arvestades mh riigisisese ja EL õiguse koosmõju;\n- oskab valida valdkonnas esinevate tüüpiliste õiguserikkumiste korral sobiva õiguskaitsevahendi või\njärelevalve võimaluse."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}