{"uuid": "bf0a8def-77ce-7721-7cd4-95627cf49676", "code": "sv-2016-spring-openuniv-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "EU Regional Policy and Cohesion Policy", "et": "EL regionaal- ja ühtekuuluvuspoliitika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2016", "et": "2016/2017", "en": "2016/2017"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "16/17 S block mode SV", "et": "16/17 K SÕ SV"}}, "general": {"year": {"code": "2016", "et": "2016/2017", "en": "2016/2017"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Students taking this course are expected to better understand and explain regional development through European Regional Policy. By analyzing the origins, evolution and current operation of European regional Policy, students will be confronted with key issues regarding European integration, in particular its economic, institutional and decision making set up. They will also have the opportunity to explore the dilemmas facing the future of European regions i.e. enlargement, institutional reforms and the impacts of the single currency and the Single Market. Throughout the course, students will get acquainted with the role of the regions in the integration process and the related multi-level governance aspects.", "et": "Kursuse keskseteks teemadeks on: perifeeria olemus seoses keskustega; perifeeria majanduslik konkurentsivõime - pikaajalised trendid ja kriisi mõjud; perifeeria võrgustavas majanduses - globaliseerumine ja tootmisahelad;  perifeeriate ühenduvus - transport, IT; rajasõltuvus ja sotsiaalne innovatsioon; perifeerne identiteet ja kultuur arengutegurina; avaliku võimu ja poliitikate roll arengu suunamisel - institutsioonid, poliitikameetmed ja isiksused; riikide haldus-territoriaalne korraldus ja regioonide autonoomia; strateegiline planeerimine ja arendustegevuse teadmistepõhisus.\n\nMeetodid, mida õpitakse: kvantitatiivne andmeanalüüs, indikaatorid ja indeksid, võrdlev territoriaalanalüüs, dokumendianalüüs, intervjuu, espertmeetodid, hindamismeetodid.\n\nKursuse märksõnad: perifeeria, sotsiaal-majanduslik areng, regionaalne geograafia, regionaalsed poliitikad, poliitikate sekkumise hindamine."}, "objectives": [{"en": "The course focuses on regional development and the role of the regions in the different stages of the European integration process. It looks more widely at economic and social cohesion as a central objective of the European Union and its wider implications for Europe as a whole. The course addresses four main aspects of the EU's regional policy: theoretical foundations and models of regional development; economic and social cohesion; regional policy at work; governance and regional implications of decentralization. In conclusion, the course will discuss the future of European regional policy and the challenges ahead in a globalized world.", "et": "Aine eesmärgiks on suurendada teadmisi regionaalsete arengueristuste olemusest ja põhjustest, ebaühtlasest regionaalarengust ning EL regionaalpoliitikast, samuti arendada oskusi teadmistepõhiste arenduspoliitikate välja töötamisel."}], "learning_outcomes": [{"en": "Upon completion of this course students should:\n- be able to frame disparities among Member states and identify their causes over time\n- identify key objectives, actors, and policy instruments of the cohesion policy\n- critically understand the origins of European regional policy\n- be aware of the economic, institutional and political significance of regions in Europe today\n- identify the new instruments of European regional policy and how they relate to globalization and accelerated technological change", "et": "Kursuse lõpuks üliõpilane:\n-\tMõistab regionaalse arengu olemust ja nimetab arengu tegureid, perifeeria ja keskuste omavahelisi seoseid\n-\tNimetab olulisemaid EL, riiklikke, regionaalseid ja kohalikke poliitikaid, mis kujundavad regioonide arengut\n-\tDefineerib strateegilise planeerimise ja ruumiplaneerimise põhimõtetest\n-\tKasutab rahvusvahelisi võrdlevaid andmebaase territoriaalsete üksuste iseloomustamisel ja tüpologiseerimisel\n-\tViib iseseisvalt läbi dokumendianalüüsi, sõnastab uurimiseesmärke ja tulemusi ning neid kaitseb\n-\tKoostab intervjuukava, teostab intervjuusid ning analüüsib kriitiliselt intervjuude vastuseid ühendatuna dokumendianalüüsiga\n\n-\tRakendab teadmisi poliitikavalikute eelhindamisest\n\n\nVõtmepädevused: mõtestamise võime, sotsiaalne intellekt, uudne ja kohanemisvõimeline mõtlemine."}], "notes": {}}, "grading": {"independent_work": {"et": "Ülesannete lahendamine: Juhtumi käsitlemiseks ja praktiliste tulemuste saavutamiseks täidavad kursusel osalejad erinevaid ülesandeid: iseseisev töö kodutööna ning rühmatöö seminaris. Ülesannete lahendamise oluliseks osaks on kursuse juhendaja poolt koordineeritud rühmatööd ja üritused.\n\nÜlesanne 1: Perifeersuse indikaatorite valik ja indeksi koostamine. \nKodutöö: Kodutöö\n*\tValida Eurostat andmebaasist välja 3 indikaatorit, mis võimaldavad kõige paremini kirjeldada NUTS 3 regioonide sotsiaal-majanduslikku perifeersust\n*\tTõsta kõigi 3 indikaatori andmed aasta 2012 kohta Excel tabelisse (1. Veerg regioon; 2-4 veerg andmed)\n*\tMäärata iga indikaatori jaoks piirväärtus, millest alates regiooni tuleks pidada perifeerseks\n*\tNormeerida 3 indikaatori väärtused selliselt, et neid saaks omavahel liita, korrutada, vms.\n*\tEsitada eraldi iga indikaatori andmedefinitsioonid (vt. Metadata)\n*\tEsitada eraldi lühike põhjendus, miks need 3 on parimad indikaatorid EL NUTS 3 regioonide sotsiaal-majandusliku perifeersuse mõõtmiseks\nRühmatöö 2-3 rühmas: perifeeruse indeksi koostamine EL NUTS 3 regioonide jaoks\n*\tIndikaatorite kokku leppimine\n*\tNormeerimisviisi kokku leppimine\n*\tIndikaatorite kaalude kokku leppimine\n*\tIndeksi arvutustabeli koostamine ja indeksi väärtuste arvutamine\n*\tTulemuste võrdlemine (nt. Eesti regioonide osas)\nÜlesanne 2: Perifeeruse probleemide ja nende põhjuste kaardistamine. \nKodutöö: ESPON rakendusuuringu teadusliku raporti lugemine ja Powerpoint kokkuvõtte koostamine: 1) uuringu üldised eesmärgid ja tulemused; 2) uuringu fookuse tõlgendus perifeersuse probleemi ja lahenduste vaatepunktist\nValikusse kuuluvad (http://www.espon.eu/main/Menu_Projects/Menu_AppliedResearch/): täpsem valik sõltuvalt osalejate arvust\nRühmatöö: ESPON rakendusuuringute esitlemine ja arutelu. Perifeeruse probleemide ja põhjuste kaardistamine rühmatöös - üldised perifeerususe \"probleemikaardid\"\nÜlesanne 3: Lõuna-Eesti senise strateegilise arendustegevuse analüüs ja hindamine\nKodutöö: Lõuna-Eesti regiooni arengukavade lugemine:\n*\tNutikas spetsialiseerumine\n*\tTRIS\n*\tMaakondlikud arengukavad\n*\tTartu linna arengustrateegia\nLugemise fookus: Mis on regioonide kesksed arenguprobleemid - takistused, väljakutsed, nõrkused? Millised on välja pakutud lahendused? (sisu; lahenduste tulemuslikkus probleemide ja eesmärkide valguses; teostatavuse realistlikkus - ressursside piisavus, olukorra hinnangu adekvaatsus; säravad elluviimist väärivad ideed)\nRühmatöö: Lõuna-Eesti probleemid ja lahendused arengudokumentide põhjal - ühtse arusaamise vormistamine arutelus\nÜlesanne 4: Euroopa riikide arendusideedega tutvumine ja hindamine\nKodutöö ülesanne: ESPON juhtumiuuringute lugemine ja kirjalik analüüs: \nRühmatöö: ESPON heade arendusideede tutvustamine ja arutelu\nÜlesanne 5: Särava arendusidee, mis vähendab Lõuna-Eesti perifeersust Euroopas, välja töötamine\nKodutöö: idee sõnastamine, seostamine perifeersuse probleemide  ja muutmisvajadusega, eelhindamine (sh SWOT-analüüs) - 1-2 lk. ; idee vormistamine meediatootena (nt. ajaleheartikkel) ning edastamine maksimaalselt suurele auditooriumile\nRühmatöö: Arendusidee ja PR aktsiooni tulemuslikkuse tutvustus. Arutelu ühise visiooni üle - perifeeriast Euroopa tuumregiooniks. Idee ESPON uurimisprojektiks - mida oleks vaja veel teada, et Lõuna-Eesti viia viie rikkama regiooni sekka."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "1. Kodutööde 1-4 (indikaatorid, EL regionaalarengu temaatilised probleemid, L-Eesti probleemid ja lahendused, parim praktika Euroopast) kirjalikud väljundid - 20%\nIga töö 5%, sh 3 % ülesande osade täitmise eest ja 2% headuse eest"}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "2. Rühmatööde 1-4 (indeks, väga lühike ettekanne, probleemipuud, ??) osalus, esinemine, ideed - 20%\nIga töö 5%, sh 3 % kohaolu ja osalus ja 2% headuse eest"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "3. Arendusidee/projekti koostamine - 15%\n10% ülesande osade täitmise eest (ideed sõnastus, eelhindamine) ja 5% headuse eest"}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "4. Arendusidee ühiskonnale tutvustuse edukus (auditooriumi reach) - 15%\nVõrdlev meetod (max tulemus alates üleriigilise ajalehe arvamuslugu)"}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "5. Loengute ja iseseisva lugemise kirjanduse teadmiste kontroll kirjaliku testi kujul - 30% (10 küsimust)"}}], "grade_preconditions": {"et": "Õppetöö osad kajastuvad lõpphindes järgmiselt: \n- rühmatöös osalemise aktiivsus ja tulemuslikkus;\n- kirjalikud tööd;\n- arendusidee PR \"kampaania\";\n- kirjalik test."}, "grade_evaluation": {"et": "Kursus on eristatava hindamisega. Hinne moodustub rühmatöös osalemise aktiivsuse ja tulemuslikkuse, iseseisvate kirjalike tööde ning teadmiste testi baasil.\nLõpphinne kujuneb õpiosaülesannete punktide/protsentide liitmisel vastavalt määruses \"Ühtne hindamissüsteem kõrgharidustasemel\" kirjeldatud reeglitele.\n\n1. Kodutööde kirjalikud väljundid - 20%\n2. Rühmatöö osalus ja esinemised - 20%\n3. Arendusidee välja töötamine ja eelhindamine - 15%\n4. Arendusidee ühiskonnale tutvustuse edukus (auditooriumi reach) - 15%\n5. Loengute ja iseseisva lugemise kirjanduse teadmiste kontroll kirjaliku testi kujul - 30%"}, "debt_elimination": {"et": "Kokkuleppel õppejõududega"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "- Michael E. Porter (1990). The Competitive Advantage of Nations. Harvard Business Review, lk 73-91\n- The World Bank  (2009)  Reshaping Economic Geography. World Development Report 2009.\n- Laya Maynou et al (2014). The Impact of Structural and Cohesion Funds on\nEurozone Convergence, 1990-2010. Regional Studies. \n- Dominique Foray et al (2012). Guide to Research and Innovation Strategies for Smart Specialisation (RIS 3)\n- COMMUNICATION FROM THE COMMISSION TO THE COUNCIL, THE EUROPEAN PARLIAMENT, THE COMMITTEE OF THE REGIONS AND THE EUROPEAN ECONOMIC AND SOCIAL COMMITTEE. Green Paper on Territorial Cohesion. Turning territorial diversity into strength {SEC(2008) 2550}\n- Fabrizio Barca (2009). AN AGENDA FOR A REFORMED COHESION POLICY. A place-based approach to meeting European Union challenges and expectations. Independent Report\nprepared at the request of Danuta Hübner, Commissioner for Regional Policy\n- Territorial Agenda 2020 - Towards an Inclusive, Smart and Sustainable Europe of Diverse Regions. Agreed at the Informal Ministerial Meeting of Ministers responsible for Spatial Planning and Territorial Development\non 19th May 2011, Hungary\n- Kai Bohme et al (2011). How to strengthen the territorial dimension of 'Europe 2020' and the EU cohesion policy. Report based on the Territorial Agenda 2020\n- Raagmaa, Garri; Kindel, Grete; Lüsi, Matti (2012). Leadership and institutional change: Economic restructuring, sense of place and social capital in Emmaste, Estonia. in Leadership and Change in Sustainable Regional Development. (Toim. Markku Sotarauta et al), lk 164-189)\n- MONITORING AND EVALUATION OF EUROPEAN COHESION POLICY. The Programming Period 2015-2020: European Regional Development Fund; European Social Fund; Cohesion Fund. Guidance document on ex-ante evaluation", "recommended_materials": "- Eric Sheppard and Trevor J. Barnes (2008): A Companion to Economic Geography.\n- Simin Davoudi and Ian Strange (2009): Conceptions of Space and Place in Strategic Spatial Planning.\n- Elias G. Carayannis, Dimitris Assimakopoulos and Masayuki Kondo Innovation Networks and Knowledge Clusters. Findings and Insights from the US, EU and Japan.\n- Daniel Felsenstein (2001): Public investment and regional economic development.\n- Grzegorz Gorzelak et al.(2010): Regional development in central and eastern Europe: development processes and policy challenges.\n- Kevin Morgan and Claire Nauwelaers (2004):  Regional innovation strategies : the challenge for less-favoured regions.\n- Philip Cooke and Andrea Piccaluga (2006): Regional development in the knowledge economy.\n- Marina van Geenhuizen et al. (2005): Regional development and conditions for innovation in the network society.\n- Robert J. Stimson (2006): Regional economic development : analysis and planning strategy.\n- Ulrike Stierle-von Schütz et al (2008): Regional Economic Policy In Europe. New Challenges for Theory, Empirics and Normative Interventions.\n- Rupert Hodder (2000): Development Geography.\n- Roel Rutten, Frans Boekema (2007): The Learning Region. Foundations, State of the Art, Future.\n- Jane Pollard, Cheryl McEwan and Alex Hughes (2011): Postcolonial Economies.\n- Martin Sokol (2011): Economic Geographies Of Globalisation. A Short Introduction.\n- Philip Cooke, Carla De Laurentis, Franz Tödtling and Michaela Trippl (2007): Regional Knowledge Economies. Markets, Clusters and Innovation.\n- Masahisa Fujita, Paul Krugman, Anthony J. Venables, (2001): The Spatial Economy. Cities, Regions, and International Trade."}, "participants": {"lecturers": [{"person_uuid": "670084a8-92a7-6d9d-8f98-c8f1e1a8263d", "person_name": "Veiko Sepp", "structural_unit": {"code": "SVJS01", "name": {"en": "The Centre for Applied Social Sciences (CASS)", "et": "sotsiaalteaduslike rakendusuuringute keskus (RAKE)"}, "email": "rake@ut.ee", "phone": "+372 737 6378", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVJS"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24,27,29,31,34,36,39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45  Kursuse ülevaade (30 min); Loeng: Perifeeria mõiste ja olemus. Perifeeria Euroopa Liidus (60 min); Loeng: Sotsiaal-majandusliku perifeersuse mõõtmine ja indeksid: globaalse konkurentsivõime indeks, perifeerususe indeksid (80 min); Kodutöö ülesanne: perifeersuse indikaatorite valik Eurostatist (10 min)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45 Rühmatöö: Perifeersuse indeksi koostamine EL NUTS 3 regioonide jaoks  valitud indikaatoritest (80 min); Kodutöö ülesanne: ESPON programmi tutvustus ja rakendusuuringu analüütilise kokkuvõtte koostamine (10 min); Loeng: Perifeersus globaalses kontekstis: Imperialism ja kolonialism. Neokolonialism. Sõltuvusteooria. Moderniseerumisteooria. Maailmasüsteemi teooria. (90 min); Loeng: Regionaalse sotsiaal-majandusliku arengu kontseptsioonid. Neoliberalistlik konvergents. Evolutsiooniline majandusareng. Rajasõltuvus ja rajauuendus. Institutsionaalne majandusgeograafia. Riikide ja regioonide  konkurentsivõime(90 min)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45 Rühmatöö: ESPON uuringute ettekanded (a 5 min) ja perifeerse regiooni probleemide kaardistamine (probleemid, nende põhjused) (80 min); Kodutöö ülesanne: Lõuna-Eesti arengudokumentide lugemine (10 min); Loeng: Regionaalpoliitika paradigmad ja regioonide strateegiline arendamine. Ümberjagav ja kohapõhine regionaalpoliitika.  Regionaalse strateegilise planeerimise alused. (90 min)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45 Rühmatöö: Lõuna-Eesti probleemid ja lahendused arengudokumentide põhjal - ühtse arusaamise vormistamine (80 min); Kodutöö ülesanne: ESPON juhtumiuuringu analüüs: head arendusideed Euroopast (10 min); Loeng: EL regionaalpoliitika. Institutsioonid. Ühtekuuluvuspoliitika. Fondid. eesmärgid. EL regionaalpoliitika Eestis (90 min)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45 Rühmatöö: ESPON heade arendusideede tutvustamine ja analüüs (80 min); Kodutöö ülesanne:  Olulise perifeersust vähendava arendusidee välja töötamine, eelhindamine ja ühiskonnas tutvustamine. Intervjuu kava tunnetuspraktikaks (10 min); Loeng: Poliitikate/arendusideede eelhindamine (45 min); Loeng: PR, meedia  ja ideede maha müümine (45 min)"}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45 Perifeeria tunnetuspraktika. Esialgne kavatsus: Väljasõit Vara valda ja Välgi metsa - kohaliku elu/arengu väljakutsed ja võimalused süvaperifeerias (küsimused ja vastused); perifeeria väärtustamine"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "14.30-16.00; 16.15-17.45 Rühmatöö: PR kampaania tulemuste tutvustamine; Arutelu teemal Lõuna-Eesti Euroopa tuumregiooniks - visioon ja tegevuskava; Uurimisidee välja töötamine ESPON programmi jaoks (120 min); Teadmiste kontroll: test (60 min)"}}]}, "registration_info": {"audience": {"et": "Euroopa õpingute magistriõppe üliõpilased ja huvilised"}, "min_students": 10, "max_students": 30}, "parent_uuid": "d302e2fa-cbdf-f6c8-8be9-4b96e013cbca", "parent_code": "P2EC.00.209", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}