{"uuid": "8eb7a94f-f634-52a6-d5eb-29898fe47521", "code": "P2EC.00.248", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-02T10:38:47", "title": {"en": "EU Policy Making", "et": "Euroopa Liidu poliitika kujundamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course aims to give a systematic overview of the institutional structure of the EU and the interaction of the key actors and their impact on EU policy making. Following the introduction of the main institutions and their role, the course discusses politics, policies and polity (i.e. the institutions) of the EU. It provides a platform for understanding the functioning of the EU and discusses its implications for policy-making at multiple levels of government. An relevant part of the discussion is devoted to the contextualization of the different modes of governance,", "et": "Kursus on praktilise suunitlusega. Rõhuasetus on järgmistel küsimustel: kuidas ja kui hästi Euroopa Liidu poliitiline ja valitsemissüsteem toimib ning millised on võimalused süsteemi toimimist paremaks muuta? Ainekursus koosneb loengutest ja seminaridest, mis jagunevad seitsme õppesessiooni vahel, ja iseseisvast tööst. Teadmiste kinnistamisele aitavad kaasa veebipõhised lühitestid; samuti tuleb osalejatel koostada kirjalik analüüs, pidada lühike suuline ettekanne ning sooritada kirjalik lõppeksam."}, "objectives": [{"en": "The aim of this course is to give an overview and understanding of the main principles of EU policy-making process and rules and practices governing the decision-making within and among the relevant institutions and bodies. Students will learn directly from the analysis of the treaties and of the primary sources. Particular attention is also devoted to the inter-institutional dimension and to the role of the Member states.", "et": "Kursuse eesmärk on anda ülevaade Euroopa Liidu peamistest institutsioonidest - nende ülesehitusest, ülesannetest, toimimisest ja mõjust - ja poliitikakujundamise ning otsustetegemise protsessist. Samuti käsitleb kursus EL-i poliitikate elluviimist keerulises mitmetasandilises valitsemissüsteemis. Käsitleme ka küsimust, kuidas ja milliste kriteeriumite alusel Euroopa Liidu poliitilise ja valitsemissüsteemi toimimist võiks hinnata ning arutame erinevaid ettepanekuid liidu institutsioonide ja poliitikakujundamise protsessi reformimiseks."}], "learning_outcomes": [{"en": "Upon completion of the course, students will be able to: \n\n- Understand the mechanisms of policy-making in the EU and the institutional and policy-related processes; \n\n- critically assess the fuctioning and the roles of the main EU insitutions \n\n- contextualize and analyze the EU policy portfolio. \n\n- critically discuss the 'governance turn' in empirical and theoretical research on the EU; \n\n- Be able to critically examine the policy-related consequences of multi-level governance.", "et": "Olles kursuse läbinud, peaksid Sa:\n\n* oskama kirjeldada Euroopa Liidu viie peamise institutsiooni ülesehitust, rolli, ülesandeid, kujunemislugu, toimimist ja mõju;\n\n\n* suutma selgitada ja põhjendada, kuidas ja milliste kriteeriumite alusel Euroopa Liidu poliitilise ja valitsemissüsteemi toimimist võiks hinnata;\n* tundma peamisi mõisteid ja termineid, mida kasutatakse Euroopa Liidu institutsioonide ning poliitikakujundamise teemalises kirjanduses ja aruteludes;\n* oskama kirjeldada poliitikakujundamise protsessi Euroopa Liidus ning teadma, milline on peamiste institutsioonide, liikmesriikide, huvigruppide ja kodanike roll selles;\n* teadma, kuidas toimub õigusaktide vastuvõtmine seadusandliku tavamenetluse raames; olema kursis teiste peamiste EL-i otsustusmehhanismidega;\n* suutma selgitada, kuidas Euroopa Liidu poliitikaid rakendatakse ja mitmel tasandil ellu viiakse; tundma ja nimetama mitmetasandilise valitsemise probleeme ja kitsaskohti;\n* teadma, millised on peamised ettepanekud Euroopa Liidu institutsioonide ja poliitikakujundamise protsessi reformimiseks ning oskama neid ettepanekuid kriitiliselt hinnata."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}