{"uuid": "02ad8e2f-c856-b861-6a89-4c43ef83502d", "code": "P2EC.00.244", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Contemporary Challenges to European Integration", "et": "Euroopa integratsiooni nüüdisaegsed väljakutsed"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course has two main parts, which will run parallel. During the first part of each meeting, seven specific EU cases will be put central in the course; the actual choice of topics will be made as late as possible in order to stay close to actual developments. Students will be provided (on the course website) with basic material on these four policy areas, as well as relevant background academic resources (papers, articles). Each case is introduced and discussed, using the expertise of policy-makers and experts. In the second part of each meeting, following a students' presentation on the same topic, a seminar will be held, and students will get small (group) assignments to prepare beforehand. These assignments will vary for each case (preparation of some questions, policy note, presentation). Students will be assigned different roles (presenter/discussant, advocate/opponent) for these class meetings. Second, students are trained in understanding and using some simple tools/methods for policy analysis and communication, by means of four specific (group) assignments on the cases/issues.", "et": "."}, "objectives": [{"en": "The purpose of the course is to discuss a number of contemporary policy issues that currently define the EU political agenda, such as the war in Ukraine, the COVID-19 crisis, post-Brexit Britain's relations with Brussels, and migration. Students are trained to analyse various current EU policy problems and to design solutions to tackle these issues.", "et": "."}], "learning_outcomes": [{"en": "Upon completion of the course, students: \n\n- Use basic methods to analyse complex (\"wicked\") policy problems in the EU context (problem analysis/root cause analysis) \n\n- analyse the positions of various EU actors (institutions, Member States, other stakeholders) regarding such problems and regarding possible solutions (stakeholder analysis) \n\n- use foresight techniques for policy analysis and design (scenario-writing, Delphi method, brainstorming, expert consultations, trend extrapolations) \n\n- find relevant information from the EU databases (legislation, policy documents, EUROSTAT) and from specialized think-tanks/on-line media \n\n- effectively communicate on policy analysis and design, both orally and in writing \n\n- adequately provide and receive feedback to/from fellow students and from lecturers, in class-settings \n\nKey competences to be improved: sense making, novel and adaptive thinking, cross-cultural competency, transdisciplinarity, design mind-set, cognitive load management.", "et": "."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}