{"uuid": "d024e397-f659-6d5c-c67b-4f5bfce05e0a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-31T10:43:23", "title": {"en": "Master's Thesis (European Studies)", "et": "Magistritöö (Euroopa õpingud)"}, "credits": 15, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 390, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "71fcd2b4-4f38-9799-3abd-fdf3e2422f90", "code": "P2EC.00.250", "title": {"en": "Development Seminar", "et": "Arenguseminar"}, "credits": 9, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "3a305605-5faa-2c33-95e7-33be4145b4bc", "code": "P2EC.00.230", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Development Seminar", "et": "Arenguseminar"}, "credits": 15, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "An MA thesis is an independent research project that corresponds to the requirements of this guide and demonstrates the student's theoretical and practical knowledge, skills to use particular sources as well as the ability to formulate coherent arguments and express them in writing. An MA thesis is a clear and synthesized research paper where a clear problem statement is outlined and where scientific methods are used to analyze the object of study.\nThe course is connected with a development seminar that lasts through all four semesters, during which time the students will implement a specific project.", "et": "Magistritöö on iseseisvalt koostatud uurimistöö, mis näitab magistrandi teoreetilisi ning praktilisi teadmisi, oskust kasutada erialakirjandust, põhjendada oma seisukohti ja väljendada neid kirjalikult. Magistritöö on selge probleemipüstitusega analüüsiv uurimus, kus rakendatakse teaduslikke meetodeid konkreetse uurimisobjekti käsitlemiseks.\nAine on seotud eelnevalt läbitava ja läbi nelja semestri kestva arenguseminariga, mille jooksul viiakse ühiselt kogu kursusega ellu konkreetne projekt."}, "objectives": [{"en": "The aim of the course is to provides knowledge in a (specific) research field along with skills to write an MA thesis paper. Writing an MA thesis is compulsory and the topic of the thesis must be related to the EU.", "et": "Aine eesmärk on anda teadmised kitsamas (uurimis)valdkonnas koos oskusega koostada magistritasemele vastav kirjalik uurimistöö. Magistritöö kirjutamine on kohustuslik ja töö teema peab olema seotud Euroopa Liidu temaatikaga."}], "learning_outcomes": [{"en": "Upon completion of the course a student will:", "et": "Magistritöö kaitsnud üliõpilane: "}, {"en": "- plan and implement different acitivities to reach the aims set and play various roles within a group;", "et": "- planeerib ja viib ellu erinevaid tegevusi seatud eesmärkide saavutamiseks ning tunneb erinevaid meeskonnaliikmete rolle; "}, {"en": "- find solutions to a variety of theoretical and practical problems;", "et": "- pakkub erinevatele teoreetilistele ja praktilistele probleemidele omapoolseid lahendusi;"}, {"en": "- critically analyze the relevant literature published in English and Estonian, argue to demonstrate personal opinion, draw conclusions and generalize;", "et": "- kriitiliselt analüüsib asjassepuutuvaid inglise- ja eestikeelses kirjanduses avaldatud seisukohti, argumenteeritult esitab oma seisukohti ning teeb järeldusi ja üldistusi;"}, {"en": "- analyze the empirical material in selected areas;", "et": "- analüüsib empiirilist materjali ning tunneb valitud valdkonda;"}, {"en": "- fulfill the requirements to a scientific research and acquire competencies to apply various scientific research methods.", "et": "- rakendab erinevaid teadusliku uurimistöö meetodeid ning teab teadustöödele esitatavaid nõudeid."}, {"en": "Key competences to be improved: sense making, novel and adaptive thinking, social intelligence, transdisciplinarity, new media literacy, computional thinking, cognitive loead management, cross-cultural competency, design mindset, virtual collaboration.", "et": "Märksõnad: mõtestamise võime, uudne ja kohanemisvõimeline mõtlemine, sotsiaalne intellekt, transdistsiplinaarsus, uue meedia kirjaoskus, matemaatiline pädevus, info selekteerimine ja mälu, kultuuride ülesed pädevused, kujundlik mõtteviis, virtuaalne koostöö."}], "notes": {"et": "Komisjoni otsust on võimalik vaidlustada TÜ õppekorralduseeskirjas ette nähtud korras."}}, "grading": {"independent_work": {"et": "Magistritöö kirjutamine ja edukas kaitsmine lähtuvalt magistritööle esitatavatest Johan Skytte poliitikauuringute instituudi poolt ette nähtud nõuetest (vt Kirjalike tööde kirjutamise ja vormistamise juhend, Euroopa õpingute õpijuhis).\n\nEelkaitmiseks lõputöö esitamise tähtaeg on 3.detsember 2021 ja eduka eelkaitsmise puhul kaitsmiseks lõputöö esitatakse 7.jaanuaril Moodles."}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "due_date": "2021-12-17", "description": {"et": "Eelkaitsmine ei ole hindeline kuid töö hinnatakse lõputöö kaitsmise kriteeriumite vastavalt. Eelkaitsmise tulemusena võtab komisjon vastu ühe alljärgnevaist otsustest: suunata lõputöö kaitsmisele, suunata lõputöö kaitsmisele pärast paranduste sisseviimist, mitte suunata lõputööd kaitsmisele."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "due_date": "2022-01-21", "description": {"et": "Töö hinnatakse Johan Skytte poliitikauuringute instituudi sätestatud sisuliste ja vormiliste kriteeriumite järgi järgnevad:\n* uurimuse aktuaalsus;\n* töö teemale vastavus;\n* püstitatud eesmärgid (selgus, reaalsus jms) ja uurimisülesanded (kas nende täitmisel võib jõuda püstitatud eesmärgini);\n* töö struktuur (terviklikkus, tasakaalustatus, loogilisus);\n* arutluse tase j aandmematerjali sisukus (arutluse selgus, asjakohasus, põhjalikkus, õigsus ja loo¬gilisus, järelduste põhjendatus, materjali kombineerimise oskus, materjali adekvaatsus ja piisavus jms);\n* kirjanduse piisavus, aktuaalsus ja tase (nt teemakohased artiklid tunnustatud rahvusvaheliste ajakirjade värsketest väljaannetest või üksnes mõned ajaleheartiklid);\n* viitamise korrektsus (kas kõik faktid ja põhimõttelised seisukohad (väited, seoste kirjeldused jms) on algallikate põhjal kontrollitavad);\n* töö keeleline korrektsus;\n* vormistuse vastavus juhendi nõuetele;\n* püstitatud ülesanded ja eesmärgi saavutamine;\n* magistrandi teematundmist ja argumenteerimisoskust.\n\nHindamine on eristatatav TÜ-s kehtiva hindamisskaala järgi (\"suurepärane\" - A, \"väga hea\" - B, \"hea\" - C, \"rahuldav\" - D, \"kasin\" - E, \"puudulik\" - F)."}}], "grade_preconditions": {"et": "Magistriõppe õppekava on täidetud. Hindamisele pääsemise eelduseks on edukalt kaitstud magistritöö eelkaitsmisel.\n\nEelkaitsmised toimuvad vastavalt tunniplaanile hiljemalt viis nädalat enne magistritöö kaitsmist. \nEelkaitsmise korraldab (sh moodustab komisjoni, kinnitab päevakava ja võtab ühendust retsensentiga) programmijuht kooskõlastatult instituudi juhiga. Komisjon on vähemalt kolmeliikmeline ning komisjoni esimeheks on üldjuhul programmijuht. \nEelkaitsmiseks tuleb esitada lõputöö, mis on valmis vähemalt 75% ulatuses ja milles on olemas sisukord, lühendite loetelu (vajadusel), sissejuhatus, põhiosa peatükkidena, kasutatud kirjandus ja lisad. \nEelkaitsmine jäljendab lõppkaitsmise formaati ning selle käigus antakse heakskiit edasiliikumiseks või otsustatakse lõputöö kaitsmisele mitte lubada. Enne lõputöö eelkaitsmisele esitamist peab selleks loa andma juhendaja. \nLõputöö eelkaitsmiseks tuleb esitada instituudi õppekorralduse spetsialistile elektroonilisel kujul (PDF-vormingus) programmijuhi määratud tähtajaks. Samaks tähtajaks võib juhendaja esitada ka soovitused retsensendi valikuks. \nEelkaitsmiseks esitatud lõputöö peab olema kooskõlas instituudi kirjalike tööde vormistamise nõuetega. Eelkaitsmine ei ole hindeline. Eelkaitsmise tulemusena võtab komisjon vastu ühe alljärgnevaist otsustest: suunata lõputöö kaitsmisele, suunata lõputöö kaitsmisele pärast paranduste sisseviimist, mitte suunata lõputööd kaitsmisele."}, "grade_evaluation": {"et": "Magistritöö hindamisel võtab komisjon arvesse:\n* töö sisu ja vormistust;\n* magistrandi esinemist kaitsmisel (ettekande sisu ja selle esitamist, küsimustele vastamist);\n* retsensiooni ja juhendaja arvamust.\n\nPärast magistritöö kaitsmist otsustab komisjon kinnisel arutelul, kas anda kraaditaotlejale Euroopa õpingute magistrikraad ja millist hinnet kraaditaotleja teadmised väärivad. Retsensendi ja juhendaja arvamus ei ole komisjoni jaoks siduv."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "88dc55da-3957-ca43-2bf8-28ea2a626f60", "person_name": "Stefano Braghiroli", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2021-12-17", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Magistritöö eelkaitsmine (esitamise tähtaeg 03.12.2021)"}}, {"time": "2022-01-21", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Magistritöö kaitsmine (esitamise tähtaeg 07.01.2022)"}}]}, "registration_info": {"audience": {"et": "Euroopa õpingute magistriprogrammi üliõpilased"}, "min_students": 1}, "parent_uuid": "4c4d3bdf-605a-ffba-7086-4389f3816ac7", "parent_code": "P2EC.00.232", "parent_credits": 15, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}