{"uuid": "71fcd2b4-4f38-9799-3abd-fdf3e2422f90", "code": "P2EC.00.250", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Development Seminar", "et": "Arenguseminar"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 3, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The seminar is primarily focused on supporting students' succesful completion of their master's thesis or final comprehensive exam. Additionally, it also deals with mapping and analyzing students' personal learning needs and supporting their development. If necessary, guest lecturers and study visits will be included in the course to help students with academic writing, public speaking and research methods. \n\n \n\nThe seminar is articulated across three semesters (2nd, 3rd, and 4th), followed by writing and defence of MA thesis. The 2nd semester part is common to all students, while the sessions of the 3rd and 4th parts are differentiated according to their choice to finalize their studies with a master's thesis or with the final comprehensive exam.", "et": "."}, "objectives": [{"en": "The aim of the development seminar is to support the students - both as a group and individually - in the process of thesis writing and finalization of the master's thesis or in the preparation of the final comprehensive exam. Within the framework of the seminar, students expand their understanding of academic writing and research methods and design as well as public speaking and presentations, project management. In addition, the aim is to offer students a supportive learning environment. \n\n \n\nDevelopment seminar is a part of the Master thesis module.", "et": "."}], "learning_outcomes": [{"en": "By the end of the course, participating student: \n\n- has improved their ability to plan their work \n\n- is able to formulate a relevant, well-justified and original research question and choose an appropriate research design to answer that question \n\n- is able to link theoretical approaches to research methods and empirical analysis \n\n- is able to present analytical, structured and well-substantiated arguments \n\n- is familiar with principles of academic writing and code of conduct for academic research \n\n- is able to critically connect the knowledge acquired across the courses offered by the curriculum \n\n- is able to originally combine such knowledge in creative ways \n\n- can solve complex problems related to the theoretical and practical aspects addressed during the study years.", "et": "."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}