{"uuid": "a0fdc449-97c3-588a-9509-4fa141fec942", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-26T10:22:21", "title": {"en": "Education and Knowledge-related Policies in the EU", "et": "Teadus- ja hariduspoliitika Euroopa Liidus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will demonstrate the decision making process and outcomes of the EU and Estonian policies in education and science, while tackling the issue of recent and ongoing reforms in different levels of the education system. The course is built upon the diversified approach to learning, teaching and research, its major trends and consequences for the future labour market both in the EU and in its member states. The central problems will be addressed: creative teaching and creative learning, drop-outs and gaps in the educational system, generation Y and shifted values, literacy and intelligence, high result and effectiveness of the Estonian education at all levels. The course will consist of discussions, practical implications (research, case study, sharing information to the target audience) and individual work. Course keywords: key competencies, assessment, types of learning, lifelong learning, educational diversity, science and innovation, education reforms and society, future labour market, innovation and creativity, youth and education, civic engagement.", "et": "Kursus tutvustab EL-i ja Eesti haridus- ja teaduspoliitikate otsustusprotsesse ja väljundeid ning käsitleb haridussüsteemi erinevate tasandite hiljutisi ja käimasolevaid reforme. Kursusel lähenetakse õppimisele, õpetamisele ja teadusele erinevatest vaatenurkadest, käsitletakse trende ja tagajärgi tulevase tööturu ja riikliku võimekuse kontekstis nii EL-is kui selle liikmesriikides. Kursus on üles ehitatud ühendades diskussioonid, praktilised auditoorsed harjutused ja iseseisva töö. Kursuse märksõnad: võtmepädevused, hindamine, õppimise tüübid, elukestev õppimine, hariduslik mitmekesisus, teadusinnovatsioon, haridusreformid ja ühiskond, tuleviku tööturg, innovatsioon ja loovus, noored ja haridus, kodanikuaktiivsus."}, "objectives": [{"en": "The aim of the course is to examine and analyse EU education and research policy in general and its supporting and partly guiding role in shaping the education and research policies of the Member States. The course covers EU education and research policy through key competences, approaches to citizenship and norms (including European values), common standards and good practices, the European Education Area and European Research Area, sectoral action plans, development plans, framework programmes and missions, and in relation to the challenges raised in the labour market and necessary to cope more broadly in the modern world. The course analyses EU positions, programmes and actions in comparison to member states' prorgrams and their applications.", "et": "Kursuse eesmärgiks on tutvuda ja analüüsida EL-i haridus- ja teaduspoliitikat üldiselt ning selle toetavat ja osaliselt suunavat rolli liikmesriikide haridus- ja teaduspoliitika kujundamises. Kursusel käsitletakse EL-i haridus- ja teaduspoliitikat läbi kesksete võtmepädevuste, kodakondsuskäsitluste ja normide (sh Euroopa väärtuste), meetmeteks olevate standardite ja heade praktikate, Euroopa haridus- ja teadusruumi, valdkondlike tegevuskavade, arengukavade, raamprogrammide ja missioonide valdkondade põhjal ning seoses tõstatatud väljakutsetega, mis ootavad ees tööturul ja on vajalikud laiemalt kaasaegses maailmas toimetulekuks. Kursusel analüüsitakse EL-i seisukohti, programme ja meetmeid võrdluses liikmesriikide prorgrammide ja nende rakendustega."}], "learning_outcomes": [{"en": "Upon completion of the course, a student will: - name EU key competences, conceive their essence and role in the development of policy related areas i.e. society change, communication, personal development, labour market, crises and reforms, values and diversity; - orientate within key EU educational policies, understand interrelations between EU, national, regional and local policies and comprehend the background behind the educational reforms in Estonia;\n- understand the policy intervention evaluation methods and use those methods; - use public databases and find the legal acts and other documents in the official databases of the EU; - carry on analysis of documents and media texts, formulate research questions and explicate results; - use methods of research practice and analyse critically the outcomes; - design, implement and follow-up the policy drafts and reports; - demonstrate entrepreneurial and experimental skills through analysis and foresight exercises of the educational reforms; - demonstrate interpersonal communication skills by working in a team. Key competences to be improved: sense making, social intelligence, novel and adaptive thinking, cross-cultural competency, new-media literacy, transdisciplinarity, cognitive load management.", "et": "Kursuse läbinud üliõpilane: - nimetab EL võtmepädevusi ja mõistab nende sisu ja oluliste pädevuste rolli erinevate poliitikate arendamisega seotud valdkondades, nagu ühiskondlikud muutused, kommunikatsioon, isiklik areng, tööturg, kriisid ja reformid, väärtused ja mitmekesisus; - orienteerub oluliste EL-i hariduspoliitikate seas, mõistab suhteid EL-i, riiklike, regionaalsete ja kohalike poliitikate vahel ja analüüsib kriitiliselt Eesti haridusreformide tausta, kasutades EL-i ametlikke andmebaase, meediatekste, teadusartikleid; - demosntreerib praktilisi oskusi, mis on olulised poliitikate ja raportite väljatöötamiseks, rakendamiseks ja tagasisidestamiseks; - demonstreerib ettevõtlikke ja eksperimentaalseid oskusi, mida on arendanud haridusreformide analüüsi ja harjutuste käigus; - on arendanud grupis töötades oma suhtlemisoskust. Võtmepädevused: mõtestamise võime, sotsiaalne intellekt, uudne ja adaptiivne mõtlemine, kultuuride vaheline pädevus, uue meedia kirjaoskus, transidistsiplinaarsus, kognitiivsete protsesside juhtimine."}], "notes": {"et": "Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}}, "grading": {"independent_work": {"et": "48% (12x4%) - test. Alates teisest loengust kuni viimaseni (kaasa arvatud) on iga loengu järel selleks hetkeks auditoorselt käsitletu ja läbitud ettenähtud õppe- ja lugemismaterjalide peale test.\n6% - essee. Kursusel käsitletu põhjal refleksiivne analüüs-arutelu teemal \"Euroopa Liidu teadus- ja hariduspoliitika: 3 olulisimat praktilist teadmist, mida õppisin selle kohta, kuidas haridust juhitakse\". Maht 250 kuni 400 sõna.\n6% - essee. Teises loengus käsitletu ja teise loengu õppe- ja lugemismaterjalide põhjal enese-refleksiivne analüüs teemal \"Kuidas mina õpin kõige paremini?\", milles õppematerjalidele toetudes analüüsite, mis õpikäsitlusele Teile enim omane õppimisviis vastab enim ja millisele õpikäsitlusele vähim. Maht 250 kuni 400 sõna.\n30%, uurimistöö (6-8 lk, reavahe 1,5). Hindamise aluseks on vastavus uurimistöö juhendile (Moodle'is). 4% uurimistöö koondtulemusest moodustab uurimistöö tulemuste ettekandmine seminaris.\n10%, uurimistöö kavand (1-2 lk, reavahe 1,5). Hindamise aluseks on vastavus kavandi kirjutamise juhendile (Moodle'is)."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Iga loengu järel on Moodle'is selleks hetkeks auditoorselt käsitletu ja läbitud ettenähtud õppe- ja lugemismaterjalide peale test, mille sooritamiseks on aega 90 minutit kolme ööpäeva jooksul."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Esimeses kahes loengus käsitletu ja teise loengu õppe- ja lugemismaterjalide põhjal enese-refleksiivne analüüs teemal \"Kuidas mina õpin kõige paremini?\", milles õppematerjalidele toetudes analüüsite, mis õpikäsitlus(t)ele Teile enim omane õppimisviis vastab ning millis(t)ele õpikäsitlus(t)ele vähim. Maht 250 kuni 400 sõna."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "10%, uurimistöö kavand. Hindamise aluseks on vastavus kavandi kirjutamise juhendile (Moodle'is)."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "30%, uurimistöö. Hindamise aluseks on vastavus uurimistöö juhendile (Moodle'is). 4% tulemusest moodustab uurimistöö tulemuste ettekandmine seminaris."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Kursusel käsitletu põhjal refleksiivne analüüs-arutelu teemal \"Euroopa Liidu teadus- ja hariduspoliitika: 3 olulisimat praktilist teadmist, mida õppisin selle kohta, kuidas haridust ja-või teadust juhitakse\". Maht 250 kuni 400 sõna."}}], "grade_preconditions": {"et": "Kodutööde (nii uurimistööd kui esseed) õigeaegne esitamine.\nTestide koondtulemus vähemalt 25 punkti 48st võimalikust."}, "grade_evaluation": {"et": "48% (12x4%) - testid\n12% - kaks lühiesseed\n10% - uurimistöö kavand\n30% - uurimistöö ja selle esitlus (sh esitlus moodustab 4%)"}, "debt_elimination": {"et": "Teste sooritatakse ning esseesid, uurimistöö kavandit ja lõplikku versiooni esitatakse ainult ainekavas ettenähtud ajal ja ajaks. Kui teatate õppejõudu mõjuvast põhjusest, miks te ei saa sooritada õppeülesandeid ettenähtud ajal ja ajaks, siis lepime kokku uue tähtaja ja-või asendusülesande."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Nädala jooksul peale hinnatava tegevuse sooritust."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "dbe65d17-50e9-48d4-bb1f-612506c01ab4", "type": "MOODLE", "code": "P2EC.00.247_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "recommended_materials": "Kris Grimonprez (2020) The European Union and Education for Democratic Citizenship. Baden-Baden: Nomos.\nWalter Archer and Hans G. Schuetze (2019) Preparing Students for Life and Work : Policies and Reforms Affecting Higher Education's Principal Mission. Brill (kättesaadav läbi \"Ebook Central\")\nCatherine Paradeise, Jean-Claude Thoenig (2015) In Search of Academic Quality. Basingstoke, New York: Palgrave Macmillan.\nAnja P. Jakobi, Kerstin Martens, Klaus Dieter Wolf (2010) Education in Political Science : Discovering a Neglected Field. New York and London: Routledge."}, "participants": {"lecturers": [{"person_uuid": "1a225f08-5974-10f7-ef3a-114e3110eaef", "person_name": "Alar Kilp", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2024-09-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus kursusesse."}}, {"time": "2024-09-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Õppimisviisid. Kuidas mina õpin? Koolitamine ja koolitatud olemine. Distsipliin. Õppimine väljaspool kooli ja ilma õpetajata."}}, {"time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EL-i käsitlus õppimise viisidest ja õpetamise kvaliteedist."}}, {"time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "ELi hariduslikud eesmärgid ja käsitlus võtmepädevustest."}}, {"time": "2024-10-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mitmetasandiline haridusjuhtimine EL-is. Bologna protsess. Euroopa haridusruum. Hariduse ja teaduse euroopastumine."}}, {"time": "2024-10-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kodanikuharidus. Globaalne kodakondsus. Euroopalike väärtuste edendamine hariduse teel. Radikaliseerumisvastasus."}}, {"time": "2024-10-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EL-i hariduspoliitika valdkondlikud tegevuskavad, arengukavad, raamprogrammid."}}, {"time": "2024-10-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "ELi hariduspoliitika tulevikulised väljakutsed ja olemasolevad meetmed väljakutsete haldamiseks."}}, {"time": "2024-11-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EL-i hariduspoliitika liikmesriikide võrdluses."}}, {"time": "2024-11-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimistöö kavandi seminar."}}, {"time": "2024-11-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "ELi teaduspoliitika. Euroopa teadusruum."}}, {"time": "2024-11-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EL-i teaduspoliitika valdkondlikud tegevuskavad, arengukavad, raamprogrammid, missioonide valdkonnad."}}, {"time": "2024-12-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EL-i teaduspoliitika liikmesriikide võrdluses."}}, {"time": "2024-12-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimistöö (tulemuste esitamise) seminar."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "e3072f7a-97c4-8c3e-95f8-2c119670e791", "parent_code": "P2EC.00.247", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}