{"uuid": "a7351977-a369-5e90-6cae-eeec8afd3d7c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-10T20:44:59", "title": {"en": "Methodology of Social Sciences", "et": "Sotsiaalteaduslik metodoloogia"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 14, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course consists of seven study sessions (lectures and seminars, or interactive webinars in case COVID restrictions are in place) and independent work based on assigned readings and materials. The course provides a broad-based introduction to designing and conducting social science research, and prepares the participants for preparing their MA theses. We start our discussions by asking 'what is science?', how the natural and social sciences differ, and what criteria can be used to assess scientific quality. We will then focus on the essential building blocks of research design: theory, hypothesis, concepts, variables, unit and level of analysis. We will compare case study, comparative and large n approaches, and discuss the pros and cons of each. We will address the operationalization of variables, look at various datasets and discuss data collection methods and principles - including ethical ones. The course provides an overview of the main qualitative and quantitative methods along with guidelines on where to find further info. In order to complete the course, the participants are expected to take five short web-based tests, write an assessment of a research article, and prepare a prospectus describing the objectives and research design of their MA thesis.", "et": "Ainekursus koosneb seitsmest õppesessioonist (loengud ja seminarid, COVID-piirangute korral: interaktiivsed vebinarid) ja iseseisvast tööst kirjanduse ja materjalidega. Aine annab laiapõhjalise ülevaate sotsiaalteadusliku uurimistöö ülesehitamisest ja läbiviimisest ning valmistab osalejaid ette magistritöö koostamiseks. Alustame küsimusest, mis on teadus ja millistele kriteeriumitele 'hea' teadus peaks vastama. Arutleme selle üle, kas ja kuidas erinevad üksteisest loodus- ja sotsiaalteadused. Keskendume teadustöö ülesehitusele: mis on teooria, hüpotees, mõisted, muutujad, analüüsiühik ja -tasand ning kuidas neid elemente oma töös õigesti kasutada? Selgitame, mis on juhtumiuuringu, võrdlev uurimuse, ning kvantitatiivse analüüsi erinevused ja millal kasutada üht või teist lähenemist. Käsitleme muutujate operatsionaliseerimist ning tutvume andmestike ning peamiste andmekogumismeetodite ja põhimõtetega (sh eetikaküsimused).  Kursus annab ülevaate peamistest kvalitatiivsetest ja kvantitatiivsetest uurimismeetoditest koos juhistega, kust leida täiendavat infot. Tutvustatakse sotsiaalteadusliku uurimuse üldloogikat, põhikomponente ning kvaliteedikriteeriume, samuti uuringu kavandamise ja teostamise etappe. Ainekursuse läbimiseks tuleb sooritada viis lühikest veebitesti, koostada teadusartikli analüüs ning oma magistritöö kavand."}, "objectives": [{"en": "The course is designed to introduce the basics of social science methodology, including data collection and analysis methods, and thereby develop MA students' ability to understand, conduct and critically assess social science research. The course will prepare MA students for writing the MA thesis.", "et": "Kursuse eesmärk on anda ülevaade sotsiaalteaduste olemusest ning peamistest andmekogumise ja -analüüsi meetoditest ning tõsta seeläbi magistrantide võimekust sotsiaalteaduslikke uuringuid mõista, neid läbi viia ja neid kriitiliselt hinnata. Kursus valmistab magistrante ette magistritöö kirjutamiseks."}], "learning_outcomes": [{"en": "Upon completion of this course, you should:", "et": "Olles kursuse läbinud, peaksid Sa: "}, {"en": "* be able to explain what the natural sciences and social sciences share in common and how they differ; have an informed opinion on the matter of scientific status of social sciences and be able to defend your position;", "et": "* teadma, mis on loodusteaduste ja sotsiaalteaduste ühised tunnused ning erinevused; omama seisukohta sotsiaalteaduste teaduslikkuse küsimuses ja suutma seda kaitsta;"}, {"en": "* be able to identify various interests and motives that underlie social science research and be able to explain the difference between academic and applied research; ", "et": "* teadma, millised on sotsiaalteadusi suunavad huvid ning tegema vahet akadeemiliste ja rakenduslike sotsiaalteaduslike uuringute eesmärkides;"}, {"en": "* be familiar with the main elements of a research design, including theory, hypothesis, research question, variables, data, analysis, results and conclusions; know how they are related to one another, and be able to correctly use them in own research projects; ", "et": "* mõistma, mis on teooria, hüpotees, uurimisküsimus, muutujad, andmed ja andmeanalüüs, tulemused ja järeldused, oskama selgitada, kuidas need omavahel seotud on,  ning oskama neid oma teadustöös õigesti kasutada;"}, {"en": "* know the difference between qualitative and quantitative research methods, be able to discuss the advantages and limitations of each; be able to choose a suitable method depending on the research task and the type of data available;", "et": "* oskama selgitada kvalitatiivsete ja kvantitatiivsete uurimismeetodite erinevusi, peamisi eeliseid ja puudusi; oskama valida sobiva meetodi tulenevalt uurimisülesande laadist ja andmete iseloomust;"}, {"en": "* be familiar with the stages of the research process, be able to structure a research article/MA thesis/research report correctly, be aware of the main principles and norms of scientific research, including those pertaining to ethics;", "et": "* omama ülevaadet uurimisprotsessi etappidest, oskama teadusartiklit/magistritööd/uuringuraportit õigesti üles ehitada, teadvustama olulisemaid teadustöö põhimõtteid ja norme, sh eetikaga seonduvaid;"}, {"en": "* be better able to understand and assess social science research articles and research reports;", "et": "* oskama senisest paremini mõista ja hinnata sotsiaalteaduslikke artikleid ja uuringuraporteid;"}, {"en": "* feel more confident when conducting social science research,  presenting and defending your results.", "et": "* tundma end senisest märksa kindlamalt sotsiaalteadusliku uurimistöö tegemisel, saadud tulemuste esitlemisel ja argumenteeritud kaitsmisel."}], "notes": {}}, "grading": {"independent_work": {"et": "Viis Moodle'i testi a 5% hindest -- kokku 25% lõpphindest (25 punkti). \nTestid koosnevad küsimustest ja harjutustest, mille eesmärk on kinnistada iseseisva lugemise, loengu ja seminari käigus omandatud teadmisi ja oskusi. Testid hõlmavad nii valikvastustega küsimusi kui ka vabas vormis lühivastustega küsimusi. Õppija võib testi sooritada talle sobival ajal: testid avanevad Moodle'is viie esimese õppesessiooni järel (vebinari järel), iga testi sooritamiseks on aega 10 päeva. Täiendavad juhised Moodle'is.\n\nTeadusartikli analüüs: 25% lõpphindest (25 punkti). Õppijatel tuleb valida üks korralikus teadusajakirjas ilmunud artikkel ning kirjutada selle kohta analüüs pikkusega umbes 1500 sõna. Analüüs peab tuvastama  teadustöö peamised ehituskivid (teooria, hüpotees, muutujad, nende mõõtmine, andmed, tulemused, järeldused) ja andma hinnangu uurimistöö ülesehitusele, meetodite sobivusele ning tulemuste usaldusväärsusele.  Täpsemad juhised Moodle'is.\n\nMagistritöö kavand: 50% lõpphindest (50 punkti). Magistritöö kavandi koostamisel on kaks järku: esmalt tuleb esitada esialgne nägemus (1.5 - 2 lk) magistritöö teemast ning teoreetilisest ja metodoloogilisest lähenemisest (10% lõpphindest), millele õppejõud tagasisidet annab. Seejärel tuleb välja arendada põhjalik magistritöö kavand (40% lõpphindest). Kavandi pikkus: 6-7 lehekülge (koos kasutatud kirjanduse loeteluga).Kavand peab sisaldama sisaldama eesmärki, uurimisküsimust, teema olulisuse ja aktuaalsuse põhjendust, teooria kirjeldust, üht või mitut hüpoteesi, infot muutujate operatsionaliseerimise kohta, kasutatavate andmete ja meetodite kirjeldust, infot oodatavate tulemuste ja nende olulisuse kohta.\nVt täpsemad juhised Moodle'is."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Viis Moodle'i-põhist lühitesti kontrollivad, kas õppija on omandanud lugemismaterjalides, loengus ja seminaris käsitletud materjali (vastavalt aine õpiväljunditele) ja oskab omandatud teadmisi ja oskusi praktikas rakendada. Test hõlmab nii valikvastustega küsimusi kui ka vabas vormis lühivastustega küsimusi. Testid avanevad Moodle'is viie esimese õppesessiooni järel (vebinari järel), iga testi sooritamiseks on aega 10 päeva. Täiendavad juhised Moodle'is."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Magistritöö kavandi koostamisel on kaks järku: esmalt tuleb esitada esialgne nägemus (1.5 - 2 lk) magistritöö teemast ning teoreetilisest ja metodoloogilisest lähenemisest (10% lõpphindest), millele õppejõud tagasisidet annab. Seejärel tuleb välja arendada põhjalik magistritöö kavand (40% lõpphindest). Vt täpsemad juhised Moodle'is.\nKavandi pikkus: 6-7 lehekülge (koos kasutatud kirjanduse loeteluga).\nKavandi hindamise kriteeriumid: \n- kas kavand sisaldab kõiki nõutud osi (vt juhend) ning kas need on selgelt ja arusaadavalt esitatud?\n- kas töö kesksed mõisted on selgelt defineeritud?\n- kas teema/uurimisprobleemi olulisus on veenvalt põhjendatud?\n- kas uurimistöö elemendid on omavahel kooskõlas ja moodustavad loogilise terviku?\n- kas peamised muutujad on korrektselt operatsionaliseeritud?\n- kas andmed ja meetodid võimaldavad jõuda usaldusväärsete tulemusteni?\n- kas kavandatud uurimistöö on teostatav?\n- kas tegemist on iseseisva uurimusega, mille puhul on selgelt nähtav autori analüütiline panus?\n- kas kavand on selge, ladus ja keeleliselt korrektne?"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Teadusartikli analüüs tuleb esitada Moodle'i vahendusel. Maht: umbes 1500 sõna. Täienavad juhised Moodle'is. Hindamise kriteeriumid:\n- kas valitud on nõuetekohane artikkel?\n- kas teadustöö peamised elemendid on õigesti tuvastatud ja korrektselt ning arusaadavalt kokku võetud ja esitatud?\n- kas õppija on andnud oma hinnangu artiklile ning seda veenvalt põhjendanud?\n- kas analüüs on juhistele vastavalt üles ehitatud, sisaldab kõiki nõutud osi, kas selle maht vastab nõutule?\n- kas analüüs on selge, ladus ja keeleliselt korrektne?"}}], "grade_preconditions": {"et": "Hindamisele pääsemise tingimused puuduvad. Kui kursusel kogutud punktisumma on 0-50, siis osaleja positiivset lõpphinnet ei saa (st lõpphindeks on F)."}, "grade_evaluation": {"et": "Viis Moodle'i testi a 5% hindest -- kokku 25% lõpphindest (25 punkti)\nTeadusartikli analüüs: 25% lõpphindest (25 punkti)\nMagistritöö kavand: 50% lõpphindest (50 punkti)\nKavandi koostamisel on kaks järku: magistritöö teemal tuleb esmalt esitada esialgne visioon (10% lõpphindest), millele õppejõud tagasisidet annab. Seejärel tuleb välja arendada põhjalik kavand (40% lõpphindest).\nKokku lõpphinne 100% = 100p\n \nHinne ja sellele vastav punktivahemik:\n\nA 91- 100\nB 81-90\nC 71-80\nD 61-70\nE 51-60\nF 0-50"}, "debt_elimination": {"et": "Hilinenult esitatud tööd kaotavad 1 punkti päevas. Õppejõud võb teha erandi, kui hilinemiseks on mõjuvad põhjused."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "becfebfe-e794-4859-9434-c92a26bc3820", "type": "MOODLE", "code": "P2EC.00.072_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Lagerspetz, M. (2017) Ühiskonna uurimise meetodid : sissejuhatus ja väljajuhatus. Tallinna Ülikool\nChalmers, A (1998)  Mis asi see on, mida nimetatakse teaduseks? Arutlus teaduse olemusest ja seisundist ning teaduslikest meetoditest,\" Ilmamaa. \nBox-Steffensmeier,  Janet  M.,  Henry  E.  Brady,  and  David  Collier.  2008.  The  Oxford  Handbook of Political Methodology. Oxford: Oxford University Press. [vajalikud osad Moodle's]\nLisanduvad eesti- ja inglisekeelsed artiklid.", "recommended_materials": "John Ziman. What Is Science? (lk. 48-53 teoses Introductury Readings in the Philosophy of Science. Toim E.D.Klemke jt. Prometheus Books 1998)\nThomas Kuhn. Scientific Revolutions (lk. 139-157 teoses The Philosophy of Science Toim. R. Boyd jt. MIT Press 1991)\nFritz Machlup. Are the Social Sciences Really Inferior? (lk. 135-153 teoses Introductury Readings in the Philosophy of Science. Toim E.D.Klemke jt. Prometheus Books 1998)\nWesley Salmon. Scientific Explanation: How We Got from There to Here (lk. 241-263 teoses Introductury Readings in the Philosophy of Science. Toim E.D.Klemke jt. Prometheus Books 1998)\nJohn Gerring. Social Science methodology. A Unified Framework. 2nd ed. Cambridge University Press 2012\nDavid Silverman. Qualitative Research. 3rd ed. SAGE 2011\nCarol Grbich. Qualitative Data Analysis. An Introduction. Part III: Analysis of Documentation (lk. 109-181) SAGE 2007\nKlaus Krippendorf.  Content Analysis. An Introduction to its Methology. Part I: Conceptualizing Content Analysis (lk. 10-80). SAGE 2013 \nPaul Atkinson, Martin Hammersley. Ethnography and Participant Observation (lk 110- 136 teoses Strategies of Qualitative Inquiry. SAGE 1998)\nThomas S. Eberle, Christoph Maeder . Organizational Ethnography (lk 53-73 teoses Qualitative Research Toim. D. Silverman. SAGE 2011)\nLindsay Prior. Using Documents in Social Research. (lk 93-111 teoses Qualitative Research Toim. D. Silverman. SAGE 2011)\nJody Miller, Barry Glassner. The \"Inside\" and the \"Outside\": Finding Realities in Interviews (lk. 131-148 teoses Qualitative Research Toim. D. Silverman. SAGE 2011)\nMichael Emmison. Conceptualizing Visual Data. (lk. 233-249 teoses Qualitative Research Toim. D. Silverman. SAGE 2011)\nJames A. Holsein, Jaber F. Gubrium. Animating Interview Narratives (lk. 149-167 teoses Qualitative Research Toim. D. Silverman. SAGE 2011)\nAlexander L. George, Andrew Bennett. Case Studies and theory Development in the Social Sciences. Part II: How to Do Case Studies (lk 65-124). MIT Press 2005\nFloyd J. Fowler, Jr. Survey Research Methods. SAGE 2002\nKlaus Krippendorf. Content Analysis. An Introduction to its Methology. SAGE 2013\nMichael Bloor, Jane Frankland, Michelle Thomas, Kate Robson. Focus Groups in Social Research. SAGE 2001\nAlexander L. George, Andrew Bennett. Case Studies and theory Development in the Social Sciences. MIT Press 2005\nBill Gillham. Observation Techniques. Structured to Unstructured. Continuum 2008\nTim May, Beth Perry. Social Research & Reflexivity. SAGE 2011\nGina Wisker. The Postgraduate research Handbook. Palgrave 2011\nJohn Law. After Method. Mess in Social Science Research. Routledge 2004\nAlain Coulon. Ethnomethodology. SAGE 1995\nMartha S.Feldman. Strategies for Interpreting Qualitative Data. SAGE 1995\nThomas R Black. Doing Quantitative Research in the Social Sciences: An Integrated Approach to Research Design, Measurement and Statistics. SAGE 1999\nDavid Byrne. Interpreting Quantitative Data. SAGE 2002\nJohn W. Creswell. Research design: qualitative, quantitative, and mixed methods approaches. SAGE 2009\nDavid Kaplan. The SAGE Handbook of Quantitative Methodology for the Social Sciences. SAGE 2004\nNorman K. Denzin, Yvonna S. Lincoln. Handbook of qualitative research. SAGE 2000\nSAGE Research Methods - http://srmo.sagepub.com.ezproxy.utlib.ee/"}, "participants": {"lecturers": [{"person_uuid": "5d6b24c8-186b-eeb4-3a9f-e59baf708b1d", "person_name": "Piret Ehin", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"time": "2025-02-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus. Mis on teadus? Kuidas teha vahet teadusel ja mitte-teadusel? Mis on 'hea teadus' ja kuidas teadus areneb? Kas ühiskonnateadus on üldse  õige teadus? Mida on loodus- ja ühiskonnateadustes ühist ja mille poolest nad erinevad? Kuidas saan olla kindel, et see, mida oma magistritöös teen, on teadus?"}}, {"time": "2025-02-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "Teadustöö ülesehitus I: Uurimisprobleem, uurimisküsimus, teooria, hüpotees, mõisted, muutujad. Erinevad võimalused magistritööd kirjutada: millised võivad olla magistritöö eesmärgid?"}}, {"time": "2025-03-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "Teadustöö ülesehitus II: Analüüsitasand ja -ühik, juhtumite valik. Juhtumiuuring, võrdlev uurimus, kvantitatiivne analüüs -- millal kasutada üht või teist, mis on nende lähenemiste plussid ja miinused?"}}, {"time": "2025-03-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "Teadustöö ülesehitus III: Mõistest mõõdikuni: muutujate operatsionaliseerimine. Kust leida andmeid? Tutvume andmestikega. Andmekogumise viisid ja põhimõtted, sh eetilised küsimused. Tulemused ja nende usaldusväärsus, tulemuste tõlgendamine, üldistamine,  järelduste tegemine."}}, {"time": "2025-04-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "Ülevaade kvalitatiivsetest uurimismeetoditest."}}, {"time": "2025-05-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "Ülevaade kvantitatiivsetest uurimismeetodidest."}}, {"time": "2025-05-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {}, "description": {"et": "Magistritöö visioonide arutelu, soovitused ja näpunäited magistritöö koostamiseks."}}]}, "registration_info": {"audience": {"et": "Euroopa õpingute magistriõppekava kohustuslik aine, avatud ka huvilistele"}, "min_students": 10, "max_students": 25}, "parent_uuid": "ccde75c8-b8f8-e264-9e8c-0960da5ab5f2", "parent_code": "P2EC.00.072", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}