{"uuid": "8b3ed658-e558-2944-6c2b-bc8e8364009a", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-02T10:38:47", "title": {"en": "EU Policy Making", "et": "Euroopa Liidu poliitika kujundamine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 22, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 130, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course aims to give a systematic overview of the institutional structure of the EU and the interaction of the key actors and their impact on EU policy making. Following the introduction of the main institutions and their role, the course discusses politics, policies and polity (i.e. the institutions) of the EU. It provides a platform for understanding the functioning of the EU and discusses its implications for policy-making at multiple levels of government. An relevant part of the discussion is devoted to the contextualization of the different modes of governance,", "et": "Kursus on praktilise suunitlusega. Rõhuasetus on järgmistel küsimustel: kuidas ja kui hästi Euroopa Liidu poliitiline ja valitsemissüsteem toimib ning millised on võimalused süsteemi toimimist paremaks muuta? Ainekursus koosneb loengutest ja seminaridest, mis jagunevad seitsme õppesessiooni vahel, ja iseseisvast tööst. Teadmiste kinnistamisele aitavad kaasa veebipõhised lühitestid; samuti tuleb osalejatel koostada kirjalik analüüs, pidada lühike suuline ettekanne ning sooritada kirjalik lõppeksam."}, "objectives": [{"en": "The aim of this course is to give an overview and understanding of the main principles of EU policy-making process and rules and practices governing the decision-making within and among the relevant institutions and bodies. Students will learn directly from the analysis of the treaties and of the primary sources. Particular attention is also devoted to the inter-institutional dimension and to the role of the Member states.", "et": "Kursuse eesmärk on anda ülevaade Euroopa Liidu peamistest institutsioonidest - nende ülesehitusest, ülesannetest, toimimisest ja mõjust - ja poliitikakujundamise ning otsustetegemise protsessist. Samuti käsitleb kursus EL-i poliitikate elluviimist keerulises mitmetasandilises valitsemissüsteemis. Käsitleme ka küsimust, kuidas ja milliste kriteeriumite alusel Euroopa Liidu poliitilise ja valitsemissüsteemi toimimist võiks hinnata ning arutame erinevaid ettepanekuid liidu institutsioonide ja poliitikakujundamise protsessi reformimiseks."}], "learning_outcomes": [{"en": "Upon completion of the course, students will be able to: \n\n- Understand the mechanisms of policy-making in the EU and the institutional and policy-related processes; \n\n- critically assess the fuctioning and the roles of the main EU insitutions \n\n- contextualize and analyze the EU policy portfolio. \n\n- critically discuss the 'governance turn' in empirical and theoretical research on the EU; \n\n- Be able to critically examine the policy-related consequences of multi-level governance.", "et": "Olles kursuse läbinud, peaksid Sa:\n\n* oskama kirjeldada Euroopa Liidu viie peamise institutsiooni ülesehitust, rolli, ülesandeid, kujunemislugu, toimimist ja mõju;\n\n\n* suutma selgitada ja põhjendada, kuidas ja milliste kriteeriumite alusel Euroopa Liidu poliitilise ja valitsemissüsteemi toimimist võiks hinnata;\n* tundma peamisi mõisteid ja termineid, mida kasutatakse Euroopa Liidu institutsioonide ning poliitikakujundamise teemalises kirjanduses ja aruteludes;\n* oskama kirjeldada poliitikakujundamise protsessi Euroopa Liidus ning teadma, milline on peamiste institutsioonide, liikmesriikide, huvigruppide ja kodanike roll selles;\n* teadma, kuidas toimub õigusaktide vastuvõtmine seadusandliku tavamenetluse raames; olema kursis teiste peamiste EL-i otsustusmehhanismidega;\n* suutma selgitada, kuidas Euroopa Liidu poliitikaid rakendatakse ja mitmel tasandil ellu viiakse; tundma ja nimetama mitmetasandilise valitsemise probleeme ja kitsaskohti;\n* teadma, millised on peamised ettepanekud Euroopa Liidu institutsioonide ja poliitikakujundamise protsessi reformimiseks ning oskama neid ettepanekuid kriitiliselt hinnata."}], "notes": {}}, "grading": {"independent_work": {"et": "* Viis Moodle'i-põhist lühitesti koosnevad küsimustest ja harjutustest, mille eesmärk on kinnistada iseseisva lugemise, loengute ja seminaride käigus omandatud teadmisi. Testid hõlmavad nii valikvastustega kui ka lühivastustega küsimusi. Õppija võib testi sooritada talle sobival ajal: testid avanevad Moodle'is valitud õppesessioonide (1., 2., 3., 5., 6. sessioon) järel, iga testi sooritamiseks on aega 1 nädal. Testid annavad kokku 25% lõpphindest (25 punkti).Juhised Moodle'is.\n* Kirjalik analüüs (tähtaeg 30.nov, esitada Moodle'is) ja sellel põhinev lühiettekanne (6. dets): õppijatel tuleb koostada kirjalik analüüs (seisukohavõtt, nn postitsioonipaber) vabalt valitud aktuaalsel või olulisel teemal, mis puudutab EL-i institutsioonide tööd ja/või poliitikakujundamist. Argumenteeritud analüüs peab keskenduma ühe või mitme väite esitamisele ja kaitsmisele/põhjendamisele. Näiteks võib esitada ja kaitsta argumente selle kohta, miks mingi politiika või programm on/ei ole osutunud tulemuslikuks või selle kohta, kuidas poliitikaid või institutsioone oleks vaja reformida. Kirjaliku analüüsi pikkus on 1200-1300 sõna. Täiendavad juhised Moodle'is. Kirjaliku analüüsi põhjal tuleb viimasel õppesessioonil (6. detsembril) pidada lühike suuline ettekanne (5-6 minutit), mis keskendub argumentide esitamisele ja nende kaitsmisele. Kirjalik analüüs annab 20% kursuse hindest (20 punkti), lühiettekanne 5% (5 punkti). Hilinenult esitatud tööd kaotavad 1 punkti päevas. \n* Kirjalik lõppeksam (50% kursuse hindest, 50 punkti): Õppijatel tuleb sooritada kirjalik lõppeksam, mis katab kursuse jooksul käsitletud teemasid ning sisaldab nii lühivastuseid kui pikemat mõttearendust eeldavaid küsimusi. Põhjalik õpijuhis/kordamisküsimused tehakse õppijatele kättesaadavaks vähemalt kaks nädalat enne eksamit (Moodle' is). Eksami sooritamiseks määratakse kaks aega, õppija valib ühe neist."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Lühitestide hindamise kriteeriumid: suutlikkus faktiküsimustele õigeid vastused anda, kursuse raames käsitletud teabe valdamine. Testid annavad kokku 25% lõpphindest (25 punkti).\n\nKirjaliku analüüsi (tähtaeg 30 nov) hindamise kriteeriumid: valitud probleemi olulisus ja aktuaalsus, argumentatsiooni selgus, veenvus ja loogilisus (väidete põhjendamine ja argumentide toetamine sobivate andmete, faktide, näidetega), loogiline ja selge ülesehitus ja keeleline ning vormistuslik korrektsus, asjakohaste allikate kasutamine (vähemalt 5 allikat, sobivad nii akadeemilised allikad kui ka poliitikaraportid). Kirjalik analüüs annab 20% kursuse hindest (20 punkti)."}}, {"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Viimasel õppesessioonil (6. detsembril) tiuleb õppijatel pidada väga lühike suuline ettekanne (5-6 minutit), mis keskendub argumentide esitamisele ja nende kaitsmisele. Suulise ettekande hindamise kriteeriumid: informatiivsus, selgus, veenvus, ladusus, jälgitavus, ajapiiranguga arvestamine, suutlikkus küsimustele vastata.  Lühiettekanne annab 5% aine tulemusest (5 punkti)."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Lõppeksami hindamise kriteeriumid: kursuse raames (loengutes, seminarides, iseseisva töö vormis) omandatud teabe valdamine, EL-i institutsioonide toimimise ja poliitikakujundamise protsessi tundmine, suutlikkus teavet selgelt ja korrektselt esitada, veenvalt argumenteerida ja oma seisukohti põhjendada ning erinevatest allikatest pärinevat infot sünteesida.  Eksam annab 50% kursuse hindest (50 punkti).\n"}}], "grade_preconditions": {}, "grade_evaluation": {"et": "Aine hindamine on eristav.\nKursuse tulemus moodustub järgmiste komponentide baasil:\nViis Moodle'i lühitesti a 5% hindest:\t\t\t\t\t                                25% lõpphindest (25 punkti)\nKirjalik analüüs (seisukohavõtt) ja sellel põhinev lühiettekanne: \t\t25% lõpphindest (25 punkti)\nKirjalik lõppeksam: \t\t\t\t\t\t\t                                                50% lõpphindest (50 punkti)"}, "grade_conditions": {"A": {"et": "91-100 punkti"}, "B": {"et": "81-90 punkti"}, "C": {"et": "71-80 punkti"}, "D": {"et": "61-70 punkti"}, "E": {"et": "51-60 punkti"}, "F": {"et": "alla 50 punkti"}, "mi": {"et": "õppija ei ilmunud lõppeksamile"}}, "debt_elimination": {"et": "Moodle'i teste saab õppija sooritada ühe nädala jooksul vabalt valitud ajal; testide avatudoleku aega ei muudeta ega pikendata.\nHilinenult esitatud kirjalikud tööd kaotavad 1 punkti päevas. Õppejõud võb teha erandi, kui hilinemiseks on mõjuvad põhjused.\nLõppeksami sooritamiseks on kaks aega, õppija valib neist ühe."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=12930", "is_moodle_connected": true, "learning_environments": [{"uuid": "52f3b35e-2358-48aa-898b-59b96c22153e", "type": "MOODLE", "code": "P2EC.00.248_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "5d6b24c8-186b-eeb4-3a9f-e59baf708b1d", "person_name": "Piret Ehin", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1,3,5,7,9,11,14,16,20"}, "entries": [{"course_week": 1, "time": "2024-09-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Sissejuhatus. Ülevaade EL-i poliitilisest ja valitsemissüsteemist (14.30-17.30 Lossi 36-307)"}, "description": {"et": "Sissejuhatus. Kiirülevaade EL-i ajaloolisest kujunemisest fookusega süvenemisel ja laienemisel. Euroopa integratsiooni tõusud ja mõõnad. Ülevaade EL-i viiest peamisest institutsioonist ja nende funktsioonidest. Valitsustevahelisus ja riikideülesus. Võrdlus riigi tasandi poliitiliste institutsioonidega. Kuidas, milliste kriteeriumite alusel EL-i institutsioonide tööd ja poliitilise süsteemi toimimist hinnata?"}}, {"course_week": 3, "time": "2024-09-18", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 2, "topic": {"et": "Euroopa Liidu peamised institutsioonid I (18.00-20.00, veebis)"}, "description": {"et": "Põhjalikum tutvumine peamiste institutsioonidega: Euroopa Komisjon, Euroopa Parlament, Euroopa Liidu Nõukogu, Ülemkogu, Ülesehitus, koosseis, roll, pädevused, mõju. "}}, {"course_week": 5, "time": "2024-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "Euroopa Liidu peamised institutsioonid II. Aluslepingute reform ja lainemisega seotud otsused. Arutelud institutsioonide reformimise üle (14.30-17.30, Lossi 36-307)"}, "description": {"et": "Eelmisel kohtumisel käsitletud teemade (peamised institutsioonid) kordamine ja kinnistamine. Euroopa Kohus ja muud olulised institutsioonid (Euroopa Keskpank, Kontrollikoda, Regioonide Komitee). Aluslepingute muutmine. Laienemisega seotud otsuste tegemine. Aktuaalsed arutelud seoses institutsioonide toimimise ja võimalike reformidega, sh võimaliku laienemise kontekstis. "}}, {"course_week": 7, "time": "2024-10-16", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 4, "topic": {"et": "Poliitika kujundamine ja otsustusprotsessid (18.00-20.00 veebis)"}, "description": {"et": "Poliitikakujundamise ja otsustusprotsessid. Poliitikate algatamine, seaduseelnõude ja eelarve ette valmistamine. Otsuste tegemine Nõukogus ja Euroopa Parlamendis: seaduseelnõude vastuvõtmine, tagasilükkamine, muutmine. Seadusandlik tavamenetlus. Muud otsustus- ja hääletusmehhanismid. Arutelud hääletusreeglite muutmise üle. "}}, {"course_week": 9, "time": "2024-11-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"et": "Poliitikakujundamise ja valitsemise viisid ja mudelid (14.30-17.30 Lossi 36-307)"}, "description": {"et": "Euroopa Liidu poliitikate portfell ja selle ajalooline kujunemine. Erinevad viisid EL-i poliitikaid liigitada. Diferentseeritud lõimumine. Poliitikakujundamise ja valitsemise viisid ja mudelid Euroopa Liidus. Huvigruppide roll. Eesti prioriteedid EL-i poliitikate osas. Kriiside ohjamine ja kriiside mõju EL-i institutsionaalsele tasakaalule."}}, {"course_week": 11, "time": "2024-09-20", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 6, "topic": {"et": "EL-i õiguse ülevõtmine ja rakendamine, poliitikate elluviimine (18.00-20.00 veebis)."}, "description": {"et": "EL-i õiguse ülevõtmine ja rakendamine liikmesriikides. Poliitikate elluviimine mitmetasandilises süsteemis. Näited probleemidest."}}, {"course_week": 14, "time": "2024-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {"et": "Õppijate ettekanded; ettevalmistus eksamiks (14.30-17.30 Lossi 36-307)"}, "description": {"et": "Õppijate lühiettekanded aktuaalsetel EL-i institutsioonide ja poliitikatega seotud teemadel. Arutelu. Ettevalmistus lõppeksamiks."}}]}, "registration_info": {"audience": {"et": "Euroopa õpingute magistritudengid"}, "min_students": 10}, "parent_uuid": "8eb7a94f-f634-52a6-d5eb-29898fe47521", "parent_code": "P2EC.00.248", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}