{"uuid": "0abe68bc-4538-cba1-be68-c122985d007a", "code": "P2EC.00.142", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Internship in the Public Service, Private Sector, Civil Society", "et": "Praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Internship is a work-related learning experience that follows university regulations and is guided by a tutor. Its aim is to help the student in achieving study goals set in the curriculum. Duration of the internship is 6 weeks, 40 hours per week, total 240 hours.\nThe internship must be in accordance with the purpose of the curriculum and related to learning outcomes. The internship must be either in the same field as the purpose of  the curriculum or, more generally, enhance research and analysis skills (see more in internship manual, available at http://skytte.ut.ee/sites/default/files/skytte/js_internship_manual_inglisekeelne_1.pdf)", "et": "Praktika on õpiväljundite saavutamiseks korraldatav üliõpilase sihipärane tegevus töökeskkonnas õppeasutuste määratud vormis ning juhendaja juhendamisel. Praktika kestus on 6 nädalat, 40 tundi nädalas kokku 240 tundi.\nPraktika peab toetama õppekava eesmärkide ja seatud õpiväljundite saavutamist. Praktika peab olema seotud õppekava eesmärkidega kas valdkondlikult või uurimis- ja analüüsivõimet arendavate tegevustega üldisemalt (vt lähemalt praktika juhendis, kättesaadav http://skytte.ut.ee/sites/default/files/skytte/js_internship_manual_eestikeelne_1.pdf)"}, "objectives": [{"en": "Internship is a work-related learning experience under the guidance of a tutor that follows the guidelines set by the Johan Skytte Institute of political studies. The aim of an internship is to have an actual work experience in the field of study in order to test one's theoretical knowledge through practical work, apply theoretical knowledge in a real-life situation, see how work is organised in different establishments and observe the work processes as well as to develop the students' ability and habits for doing independent work. Internship must follow the aims and study goals set in the curriculum. The internship must be in line with the aims of the curriculum either by the field of activity or in general with activities that develop research and analytical skills.", "et": "Praktika on töökeskkonnas korraldatav üliõpilase sihipärane tegevus Johan Skytte poliitikauuringute insituudi poolt määratud vormis ning juhendaja juhendamisel. Praktika eesmärgiks on tutvuda reaalse tööga omandataval erialal, kinnistada teoreetilisi teadmisi praktilise töö kaudu, rakendada õpitut reaalses töökeskkonnas, tutvuda erialaga seotud asutuste töökorraldusega ja jälgida erinevaid tööprotsesse ning arendada üliõpilase iseseisva töö oskusi ja harjumusi. Praktika peab toetama õppekava eesmärkide ja seatud õpiväljundite saavutamist. Praktika peab olema seotud õppekavade eesmärkidega kas valdkondlikult või uurimis- ja analüüsivõimet arendavate tegevustega üldisemalt."}], "learning_outcomes": [{"en": "A student successfully implemented internship:", "et": "Praktikat edukalt läbinu üliõpilane:"}, {"en": "- practiced knowledge acquired during classes in a working environment and developed proficiency;", "et": "- harjutab erinevates õppeainetes õpitu rakendamist töökeskkonnas ja arendab vastavaid vilumusi;"}, {"en": "- gained and developed transferable skills, such as time management, team work, project management and communication skills, as well as develop attitudes necessary for working in an international environment;", "et": "- õpib ja arendab eriala-üleseid ehk nn ülekantavaid oskusi nagu nt ajajuhtimis-, meeskonnatöö-, projektijuhtimis- või suhtlemisoskusi ning kujundada vastavaid hoiakuid (nt praktika vabatahtlikuna rahvusvahelises organisatsioonis välisriigis);"}, {"en": "- demonstrates knowledge of administration and management in an organisation while observing different working processes.", "et": "- tutvub ja demonstreerib erialaga seotud asutuste töökorralduse aluseid ja jälgib erinevaid tööprotsesse (nt vaatluspraktika)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}