{"uuid": "da14f9f7-10ee-ee3d-5eb2-bde90157e5e8", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-13T10:25:28", "title": {"en": "Contemporary Challenges to European Integration", "et": "Euroopa integratsiooni nüüdisaegsed väljakutsed"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV Eng", "et": "24/25 S SÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course has two main parts, which will run parallel. During the first part of each meeting, seven specific EU cases will be put central in the course; the actual choice of topics will be made as late as possible in order to stay close to actual developments. Students will be provided (on the course website) with basic material on these four policy areas, as well as relevant background academic resources (papers, articles). Each case is introduced and discussed, using the expertise of policy-makers and experts. In the second part of each meeting, following a students' presentation on the same topic, a seminar will be held, and students will get small (group) assignments to prepare beforehand. These assignments will vary for each case (preparation of some questions, policy note, presentation). Students will be assigned different roles (presenter/discussant, advocate/opponent) for these class meetings. Second, students are trained in understanding and using some simple tools/methods for policy analysis and communication, by means of four specific (group) assignments on the cases/issues.", "et": "."}, "objectives": [{"en": "The purpose of the course is to discuss a number of contemporary policy issues that currently define the EU political agenda, such as the war in Ukraine, the COVID-19 crisis, post-Brexit Britain's relations with Brussels, and migration. Students are trained to analyse various current EU policy problems and to design solutions to tackle these issues.", "et": "."}], "learning_outcomes": [{"en": "Upon completion of the course, students: \n\n- Use basic methods to analyse complex (\"wicked\") policy problems in the EU context (problem analysis/root cause analysis) \n\n- analyse the positions of various EU actors (institutions, Member States, other stakeholders) regarding such problems and regarding possible solutions (stakeholder analysis) \n\n- use foresight techniques for policy analysis and design (scenario-writing, Delphi method, brainstorming, expert consultations, trend extrapolations) \n\n- find relevant information from the EU databases (legislation, policy documents, EUROSTAT) and from specialized think-tanks/on-line media \n\n- effectively communicate on policy analysis and design, both orally and in writing \n\n- adequately provide and receive feedback to/from fellow students and from lecturers, in class-settings \n\nKey competences to be improved: sense making, novel and adaptive thinking, cross-cultural competency, transdisciplinarity, design mind-set, cognitive load management.", "et": "."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "The group presentation is assessed according to the following criteria:\n- Analytical ability\n- Grouping ideas\n- Connecting concepts and objects\n- Synthesis and clarity\n\nIn order for the task to be considered achieved, the content of the group work and its oral presentation should demonstrate the ability to analytically connect concepts, theories, and empirical objects and the practical skills to group ideas in the light of coherent general meanings. The presentation should also summarize the results of the group work in coherent and clear way combining synthesis and completeness.\n\nThe failure to meet these criteria when it comes to the content of the group work and its oral presentation will determine the failure of the task.\n\nThe task is assessed on a non-differentiated provided that the required minimum criteria are achieved."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "The reflection paper is assessed according to the following criteria:\n- Problem solving\n- Critical thinking\n- Analytical ability\n- Grouping ideas\n- Connecting concepts and objects\n- Connecting theory and hypotheses\n- Methodological clarity\n\nThe reflection paper is assessed according to the following scale:\n11-20 - The required minimum criteria are generally achieved; the formal aspects of the task are, on the whole, met; the descriptive and analytical parts of the task present a sufficient level of development; however, recommendation part is non-existent or clearly underdeveloped. The method appears only formally applied but not substantially interiorized and the student fails to properly include and discuss the consistent literature.\n21-30 - The required minimum criteria are achieved; the formal aspects of the task are, generally, met; the descriptive and analytical parts of the task present a satisfactory level of development; however, the recommendation part and its research component present appear basic, inconsistent, and underdeveloped in most of the parts. The method appears only imperfectly formally applied and poorly interiorized and the student includes and discusses only the basic literature related to the task.\n31-40 - The required minimum criteria are achieved, not only formally, but also substantially; the descriptive and analytical part of the task present a good level of sophistication. The recommendation part and its (generally satisfactory) research component, appear well developed, but still present some weakness at times. The method appears generally well applied and - on the whole - interiorized and the student includes and discusses not only the basic literature related to the task, with some degree of sophistication.\n41-50 - The required criteria are achieved, not only formally, but also substantially; almost the totality of the aspects of the task are met. The descriptive and analytical parts present a very high level of sophistication. The recommendation part and its research component, appear highly developed and satisfactory, and present only very marginal weakness that does not affect the final result. The method appears well applied and interiorized and the student includes and discusses a consistent amount of literature related to the task, with a satisfactory degree of sophistication.\n51-60 - The required minimum criteria are achieved, not only formally, but also substantially; the totality of the aspects of the task are met. Both the descriptive/analytical and recommendation parts of the task appear equally well developed and present a remarkably high level of sophistication in their arguments and consistency. The method appears remarkably applied and fully interiorized and the student includes and discusses a vast amount of literature related to the task, with a high degree of sophistication."}}], "grade_preconditions": {"et": "In order to be considered for the final evaluation students are required to attend at least 5 out 7 meetings and perform a successful class presentation."}, "grade_evaluation": {"et": "Once the pre-conditions to be considered for the final assessment are met, the components of the final evaluation will weight in the definition of the final grade according to the following distribution of points:\n\nWork description Max. points\nReflection paper (60% of the final grade): 60\nClass presentation (40% of the final grade): 40\nTotal: 100\n\nThe final grade is computed on the basis of the positively assessed test and of the positive grade for the policy recommendation.\n\n1. Students are expected to attend all course meetings and to come to class well prepared to discuss the readings.\n2. Students who are not satisfied with the outcome of the final written exam and wish improve their course grade can submit a 4-page critical review of a short reading previously agreed with the instructor. A max of 5 points can be added to the final grade according to the quality of the review.\n3. Plagiarism is not tolerated and can lead to failing the course. More details are available at www.plagiarism.org\n4. The use of systems based on artificial intelligence (including, but not limited to, ChatGPT) for the development, drafting, and production of written assignments within the framework of this course is considered academic fraud, unless explicitly authorized by the instructor. If in doubt, contact the instructor.\n\nNOTE\nIf you are a special needs student and need adjustments in your studies, please consult with the website https://ut.ee/en/content/counselling-students-special-needs and turn to the Special Needs Adviser. It is strongly recommended that you make the appointment as early as possible before the beginning of the semester."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a1ef1681-2ca7-4c1d-bd31-cc1a89952b5a", "type": "MOODLE", "code": "P2EC.00.244", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "88dc55da-3957-ca43-2bf8-28ea2a626f60", "person_name": "Stefano Braghiroli", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "time": "2024-09-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Introducing policy analysis, cycles, and modes"}, "description": {"et": "ONLINE"}}, {"course_week": 1, "time": "2024-09-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Contentious Green Politics (held by Ville Haapanen)\nStudents' presentation\nSeminar"}, "description": {}}, {"course_week": 1, "time": "2024-10-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Ukraine's membership in the EU (+ enlargement)\nStudents' presentation\nSeminar"}, "description": {"et": "ONLINE"}}, {"course_week": 1, "time": "2024-10-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Qualified majority in foreign policy and security\nStudents' presentation\nSeminar"}, "description": {}}, {"course_week": 1, "time": "2024-11-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "EU's take on AI\nStudents' presentation\nSeminar"}, "description": {"et": "ONLINE"}}, {"course_week": 1, "time": "2024-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Multiculturalism and complex post-industrial societies\nStudents' presentation\nSeminar"}, "description": {}}, {"course_week": 1, "time": "2024-12-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Future of the EU - What idea of Europe?\nStudents' presentation\nSeminar"}, "description": {"et": "ONLINE"}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 30}, "parent_uuid": "02ad8e2f-c856-b861-6a89-4c43ef83502d", "parent_code": "P2EC.00.244", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}