{"uuid": "75d986d7-570b-d050-0021-e92550de8eef", "code": "sv-2024-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-29T17:46:21", "title": {"en": "Introduction to Literature Theory", "et": "Sissejuhatus kirjandusteadusesse"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 5, "practice": 0, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Theory and practice of literary research. Overview of literary styles and genres.", "et": "Kirjandusteaduse teooria ja kirjanduslike tekstide analüüs inglise keeles. Ülevaade kirjanduslikest stiilidest ja žanridest."}, "objectives": [{"en": "teaching basic theory  of  analysing literature.", "et": "anda teoreetilised alused kirjandusteose analüüsiks."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "On completion of the course a student:\n1) is aware of contemporary theories of literature, fiction elements, poetry and drama;\n2) is able to analyze modern English and American literary works taking into consideration peculiarities of the genre and the author;\n3) is able to make research in the area of literature and conduct analysis of a literary text in the volume of bachelor's and master's theses on literature topics.", "et": "1) on teadlik tänapäeva kirjanduse, ilukirjanduse elementide, luule ja näitekirjanduse teooriatest;\n2) on võimeline analüüsima tänapäeva inglise ja ameerika kirjanduse teoseid arvestades žanri ja autori eripärasusi;\n3) on võimeline tegema kirjanduslikku teadustööd ning läbi viima kirjandusteksti analüüsi kirjanduslikel teemadel bakalaureuse- ja magistritööde teksti analüüsi mahus."}], "notes": {}}, "grading": {"independent_work": {"et": "The detailed description of the volume of independent work is available with the Moodle learning environment of the course (https://moodle.ut.ee)). Peer assessment/feedback posted in Moddle forums  is a constituent part (pre-requisite to course completion) of students' independent work."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Term tests on literary analysis of fiction, poetry and drama \nA-\tanalysis of the text is done according to the analysis plan, all questions are answered with maximum precision and reference to corresponding theoretical sources; the answer demonstrates a very high level of independent and creative thinking  and contributes to well-known interpretations of the text.\nB-\tAnalysis follows the plan; all questions are answered correctly and demonstrate very good knowledge of theoretical aspects; the answers reveal the ability of critical thinking and creativity at a very good level; it shows the knowledge of literary critics' opinions of the text. \nC-\tAnalysis  follows the analysis plan in general, all questions are answered with various degrees of  precision and demonstrate good knowledge of theoretical aspects; the answers  reveal partial readiness of the student to analyse a piece of literature critically; the analysis shows good level of independent thinking.\nD-\tAnalysis answers some research questions and shows  student's  satisfactory knowledge of some theoretical sources to support the analysis; there are some references to other critics' opinions; the analysis demonstrates satisfactory level of  independent thinking and creativity;\nE-\tAnalysis demonstrates student's knowledge of some basic principles of literary analysis and his/her  ability to apply them while analysisng a piece of literature in a conventional way;  the analysis demonstrates a poor  level of  independent thinking and creativity;"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Final written assessment \nA-\tExam questions are answered with maximum precision and reference to corresponding theoretical sources and are supported by references to the sample text; the answer demonstrates a very high level of independent and creative thinking and contributes to well-known interpretations of the text.\nB-\tExam  questions are answered correctly and demonstrate very good knowledge of theoretical aspects and reference to the sample text; the answers reveal the ability of critical thinking and creativity at a very good level; it shows the knowledge of literary critics' opinions of the text. \nC-\tExam  questions are answered with various degrees of  precision and demonstrate good knowledge of theoretical aspects and are supported by references to the sample text; the answers  reveal partial readiness of the student to analyse a piece of literature critically; the analysis shows good level of independent thinking.\nD-\tAnswers to exam  questions show the student's  satisfactory knowledge of some theoretical aspects  and do not have any support by example from the sample text; there are some references to other critics' opinions; the answers demonstrate satisfactory level of  independent thinking and creativity;\nE-\tExam answers demonstrate student's knowledge of some basic principles of literary analysis and his/her  ability to apply them while analysisng a piece of literature in a conventional way;  the analysis demonstrates a poor  level of  independent thinking and creativity."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Home work assignments \nA-\tthe paper is presented on time; all tasks are completed in full with excellent  knowledge of background resources and  principles of literary analysis; it demonstrates  creative and independent thinking \nB-\tthe paper is presented on time; all tasks are completed with very good knowledge of background resources and  principles of literary analysis; it shows very good  ability of the student to apply theoretical knowledge in practice;\nC-\tthe paper is presented on time; all tasks are completed with good knowledge of background resources and  principles of literary analysis; it shows good  ability of the student to apply theoretical knowledge in practice but lacks original thinking; \nD-\tthe paper is presented with delay; all tasks are completed with satisfactory  knowledge of background resources and  principles of literary analysis\nE-\tthe paper is presented with delay; tasks are completed with satisfactory to poor  knowledge of background resources and  principles of literary analysis."}}], "grade_preconditions": {"et": "Teadmisi hinnatakse jooksvalt praktiliste tööde ja iseseisvate tööde alusel."}, "grade_evaluation": {"et": "The course finishes with a written examination in Moodle\nExam questions\n1.What is Literature? What makes literature pleasant, truth in literature\n2.The nature of literature. Theories of literature: imitative, expressive, affective\n3.Some elements of fiction: the plot, the characters, the theme, plausibility\n4.Fiction . Point of view\n5.Parable, allegory, symbolism\n6.Setting, style, decorum, propriety, tone\n7.Narrative poetry: ballads\n8.Lyric poetry, diction, tone, the voice of satirist\n9.Figurative language: simile, metaphor, personification, apostrophe\n10.Irony and paradox, rhythm\n11.Some elements of drama, tragedy, comedy, comic tragedy"}, "debt_elimination": {"et": "The course participant has to account for each missed test paper within two weeks as per agreement with the lecturer."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "7a8463f7-e8c1-a16f-b6c7-05adbc753c04", "person_name": "Nina Raud", "structural_unit": {"code": "SVNC05", "name": {"en": "Division of Foreign Languages", "et": "võõrkeelte lektoraat"}, "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVNC", "is_expired": true}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-22"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Some Theories of Literature"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "FICTION. Some Elements of Fiction. Plausibility in Fiction. Point of View. Allegory and Symbolism. Style.("}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "POETRY. Narrative poetry : Popular Ballads. Lyric Poetry. The Speaking Tone of Voice."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "DRAMA. Some Elements of Drama. Tragedy."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Consolidation"}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "37fe8883-41f9-b282-6cd5-07636bc5df2c", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "5026e89d-8c61-374d-a997-90f67ac40d59", "parent_code": "P2NC.00.510", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}