{"uuid": "aecf9670-42ed-917e-7b3f-3ac4c6ffdf61", "code": "P2NC.01.114", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Enterprise Internship", "et": "Ettevõttepraktika"}, "credits": 17, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The Enterprise Internship starts with a description of professional practical Enterprise Internship, how student can be successful in it and with a presentation of IT companies (practical training bases). In the internship, students will:\n*\tSelect a company(ies) for Enterprise Internship.\n*\tCreate an Enterprise Internship plan in co-operation with external supervisor.\n*\tComplete the Enterprise Internship.\n*\tCreate an Enterprise Internship report and defend it.", "et": ".."}, "objectives": [{"en": "The goal of the Enterprise Internship is to acquire real work experience in an IT related enterprises/companies. Enterprise Internship will give students opportunities to acquire skills required for entering labor market and experience in:\n*\tworking in enterprises/companies (key skills).\n*\tthe suitability of their personal characteristics (personal skills).\n*\tthe suitability and level of their acquired knowledge (skills related to education).\n*\tpotential opportunities for future career (career management skills).\n*\tTo get acquainted with the directions of the main activities of the base enterprise, company or organization.\n*\tTo get acquainted with the main activities of the organization. \n*\tTo fulfill specific work tasks independently.\n*\tTo teach fulfilment of a set task in a team setting. \n*\tTo learn and to the whole extent obtain experience in the area of the base organization's work.\n*\tTo learn to effectively implement theoretical knowledge obtained in the college.", "et": "Eesmärgiks on õpingute käigus omandatud teoreetiliste teadmiste ja praktiliste oskuste rakendamine töökeskkonnas. \n\nPraktika tööülesanded täpsustatakse praktikajuhendis. Praktika on hajutatud ja toimub töökeskkonnas. Koostada tuleb praktikaaruanne ja see tuleb avalikult kaitsta."}], "learning_outcomes": [{"en": "*\tEffectively implement previously obtained theoretical knowledge", "et": "Praktika läbinud üliõpilane: "}, {"en": "*\tPlan his/her activities correctly; compile an individual work plan.", "et": "-  rakendab ülesannete lahendamisel asjakohaseid töövõtteid ja meetodeid ning leiab vajadusel sellekohast täiendavat lisainfot; "}, {"en": "*\tDescribe the technological, planning or other process in the organization, especially one he/she has participated in.", "et": "- kogub ja tõlgendab erialast informatsiooni, sealjuures selgitab ja argumenteerib tehtud valikuid ja otsuseid; "}, {"en": "*\tGive an objective evaluation to his/her activities during the internship.", "et": "- töötab iseseisvalt ja meeskonnas, suhtub sallivalt hoiakute ja väärtuste mitmekesisusse."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}