{"uuid": "f6e538dc-9cbd-7999-2dc1-2452a810d839", "code": "P2NC.00.812", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-29T14:30:45", "title": {"en": "Language Acquisition", "et": "Keele omandamine"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Consider theoretical and practical approaches to aquisition of mother tongue, foreign language and Estonian language by both children and adults.", "et": "Vaadeldakse nii emakeele kui võõrkeele omandamise põhilisi teoreetilisi käsitlusi ja eesti keele omandamist nii lapse kui täiskasvanu poolt."}, "objectives": [{"en": "inroduce to language development of children, ways and methods of second language aquisition by adults.", "et": "tutvustada lapse keelelise arengu ja täiskasvanu teise keele omandamise seaduspärasusi ja meetodeid."}], "learning_outcomes": [{"en": "1) has an overview of the main notions and issues of (second) language acquisition, theoretical schools, development trends, and topical problems;", "et": "1) saab ülevaate (teise) keele omandamise uurimise põhimõistetest ja problemaatikast, teoreetilistest koolkondadest, arengusuundadest ja aktuaalsetest probleemidest;"}, {"en": "2) has essential knowledge about (second) language acquisition and bilingualism and are able to apply the acquired knowledge in their professional activities;", "et": "2) omandab baasteadmised (teise) keele omandamisest ning kakskeelsusest, ollakse suutelised omandatud teadmisi ja oskusi erialases töös rakendama;"}, {"en": "3) has a critical understanding of the problems of (second) language acquisition, can analyse them and evaluate different solutions;", "et": "3) tekib kriitiline arusaam (teise) keele omandamisega seotud probleemidest, osatakse neid analüüsida ja hinnata erinevaid lahendusi;"}, {"en": "4) knows the most important theories and is thoroughly familiar with the main reserach trends of (second) language acquisition.", "et": "4) teades tähtsamaid teooriaid, suudab paremini orienteeruda (teise) keele omandamise uurimise põhisuundades."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}