{"uuid": "fecec92d-dbc7-6e9c-e52a-36874017333d", "code": "P2NC.00.946", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Estonian I", "et": "Praktiline eesti keel I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "language_training": {"language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "is_in_depth_estonian_training": true}}, "overview": {"description": {"en": "During the course all four consistuent skills are developed: listening, speaking, reading and writing.", "et": "Kursuse vältel arendatakse üliõpilastes kõiki nelja osaoskust: kuulamist, kõnelemist, lugemist ja kirjutamist."}, "objectives": [{"en": "The aim of the course is to improve knowledge of the Estonian language by reference to the students' preliminary language level.", "et": "Arendada üliõpilase eesti keele oskust, lähtudes tema esialgsest keeleoskuse tasemest."}], "learning_outcomes": [{"en": "B1: \n1) can understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc;\n2) can deal with most situations likely to arise whilst travelling in an area where the language is spoken;\n3) can produce simple connected text on topics which are familiar or of personal interest;\n4) can describe experiences and events, dreams, hopes & ambitions and briefly give reasons and explanations for opinions and plans.\nB2:\n1) can understand the main ideas of complex text on both concrete and abstract topics, including technical discussions in his/her field of specialization;\n2) can interact with a degree of fluency and spontaneity that makes regular interaction with native speakers quite possible without strain for either party;\n3) can produce clear, detailed text on a wide range of subjects and explain a viewpoint on a topical issue giving the advantages and disadvantages of various options;\nC1:\n1) can understand a wide range of demanding, longer texts, and recognize implicit meaning;\n2) can express him/herself fluently and spontaneously without much obvious searching for expressions;\n3) can use language flexibly and effectively for social, academic and professional purposes\n4) can produce clear, well-structured, detailed text on complex subjects, showing controlled use of organizational patterns, connectors and cohesive devices.", "et": "B1: Üliõpilane teab ja mõistab olulist endale tuttaval teemal (töö, kool, vaba aeg, reisimine jne). Saab hakkama argisituatsioonis. Oskab koostada lihtsat teksti tuttaval või enda jaoks huvipakkuval teemal. Oskab kirjeldada kogemusi, sündmusi, unistusi ja eesmärke ning lühidalt põhjendada-selgitada oma seisukohti ja plaane. \nB2: Üliõpilane mõistab ja teab keerukamate tekstide sõnavara ning mõistab ning erialase mõttevahetuse tuuma. Suudab spontaanselt ja ladusalt vestelda sama keele emakeelse kõnelejaga. Oskab paljudel teemadel luua selget, üksikasjalikku teksti ning selgitada oma vaatenurka, kaaluda kõnealuste seisukohtade tugevaid ja nõrku külgi. \nC1: Üliõpilane mõistab pikki ja keerukaid tekste, tabab ka varjatud tähendust. Oskab end spontaanselt ja ladusalt mõistetavaks teha, väljendeid eriti otsimata. Oskab kasutada keelt paindlikult ja tulemuslikult nii avalikes, õpi- kui ka tööoludes. Oskab luua selget, loogilist, üksikasjalikku teksti keerukatel teemadel, kasutades sidusvahendeid ja sidusust loovaid võtteid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}