{"uuid": "aeb5678a-8ede-7f08-2e12-d212930c4595", "code": "P2NC.00.400", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Developmental Psychology", "et": "Arengupsühholoogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Discussion of different theories of psychological development.  Development of superior psychic functions.  Children's social, emotional and cognitive development in different age groups.  Age crises.  During the course the students learn how to create a developing environment for the optimal physical, psychic, social and emotional development of a child, taking into account individual peculiarities of children.", "et": "Ülevaade olulisematest arenguteooriates (Freud, Bowlby, Mahler, Piaget, Kohlberg jt).Ealised kriisid,. Vaimseks, sotsiaalseks,  emotsionaalseks, kõlbeliseks ning  kehaliseks arenguks soodne keskkond,  individuaalsete erinevuste  arvestamine kasvukeskkonna loomisel."}, "objectives": [{"en": "to introduce the principles and consequences of psycho-and psychological development of a child in different age periods.", "et": "Kursuse eesmärgiks on tutvustada üliõpilastele laste arengu iseärasusi erinevatel eaperioodidel."}], "learning_outcomes": [{"en": "Learning outcomes:\n- knows the specifics of the development of higher psychological functions; knows the principles of the social, emotional, and cognitive development at different ages;\n- knows how to create a favourable environment for learning and mental, physical, social, emotional and moral development;\n- knows how to plan the educational process with consideration to the developmental crises of children and young people;\n- can implement the principles of developmental psychology when helping to resolve the problems of children and young people;\n- notices the individual developmental differences in children and young people and understands how to consider these in the learning process, thereby creating a safe environment for development.", "et": "- teab kõrgemate psüühiliste funktsioonide arengu iseärasusi; laste ja noorte sotsiaalse, emotsionaalse, kognitiivse arengu põhimõtteid erinevatel eaperioodidel;\n- omab ettekujutust sellest, kuidas kujundada õppimiseks, vaimseks, kehaliseks, sotsiaalseks, emotsionaalseks ja kõlbeliseks arenguks soodsat keskkonda;\n- teab, kuidas laste ja noorte ealisi kriise arvestades kavandada ja organiseerida õppetegevust ja kasvatusprotsessi;\n- oskab rakendada arengupsühholoogia põhimõtteid, et aidata lahendada laste ja noorte probleeme;\n- märkab laste ja noorte individuaalseid arenguerinevusi ja mõistab, kuidas arvestada neid õppeprotsessis, luues arenguks turvalise keskkonna."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}