{"uuid": "a29269ea-dc92-f9c8-39fb-39db966444b4", "code": "P2OG.02.168", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Environmental Law", "et": "Keskkonnaõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "6d463fb1-3d98-8c00-a792-913d0c49c0b4", "code": "P2OG.02.109", "title": {"en": "Administrative Court Procedure", "et": "Haldusprotsess"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The topics of the lectures and seminars of the Environmental Law course include the development of environmental law, the goals of environmental protection and environmental values, the main concepts and principles of environmental law, the levels of environmental regulation, the means of regulating environmental law, the rights and obligations related to the environment, compliance with environmental norms and verification thereof, environmental responsibility, and the foundations of regulating the most important fields of the special part of environmental law. The course includes learning about the court practice of the European Court of Human Rights, the Court of Justice of the European Union, and Estonian courts.", "et": "Keskkonnaõiguse loengute ja seminaride raames käsitletakse keskkonnaõiguse kujunemist, keskkonnakaitse eesmärke ja keskkonnaväärtusi, keskkonnaõiguse põhimõisteid ja põhimõtteid, keskkonnaalase regulatsiooni tasandeid, keskkonnaõiguse reguleerimisvahendeid, keskkonnaalaseid õigusi ja kohustusi, keskkonnaalaste normide täitmise jälgimist ja kontrolli, keskkonnavastutust ning keskkonnaõiguse eriosa olulisemate valdkondade regulatsiooni põhialuseid. Ainekursus hõlmab Euroopa Inimõiguste Kohtu, Euroopa Liidu Kohtu ja Eesti vastava kohtupraktika tundmaõppimist."}, "objectives": [{"en": "The aim of the Environmental Law course is to teach the theoretical bases of environmental law, explain the main concepts and principles of environmental law and the system of environmental rights and obligations, as well as to give an overview of the means of regulating environmental law and the most important levels of legal control over environmental nuisances.", "et": "Keskkonnaõiguse õppeaine eesmärk on õpetada keskkonnaõiguse teoreetilisi põhialuseid, selgitada keskkonnaõiguse põhimõisteid, põhimõtteid ning keskkonnaalaste õiguste ja kohustuste süsteemi. Samuti anda ülevaade keskkonnaõiguse reguleerimisvahenditest ja keskkonnahäiringute õigusliku kontrolli olulisematest tasanditest."}], "learning_outcomes": [{"en": "By the end of the course, the student will:", "et": "Kursuse lõpuks üliõpilane:"}, {"en": "1. know the main terms of environmental law and be able to explain the content of the most important principles of environmental law;", "et": "1. teab keskkonnaõiguse põhimõisteid ning oskab selgitada keskkonnaõiguse olulisemate põhimõtete sisu;"}, {"en": "2. be able to apply the most important principles of environmental law in solving problems related to the field;", "et": "2. oskab rakendada keskkonnaõiguse olulisemaid põhimõtteid keskkonnaõiguslike probleemide lahendamisel;"}, {"en": "3. know the connections between environmental law in Estonia, the EU, and globally;", "et": "3. tunneb rahvusvahelise, Euroopa Liidu ja Eesti keskkonnaõiguse seoseid;"}, {"en": "4. have an overview of the main institutions of environmental law and understand their connections to other fields of law;", "et": "4. omab ülevaadet keskkonnaõiguse põhiinstituutidest ning mõistab nende seoseid teiste õiguse valdkondadega;"}, {"en": "5. know the system of legal means for environmental nuisances and understand its functioning;", "et": "5. tunneb keskkonnahäiringute kontrolli õiguslike vahendite süsteemi ja mõistab selle toimimist;"}, {"en": "6. know the foundations of the most important fields of the special part of environmental law.", "et": "6. teab keskkonnaõiguse eriosa olulisemate valdkondade regulatsiooni põhialuseid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}