{"uuid": "ffb1f698-6b3c-6ea2-77b7-f235037dedeb", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-30T10:54:25", "title": {"en": "European Human Rights Law", "et": "Inimõigused Euroopas"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 22, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Goals are to get to know what are the main aspects of international protection of human rights: where in this system is situated the European Convention on Human Rights, what is the position of European Convention on Human Rights in the legal systems of  Convention member states, in parfticular in Estonia; how does the European Court of Human Rights work:  structure and functions of this Court; main principles that the Court applies in its work. The course will also give an overview of the most important cases of the European Court of Human Rights and analyse recent case-law, as well as the case law connected to Estonia. It wll also be explained how the member states, including Estonia have implemented the decisions and judgments of the European Court of Human Rights. At the end of the course a short overview of the \"Bermuda triangle\" in the protection of fundmanetal rights: the Estonian Constitution, the European Convention on Human Rights and the Charter of Fundamental Rights of the European Union will be discussed.", "et": "Selgeks saada mis on inimõiguste rahvusvahelise kaitse peamised aspektid; kus paikneb selles süsteemis ja millise kaitsesüsteemi tagab Euroopa Inimõiguste Konventsioon; kus paikneb see konventsioon osalisriikide õigussüsteemides, sh Eestis; kuidas toimib Euroopa Inimõiguste Kohus: ülesehitus ja ülesanded; olulisemad põhimõtted mida see kohus oma töös rakendab. Ülevaade Euroopa Inimõiguste Kohtu kõige olulisematest lahenditest. Analüüs värskeimast kohtupraktikast; Euroopa Inimõiguste Kohtu Eestit puudutavad lahendid. Kuidas on Euroopa Inimõiguste Kohtu lahenditega arvestanud liikmesriigid, sh Eesti. Lühidalt Bermuda kolmnurgast: Eesti Põhiseadus, Euroopa Inimõiguste Konventsioon ja Euroopa Liidu Põhiõiguste Harta."}, "objectives": [{"en": "Main goals are: to learn and understand the principal aspects of the international protection of human rights based on the practice of the protection system of the European Convention on Human Rights. To navigate in the functions and case law of the European Court of Human Rights and to study the relations between European human rights protection and national (Estonian) law.", "et": "Saada selgeks inimõiguste rahvusvahelise kaitse peamised aspektid Euroopa Inimõiguste Konventsiooni praktika näol. Orienteeruda Euroopa Inimõiguste Kohtu töös ja olulisemas kohtupraktikas ning osata seda seostada riigi (Eesti) õigusega."}], "learning_outcomes": [{"en": "The student who has passed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "-- understands the role and nature of human rights", "et": "-- mõistab inimõiguste rolli ja olemust"}, {"en": "-- knows the historical development and theoretical bases of human rights", "et": "-- tunneb inimõiguste ajaloolist arengut ja teoreetilisi lähtekohti"}, {"en": "-- names essential human rights instruments", "et": "-- nimetab olulisemaid inimõiguste alaseid lepinguid"}, {"en": "-- describes and compares principal protective mechanisms for human rights", "et": "-- kirjeldab ja võrdleb peamisi inimõiguste kaitsemehhanisme"}, {"en": "-- explains and interprets the content of core human rights and relevant practice", "et": "-- selgitab ja tõlgendab kesksete inimõiguste sisu ja asjakohast praktikat"}], "notes": {}}, "grading": {"independent_work": {"et": "I Oral presentation  at the seminar: (maximum 15 minutes): \nTopics:  \n1)\tAdmissibility criteria (European Court of Human Rights);  \n2)\tSingle judge at the European Court of Human Rights;  \n3)\tWell established case-law (WECL) and three member committees at the European Court of Human Rights;  \n4)\tSeven judges chambers and their impact to the case law of the European Court of Human Rights. What impacts have the inadmissibility decisions to the case-law?  \n5)\tReferal and relinbquishment also appeal procedure to the Grand Chamber of the European Court of Human Rights and the Grand Chamber panel;  \n6)\t(Oral) hearings at the European Court of Human Rights, including Third Party  interventions;  \n7)\tHow is the judgment of the Grand Chamber of the European Court of Human Rights prepared?  \n8)\tEuropean Court of Human Rights and comperative law research;  \n9)\tEuropean Court of Human Rights  and European consensus;  \n10)\tDissenting opinions at the European Court of Human Rights; \n11)\tInter-state cases at the European Court of Human Rights;    \n12)\tSubsidiarity versus European Court of Human Rights as a constitutional court in Europe;  \n13)\tMargin of appreciation in the case-law of the European Court of Human Rights;    \n14)\tEuropean Convention on Human Rights as a living document;  \n15)\tSocial and economic rights in the case-law of the European Court of Human Rights;   \n16)\tMost important case-law of the European Court of Human Rights on human dignity;  \n17)\tRight to life and European Court of Human Rights;   \n18)\tRight to a fair trial (choose one or two aspects only) and the case-law of the European Court of Human Rights;   \n19)\tAdvisory opinions of the European Court of Human Rights and their impact on the Contracting States;  \n20)\tFreedom of expression versus right to respect private life in the case-law of the European Court of Human Rights;   \n21)\tRight to liberty and security in the case-law of the European Court of Human Rights;    \n22)\tPrisoners rights and European Court of Human Rights;   \n23)\tProhibition of torture and inhuman or degreading treatment in the case-law of the European Court of Human Rights;   \n24)\tModern slavery and forced labour and the case law of the European Court of Human Rights;   \n25)\tFreedom of assembly and association as seen by the European Court of Human Rights - choose one problematic country as an example;  \n26)\tNe bis in idem in the case-law of the European Court of Human Rights;  \n27)\tRight to property and European Court of Human Rights;   \n28)\tNo punishment without law as understood by the European Court of Human Rights;    \n29)\tRight to free elections in the case-law of the European Court of Human Rights;   \n30)\tRight to an effective remedy in the case-law of the European Court of Human Rights;   \n31)\tHate speech and the case-law of the European Court of Human Rights;  \n32)\tRights of foreigners and the case-law of the European Court of Human Rights;   \n33)\tChildrens rights and the case-law of the European Court of Human Rights;   \n34)\tRight of elderly people and the case-law of the European Court of Human Rights;   \n35)\t Equal treamtent in the the case-law of the European Court of Human Rights;   \n36)\t Freedom of religion and the case-law of the European Court of Human Rights;  \n37)\tRight to education in the case-law of the European Court of Human Rights;   \n38)\t Political cases and the European Court of Human Rights; \n39)\tMost important cases connected to Russia in the European Court of Human Rights;  \n40)\tMost important cases connected to Turkey in the European Court of Human Rights;   \n41)\tMost important cases connected to France in the European Court of Human Rights;  \n42)\tMost important cases connected to Germany in the European Court of Human Rights;   \n43)\tMost important cases connected to Italy in the European Court of Human Rights;   \n44)\tMost important cases connected to Poland in the European Court of Human Rights;   \n45)\tMost important cases connected to Ukraine in the European Court"}, "grade_preconditions": {"et": "46)\tMost important cases connected to Romania in the European Court of Human Rights;   \n47)\tEuropean Court of Human Rights and European Union law;   \n48)\tEuropean Court of Human Rights and critics in academic world and professional literature;  \n49)\tEuropean Court of Human Rights and COVID-19; \n50)\tEuropean Court of Human Rights and Estonian Supreme Court.   \n\nII Choose freely one judgment of the European Court of Human Rights and analyse it by preparing a maximum of 10 power point slides in which you will need to answer to the following questions: who were the parties in this case; in which formation the European Court of Human Rights was sitting and deciding; which human right was in play in the case; did the case bring along any considerable impact/changes to the case-law of the European Court of Human Rigts, to the development of human rights in general; what were the most important aspects of the judgment; what did the Court exactly decide, was there any compensation awarded; how did the state (respondendt government)/states react; were there any comments about this judgment in the literature; has the judgment been implemented/executed? \n\nCondition to attend teh exam: Oral seminar presentation and a case study;"}, "grade_evaluation": {"et": "A: 100 - 90; B: 89 - 79; C: 78 - 68; D: 67 - 57; E 56 - 46; alla 45 F, F: below 45 \n\nPresentation at the seminar: 20 \nCase study: 20 \nTheoretiacl part at tyhe written exam: 30 \nPractical part at the written exam: 30"}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "2d1ea3bd-5cec-4b23-83c7-8853300b57b1", "type": "MOODLE", "code": "P2OG.02.248_ENG", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Euroopa Inimõiguste Konventsioon; \nEuropean Convention on Human Rights; \nFactsheets of the European Court of Human Rights: https://www.echr.coe.int/Pages/home.aspx?p=press/factsheets&c=", "recommended_materials": "Case-law Guides by Article, European Court of Human Rights: \nhttps://www.echr.coe.int/Pages/home.aspx?p=caselaw/analysis/guides&c=#"}, "participants": {"lecturers": [{"person_uuid": "c1ae882a-082b-cff4-c2c0-0dfaccaf97bd", "person_name": "Julia Laffranque", "structural_unit": {"code": "SVOI02TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-15"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "1)\tWhat are the main aspects of international protection of human rights: where in this system is situated the European Convention on Human Rights?\n2)\tWhat is the position of European Convention on Human Rights in the legal systems of  Convention member states, in parfticular in Estonia?"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "3)\tHow does the European Court of Human Rights work? Structure of the Court;\n4)\tHow does the European Court of Human Rights work? Functions of the Court;"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "5)\tMain principles that the Court applies in its work: subsidiarity, margin of appreciation, European Convention on Human Rights as a living document, proportionality, main interpretative tools; \n6)\tOverview of the most important cases of the European Court of Human Rights;"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "7)\tOverview of the most important cases of the European Court of Human Rights; \n8)\tOverview of the most important cases of the European Court of Human Rights;"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "9)\tCase law of the Europan Convention on Human Rights connected to Estonia; \n10)\tCase law of the Europan Convention on Human Rights connected to Estonia;"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "11)\tSeminar presentations; \n12)\tSeminar presentations;"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "13)\tAnalyse of most recent case-law of the European Court of Human Rights; \n14)\tAnalyse of most recent case-law of the European Court of Human Rights;"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "15)\tImplementation of the judgments of the European Court of Human Rights in general; \n16)\t Examples of how the member states, including Estonia have implemented the decisions and judgments of the European Court of Human Rights"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "17)\tDialogue between the European Court of Human Rights and national courts; Protocol 16 to the Convention; \n18)\tDialogue between the European Court of Human Rights and other international courts; Overview of the \"Bermuda triangle\" in the protection of fundmanetal rights: the Estonian Constitution, the European Convention on Human Rights and the Charter of Fundamental Rights of the European Union;"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "19)\tOverview of the \"Bermuda triangle\" in the protection of fundmanetal rights: the Estonian Constitution, the European Convention on Human Rights and the Charter of Fundamental Rights of the European Union; \n20)\tVirtual tour at the European Court of Human Rights."}}]}, "registration_info": {"audience": {"et": "Master’s students of International Law and Human Rights, but other master’s students are also welcome depending on certain limitations"}, "min_students": 5, "max_students": 30}, "parent_uuid": "e3415402-a275-ca88-1146-7deff8965814", "parent_code": "P2OG.02.248", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}