{"uuid": "cf7cf6c2-a9a9-a2e7-f4c6-668cbcd9d259", "code": "P2OG.01.061", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Data Protection", "et": "Andmekaitse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "1. Development of data protection law. EU data protection legislation (including drafts).\n2. Material / territorial scope of GDPR. One-shop mechanism. Transfer of data to third countries.\nScope of Personal Data Protection Act and GDPR in Estonia.\n3. Basic definitions of data protection\n4. Data protection principles and legal bases for processing.\n5. Consent, legitimate interest; objections; deletion request\n6. Freedom of expression vs. privacy\n7. Special categories of personal data. Requirements for national legislation. Special categories of personal data in employment.\n8. Public sector data processing (automatic administrative acts, proactive services, state databases); Imposition of restrictions under Article 23 of the GDPR\n9. Privacy policy. Data subject's right to access.\n10. Data Security. Preparation for exam.", "et": "1. Andmekaitseõiguse kujunemine. Andmekaitsealased õigusaktid ELs (sh eelnõud). \n2. IKÜM esemeline/territoriaalne kohaldamisala. One-shop mehhanism. Kolmandatesse riikidesse andmete edastamine. \nIKSi ja IKÜMi kohaldamisala Eestis. \n3. Andmekaitse põhimõisted\n4. Andmekaitse põhimõtted ning töötlemise õiguslikud alused. \n5. Nõusolek, õigustatud huvi; vastuväited; kustutamisnõue\n6. Väljendusvabadus vs eraelu puutumatus\n7. Eriliiki isikuandmed. Nõuded siseriiklikule regulatsioonile. Eriliiki isikuandmed töösuhetes. \n8. Avaliku sektori andmetöötlus (automaatsed haldusaktid, proaktiivsed teenused, riigi andmekogud); IKÜM art 23 alusel piirangute kehtestamine\n9. Andmekaitsetingimused. Andmesubjekti õigus tutvuda enda kohta käivate andmetega. \n10. Andmeturve. Ettevalmistus eksamiks."}, "objectives": [{"en": "To provide basic knowledge of data protection law and to draw attention to bottlenecks in practice. The course deals with theory hand in hand with practical cases and examples. Completion of the course provides the student with the necessary basis for further in-depth research or training of a data protection specialist. As personal data is everywhere, basic knowledge of data protection law is useful in almost every field, but will certainly be needed in future legislative work and in organization of public sector data processing.", "et": "Anda andmekaitseõiguse baasteadmised ning juhtida tähelepanu praktikas eksisteerivatele kitsaskohtadele. Kursusel käsitletakse teooriat käsikäes praktiliste kaasuste ja näidetega. Kursuse läbimine annab õpilasele vajaliku baasi edasiseks süvendatud uurimistööks või andmekaitsespetsialisti väljaõppeks. Kuivõrd isikuandmed on kõikjal, on andmekaitseõiguse baasteadmised kasulikud pea igas valdkonnas, ent kindlasti vajalikud tulevases õigusloometöös ning avaliku sektori andmetöötluse korraldamisel."}], "learning_outcomes": [{"en": "Student who has passed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows which legislation governs data protection and to what it applies;", "et": "- teab, mis õigusaktid andmekaitset reguleerivad ning millele need kohalduvad;"}, {"en": "- knows where to find relevant materials;", "et": "- teab, kust leida teemakohaseid materjale; "}, {"en": "- understands the connection between data protection and fundamental rights and the conditions for limiting fundamental rights;", "et": "- mõistab andmekaitse seost põhiõigustega ning põhiõiguse riive tingimusi;"}, {"en": "- is familiar with the definitions, principles and basic rules of EU data protection law and is able to apply GDPR and the Personal Data Protection Act in resolving cases.", "et": "- tunneb EL andmekaitseõiguse mõisteid, põhimõtteid ja isikuandmete töötlemise põhilisi reegleid ning oskab IKÜMit ning isikuandmete kaitse seadust rakendada kaasuste lahendamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}