{
    "uuid": "06ba7bdf-86b8-52fc-2299-ffbffbd749f3",
    "code": "sv-2018-autumn-fulltime-c6-en",
    "state": {
        "code": "confirmed",
        "et": "Kinnitatud",
        "en": "confirmed"
    },
    "last_update": "2023-12-21T16:34:08",
    "title": {
        "en": "History and Theory of International Law",
        "et": "Rahvusvahelise õiguse ajalugu ja teooria"
    },
    "credits": 6,
    "credit_type": "ECTS",
    "target": {
        "year": {
            "code": "2018",
            "et": "2018/2019",
            "en": "2018/2019"
        },
        "semester": {
            "code": "autumn",
            "et": "sügis",
            "en": "autumn"
        },
        "study_type": {
            "code": "fulltime",
            "et": "päevaõpe",
            "en": "regular studies"
        },
        "language": {
            "code": "en",
            "et": "inglise keel",
            "en": "English"
        },
        "part": {
            "code": "0",
            "et": "Osadeta",
            "en": "None"
        },
        "faculty": {
            "code": "SV",
            "name": {
                "en": "Faculty of Social Sciences",
                "et": "sotsiaalteaduste valdkond"
            },
            "address": "Tartu linn, \nTartu linn, Tartumaa \nEST",
            "city": "Tartu linn",
            "level": 1,
            "academic": true,
            "supports_continuous_learning": true
        },
        "course_main_structural_unit": {
            "code": "SVOI",
            "name": {
                "en": "School of Law",
                "et": "õigusteaduskond"
            },
            "email": "oi@ut.ee",
            "phone": "+372 737 5390",
            "webpage_url": "https://oigus.ut.ee",
            "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST",
            "city": "Tartu linn",
            "street": "Näituse 20 - 324",
            "zip": "50409",
            "level": 2,
            "academic": true,
            "supports_continuous_learning": true,
            "parent_code": "SV"
        },
        "label": {
            "en": "18/19 A regular SV Eng",
            "et": "18/19 S PÕ SV Eng"
        }
    },
    "general": {
        "year": {
            "code": "2018",
            "et": "2018/2019",
            "en": "2018/2019"
        },
        "input_languages": [
            {
                "code": "et",
                "et": "eesti keel",
                "en": "Estonian"
            }
        ],
        "structural_unit_shares": [
            {
                "structural_unit_code": "SVOI",
                "structural_unit_name": {
                    "en": "School of Law",
                    "et": "õigusteaduskond"
                },
                "course_share_percent": 100,
                "coordinating": true
            }
        ],
        "type": {
            "code": "regular",
            "et": "Tavaline aine",
            "en": "Regular course"
        }
    },
    "additional_info": {
        "is_vota_course": true,
        "is_continuous_learning_course": false,
        "study_levels": [
            {
                "code": "master",
                "et": "magistriõpe",
                "en": "master's studies"
            }
        ],
        "hours": {
            "lecture": 16,
            "practice": 0,
            "seminar": 16,
            "colloquium": 0,
            "web_learning": 0,
            "independent_work": 124,
            "individual_work": 0,
            "internship": 0
        },
        "is_enlight_course": false
    },
    "overview": {
        "study_languages": [
            {
                "code": "en",
                "et": "inglise keel",
                "en": "English"
            }
        ],
        "description": {
            "en": "International law cannot be understood only as contemporary body of norms. First of all, this body of norms has evolved over time which is why understanding the history of international law is crucial for understanding this law today. Secondly, different theoretical and methodological schools have developed different approaches to what international law is, and in order to practice the field, it is necessary to develop an understanding of these different approaches. This course deals with the central questions and problems of the history and theory of international law.",
            "et": "Rahvusvahelist õigust ei saa mõista üksnes kaasaegse õigusnormide kogumina. Esiteks on need õigusnormid kujunenud välja aja jooksul, mistõttu rahvusvahelise õiguse ajaloo mõistmine on oluline selle õiguse tänaseks mõistmiseks. Teiseks, erinevatel koolkondadel on erinevad lähenemised ja arusaamad rahvusvahelisest õigusest ja praktiseerimaks edukalt rahvusvahelise õiguse valdkonnas tuleb ka neid erinevusi teada ja kasutada osata. Nii tegelebki see kursus rahvusvahelise õiguse ajaloo ja teooria kesksete küsimustega."
        },
        "objectives": [
            {
                "en": "To provide a broad understanding of the historical development of and theoretical debates in international law, and to grasp their relevance for contemporary practice of international law",
                "et": "Pakkuda põhjalikku arusaama rahvusvahelise õiguse ajaloolisest arengust ja teoreetilistest debattidest, mõistmaks nende tähtsust kaasaja rahvusvahelise õiguse praktika jaoks"
            }
        ],
        "learning_outcomes": [
            {
                "en": "The student who has passed the course is able to:",
                "et": "Õppeaine läbinud üliõpilane:"
            },
            {
                "en": "-- Understand the main periods and central figures in the history of international law, understood both as practice as well as the scholarly field",
                "et": "-- Teab peamisi perioode ja keskseid kujusid rahvusvahelise õiguse ajaloos ja selle teaduse ajaloos"
            },
            {
                "en": "-- Understand the central theoretical debates in the field of international law such as on the nature, sources, subjects and reach of this law",
                "et": "-- Teab peamisi teoreetilisi debatte ja küsimusi rahvusvahelises õiguses nagu näiteks selle õiguse olemus, allikad, subjektid ja selle õiguse ulatus"
            },
            {
                "en": "-- Understand the main methodological approaches and debates in the field of international law",
                "et": "-- Teab peamisi meetodeid ja koolkondi rahvusvahelise õigusega tegelemisel"
            }
        ],
        "notes": {
            "et": "(1) More specific syllabus is made available under study materials\n(2) Messages sent to students via Study Information System are considered as delivered"
        }
    },
    "grading": {
        "independent_work": {
            "et": "(1) Independent work with study materials\n(2) Writing a research paper\nIn the research paper, the student analyses critically one problem related to the history and/or theory of international law. The selected problem should be registered electronically (lauri.malksoo@ut.ee) by 1 November. The instructor may ask the student to choose another problem if the chosen problem is not suitable or too many students have already chosen the same problem. The paper should be submitted electronically (lauri.malksoo@ut.ee) as a Word-file no later than on 20 December at 12:00 (noon). For every started overdue day, the result will be decreased by four points, but papers which are late more than four days are not accepted and the student would not pass the course. The instructor cannot consider papers sent by email.\nThe paper must include title page, table of content, main body and list of used materials. For references, use footnotes. The length of main text (starting from the introduction and ending with the conclusion, excluding footnotes) should be 2000-2500 words. Shorter papers are not accepted or the result is lowered by the discretion of the instructor.\nIndependent identification of clear issues and legal problems is very important. Also, the use of different sources and supportive materials. All used sources must be referred to. In case of internet sources, the full address is necessary, not only the main domain (e.g. www.un.org). A paper based on copy-paste method leads to negative results for both the paper and the exam."
        },
        "independent_work_assessments": [
            {
                "work_type": {
                    "code": "research",
                    "et": "Uurimistöö",
                    "en": "research paper"
                },
                "description": {
                    "et": "Criteria:\n-- Consistency, completeness and correctness of the answers to theoretical questions\n-- Creativeness and consistency of the solutions to hypothetical cases\n-- Depth of the analysis of problems and applicable norms and principles\n-- Association of theory with state and court practice\n-- Structure, grammar and formatting\nGrades:\nA: Analysis of legal problems is detailed and innovative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]\nB: Analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC: Analysis of legal problems is good with some deficiencies concerning specific issues; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]\nD: Analysis of legal problems is satisfactory with deficiencies is most aspects; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]\nE: Analysis of legal problems is shallow with significant deficiencies is most aspects; overall, the coverage of the subject suffers of superficial treatment, poor knowledge of law and unsound presentation [51-60 points]"
                }
            },
            {
                "work_type": {
                    "code": "written",
                    "et": "Kirjalik lõpphindamine",
                    "en": "final written assessment"
                },
                "description": {
                    "et": "Criteria:\n-- Consistency, completeness and correctness of the answers to theoretical questions\n-- Creativeness and consistency of the solutions to hypothetical cases\n-- Depth of the analysis of problems and applicable norms and principles\n-- Association of theory with state and court practice\n-- Structure, grammar and formatting\nGrades:\nA: Analysis of legal problems is detailed and innovative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]\nB: Analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC: Analysis of legal problems is good with some deficiencies concerning specific issues; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]\nD: Analysis of legal problems is satisfactory with deficiencies is most aspects; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]\nE: Analysis of legal problems is shallow with significant deficiencies is most aspects; overall, the coverage of the subject suffers of superficial treatment, poor knowledge of law and unsound presentation [51-60 points]"
                }
            }
        ],
        "grade_preconditions": {
            "et": "(1) Participation in all classes. It is allowed to miss maximum 3 classes out of 16 but each time the instructor must be informed beforehand.\nIf a student did not participate in the class/seminar, he/she must submit, within a week, a one-page response paper to the material discussed in the particular seminar. Each late submission of a summary decreases the final points by three points.\n(2) Timely submission and positive evaluation of a research paper."
        },
        "grade_evaluation": {
            "et": "(1) Class attendance and participation (40 points)\n-- Attendance\n-- Activism and quality of participation\n(2) Research paper (60 points)"
        },
        "debt_elimination": {
            "et": "In accordance with the Study Regulations and in consultation with the course instructor"
        },
        "assessment_scale": {
            "code": "grade",
            "et": "Eristav (A, B, C, D, E, F, mi)",
            "en": "differentiated (A, B, C, D, E, F, not present)"
        },
        "results_available_from": {}
    },
    "resources": {
        "web_based": {
            "code": "2",
            "et": "põimõpe",
            "en": "blended learning"
        },
        "website_url": "http://moodle.ut.ee",
        "is_moodle_connected": false,
        "mandatory_materials": "Books\n-- Bardo Fassbender & Anne Peters (eds), The Oxford Handbook of the History of International Law (Oxford University Press, 2012)\n-- Anne Orford & Florian Hoffmann (eds), The Oxford Handbook of the Theory of International Law (Oxford University Press, 2016)",
        "recommended_materials": "Books\n-- Wilhelm Grewe, The Epochs of International Law (Berlin: De Gruyter, 2000)\n-- Susan Marks (ed.), International Law on the Left: Re-examining Marxist Legacies (Cambridge University Press, 2011)\n-- Yasuaki Onuma, A Transcivilizational Perspective on International Law (Leiden: Brill, 2010)\nOther materials\n-- ILC Study \"Fragmentation of International Law: Difficulties arising from the Diversification and Expansion of International Law\", 13 April 2006.\n-- Symposium on Method in International Law, AJIL, April 1999."
    },
    "participants": {
        "lecturers": [
            {
                "person_uuid": "67f1346b-205b-ed69-56f1-9e5be48bc597",
                "person_name": "Lauri Mälksoo",
                "structural_unit": {
                    "code": "SVOI02TR",
                    "name": {
                        "en": "Tartu Office",
                        "et": "Tartu osakond"
                    },
                    "address": "EST",
                    "level": 4,
                    "academic": false,
                    "supports_continuous_learning": false,
                    "parent_code": "SVOI02"
                },
                "is_responsible": true,
                "is_teaching": true
            }
        ]
    },
    "schedule": {
        "weeks": {
            "et": "2-16"
        },
        "entries": [
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Introductory Class"
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "History of International Law Scholarship at the University of Tartu\nTo read: L. Mälksoo, 'The Science of International Law and the Concept of Politics: the Arguments and Lives of International Law Professors at the University of Dorpat/Yurev/Tartu 1855-1985', 76 British Year Book of International Law 2005, 383-501. (In SIS under 'Malksoo in British Year Book'.)"
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "History of international law: A Transcivilizational Perspective\nTo read: Y. Onuma, A Transcivilizational Perspective on International Law, Martinus Nijhoff Publisher, 2010, pp 266-369."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Hugo Grotius\nTo read: Hugo Grotius on the Law of War and Peace. Student edition. Edited and annotated by S. Neff, Cambridge University Press, 2012, pp xiii-19 and M. J. van Ittersum, 'Hugo Grotius. The Making of a Founding Father of International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 82-100."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "History of International Law in Europe in 1648-1919\nTo read: H. Durchhardt, 'From the Peace of Westphalia to the Congress of Vienna', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 628-653 and M. Vec, 'From the Congress of Vienna to the Paris Peace Treaties of 1919', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 654-678."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "History of International Law in 1919-1945\nTo read: P. Krüger, 'From the Paris Peace Treaties to the End of the Second World War', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 679-698 and G. Simpson, 'International Law in Diplomatic History, in: J. Crawford, M. Koskenniemi (eds) The Cambridge Companion to International Law, CUP, 2012, pp 25-46."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "United States in the History of International Law\nTo read:  M. Janis, 'North America: American Exceptionalism in International Law', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 525-552."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "China in the History of International Law\nTo read: Chi-hua Tang, 'China-Europe', in: B. Fassbender, A. Peters, The Oxford Handbook of the History of International Law, OUP, 2012, pp 701-723 and T. Ruskola, 'China in the Age of the World Picture', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 138-155."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "TWAIL and Marxist Approaches to International Law\nTo read: A. Anghie, 'Imperialism and International Legal Theory', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 156-172 and R. Knox, 'Marxist Approaches to International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 306-326."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Kelsen and Schmitt\nTo read: J. von Bernstorff, 'Hans Kelsen and the Return of Universalism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 192-211 and R. Howse, 'Schmitt, Schmitteanism and Contemporary International Legal Thought', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 212-230."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Realism\nTo read: O. Jütersonke, 'Realist Approaches to International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 327-343."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "International Legal Positivism\nTo read: J. Kammerhofer, 'International Legal Positivism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 407-426."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "New Haven School\nTo read: H. Saberi, 'Yale's Policy Science and International Law: Between Legal Formalism and Policy Conceptualism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 427-451."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Liberal Institutionalism\nTo read: D. Joyce, 'Liberal Institutionalism', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 471-487 and W. Werner and G. Gordon, 'Kant, Cosmopolitanism and International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 505-525."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Feminist Approaches to International Law\nTo read: D. Otto, 'Feminist Approaches to International Law', in: A. Orford and F. Hoffmann (eds) The Oxford Handbook of the Theory of International Law, OUP, 2016, pp 488-504."
                }
            },
            {
                "work_type": {
                    "code": "lecture",
                    "et": "loeng",
                    "en": "lecture"
                },
                "topic": {},
                "description": {
                    "et": "Comparative International Law\nTo read: A. Roberts et al, 'Comparative international law: framing the field', 109 AJIL 2015, pp 467-474."
                }
            }
        ]
    },
    "registration_info": {
        "audience": {
            "et": "Master's students of International Law and Human Rights, but other master's students are also welcome depending on certain limitations"
        },
        "min_students": 10,
        "max_students": 27
    },
    "parent_uuid": "fb92a837-67a2-c588-7e58-09b4df26c6aa",
    "parent_code": "P2OG.02.195",
    "parent_credits": 6,
    "_actions": {
        "is_moodle_editable": false,
        "is_editable": false,
        "is_deletable": false
    }
}