{"uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the course, the following four subject blocks will be addressed: general questions of constitutional law; fundamental principles of the Constitution; constitutional institutions and their interrelations; fundamental rights.", "et": "Loengukursuse raames käsitletakse nelja suurt blokki: riigiõiguse üldküsimused; põhiseaduse aluspõhimõtted; riigikorraldus; põhiõigused."}, "objectives": [{"en": "The subjects of the course are the legal construction of the state, legal relations between persons and the state based on the fundamental rights and the relations between the constitution and the law of the European Union. The further subjects are the nature of the constitution, its functions and fundamental principles as well as their forms of realization. In addition to the theoretical basis, the participants will be acquainted with the acts of parliament and the jurisprudence in question and learn to independently conduct a constitutional review.", "et": "Riigiõiguse kursuse esemeks on riigi õiguslik ülesehitus, põhiõigussuhted isiku ja riigi vahel ning põhiseaduse ja Euroopa Liidu õiguse vahekord. Aines käsitletakse põhiseaduse olemust, funktsioone ja aluspõhimõtteid ning nende rakendusvorme. Lisaks teoreetilistele alustele õpitakse tundma vastavaid õigusakte ja kohtupraktikat ning iseseisvalt läbi viima põhiseaduspärasuse kontrolli."}], "learning_outcomes": [{"en": "After having participated in the course, the student should be able to recognize the constitutional problem where it exists, and to solve it by using the methods of constitutional interpretation. The student must be able to convincingly argue for or against the violation of the Constitution. Students who have completed the course are also expected to be familiar with the fundamental rights set forth in the Constitution and to be able to evaluate the legality of fundamental rights restrictions. Additionally, the student must, by the end of the course, have acquired the skill to read and analyse important sources of Estonian constitutional law, especially the constitutional review decisions of the Supreme Court. In addition, during the course, the student will get an overview of the constitutional institutions of Estonia as well as of their relations with each other and the relationship between the constitution and the EU Law.", "et": "Üliõpilane peaks pärast kursusel osalemist olema võimeline ära tundma põhiseadusliku probleemi, kus see eksisteerib, ning olema suuteline seda lahendama põhiseadusõiguslikku argumentatsiooni kasutades. Üliõpilane peab suutma veenvalt põhjendada, kas konkreetsel juhtumil on põhiseadust rikutud või mitte. Üliõpilaselt, kes on läbinud kursuse eeldatakse, et ta on tuttav põhiseadusega tagatud põhiõigustega ning suudab iseseisvalt hinnata põhiõiguspiirangute õiguspärasust. Lisaks peaks üliõpilane kursuse lõpuks olema omandanud oskuse lugeda ja analüüsida olulisi riigiõiguse allikaid, iseäranis Riigikohtu põhiseaduslikkuse järelevalve alaseid otsuseid. Ka omandab üliõpilane loengukursuse käigus ülevaate Eesti põhiseaduslikest institutsioonidest ja nende omavahelistest suhetest ning Eesti ja Euroopa Liidu õiguse omavahelistest suhetest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}