{"uuid": "1625353f-702d-a879-7802-42a84aaf2d56", "code": "P2OG.02.257", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:16:14", "title": {"en": "National Security Law and Threats to State Security", "et": "Riigi julgeoleku õigus ja ohud riigi julgeolekule"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "86b8d1f8-ffa4-71eb-bf52-f8ed480fd87f", "code": "P2OG.02.156", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "a49a7d97-c7c5-073c-9588-d8ffb68640ed", "code": "OIAO.07.075", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}]}, "overview": {"description": {"en": "The course introduces the legal acts that regulate national security in the country and provides a broader framework for understanding factors that threaten national security, both domestically and internationally. It covers Estonia's membership in NATO and the European Union, as well as the legal foundations and obligations that arise from this for the country's legal regulations. The course discusses the fundamentals of national security and security policy, as well as international cooperation in threat prevention. Using spesific cases, an overview is provided of threat prevention and potential legal measures for ensuring national security. The course also provides an overview of events that have influenced European security in the near past and their impact on Estonia's national security", "et": "Õppeaines analüüsitakse riigi julgeoleku õigust reguleerivaid õigusakte ja annatakse laiem raamistik, mõistmaks riigi julgeolekut ohustavaid tegureid nii riigi sees kui välismaal, nt Eesti kuulumine NATOsse ja Euroopa Liitu ning õiguslikud alused ja kohustused, mis sellest tulenevad riigi õiguslikule regulatsioonile. Õppeaines käsitletakse riigi turvalisuse ja julgeolekupoliitika aluseid, samuti rahvusvahelist koostööd ohtude ennetamisel. Näidiskaasuste pinnalt antakse ülevaade ohtude ennetamisest ning võimalikest õiguslikest meetmetest riigi julgeoleku tagamisel. Samuti antakse ülevaade Euroopa\n\njulgeolekut mõjutanud lähiajaloo sündmustest ning mõjust Eesti riigi julgeolekule."}, "objectives": [{"en": "This course aims to introduce understanding of the main principles of the state security law and prime threats to state security to preserve peaceful status of state inside and outside on the counrty.", "et": "Aine eesmärk on, et üliõpilane analüüsib riigi julgeoleku õiguses, riigi julgeolekut ohustavaid peamisi tegureid ning nimetab õiguslikke vahendeid julgeoleku tagamisel riigi sisemise ja välise rahu tagamisel."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "· Understands the main concepts that regulate the field and uses the terms in the correct context; ", "et": "- tunneb peamiseid mõisteid, mis valdkonda reguleerivad ja kasutab neid õiges kontekstis; "}, {"en": "· Understands the state's security environment and the main threats to national security; ", "et": "- analüüsib riigi julgeoleku keskkonda ja peamisi ohte riigi julgeolekule; "}, {"en": "· Understands preventive measures in ensuring security and legal regulations; ", "et": "- hindab ennetavaid meetmeid julgeoleku tagamisel ning analüüsib vastavat õiguslikku regulatsiooni; "}, {"en": "· Discusses, based on spesific cases, the legal regulations and political decision-making processes that formed the basis for resolving circumstances threatening national security.", "et": "- arutleb näidiskaasuste pinnalt õigusliku regulatsiooni ja poliitiliste otsustusprotsesside üle, mis olid aluseks riigi julgeolekut ohustavate asjaolude lahendamisel"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}