{"uuid": "fb279a27-0c94-5a6d-4061-5c26ec13e08e", "code": "P2OG.01.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Property Law", "et": "Asjaõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "8955dde8-be11-e24f-6801-7d0c65a63285", "code": "P2OG.01.030", "title": {"en": "Civil Law: General Part", "et": "Tsiviilõiguse üldosa"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Within the course in property law the general principles of real rights, as well as differences between real rights in movables and real rights in immovable property are dealt with. Students are further taught individual real rights such as right of ownership, servitudes, real encumbrances, right of superficies, right of pre-emption and right of security. In the course of the studies the cases of principal importance are learned. Within the frames of the course the methodology of solving case analyses is acquired.", "et": "Asjaõiguse kursuse raames käsitletakse asjaõiguse üldpõhimõtteid, vallasasjaõiguse ja kinnisasjaõiguse erisusi. Õpitakse tundma üksikuid asjaõigusi nagu omand, servituudid, reaalkoormatised, hoonestusõigus, ostueesõigus ja pandiõigused. Õppetöö käigus õpitakse tundma valdkonna kohtupraktika põhimõttelise tähtsusega lahendeid. Ainekursuse raames omandatakse kaasuste lahendamise metoodika."}, "objectives": [{"en": "The overall goal of this course is to provide students withbasic education in property law, explaining the nature and formulation of fundamental principles and institutions of property law, their interrelationships, and their connection to other parts of the civil law. Students are also taught methods and approaches to resolving cases arising under property law.", "et": "Õppeaine üldiseks eesmärgiks on õpetada asjaõiguse teoreetilisi alusteadmisi, selgitada asjaõiguse põhimõtete ja instituutide kujunemist, nende olemust ja vastastikuseid seoseid ning seoseid tsiviilõiguse teiste valdkondadega, samuti õpetada asjaõiguse praktiliste kaasuste lahendamise metoodikat."}], "learning_outcomes": [{"en": "Students successfully completing this course should be able to:", "et": "Kursuse lõpuks peab üliõpilane olema võimeline:"}, {"en": "- explain the nature and essence of institutions and principles central to property law and their relation to other parts of private law.", "et": "- selgitama asjaõiguse instituutide ning põhimõtete olemust ning nende seoseid teiste eraõiguse valdkondadega; "}, {"en": "- understand overall relationships between laws pertaining to property, personal property, and real property, and their application.", "et": "- mõistma üldise asjaõiguse, vallasasjaõiguse ja kinnisasjaõiguse seoseid ning kohaldamise spetsiifikat;"}, {"en": "- apply the norms and concepts of property law to resolution of disputes before various institutions (and arriving at the correct legal conclusion).", "et": "- kohaldama asjaõiguse norme vastavate instituutidega seotud vaidluste lahendamisel (esitades korrektse õigusliku arvamuse);"}, {"en": "- access and utilize relevant scholarly publications and court precedents in the resolution of presented cases.", "et": "- kasutama olemasolevat õiguskirjandust ja kohtupraktikat kaasuste lahendamisel;"}, {"en": "- employ several methods for construing the content and public policy goals of various provisions of property law.", "et": "- rakendama erinevaid tõlgendusmeetodeid asjaõiguse normi sisu ja eesmärkide selgitamiseks;"}, {"en": "- prepare reasoned analysis and proposed solutions to cases presented in the classroom and resolved pursuant to the methodology provided.", "et": "- esitama asjaõiguse õppekaasuse analüüsi ja lahenduskäigu vastavalt etteantud metoodikale;"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}