{"uuid": "de69c0fc-aacc-b410-e17e-27a2553329b7", "code": "sv-2024-autumn-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-30T17:56:42", "title": {"en": "Enforcement Law", "et": "Korrakaitseõigus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 8, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "69c6f551-0cd9-31b1-7f99-a18d8db57af5", "code": "P2OG.02.154", "title": {"en": "Administrative Law", "et": "Haldusõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The lecture focuses on the law enforcement law.", "et": "Loengukursus keskendub korrakaitseõigusele."}, "objectives": [{"en": "The aim of the course is to provide students with the theoretical foundations of law enforcement law, to explain the concept, source and development of law enforcement law, as well as the basic concepts of law enforcement law, the legal interests protected by law enforcement law and the thresholds for intervention, the addressees of law enforcement measures and the involvement of law enforcement. It will also provide knowledge of general and specific law enforcement measures, enforcement of measures, as well as an overview of specific areas of law enforcement.", "et": "Õppeaine eesmärk on anda üliõpilastele korrakaitseõiguse teoreetilisi alusteadmisi, selgitada korrakaitseõiguse mõistet, allikat ja arengut, samuti korrakaitseõiguse põhimõisteid,\nkorrakaitseõiguse kaitstavaid õigushüvesid ning sekkumislävendeid, korrakaitsemeetmete adressaate ning kaasamist. Samuti anda teadmisi korrakaitse üld- ja erimeetmetest, meetmete sundtäitmisest, aga ka anda ülevaade korrakaitse erivaldkondadest."}], "learning_outcomes": [{"en": "Students having participated in this subject:\nunderstands the theoretical foundations (including constitutional and administrative foundations), including its concept, sources, basic concepts, the structure of law enforcement law and the relationship between the general rules and the specific part;\n- understands the general principles of law enforcement law and is able to apply them to legal problems;\n- understands the principles of law enforcement, the addressee of a law enforcement measure and the involvement of the law enforcement authorities in the law enforcement process;\n- understands the legal interests protected by law enforcement and the thresholds for intervention, understands general and specific measures of law enforcement and the enforcement of a measure and is able to solve a law enforcement case, including the ability to identify the relevant rule of law and to verify whether the prerequisites of the rule of law are fulfilled and whether the administrative body has acted in accordance with the law;\n- in this context, correctly identify the type of administrative action and verify the legality of the administrative action;\n- has an overview of certain specific areas of law enforcement", "et": "Õppeaine läbinud õppija:\n- mõistab teoreetilisi aluseid (k.a. riigiõiguslikke ja haldusõiguslikke aluseid), sh selle mõistet, allikaid, põhimõisteid,\nkorrakaitseõiguse struktuuri ja üldnormide ning eriosa omavahelisi seoseid;\n- mõistab korrakaitseõiguse üldpõhimõtteid ja oskab neid rakendada õiguslike probleemide\nlahendamisel, sh mõistab korrakaitseorgani, korrakaitsemeetme adressaadi ja kaasamise\nerinevate vormide mõisteid, mõistab korrakaitseõiguse kaitstavaid õigushüvesid ja tunneb sekkumislävendeid, mõistab korrakaitse üld- ja erimeetmeid ning meetme sundtäitmist ja oskab lahendada korrakaitseõiguslikku kaasust, sh oskab leida asjakohase volitusnormi ning oskab kontrollida, kas volitusnormi eeldused on täidetud ning kas haldusorgan on õiguslikku\ntagajärge kohaldanud õiguspäraselt; selles raames oskab korrektselt määrata haldustegevuse liigi ning kontrollida haldustegevuse õiguspärasust;\n- omab ülevaadet korrakaitse teatud erivaldkondadest."}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisev töö hõlmab:\n- loenguteks ja seminarideks ettevalmistamist;\n- kohustusliku kirjanduse läbitöötamist.\n\nVabatahtlikult võib osaleda loovtöö koostamises."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Loovtöö koostamine on vabatahtlik. Loovtöö võib koostada individuaalselt või paaristööna.\n\nLoovtöö loetakse sooritatuks, kui see vastab kõigile alltoodud kriteeriumitele.\nLoovtöö hindamise kriteeriumid:\n- töö sisu peab olema seotud kursuse materjaliga;\n- töö näol on tegemist tööga, mis aitab nii selle koostajal kui kaasõppijatel kursuse materjali paremini mõista (sobiv õppevahendina);\n- loovtööd esitletakse paar nädalat enne lõpphindamist teistele üliõpilastele;\n- loovtöö autor selgitab oma töö sisu ja vormi valikut, sh seda, mida ta ise selle käigus õppis."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik lõpphindamine on kirjalik eksam. Eksamil tuleb lahendada kaasus ja vastata teoreetilistele küsimustele."}}], "grade_preconditions": {"et": "Lõpphindamisele pääsemise eeldus on osavõtt kõigist seminaridest."}, "grade_evaluation": {"et": "Lõpphinne kujuneb vabatahtliku loovtöö ja kirjaliku eksami tulemusel."}, "grade_conditions": {"A": {"et": "Kaasuse õiguslike probleemide silmapaistev ja loov lahendamine. Õiguse rakendamise meetodite silmapaistvalt hea oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete väga head taset ületav kasutamine. Ekspertstiili on kasutatud kõigi asjakohaste nõuete analüüsimisel, analüüs on silmapaistvalt heal tasemel. Kõikidele teoreetiliste küsimustele silmapaistev ja täpne vastamine. Kui üliõpilase eksamitöö teooriaosa ja kaasuse osa õpiväljundite saavutamise tasemes on vastuolu, võib hindamisel arvestada ka tema loovtööd. Küsimuste vastustes ja kaasuse analüüsis ei esine ühtegi nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "B": {"et": "\nKaasuse õiguslike probleemide eesmärgipärane ja loov lahendamine. Õiguse rakendamise meetodite väga heal tasemel oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete väga heal tasemel kasutamine. Ekspertstiili on kasutatud kõigi asjakohaste nõuete analüüsimisel, analüüs on väga heal tasemel. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused. Kõikidele teoreetilistele küsimustele ammendav vastamine. Kui üliõpilase eksamitöö teooriaosa ja kaasuse osa õpiväljundite saavutamise tasemes on vastuolu, võib hindamisel arvestada ka tema loovtööd. Küsimuste vastustes ja kaasuse analüüsis ei esine nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "C": {"et": "Kaasuse õiguslike probleemide eesmärgipärane lahendamine. Õiguse rakendamise meetodite heal tasemel oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete heal tasemel kasutamine. Ekspertstiili on kasutatud kõigi asjakohaste nõuete analüüsimisel, analüüs on heal tasemel. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas avaldub ebakindlus ja ebatäpsus. Kõikidele teoreetilistele küsimustele vähemalt heal tasemel vastamine. Kui üliõpilase eksamitöö teooriaosa ja kaasuse osa õpiväljundite saavutamise tasemes on vastuolu, võib hindamisel arvestada ka tema loovtööd. Küsimuste vastustes ja kaasuse analüüsis ei esine nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "D": {"et": "Kaasuse õiguslike probleemide lahendamine tüüpolukordades. Õiguse rakendamise meetodite piisaval tasemel oskus, kaasuse lahendamisel asjakohaste haldusõiguse allikate ja põhimõtete piisaval tasemel kasutamine. Analüüs on piisaval tasemel. Teadmiste ja oskuste kasutamine on piisav tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus, vastustes esineb mitmeid eksimusi. Enamikule teoreetilistele küsimustele vähemalt keskmisel tasemel vastamine. Kui üliõpilase eksamitöö teooriaosa ja kaasuse osa õpiväljundite saavutamise tasemes on vastuolu, võib hindamisel arvestada ka tema loovtööd. Küsimuste vastustes ja kaasuse analüüsis ei esine nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "E": {"et": "Kaasuse õiguslike probleemide lahendamisel, sh tüüpolukordades ilmneb teadmiste ja oskuste piiratud viisil kasutamine, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus, vastustes esineb mitmeid eksimusi. Üliõpilane peab siiski saavutama vähemalt miinimumtasemel olulisemad õpiväljundites nimetatud teadmised ja oskused. Miinimumtaseme saavutamiseks peab üliõpilane oskama - korrakaitseõiguse põhimõtteid, sh korrakaitseõiguse riigiõiguslikke ja haldusõiguslikke aluseid; - määratleda haldustegevuse liigile vastavad õiguspärasuse nõuded ning teadma nende nõuete sisu; - oskama tuvastada haldustegevuse volitusnormi ja määratleda selle koosseisu ning õigusliku tagajärje ning oskama subsumeerida; - oskama ära tunda, millal on haldustegevuseks vajalik seaduslik alus, sh oskama tuvastada põhiõiguste riiveid, oskama rakendada korrakaitseõiguse põhimõisteid (korrakaitseorgan, üld- ja erimeede, avalik kord). Enamikule teoreetilistele küsimustele vähemalt pinnapealne vastamine. Kui üliõpilase eksamitöö teooriaosa ja kaasuse osa õpiväljundite saavutamise tasemes on vastuolu, võib hindamisel arvestada ka tema loovtööd. Küsimuste vastustes ja kaasuse analüüsis ei esine nii olulist viga, mis seaks kahtluse alla, kas üliõpilane on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemel."}, "F": {"et": "Õppija on omandanud õpiväljundites nimetatud teadmised ja oskused miinimumtasemest (vt hinde E kirjeldus) madalamal tasemel."}}, "debt_elimination": {"et": "Mõjuval põhjusel võib puududa ühest seminarikorrast. Seminar tuleb vastata järele, esitades õppejõule kirjalik kaasuselahendus. Kaasus, mida lahendama peab, tuleb kokku leppida õppejõuga. Puudumisest tuleb õppejõudu teavitada aadressil: monika.mikiver@ut.ee."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "1a9e0d65-344a-4602-b336-85361e17cc3d", "type": "MOODLE", "code": "P2OG.02.233_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "14fd21f1-11c9-0f69-30cf-b7bb95df9d64", "person_name": "Monika Mikiver", "structural_unit": {"code": "SVOI02TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "6,10"}}, "registration_info": {"audience": {}, "max_students": 60}, "confirmation_process": {"confirmation_uuid": "640ba091-f2e8-fb06-94ce-222d53d3e1af", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "5fe0b724-d76f-3593-bf75-f0667715efcc", "parent_code": "P2OG.02.233", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}