{"uuid": "bc107a6e-3f1c-fe8f-ffe5-8383f83c3a1b", "code": "P2OG.03.094", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-08T14:39:33", "title": {"en": "The Individual, Society and Law", "et": "Inimene, ühiskond ja õigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI03", "structural_unit_name": {"en": "Department of Penal Law", "et": "karistusõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI03", "name": {"en": "Department of Penal Law", "et": "karistusõiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "c1372fc4-0cc5-9422-e631-89b75b181dac", "code": "P2OG.01.129", "title": {"en": "Basics of Legal Research and Academic Communication Skills", "et": "Õigusteadusliku uurimistöö alused ja akadeemiline väljendusoskus"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The course aims to teach students basic knowledge of psychology, sociology and social science research methods. The course begins with an introduction to individual human behaviour and the processes and factors that shape it. This is followed by information on the functioning of society and how its processes, institutions, structures and norms regulate people's lives. The link between the field of psychology and sociology and the law is an essential element of the whole course. The course will address issues such as how knowledge of psychology is helpful to the legal professional, how the law regulates processes in society, and how the law reflects society's morals and values. How to distinguish between scientifically proven knowledge and urban legends, stereotypes, and myths is an essential part of the course. To this end, students will be introduced to social science research methods.", "et": "Kursuse eesmärk on anda üliõpilastele algteadmisi psühholoogiast, sotsioloogiast ja sotsiaalteaduste uurimismeetoditest. Kursus algab õpetusega inimese individuaalsest käitumisest ning protsessidest ja teguritest, mis seda kujundavad. Järgmise sammuna lisandub teave ühiskonna toimimise kohta ning sellest, kuidas ühiskonnas toimuvad protsessid, institutsioonid, struktuurid ja normid inimeste elu reguleerivad. Oluliseks kogu kursuse puhul on psühholoogia ja sotsioloogia valdkonna seostamine õigusega. Kursusel käsitletakse küsimusi sellest, kuidas teadmised psühholoogiast tulevad kasuks juristile; kuidas õigus reguleerib ühiskonnas toimuvaid protsesse ning kuidas õiguses kajastub ühiskonna moraal ja väärtused. Olulisel kohal kursusel on see, kuidas teaduslikult tõestatud teadmist linnalegendidest, stereotüüpidest ja müütidest eristada. Selle eesmärgiga tutvustatakse üliõpilastele sotsiaalteaduslikke uurimismeetodeid."}, "objectives": [{"en": "The aim is to develop the student's understanding of (1) the principles and variability of human behaviour; (2) how people act together as a society, social structures, and social development; (3) the role of law in regulating people's lives both as individuals and as members of society; (4) how to study individual and social behaviour.", "et": "Eesmärk on arendada üliõpilase arusaama (1) inimese käitumise seaduspäradest ja variatiivsusest; (2) kuidas inimesed koos ühiskonnana toimivad, sotsiaalsetest struktuuridest, arengust; (3) sellest, millist rolli mängib õigus inimeste elu reguleerimisel nii indiviididena kui ühiskonna liikmena; (4) kuidas inimese individuaalset ja sotsiaalset käitumist uurida."}], "learning_outcomes": [{"en": "Student who has completed the course:", "et": "Õppeaine läbinud õppija:"}, {"en": "Knows what (factors and processes) shape and influence human behaviour.", "et": "Teab, mis (tegurid ja protsessid) kujundavad ja mõjutavad inimese käitumist."}, {"en": "Understand the variability of human behaviour, including factors and processes that determine and influence human behaviour.", "et": "Teab, kuidas ja millest sõltuvalt võib inimese käitumine varieeruda."}, {"en": "Relates knowledge of psychology and sociology to the field of law and discusses how knowledge of human behaviour is helpful for the legal profession.", "et": "Seostab teadmisi psühholoogiast ja sotsioloogiast õigusvaldkonnaga ja arutleb, kuidas teadmised inimese käitumise kohta tulevad kasuks juristile."}, {"en": "Knows how scientific knowledge of psychology/sociology is developed and can apply this knowledge in practice.", "et": "Teab, kuidas tekib teaduslik psühholoogia/sotsioloogia teadmine ja oskab need teadmisi praktikas rakendada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}