{"uuid": "16856f68-b062-f390-2b70-405d23ca8eda", "code": "P2OG.02.181", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "State Liability", "et": "Riigivastutus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "This subject focuses on legal remedies for protecting and restoring the rights violated by the public authority and for guaranteeing the reparation of the damage caused. Here the primary legal remedies (such as the action for annulment of an administrative act) as also the claims for the elimination of unlawful consequences and for the compensation for damages are to be mentioned. In addition, the liability of member states under the EC law will be discussed. The course centres upon case studies.", "et": "Kursuse raames käsitletakse õiguskaitsevahendeid, mille eesmärgiks on kaitsta ja taastada avalik-õiguslikus suhtes rikutud õigusi ning tagada isikule avaliku võimu poolt tekitatud kahju heastamine. Siia kuuluvad nii kahju ärahoidmisele ja vähendamisele suunatud esmased õiguskaitsevahendid kui ka kahju hüvitamise ja õigusvastaste tagajärgede kõrvaldamise nõuded. Lisaks käsitletakse EL-i õigusest tulenevat liikmesriigi vastutust. Kursuse põhirõhk on kaasusõppel."}, "objectives": [{"en": "The purpose of the subject is to give an in-depth knowledge on theoretical foundations, main legal problems and case law of the tort liability of public authorities. This subject also aims to develop students' argumentation skills and to systematically promote the practical competence for solving the cases in this field.", "et": "Kursuse eesmärgiks on anda süvendatud teadmised riigivastutusõiguse teoreetilistest alustest, aktuaalsetest probleemidest ja kohtupraktikast, arendada üliõpilaste argumenteerimisoskust ning süvendada praktilisi oskusi selle valdkonna kaasuste süstemaatiliseks lahendamiseks."}], "learning_outcomes": [{"en": "Students having participated in this subject:", "et": "Ainekursuse läbijad:"}, {"en": "-\tHave profound knowledge on the material and procedural conditions of the claims based on the tort liability of public authorities; ", "et": "-\tomavad põhjalikke teadmisi riigivastutusnõuete materiaal- ning protsessuaalõiguslikest eeldustest;"}, {"en": "-\tAre familiar with the conditions of the liability of member states under the EU law and with the relevant case law of the European Court of Justice;", "et": "-\ttunnevad Euroopa Liidu liikmesriigi vastutuse tingimusi ning Euroopa Kohtu asjaomast praktikat;"}, {"en": "-\tAre prepared to analyse the main theoretical legal standpoints and case law in this field and are ready to take posititions and make convincing arguments; ", "et": "-\toskavad analüüsida selle valdkonna peamisi õigusteoreetilisi seisukohti ja  kohtupraktikat ning oma seisukohti argumenteeritult kaitsta;"}, {"en": "-\tRecognise the legal problems of the tort liability of public authorities in practice and are skilled to deliver a detailed case study.", "et": "-\toskavad riigivastutusõiguse probleeme praktikas ära tunda ja neid riigivastutuskaasuste lahendamise metoodika alusel süstemaatiliselt lahendada."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}