{"uuid": "19b89f8b-2caa-713e-3480-9432b4ae7257", "code": "P2OG.01.088", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Law of Obligations, General Part", "et": "Võlaõiguse üldosa"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "8955dde8-be11-e24f-6801-7d0c65a63285", "code": "P2OG.01.030", "title": {"en": "Civil Law: General Part", "et": "Tsiviilõiguse üldosa"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The course provides a structural picture of the system of law of obligations and of the main institutes therein. We research the essence of the general principles; genesis of a legal obligation, incl. entering into a contract; the study of performance and breach of obligations  and liability for the breach, incl.  the system of remedies, incl. compensation of damages; personal securities etc.", "et": "Kursus loob struktureeritud pildi võlaõiguse süsteemist ja peamistest instituutidest. Uurime üldpõhimõtete olemust; võlasuhte tekkimist, sh lepingu sõlmimist; kohustuste täitmise, rikkumise ja vastutuse õpetust, sh õiguskaitsevahendite süsteemi, sh kahju hüvitamist; kõrvalkohustuste olemust jpm."}, "objectives": [{"en": "The general purpose of the course is for the student: to acquire the basic theoretical knowledge about the law of obligations; to apprehend the relationship of the clauses of the general part of the law of obligations with other areas of civil law as well as with the special part of the law of obligations; to know the concepts and the essence of the main institutes  and be able to use them in solving practical cases; to understand the methodology for solving private-law cases.", "et": "Õppeaine üldiseks eesmärgiks on tudengil: omandada teoreetilised alusteadmised võlaõiguse üldosa kohta; mõista võlaõiguse üldsätete seost tsiviilõiguse teiste valdkondade ja võlaõiguse eriosaga; saada aru mõistetest ja põhiinstituutide olemusest ning osata neid kasutada praktiliste kaasuste lahendamisel; omandada eraõiguslike kaasuste lahendamise metoodika."}], "learning_outcomes": [{"en": "A student who has successfully passed the course:\n- knows the main institutes and the general principles of the law of obligations, \n- can use that knowledge to solve cases related to the general part of the law of obligations, \n- has a structural understanding about relations between the general and special part of the law of obligations\n- is able to find and critically evaluate the sources necessary for solving legal problems concerning general part of law of obligations", "et": "Kursuse läbinud üliõpilane: \n- tunneb võlaõiguse põhiinstituute ja üldpõhimõtteid;\n- oskab oma teadmisi kasutada võlaõiguse üldosaga seotud kaasuste lahendamisel; \n- omab ettekujutust võlaõiguse üld- ja eriosa seostest;\n- oskab otsida võlaõiguse üldosa probleemide lahendamiseks vajalikke allikaid ja neid kriitiliselt hinnata;\n- oskab planeerida meeskonnatööd ja töötada grupis õigusliku probleemi lahendamiseks"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}