{"uuid": "945c3183-6336-b83f-23ed-4e8a749ad0b8", "code": "sv-2024-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-22T17:46:43", "title": {"en": "Data Protection", "et": "Andmekaitse"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 16, "independent_work": 140, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course provides a systematic examination of the legal frameworks for personal data protection within the European Union and internationally, covering the GDPR and the application of international conventions and agreements. It develops analytical and critical thinking skills, enabling participants to address data protection issues in a broader global legal context. Emphasizing cross-sectoral and technology-driven challenges, the course prepares participants to apply data protection regulations in cross-border and diverse legal environments. The curriculum highlights both theoretical understanding and practical skills, including case analysis and the application of legal research methods.", "et": "Kursus keskendub Euroopa Liidu ja rahvusvahelise isikuandmete kaitse õigusraamistiku süstemaatilisele käsitlemisele, hõlmates GDPR-i ning rahvusvaheliste konventsioonide ja lepingute rakendamist. Kursus arendab analüüsi- ja kriitilise mõtlemise oskusi, mis võimaldavad osalejatel lahendada isikuandmete kaitse küsimusi laiemas globaalses õiguskontekstis. Fookus on sektoriülesetel ja tehnoloogiapõhistel väljakutsetel, valmistades osalejaid ette isikuandmete kaitse regulatsioonide rakendamiseks piiriülestes ja mitmekesistes õiguskeskkondades. Kursusel rõhutatakse nii teoreetilist arusaamist kui ka praktilisi oskusi, sealhulgas juhtumianalüüsi ja õigusalaste uurimismeetodite rakendamist."}, "objectives": [{"en": "To provide comprehensive knowledge of the European Union and international legal frameworks of data protection, focusing on the General Data Protection Regulation (GDPR), other relevant legislation, and the case law of the Court of Justice of the European Union (CJEU).", "et": "\nAnda põhjalikud teadmised Euroopa Liidu ja rahvusvahelise isikuandmete kaitse õiguslikest raamistikest, keskendudes isikuandmete kaitse üldmäärusele (GDPR), teistele asjakohastele õigusaktidele ning Euroopa Liidu Kohtu praktikale."}, {"en": "To develop the ability to analyze and implement data protection measures in accordance with best international practices, EU regulatory requirements, and case law, ensuring the protection of data subjects' rights.", "et": "Arendada oskust analüüsida ja rakendada isikuandmete kaitse meetmeid vastavalt parimatele rahvusvahelistele tavadele, Euroopa Liidu regulatiivsetele nõuetele ning kohtupraktikale, tagades andmesubjektide õiguste kaitse."}, {"en": "To enhance critical thinking and practical skills in addressing legal and practical issues related to data protection, relying on EU and international case law and legislation in both the public and private sectors.", "et": "Arendada kriitilist mõtlemist ja praktilisi oskusi isikuandmete kaitsega seotud juriidiliste ja praktiliste probleemide lahendamisel, tuginedes Euroopa Liidu ja rahvusvahelisele kohtupraktikale ning õigusaktidele nii avalikus kui erasektoris."}, {"en": "To foster awareness and the ability to promote ethical and responsible data processing practices, considering data protection principles, EU case law, and ethical dilemmas.", "et": "Kujundada teadlikkust ja oskust edendada eetilisi ning vastutustundlikke andmetöötluspraktikaid, võttes arvesse isikuandmete kaitse põhimõtteid, Euroopa Liidu kohtupraktikat ning eetilisi dilemmasid."}], "learning_outcomes": [{"en": "The student who has passed the course:", "et": "Õppeaine läbinud tudeng:"}, {"en": "Understands the fundamentals of EU and international data protection regulation, including the principles of the GDPR and the implementation mechanisms of international conventions.", "et": "Mõistab EL-i ja rahvusvahelise isikuandmete kaitse õigusliku regulatsiooni aluseid, sealhulgas GDPR-i põhimõtteid ja rahvusvaheliste konventsioonide rakendusmehhanisme."}, {"en": "Can analyze and critically evaluate EU and international data protection laws and case law in both EU and global contexts.", "et": "Oskab analüüsida ja kriitiliselt hinnata EL-i ja rahvusvahelisi isikuandmete kaitse õigusakte ja kohtupraktikat nii EL-i kui ka globaalses kontekstis."}, {"en": "Is prepared to apply data protection regulations in international and cross-border situations, taking into account jurisdictional specifics and the impact of technological advancements.", "et": "On valmis rakendama isikuandmete kaitse regulatsioone rahvusvahelistes ja piiriülestes olukordades, võttes arvesse eri jurisdiktsioonide eripärasid ja tehnoloogiliste uuenduste mõju."}, {"en": "Is able to utilize legal research methods and tools to solve issues in international data protection, including data processing practices and case analysis within a global context.", "et": "Oskab kasutada õigusalaseid uurimismeetodeid ja tööriistu rahvusvahelise isikuandmete kaitse probleemide lahendamiseks, sealhulgas andmetöötluse praktikaid ja juhtumianalüüsi rahvusvahelises keskkonnas."}], "notes": {}}, "grading": {"independent_work": {"en": "Each student must study the materials provided for each specific seminar.  Relevant information will be posted in the Moodle environment. \n\nTo receive credit, the student must complete a research paper. In the research paper, students independently identify and consistently analyse one legal problem concerning data protection law which corresponds to their research interests. Students may consult the instructor regarding their topics. \n\nThe research paper must be analytical (not descriptive) and comply with scientific standards set forth for research articles published in scientific journals. The critical requirement is the independent identification of legal problem relating to data protection and its scientific analysis.\n\nThe paper must be compatible with the following formal requirements: 1) the paper includes a title page, table of content, main body and list of used materials. For references, use footnotes. 2) the length of the main text (starting from the introduction and ending with the conclusion, excluding footnotes) should be at least 3000-5000 words. The instructor may not accept shorter papers. 3) the student has to use relevant scientific sources such as research articles and monographs (at least 10). Students must refer to all sources they use.\n\n\nThe creation of the analytical content of the research paper with the assistance of artificial intelligence or a third party is considered a violation of academic integrity.\n", "et": "Iga üliõpilane peab töötama läbi konkreetseks seminariks antud materjali. Vastav info esitatakse Moodle keskkonnas.\n\nArvestuse saamiseks peab üliõpilane koostama uurimistöö. Uurimistöös tuvastab üliõpilane iseseisvalt ühe isikuandmete kaitse õigusega seotud õigusprobleemi, mis vastab tema uurimishuvi valdkonnale, ning analüüsib seda süstemaatiliselt. Üliõpilased võivad oma uurimisteemade osas konsulteerida õppejõuga.\n\nUurimistöö peab olema analüütiline (mitte kirjeldav) ja vastama teaduslikele standarditele, mida rakendatakse teadusajakirjades avaldatavatele uurimisartiklitele. Oluline nõue on iseseisev õigusprobleemi tuvastamine, mis on seotud isikuandmete kaitsega, ning selle teaduslik analüüs.\n\nUurimistöö peab vastama järgmistele formaalsetele nõuetele: 1) töö sisaldab tiitellehte, sisukorda, põhiosa ja kasutatud materjalide loetelu. Viitamiseks kasutada joonealuseid märkusi. 2) põhiteksti (alates sissejuhatusest kuni kokkuvõtteni, välja arvatud joonealused märkused) pikkus peab olema vähemalt 3000-5000 sõna. Lühemat tööd õppejõud ei aktsepteeri. 3) üliõpilane peab kasutama asjakohaseid teaduslikke allikaid, nagu teadusartiklid ja monograafiad (vähemalt 10). Üliõpilane peab viitama kõigile kasutatud allikatele.\n\nUurimistöö analüütilise sisu loomist tehisintellekti või kolmanda isiku abil käsitletakse akadeemilise aususe rikkumisena."}, "independent_work_assessments": [{"work_type": {"code": "exam", "et": "Arvestus", "en": "pass/fail exam"}, "description": {"en": "To be eligible for course credit, active participation in seminars is required, as well as the submission of a research paper that meets the specified requirements, along with a presentation of its main arguments in a seminar. Since seminars are primarily discussion-based, attendance is mandatory. Active participation means that the student has thoroughly reviewed the materials provided for each seminar (e.g., case law, research articles) and can engage in systematic discussion and argumentation on the topics. If a student has not reviewed the material (and cannot discuss the specific topic), this will be considered equivalent to being absent from the seminar.\n\nStudents whose study location is in Tallinn must attend in-person classes. Students based in Tartu may participate through a digital platform. Students assigned to the Tallinn study location may participate digitally only in exceptional cases (e.g., illness) with prior permission from the instructor. Participation from the digital platform without prior authorization will not be considered as attendance for students whose study location is Tallinn.\n\nStudents must attend at least 12 seminars out of 16 to be eligible for course credit. If fewer seminars are attended, eligibility for credit will be determined by the instructor, taking into account the reasons for absence, their significance, and prior notification.\n\nThe assessment is non-differentiated (pass, fail). The final assessment is based on two criteria:\n\n1) Quality of the research paper (50 points).\n2) Oral presentation and discussion of the research paper and its context (main concepts of personal data protection system) (50 points).\n\n\nAssessment criteria for the research paper:\n\n1) An adequate definition of the research problem.\n2) Consistency, correctness and completeness of the analysis.\n3) Integration of the theory and court practice.\n4) Compatibility with formal and substantial requirements described in the section \"List of independent works and their instructions.\"\n\nIf the research paper is not submitted timely, it is not subject to grading. The research paper must be uploaded to Moodle no later than 21 March 2025.\n\n\nAssessment criteria for the oral presentation:\n\n1) Clear and concise communication of the main research problem and research results;\n2) Understanding of data protection system. During the presentation, the instructor may ask questions relating to data protection so that the research paper is placed in the general context of the data protection system. Therefore, it is essential to have a comprehensive understanding of data protection and analyse study materials. Writing an adequate research paper is not sufficient.", "et": "Arvestuse saamiseks on vajalik aktiivne osalemine seminarides, samuti nõuetele vastava uurimistöö esitamine ning selle põhiseisukohtade esitlemine seminaris. Kuna seminarid põhinevad peamiselt arutelul, on nendest osavõtt kohustuslik. Aktiivne osalemine tähendab, et üliõpilane on põhjalikult töötanud läbi iga seminari jaoks määratud materjalid (nt kohtupraktika, teadusartiklid) ning suudab teemadel süsteemselt diskuteerida ja argumenteerida. Kui üliõpilane ei ole materjali läbi töötanud (ega suuda konkreetset teemat arutada), loetakse see seminarist puudumiseks.\n\nTallinnas õppekohta omavad üliõpilased peavad osalema auditoorses õppetöös. Tartus asuvad üliõpilased võivad osaleda digitaalses keskkonnas. Tallinnas õppekohta omavad üliõpilased võivad erandkorras (nt haigestumise korral) osaleda digitaalselt ainult õppejõu eelneval loal. Ilma eelneva loata digitaalses keskkonnas osalemist Tallinnas õppekohta omavate üliõpilaste puhul ei arvestata kohalolekuna.\n\nArvestuse saamiseks peavad üliõpilased osalema vähemalt 12 seminaril 16-st. Kui osaletakse vähem kui 12 seminaril, otsustab arvestuse saamise õppejõud, võttes arvesse puudumise põhjuseid, nende kaalukust ja eelnevat teavitamist.\n\nHindamine on mitteeristav (arvestatud, mittearvestatud). Lõplik arvestus põhineb kahel kriteeriumil:\n\n1) uurimistöö kvaliteet (50 punkti).\n2) uurimistöö suuline esitlus ja arutelu selle kontekstist (andmekaitse süsteemi põhikontseptsioonid) (50 punkti).\n\nUurimistöö hindamiskriteeriumid:\n\n1) uurimisprobleemi piisav määratlemine.\n2) analüüsi järjepidevus, korrektsus ja täielikkus.\n3) teooria ja kohtupraktika integreerimine.\n4) vastavus formaalsetele ja sisulistele nõuetele, mis on kirjeldatud jaotises \"Iseseisvate tööde nimekiri ja juhised.\"\nKui uurimistööd ei esitata õigeaegselt, siis seda ei hinnata. \n\nUurimistöö tuleb üles laadida Moodle'i hiljemalt 21. märtsil 2025.\n\nSuulise esitluse hindamiskriteeriumid:\n\n1) peamise uurimisprobleemi ja uurimistulemuste selge ja konkreetne esitlus.\n2) andmekaitse süsteemi mõistmine. Esitluse ajal võib õppejõud esitada andmekaitsega seotud küsimusi, et paigutada uurimistöö andmekaitse süsteemi üldisesse konteksti. Seetõttu on oluline omada põhjalikku arusaama andmekaitsest ja analüüsida õppematerjale. Ainult uurimistöö korrektne kirjutamine ei ole piisav.\n\n\n\n\n\n\n"}}], "grade_preconditions": {"en": " Students must attend at least 12 seminars out of 16. If a student has not reviewed the assigned material (and is unable to discuss the specific topic), this will be considered equivalent to being absent from the seminar.", "et": "Üliõpilased peavad osalema vähemalt 12 seminaril 16-st. Kui üliõpilane ei ole määratud materjali läbi töötanud (ega suuda konkreetsel teemal diskuteerida), loetakse see seminarist puudumiseks."}, "grade_evaluation": {"en": "Preparation and oral presentation of a research paper that meets the specified requirements.", "et": "Nõuetele vastava uurimistöö ettevalmistamine ja suuline esitlus."}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "bd2a6e39-b393-4238-9f05-5e51b7cdd9f9", "type": "MOODLE", "code": "P2OG.01.133_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "References to study materials is added to Moodle"}, "participants": {"lecturers": [{"person_uuid": "0b98b581-d059-d544-54d6-2c25f4728fef", "person_name": "Aleksei Kelli", "structural_unit": {"code": "SVOI04TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI04"}, "is_responsible": true, "is_teaching": true}], "assistants": ["71112e2b-4f12-0cbb-3082-add5be8e965c"]}, "schedule": {"weeks": {"et": "24-32"}}, "registration_info": {"audience": {"et": "Master’s students of International Law and Human Rights, but other master’s students are also welcome depending on certain limitations"}, "min_students": 5, "max_students": 40}, "parent_uuid": "c61f5cff-5aae-6416-e9f2-b628607a78d0", "parent_code": "P2OG.01.133", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}