{"uuid": "b92066b2-0fa9-149b-35aa-09050d1c72b2", "code": "sv-2024-spring-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-29T08:49:35", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 30, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI01", "name": {"en": "General Department", "et": "üldosakond"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI01", "structural_unit_name": {"en": "General Department", "et": "üldosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 780, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Master thesis is an independent written research paper proposing scientific solution in the field of law. The thesis shall contain: \r\n- introduction, containing the description of used methods\r\n- scientific discussion, divided into sections and subsections\r\n- conclusion, consisting of short list of main results of the research and conclusions\r\n- list of references\r\n- summary in foreign language (ca 10 % from the paper)\r\nThe limit of the required pages is 60-70.", "et": "Magistritöö on iseseisev uurimus, milles on esitatud uuritava probleemi teaduslik lahendus ning mis sisaldab\r\n- sissejuhatust\r\n- teema sisulist analüütilist käsitlust, mis on vastavalt sisulistele kriteeriumidele liigendatud peatükkideks ja alapunktideks\r\n- kokkuvõtet, kus on lühidalt esitatud uurimistöö tulemusena saavutatud tulemused ja tehtud järeldused,\r\n- kasutatud kirjanduse loetelu,\r\n- võõrkeelset resümeed (ca 10% töö sisulise osa mahust). \r\nTöö sisuline osa peab olema 60-70 lk."}, "objectives": [{"en": "Bring students into advanced engagement with some issues in law and obtaining highly professional skills by writing an independent research paper.", "et": "Omandada sügavamaid teadmisi kitsamas õigusvaldkonnas koos oskusega koostada magistriastme tasemele vastavat uurimislikku kirjalikku tööd."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "To formulate in the framework of research the thesis to be defended, to obtain the skills of critical analyse of different opinions, to present personal opinions with scientific argumentations, to offer solutions of described problems, to research and analyse empirical material, to defend proposed solutions and opinions, to debate the topics, to use different research methods, to formulate the conclusions and opinions based on the material studied during the research.", "et": "Formuleerida teema raames kaitsmisele esitatavaid teese, analüüsida kriitiliselt asjassepuutuvas ema- ja võõrkeelses kirjanduses avaldatud seisukohti, esitada oma seisukohti ja neid argumenteeritult põhjendada, näidata probleemide võimalikke lahendusi, vajadusel uurida ja analüüsida empiirilist materjali, kaitsta oma seisukohti ja esitatud teese või neid kriitiliselt hinnata, rakendada eri uurimismeetodeid ning teha uuritud materjali ja kirjanduse pinnalt oma järeldusi."}], "notes": {}}, "grading": {"independent_work": {"et": "Üksikasjalikud juhised on toodud Moodle'is. Üliõpilane on kohustatud võtma juhendajaga omavahelise koostöö ning juhendamise ajakava kokkuleppimiseks ühendust hiljemalt ühe kuu jooksul alates töö teema valimise tähtpäevast. Üliõpilase ja juhendaja õiguste ja kohustuste kohta vaata täpsemalt õigusteaduskonna uurimis- ja magistritööde juhendamise korrast.\n\nMagistritöö eelkaitsmine on vabatahtlik, va kui juhendaja nõuab eelkaitsmise läbimist. Eelkaitsmisel antakse üliõpilase esitatud kirjaliku kavandi ja suulise eelkaitsmise ning juhendaja arvamuse põhjal hinnang, kas magistritöö tase ja valmiduse aste võimaldab esitada kaitsmisele nõuetele vastava töö.\n\nMagistritöö esitatakse Moodles pdf-vormingus failina. \nMagistritöö osana esitab autor lihtlitsentsi, mille vorm ja sisu on toodud Moodles."}, "grade_preconditions": {"et": "Magistritöö kaitsmisele lubamise eelduseks on õppekava kõigi ülejäänud õppeainete läbimine. \nMagistritöö kaitsmisele lubamise otsustab osakonna juhataja, lähtudes juhendaja ettepanekust. Juhendaja on kohustatud tegema osakonna juhatajale ettepaneku töö kaitsmisele mittelubamiseks, kui töö ei vasta nõuetele."}, "grade_evaluation": {"et": "Magistritöö kaitsmise tulemusi hindab kaitsmiskomisjon. Magistritöö hindamisel lähtub kaitsmiskomisjon töö sisu ja vormi vastavusest\nõigusteaduskonnas kehtestatud üliõpilastööde nõuetele, juhendaja ja retsensendi tööle esitatud hindamisettepanekutest ning üliõpilase oskusest kanda ette oma töö põhiseisukohti, vastata esitatud küsimustele ja argumenteerida oma seisukohti."}, "grade_conditions": {"A": {"et": "Silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine"}, "B": {"et": "Õpiväljundite saavutamine väga heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused"}, "C": {"et": "Õpiväljundite saavutamine heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes avaldub ebakindlus ja ebatäpsus."}, "D": {"et": "Õpiväljundite saavutamine piisaval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus."}, "E": {"et": "Olulisemate õpiväljundite saavutamine minimaalselt lubataval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisil, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus."}, "F": {"et": "Õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel."}}, "debt_elimination": {"et": "Magistritöö kaitsmisel hindele \"puudulik\" (F) toimub korduskaitsmine üliõpilase taotluse alusel hiljemalt aasta jooksul alates esmakordse kaitsmise toimumise semestri lõpust. Korduskaitsmiseks tuleb täiendada olemasolevat tööd või kirjutada töö uuel teemal. Vaata lähemalt õigusteaduskonna magistritöö kaitsmise korrast."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "e47c712e-3a5b-4dd4-9760-8c487e8f0a8b", "type": "MOODLE", "code": "OI_magistritoo", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "97c5e626-79f9-b00c-b4a8-9c539204cdee", "person_name": "Katre Luhamaa", "structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "Magistritöö teema valitakse magistriõppe teise aasta kevadel. Magistritöö kaitstakse kolmanda aasta kevadel. Eelkaitsmisele esitamise, eelkaitsmise, magistritöö esitamise ja kaitsmise tähtajad on toodud akadeemilises kalendris ja Moodle'is."}}, "registration_info": {"audience": {}, "max_students": 112}, "confirmation_process": {"confirmation_uuid": "cdb27eb6-4087-11e5-6cc7-ff1d93885559", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "84e85f43-dc26-9a13-bdf7-9258f918329f", "parent_code": "P2OG.00.005", "parent_credits": 30, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}