{"uuid": "7631f506-e3c6-554e-79e9-3f8324db2900", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T11:40:54", "title": {"en": "Russian Approaches to International Law and Human Rights", "et": "Rahvusvaheline õigus ja inimõigused Venemaal"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 15, "practice": 0, "seminar": 15, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "International law is \"different in different places\", as David Kennedy ones put it. This course focuses on specific features of international law and human rights in Russia, considering both the historical, theoretical and practical aspects of the subject matter. Attention will be paid to Russian theorists of international law, especially Martens but also the Soviet tradition of international law. Leading cases of European human rights law, investor-state arbitration and Russian practice in the WTO will be analysed, besides the obvious practice related to the UN and the jus ad bellum. Russia's attitudes to the peaceful settlement of international disputes will be considered. Finally, by watching together some thematic movies the philosophical and even theological foundations of Russian approaches to international law and human rights will be examined.", "et": "Rahvusvaheline õigus on \"eri kohtades erinev\", nagu David Kennedy ütles. Vastav kursus keskendub rahvusvahelise õiguse ja inimõiguste eripäradele Venemaal, võttes arvesse nii ajaloolisi, teoreetilisi kui ka praktilisi aspekte. Tähelepanu pööratakse Venemaa rahvusvahelise õiguse teoreetikutele, eelkõige Martensile, kuid ka rahvusvahelise õiguse nõukogude traditsioonile. Lisaks ÜRO ja jus ad bellumiga seotud praktikale analüüsitakse Euroopa inimõiguste õiguse, investori ja riigi vahekohtu ning Venemaa praktika WTOs olulisemaid juhtumeid. Vaadeldakse Venemaa suhtumist rahvusvaheliste vaidluste rahumeelsesse lahendamisse. Lõpus toimub mõne temaatilise filmi vaatamine, et paremini tutvustada Venemaa rahvusvahelise õiguse ja inimõiguste alaste lähenemisviiside filosoofilisi ja isegi teoloogilisi aluseid."}, "objectives": [{"en": "To provide a detailed understanding of the history, theory and contemporary practice of international law and human rights in Russia.", "et": "Anda detailne ülevaade rahvusvahelise õiguse ja inimõiguste ajaloost, teooriast ja kaasaegsest praktikast Venemaal."}], "learning_outcomes": [{"en": "The student who has passed the course is able to:", "et": "Kursuse läbinud õpilane on võimeline:"}, {"en": "- Explain the specific features of the theory and practice of international law and human rights in Russia", "et": "- Selgitada rahvusvahelise õiguse ja inimõiguste teooria ja praktika eripärasid Venemaal."}, {"en": "- Employ the method of comparative international law in the Russian context", "et": "- kasutada rahvusvahelise õiguse võrdlemise meetodit Venemaa kontekstis"}, {"en": "- Find and analyse the legal cases and sources of international law specific to the Russian context", "et": "- leida ja analüüsida Venemaa kontekstile iseloomulikke rahvusvahelise õiguse õigusjuhtumeid ja allikaid."}, {"en": "- Understand the main Russian-related cases in the European Court of Human Rights and other bodies of international adjudication", "et": "- mõista peamisi Venemaaga seotud kohtuasju Euroopa Inimõiguste Kohtus ja muudes rahvusvahelistes kohtuorganites."}], "notes": {}}, "grading": {"independent_work": {"et": "*\tIndependent work with study materials\n*\tWriting a research paper\nIn the research paper, the student analyses critically one legal problem or case related to international law and human rights in Russia. The selected problem should be registered via Moodle no later than 15 April 2017. The instructor may ask the student to choose another problem if the chosen problem is not suitable or too many students have already chosen the same problem. The paper should be submitted electronically as a Word-file no later than on 20 May 2017 at 12:00 (noon) in Moodle. For every started overdue day, the result will be decreased by four points, but papers which are late more than four days are not accepted and the student may not take the exam. The instructor cannot consider papers sent by email.\nThe paper must include title page, table of content, main body and list of used materials. For references, use footnotes. The length of main text (starting from the introduction and ending with the conclusion, excluding footnotes) should be 2000-2500 words. Shorter papers are not accepted or the result is lowered by the discretion of the instructor.\nIndependent identification of clear issues and legal problems is very important. Also, the use of different sources and supportive materials. All used sources must be referred to. In case of internet sources, the full address is necessary, not only the main domain (e.g. www.un.org). A paper based on copy-paste method leads to negative results for both the paper and the exam."}, "grade_preconditions": {"et": "*\tParticipation in all classes-seminars with no more than 3 missed classes permitted.\nIf a student did not participate in a class, he/she must submit, within a week, a one-page reflection paper on the text/problem discussed in the particular class. Each late submission of a summary decreases the final points by three points.\n*\tTimely submission and positive evaluation of a research paper."}, "grade_evaluation": {"et": "Criteria\n*\tdepth of the analysis of problems and applicable norms and principles\n*\tassociation of theory with state and court practice\n*\tstructure and formatting\n*\tClass attendance and participation (40 points):\n- attendance\n- activism and quality of participation\n*\tResearch paper (60 points)\n\nGrades\nA\tthe analysis of legal problems is detailed and innovative; all relevant norms and principles have been used; the references to state and court practice are thoughtful and creative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]\nB\tthe analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the references to state and court practice support the conclusions; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC\tthe analysis of legal problems is good with some deficiencies concerning specific issues; key norms and principles have been used; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]\nD\tthe analysis of legal problems is satisfactory with deficiencies is most aspects; only basic norms and principles have been used; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]\nE\tthe analysis of legal problems is shallow with significant deficiencies is most aspects; only some rudimentary norms and principles have been used; overall, the coverage of the subject suffers of superficial treatment, poor knowledge of law and unsound presentation [51-60 points]"}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "33ac3212-2dde-4fdd-9cba-78a614c17271", "type": "MOODLE", "code": "P2OG.02.205_ENG", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Books\n*\tJane Henderson, The Constitution of the Russian Federation. A Contextual Analysis, Oxford: Hart Publishing, 2011\n*\tLauri Mälksoo, Russian Approaches to International Law, Oxford University Press, 2015\n*\tGrigory Tunkin, Theory of International Law, Harvard University Press, 1974\nInternational case law\n*\tGeorgia v Russia, ICJ\n*\tInter-state cases, ECtHR\n*\tSelected individual-state cases against Russia in the ECtHR\n*\tYukos and other cases of investor-state arbitration\nSymposia\nThe Symposium on F.F. Martens in European Journal of International Law 2014\nFilms\nMovies such as Zvyagintsev's \"Leviathan\"", "recommended_materials": "*\tWill be handed out before the class and updated each year"}, "participants": {"lecturers": [{"person_uuid": "67f1346b-205b-ed69-56f1-9e5be48bc597", "person_name": "Lauri Mälksoo", "structural_unit": {"code": "SVOI02TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}], "assistants": ["71112e2b-4f12-0cbb-3082-add5be8e965c"]}, "schedule": {"weeks": {"et": "24-36"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "History of international law in Russia\nMartens, Taube and the St Petersburg's 'Baltic' School\nSoviet approaches to international law (Korovin, Kozhevnikov, Tunkin)\nInternational legal theory in post-Soviet Russia\nThe Russian Federation and jus ad bellum\nRussia, the ICJ and attitudes to international adjudication\nThe Russian Federation and investment-treaty arbitration\nThe Russian Federation and the WTO\nLeading Russian cases in the ECtHR\nRussian conservative criticisms of European human rights law and ideology (Patriarch Kirill, etc)\nThe Russian Constitutional Court and the relationship between international and domestic law"}}]}, "registration_info": {"audience": {"et": "Master’s students of International Law and Human Rights, but other master’s students are also welcome depending on certain limitations"}, "min_students": 5, "max_students": 30}, "parent_uuid": "cc2a238a-dbd9-b5d5-174e-020837592001", "parent_code": "P2OG.02.205", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}