{"uuid": "995ee642-44a5-f7b0-f6a2-a27327c2f0e4", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-14T11:54:09", "title": {"en": "Human Rights Law", "et": "Inimõigused"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 12, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course gives a concise overview of the international human rights regime and discusses contemporary problems related to the framework of human rights protection at the international, regional and constitutional level. We consider the similarities and differences between the basic human rights texts and the basic theoretical and legal approaches to protection of human rights, as well as the interplay between international and domestic implementation and protection. Firstly, introductory lectures give a necessary starting point for students to understand the human rights framework, examine the theoretical bases for human rights, their division into generations and hierarchies, general issues of protection and discussion over their universality. Secondly, students become familiarized with different international and regional human rights instruments and protective mechanisms. Thirdly, remaining lectures are dedicated to the analysis of the content and protection of core human rights as well as of related judicial practice. This part of the course involves an in-depth study of human rights issues drawing mainly on material from international and regional human rights law and domestic legal systems. It highlights the key controversies in modern human rights law and the possible range of responses in different jurisdictions. We consider the meaning of particular human rights and their significance in theory and in practice, and the efficacy of the legal institutions designed to protect them. Several specific substantive issues will be studied in depth to illustrate the complex interplay between theory, legal concepts and procedure, and between legal and non-legal sources of protection.", "et": "Õppeaine annab ülevaate rahvusvahelisest inimõiguste kaitsest ning pakub võimalust mõista ja analüüsida inimõiguste kaitsega seotud väljakutseid rahvusvahelisel, regionaalsel ja siseriiklikul tasandil. Teemakäsitlus algab inimõiguste teoreetiliste lähtekohtade analüüsiga ning erinevate  kaitsemehhanismide ning nende omavaheliste seoste tutvustamisega ning jätkub üksikute inimõiguste põhjalikuma käsitlusega, et mõista teooria, õiguslike mõistete ja praktika omavahelisi seoseid ning hinnata inimõiguste kaitse vahendite effektiivsust laiemas rahvusvahelises ja sotsiaalses kontekstis."}, "objectives": [{"en": "To provide students with knowledge and skills to understand and assess contemporary human rights issues and judicial reasoning in the wider international and domestic socio-legal context", "et": "Anda üliõpilastele teadmised ja oskused analüüsida keerulisi/vastuolulisi inimõigustesse puutuvaid küsimusi ning kohtupraktikat laiemas rahvusvahelises ja  iseriiklikus kontekstis"}], "learning_outcomes": [{"en": "The student who has passed the course is able to:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "-- Identify and analyse key issues in the theory and practice of human rights", "et": "-- oskab tuvastada ja analüüsida põhiprobleeme inimõiguste teoorias ja praktikas"}, {"en": "-- Identify and assess contemporary human rights protection mechanisms (international, regional, domestic)", "et": "-- mõistab ja oskab analüüsida rahvusvahelist, regionaalset ja siseriiklikku inimõiguste kaitset"}, {"en": "-- Analyse why there are different approaches and outcomes in different jurisdictions to selected rights", "et": "-- oskab analüüsida, miks on erinevates jurisdiktsioonides erinev lähenemine teatud inimõigustele"}, {"en": "-- Know how selected human rights are implemented and applied in practice", "et": "-- omab häid teadmisi õppeaines käsitletud valitud inimõigustest"}, {"en": "-- Understands the potential and the limitations of law as a tool to address human rights concerns", "et": "-- mõistab nii õiguslike vahendite potentsiaali kui ka piiratust inimõiguste kaitsel"}, {"en": "--solve human rights cases and defend his/her arguments in oral or in writing form", "et": "-oskab lahendada pratilisi kaasuseid ning kaitsta oma argumenteeritud seisukohti nii kõnes kui kirjas"}, {"en": "--write a short analytical paper on human rights", "et": "-oskab kirjutada lühikest analüütilist uurimistööd inimõiguste teemadel."}], "notes": {}}, "grading": {"independent_work": {"et": "(1) Independent work with study materials\n(2) Writing a research paper ( The selected problem should be registered via Moodle no later than the date specified in Moodle. The instructor may ask the student to choose another problem if the chosen problem is not suitable or too many students have already chosen the same problem. The paper should be submitted electronically as a Word-file in Moodle no later than the date specified in Moodle).\n(3) Preparation for moot court excersise in seminars\n\nObligatory materials:\n\n - Rhona Smith. Textbook on International Human Rights (Oxford University Press). There are several editions of this book available in the library.  It is best to use the latest, however, 7-10 edition are all good to use for our study purposes.\n\n- The Oxford Handbook of International Human Rights Law, edited by Dinah Shelton (Oxford University Press, 2013/2015)."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "- correct answers to the multiple choice test  in moodle\n- test can be taken 3 times with  4 days  between the tests\n- best result of the test will count towards the final grade\n\n"}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Criteria:\n\n\nYou are assigned a role to write a legal brief for your client explaining his/her chances to win the  case in the international human rights monitoring body (e.g. ECtHR or HRC).\n\nYour brief must:\n- be clear, consistent (no contradictions in your arguments), well structured  and persuasive\n- It has to be neutral, explaining   important legal points relevant to the case.\n- explaining strengh and weeknesses of possible arguments.\n- your argumantation should show that you have studied the obligatory materials for the course (e.g. that you can link applicable norms and principles, real life cases to the hypothetical case at hand)\n\n\n\n"}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "-the research paper is an academic paper (not an opinion piece) which means that presented arguments need to be  backed up with relevant academic sources.\n\n- the student analyses critically a legal problem in human rights law or practice (e.g. in human rights monitoring bodies). \n\n- The research paper should be analytical (non-descriptive). It should address the research question in a thorough, logical and coherent manner.\n\n-  It is important that the paper has a clear research problem, argument, research questions, structure and logically arranged arguments to support the thesis/argument.\n \n- The text is written in clear, grammatically correct language.\n\n\n- The paper should be submitted electronically as a Word-file no later than on 9  December  at 23.55  in Moodle. At the start of each overdue day, the maximum obtainable grade will be decreased by four points. However, papers which are late by more than four days will not be accepted and the student will not be allowed to take the final exam (case analysis). The instructor cannot consider papers sent by email or in pdf format.\n\n- The paper should be no less than 2000 words (including footnotes) and no more than 2500. It should follow the style guide of the law faculty or OSCOLA for style. Further details are specified in Moodle.\n\n- the paper should have a title page and you should structure your paper to include:  introduction (including research problem (thesis), goal, research questions), main body of the text (divide under several headings if needed), conclusion and bibliography (title page and bibliography are not included in the word count).\n"}}], "grade_preconditions": {"et": "(1) Participation in all seminars.\nIf a student did not participate in a seminar, he/she must submit, within a week, a one-page brief to the case discussed in missed seminar. Each late submission of a summary decreases the final points by three points.\n(2) Timely submission of the research paper.\n(3) Completed test in moodle\n(4) Completed reading week assignement"}, "grade_evaluation": {"et": "(1) Test - multiple choice questions in modle (incl. definition questions and theory questions) - 25  percent of the overall grade\n(2) Hypothetical case analysis (brief for client) - 35 percent of the overall grade\n(3) Research paper - 40 percent of the overall grade\n(4) Active participation in all moot court seminars (preparation of the case in the team, oral presentation of arguments during the moot court, active participation as a judege) adds 4 points to your final grade (e.g. if your final grade was 80/100 it can be rased to 84/100)."}, "grade_conditions": {"A": {"et": " the answers to theoretical questions are remarkable; the examination of hypothetical cases is full, logical and creative; the analysis of legal problems is detailed and innovative; all relevant norms and principles have been used; the references to state and court practice are thoughtful and creative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]"}, "B": {"et": "the answers to theoretical questions are very good with insignificant mistakes or omissions; the examination of hypothetical cases is purposeful and creative; the analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the references to state and court practice support the conclusions; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]"}, "C": {"et": "the answers to theoretical questions are good, but there are mistakes or omissions; the examination of hypothetical cases addresses correctly the central issues; the analysis of legal problems is good with some deficiencies concerning specific issues; key norms and principles have been used; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]"}, "D": {"et": "the answers to theoretical questions are fair, but there are several mistakes or omissions; the examination of hypothetical cases is satisfactory, but focuses only on the central aspects; the analysis of legal problems is satisfactory with deficiencies is most aspects; only basic norms and principles have been used; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]"}, "E": {"et": "the answers to theoretical questions are poor with significant mistakes or omissions; the examination of hypothetical cases is weak and limited only to the very basic aspects; the analysis of legal problems is shallow with significant deficiencies is most aspects; only some rudimentary norms and principles have been used; overall, the coverage of the subject suffers of superficial treatment, poor knowledge of law and unsound presentation [51-60 points]"}}, "debt_elimination": {"et": "In accordance with the Study Regulations"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "525d7b11-e26e-4066-bdc5-7a97c4d09cb6", "type": "MOODLE", "code": "P2OG.02.194_Eng", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "76a69d0b-e691-676b-affe-2f9796d9e6b4", "person_name": "Merilin Kiviorg", "structural_unit": {"code": "SVOI02TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "7 in ZOOM/ 2,5,8,10,12 CLASSROOM"}, "entries": [{"course_week": 2, "time": "2024-09-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Introduction to the Course"}, "description": {"et": "1.  Introduction to the course; History and its influence on understanding of contemporary human rights;  Theoretical bases of human rights (2 academic hours)"}}, {"course_week": 2, "time": "2024-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Theory of Human Rights"}, "description": {"et": "2. Theoretical bases of human rights \n3. General issues of protection of human rights in the contemporary socio-legal context, including universality of human rights (2 hours)"}}, {"course_week": 2, "time": "2024-09-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "International Human Rights Protection"}, "description": {"et": "4. International protection mechanisms (2 hours)"}}, {"course_week": 5, "time": "2024-10-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "International Human Rights Protection"}, "description": {"et": "5.  International protection mechanisms "}}, {"course_week": 5, "time": "2024-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Regional Protection of Human Rights"}, "description": {"et": "6.  Regional protection"}}, {"course_week": 5, "time": "2024-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Regional Protection of Human Rights"}, "description": {"et": "7. Regional +Interplay between international and domestic protection of human rights (2 hours) "}}, {"course_week": 7, "time": "2024-10-16", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Create test questions"}, "description": {"et": "Assignment in Moodle. Creat multiple test questions + discuss and critisice."}}, {"course_week": 7, "time": "2024-10-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Research Paper Seminar"}, "description": {"et": "online - zoom, 2 hours"}}, {"course_week": 9, "time": "2024-10-31", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Right to Life"}, "description": {"et": "\nMoot court excersise, team work"}}, {"course_week": 10, "time": "2024-11-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Prohibition of Torture"}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 10, "time": "2024-11-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Right to Liberty and Security"}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 10, "time": "2024-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Right to Privacy and Family Life "}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 10, "time": "2024-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Freedom of Assembly and Association\n"}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 12, "time": "2024-11-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Equality and Right to Non-Discrimination: Positive Rights and Positive Duties"}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 12, "time": "2024-11-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Freedom of Expression"}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 12, "time": "2024-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Freedom of Religion or  Belief "}, "description": {"et": "Moot court excersise, team work"}}, {"course_week": 12, "time": "2024-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "self-determination"}, "description": {"et": "Moot court excersise, team work"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "aeb9b622-6f88-b25f-5452-6e6db26dad7e", "parent_code": "P2OG.02.194", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}