{"uuid": "2ed02a95-260d-e9c3-4eb9-353cc8ac2539", "code": "P2OG.02.132", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-02T11:01:13", "title": {"en": "Introduction to Human Rights", "et": "Sissejuhatus inimõigustesse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "86b8d1f8-ffa4-71eb-bf52-f8ed480fd87f", "code": "P2OG.02.156", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The course aims to provide the students an opportunity to complement their education with introductory knowledge about the phenomenon called human rights. We shall consider the uprise of human rights in the international legal system and the most relevant developments in the field ― throughout the course tight relationship shall be held with public international law. The emphasis is intended to lay rather on philosophical than technical questions ― i.e. we shall discuss primarily issues relating to the substence, extent and societal function of human rights, leaving questions about the international protection of human rights at the upstage. The study process is intended to have the form of a combination between auditorial and independent work, which means that some materials shall have to be read and a presntation held.", "et": "Loengukursuse läbi on eesmärgiks luua üliõpilastele võimalus saada ülevaade nähtusest, mida tuntakse inimõiguste nime all. Käsitleme inimõiguste esilekerkimist rahvusvahelise õiguse süsteemis ning olulisemaid seonduvaid arenguid ― läbi kursuse leiab temaatika käsitlemist just rahvusvahelise avaliku õiguse kontekstis. Kursuse rõhuasetus on pigem filosoofiline, kui tehniline ― s.t. arutleme ennekõike küsimuste üle inimõiguste sisust, ulatusest ja ühiskondlikust funktsioonist, jättes inimõiguste rahvusvahelise kaitse organisatsiooni puutuva temaatika teisejärgulisteks. Õpe on planeeritud auditoorse ja iseseisva töö kombinatsioonina, mis tähendab, et lisaks loengutele ja seminaridele tuleb üliõpilastel lugeda läbi mõned artiklid ja pidada üks ettekanne."}, "objectives": [{"en": "-", "et": "Anda ülevaade Eesti õiguskorra jaoks olulistest rahvusvahelistest inimõiguste kaitse süsteemidest, inimõiguste mõiste määratlusest ning kaasaegsete inimõiguste tekke- ja arenguloost. Mõista rahvusvaheliste inimõiguste positsiooni ja mõju Eesti õiguskorrale.\nOmandada oskus kasutada argumentatsioonis inimõiguste dogmaatikat: leida asjakohast regulatsiooni ning praktikat ning kasutada seda praktiliste kaasuste lahendamisel."}], "learning_outcomes": [{"en": "-", "et": "Üliõpilane tunneb rahvusvaheliste inimõiguste kaitse süsteeme, nende teoreetilist tausta ja nendes süsteemides kasutatavat keelt. \nTudeng mõistab Eesti jaoks tähtsamate rahvusvaheliste inimõiguste kaitse süsteemide toimimist ja mõistab nende mõju Eesti õiguskorrale ning üksikisikute õiguste kaitsele.\nTudeng oskab kiiriliselt hinnata ja kasutada erinevaid rahvusvaheliste inimõiguste allikaid.\nÜliõpilane tunneb  selles õigusvaldkonnas teadustöö tegemiseks vajalike metodoloogilisi ning teoreetilisi lähtekohti."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}