{"uuid": "10f547f0-72d6-56e2-3e0d-a9f6aa624b8f", "code": "P2OG.01.048", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Civil Law Special Seminar", "et": "Tsiviilõiguse eriseminar"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the first meeting the students will present the topics and progress of their master's thesis. After the first session the students have to complete tasks in Moodle and will present their own thesis and review one othe student's thesis draft.", "et": "Kõigil ainel osalevatel üliõpilastel tuleb Moodle'i keskkonda üles laadida oma magistritöö nõuetekohaselt vormistatud mustand.\nIgale üliõpilasele määratakse ühe kaasüliõpilase magistritöö, mida oponeerida.\nÜliõpilased tutvustavad kaasõppijatele oma magistritöö teemasid, mh seda kui palju töö lõplikust mahust on valminud. \nKursuse raames annavad üliõpilased üksteise magistritöö kavanditele kirjalikku tagasisidet ning osalevad seminarides, mille käigus toimub kavandite suuline oponeerimine ja diskussioon."}, "objectives": [{"en": "The focus of the course is to support the student in improving the topic, methodology and drafting of his or her master's thesis. The goal of the course is also to give the students an experience of presenting one's thesis in a constructive manner, of participating in an academic discussion and of being an oponent to other student's thesis.", "et": "Õppeaine üldeesmärk on toetada magistranti magistritöö teema, sisulise käsitluse, metodoloogia ja vormistamise viimistlemisel. Samuti on aine eesmärk anda üliõpilasele kogemus oma seisukohtade ja ideede konstruktiivsel esitlemisel, teaduslikus diskussioonis osalemises ning oponeerimisel."}], "learning_outcomes": [{"en": "Afterthe successful completion of the course the student:\n- is able to find and use sources for his or her thesis;\n- is aware and knows how to use the principles described in Üliõpilastöö kirjutamise ja vormistamise juhend;\n- know what is plagiarism and is able to avoid it in his or her thesis;\n- is able to present his or her thesis in a comprehensive and exhaustive manner using relevant presentation software;\n- is able to give constructive feedback to other student's thesis, both in writing and orally;\n - implements the knowledge gained in previous studies in an academic discussion with other studens;\n- knows how to use legal arguments to support his thesis.", "et": "Kursuse edukal läbimisel üliõpilane:\n-\toskab otsida oma magistritöö kirjutamiseks vajalikke allikaid ja neid kriitiliselt hinnata;\n-\ttunneb õigusteaduskonna üliõpilastööde vormistamise nõudeid ja järgib neid oma magistritöö koostamisel;\n-\tviitab korrektselt teiste autorite töödele, oskab vältida plagiaati;\n-\ttutvustab sisuka ning põhjaliku suulise ettekande kauduoma magistritööd, kasutades selleks asjakohast esitlustarkvara;\n-\toponeerib konstruktiivselt ja akadeemilise stiili nõudeid järgides  kaasüliõpilase magistritöö kavandit;\n-\trakendab eeldusainete käigus omandatud teadmisi teaduslikus diskussioonis kaasüliõpilastega; \n-\tpõhjendab oma seisukohti õigusteaduslike argumentidega; \n-\thindab kriitiliselt oma tugevusi ja nõrkusi teadustöö koostamisel ning kavandab teadlikult ja otstarbekalt magistritöö kirjutamise protsessi"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}