{"uuid": "5fe0b724-d76f-3593-bf75-f0667715efcc", "code": "P2OG.02.233", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-15T10:51:05", "title": {"en": "Enforcement Law", "et": "Korrakaitseõigus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "69c6f551-0cd9-31b1-7f99-a18d8db57af5", "code": "P2OG.02.154", "title": {"en": "Administrative Law", "et": "Haldusõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The lecture focuses on the law enforcement law.", "et": "Loengukursus keskendub korrakaitseõigusele."}, "objectives": [{"en": "The aim of the course is to provide students with the theoretical foundations of law enforcement law, to explain the concept, source and development of law enforcement law, as well as the basic concepts of law enforcement law, the legal interests protected by law enforcement law and the thresholds for intervention, the addressees of law enforcement measures and the involvement of law enforcement. It will also provide knowledge of general and specific law enforcement measures, enforcement of measures, as well as an overview of specific areas of law enforcement.", "et": "Õppeaine eesmärk on anda üliõpilastele korrakaitseõiguse teoreetilisi alusteadmisi, selgitada korrakaitseõiguse mõistet, allikat ja arengut, samuti korrakaitseõiguse põhimõisteid,\nkorrakaitseõiguse kaitstavaid õigushüvesid ning sekkumislävendeid, korrakaitsemeetmete adressaate ning kaasamist. Samuti anda teadmisi korrakaitse üld- ja erimeetmetest, meetmete sundtäitmisest, aga ka anda ülevaade korrakaitse erivaldkondadest."}], "learning_outcomes": [{"en": "Students having participated in this subject:\nunderstands the theoretical foundations (including constitutional and administrative foundations), including its concept, sources, basic concepts, the structure of law enforcement law and the relationship between the general rules and the specific part;\n- understands the general principles of law enforcement law and is able to apply them to legal problems;\n- understands the principles of law enforcement, the addressee of a law enforcement measure and the involvement of the law enforcement authorities in the law enforcement process;\n- understands the legal interests protected by law enforcement and the thresholds for intervention, understands general and specific measures of law enforcement and the enforcement of a measure and is able to solve a law enforcement case, including the ability to identify the relevant rule of law and to verify whether the prerequisites of the rule of law are fulfilled and whether the administrative body has acted in accordance with the law;\n- in this context, correctly identify the type of administrative action and verify the legality of the administrative action;\n- has an overview of certain specific areas of law enforcement", "et": "Õppeaine läbinud õppija:\n- mõistab teoreetilisi aluseid (k.a. riigiõiguslikke ja haldusõiguslikke aluseid), sh selle mõistet, allikaid, põhimõisteid,\nkorrakaitseõiguse struktuuri ja üldnormide ning eriosa omavahelisi seoseid;\n- mõistab korrakaitseõiguse üldpõhimõtteid ja oskab neid rakendada õiguslike probleemide\nlahendamisel, sh mõistab korrakaitseorgani, korrakaitsemeetme adressaadi ja kaasamise\nerinevate vormide mõisteid, mõistab korrakaitseõiguse kaitstavaid õigushüvesid ja tunneb sekkumislävendeid, mõistab korrakaitse üld- ja erimeetmeid ning meetme sundtäitmist ja oskab lahendada korrakaitseõiguslikku kaasust, sh oskab leida asjakohase volitusnormi ning oskab kontrollida, kas volitusnormi eeldused on täidetud ning kas haldusorgan on õiguslikku\ntagajärge kohaldanud õiguspäraselt; selles raames oskab korrektselt määrata haldustegevuse liigi ning kontrollida haldustegevuse õiguspärasust;\n- omab ülevaadet korrakaitse teatud erivaldkondadest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}