{"uuid": "e3415402-a275-ca88-1146-7deff8965814", "code": "P2OG.02.248", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "European Human Rights Law", "et": "Inimõigused Euroopas"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Goals are to get to know what are the main aspects of international protection of human rights: where in this system is situated the European Convention on Human Rights, what is the position of European Convention on Human Rights in the legal systems of  Convention member states, in parfticular in Estonia; how does the European Court of Human Rights work:  structure and functions of this Court; main principles that the Court applies in its work. The course will also give an overview of the most important cases of the European Court of Human Rights and analyse recent case-law, as well as the case law connected to Estonia. It wll also be explained how the member states, including Estonia have implemented the decisions and judgments of the European Court of Human Rights. At the end of the course a short overview of the \"Bermuda triangle\" in the protection of fundmanetal rights: the Estonian Constitution, the European Convention on Human Rights and the Charter of Fundamental Rights of the European Union will be discussed.", "et": "Selgeks saada mis on inimõiguste rahvusvahelise kaitse peamised aspektid; kus paikneb selles süsteemis ja millise kaitsesüsteemi tagab Euroopa Inimõiguste Konventsioon; kus paikneb see konventsioon osalisriikide õigussüsteemides, sh Eestis; kuidas toimib Euroopa Inimõiguste Kohus: ülesehitus ja ülesanded; olulisemad põhimõtted mida see kohus oma töös rakendab. Ülevaade Euroopa Inimõiguste Kohtu kõige olulisematest lahenditest. Analüüs värskeimast kohtupraktikast; Euroopa Inimõiguste Kohtu Eestit puudutavad lahendid. Kuidas on Euroopa Inimõiguste Kohtu lahenditega arvestanud liikmesriigid, sh Eesti. Lühidalt Bermuda kolmnurgast: Eesti Põhiseadus, Euroopa Inimõiguste Konventsioon ja Euroopa Liidu Põhiõiguste Harta."}, "objectives": [{"en": "Main goals are: to learn and understand the principal aspects of the international protection of human rights based on the practice of the protection system of the European Convention on Human Rights. To navigate in the functions and case law of the European Court of Human Rights and to study the relations between European human rights protection and national (Estonian) law.", "et": "Saada selgeks inimõiguste rahvusvahelise kaitse peamised aspektid Euroopa Inimõiguste Konventsiooni praktika näol. Orienteeruda Euroopa Inimõiguste Kohtu töös ja olulisemas kohtupraktikas ning osata seda seostada riigi (Eesti) õigusega."}], "learning_outcomes": [{"en": "The student who has passed the course:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "-- understands the role and nature of human rights", "et": "-- mõistab inimõiguste rolli ja olemust"}, {"en": "-- knows the historical development and theoretical bases of human rights", "et": "-- tunneb inimõiguste ajaloolist arengut ja teoreetilisi lähtekohti"}, {"en": "-- names essential human rights instruments", "et": "-- nimetab olulisemaid inimõiguste alaseid lepinguid"}, {"en": "-- describes and compares principal protective mechanisms for human rights", "et": "-- kirjeldab ja võrdleb peamisi inimõiguste kaitsemehhanisme"}, {"en": "-- explains and interprets the content of core human rights and relevant practice", "et": "-- selgitab ja tõlgendab kesksete inimõiguste sisu ja asjakohast praktikat"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}