{"uuid": "5c5d7acb-0158-c9da-eeba-e2c12d31ebc9", "code": "P2OG.02.167", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methodology of Legislative Drafting", "et": "Õigusloome metoodika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The subject deals with following topics: theoretical foundations of methodology of legislative drafting; organisational measures for preparing the drafts of legislative acts; amendment and revocation of legislative acts; integraal parts of legislative acts; principles of compilation of legal norms; language and style of legislative acts.\nFinally, the students will acquire a methodology for giving an expert opinion.", "et": "Õppeaines käsitletakse õigusloome metoodika teoreetilisi aluseid, õigustloovate aktide eelnõude ettevalmistamise organisatsioonilisi abinõusid, õigustloovate aktide muutmist, täiendamist ja kehtetuks tunnistamist, õigustloovate aktide koostisosi, õigusnormide esitamise põhimõtteid, õigustloovate aktide keelt ja stiili.\nÕppeaine läbimisel omandatakse juriidilise arvamuse koostamise metoodika."}, "objectives": [{"en": "The main aim of this subject is to deliver theoretical basic knowledge of methodology of legislative drafting, to provide skills and knowledge of technique for preparing the drafts of legislative acts and to teach the methods of linguistic presentation of legal norms.", "et": "Õppeaine üldiseks eesmärgiks on õpetada õigusloome metoodika teoreetilisi alusteadmisi, anda oskusi ja teadmisi õigustloovate aktide eelnõude koostamise tehnikast ja õigusnormide keelelise esitamise viisidest ja võtetest."}], "learning_outcomes": [{"en": "Student having participated in this subject:", "et": "Ainekursuse lõpuks on üliõpilane võimeline:"}, {"en": "1)\tCan explain the theoretical foundations of methodology of legislative drafting;", "et": "1) selgitama õigusloome metoodika teoreetilisi aluseid;"}, {"en": "2)\tHas a good command of technique for preparing the drafts of legislative acts; ", "et": "2) valdama õigustloovate aktide eelnõude koostamise metoodikat;"}, {"en": "3)\tKnows the methods of linguistic presentation of legal norms;", "et": "3) teadma õigusnormide keelelise esitamise viise ja võtteid;"}, {"en": "4)\tHas knowledge of organisational technical measures for preparing the drafts of legislative acts;", "et": "4) teadma, millised on õigustloovate aktide ettevalmistamise organisatsioonilis-tehnilised abinõud;"}, {"en": "5)\tIs prepared to give an expert opinion on drafts of legislative acts.", "et": "5) koostama juriidilisi arvamusi õigustloovate aktide eelnõude kohta või koostama väljatöötamiskavatsuse, mõjude analüüsi, õigustloova akti ja seletuskirja kavandi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}