{"uuid": "2fd45f8a-61ab-c32f-560e-4c4888d7748b", "code": "P2OG.01.107", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Construction and Planning Law", "et": "Ehitus- ja planeerimisõigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course examines legal nature of plans, drafting and adoption of plans, implementation of plans, challenging of plans and legal regulation of building.", "et": "Ehitus-ja planeerimisõigus annab üliõpilasele ülevaate nii avalik- kui ka eraõiguslikust ehitusõigusest, selle aluspõhimõtetest ja ehitusõigust reguleerivatest allikatest ja standarditest. \nLoob tervikpildi ehitusõigusest kui ühest õigusvaldkonnast ning tutvustab valdkonnas tekkivaid õigussuhteid. Samuti tutvustab õppeaine ehitusõiguse pinnalt kõige sagedamalt tekkivaid vaidlusi ning peamisi kohtupraktika seisukohti.\n\nÜliõpilane läbib olulisemad avalik-õigusliku ehitusõiguse valdkonna teemad, nagu planeerimisõigus, loamenetlused ja järelevalve. Eraõiguslikus ehitusõiguse valdkonnas läbib üliõpilane teemad nagu ehitamist ja projekteerimist reguleerivad õigusaktid, poolte kohustused ja vastutus."}, "objectives": [{"en": "The aim of the course is to give overview of the legal nature of plans, drafting and adoption of plans, implementation of plans, challenging of plans and legal regulation of building.", "et": "Üldeesmärgiks on õppida tundma nii avalikõigusliku- kui eraõigusliku ehitusõiguse aluspõhimõtteid ning omandada esmane ülevaade ehitusalastest regulatsioonidest."}], "learning_outcomes": [{"en": "x", "et": "Ainekursuse läbimise järgselt üliõpilane:\n-\toskab sisustada ehitus- ja planeerimisõiguse mõisteid ning orienteerub üldpõhimõtetes;\n-\tomab ülevaadet ehitus- ja planeerimisõiguse allikatest ning standarditest;\n-\tmõistab ehitus- ja planeerimisõiguse seoseid teiste õiguse valdkondadega;\n-\tomab ülevaadet avaliku võimu pädevusest planeerimisvaldkonnas, planeerimisega seotud õigussuhetest ja õiguskaitsemeetmetest\n-\tomab ülevaadet, millised õigussuhted ehitus- ja projekteerimisvaldkonnas tekivad ja millised on poolte kohustused ning vastutus;\n-\tomab ülevaadet, millised on ehitus- ja planeerimisõigusega seotud kõige sagedamad vaidlused ning millised on peamised kohtupraktika seisukohad;\n-\toskab tuvastada, analüüsida ja anda korrektse õigusliku hinnangu püstitatud ehitusõiguse probleemile (kaasuse lahendamine)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}