{"uuid": "34a46aae-514c-e877-f8af-72fd2e8bc561", "code": "P2OG.01.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Family Law", "et": "Perekonnaõigus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "8955dde8-be11-e24f-6801-7d0c65a63285", "code": "P2OG.01.030", "title": {"en": "Civil Law: General Part", "et": "Tsiviilõiguse üldosa"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "fb279a27-0c94-5a6d-4061-5c26ec13e08e", "code": "P2OG.01.031", "title": {"en": "Property Law", "et": "Asjaõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "19b89f8b-2caa-713e-3480-9432b4ae7257", "code": "P2OG.01.088", "title": {"en": "Law of Obligations, General Part", "et": "Võlaõiguse üldosa"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The scope of this course covers the creation, dissolution and essence of the family and rights pertaining to the family, marriage as an institution with its attended legal consequences, cohabitation without marriage, opportunities for legal regulation, and legal relationships resulting from kinship. Issues related to child custody, guardianship, as well as requirements for formal filing of significant events covered by family law and their legal effect, are also covered.", "et": "Õppeaines käsitletakse perekonna ja perekonnaõiguse olemust, sugulusest tulenevaid õigussuhteid, abielu olemust ja sellest tulenevaid õigussuhteid, mitteabielulise kooselu olemust, selle reguleerimise võimalusi ja sellest tulenevaid õigussuhteid, samuti eestkostet ning perekonnaseisutoimingute tähendust ja korraldust. Teoreetilisi teadmisi kinnistatakse erinevate ülesannetega nagu kaasuse lahendamine, nõustamisülesanne, kohtupraktika analüüs, akadeemilise ettekande ettevalmistamine ja esitlus. Mitmed ülesanded lahendatakse kirjalikult ja tiimitööna."}, "objectives": [{"en": "The overall goal of this course is to teach students the basics of family law as a branch of civil law, including its theory, regulation and actual application.", "et": "Õppeaine üldeesmärgiks on anda üliõpilastele alusteadmised perekonnaõiguse kui ühe tsiviilõiguse valdkonna teoreetilistest käsitlustest, mõistetest, põhiinstituutidest ja rakendamise praktikast ning oskused lahendada perekonnaõiguslikke kaasusi ja nõustada perekonnaõiguslikes küsimustes. Kursus aitab mõista perekonnaõiguse seost tsiviilõiguse teiste valdkondadega."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the student should: \n- understand and explain the institutions recognized under family law.\n- know and explain the theoretical underpinnings of family law. \n- recognize and appreciate the role of family law in relation to other branches of the law.\n- grasp and clarify the regulatory scheme contained in family law \n- know and describe court practice in adjudicating rights under family law.\n- be capable of arguing and resolving presented cases arising under family law as well as other pertinent norms of civil law, including consideration of appropriate court precedents and scholarly publications\n- be aware of current developments of family law in Europe", "et": "Aine läbimisel on üliõpilane võimeline: \n- mõistma ja selgitama perekonnaõiguslike mõistete ja instituutide olemust\n- tundma ja selgitama perekonnaõiguse teoreetilisi käsitlusi\n- mõistma ja selgitama perekonnaõiguse seoseid teiste õigusharudega \n- tundma ja selgitama kehtivat perekonnaõiguse regulatsiooni\n- tundma ja selgitama perekonnaõiguslikke vaidlusi puudutavat kohtupraktikat \n- lahendama argumenteeritult perekonnaõiguslikke vaidlusi perekonnaõiguse jm asjakohaste tsiviilõiguse normide alusel, arvestades kohtupraktikas ja erialakirjanduses väljakujunenud seisukohti\n- tundma perekonnaõiguse arengutendentse Euroopa tasandil\n- töötama meeskonnas ja planeerima rühmatööd"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}