{"uuid": "08e7b3bb-5882-4c80-2f96-9ac8e4e96e5a", "code": "P2OG.02.157", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "European Union Law", "et": "Euroopa Liidu õigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "code": "P2OG.02.058", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "86b8d1f8-ffa4-71eb-bf52-f8ed480fd87f", "code": "P2OG.02.156", "title": {"en": "International Law", "et": "Rahvusvaheline õigus"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The basic course discusses the creation, legal nature and legal foundations of the EU,  the interactions of the EU with international and regional organizations, relationship between the EU law and national law, institutions of the EU and the representation of Estonia therein, the decision making and law making procedures of the EU and Estonia's participation thereof, the implementation of the EU law in Member States including Estonia and the problems that might arise, the responsibility of a Member State in case of being in breach with the EU law, the judicial system of the EU and actions and procedure in the European Court of Justice, the fundamental rights and freedoms in the EU law, the general principles of EU law.", "et": "Euroopa Liidu õiguse loeng käsitleb Euroopa Liidu teket, õiguslikku olemust, õiguslikke aluseid, suhet rahvusvahelistesse ja regionaalsetesse organisatsioonidesse, Eesti õiguse ja EL õiguse vahekorda, Euroopa Liidu institutsioone ja Eesti esindatust nendes, otsuste tegemise ja õigusloomeprotsessi Euroopa Liidus ja Eesti osalust selles, Euroopa Liidu õiguse rakendamist liikmesriikides, sh Eestis ja selle juures tekkida võivaid probleeme, liikmesriigi vastutust Euroopa Liidu õiguse rikkumise korral, Euroopa Liidu õigustmõistvat võimu ja kohtumenetlust Euroopa Kohtus, Euroopa Liidus kehtivaid põhiõigusi- ja vabadusi, õiguse üldpõhimõtteid."}, "objectives": [{"en": "The aim of the basic course on EU law is to introduce the fundamental principles of the European Union, the institutional structure and the fundamental treaties of the EU, the legal drafting procedure and the judicial system of the EU, the relationship between national law and EU law. The course deals to a large extent with the case law of the Court of Justice of the EU (COJEU) as the precedents have an essential role in the EU law. ", "et": "Euroopa Liidu õiguse põhikursuse eesmärgiks on tutvustada Euroopa Liidu põhialuseid, institutsionaalset struktuuri, õigusloomet, põhilepinguid, õigusemõistmist, suhet siseriiklikusse õigusesse.  Aine viiakse läbi suures osas Euroopa Liidu Kohtu (ELK) lahendite põhjal ning selgitatakse lahendite keskset positsiooni EL õiguses."}, {"en": "The aim of the course is to create an understanding of the EU law as a dynamic process and the natural belonging of the EU law into the national legal system. By passing the course the students will build up a ground for working with the acquis and an understanding of the legal nature of the EU. They also expand the sense of orientation in the information about the EU and the legal literature about EU, especially in the sources of the EU law.", "et": "Aine eesmärgiks on luua arusaam EL õiguse dünaamilisusest ning tunnetada selle loomulikku kuuluvust siseriiklikku õigussüsteemi. Aine edukal läbimisel omandatakse esialgne baas tööks EL acquis-st ja arusaam EL-i õiguslikust olemusest, võime orienteeruda EL-i alases teabes ja juriidilises kirjanduses, eelkõige aga EL õiguse allikates."}], "learning_outcomes": [{"en": "At the end of the course the student must be able to: ", "et": "Aine edukal läbimisel peab üliõpilane olema võimeline:"}, {"en": " - know the history of the European legal integration as well as the principle institutions of the EU and their functions;  ", "et": "- teadma ja tundma EL õigusliku lõimingu kujunemislugu, samuti EL peamiseid institutsioone ning nende ülesannete jaotust; "}, {"en": "- analyze the main principles of the EU law, their implementation in the practice and their relation to other general principles of law;  ", "et": "- analüüsima EL õiguse peamisi põhimõtteid, nende rakendumist praktikas ja seoseid teiste õiguse üldpõhimõtetega; "}, {"en": "- analyse the protection of human and fundamental rights in the EU; ", "et": "- analüüsima inimõiguste ja põhiõiguste kaitset Euroopa Liidus; "}, {"en": "-  explain what constitutes the EU acquis;", "et": "-  selgitama, millest koosneb EL õigustik (EU acquis); "}, {"en": "- know in detail the EU fundamental treaties and to discuss the constitutional issues of the EU; ", "et": "- tundma põhjalikult EL aluslepinguid ja diskuteerima  EL konstitutsiooniliste küsimuste üle; "}, {"en": "- distinguish the different legal acts of the EU; ", "et": "- eristama EL erinevaid õigusakte; "}, {"en": "- understand what is the position and relationship of the EU law towards the national law; ", "et": "- aru saama, milline on EL õiguse positsioon siseriikliku õiguse suhtes;"}, {"en": "- discover the collision between the national and the EU law and find the best way to solve this problem;", "et": "- tuvastama siseriikliku õiguse või menetluse vastuolu või ebakõla EL õigusega ning määratlema õige tegevuse olukorra lahendamiseks (materiaal- ja menetlusõiguslikult);"}, {"en": "- understand and distinguish between different actions in the COJEU incl. preliminary rulings, judicial review of EU acts (action to annul and others), infringement procedure.  Able to pick the right action in order to solve the practical case. Understand the procedural aspects and interpretation methods of the COJEU; ", "et": "- mõistma ja eristama erinevaid menetlusi Euroopa Liidu Kohtus (ELK), sh eelotsustusmenetlus, tühistamismenetlus, rikkumismenetlus ja kahjunõuded. Oskama valida kohase menetluse ning seda rakendada reaalsele kaasusele. Tundma ELK tõlgendusmeetodeid; "}, {"en": "- independently use, analyse, synthesize and evaluate the literature about the institutional EU law as well as most important chapters of the substantial law of the EU and the case law practice of the COJEU;  ", "et": "- iseseisvalt leidma, kasutama, analüüsima, sünteesima ja kriitliselt hindama EL institutsioonilise õigusega ning materiaalõiguse olulisemate valdkondadega seotud erialakirjandust ja ELK praktikat. "}, {"en": "- analyse a judgment of the COJEU and solve a case in the framework of the basic course according to the given questions/methodology.", "et": "- esitama EL õiguse põhikursuse raames ELK lahendi ja  õppekaasuse analüüsi ning lahenduskäigu vastavalt etteantud küsimustele/metoodikale;"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}