{"uuid": "81aa1726-1d58-ef44-a798-51286f19585a", "code": "sv-2024-spring-openuniv-p2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-28T12:36:35", "title": {"en": "Constitutional Law", "et": "Riigiõigus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 S block mode part 2 3 CP SV", "et": "24/25 K SÕ 2. osa 3 EAP SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI02", "structural_unit_name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 22, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course, the following four subject blocks will be addressed: general questions of constitutional law; fundamental principles of the Constitution; constitutional institutions and their interrelations; fundamental rights.", "et": "Loengukursuse raames käsitletakse nelja suurt blokki: riigiõiguse üldküsimused; põhiseaduse aluspõhimõtted; riigikorraldus; põhiõigused."}, "objectives": [{"en": "The subjects of the course are the legal construction of the state, legal relations between persons and the state based on the fundamental rights and the relations between the constitution and the law of the European Union. The further subjects are the nature of the constitution, its functions and fundamental principles as well as their forms of realization. In addition to the theoretical basis, the participants will be acquainted with the acts of parliament and the jurisprudence in question and learn to independently conduct a constitutional review.", "et": "Riigiõiguse kursuse esemeks on riigi õiguslik ülesehitus, põhiõigussuhted isiku ja riigi vahel ning põhiseaduse ja Euroopa Liidu õiguse vahekord. Aines käsitletakse põhiseaduse olemust, funktsioone ja aluspõhimõtteid ning nende rakendusvorme. Lisaks teoreetilistele alustele õpitakse tundma vastavaid õigusakte ja kohtupraktikat ning iseseisvalt läbi viima põhiseaduspärasuse kontrolli."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "After having participated in the course, the student should be able to recognize the constitutional problem where it exists, and to solve it by using the methods of constitutional interpretation. The student must be able to convincingly argue for or against the violation of the Constitution. Students who have completed the course are also expected to be familiar with the fundamental rights set forth in the Constitution and to be able to evaluate the legality of fundamental rights restrictions. Additionally, the student must, by the end of the course, have acquired the skill to read and analyse important sources of Estonian constitutional law, especially the constitutional review decisions of the Supreme Court. In addition, during the course, the student will get an overview of the constitutional institutions of Estonia as well as of their relations with each other and the relationship between the constitution and the EU Law.", "et": "Üliõpilane peaks pärast kursusel osalemist olema võimeline ära tundma põhiseadusliku probleemi, kus see eksisteerib, ning olema suuteline seda lahendama põhiseadusõiguslikku argumentatsiooni kasutades. Üliõpilane peab suutma veenvalt põhjendada, kas konkreetsel juhtumil on põhiseadust rikutud või mitte. Üliõpilaselt, kes on läbinud kursuse eeldatakse, et ta on tuttav põhiseadusega tagatud põhiõigustega ning suudab iseseisvalt hinnata põhiõiguspiirangute õiguspärasust. Lisaks peaks üliõpilane kursuse lõpuks olema omandanud oskuse lugeda ja analüüsida olulisi riigiõiguse allikaid, iseäranis Riigikohtu põhiseaduslikkuse järelevalve alaseid otsuseid. Ka omandab üliõpilane loengukursuse käigus ülevaate Eesti põhiseaduslikest institutsioonidest ja nende omavahelistest suhetest ning Eesti ja Euroopa Liidu õiguse omavahelistest suhetest."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Iseseisvalt tuleb läbi töötada kohustuslik kirjandus, õigusaktid ja kohtupraktika.\n2. Loenguks tuleb ette valmistada õppejõu antud ülesanded."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Aine lõplik hinne kujuneb eksamil. Arvestustöö sooritamine positiivsele hindele pärast kursuse esimese osa lõppemist on eksamile pääsemise eeldus.\n\nEksami osadeks on: (1) üks või mitu teooriaküsimust (võib olla testina) loengutes/seminarides käsitletud materjali ja iseseisva töö tulemusena läbitöötatud materjali põhjal; (2) ühe või mitme ülesande (kaasuse) lahendamine loengutes/seminarides käsitletud metoodika kohaselt.\n\nEksam toimub auditoorse kirjaliku töö vormis. Eksamil on lubatud abimaterjalina kasutada kommenteerimata põhiseaduse teksti paberkandjal. Täiendavad, arvestusel ja eksamil kasutada lubatud õigusaktid määrab kindlaks õppejõud. Arvestusele/Eksamile ei ole lubatud kaasa võtta ega seal kasutada seaduse kommentaare, märkuste või juurde kirjutustega õigusaktide tekste, loengukonspekte, loenguslaide ega mistahes muid abimaterjale.\n\nLõplik hinne kujuneb arvestusel ja eksamil saadud punktide summa alusel vastavalt ÕKE-s sätestatud hindamise reeglitele. Arvestus moodustab 50% ja eksam 50% lõpphindest.\n\nTeooriaküsimuste puhul hinnatakse seda, kas üliõpilane tunneb riigiõiguse asjakohaseid põhimõisteid, teab nende sisu ja asjakohaseid põhiseaduse sätteid.\n\nPõhiõiguskaasuse lahenduse puhul hinnatakse seda, kuivõrd üliõpilane tunneb ja oskab rakendada nn kontrollskeemi ning kuidas ta esitab oma seisukohti.\n\nKaasuse hindamisel lähtutakse järgmistest kriteeriumidest:\n- vastuse juriidiline korrektsus, loogilisus ja terviklikkus (mh ülesehitus; lahendus);\n- analüütilisus, seoste loomine, tõlgendamise tase (mh argumentatsioon);\n- korrektne keelekasutus (mh sõnastus)."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Tööde hindamisel lähtutakse järgmistest kriteeriumitest:\nA - Põhiseaduse ning selle kohaldamisel ja tõlgendamisel tekkida võivate probleemide silmapaistev, põhjalik ja igakülgne tundmine.\nB - Põhiseaduse ning selle kohaldamisel ja tõlgendamisel tekkida võivate probleemide väga heal tasemel tundmine, detailsemates küsimustes esineb üksikuid puudujääke.\nC - Põhiseaduse ning selle kohaldamisel ja tõlgendamisel tekkida võivate probleemide heal tasemel tundmine, teadmistes esineb mitteolulisi puudujääke.\nD - Põhiseaduse ning selle kohaldamisel ja tõlgendamisel tekkida võivate probleemide rahuldaval tasemel tundmine, teadmistes esineb puudujääke.\nE - Põhiseaduse ning selle kohaldamisel ja tõlgendamisel tekkida võivate probleemide põhiliste aspektide tundmine, teadmistes esineb selliseid puudujääke, mis ei takista hindamast tööd sooritatuks.\nF - Teadmistes põhiseadusest ning selle kohaldamisel ja tõlgendamisel tekkida võivatest probleemidest esineb selliseid puudujääke, mis takistavad hindamast tööd sooritatuks."}}], "grade_preconditions": {"et": "Arvestustöö sooritamine positiivsele hindele pärast kursuse esimese osa lõppemist on eksamile pääsemise eeldus.\nNii arvestusele kui ka eksamile pääsu eelduseks on kummalgi semestril kõikide kodutööna esitatud tööde edukas - üle 50% kogupunktide arvust - sooritamine ettenähtud ajaks. Kodutööd teeb õppejõud kättesaadavaks õpikeskkonnas Moodle. Hindamisele ei pääse üliõpilane, kellel on jäänud õigeaegselt esitamata enam kui üks kodutöö."}, "grade_evaluation": {"et": "Nii arvestus kui ka eksam toimuvad kirjaliku töö vormis.\nLõplik hinne kujuneb nii arvestusel kui ka eksamil saadud punktide summa alusel vastavalt ÕKE-s sätestatud hindamise reeglitele. Arvestus moodustab 50% ja eksam 50% lõpphindest.\nLäbikukkujal on võimalik osaleda ühel järelarvestusel/järeleksamil."}, "debt_elimination": {"et": "Kui eksamile pääsemise tingimused on täitmata, siis üliõpilast eksamile ei lubata. Õigeaegselt sooritamata tööd hindamisele ega järele vastamisele ei kuulu."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "6173df53-e597-4e6a-afd6-a28080a0ca9c", "type": "MOODLE", "code": "P2OG.02.058_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "a4c3267b-2f49-2bab-bb88-22c7b4c3400f", "person_name": "Paloma Krõõt Tupay", "structural_unit": {"code": "SVOI02TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24,27,30,32,37"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {}, "description": {}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 72}, "confirmation_process": {"confirmation_uuid": "c1fad0fe-f6a9-c4d3-f9b2-a6f2076f7503", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "28e0da9f-79da-c928-4c60-963a401963a6", "parent_code": "P2OG.02.058", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}