{"uuid": "366c0894-3389-0525-0fa6-9ad8274cb90c", "code": "P2OG.04.041", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Russian for Pre-Intermediate Students (B1)", "et": "Vene keele kesktase (B1)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI01", "structural_unit_name": {"en": "General Department", "et": "üldosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI01", "name": {"en": "General Department", "et": "üldosakond"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is a follow-up to \"Russian for Beginners\". The aim of the course is to establish associations so that the students would be able to independently work with ESP literature, and would cope with simple conversation situations. Assessment: Pass/fail examination", "et": "Kursus on jätkuks algkursusel omandatule, kursuse eesmärk on luua eeldused iseseisvaks tööks erialase kirjandusega ja toimetulekuks erinevates keelesituatsioonides."}, "objectives": [{"en": "Obtaining knowledge of Russian language phonetics, grammar and syntax main rules that will facilitate fluent communication on the common level and generic texts understanding and analytical usage. Using of minimum glossary that will allow to work with legal texts.. The course revises and reinforces the skills acquired at the basic level, develops the skills in expressing oneself in oral and in written", "et": "Vene keele foneetika, grammatika ja süntaksi põhireeglite omandamine, mis oleks piisav vabaks kommunikeerumiseks suhtlustasandil ning teadustekstide mõistmiseks ja analüütiliseks kasutamiseks. Sõnavara miinimumi omandamine võimaldamaks käsitleda õigusalaseid tekste.. Kursus kinnistab ja süvendab baasteadmisi, arendab kõne- ja kirjakeele oskust."}], "learning_outcomes": [{"en": "After the course, the students can:\n* can understand the essential in a familiar topic (studies, working, free time etc.);\n* can compile texts on a familiar topic or a topic interesting for the student both in the oral and written mode, and use the newly acquired grammatical structures in the right way;\n* can describe experiences and plans, exchange important information and express their opinion on practical problems;\n- can find necessary information from everyday texts (advertisements, menus, schedules) and can understand the gist of radio and TV programmes that are broadcast slowly and clearly, if these include familiar or interesting topics;\n* can participate in short conversations on everyday matters and in ordinary situations without prior preparation;\n* can make social contact (greeting, saying good-bye, introduction, thanking, agreeing on a time to meet, etc.)*- can write short simple coherent texts)", "et": "Kursuse läbinud üliõpilane suudab:\n* suudab mõista kõike olulist endale tuttaval teemal (töö, õpingud, vaba aeg vm);\n* oskab koostada teksti tuttaval või enda jaoks huvipakkuval teemal nii kirjalikult kui ka suuliselt, kasutades õigesti õpitud grammatilisi konstruktsioone;\n* suudab aru saada lühikestest ja lihtsatest tekstidest tuttavatel teemadel;\n* oskab kirjeldada kogemusi, sündmusi, eesmärke, muljeid jne ning lühidalt põhjendada / selgitada oma seisukohti ja plaane, vahetada olulist infot ja avaldada oma arvamust praktiliste probleemide kohta;\n* suudab leida vajalikku infot igapäevatekstidest (reklaamid, menüüd, ajakavad jm) ning aru saada aeglaselt ja selgelt edastatud raadio- või telesaadete põhisisust, kui need käsitlevad tuttavaid või huvipakkuvaid teemasid;\n* suudab ettevalmistuseta osaleda lühikestes vestlustes igapäevastel praktilistel teemadel ja tavapärastes situatsioonides;\n* suudab luua sotsiaalset kontakti (tervitada, hüvasti jätta, tutvustada, tänada, määrata kokkusaamist jne);\n* oskab kirjutada lühikesi lihtsaid seostatud tekste."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}