{"uuid": "345e41b7-cd0e-64f1-c893-f9f4e11f19b9", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-29T13:51:42", "title": {"en": "International Criminal Law", "et": "Rahvusvaheline kriminaalõigus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will draw attention to the essence, principles and definitions of international crimes, as well as to various possibilities to handle them on international or internal level. Special attention will be drawn to definitions and procedural aspects of international crimes in Estonia.", "et": "Vaadeldakse rahvusvaheliste kuritegude olemust, põhimõtteid ja kuriteokoosseise, samuti rahvusvaheliste kuritegude menetlemise võimalusi rahvusvahelisel ja ka siseriiklikul tasandil. Eraldi tähelepanu pööratakse rahvusvaheliste kuritegude koosseisudele ja menetluslikele aspektidele Eestis."}, "objectives": [{"en": "To give an overview of the progressively developing discipline of international criminal law: to introduce students with respective international instruments, court practice and academic writings. To teach students to see and analyze the theoretical and practical issues of international criminal law", "et": "Anda ülevaade progresseeruvalt arenevast õigusharust - rahvusvahelisest kriminaalõigusest: viia üliõpilased kurssi asjakohase rahvusvahelise normatiivmaterjali, kohtupraktika ja erialakirjandusega. Õpetada nägema ja analüüsima rahvusvahelise kriminaalõiguse teoreetilisi ja praktilisi probleeme."}], "learning_outcomes": [{"en": "By the end of the course students have to:", "et": "Kursuse lõpuks peab üliõpilane olema:"}, {"en": "- be able to explain the principles and fundamental concepts of international criminal law;", "et": "- võimeline selgitama rahvusvahelise kriminaalõiguse põhimõtteid ja põhimõisteid;"}, {"en": "- be aware of topical issues of international criminal law and be able to discuss them;", "et": "- teadlik rahvusvahelise kriminaalõiguse aktuaalsetest probleemidest ja suutma nende üle arutleda;"}, {"en": "- be able to orientate in the relevant institutions and instruments", "et": "- võimeline orienteeruma rahvusvahelise kriminaalõiguse olulistes institutsioonides ja normatiivdokumentides"}], "notes": {}}, "grading": {"independent_work": {"et": "*\tIndependent work with study materials\n*\tSelf-testing exercises in Moodle \n*\tSolution of mini-cases in Moodle\nThe solutions should be submitted electronically as a Word-file no later than on Sunday of the week of respective class at 12:00 (noon) via Moodle. Any solutions which are late are not accepted. Solutions sent by email are not accepted.\n*\tWriting an essay\nIn the essay, the student analyses critically one legal problem in international criminal law. The selected problem should be registered via Moodle no later than on the day of last lecture. The instructor may ask the student to choose another problem if the chosen problem is not suitable or too many students have already chosen the same problem. The paper should be submitted electronically as a Word-file no later than on by 1 December. For every started overdue day, the result will be decreased by 5 points, but papers which are late more than four days are not accepted and the student may not take the exam. Papers sent by email are not accepted.\nThe length of the essay main text should be min 2500 words. Shorter papers are not accepted or the result is lowered by the discretion of the instructor.\nIndependent identification of clear issues and legal problems is essential. Also, the use of different sources and supportive materials. All used sources must be referred to. In case of internet sources, the full address is necessary, not only the main domain (e.g. www.un.org). A paper based on copy-paste method leads to negative results for both the paper and the exam. Plagiarism is not tolerated at the University of Tartu."}, "grade_preconditions": {"et": "*\tParticipation in at least 9 colloquia. If a student misses a colloquium, he/she must submit, within a week, a 500 word long annotation of the topic discussed in the class.\n*\tTimely solution of mini cases in Moodle\n*\tTimely submission and positive evaluation of an essay."}, "grade_evaluation": {"et": "*\tExam-case max 100 points - 60% of the final grade\n*\tEssay max 100 points - 40% of the final grade\n\nCriteria\n*\tConsistency, completeness and correctness of the solutions\n*\tCreativeness of the solutions \n*\tDepth of the analysis of problems and applicable norms and principles\n*\tAssociation of theory with court practice\n*\tStructure, grammar and formatting\n\nGrades (Cases)\nA\tSolution are remarkable; the examination of facts is full and logical; the analysis of legal problems is detailed and innovative; all relevant norms and principles have been used; the references to relevant court practice are thoughtful and creative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]\nB\tSolution is very good with insignificant mistakes or omissions; the examination of facts is purposeful; the analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the references to court practice support the conclusions; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC\tSolution is good, but there are mistakes or omissions; the examination of facts addresses correctly the central issues; the analysis of legal problems is good with some deficiencies concerning specific issues; key norms and principles have been used; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]\nD\tSolution is fair, but there are several mistakes or omissions; the examination of facts is satisfactory, but focuses only on the central aspects; the analysis of legal problems is satisfactory with deficiencies is most aspects; only basic norms and principles have been used; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]\nE\tSolution is poor with significant mistakes (51-60 points)"}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "98c7af9e-7bc7-42e0-8ba1-08031e198bbd", "type": "MOODLE", "code": "P2OG.02.201", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "*\tMaterial in the SIS, on the page of the course outline\n*\tHandouts in the colloquia\nTreaties and Documents\n*\tCharter of the United Nations (1945)\n*\tRome Statute of the International Criminal Court (1998)\n*\tConvention on the Prevention and Punishment of the Crime of Genocide (1948)\n*\tGeneva Convention (I) for the Amelioration of the Condition of the Wounded and Sick in Armed Forces in the Field (1949)\n*\tGeneva Convention (II) for the Amelioration of the Condition of Wounded, Sick and Shipwrecked Members of Armed Forces at Sea (1949)\n*\tGeneva Convention (III) relative to the Treatment of Prisoners of War (1949)\n*\tGeneva Convention (IV) relative to the Protection of Civilian Persons in Time of War (1949)\n*\tAdditional Protocol (I) relating to the Protection of Victims of International Armed Conflicts (1977)\n*\tAdditional Protocol (II) relating to the Protection of Victims of Non-International Armed Conflicts (1977)\n*\tConvention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (1984)\n*\tInternational Convention for the Suppression of the Financing of Terrorism (1999)", "recommended_materials": "Books\n*\tA. Cassese. International Criminal Law. 2nd ed. OUP 2008 \n*\tG. Werle. Principles of International Criminal Law, T.M.C. Asser Press, 2005\n*\tCassese's international criminal law. Revised by A. Cassese, P. Gaeta, L. Baig... [et al.]. OUP 2013\n*\tK. Ambos. Internationales Strafrecht: Strafanwendungsrecht, Völkerstrafrecht, europäisches Strafrecht: ein Studienbuch. C.H. Beck, 2006\n*\tI. Bantekas, S. Nash. International criminal law. Routledge-Cavendish, 2007\n*\tR. Cryer, et al. An Introduction to International Criminal Law and Procedure. 2nd ed. Cambridge 2010\n*\tThe Oxford Companion to International Criminal Justice. Ed. by A. Cassese. OUP 2009\nTreaties and Documents\n*\tStatute of the ICTY (1993)\n*\tStatute of the ICTR (1994)\n*\tDraft Articles on Responsibility of States for Internationally Wrongful Acts (2001)\n*\tPenal Code of Estonia (2001)"}, "participants": {"lecturers": [{"person_uuid": "3f25c76c-46fe-5b1b-b3ad-717ab700e886", "person_name": "Andres Parmas", "structural_unit": {"code": "SVOI03TR", "name": {"en": "Tartu Office", "et": "Tartu osakond"}, "address": "EST", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI03"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2,8,11,13"}, "entries": [{"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "I INTRODUCTION, HISTORY, CONCEPT OF ICL, SOURCES, DELIMITATION"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "II PRINCIPLES, GENERAL PART: MISTAKE, INTENT, COMPLICITY, INCHOATE FORMS OF CRIME"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "III GENERAL PART: DURESS, SUPERIOR ORDERS RESPONSIBILITY OF SUPERIOR"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "IV SPECIAL PART: WAR CRIMES"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "V SPECIAL PART: GENOCIDE, CRIMES AGAINST HUMANITY"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "VI SPECIAL PART: AGGRESSION, OTHER CRIMES"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "VII NATIONAL COURTS, TRUTH AND RECONCILIATION COMMISSIONS"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "VIII INTERNATIONAL AND INTERNATIONALIZED CRIMINAL COURTS"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "IX PROCEDURE, INTERNATIONAL COOPERATION (esp ICC)"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "X ICL AND WORLD POLITICS, PEACE vs JUSTICE"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "XI CONCLUDING COLLOQUIUM"}}]}, "registration_info": {"audience": {"et": "Master’s students of International Law and Human Rights, but other master’s students are also welcome depending on certain limitations"}, "min_students": 5, "max_students": 20}, "parent_uuid": "82fa0712-141b-f656-9a1e-254e999a545b", "parent_code": "P2OG.02.201", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}