{"uuid": "d4981393-bcda-935f-b9be-accd060a87b9", "code": "P2OG.01.083", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Latin Legal Terminology", "et": "Ladina juriidiline terminoloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The formation and historical development of Latin legal language. Principles of pronounciation and stress. The system of Latin nouns, cases, gender. The formation and translation of Latin terms on the base of substantives, adjectives and pronouns. The system on Latin verbs; formation and translation of terms on the base of finite and infinite forms of the verb. Academic hymn Gaudeamus. Roman political and legal speeches.", "et": "Ladina õiguskeele kujunemine ja areng. Ladina hääldamis- ja rõhureeglid. Käändsõnade süsteem, käänded, soovormid. Terminite moodustamine ja tõlkimine substantiivide, adjektiivide ja pronoomenite alusel. Pöördsõnade süsteem. Terminite moodustamine ja tõlkimine verbi finiitsete ja infiniitsete vormide alusel. Üliõpilashümn Gaudeamus. Rooma poliitilised- ja kohtukõned."}, "objectives": [{"en": "The aim of the course is to give an overview of the development and usage of the legal terminology in Latin and its influences today. The course develops the skills to use the Latin terms in legal language correctly.", "et": "Õppeaine eesmärgiks on kujundada teadmisi ladinakeelsest õigusterminoloogiast, tutvustada ladina keele mõju võõrsõnade ja terminoloogia kujunemisele. Õppeaine loob eeldused ladina õigusterminite korrektseks tundmiseks ja kasutamiseks õiguskeeles."}], "learning_outcomes": [{"en": "The course gives the special knowledge on Latin legal terminology. After the course the student in able:", "et": "Loengukursus annab eriteadmised ladina keele osast õigusterminoloogias. Aine edukal läbimisel on üliõpilane võimeline:"}, {"en": "-\tto recognise and use the special terminolgy", "et": "-\ttundma ja kasutama erialast oskussõnavara"}, {"en": "-\tto analyse the form and content of the Latin terms", "et": "-\tanalüüsima ladina õigustermineid vormiliselt ja sisuliselt "}, {"en": "-\tdistinguish the principles of the pronounciation (classical and tradional pronounciation)", "et": "-\teristama terminite häälduspõhimõtteid (klassikaline ja traditisooniline hääldus)"}, {"en": "-\tto understand the general structure of Latin grammar and compare the differences between Estonian and Latin", "et": "-\tmõistma ladina keele grammatika põhistruktuuri ja võrdlema ladina ja eesti keele süsteemide erinevusi"}, {"en": "-\tto use the legal dictionaries and reference books", "et": "-\tkasutama erialasõnastikke ja keeleabimaterjale"}, {"en": "-\tto explain the agreement of Latin terms into Estonian legal language.", "et": "-\tselgitama ladina terminite ühildumist eesti õiguskeelde."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}