{"uuid": "aa37d065-8b93-ed09-c1d6-ec37331d30c2", "code": "P2OG.01.130", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research Paper", "et": "Uurimistöö"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "c1372fc4-0cc5-9422-e631-89b75b181dac", "code": "P2OG.01.129", "title": {"en": "Basics of Legal Research and Academic Communication Skills", "et": "Õigusteadusliku uurimistöö alused ja akadeemiline väljendusoskus"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Research paper is a written text corresponding to the requirements of obtaining. Research paper should comply with the requirements imposed by the Faculty Council. See http://www.oi.ut.ee/et/oppetoo/regulatsioonid-oppetoos/kirjalikele-toodele-esitatavad-nouded.", "et": "Aine sisuks on kirjaliku uurimuse koostamine. Uurimistöö peab vastama õigusteaduskonna nõukogu poolt kinnitatud kirjalikele töödele esitatavatele nõuetele. Vt http://www.oi.ut.ee/et/oppetoo/regulatsioonid-oppetoos/kirjalikele-toodele-esitatavad-nouded.\n1. Üliõpilase uurimustöö on üliõpilase poolt valitud teemal ja õppejõu juhendamisel koostatud kirjalik uurimus.\nUurimistöö teema valib üliõpilane kooskõlastatult juhendajaga kaitsmisele eelneval sügissemestril 15. oktoobriks.\n2. Kirjalik uurimustöö peab vastama oma sisult ja mahult juhendava õppejõu poolt määratud nõuetele, sisaldama 6 EAP ulatuses iseseisvat tööd ning olema kirjutatud arvutitrükis 1,5-intervallise reavahega, 12-punktilise tähesuurusega, ca 2000 tähemärki leheküljel, Times New Roman&acute;i kirjas (ligikaudne maht ca 20-25 lk). Kirjalike tööde esitamisel tuleb kinni pidada kehtestatud lõpptähtaegadest (vt akadeemiline kalender). \nJuhendajaks võivad olla õigusteaduskonna õppejõud, teadurid või isikud, kes on oma ala tunnustatud spetsialistid, ning kellel on vähemalt magistrikraad või sellele vastav haridustase.\nJuhendaja võib väljastpoolt õigusteaduskonda olla ainult juhul, kui selleks on mõjuv põhjus. Välisjuhendaja kooskõlastab üliõpilase avalduse ja välisjuhendaja kirjaliku nõusoleku alusel instituudi juhataja või tema asetäitja ning kinnitab dekaan."}, "objectives": [{"en": "To obtain the professional skills by writing independent research paper.", "et": "Omandada oskus kirjutada iseseisevat õigusvaldkonna uurimuslikku tööd, milles on iseseisvalt analüüsitud teoreetilisi ja praktilisi probleeme, esitatud oma argumenteeritud seisukohti ning kasutatud allikaid kriitiliselt. Suuliselt kaitsta oma uurimust, sh valitud metoodika, allikate, argumentide ja põhiseisukohtade osas."}], "learning_outcomes": [{"en": "To learn to independently collect materials concerning the main topic of the research, formulate problems and find solutions, use legal literature and court practice, find and analyse different opinions, choose and use adequate research methods, analyse and interpret results of the research.", "et": "Õppida iseseisvalt koguma teemasse puutuvat materjali, formuleerima probleeme ning otsima neile lahendusi, kasutama õigusalast kirjandust ja vajadusel ka kohtupraktikat, otsima ja analüüsima teemakohaseid teoreetilisi seisukohti, valima adekvaatseid uurimismeetodeid ning analüüsima ja interpreteerima uurimistöö tulemusi.\nSuuliselt kaitsta oma uurimust, sh valitud metoodika, allikate, argumentide ja põhiseisukohtade osas"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}