{"uuid": "852c6f6d-14b8-e9de-0d20-e1f73813ca9a", "code": "P2OG.02.193", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Public International Law", "et": "Rahvusvaheline avalik õigus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "International law is traditionally concerned with inter-state relations, but nowadays it involves likewise international organisations and to a lesser extent also natural and legal persons. The course provides a broad understanding of the central principles and main branches of international law, e.g. jurisdiction, immunity, state responsibility, peaceful settlement of disputes, law of treaties, diplomatic law, law of the sea and use of armed force. In addition to the theoretical foundation, relevant practices of states, courts and international organisations are examined in connection with discussed topics.", "et": "Rahvusvaheline õigus käsitleb klassikaliselt riikidevahelisi suhteid, kuid tänapäeval puudutab selle regulatsioon veel rahvusvahelisi organisatsioone ning vähemal määral ka füüsilisi ja juriidilisi isikuid. Õppeaine annab üldised teadmised rahvusvahelise õiguse põhimõtetest ja selle peamistest harudest, nt jurisdiktsioon, immuniteet, vastutus, vaidluste rahumeelne lahendamine, lepingute õigus, diplomaatiline ja konsulaarõigus, mereõigus, inimõigused ning relvastatud jõu kasutamine. Jooksvalt vaadeldakse ka Ühinenud Rahvaste Organisatsiooniga seonduvaid küsimusi. Läbitavate teemade puhul käsitletakse lisaks teoreetilisele baasile ka asjakohast riikide, kohtute ja rahvusvaheliste organisatsioonide praktikat"}, "objectives": [{"en": "To provide a broad understanding of the central principles and main branches of international law, and to develop the skills necessary to assess the conduct of international actors from international law perspective", "et": "Anda laialdane arusaam rahvusvahelise õiguse kesksetest põhimõtetest ja peamistest harudest ning arendada oskusi, mis on vajalikud, et hinnata rahvusvaheliste toimijate käitumist lähtuvalt rahvusvahelisest õigusest"}], "learning_outcomes": [{"en": "The student who has passed the course is able to:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "-- Explain the central principles of international law", "et": "-- Selgitab rahvusvahelise õiguse põhimõisteid"}, {"en": "-- Describe the sources of international law", "et": "-- Kirjeldab rahvusvahelise õiguse allikaid"}, {"en": "-- Understand the relation between international and national legal systems", "et": "-- Mõistab rahvusvahelise ja siseriikliku õiguse suhet"}, {"en": "-- Identify the subjects of international law", "et": "-- Määratleb rahvusvahelise õiguse subjekte"}, {"en": "-- Find and apply the substantive regulation of the main branches of international law", "et": "-- Leiab ja rakendab rahvusvahelise õiguse peamiste harude sisulist regulatsiooni"}, {"en": "-- Solve hypothetical legal cases", "et": "-- Lahendab rahvusvahelist õigust puudutavaid hüpoteetilisi kaasusi"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}