{"uuid": "fb5b3584-9e45-7473-4fab-76d94f6fa170", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-30T21:34:44", "title": {"en": "Law of International Institutions", "et": "Rahvusvaheliste institutsioonide õigus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 22, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "As most of the international law is made within, or under the auspices of international organisations, it is essential to study also the legal framework and operational mechanisms of these organisations and their contribution to the development of international law. The course provides broad overview of the law of international institutions, e.g. legal mechanisms that give the international institutions the power, international legal personality, treaty-making power, privileges and immunities, legal responsibility of the institutions etc. In addition to the theoretical overview, the decisions of international courts (ICJ, ICC, ECHR) and discussions in commissions and other international foras (ILC, ILA) are also analyzed in order to enhance practical knowledge of the subject.", "et": "Kuna suur osa rahvusvahelisest õigusest on kirjutatud rahvusvaheliste organisatsioonide poolt või nende egiidi all, on oluline tunda ka nende organisatsioonide ja institutsioonide õiguslikku raamistikku, nende pädevusi ning nende toimimist, aga ka nende panust rahvusvahelise õiguse arengusse. Kursuse käigus antakse ülevaade rahvusvaheliste institutsioonide õigusest, so nende ülesehitusest, nende õigustest ja kohustustest, nende õigusloome pädevusest, neile antud privileegidest ja immuniteetidest ning nende rahvusvahelisest vastutusest. Lisaks teoreetilisele ülevaatele analüüsitakse kursuse käigus ka rahvusvaheliste kohtute otsuseid ning asjassepuutuvate rahvusvaheliste komisjonide arutelusid ja aruandeid."}, "objectives": [{"en": "The aim of the course is to provide an overview of international institutions, their powers and functioning, as well as the rules and legal acts regulating their operation and the responsibilities of international institutions. The course is aimed to broaden students' knowledge about the operation of international institutions, their treaty-making powers and processes and their contributions to the development of international law.", "et": "Kursuse eesmärk on anda ülevaade rahvusvahelisetest institutsioonidest, nende õiguslikust ja materiaalsest toimimisest, nende tegevust reguleerivatest reeglitest ja õigusaktidest ning rahvusvaheliste organisatsioonide vastutusest. Kursus arendab üliõpilase teadmisi rahvusvaheliste institutsioonide õiguslikust regulatsioonist, samuti nende panusest rahvusvahelisse õigusesse ja selle arendamisse."}], "learning_outcomes": [{"en": "The student who has passed the course is able to:", "et": "Õppekava läbinud üliõpilane:"}, {"en": "-\tIdentify the central principles of the law of international institutions", "et": "-\tNimetab rahvusvaheliste institutsioonide õiguse aluspõhimõtteid"}, {"en": "-\tDefine the sources governing the legal personality of international organizations", "et": "-\tMääratleb rahvusvaheliste institutsioonide õigusvõime peamisi allikaid"}, {"en": "-\tDescribe the relationship between international organizations and their Member States", "et": "-\tSelgitab rahvusvaheliste institutsioonide ja nende osalisriikide omavahelisi suhteid"}, {"en": "-\tExplain international organization's treaty making processes", "et": "-\tKirjeldab rahvusvaheliste institutsioonide õigusloome protsesse"}, {"en": "-\tCompare mandates of different international institutions", "et": "-\tVõrdleb erinevate rahvusvaheliste institutsioonide volitusi"}, {"en": "-\tSolve hypothetical cases of legal responsibility of international institutions", "et": "-\tLahendab rahvusvaheliste institutsioonide õigusliku vastutusega seotud hüpoteetilisi kaasuseid"}], "notes": {"et": "\"As to the core idea of the examination process:\n1. Exam will consist of 3 analytical questions (there will be a word limit set, to prevnt it from extrapolating into a longish opinion piece).\n2. First question will address one of the fundamental aspects of the law (e.g. legal personality, inherent powers, responsibility, etc). Second question will ask for comparative approach towards a particular aspect of functioning of the organisations (e.g. immunities, legal/administrative actions, financing, etc.) Third question will be of a practical nature - you will be given a short scenario (bundle of facts) and asked to provide advice pertaining to the facts at hand. (In a nutshell, last question is a very robust simulation of a day-to-day work of a legal adviser. No real time to get your ducks in a row. Quick, short and straight to the point. You are expected to be brief and precise. It is not a place to \"shine bright like a diamond\". It's more of a \"row, row, row, your boat\" kind of a thing.)\n3. As I already pointed out in the beginning on the course - this is the \"big leagues\". So I will compose the questions in a way that I will not really need to observe you online while you answer them (just like the classic \"takeaway\" exam). Point being, it's all in the argumentation and details. Descriptive generalisations will do you no good. \nAs always, any suspicion of plagiarism or other mischievous deeds will lead to penalties. \nI know these are tough and demanding times, but I am sure you will do just fine. You have the materials. Refresh you memory and stay healthy.\nMore details coming soon!\nAleksandr Popov\""}}, "grading": {"independent_work": {"et": "*\tIndependent work with study materials\n*\tWriting a research paper\nIn the research paper, the student analyses one legal problem in connection with the international institutions. The list of relevant problems/research questions will be provided by the teacher in charge in the beginning of the course. The selected problem should be registered via e-mail no later than on the day of last lecture. The teacher may ask the student to choose another problem if too many students have already chosen the same question. The paper should be submitted electronically as a Word-file no later than on .... via the e-mail address provided by the teacher in charge. For every started overdue day, the result will be decreased by four points, but papers which are late more than four days are not accepted and the student may not take the exam. \nThe paper must include title page, table of content, main body and list of used materials. For references, use footnotes. The length of main text (starting from the introduction and ending with the conclusion, excluding footnotes) should be 1500-2500 words. Shorter papers are not accepted or the result is lowered by the discretion of the teacher.\nIndependent identification of clear issues and legal problems is very important. Also, the use of different sources and supportive materials. All used sources must be referred to. In case of internet sources, the full address is necessary, not only the main domain (e.g. www.un.org). A paper based on copy-paste method leads to negative results for both the paper and the exam. Plagiarism is not tolerated at the University of Tartu.\n\nThe research paper must be submitted to the e-mail: sass.popov.1984@gmail.com no later than October 30th at 1700."}, "grade_preconditions": {"et": "*\tParticipation in all seminars.\nIf a student did not participate in a seminar, he/she must submit, within a week, a one-page solution to a case solved in the particular seminar. Each late submission of a summary decreases the final points by three points.\n*\tTimely submission and positive evaluation of a research paper.\n\n*\tWritten exam with three questions (60 points):\ndefinition (10 points)\ntheoretical concept (20 points)\nhypothetical case (30 points)\n*\tResearch paper (40 points)"}, "grade_evaluation": {"et": "Criteria\n*\tConsistency, completeness and correctness of the answers to theoretical questions\n*\tCreativeness and consistency of the solutions to hypothetical cases \n*\tDepth of the analysis of problems and applicable norms and principles\n*\tAssociation of theory with state and court practice\n*\tStructure, grammar and formatting\nGrades\nA\tAnswers to theoretical questions are remarkable; the examination of hypothetical cases is full, logical and creative; the analysis of legal problems is detailed and innovative; all relevant norms and principles have been used; the references to state and court practice are thoughtful and creative; the form is excellent; overall, the text is a remarkable achievement [91-100 points]\nB\tAnswers to theoretical questions are very good with insignificant mistakes or omissions; the examination of hypothetical cases is purposeful and creative; the analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the references to state and court practice support the conclusions; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC\tAnswers to theoretical questions are good, but there are mistakes or omissions; the examination of hypothetical cases addresses correctly the central issues; the analysis of legal problems is good with some deficiencies concerning specific issues; key norms and principles have been used; the form is good; overall, the coverage of the subject is logical, but there are some weaknesses from the point of view of the whole [71-80 points]\nD\tAnswers to theoretical questions are fair, but there are several mistakes or omissions; the examination of hypothetical cases is satisfactory, but focuses only on the central aspects; the analysis of legal problems is satisfactory with deficiencies is most aspects; only basic norms and principles have been used; the form is fair; overall, the treatment of the subject is plausible."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "992561f3-7e4e-4c3d-83da-140dcfd41ab7", "type": "MOODLE", "code": "P2OG.02.197_Eng", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Books\nIan Hurd, International Organizations: Politics, Law, Practice (2nd edn, 2013)\nJan Klabbers, An Introduction to International Organizations Law (3rd edn, 2015)\nTreaties and Documents\n*\tCharter of the United Nations (1945)\n*\tConvention on Privileges and Immunities of the United Nations (1946) \n*\tConvention on the Privileges and Immunities of the Specialized Agencies (1947)\n*\tStatute of the International Court of Justice (1945)\n*\tVienna Convention on the Law of Treaties (1969)\n*\tStatute of the International Law Commission (1947)\n*\tCharter of the Association of Southeast Asian Nation (2007)\n*\tAgreement on the Privileges and Immunities of the Association of Southeast Asian Nation (2009)\n*\tStatute of the Council of Europe (1949)\n*\tGeneral Agreement on Privileges and Immunities of the Council of Europe (1949) and its Protocols\n*\tAgreement between the Parties to the North Atlantic Treaty regarding the Status of their Forces\n*\tAgreement among the States Parties to the North Atlantic Treaty and the other States participating in the Partnership for Peace regarding the Status of their Forces", "recommended_materials": "Books\n*\tMalcolm D. Evans, International Law, Part IX (2nd edn, Oxford University Press, 2006)\n*\tAnthony Aust, Modern Treaty Law and Practice (Cambridge University Press, 2000)\n*\tNigel D. White, The Law of International Organisations,(2nd edn, Juris Publishing, 2005) \nTreaties and Other Documents\n*\tInternational Law Commission`s  work on the responsibility of international organisations\n*\tInstitute of International Law resolutions concerning International Institutions\n*\tAgreement between the Republic of Estonia and the Supreme Headquarters Allied Powers Europe and Headquarters, Supreme Allied Commander Transformation to Supplement the Paris Protocol, entry into force 22 August 2013\n*\tProtocol on the Privileges and Immunities of the European Communities (1965) as amended"}, "participants": {"lecturers": [{"person_uuid": "90e8c77c-f9eb-b08d-b454-ce4adaa1954e", "person_name": "Aleksandr Popov", "structural_unit": {"code": "SVOI02", "name": {"en": "Department of Public Law", "et": "avaliku õiguse osakond"}, "phone": "+372 737 5977", "address": "Näituse 20 - 303\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 303", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "f09d1668-140f-1850-a57e-d0c24a652ef1", "person_name": "René Värk", "structural_unit": {"code": "SVOI02TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-15"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "International institutions\nStructure and competences\nInternational institutions and State sovereignty\nLegal personality of international institutions\nDecision-making processes\nTreaty-making processes\nPrivileges and immunities\nInternational responsibility of international institutions"}}]}, "registration_info": {"audience": {"et": "Master’s students of International Law and Human Rights, but other master’s students are also welcome depending on certain limitations"}, "min_students": 5, "max_students": 25}, "parent_uuid": "84a559d9-52df-085e-0237-8d4b9ba0e72a", "parent_code": "P2OG.02.197", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}