{"uuid": "765a233a-6db2-96b1-180f-9c11e199115d", "code": "sv-2024-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-13T11:43:44", "title": {"en": "International Law of the Sea", "et": "Rahvusvaheline mereõigus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 12, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course first covers the primary sources and actors of the international law of the sea as well as its historical development. It then proceeds with a discussion on the maritime zones: internal waters, territorial sea, archipelagic waters, contiguous zone, exclusive economic zone, continental shelf, high seas and the deep seabed. In the course of this, particular emphasis will be set on the passage rights of foreign ships and aircraft, the legal regime of straits (emphasis on the Arctic and Baltic straits), maritime boundary delimitation, marine scientific research, marine environmental protection (emphasis on the Arctic Ocean and the Baltic Sea), law enforcement and maritime security, human rights at sea, and dispute settlement. Particular emphasis is on examining the relevant State practice and case law of the International Court of Justice and the International Tribunal for the Law of the Sea.", "et": "Õppeaines käsitletakse esmalt peamisi õigusallikaid ja osapooli rahvusvahelises mereõiguses ning selle valdkonna ajaloolist arengut. Seejärel keskendutakse merevöönditele: sisevetele, territoriaalmerele, arhipelaagivetele, kontrollvööndile, majandusvööndile, mandrilavale, avamerele ja süvamerepõhjale. Selle käigus pööratakse erilist rõhku välisriikide laevade ja lennukite läbipääsuõigustele, väinadele (rõhuasetus Arktika ja Läänemere väinadel), merepiiride delimiteerimisele, teaduslikele mereuuringutele, merekeskkonna kaitsele (rõhuasetus Põhja-Jäämerel ja Läänemerel), merendusjulgeolekuõigusele, inimõiguste kaitsele merel ning vaidluste lahendamisele. Olulisel kohal on riikide praktika ja Rahvusvahelise Kohtu ning Rahvusvahelise Mereõiguse Kohtu kohtupraktika uurimine."}, "objectives": [{"en": "To provide a comprehensive understanding of the development, substance and implementation of the international law of the sea within the modern legal framework of the United Nations Convention on the Law of the Sea, as well as to develop the ability to solve practical legal issues in this field.", "et": "Pakkuda süvendatud teadmisi rahvusvahelise mereõiguse arengust, sisust ja rakendamisest  ÜRO mereõiguse konventsiooni õigusraamistikus ning kujundada oskust lahendada praktilisi mereõiguslikke probleeme."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "In the end of the course participant is able to:\n-\tComprehend the use of terms and principles of the law of the sea;\n-\tIdentify the legal framework applicable to various maritime zones and grasps their interconnections;\n-\tSolve practical legal issues concerning the international law of the sea;\n-\tInterpret the compatibility of domestic law with the international law of the sea;\n-\tExplain the connections between the international law of the sea and other fields of law, e.g. international environmental law and security law;\n-\tOrientate in the legal literature on the international law of the sea.", "et": "Kursuse läbinud üliõpilane:\n- teab rahvusvahelise mereõiguse põhimõisteid;\n- mõistab merevööndite õiguslikke raamistikke ja loob nendevahelisi seoseid;\n- oskab lahendada elulisi mereõiguslikke probleeme;\n- teab võrrelda siseriiklikku ja rahvusvahelist mereõigust ning hinnata nendevahelist kooskõla;\n- oskab leida ja seostada rahvusvahelise mereõiguse alast kirjandust."}], "notes": {"et": "Teretulnud on tudengid ka väljaspoolt magistriprogrammi International Law and Human Rights, eeskätt mereõiguse vallas uurimis- või magistritöid kirjutavad üliõpilased."}}, "grading": {"independent_work": {"et": "*\tIndependent work with study materials;\n*\tWriting a paper;\n*\tPresentation of the paper.\nInstructions for writing and presenting the paper are made available through Moodle.\n*       The lectures and other teachings will partly take place online."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Grades\nA\tthe answers to theoretical questions are remarkable; the examination of hypothetical cases is full, logical and creative; the analysis of legal problems is detailed and innovative; all relevant norms and principles have been used; the references to state and court practice are thoughtful and creative; the form is excellent; overall, the treatment of the subject is a remarkable achievement [91-100 points]\nB\tthe answers to theoretical questions are very good with insignificant mistakes or omissions; the examination of hypothetical cases is purposeful and creative; the analysis of legal problems is very good with insignificant deficiencies; necessary norms and principles have been used; the references to state and court practice support the conclusions; the form is very good; overall, the treatment of the subject is logical and smooth [81-90 points]\nC\tthe answers to theoretical questions are good, but there are mistakes or omissions; the examination of hypothetical cases addresses correctly the central issues; the analysis of legal problems is good with some deficiencies concerning specific issues; key norms and principles have been used; the form is good; overall, the coverage of the subject is logical, but there are weaknesses from the point of view of the whole [71-80 points]\nD\tthe answers to theoretical questions are fair, but there are several mistakes or omissions; the examination of hypothetical cases is satisfactory, but focuses only on the central aspects; the analysis of legal problems is satisfactory with deficiencies in most aspects; only basic norms and principles have been used; the form is fair; overall, the treatment of the subject is plausible, but insecure [61-70 points]\nE\tthe answers to theoretical questions are poor with significant mistakes or omissions; the examination of hypothetical cases is weak and limited only to the very basic aspects; the analysis of legal problems is shallow with significant deficiencies is most aspects; only some rudimentary norms and principles have been used; overall, the coverage of the subject suffers of superficial treatment, poor knowledge of law and unsound presentation [51-60 points]"}}], "grade_preconditions": {"et": "*\tParticipation in and preparation for the meetings.\n*\tTimely submission and positive evaluation of the research paper.\n*\tPresentation of the paper."}, "grade_evaluation": {"et": "*\tWritten exam (50 points)\n*\tResearch paper (30 points)\n*\tPresentation (10 points)\n*\tEngagement in classroom discussion and/or online discussion (5 points)\n*       Quizzes (5 points)"}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "1167df81-d116-473b-9a5f-c545a454c5b1", "type": "MOODLE", "code": "P2OG.02.202_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Books\n*\tD. R. Rothwell, A. G. Oude Elferink, K. N. Scott, T. Stephens (eds). The Oxford Handbook of the Law of the Sea. Oxford: OUP 2015.\n*\tD. R. Rothwell, T. Stephens. The International Law of the Sea. 2nd edn, Oxford: Hart Publishing 2016.\nTreaties\n*\tUnited Nations Convention on the Law of the Sea. Montego Bay 10.12.1982, e.i.f. 16.11.1994.", "recommended_materials": "Made available through Moodle."}, "participants": {"lecturers": [{"person_uuid": "1e6ee280-a079-fd44-ae8b-1f843d20449b", "person_name": "Alexander Lott", "structural_unit": {"code": "SVOI02TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI02"}, "is_responsible": true, "is_teaching": true}], "assistants": ["71112e2b-4f12-0cbb-3082-add5be8e965c"]}, "schedule": {"weeks": {"et": "24-34"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Lectures:\nWk , lecture 1: Introduction; sources; actors; history; baselines, \nWk , lecture 2: Internal waters; territorial sea; archipelagic waters; contiguous zone.\nWk , lecture 3: Exclusive economic zone; continental shelf; marine scientific research.\nWk , lecture 4: Navigation; straits; safety zones and offshore infrastructure.\nWk , lecture 5: Maritime boundary delimitation; dispute settlement.\nWk , lecture 6: Maritime security law, maritime law enforcement, and human rights at sea.\nWk, lecture 7: The Area, high seas and nationality of ships.\nWk , lecture 8: Marine environmental protection."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Seminars: \nWk , seminar 1: Exclusive economic zone, continental shelf; marine scientific research.\nWk, seminar 2: Navigation; straits.\nWk, seminar 3: Maritime security law and human rights at sea.\nWk , seminar 4: High seas and the Area and/or marine environmental protection."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Wk , tutorial 1: Presentation and discussion of research papers."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Field trip:\nWk , Port of Tallinn/ministry. (Voluntary)"}}]}, "registration_info": {"audience": {"et": "Master’s students of International Law and Human Rights, but other master’s or bachelor's students are also welcome depending on certain limitations"}, "min_students": 5, "max_students": 25}, "parent_uuid": "1e41325c-6bfa-bad3-1780-e67d77419da3", "parent_code": "P2OG.02.202", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}