{"uuid": "aeb9b622-6f88-b25f-5452-6e6db26dad7e", "code": "P2OG.02.194", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Human Rights Law", "et": "Inimõigused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives a concise overview of the international human rights regime and discusses contemporary problems related to the framework of human rights protection at the international, regional and constitutional level. We consider the similarities and differences between the basic human rights texts and the basic theoretical and legal approaches to protection of human rights, as well as the interplay between international and domestic implementation and protection. Firstly, introductory lectures give a necessary starting point for students to understand the human rights framework, examine the theoretical bases for human rights, their division into generations and hierarchies, general issues of protection and discussion over their universality. Secondly, students become familiarized with different international and regional human rights instruments and protective mechanisms. Thirdly, remaining lectures are dedicated to the analysis of the content and protection of core human rights as well as of related judicial practice. This part of the course involves an in-depth study of human rights issues drawing mainly on material from international and regional human rights law and domestic legal systems. It highlights the key controversies in modern human rights law and the possible range of responses in different jurisdictions. We consider the meaning of particular human rights and their significance in theory and in practice, and the efficacy of the legal institutions designed to protect them. Several specific substantive issues will be studied in depth to illustrate the complex interplay between theory, legal concepts and procedure, and between legal and non-legal sources of protection.", "et": "Õppeaine annab ülevaate rahvusvahelisest inimõiguste kaitsest ning pakub võimalust mõista ja analüüsida inimõiguste kaitsega seotud väljakutseid rahvusvahelisel, regionaalsel ja siseriiklikul tasandil. Teemakäsitlus algab inimõiguste teoreetiliste lähtekohtade analüüsiga ning erinevate  kaitsemehhanismide ning nende omavaheliste seoste tutvustamisega ning jätkub üksikute inimõiguste põhjalikuma käsitlusega, et mõista teooria, õiguslike mõistete ja praktika omavahelisi seoseid ning hinnata inimõiguste kaitse vahendite effektiivsust laiemas rahvusvahelises ja sotsiaalses kontekstis."}, "objectives": [{"en": "To provide students with knowledge and skills to understand and assess contemporary human rights issues and judicial reasoning in the wider international and domestic socio-legal context", "et": "Anda üliõpilastele teadmised ja oskused analüüsida keerulisi/vastuolulisi inimõigustesse puutuvaid küsimusi ning kohtupraktikat laiemas rahvusvahelises ja  iseriiklikus kontekstis"}], "learning_outcomes": [{"en": "The student who has passed the course is able to:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "-- Identify and analyse key issues in the theory and practice of human rights", "et": "-- oskab tuvastada ja analüüsida põhiprobleeme inimõiguste teoorias ja praktikas"}, {"en": "-- Identify and assess contemporary human rights protection mechanisms (international, regional, domestic)", "et": "-- mõistab ja oskab analüüsida rahvusvahelist, regionaalset ja siseriiklikku inimõiguste kaitset"}, {"en": "-- Analyse why there are different approaches and outcomes in different jurisdictions to selected rights", "et": "-- oskab analüüsida, miks on erinevates jurisdiktsioonides erinev lähenemine teatud inimõigustele"}, {"en": "-- Know how selected human rights are implemented and applied in practice", "et": "-- omab häid teadmisi õppeaines käsitletud valitud inimõigustest"}, {"en": "-- Understands the potential and the limitations of law as a tool to address human rights concerns", "et": "-- mõistab nii õiguslike vahendite potentsiaali kui ka piiratust inimõiguste kaitsel"}, {"en": "--solve human rights cases and defend his/her arguments in oral or in writing form", "et": "-oskab lahendada pratilisi kaasuseid ning kaitsta oma argumenteeritud seisukohti nii kõnes kui kirjas"}, {"en": "--write a short analytical paper on human rights", "et": "-oskab kirjutada lühikest analüütilist uurimistööd inimõiguste teemadel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}