{"uuid": "cea1ee15-8ff6-65ca-0d0f-016b5cd9f9b7", "code": "P2OG.04.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Legal English (B2-C1)", "et": "Inglise õiguskeel (B2-C1)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI01", "structural_unit_name": {"en": "General Department", "et": "üldosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI01", "name": {"en": "General Department", "et": "üldosakond"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the course the students are given an overview of the pecularities of legal English. They acquire and consolidate some basic legal terminology as well as develop the basic language skills. An attempt is made to compare English and Estonian law. Different sources of legal English: glossaries digital databases and terminology bases are introduced. The topics covered include: the role of law in society, common law and civil law systems, the differences of civil and criminal procedure, judicial institutions, legal profession, contract law, criminal law, torts, the law of property, family law, the law of succession, business law.", "et": "Antakse ülevaade inglise õiguskeele eripärast, tutvustatakse ja kinnistatakse õigusalast sõnavara, tähtsamaid õigusharusid puudutavat terminoloogiat. Arendatakse kõiki keelelisi osaoskusi, püütakse võrrelda Inglise ja Eesti õigust. Tutvustatakse inglise õiguskeelt puudutavaid materjale, sõnaraamatuid, elektroonilisi allikaid, Eesti õigusaktide tõlkeid, digitaalset terminibaasi.\nLäbitavad teemad: õigus ja ühiskond, common law ja Euroopa  tsiviilõigus, tsiviil- ja kriminaalmenetluse erinevused, kohtusüsteem, õigusalased elukutsed, lepinguõigus, kriminaalõigus, deliktid, asjaõigus, perekonnaõigus, pärimisõigus, äriõigus."}, "objectives": [{"en": "The aim of the course is to introduce basic legal terminology used all over the world concerning the more important branches of law . All basic language skills are developed at the same time so that the students would be able to use all they have acquired actively, especially  in oral speech, to explain the notions and legal problems or participate in discussions. An overview of the pecularities of Legal English, its origin and its different usage in different legal systems (in England, the USA, Estonia) is given. An attempt is made to guide the students to compare Estonian law and English law. Different sources of legal English, digital terminology bases, glossaries, translations of Estonian legal acts into English are introduced.", "et": "Aine eesmärgiks on õpetada üldist õigusalast sõnavara ja tähtsamaid õigusharusid puudutavat terminoloogiat, mida kasutatakse üle maailma ja mis on alguse saanud Inglise õigusest. Arendatakse kõiki keelelisi osaoskusi, et üliõpilane oleks võimeline õpitut aktiivselt kasutama, eriti suulises kõnes, selgitades mõisteid ja erinevaid õigusalaseid probleeme või diskuteerides nende üle. Antakse ülevaade inglise õiguskeele eripärast ning erinevast kasutusest erinevates õigussüsteemides (Inglise, USA, Eesti). Püütakse võrrelda Inglise ja Eesti õigust. Tutvustatakse inglise õiguskeelt puudutavaid materjale, õpikuid, digitaalseid terminibaase, sõnaraamatuid, Eesti õigusaktide tõlkeid."}], "learning_outcomes": [{"en": "A student who has passed the course:\n- has  acquired the prescribed essential vocabulary of legal English by participating in classroom  \n  activities and by using suitable study methods independently \n- understands, translates and summarizes relevant information in different legal texts, both orally \n  and in writing \n-  uses legal terminology and collocations to talk about and explain legal notions, problems, the \n   topics and the branches of law dealt with during the course \n- understands legal terminology and collocations in speech, communicates with others on legal   \n  topics and participates in discussions      \n-  is able to use different sources of legal English: glossaries and digital databases (ESTERM, \n   riigiteataja: translations of Estonian legal acts)\n- understands how Legal English is used differently in different legal systems and is able to analyze \n  one`s own speech accordingly\n- has some basic knowledge of the common law system based on English law and its most \n  important differences and similarities compared to Estonian law", "et": "Kursuse lõpuks peab üliõpilane :\n- omandama ettenähtud osa inglise õiguskeele olulisest sõnavarast, osaledes aktiivselt rühmatöös  klassis ning kasutades sobivaid iseseisvaid õpimeetodeid \n- mõistma, tõlkima, refereerima erinevaid õigusalaseid tekste nii suuliselt kui kirjalikult grammatiliselt korrektses vormis \n- aktiivselt kasutama õpitud sõnavara ja terminoloogiat, et selgitada läbitud õigusalaste teemade ja tähtsamate õigusharude põhisisu, mõisteid ja probleeme\n- mõistma õigusalast suulist kõnet, osalema vestluses või diskussioonis\n- oskama kasutada inglise õiguskeele allikaid: õigusterminoloogia sõnastikke, digitaalseid andmebaase (ESTERM, riigiteataja: Eesti õigusaktide tõlked)\n- mõistma inglise õiguskeele terminoloogia erinevat kasutust erinevates õigussüsteemides ning vastavalt analüüsima oma keelekasutust \n- omama algteadmisi common law süsteemist inglise õiguse näitel, selle tähtsamatest erinevustest ja sarnasustest Eesti õigusega"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}