{"uuid": "6d84b330-4663-ecc1-6f55-3dba71bb63cd", "code": "P2OG.04.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-14T23:27:22", "title": {"en": "French Legal Terminology (B2-C1)", "et": "Prantsuse õiguskeel (B2-C1)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI01", "structural_unit_name": {"en": "General Department", "et": "üldosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI01", "name": {"en": "General Department", "et": "üldosakond"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is meant for these students who already have elementary knowledge in the French language, including the ability to lead basic conversation. The goal is to deepen the knowledge of legal French that would be relevant for the work with legal texts and in international organisations. French as language is required for a successful career in global and especially EU institutions. Students should be aware of the fact that this course concerns legal French and is not a law course. The knowledge of English is beneficial.\n\nThe course takes place online (via Zoom) and is open for all students of the Law School, both from Tartu and Tallinn.", "et": "Kursus on mõeldud neile tudengitele, kel olemas algteadmised prantsuse keelest, sh teatud elementaarne eneseväljendussoskus. Eesmärgiks on prantsuse õiguskeele omandamine ja\nlihvimine, mis on relevantne tööks juriidiliste tekstidega ning rahvusvahelistes institutsioonides. Prantsuse keel on EL-i teise keelena eelduseks edukale karjäärile Euroopa institutsioonides, aga tema oskus annab selge eelise ka globaalsetes rahvusvahelistes institutsioonides töötamiseks. Tudengid peaksid teadvustama, et kursus puudutab prantsuse õiguskeelt, kuid pole samas puhtalt õiguse kursus, vaid on ikkagi eelkõige keelekursus. Kursuse läbimisel tuleb kasuks inglise keele oskus.\n\nKursus toimub online (Zoom'i kaudu) ja on avatud Tartu ja Tallinna Õigusteaduskonna tudengitele."}, "objectives": [{"en": "The main purpose of the course is to get acquainted with French legal terminology and introduce some of the most important concepts in French private and public law and in European Law.", "et": "Kursus seab eesmärgiks prantsuse õiguse terminoloogia (nii kirjalikus kui ka suulises vormis) tundmaõppimise ja tutvustab olulisemaid juriidilisi mõisteid nii Prantsuse era- ja avalikus õiguses kui ka Euroopa õiguses."}], "learning_outcomes": [{"en": "After having participated in the course, the student must be able:", "et": "Kursuse lõpuks peab üliõpilane olema võimeline:"}, {"en": "-      to understand texts and speeches with legal content in French;\t", "et": "-\taru saama juriidilise sisuga olevast tekstist või kõnest prantsuse keeles;"}, {"en": "-      to use correctly French vocabulary linked to branches of law dealt in the course;", "et": "-       kasutama korrektselt loengus käsitletud erinevate õigusharudega seotud prantsuse sõnavara;"}, {"en": "-      to form sentences with legal content in French;", "et": "-       moodustama juriidilise sisuga lauseid prantsuse keeles;"}, {"en": "-      to ascertain whether assertions about legal questions in French or European law are right or wrong and justify his/her answer", "et": "-       määrama, kas teatud prantsuskeelsed tekstid õiguslikes küsimustes on õiged või valed ja põhjendama oma vastust (tundma ära juriidilise sisuga prantsuskeelseid tekste ja otsustama, kas esitatud väide on tõene või väär)"}, {"en": "-      to express orally and in writing in French his/her ideas in legal field;", "et": "-       väljendama suuliselt ja kirjalikult oma mõtteid juriidilises valdkonnas prantsuse keeles."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}