{"uuid": "70e58e5c-f235-4d6e-eba9-6ccaa9223592", "code": "sv-2024-autumn-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-09T11:28:35", "title": {"en": "Intellectual Property", "et": "Intellektuaalne omand"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVOI04", "name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "webpage_url": "https://oi.ut.ee/et/kontakt/eraoiguse-osakond", "address": "Näituse 20-318\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20-318", "zip": "50409", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVOI"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI04", "structural_unit_name": {"en": "Department of Private Law", "et": "eraõiguse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "e6927124-dd4c-7ecb-389b-57eabf7d2b2e", "code": "MJRI.09.027", "title": {"en": "Introduction to Economics", "et": "Sissejuhatus majandusteooriasse"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "2b8a9d95-49c6-0ca3-d31a-58c88af171f5", "code": "P2OG.01.135", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Law of Economics", "et": "Majandusõigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "e28d198c-63cb-ad7e-9ae1-27adfab5aa96", "code": "OIEO.06.093", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-30T14:21:24", "title": {"en": "Law of Economics", "et": "Majandusõigus"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": true, "uuid": "963183d1-e3d7-7e1a-64a1-890f30aaa8af", "code": "OIEO.06.044", "title": {"en": "Law of Obligations, General Part", "et": "Võlaõiguse üldosa"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-11T11:12:25", "alternatives": [{"uuid": "19b89f8b-2caa-713e-3480-9432b4ae7257", "code": "P2OG.01.088", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Law of Obligations, General Part", "et": "Võlaõiguse üldosa"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course will provide an overview of the notion of intellectual property (IP) as well as a discussion on the specific types of IP - copyright, neighbouring rights, industrial property (patent, trademark, utility model and industrial design rights). Case study in the field of intellectual property is carried out.", "et": "Aines tutvustatakse intellektuaalse omandi kui õiguse olemust ja selle kaitse tähtsust, sh käsitledes erinevaid intellektuaalse omandi liike - autoriõigust, naaberõigusi, tööstusomandit (patendi-, kaubamärgi-, kasuliku mudeli ja tööstusdisainilahenduseõigust). Aine raamides käsitletakse intellektuaalse omandi kaitse teoreetilisi lähtepunkte, mis on aluseks vastava kaitse kehtestamisel Eestis. Käsitlemist leiavad ka olulisemad teemakohased välislepingud. Lahendatakse intellektuaalse omandi valdkonda puudutavaid kaasuseid."}, "objectives": [{"en": "Providing theoretical knowledge on the nature of intellectual property rights and the importance of protection: The aim of the course is to introduce learners to the basic concepts, nature, and reasons why this field of law becomes significant in society. This includes the fundamental principles of intellectual property protection and its connection to promoting innovation and creativity.", "et": "\n\nTeoreetiliste teadmiste andmine intellektuaalse omandi õiguse olemusest ja kaitse tähtsusest: Kursuse eesmärgiks on tutvustada õppijatele intellektuaalse omandi õiguse põhimõisteid, olemust ja seda, kuidas ja miks see õigusvaldkond kujuneb ühiskonnas oluliseks. See hõlmab intellektuaalse omandi kaitse aluspõhimõtteid ja selle seost innovatsiooni ning loovuse edendamisega.\n\n"}, {"en": "Addressing the theoretical foundations of intellectual property protection, considering the legal frameworks of Estonia and the EU: The course discusses the theoretical bases for establishing intellectual property protection in Estonia, including how the national legal framework integrates with and relates to EU law.", "et": "Intellektuaalse omandi kaitse teoreetiliste lähtepunktide käsitlemine, arvestades Eesti ja EL-i õigusraamistikku: Kursusel käsitletakse, millised teoreetilised lähtepunktid on intellektuaalse omandi kaitse kehtestamise aluseks Eestis, sealhulgas kuidas rahvuslik õigusraamistik integreerub ja suhestub EL õigusega."}, {"en": "Introducing the key international treaties related to intellectual property protection: The course provides an overview of the main international agreements that influence the framework for intellectual property protection in Estonia, aiding in the understanding of broader international cooperation and the harmonization of norms in this area within the context of Estonian law.", "et": "Olulisemate intellektuaalse omandi kaitset puudutavate välislepingute tutvustamine: Kursusel antakse ülevaade peamistest rahvusvahelistest lepingutest, mis mõjutavad Eesti intellektuaalse omandi kaitse raamistikku, aidates mõista Eesti õiguse kontekstis laiemat rahvusvahelist koostööd ja normide ühtlustamist selles valdkonnas."}, {"en": "Developing practical skills for solving cases in the field of intellectual property: In addition to theoretical foundations, the course focuses on the development of practical skills, offering learners the opportunity to solve specific cases involving various aspects of intellectual property law. This includes legal analysis, identification of problems, and the development of solution strategies in real or hypothetical situations.", "et": "Praktiliste oskuste arendamine intellektuaalse omandi valdkonnas esinevate kaasuste lahendamiseks: Lisaks teoreetilistele alustele keskendub kursus praktiliste oskuste arendamisele, pakkudes õppijatele võimalust lahendada konkreetseid kaasuseid, mis puudutavad intellektuaalse omandi õiguse eri aspekte. See hõlmab õigusanalüüsi, probleemide tuvastamist ja lahendusstrateegiate väljatöötamist reaalsetes või hüpoteetilistes olukordades."}, {"en": "Developing practical skills for drafting contracts in the field of intellectual property: The course aims to enhance practical skills in drafting agreements related to intellectual property, focusing on the creation, negotiation, and implementation of contracts that protect intellectual property rights. This involves understanding the legal requirements, clauses, and provisions essential for effective intellectual property agreements, tailored to the specific needs and contexts of the parties involved.", "et": "Praktiliste oskuste arendamine intellektuaalse omandi valdkonna lepingute koostamiseks: Kursuse eesmärk on parandada praktilisi oskusi, mis on seotud intellektuaalse omandiga seotud lepingute koostamisega, keskendudes lepingute koostamisele, läbirääkimistele ja rakendamisele, mis kaitsevad intellektuaalse omandi õigusi. See hõlmab õiguslike nõuete, klauslite ja sätete mõistmist, mis on olulised tõhusate intellektuaalse omandi lepingute jaoks, mis on kohandatud osapoolte konkreetsete vajaduste ja kontekstidega."}], "learning_outcomes": [{"en": "1. Knowledge of theoretical issues of intellectual property proceeding from the Estonian, and European Union as well as international agreements and legal practice.", "et": "1. Intellektuaalse omandi kui õiguse teoreetiliste aluste tundmine lähtudes Eesti ja Euroopa Liidu õigusaktidest, rahvusvahelistest lepingutest ning õiguspraktikast."}, {"en": "2. Practical skills of intellectual property case study.", "et": "2. Praktilised oskused intellektuaalse omandi valdkonna kaasuste lahendamiseks."}, {"en": "3. Practical skills for drafting contracts in the field of intellectual property.\n\n\n\n\n\n", "et": "3. Praktilised oskused intellektuaalse omandi valdkonna lepingute sõlmimiseks."}], "notes": {}}, "grading": {"independent_work": {"et": "Iga üliõpilane peab töötama läbi konkreetseks loeng-seminariks ja seminariks antud kaasused. Kui see on nõutud, siis tuleb loenguks või seminariks esitada ka nõuetele vastav kodutöö. Vastav info esitatakse Moodle keskkonnas."}, "grade_preconditions": {"et": "Eksamile pääsemise eelduseks on aktiivne osavõtt loeng-seminaridest ja seminaridest ning loeng-seminariks ja seminariks antud nõutele vastavate kodutööde esitamine (eeldusel, et kodutööd on antud). Seminare täiendavad loeng-seminarid, millel on nii seminari kui loengu elemente. Nendest osavõtt on kohustuslik, kuna piiratud arvu seminaride tõttu lahendatakse osad kaasused loeng-seminaris.\n\nAktiivne osavõtt  tähendab, et üliõpilane on põhjalikult töötanud läbi konkreetseks loeng-seminariks ja seminariks antud kaasused ning suudab süsteemselt nende teemal diskuteerida ja argumenteerida.\n\nKui üliõpilane küll osaleb loeng-seminaril ja seminaril, kuid ei ole piisavalt ette valmistunud (ei ole nõutud materjali põhjalikult läbi töötanud) või esitanud kodutööd (eeldusel, et see on ülesandeks tehtud), siis loeng-seminaris või seminaris  osalemine arvesse ei lähe.\n\nÄärmiselt mõjuval põhjusel (õppejõu nõudmisel peab üliõpilane mõjuvat põhjust tõendama) võib puududa ühest seminarist ning kolmest loeng-seminarist. Seda, kas põhjus on mõjuv, otsustab õppejõud. Kui  on antud kodutöö, siis tuleb nõuetele vastav kodutöö esitada.\n\nKui seminarist on puudutud ning õppejõud leiab, et puudumise põhjus on mõjuv, peab üliõpilane vastama eksamil täiendavale küsimusele sõltuvalt puudutud seminari temaatikast. Lisaaega küsimusele vastamiseks ei saa. See tähendab, et lisaküsimus tuleb vastata eksamiks ettenähtud ajalimiidi sees. Kui küsimus ei ole korrektselt vastatud, siis eksamitöö arvesse ei lähe (seda ei hinnata). Kuna seminarist puuduti, siis on lisaküsimusele korrektne vastamine eksami eelduseks.\n\nEksamile ei pääse, kui on puudutud enam kui ühest seminarist (sõltumata põhjusest). Kui on puudutud enam kui neljast loeng-seminarist, otsustab eksamile lubamise õppejõud (lähtudes muuhulgas puudumise põhjustest)."}, "grade_evaluation": {"et": "Hinne kujuneb kirjaliku eksami alusel. Eksam koosneb teoreetilisest osast ja kaasusest. Eksami teoreetiline osa on suletud materjalidega. Kaasuse lahendamiseks võib kasutada Eesti seaduseid paberkandjal. Enne kaasuse lahendamist tuleb ekdamitöö teoreetiline osa ära anda.\n\nTeoreetilised küsimused moodustavad maksimaalselt 40% ning kaasus 60% eksamihindest."}, "debt_elimination": {"et": "Vastavalt ÕKE-le."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "b9046f3c-5179-4908-9e58-706605fb915c", "type": "MOODLE", "code": "P2OG.01.134_SO", "base_url": "undefined", "linked_to_groups": ["0aa7877e-0473-773b-1ae1-d97c0e2fac58", "ccdc4eea-fbf7-a4a9-61cc-34adebd5dd7f"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "0b98b581-d059-d544-54d6-2c25f4728fef", "person_name": "Aleksei Kelli", "structural_unit": {"code": "SVOI04TL", "name": {"en": "Tallinn Office", "et": "Tallinna osakond"}, "address": "Kaarli pst 3\n10119 Tallinn, \nHarjumaa \nEST", "city": "Tallinn", "street": "Kaarli pst 3", "zip": "10119", "level": 4, "academic": false, "supports_continuous_learning": false, "parent_code": "SVOI04"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}, "1. rühm": {"code": "3", "et": "Seminarijuhendaja", "en": "supervisor of seminar"}}}], "study_groups": [{"uuid": "ccdc4eea-fbf7-a4a9-61cc-34adebd5dd7f", "code": "1. rühm", "max_size": 31}, {"uuid": "0aa7877e-0473-773b-1ae1-d97c0e2fac58", "code": "2. rühm", "max_size": 31}]}, "schedule": {"weeks": {"et": "2,7,9,12,15"}}, "registration_info": {"audience": {}, "max_students": 62}, "confirmation_process": {"confirmation_uuid": "56a49cf4-bdd4-5a07-e7e3-172616a9147d", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "db146915-d573-4f06-0209-ce9f67c2721d", "parent_code": "P2OG.01.134", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}