{"uuid": "755d790d-e2f9-da56-f181-57b7e416d75a", "code": "sv-2024-spring-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-11T16:50:49", "title": {"en": "Business English", "et": "Inglise ärikeel"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "language_training": {"language": {"code": "en", "et": "inglise keel", "en": "English"}, "start_level": {"code": "B2", "et": "B2", "en": "B2"}, "end_level": {"code": "C1", "et": "C1", "en": "C1"}}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}, {"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Economy. Describing trends.\nEntrepreneurship and business entities.\nCorporate structure. Topics related to employment and professional life.", "et": "Majandus. Trendide ja tendentside kirjeldamine.\nEttevõtlus. Ettevõtlusvormid.\nEttevõtte struktuur. Tööeluga seotud teemad."}, "objectives": [{"en": "The course aims to improve the learner's knowledge of business English by covering a range of business topics with the essential terminology in order to develop their speaking, reading, writing, and listening skills.", "et": "Õpetusega taotletakse, et õppija omandab põhilise ingliskeelse ärisõnavara nii suuliselt kui kirjalikult arendades erialaainetes vajalikest äri- ja majandusalastest tekstidest arusaamist."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows and is able to use basic business terminology;", "et": "1) teab ja kasutab erialast sõnavara;"}, {"en": "2) communicates on business issues within their language competences;", "et": "2) suhtleb oma pädevuste piires suuliselt ja kirjalikult erialas vajalikel teemadel;"}, {"en": "3) finds and analyses professional texts and assesses them critically;", "et": "3) leiab, analüüsib ja hindab kriitiliselt erialaseid tekste;"}, {"en": "4) uses sources of information including dictionaries, web-based resources and other media;", "et": "4) kasutab tööks vajalikku kirjandust (sõnaraamatud, ajakirjandus, internet jm);"}, {"en": "5) organises information and makes presentations on business-related topics;", "et": "5) süstematiseerib informatsiooni ja esitleb loetut;"}, {"en": "6) reads and expresses their specialised knowledge orally and in writing.", "et": "6) väljendab oma teadmisi nii suuliselt kui ka kirjalikult kasutades erialast sõnavara."}], "notes": {"et": "Sihtrühm EP1"}}, "grading": {"independent_work": {"et": "Jooksvad kodused ja seminarides täidetavad ülesanded (veebipõhised materjalid, praktilised drillülesanded sõnavara kinnistamiseks, enesetestid)."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Erialase artikli läbitöötamine ja vastava töölehe täitmisega. Hindamiskriteeriumid: vormistus, stiil, lauseehitus, õigekiri.\nE - Vormistus vastab üldjoontes töö liigile, kuid esineb tõsiseid puudusi: mõni osa puudu või vales järjekorras, üldmulje korratu. Esinevad stiilivead: kasutatud on argikeelseid sõnu, liiga emotsionaalset või isiklikku väljenduslaadi. Esineb rohkelt õigekirjavigu. Laused edastavad eesmärgipärast infot, kuid on raskesti loetavad ja ei ole omavahel arusaadavalt seotud.\nD - Vormistus vastab töö liigile, kuid esineb vigu (näit. liiga lühike või pikk, struktuur ebaselge, jne). Laused on enamasti sisukad ja valdavalt kergesti loetavad. Esineb asjatuid kordusi ja õigekirjavigu, lausestus primitiivne.\nC - Vormistuses on mõned eksimused, näiteks struktuur puudulik või info esitatud ebaloogilises järjekorras vms. Kasutatud on üldiselt ametlikku stiili, aga esineb mõni õigekirjaviga. Laused on enamjaolt sisukad ja omavahel loogiliselt seotud.\nB - Vormistus on korrektne, esineda võib paar väiksemat eksimust. Kasutatud on ametlikku stiili: kirjutatu on asjalik ja info ühemõtteline. Õigekirjavigu peaaegu ei esine. Laused on sisukad ja omavahel loogiliselt seotud.\nA - Vormistus on korrektne, töölehe täitmine hästi struktureeritud. Kasutatud on ametlikku stiili: kirjutatu on asjalik ja info ühemõtteline. Õigekirjavigu ei esine. Lausestusvigu ei esine. Laused on sisukad ja omavahel loogiliselt seotud."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Etteantud ettevõtte struktuuri reorganiseerimine ettevõtte tegevuse tõhustamise eesmärgil. Rühmatöö (3-4 inimest rühmas)."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Majandusteemalise ettekande tegemine koos graafiku kirjeldusega. Hindamiskriteeriumid suulisele ettekandele: ettekande ülesehitus; sisu; keeleline korrektsus; esitusviis; näitlikustamine.\nE - Ettekandes on eristatavad sissejuhatus, alateemad ja kokkuvõte. Üleminekud ühelt osalt teisele on puudulikud. Ajalimiidist ei ole kinni peetud. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad teemad ei vasta täielikult sissejuhatuses nimetatutele. Kokkuvõtte tegemisel on puudujääke. Esineja kasutab üksikuid ettekandeks sobilikke väljendeid (signposts). Esineb palju keele ja hääldusvigu, kuid lausungite mõte on siiski arusaadav. Esineja tunneb end ebakindlalt, kuid suudab hoida kuulajaskonna tähelepanu ettekande lõpuni. Esineja loeb aeg-ajalt teksti otse slaididelt. Ettekande näitlikustamiseks on kasutatud slaide. Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel esitatu on tekst, mitte märksõnad. Slaididel olevas tekstis on rohkem kui 6 õigekirjaviga.\nD - Ettekandes on eristatavad sissejuhatus, alateemad ja kokkuvõte. Üleminekud ühelt osalt teisele ei ole alati selgelt eristatavad. Ajalimiidist ei ole kinni peetud. Esineja kasutab üksikuid ettekandeks sobilikke väljendeid (signposts). Esineb rohkesti keele ja hääldusvigu, ning lauseehitusvigu, kuid kõne on arusaadav. Ettekande näitlikustamiseks on kasutatud slaide. Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel on lisaks märksõnadele ka pikemat teksti. Slaididel olevas tekstis on 5-6 õigekirjaviga.\nC - Ettekandes on eristatavad sissejuhatus, alateemad ja kokkuvõte. Üleminekud ühelt osalt teisele ei ole alati selgelt eristatavad. On kinni peetud ajalimiidist. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad probleemid vastavad enam-vähem sissejuhatuses nimetatutele. Kokkuvõte on asjakohane. Esineja kasutab mõningaid ettekandeks sobilikke väljendeid (signposts). Esineb keele ja hääldusvigu, ning lauseehitusvigu, kuid kõne on arusaadav. Esineja esineb enesekindlalt, kontrollib oma häält ja kehakeelt, omab kontakti kuulajaskonnaga peaaegu kogu ettekande vältel. Esineja otsib tuge slaididelt ekraanil. Slaididel esitatav materjal on kooskõlas suulise ettekandega.  Slaididel on lisaks märksõnadele ka pikemat teksti. Slaididel olevas tekstis on 3-4 õigekirjaviga.\nB - Ettekande ülesehitus on loogiline ja selle osad (sissejuhatus, alateemad, kokkuvõte) selgelt eristatavad. Üleminekutes ühelt osalt teisele on mõned puudujäägid. On kinni peetud ajalimiidist. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad probleemid vastavad sissejuhatuses nimetatutele. Teema on huvitavalt avatud. Kokkuvõte on asjakohane. Esineja kasutab ettekandeks sobilikku sõnavara ja väljendeid (signposts). Esineb mõningaid keele ja hääldusvigu, kuid kõne on kergesti jälgitav. Esineja esineb enesekindlalt, kontrollib oma häält ja kehakeelt, suudab köita kuulajaskonna tähelepanu ettekande lõpuni. Esineja ei loe slaididelt teksti maha. Ettekande näitlikustamiseks on kasutatud slaide.  Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel on lisaks märksõnadele ka pikemat teksti. Slaididel olevas tekstis on 1-2 õigekirjaviga.\nA - Ettekande ülesehitus on loogiline ja selle osad (sissejuhatus, alateemad, kokkuvõte) selgelt eristatavad. Üleminekud ühelt osalt teisele on selgelt väljendatud. On kinni peetud ajalimiidist. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad probleemid vastavad sissejuhatuses nimetatutele. Teema on huvitavalt avatud. Kokkuvõte on asjakohane. Esineja kasutab ettekandeks sobilikku sõnavara ja väljendeid (signposts). Esineb üksikuid keele ja/või hääldusvigu, kuid kõne on ladus ja kergesti jälgitav. Esineja esineb enesekindlalt, kontrollib oma häält ja kehakeelt. Esineja ei loe slaididelt teksti maha. Slaididel esitatav materjal on kooskõlas suulise ettekandega."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kirjalik test sõnavarale läbivõetud teemade ulatuses. Kirjalik test sisaldab avatud ja valikküsimusi. Maksimaalne punktide arv 50. Positiivne tulemus vähemalt 26 punkti.\nE - 26-30 punkti\nD - 31 -35 punkti\nC - 36-40 punkti\nB - 41 -45 punkti\nA - 46-50 punkti"}}], "grade_preconditions": {"et": "Eksamile pääsemise eeltingimusteks on:\n1. Osalemine seminarides (min 75%).\n2. Kohustuslike kirjalike ja suuliste ülesannete tähtajaline esitamine.\n3. Erialase artikli läbitöötamine ja töölehe täitmine - individuaalne kodutöö.\n4. Ettevõtte ümberstruktureerimise põhjendus ja kirjeldus - grupina kodutöö.\n5. Suulise individuaalse ettekande tegemine valitud majandusteemal koos graafiku kirjeldamisega."}, "grade_evaluation": {"et": "Lõpliku hinde moodustavad sooritatud kohustuslikud ülesanded ja kirjalik test semestri jooksul läbivõetud teemade erialase sõnavara kohta. Hindeliste ülesannete osakaalud lõpphinde kujunemisel on toodud õppeaine Moodle'i kursusel."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": true, "learning_environments": [{"uuid": "d3c3e2b3-ca44-4bd6-825e-cf401cadc05f", "type": "MOODLE", "code": "P2PC.01.158", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "d1860331-8567-1669-77a9-90777e65b256", "person_name": "Karit Jäärats", "structural_unit": {"code": "SVPC04", "name": {"en": "Language Centre", "et": "keelekeskus"}, "phone": "+372 445 0544", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-35"}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}, "min_students": 15}, "parent_uuid": "8348f459-130c-b8e3-4be8-92ce9f4fbd12", "parent_code": "P2PC.01.158", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}