{"uuid": "87fd619b-ab19-8afb-ba7f-9e4dfa019e07", "code": "P2PC.01.164", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T16:24:32", "title": {"en": "Practical Contract Law", "et": "Praktiline lepinguõigus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "c320bec0-f6a3-7b44-b1be-0bc942b2538a", "code": "SVPC.00.056", "title": {"en": "Basics of Law and Public Administration", "et": "Õiguse ja avaliku halduse alused"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T15:41:17"}]}, "overview": {"description": {"en": "The principles of the general and special part of the law of obligations and the relationships between them. Contractual and non-contractual obligations. An overview of different types of contracts and the practical possibilities for using them. The general principles of procedural law underpinning the settlement of civil disputes. The rights and obligations of the parties to the proceedings and the related legal consequences.", "et": "Võlaõiguse üld- ja eriosa põhimõtted ja nendevahelised seosed. Lepingulised ja lepinguvälised kohustused. Ülevaade erinevatest lepinguliikidest ja nende kasutamise praktilistest võimalustest. Tsiviilvaidluste lahendamise aluseks olevad menetlusõiguse üldpõhimõtted. Menetlusosaliste õigused ja kohustused ning menetlusega kaasnevad õiguslikud tagajärjed."}, "objectives": [{"en": "The objective of the course is to provide the student with an understanding of the principles of the general and special part of the law of obligations and the relationships between them as well as the main types of contracts relating to the studied speciality, the possibilities for settling civil disputes and the consequences arising from the compulsory execution of obligations.", "et": "Õpetusega taotletakse, et õppija omandaks arusaamise võlaõiguse üld- ja eriosa põhimõtetest ja nendevahelistest seostest ning õpitava erialaga seonduvatest olulisematest lepinguliikidest, tsiviilvaidluste lahendamise võimalustest ning kohustuste sundtäitmisega seonduvatest tagajärgedest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the main institutes of the law of obligations;", "et": "1) teab võlaõiguse põhiinstituute;"}, {"en": "2) knows the general principles of the law of obligations;", "et": "2) teab võlaõiguse üldpõhimõtteid;"}, {"en": "3) knows the main terms and conditions of the most relevant types of contracts related to the studied speciality and the bases for differentiating between them;", "et": "3) teab õpitava erialaga seonduvate olulisemate lepinguliikide põhitingimusi ja nende eristamise aluseid;"}, {"en": "4) knows the relationships between the general and special part of the law of obligations and the specifics of their application;", "et": "4) teab võlaõiguse üld- ja eriosa seoseid ja kohandamise spetsiifikat;"}, {"en": "5) knows the extrajudicial and judicial possibilities for settling civil disputes;", "et": "5) teab tsiviilvaidluste lahendamise kohtuväliseid ja kohtulikke võimalusi;"}, {"en": "6) knows the main concepts of a civil procedure and enforcement procedure;", "et": "6) teab tsiviilkohtumenetluse ja täitemenetluse põhimõisteid;"}, {"en": "7) knows, how to apply their knowledge at medium level in the settlement of civil disputes, differentiate between contractual and non-contractual relationships of the law of obligations, and analyse the main contracts.", "et": "7) oskab kesktasemel kasutada teadmisi tsiviilvaidluste lahendamisel, eristada lepingulisi ja lepinguväliseid võlaõiguslikke suhteid ning analüüsida olulisemaid lepinguid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}