{"uuid": "b24adba7-6953-5633-e22f-6d1a35002b4b", "code": "P2PC.01.173", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T16:10:30", "title": {"en": "Final Thesis Seminar", "et": "Lõputöö seminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Planning the study related to the graduation thesis. Defining of a research topic, justification of its selection, pointing out the existing problems. Formulation of the theoretical bases for the research, defining the objective, methods, sample, structure, methods for analysing the results, etc. Time schedule, stages, interim reports and intermediate tasks of the research.  Finding research material, conducting the research, and analysing and interpreting the results. Presentation and defence of the intermediate and final results of the research.", "et": "Lõputööga seonduva uuringu kavandamine. Uurimisteema leidmine, selle valiku põhjendamine, eksisteerivate probleemide esiletoomine. Uuringu teoreetiliste aluste formuleerimine, eesmärgi püstitus, meetodid, valim, korraldus, tulemuste analüüsimeetodid jms. Uurimistöö ajakava, etapid, vahearuanded ja -ülesanded. Uurimismaterjali leidmine, uuringut läbiviimine ja tulemuste analüüs ning interpreteerimine. Uurimistöö vahetulemuste ja lõpptulemuse esitamine ja kaitsmine."}, "objectives": [{"en": "The course aims at giving the student the opportunity to deepen their knowledge and skills in the preparation and conduct of independent research. The student shall develop the skills for finding, using and analysing theoretical and empirical material, the skills for selecting and sampling the research methodology and for analysing the results of the research.", "et": "Õpetusega taotletakse, et õppija süvendab teadmisi ja oskusi iseseisva uurimistöö ettevalmistamiseks ning teostamiseks. Õppija arendab teoreetilise ja empiirilise materjali leidmise, kasutamise ja analüüsi oskusi, uurimismetoodika valiku ja valimi moodustamise ning uuringu koostamise, läbiviimise ja uuringutulemuste analüüsi oskusi."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows, how to plan a study, find material, conduct research, and analyse and interpret results;", "et": "1) teab, kuidas kavandada uuringut, leida materjali, uuringut läbi viia ning tulemusi analüüsida ja interpreteerida;"}, {"en": "2) knows, how to define a research topic related to their final thesis and justify the selection of the topic;", "et": "2) teab, kuidas leida oma lõputööga seonduv uurimisteema ning põhjendada selle valikut;"}, {"en": "3) knows, how to formulate the theoretical bases and background of the study, its objectives, methods, sample, structure, methods for analysing the results, etc;", "et": "3) teab, kuidas formuleerida uuringu teoreetilised alused ja taust, eesmärgid, meetodid, valim, korraldus, tulemuste analüüsimeetodid jms;"}, {"en": "4) knows, how to plan their research;", "et": "4) teab, kuidas planeerida uurimistööd;"}, {"en": "5) knows, how to conduct their research and analyse and formulate the research results;", "et": "5) teab, kuidas viia läbi uurimistööd ning analüüsida ja vormistada uurimistulemusi;"}, {"en": "6) knows, how to present and defend the results of their research.", "et": "6) teab, kuidas esitada ja kaitsta oma uurimistöö tulemusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}