{"uuid": "2ce35548-677c-05fc-87a1-01f3b1f750d0", "code": "P2PC.00.676", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-08T09:40:51", "title": {"en": "Design Management", "et": "Disainijuhtimine"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "GENERAL: Use of design in society and in organisation. Historical development of design field. Types of design. Designers' work, roles, skills. Design process, design projects. Design thinking. \nMANAGEMENT: Design in management context. Design management in small and large organisations. Financial management and assessing value added by design. Design management and innovation at organisation's strategic, tactical and operational level. Intellectual property rights. \nPROCESSES: Design audit. Outsourcing design services, design brief. Managing product/service project team. Management of design project and assessment of its results. \nMETHODS: User centric approach. Prototyping. Cooperation with users: co-creation, open innovation etc. Design for all.", "et": "ÜLDTEEMAD: Disaini rakendused ühiskonnas ja ettevõttes. Disaini liigid ja ajalooline areng. Disaineri töö olemus ja rollid. Disaini protsess, projektid ja disaineri oskused. Disainile omane mõtteviis (design thinking). \nJUHTIMINE: Disain juhtimise kontekstis. Disainijuhtimine suur- ja väikeettevõttes. Finantsid ja väärtuse mõõtmine disainis. Disaini suhe brändiloomesse ja innovatsiooni. Disainijuhtimine ja innovatsioon: organisatsiooni strateegilisel, taktikalisel ja operatiivsel tasandil. \nPROTSESS: Disainiaudit. Disainiteenuse sisse ostmine ja lähteülesande koostamine. Koostöö korraldamine teenuse/tootearenduse meeskonnas. Disainiprojekti juhtimine ja hindamine.\nMEETODID: Kasutajakeskne lähenemine. Disainiuuring. Prototüpeerimine. Koostöö kasutajaga (co-creation, open innovation) jt meetodid. Universaaldisain."}, "objectives": [{"en": "Aim of the course is to give knowledge about design management and use of design in innovation process. The course also develops cooperation skills and veski knowledge about different types of design.", "et": "Aine eesmärk on anda teadmised disainiprotsessist ja selle juhtimisest ja disaini kasutamisest innovatsioonis. Lisaks arendab aine koostöö tegemise oskust arendusprojektide raames, ning oskusi töötada erinevate disainidistsipliinidega."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Aine läbimise järel õppija:"}, {"en": "1) knows design related terminology, types of design and cooperation specifics with designers;", "et": "1) teab disainivaldkonna terminoloogiat, disaini tüüpe ja koostöö põhimõtteid disaineritega"}, {"en": "2) knows how to use design in order to develop design based strategy and competitive advantage for an organisation;", "et": "2) teab, kuidas kasutada disaini organisatsiooni strateegia kujundamisel ja konkurentsieelise loomisel;"}, {"en": "3) knows what is design management and how to manage design driven innovation processes;", "et": "3) teab disainijuhtimise olemust ning disainipõhise innivatsiooni protsessi;"}, {"en": "4) knows essence of design driven innovation, design management principles and it use at strategic, tactical and operational level in an organisation;", "et": "4) teab disainijuhtimise põhimõtteid, meetodeid ja disaini rakendus-põhimõtteid organisatiooni strateegilisel, taktikalisel ja operatiivsel tasandil;"}, {"en": "5) can put together a design brief;", "et": "5)  oskab koostada disainiprojekti lähteülesannet (design brief);"}, {"en": "6) can perform design audit;", "et": "6) oskab koostada ettevõtte disainikasutuse auditit;"}, {"en": "7) can assess results of a design project (knows related models and methods).", "et": "7) oskab kaasa rääkida disainiprotsessis ning hinnata disaini-projekti tulemusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}