{"uuid": "6d44cbf5-bf5b-257e-1571-a5e7af7561f6", "code": "sv-2024-spring-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-13T09:58:43", "title": {"en": "English for Professional Purposes", "et": "Erialane inglise keel"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "language_training": {"language": {"code": "en", "et": "inglise keel", "en": "English"}, "start_level": {"code": "B2", "et": "B2", "en": "B2"}, "end_level": {"code": "C1", "et": "C1", "en": "C1"}}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Social work and social worker's competences. Social protection. Social welfare. Risk groups in the society.", "et": "Sotsiaaltöö ja sotsiaaltöötaja pädevused. Sotsiaalkaitse. Hoolekanne. Riskirühmad ühiskonnas."}, "objectives": [{"en": "The course aims to provide students with vocabulary in various fields of social work. Students practise and improve their oral and written language skills,read professional texts and have conversations on related topics. They develop their language skills in general, and acquire and implement value-based, approaches and attitudes required in the service sector.", "et": "Õpetusega taotletakse, et õppija omandab erialast sõnavara käsitletavate teemade piires, harjutab ja kinnistab suulise ja kirjaliku suhtlemise oskusi inglise keeles. Õppija suudab lugeda lihtsamaid erialaseid tekste ning vestelda neil teemadel. Õppija arendab oma üldisi keelepädevusi ning väärtuspõhist ja teeninduslikku mõttelaadi."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) improve their active and passive vocabulary through the reading of adapted or original texts on social work and related fields;", "et": "1) suurendab erinevate adapteeritud või originaaltekstide lugemise kaudu oma aktiivse ja passiivse sõnavara mahtu;"}, {"en": "2) practice and use fundamental vocabulary in social work;", "et": "2) tunneb erinevate sotsiaaltöö valdkondadega seotud põhisõnavara;"}, {"en": "3) converse on topics covered in the course materials;", "et": "3) suudab vestelda põhisõnavara piires käsitletud teemadel;"}, {"en": "4) write texts on topics covered.", "et": "4) suudab koostada lihtsamaid tekste läbitud teemadel."}], "notes": {"et": "Sihtrühm SRSÕ1"}}, "grading": {"independent_work": {"et": "1. Kohustusliku õppematerjali läbitöötamine.\n2. Kirjalike tööde esitamine (juhendid on Moodle-s).\n3. Jooksvad kirjalikud tööd (kokkuvõte ja ametlik kiri).\n4. Suuline ettekanne. \n5. Eksamiks valmistumine."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Hindamiskriteeriumid suulisele ettekandele: ettekande ülesehitus, sisu, keeleline korrektsus, esitusviis, näitlikustamine. \nE - Ettekandes on eristatavad sissejuhatus, alateemad ja kokkuvõte. Üleminekud ühelt osalt teisele on puudulikud. Ajalimiidist ei ole kinni peetud. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad teemad ei vasta täielikult sissejuhatuses nimetatutele. Kokkuvõtte tegemisel on puudujääke. Esineja kasutab üksikuid ettekandes sobilikke väljendeid (signposts). Esineb palju keele ja hääldusvigu, kuid lausungite mõte on siiski arusaadav. Esineja tunneb end ebakindlalt, kuid suudab hoida kuulajaskonna tähelepanu ettekande lõpuni. Esineja loeb aeg-ajalt teksti otse slaididelt. Ettekande näitlikustamiseks on kasutatud slaide. Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel esitatu on tekst, mitte märksõnad. Slaididel olevas tekstis on rohkem kui 6 õigekirjaviga. \nD - Ettekandes on eristatavad sissejuhatus, alateemad ja kokkuvõte. Üleminekud ühelt osalt teisele ei ole alati selged ja eristatavad. Ajalimiidist ei ole kinni peetud. Esineja kasutab üksikuid ettekandeks sobilikke väljendeid (signposts). Esineb rohkesti keele ja hääldusvigu, ning lauseehitusvigu, kuid kõne on arusaadav. Ettekande näitlikustamiseks on kasutatud slaide. Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel on lisaks märksõnadele ka pikemat teksti. slaididel olevas tekstis on 5-6 õigekirjaviga. \nC - Ettekandes on eristatavad sissejuhatus, alateemad ja kokkuvõte. Üleminekud ühelt osalt teisele ei ole alati selgelt eristatavad. On kinni peetud ajalimiidist. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad probleemid vastavad enam-vähem sissejuhatuses nimetatutele. Kokkuvõte on asjakohane. Esineja kasutab mõningaid ettekandeks sobilikke väljendeid (signposts). Esineb keele ning hääldusvigu, ning lauseehitusvigu, kuid kõne on arusaadav. Esineja esineb enesekindlalt, kontrollib on häält ja kehakeelt, omab kontakti kuulajaskonnaga peaaegu kogu ettekande vältel. Esineja otsib tuge slaididelt ja ekraanil. Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel on lisaks märksõnadele ka pikemat teksti. Slaididel olevas tekstis on 3-4 õigekirjaviga. \nB - Ettekande ülesehitus on loogiline ja selle osad (sissejuhatus, alateemad, kokkuvõte) selgelt eristatavad. Üleminekutes ühelt osalt teisele on mõned puudujäägid. On kinni peetud ajalimiidist. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad probleemid vastavad sissejuhatuses nimetatutele. Teema on huvitavalt avatud. Kokkuvõte on asjakohane. Esineja kasutab ettekandeks sobilikku sõnavara ja väljendeid (signposts). Esineb mõningaid keele ja hääldusvigu, kuid kõne on kergesti jälgitav. Esineja esineb enesekindlalt, kontrollib oma häält ja kehakeelt, suudab köita kuulajaskonna tähelepanu ettekande lõpuni. Esineja ei loe slaididelt teksti maha. Ettekande näitlikustamiseks on kasutatud slaide. Slaididel esitatav materjal on kooskõlas suulise ettekandega. Slaididel on lisaks märksõnadele ka pikemat teksti. Slaididel olevas tekstis on 1-2 õigekirjaviga.\nA - Ettekande ülesehitus on loogiline ja selle osad (sissejuhatus, alateemad, kokkuvõte) selgelt eristatavad. Üleminekud ühelt osalt teisele on selgelt väljendatud. On kinni peetud ajalimiidist. Ettekande sisu vastab teemale ja on asjakohane. Käsitletavad probleemid vastavad sissejuhatuses nimetatutele. Teema on huvitavalt avatud. Kokkuvõte on asjakohane. Esineja kasutab ettekandes sobilikku sõnavara ja väljendeid (signposts). Esineb üksikuid keele ja/või hääldusvigu, kuid kõne on ladus ja kergesti jälgitav. Esineja esineb enesekindlalt, kontrollib oma häält ja kehakeelt. Esineja ei loe slaididelt teksti maha. Slaididel esitatav materjal on kooskõlas suulise ettekandega."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kirjalik kokkuvõte ja ametlik kiri.\nE - Vormistus üldjoontes nõuetekohane ja korrektne, analüüsi ja iseseisva tõlgendamise elemendid olemas, teemakäsitus üldjoontes loogiline, ent tekstiseosed lünklikud, mitmed õigekirja- ja sõnastusvead, grammatilised vead, mahupiirangust kõrvalekalle kuni 10%.\nD - Vormistus nõuetekohane ja üldjoontes korrektne, analüüs ja iseseisev tõlgendamine arusaadav, ent kohati ebakindel, teemakäsitus üldjoontes loogiline ja seostatud, mitmed õigekirja-, sõnastus-, grammatilised eksimused, mahupiirangust kõrvalekalle kuni 5%.\nC - Vormistus nõuetekohane ja korrektne, analüütilised seosed ja tõlgendused korralikud, teemakäsitus loogiline, ent terviku seisukohalt täheldatavad mõned nõrgad kohad, 8-10 õigekirja-, sõnastus-, grammatikaviga, peab kinni mahupiirangust.\nB - Vormistus eeskujulik, tekst on terviklikult seostatud, teemakäsitus tervikuna loogiline ja ladus, 4-7 õigekirja-, sõnastus-, grammatikaviga, peab kinni mahupiirangust.\nA - Vormistus eeskujulik, loominguline tekst, analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, teemakäsitus loogiline, tekst tervikuna silmapaistev, 1-3 õigekirja-, sõnastus-, grammatikaviga, peab kinni mahupiirangust."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kirjalik test sõnavarale läbivõetud teemade ulatuses. Hindamiskriteeriumid: kirjalik test sisaldab avatud ja valikküsimusi. Maksimaalne punktide arv 100. \nPositiivne tulemus vähemalt 51 punkti. \nE - 51-60 punkti.\nD - 61-70 punkti.\nC - 71-80 punkti. \nB - 81-90 punkti.\nA - 91-100 punkti."}}], "grade_preconditions": {"et": "Kursus lõpeb kirjaliku auditoorse eksamitööga.\nEksamile pääsemiseks on vajalik:\n1) osavõtt praktikumidest;\n2) jooksvate kirjalike tööde õigeaegne esitamine;\n3) kirjalike tööde vastavus üliõpilaste kirjalike tööde juhendile;\n4) suuline ettekanne;\n5) positiivne hinne iga töö puhul.\nNegatiivse hinde saanud jooksvat tööd saab uuesti esitada üks kord. Hilinemine esitamisel võrdub negatiivse hindega.\nNegatiivse hinde saanud õigeaegselt esitatud jooksvat tööd saab uuesti esitada üks kord.\nTähtajaks esitamata töid saab esitada pärast semestri õppetöö lõppu eksamisessiooni ajal ja õppija pääseb korduseksamile (saades esmalt eksamiprotokolli negatiivse tulemuse)."}, "grade_evaluation": {"et": "Eksamiks on kirjalik kontrolltöö semestri jooksul läbivõetud teemade erialase sõnavara kohta. Lõpliku eksamihinde moodustab 50% sooritatud kohustuslikud kirjalikud ja suulised ülesanded ning 50% kirjalik kontrolltöö."}, "grade_conditions": {"A": {"et": "91-100 p"}, "B": {"et": "81-90 p"}, "C": {"et": "71-80 p"}, "D": {"et": "61-70 p"}, "E": {"et": "51-60 p"}, "F": {"et": "0-50 p"}}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=1545", "is_moodle_connected": true, "learning_environments": [{"uuid": "c68e786f-bd48-43ee-9781-bf19e850a25d", "type": "MOODLE", "code": "P2PC.03.105_SO", "base_url": "undefined", "linked_to_groups": ["39cdc9b2-5449-f4ed-0bc7-34dc282d02f9", "283bc90b-c04a-8f86-85ca-fc75d041567b"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "4117c1bf-e9c9-5ed3-bafc-9895ae07b5bb", "person_name": "Anne-Maarja Tammaru", "structural_unit": {"code": "SVPC04", "name": {"en": "Language Centre", "et": "keelekeskus"}, "phone": "+372 445 0544", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"SRSÕ1-B": {"code": "1", "et": "Lektor", "en": "lecturer"}, "SRSÕ1-A": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "283bc90b-c04a-8f86-85ca-fc75d041567b", "code": "SRSÕ1-A", "max_size": 27}, {"uuid": "39cdc9b2-5449-f4ed-0bc7-34dc282d02f9", "code": "SRSÕ1-B", "max_size": 27}]}, "schedule": {"weeks": {"et": "25-44"}}, "registration_info": {"audience": {}, "min_students": 15, "max_students": 54}, "parent_uuid": "3a07e86c-f7d8-5d5f-397f-d81c2debd720", "parent_code": "P2PC.03.105", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}