{"uuid": "4daac2a6-58e6-acfe-3455-23f2e6451f03", "code": "P2PC.03.057", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T16:15:45", "title": {"en": "Tourism English", "et": "Turismi inglise keel"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "language_training": {"language": {"code": "en", "et": "inglise keel", "en": "English"}, "start_level": {"code": "A1", "et": "A1", "en": "A1"}, "end_level": {"code": "A2", "et": "A2", "en": "A2"}}}, "overview": {"description": {"en": "Travel, tourism and destinastions. The structure of tourism industry. Jobs in tourism. Tour operation. Tourist profile. Travel motives. Special interest holidays. Destinations, geographical and political conditions. Transport. Prices. Practical knowledge. Travel information, visa requirements, vaccinations. Travel insurance. Tourism infrastructure. Accommodation. Catering. Attractions. Sports and activities. Ecotourism, sustainable tourism. Quality in tourism, complaints.", "et": "Reisimine, turism ja sihtkohad. Turismimajanduse struktuur. Turismiga seotud ametid. Reisikorraldus. Kliendiprofiil. Reisimotiivid. Huvireisid. Sihtkohad, geograafilised ja poliitilised tingimused. Transport. Hinnad. Praktilised teadmised. Reisiinformatsioon, viisanõuded, vaktsineerimised. Reisikindlustus. Turismi infrastruktuur. Majutus. Toitlustus. Vaatamisväärsused. Sport ja tegevused. Ökoturism, jätkusuutlik turism. Kvaliteet, kaebused."}, "objectives": [{"en": "The course aims to provide students with vocabulary in various fields of tourism. Students practise and improve their oral and written language skills, read and assess critically professional texts, have conversations on related topics, and compile a job-related letter. They develop their language skills in general, and acquire and implement value-based, approaches and attitudes required in the service sector.", "et": "Õpetusega taotletakse, et õppija omandab ja süvendab turismitööks vajalikke teadmisi enese väljendamiseks inglise keeles. Õppija mõistab tavakõnet ja saab aru turismialastest tekstidest. Oskab oma keelepädevuste piires vestelda turismiga seonduvatel teemadel, leida ja kriitiliselt hinnata informatsiooni ja koostada ametialaseid kirju. Õppija tähtsustab korrektse keelekasutuse vajalikkust ametialases suhtluses."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) shall know and use basic tourism vocabulary;", "et": "1) teab ja kasutab turismialast sõnavara;"}, {"en": "2) is able to communicate on travel and tourism issues within their language competences;", "et": "2) suhtleb oma pädevuste piires suuliselt ja kirjalikult turismiteemadel;"}, {"en": "3) is able to find, analyse and assess critically professional texts;", "et": "3) leiab, analüüsib ja hindab kriitiliselt erialaseid tekste;"}, {"en": "4) is able to read and compose a job-related letter (reply to a letter of inquiry);", "et": "4) loeb ja koostab lihtsamaid ametialaseid kirju (vastuskiri kliendile);"}, {"en": "5) is able to use sources of information including dictionaries, web-based resources and other media;", "et": "5) kasutab tööks vajalikku kirjandust (sõnaraamatud, ajakirjandus, Internet jm);"}, {"en": "6) is able to plan, monitor and assess their learning activities, reflect and assess their development as learners.", "et": "6) planeerib, jälgib ja hindab oma õpitegevust, reflekteerib ja hindab oma arengut õppijana."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}