{"uuid": "229be702-4568-01df-1188-fe83d385192c", "code": "P2PC.00.609", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-10T11:11:27", "title": {"en": "Financial Accounting", "et": "Finantsarvestus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Financial accounting legislation. Basic principles and concepts of accounting. Organisation of accounting in an enterprise. Main accounting procedures for groups of balance sheet items: current assets, fixed assets, liabilities, equity. Calculation of revenues and expenses, sales, transactions and the economic return. Annual reports.", "et": "Finantsarvestust reglementeerivad õigusaktid. Arvestuse põhiprintsiibid ja kontseptsioonid. Arvestuse korraldamine ettevõttes. Finantsarvestuse põhiskeemid arvestusliikide lõikes: käibevara, põhivara, kohustuste ja omakapitali arvestus. Kulude, tulude, müügitehingute ja tulemi arvestus. Majandusaasta aruanne."}, "objectives": [{"en": "After completing the course the student will be aware of the objectives and importance of financial accounting, acquire professional terminology, understand how to apply the financial accounting system, and acquire the knowledge to make the right financial decisions based on accounting, both in business and non-governmental organizations.", "et": "Õppeaine edukal läbimisel tunneb üliõpilane finantsarvestuse korraldamise eesmärke ja tähtsust, omandab erialase terminoloogia, mõistab finantsarvestussüsteemi rakendada ning on omandanud teadmised aruandlusel baseeruvate õigete finantsotsuste vastuvõtmiseks nii äriettevõtetes kui vabaühendustes."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows and understands how to apply legislation regulating financial accounting;", "et": "1) teab finantsarvestust reglementeerivaid õigusakte, oskab neid rakendada;"}, {"en": "2) knows how to determine the status of assets, liabilities and equity;", "et": "2) omab teadmisi vara, kohustuste ja omakapitali seisu kindlakstegemisest;"}, {"en": "3) understands the continuous reporting of economic transactions in order to assess the financial situation of an enterprise;", "et": "3) mõistab majandustehingute pidevat kajastamist hindamaks ettevõtte finantsolukorda;"}, {"en": "4) knows how to prepare financial accounting reports and how to use financial statements in making management decisions;", "et": "4) tunneb finantsarvestuse aruandluse koostamist, oskab finantsaruandeid kasutada juhtimisotsuste tegemiseks;"}, {"en": "5) knows the differences in the management of financial accounting between NGOs and budgetary state agencies.", "et": "5) teab ja tunneb vabaühenduste ja riigieelarveliste asutuste finantsarvestuse korraldamise erisusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}