{"uuid": "ec0f10b8-947a-4838-69ff-e0d285a4ea43", "code": "P2VK.05.142", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Camp Practice", "et": "Laagripraktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Camp Practice section takes place in different organizations and contains:\nObservation. \n1. Student has to get overview about structure of the camp and the camp staff, the work and objectives, work assignment in camps; \n2. describe and analyze the Rules of the camp (both staff and children alike), the camp program\nParticipation of educational activities\n3. educator position in the camp, communicating with children and to create conditions for development;\n4. organize events, daily scheduling; an analysis,\n5. ensuring safety of the events and the daily work with children; opportunities to problem solutions.\nTheoretical section of the practice contains two parts:\n6. Reflection. Analysis of the experience, personal development and contribute to the assessment\n7. Reporting. Systematise gained experience, the analysis and evaluation of feedback.", "et": "Vaatluspraktika\n1.\tlaagri struktuur ja laagripersonal töö ja eesmärgid; kasvataja tööülesanded laagris;\n2.\tkirjeldada ja analüüsida laagri kodukorda (nii personalile kui ka lastele); laagriprogrammi (laagritegevuse eesmärgistatus, päevaplaan, nädalakava planeerimine, tegevuste ettevalmistamine ja teostamine); turvalisuse tagamise võimalused. \nKasvatuspraktika\n3.\tkasvataja tööülesanded laagris;  suhtlemine lastega ja nendele arengutingimuste loomine; \n4.\tsündmuste korraldamine, päevaplaani koostamist; tegevuste analüüs\n5.\tOhutuse tagamine sündmustel ja igapäevases töös lastega; probleemsituatsioonid ja nende lahendusvõimalused. \nPraktikandi eneserefleksioon\n6.\tkogemuste analüüs, oma panuse ja isikliku arengu hindamine\n7.\tsaadud tagasiside analüüs ja hindamine"}, "objectives": [{"en": "The main goal is \n- to get experience in the work camps for children and young people. Participation in the 6-day stationary youth camp or  project  camp as educator,\n- to provide an opportunity to integrate the knowledge gained in theory to practical activities, \n- to develope operational and analytical skills.", "et": "Osakutse kompetentside rakendamine. Kogemuse saamine laagritööst laste ja noortega vaatlus-, kasvatus- ja korraldustöö vormis. Osalemine kasvataja ülesannetes 6-ööpäevases projekt- või noortelaagris, mis annab võimaluse integreerida teoreetiliselt omandatud teadmised praktilisse tegevusse. Iseenda tugevuste ja nõrkuste tundmaõppimine. Tegutsemis- ja analüüsioskuste arendamine."}], "learning_outcomes": [{"en": "The student is able to:\n- detect the structure of the camp activities, purposeful and relevant legislation, \n- create opportunities for healthy and developing recreation for the youth through youth programmes and projects in youth camp,\n- prepare and place of the camp program, according to the situation,\n- carry out joint activities and the activities of small group of children,\n- communicate in everyday live camp activities with children and other team members, \n- understand their important role as educator of  youthwork\n- analyze their work in camp in different situations and learn from it.", "et": "Praktika läbinud üliõpilane \noskab \n- märgata laagritegevuste struktuuri, eesmärgipärasust ja vastavust seadusandlusele, \n- koostada ja kohanada laagriprogrammi vastavalt olukorrale (laagri ja keskkonna spetsiifika, ilmastik, laste vanuse ja käitumise eripärad), \n- viia läbi ühistegevusi ja tegevusi väikese (kuni 24in.) laste/noorte grupiga,\n- suhelda laagri igapäevaelus ja muudes ühistegevustes laagrilistega ja meeskonna liikmetega,\n- hinnata laagrisituatsioonist tulenevaid ohte ja neid ennetada,\n- mõistab enda kui kasvataja olulist rolli laagrisituatsioonis;\n- suudab analüüsida oma tugevusi ja nõrkus ning oma tööd laagrisistuatsioonis ja sellest õppida."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}