{"uuid": "6cba2d30-ad85-98d6-7a1b-12f45f0a2494", "code": "P2VK.01.264", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Paper", "et": "Lõputöö"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "da248101-70d5-cbd1-637b-9c258383f907", "code": "P2VK.09.015", "title": {"en": "Seminar Paper", "et": "Seminaritöö"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Graduation paper in the curriculum of Estonian Native Crafts is creative-practical or applied-theoretical.\nCreative-practical graduation paper comprises two parts:\n1) practical part, that constitutes\n- planning and designing a building or its clearly outlined part or another specialized work; \n- independent or teamwork production of copy/reconstruction of a historical building or its clearly outlined part; or producing it as a part of larger professionally managed project;\n- preparing and completing a specialized design;\n2) written part, which is explanatory, documenting, analyzing and reasoning writing the main aim of which is to make the information and experience related to the practical part of the paper perceivable, recordable, and systematize it; the graduation paper contains, in addition to the textual part, visual materials (sketches, plans, drawings, designs, schema, photos, videos, multimedia, etc.).\nApplied-theoretical graduation paper is an independent research paper at the end of one's studies in the course of which the students analyze some specialty-related issue and/or look for solutions to it; or, a specialized handbook, study-methodological material is created, developed, and specific technique or technological process, methodology, technical solution or invention is described systematically.\nDepending on the nature of each specific paper and the field of specialization for the student, the weight of theoretical and practical, design and direct physical completion, textual and visual may vary within the limits set by the graduation paper statute.", "et": "Lõputöö on pärandtehnoloogia erialadel loov-praktiline või teoreetilis-rakenduslik.\nLoov-praktiline lõputöö koosneb kahest osast:\n1) praktiline osa, mis võib seisneda: \n-erialase projekti ettevalmistamises ja läbiviimises;\n-ehitise või selle selgelt piiritletud osa või muu erialase teose kavandamises ja teostamises; \n-ajaloolise hoone või selle selgelt piiritletud osa koopia/rekonstruktsiooni valmistamises;\n-etnograafilisest ainesest inspireeritud tekstiileseme või kollektsiooni kavandamises ja valmistamises;\n-etnograafilise tekstiileseme rekonstruktsioon (tellimusetööna mõnele muuseumile).\n2) kirjalik osa, mis on selgitav, dokumenteeriv, analüüsiv ja põhjendav kirjutis, mille põhieesmärgiks on talletada lõputöö praktilise osaga seonduvat teavet ja kogemusi tunnetatavas ja süstematiseeritud vormis; peale tekstilise osa sisaldab lõputöö asjakohaseid visualiseerivaid materjale (visandid, kavandid, joonised, plaanid, skeemid, fotod, videod, multimeedia vms).\nTeoreetilis-rakenduslik lõputöö on stuudiumi lõpetav iseseisev uurimustöö, mille käigus analüüsitakse mõnd erialast probleemi ja/või otsitakse sellele lahendust, luuakse erialane käsiraamat, õppe-metoodiline materjal, töötatakse välja ja kirjeldatakse süsteemselt tehnilist lahendust, protsessi või leiutist.\nSõltuvalt konkreetse lõputöö iseloomust ja üliõpilase spetsialiseerumisvalikust võib teoreetilise ja praktilise, kavandamise ja vahetu füüsilise teostuse, tekstilise ja visualiseeriva osakaal lõputöö statuudiga määratud raamides vahelduda.\nLõputöö võib põhjendatud juhtudel valmida ka meeskonnatööna, kuid siis peab iga kaitsja panustama nii praktilise kui kirjaliku osa valmimisse ja mahulised nõuded lõputööle kasvavad proportsioonis meeskonnaliikmete arvuga. Meeskonnatöö või suurema projekti osana valminud lõputöö puhul peab üliõpilase individuaalne panus lõppsaadusse olema kirjalikus osas selgelt välja toodud."}, "objectives": [{"en": "The general goal of the graduation paper is that the students finalize and reinforce the general and specific skills as well as knowledge that they acquired during their studies, and learn to apply these skills to solving specialty-related issues.", "et": "Pärandtehnoloogia õppekaval kaitstava lõputöö üldeesmärk on, et üliõpilane viimistleb ja kinnistab stuudiumi jooksul omandatud üld- ja erioskusi ja -teadmisi ning õpib neid rakendama erialaste probleemide lahendamisel."}], "learning_outcomes": [{"en": "The graduation paper aims that upon the defense of the paper the students:", "et": "Lõputöö edukalt kaitsnud üliõpilane"}, {"en": "- can establish a creative-practical or research goal;", "et": "-oskab püstitada loov-praktilist ja/või uurimiseesmärki;"}, {"en": "- can find and select appropriate and sufficient resources for their creative-practical development or theoretical research;", "et": "-suudab leida ja välja valida teema loov-praktiliseks arendamiseks või teoreetiliseks uurimiseks sobilikud ja piisavad allikad;"}, {"en": "- can systematize, process and interpret the collected material;", "et": "-oskab kogutud materjali süstematiseerida, töödelda ja tõlgendada;"}, {"en": "- can plan and carry out a voluminous creative-practical or research paper;", "et": "-oskab mahukat loov-praktilist või uurimistööd kavandada ja läbi viia;"}, {"en": "- chooses optimum technical-organizational means or research methods for a specific creative-practical or research paper;", "et": "-valib konkreetseks loov-praktiliseks või uurimistööks optimaalsed tehnilis-korralduslikud võtted või uurimismeetodid;"}, {"en": "- master the creative and technical traditions of and relevant theoretical approaches to the chosen field;", "et": "-valdab valitud ainevaldkonna loomingulist ja tehnilist traditsiooni ning vastavaid teoreetilisi käsitlusi;"}, {"en": "- can create a synthesis of application and development proposals and draw relevant conclusions on the basis of research results;", "et": "-oskab sünteesida rakendus- ja arendusettepanekuid ning teha uurimistulemuste põhjal asjakohaseid järeldusi;"}, {"en": "- can express their ideas appropriately in written and spoken language as well as visually;", "et": "-oskab väljendada oma mõtteid korrektselt nii kõnes, kirjas kui visuaalselt;"}, {"en": "- can present the results of their paper, and participate in an argumented discussion on the issues related to their paper.", "et": "-oskab oma töö tulemusi esitleda ja sellega seonduvatel teemadel argumenteeritult väidelda."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}