{"uuid": "c2cdc7c6-c844-8957-e43c-d446f05f8b14", "code": "P2VK.05.334", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Safety of Adventure Activities", "et": "Seiklustegevuste turvalisus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Objective and subjective security and safety of adventure activities. Physical security - environment, equipment and activities. Psychological security. Emergency in critical situations. Make acquaintance with the Estonian Rescue Team and its functions. Risk analysis. Teamwork", "et": "Teemad: Turvalisuse tagamine seiklustegevuste käigus. Objektiivne ja subjektiivne turvalisus. Füüsiline turvalisus (keskkond, varustus, tegevused). Psühhiline turvalisus.\r\nKriisisituatsioonide esmaabi andmine. Tutvumine Eesti Päästeameti ja -keskuste tööga. Riskianalüüs. Rühmatöö."}, "objectives": [{"en": "The main goal is to introduce the physical and safety aspects of the adventure activities, to prevent risk and use first aid; To give an overview of adventure activities in nature- social- and cultural environment, also knowledges of group process; to introduce search and resque simulations in adventure and life.", "et": "Tutvustada füüsilise ja psühhilise turvalisuse aspekte seiklustegevuste läbiviimisel. Sh ohtude ennetamine ja esmaabi; grupiprotsessi tundmine; riskianalüüs; varustuse turvaline kasutamine; keskkonnaga seotud ohud; päästetööd (search and resque); päästetööde korraldamine Eestis; info liikumine ja kommunikatsioon."}], "learning_outcomes": [{"en": "The student is able to:\r\nto give first aid to the journey and adventure trails,\r\nto organize the search and rescue operations during adventure simulation in different seasons, \r\nto assess and analyze the activities of the group, to to recognize different phases of the group development. \r\nKnows basic how to use equipment and keep the adventure.", "et": "Kursuse läbinu oskab anda esmaabi matkal ja seiklusradadel. Korraldada otsimis- ja päästetöö simulatsioonimänge seikluskasvatuslike tegevuste käigus sise- ja välismaastikul erinevatel aastaaegadel.  Oskab eristada erinevaid grupiarengu faase. On suuteline hindama ja analüüsima grupi tegevust. Oskab kasutada ja hoida seiklusvarustus."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}