{"uuid": "54a77db0-ee3d-11e0-cac2-28276354a050", "code": "P2VK.01.216", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Geotechnical Engineering", "et": "Geotehnika ja ehitusgeoloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "8aab406b-1753-2638-8ff5-1ad682dc929f", "code": "P2VK.01.107", "title": {"en": "Mathematics", "et": "Matemaatika"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Soil types and Engineering Geological division of Estonia into regions. Soils and their types. Composition of soil. Characteristics of soil: bulk density, water ratio, void ratio, compression rate, plastic limit, liquid limit. Mechanical characteristics of soil: rigidity, settlements, strength properties.\nGeotechnical design principles: limiting states, settlements, surface water.\nFoundations: shallow foundations, their support limit state, determining the measures for footing, service limit state, pole foundations, their types, the bearing capacity of poles, support walls, their work principles, design principles, hydro isolation.", "et": "Pinnaseliigid ja Eesti ehitusgeoloogiline rajoneerimine. Pinnased, nende liigid. Pinnaste koostis. Pinnaste tunnusomadused: mahumass, veesisaldus, poorsustegur, tihendusaste, plastsuspiir, voolavuspiir. Pinnase mehaanilised omadused: jäikus, tugevusomadused.\nGeotehnilise projekteerimise põhimõtted: piirseisundid, vajumid, pinnasevesi.\nVundamendid: madalvundamendid, nende kandepiirseisund, vundamenditalla mõõtmete määramine, kasutuspiirseisund, vaivundamendid, nende eri liigid, vaiade kandevõime, tugiseinad, nende tööpõhimõtted, projekteerimise põhimõtted, hüdroisolatsioon."}, "objectives": [{"en": "Provide general knowledge of Estonian structural geological conditions, of the foundation usage and design principles.", "et": "Anda üldised teadmised Eesti ehitusgeoloogilistest tingimustest, vundamentide kasutusaladest ja projekteerimise põhimõtetest."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:", "et": "Kursuse edukalt läbinud üliõpilane"}, {"en": "-\tcan classify soil according to external characteristics;", "et": "-\toskab liigitada pinnaseid väliste tunnuste järgi;"}, {"en": "-\tknow major physical features of different types of soil and their identification methods;", "et": "-\ttunneb pinnaste põhilisi füüsikalisi omadusi ja nende määramise meetodeid;"}, {"en": "-\tcan assess the general suitability of subsoil for foundation base;", "et": "-\toskab hinnata aluspinnase üldist sobivust vundamendi aluseks;"}, {"en": "-\tcan approximately determine the measures of simpler foundations;", "et": "-\toskab ligikaudu määrata lihtsamate vundamentide mõõtmeid;"}, {"en": "-\tunderstand the functioning principle of support walls;", "et": "-\tsaab aru tugiseinte tööpõhimõttest;"}, {"en": "-\tcan, in a simpler case, dimension support walls;", "et": "-\toskab lihtsamal juhul tugiseina dimensioneerida;"}, {"en": "-\tunderstand the impact moisture and ground water have on the foundation both during building and exploitation;", "et": "-\tsaab aru niiskuse ja pinnasevee mõjust vundamentidele nii ehitamise kui ekspluatatsiooni kestel;"}, {"en": "-\tcan, if necessary, solve problems related to ground water and moisture.", "et": "-\toskab põhimõtteliselt lahendada pinnasevee ja niiskusega seotud probleeme."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}