{"uuid": "7d421b4b-f5c5-5991-6e29-603c32471d23", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-06-18T10:28:03", "title": {"en": "History of Estonian Metalwork", "et": "Eesti ajalooline metallehistöö"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "An overview of ancient toreutic and archeological findings in Estonia; an introduction to the traditions of guild crafts , analysis of the work and products of local workshops. An overview of ethnographic  decorations, the history of alchemy, traditions related to metal from  mysticism to science history.", "et": "Antakse ülevaade Eesti aladelt leitud muinasaegsest metallehistööst ja arheoloogilistest leidudest. Tutvustatakse tsunftikäsitöö traditsioone ja analüüsitakse kohalike töökodade töökorraldust ja tooteid. Antakse ülevaade etnograafilistest ehetest.\nAntakse ülevaade alkeemia ajaloost, tutvustatakse metallidega seotud traditsioone müstikast teadusajalooni."}, "objectives": [{"en": "To introduce archaeological findings  from Estonia, guild handicraft, ethnographic ornaments and the history of alchemy as related to metals.", "et": "Tutvustada Eesti aladelt leitud arheoloogilisi leide, tsunftikäsitööd, etnograafilisi ehteid ja metallidega seotud alkeemia ajalugu."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "Upon successful completion of  the course, students should: have an overview of the  ancient toreutics and archaeological findings in Estonia;  be able to analyse guild craft; know the differences  in the making of ethnographic decorations during different periods.", "et": "Aine edukal läbimisel üliõpilane omab ülevaadet Eesti aladelt leitud muinasaegsest metallehistööst ja arheoloogilistest leidudest; oskab analüüsida tsunftikäsitööd; tunneb etnograafiliste ehete valmistamise perioodide erinevusi."}], "notes": {"et": "Eksam toimub tunniplaanis märgitud päeval ja hindest antakse teada samal päeval.\n\nThe exam takes place on the day indicated in the lesson plan and the grade is announced on the same day."}}, "grading": {"independent_work": {"et": "Ettekanne seminaris (ca 15 min pikkune), teemad jagatakse esimeses loengus.\n\nPresentation at the seminar (approx. 15 min), topics will be shared in the first lecture."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "A ehk \"suurepärane\"- ainekava mahust on omandatud 100%. Üliõpilane on tundides aktiivselt osalenud ja näidanud välja motiveeritud suhtumist. Kõik etteantud tööd on sooritatud ja tulemus silmapaistvalt hea. Üliõpilane suudab ka iseseisvalt töötada.\nB ehk \"väga hea\"- ainekava mahust on omandatud 90%. Üliõpilane on tundides aktiivselt osalenud ja näidanud välja motiveeritud suhtumist. Kõik etteantud tööd on sooritatud ja kvaliteet korralik. Suudab vajadusel ka iseseisvalt tunnis töötada.\nC ehk \"hea\" - ainekava mahust on omandatud 80%. Üliõpilane on tundides osalenud ja näidanud välja huvitatust. Kõik etteantud tööd on sooritatud, kuigi töödes esineb tehnilisi või kompositsioonilisi vajakajäämisi.\nD ehk \"rahuldav\" - ainekava mahust on omandatud 70%. Üliõpilane on passiivne. Nii etteantud tööde hulgas kui ka selle teostamise korrektsuses esineb ilmselgeid puudujääke.\nE ehk \"kasin\" - ainekava mahust on omandatud 60%. Üliõpilane on passiivne. \nF ehk \"puudulik\" - üliõpilane on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel või on puudunud (enamustest) tundidest.\n\nA or \"excellent\" - 100% of the volume of the syllabus has been acquired. The student has actively participated in the lessons and shown a motivated attitude. All the given work has been done and the result is outstandingly good. The student is also able to work independently.\nB or \"very good\" - 90% of the volume of the syllabus has been acquired. The student has actively participated in the lessons and shown a motivated attitude. All the given work has been done and the quality is decent. Can also work independently in class if necessary.\nC or \"good\" - 80% of the volume of the syllabus has been acquired. The student has participated in the lessons and has shown interest. All the given work has been performed, although there are technical or compositional shortcomings in the work.\nD or \"satisfactory\" - 70% of the volume of the syllabus has been acquired. The student is passive. There are obvious shortcomings both among the given works and in the correctness of its execution.\nE or \"scarce\" - 60% of the volume of the syllabus has been acquired. The student is passive.\nF or \"incomplete\" - the student has acquired knowledge and skills below the minimum level or has been absent from (most) lectures."}}], "grade_preconditions": {"et": "Üliõpilane peab osalema 75% loengutes. Seminariettekande esitamine, eksami sooritamine\nSeminariettekanne üliõpilase poolt valitud teemal, soovitatavalt PowerPoint esitlus, pikkus 15 min. Lisaks saata õppejõule (ynno97@ut.ee)  hiljemalt ettekandega esinemise päeval oma esitlus pdf failina. Kes ei saa mõjuval põhjusel esitlust ette kanda, annab sellest eelnevalt õppejõule teada ja saadab esitluse tähtajaks lisaks slaididele ka referaadivormis tekstifail.\n\nThe student must attend 75% of the lectures. Submission of a seminar report, passing an exam\nSeminar presentation on the topic chosen by the student, preferably a PowerPoint presentation, length 15 min. In addition, send your presentation as a pdf file to the lecturer (ynno97@ut.ee) no later than the day of the presentation. If he is unable to give a presentation for a good reason, he / she notifies the lecturer in advance and sends a text file in the form of a report in addition to the slides by the deadline of the presentation."}, "grade_evaluation": {"et": "Koondhinne kujuneb esitluse ja suulise eksami põhjal\n\nThe overall grade is formed on the basis of the presentation and the oral exam"}, "grade_conditions": {"A": {"et": "\"suurepärane\" - silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine"}, "B": {"et": "\"väga hea\" - õpiväljundite saavutamine väga heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused"}, "C": {"et": "\"hea\" - õpiväljundite saavutamine heal tasemel, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemates ja detailsemates teadmistes ja oskustes avaldub ebakindlus ja ebatäpsus"}, "D": {"et": "\"rahuldav\" - õpiväljundite saavutamine piisaval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades, erandlikes olukordades avalduvad puudujäägid ja ebakindlus"}, "E": {"et": "\"kasin\" - olulisemate õpiväljundite saavutamine minimaalselt lubataval tasemel, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisil, erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus"}, "F": {"et": "\"puudulik\" - õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel"}, "mi": {"et": "õppija pole ilmunud suulisele eksamile"}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga\n\nIn agreement with the lecturer"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "ae55229a-e460-4d93-87fd-752b46fce14b", "type": "MOODLE", "code": "P2VK.01.350", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "*\tJana Reidla \"Eesti ehtekultuur muinasajast uusajani\" (2012)\n*\tKaalu Kirme \"Eesti rahvapärased ehted\" (2002)\n*\tKaalu Kirme \"Eesti hõbe\" (2000)", "recommended_materials": "Vastavalt valitud ettekande teemale"}, "participants": {"lecturers": [{"person_uuid": "f6ee7f6b-e62c-35ea-95a5-00537f7f1619", "person_name": "Indrek Ikkonen", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-41"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Eesti ajaloolise metallehistöö uurimisest: kirjandus ja allikad. Eesti metallehistöös kasutatud materjalid, tehnikad. Eesti rahvapäraste ehete liigitus etnoloogias ja arheoloogias, mõisteid. \nTsunftimeistrid ja ehtesepad Eestis. Sepanduse algus Eestis. Sepandus Eestis keskajal.\nSeminariettekannete teemade jagamine.\n\nOn the research of Estonian historical metalwork: literature and sources. Materials and techniques used in Estonian metalwork. Classification of Estonian folk jewelery in ethnology and archeology, concepts.\nMatchmasters and jewelers in Estonia. Start of smithy in Estonia. Blacksmithing in Estonia in the Middle Ages.\nSharing the topics of the seminar presentations."}}, {"course_week": 2, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "Ehete funktsionaalsus ja tähendus. Metallehistöös kasutatud sümbolid ja ornament.\n\nFunctionality and meaning of jewelry. Symbols and ornament used in metalwork."}}, {"course_week": 3, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Eesti metallehistöö pronksiajal (1500-500 eKr); eelrooma rauaajal (500 eKr-50 pKr); rooma rauaajal (50-450 pKr); keskmisel rauaajal (450-850 pKr).\n\nEstonian metalwork in the Bronze Age (1500-500 BC); pre-Roman Iron Age (500 BC-50 BC); Roman Iron Age (50-450 AD); in the Middle Iron Age (450-850 AD)."}}, {"course_week": 4, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {"et": "Eesti metallehistöö nooremal rauaajal (850-1250). \nEesti metallehistöö keskajal: gootika ja renessanss kullassepakunstis.\nSeminariettekanded Tallinna keskaegsest dekoratiivsepisest.\n\nEstonian metal work in the younger Iron Age (850-1250).\nEstonian metalwork in the Middle Ages: Gothic and Renaissance in goldsmithing.\nSeminar presentations on the medieval decorative wrought iron in Tallinn."}}, {"course_week": 5, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {"et": "Eesti ehtekunst keskajal  ja varauusajal 1. osa\nEesti metallehistöö keskajal ja varauusajal: barokk kullassepakunstis. \nSeminariettekanded\n\nEstonian jewelry in the Middle Ages and the Early Modern period Part 1\nEstonian metalwork in the Middle Ages and Early Modern Age: Baroque in goldsmithing.\nSeminar presentations"}}, {"course_week": 6, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {}, "description": {"et": "Eesti ehtekunst keskajal  ja varauusajal 2. osa\nEesti metallehistöö varauusajal ja uusajal: rokokoo ja klassitsism kullassepakunstis. \nEesti metallehistöö uusajal: historitsism kullassepakunstis. \nSeminariettekanded\n\nEstonian jewelry in the Middle Ages and the Early Modern period Part 2\nEstonian metalwork in early modern times: rococo and classicism in goldsmithing.\nEstonian metalwork in modern times: historicism in goldsmithing.\nSeminar presentations"}}, {"course_week": 7, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {}, "description": {"et": "Rahvuslike ehete valmistamise professionaliseerumine, piirkondlikud erinevused 18.-19. saj. Eesti rahvuslikud ehted 20. sajandi alguses. \nSeminariettekanded\n\nProfessionalization of national jewelry making, regional differences 18.-19. saj. Estonian national jewelry at the beginning of the 20th century.\nSeminar presentations"}}, {"course_week": 8, "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 8, "topic": {}, "description": {"et": "Eksam. Aluseks loengud, seminarid ja kohustuslik kirjandus, täpsemad selgitused antakse loengute käigus\n\nExam. Based on lectures, seminars and required literature, more detailed explanations are given in the lecture."}}]}, "registration_info": {"audience": {"et": "RM"}, "min_students": 5, "max_students": 20}, "confirmation_process": {"confirmation_uuid": "99f0796e-2f0a-2899-9aa7-3e0fba102765", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "91b00a0e-57c8-c519-b58a-fcbfd52ffcb5", "parent_code": "P2VK.01.350", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}