{"uuid": "71486899-c8ed-be8e-896e-c0ff72d485d0", "code": "P2VK.05.047", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Cultural Management", "et": "Sissejuhatus kultuurikorraldusse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The subject introduces basic concepts and keywords of arts management, cultural organizations, cultural policy and classification of arts.", "et": "Õppeaine tutvustab kultuurikorralduse, kultuuriorganisatsioonide, kultuuripoliitika ja kunstiliikide mõisteid ja märksõnu."}, "objectives": [{"en": "The objective is to introduce the concepts, framework and subject field of the arts management. The subject gives an overview about the studies, acquaints the history of arts management in Europe, classification of the arts, missions of different cultural organizations, basic concepts of cultural policy, characteristics of cultural events.", "et": "Kursuse eesmärgiks on luua raamistik mõistetest, terminitest ja valdkondadest, millega kultuurikorralduse eriala õppimisel kokku puututakse. \nAine annab sissejuhatava ülevaate kultuurikorralduse ainest, tutvustab Euroopa kultuurikorralduse ajalugu, kunstiliikide jaotust, erinevate kultuurikorralduslike institutsioonide ülesandeid, kultuuripoliitika põhimõisteid, kultuurisündmuse tunnuseid."}], "learning_outcomes": [{"en": "After finishing this course the student:", "et": "Aine läbides üliõpilane:"}, {"en": " - has systematic overview on the key terminology, theoretical principles and key organizations in Estonia in arts management", "et": " - omab süsteemset ülevaadet kultuurikorralduse põhimõistetest, teoreetilistest printsiipidest ja võtmeorganisatsioonidest Eestis;"}, {"en": " - is aware about interdisciplinary connections between different fields of application in arts management (music, visual arts, sports etc.)", "et": " - oskab ära tunda interdistsiplinaarseid seoseid erinevate kultuurikorralduse valdkondade (muusika, kunstid, sport jm) rakendusalades;"}, {"en": " - is aware of actual problems and fields of application in arts management", "et": "tundma eriala aktuaalseid probleeme ja rakendusvõimalusi;"}, {"en": " -  is able to formulate different problems and analyze and evaluate different solutions in arts management", "et": " - oskab sõnastada kultuurikorralduse erialaga seotud probleeme ning analüüsida ja hinnata erinevaid lahendusi;"}, {"en": " -  is able to collect information independently and interpret it critically and creatively using appropriate methods and means", "et": " - oskab kohaseid meetodeid ja vahendeid kasutades iseseisvalt informatsiooni koguda ning seda kriitiliselt ja loovalt tõlgendada;"}, {"en": " - is able to choose and use appropriate methods while solving assignments in arts management, can model and/or evaluate possible consequences based on given information", "et": " - oskab kultuurikorralduse eriala ülesannete lahendamisel etteantud raamides valida ja kasutada sobivaid meetodeid ning etteantud informatsiooni põhjal modelleerida ja/või hinnata võimalikke tagajärgi;"}, {"en": " - shows initiative, responsibility, management and leadership skills in starting up and putting into practice projects in arts management", "et": " - näitab initsiatiivi projektide algatamisel ning vastutustunnet, juhtimis- ja meeskonnatööoskusi nende elluviimisel;"}, {"en": " - in evaluating the role and consequences of her/his field of expertise uses ethical and social aspects.", "et": " - oskab ühiskondlikke ja eetilisi aspekte arvestades hinnata erialase tegevuse rolli ja tagajärgi ühiskonnale;"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}