{"uuid": "0d0b09c4-5c45-5073-fdc5-523e304f9661", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-03T14:20:00", "title": {"en": "Methods for Teaching Crafts", "et": "Käsitöö õpetamise metoodika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode HV", "et": "24/25 K SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 6, "practice": 10, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Developing a study environment that promotes the acquisition of practical skills and creativity. \nOptions for, design and use of appropriate online learning environments, taking into account the learning objectives and the specificities of the target group. The potential of digital tools and their use in teaching practical skills.Choosing learning methods and study materials based on set targets, the age of the students, prior skills and special needs (left-handedness, physical and intellectual disabilities). Preparing all necessary methodological resources to conduct contact learning on any chosen subject. Planning cyclical studies, courses, short-term training and workshops with regard to content and budget. Successful teacher-trainer model. Ways of assessing completed work.", "et": "Käeliste oskuste omandamist ja loomingulist tööd soodustava õppekeskkonna kujundamine. Õppetööks sobivate veebikeskkondade võimalused, nende kujundamine ja kasutamine, arvestades õppele seatud eesmärke ja sihtrühma eripärasid. Digitehnoloogiliste vahendite võimalused ja nende kasutamine käeliste oskuste õpetamisel. Õppemeetodite ja õppematerjalide valik arvestades seatud eesmärke, õppijate vanust, eelnevaid oskusi ja erivajadusi (vasakukäelisus, füüsiline- või intellektipuue). Valitud teemal kontaktõppe läbiviimiseks kõigi vajalike metoodiliste vahendite valmistamine. Perioodilise õppe, kursuste, lühikoolituste ja õpitubade sisuline ja eelarveline planeerimine. Eduka õpetaja-koolitaja mudel. Tehtud tööle hinnangu andmise võimalused."}, "objectives": [{"en": "Acquiring different study methods and practical skills for teaching crafts in different study situations.", "et": "Erinevate õppemeetodite ja praktiliste võtete omandamine käeliste oskuste õpetamiseks erinevates õpisituatsioonides."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:", "et": "Õppeaine läbinud üliõpilane:  "}, {"en": "- evaluates the roll of good mental, social and physical study environment in craft learning process;", "et": "- Väärtustab hea vaimse-, sotsiaalse- ja füüsilise õppekeskkonna rolli käsitöö õppimisel;"}, {"en": "- knows different craft teaching methods;", "et": "- Tunneb erinevaid õppemeetodeid käsitöö õpetamisel;"}, {"en": "- is able to sketch and make samples considerng the number, age and previous skills of the learners;", "et": "- Kavandab ja valmistab töönäidiseid ja abimaterjale lähtudes õppijate arvust,vanusest ja eelnevatest oskustest; "}, {"en": "- is able to set up the working plan and budget of the workshop or course.", "et": "- Koostab koolituse või töötoa sisulise kava, eelarve ja tegevusplaani."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Ühe käsitööoskuse õppe planeerimine kolme erineva õppemeetodi kaudu (sisaldab sihtrühma kirjeldust, ajalist planeeringut ja kolme erineva õppemeetodi abil toimuvat õppetöö kirjeldust koos võimalike probleemide analüüsiga).\n2. 20 parimat näpunäidet iseendale kui käsitööoskuste õpetajale.\nKoolitusprojekt, mis sisaldab:\n- Koolitusteema selgitust\n- Sihtrühma kirjeldust\n- Eesmärke\n- Õpikeskkonna kirjeldust\n- Tegevuskava\n- Õppemeetodite kirjeldust\n- Reflektsiooni korraldust\n- Eelarvet\n- Reklaamteksti ja koolitaja tutvustust\n- nn \"Koolitaja kohvrit\", milles on kõik vajalik koolituse läbiviimiseks: sissejuhatav esitlus, näidistööd, metoodilised näidisvahendid ja materjalid kontaktõppe läbiviimiseks."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Hindamise aluseks on õpiväljundites toodud teadmiste ja oskuste omandamine, mida hinnatakse kaitsmiseks esitatud koolitusprojekti kaudu:\n1.\tKirjalik osa 50% üldhindest\nA - koolituse eesmärgid on sõnastatud selgelt ja on vastavuses valitud sihtrühmaga; koolituse eelarve ja korraldamise tegevuskava on loogiline ja reaalselt läbiviidav; arvestades sihtrühma ja eesmärke on leidlikult valitud õppemeetodid ja reflektsiooni võimalused. Kogu projekt on kirja pandud ja vormistatud korrektselt ja samas haaravalt. \nB - koolituse eesmärgid on sõnastatud selgelt ja on vastavuses valitud sihtrühmaga; koolituse eelarve ja korraldamise tegevuskava on reaalselt läbiviidav; arvestades sihtrühma ja eesmärke on valitud sobivad õppemeetodid ja reflektsiooni võimalused. Kogu projekt on kirja pandud ja vormistatud korrektselt. \nC - koolituse eesmärgid on vastavuses valitud sihtrühmaga; koolituse eelarve ja tegevuskava on üldjoontes reaalselt läbiviidav; arvestades sihtrühma ja eesmärke on valitud sobivad õppemeetodid ja reflektsiooni võimalused. Kogu projekt on kirja pandud ja vormistatud arusaadavalt. \nD - koolituse eesmärgid on vastavuses valitud sihtrühmaga; koolituse eelarve ja tegevuskava on üldjoontes reaalselt läbiviidav; õppemeetodite valikul pole järgitud sihtrühma vanust või õppekeskkonna võimalusi. Projekti kirjaliku osa ülesehitus on ebaloogiline ja see pole hästi jälgitav. \nE - koolituse eesmärgid jäävad ebaselgeks  või pole need vastavuses valitud sihtrühmaga; koolituse eelarve ja korraldamise tegevuskavas esineb olulisi puudusi; õppemeetodite valikul pole järgitud sihtrühma vanust või õppekeskkonna võimalusi. Projektis puuduvad mõned olulised osad.\n\n2. Näidisvahendid ja näidistööd 50% üldhindest\nA - näidisvahendid ja näidistööd on kooskõlas projekti kirjaliku osaga ning kavandatud sihtrühmale sobivalt; need on pilkupüüdvad, huvi äratavad, esteetiliselt teostatud ja korrektselt vormistatud; töönäidistel kajastuvad metoodiliselt kõige keerukamad sõlmpunktid.\nB - näidisvahendid ja näidistööd on kooskõlas projekti kirjaliku osaga ning kavandatud sihtrühmale sobivalt; need on korrektselt teostatud ja vormistatud; töönäidistel kajastuvad metoodiliselt kõige keerukamad sõlmpunktid.\nC - näidisvahendid ja näidistööd on kooskõlas projekti kirjaliku osaga; need on korrektselt teostatud ja vormistatud; töönäidiste valik ei lähtu sõlmpunktide keerukusest.\nD - näidisvahendeid ja töönäidiseid on korrektselt teostatud ja vormistatud, kuid neid on liiga vähe eduka koolituse läbiviimiseks; töönäidiste valik ei lähtu sõlmpunktide keerukusest.\nE - näidisvahendid ja näidistööd ei ole kõik kooskõlas projekti kirjaliku osaga; osa neist ei ole tehtud piisavalt korrektselt või on vormistatud lohakalt; töönäidiste valik ei lähtu sõlmpunktide keerukusest."}}], "grade_preconditions": {"et": "Osalemine seminarides ja praktilistes töödes, esitatud iseseisvad tööd nr 1 ja 2."}, "grade_evaluation": {"et": "Eksamihinne kujuneb esitatud koolitusprojekti kaudu - 50% kirjalik osa ja 50% näidisvahendid ja näidistööd."}, "debt_elimination": {"et": "Tööde esitamisel on üks järeltähtaeg."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "mandatory_materials": "Kidron, Anti 1999. 122 õpetamistarkust.Tallinn: Andras & Mondo", "recommended_materials": "Täiskasvanute koolituse seadus. Riigi Teataja. https://www.riigiteataja.ee/akt/110062015010\n\nLeppik, P. (1992). Nägemismälust, näitlikustamisest ja tehnovahenditest tunnis. Tallinn"}, "participants": {"lecturers": [{"person_uuid": "dfdd9d34-c951-e250-557b-c24e1c48ba26", "person_name": "Ingrid Uus", "structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "0c271e2b-bafb-5bfc-1076-ab91ef49737b", "person_name": "Inna Raud", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": false}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Õppetöö toimub loengute ja seminaride ja praktikumide vormis. \nTeemadeks:\nKäeliste oskuste omandamist ja loomingulist tööd soodustava õppekeskkonna kujundamine.\nÕppetööks sobivate veebikeskkondade tutvustus, eripärad ja võimalused. Ühes valitud veebikeskkonnas käeliste oskuste õppimiseks sobiva õppekeskkonna kujundamine. Digitehnoloogiliste vahendite (dokumendikaamera, nutitelefon) võimaluste kasutamine käeliste oskuste õpetamisel.\nÕppemeetodite ja õppematerjalide valik arvestades seatud eesmärke, õppijate vanust, eelnevaid\noskusi ja erivajadusi (vasakukäelisus, füüsiline- või intellektipuue). Inspireeriva esitluse koostamine, loengu kavandamine käsitööõppes. Valitud teemal kontaktõppe\nläbiviimiseks kõigi vajalike metoodiliste vahendite valmistamine. Perioodilise õppe, kursuste,\nlühikoolituste ja õpitubade sisuline ja eelarveline planeerimine. Eduka õpetaja-koolitaja mudel.\nTehtud tööle hinnangu andmise võimalused."}}]}, "registration_info": {"audience": {"et": "PTT 3"}, "min_students": 5, "max_students": 15}, "confirmation_process": {"confirmation_uuid": "e21aeb28-641b-706b-6f0f-63369fb456b7", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "d5107ac7-162f-6399-761d-acd8afc9a863", "parent_code": "P2VK.01.507", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}