{"uuid": "dbe387a7-6898-d917-d0ea-43f1e616702e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-27T20:27:07", "title": {"en": "Knitting I", "et": "Silmuskudumine I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Casting on the stitches (different ways of casting with one or two colours, swatches);\nmultiple ways of knitting the ribbing and other knit and purl surface patterns, two-coloured knitting (swatches);\ndifferent braids (\"vits\", \"nöör\", swatches);\nmultiple ways of making the heel and finishing the stockings (swatches);\nfinishing tips for the knitted garment;\nknitting of the pair of socks, stockings, leggings or mittens (establishing the design, colour and knitting characteristics typical for the area of ethnographic material, preparing the design, material and tools for the practical work , completing the work)\nassembling methodical material based on swatches and technical descriptions\nNB! Foreign students are expected to:\n*\tHave good manual skills and previous basic knitting experience;\n*\tBe prepared to purchase materials and a few tools.", "et": "Silmuste loomine, (erinevad töövõtted ühe ja kahe värviga silmuste loomiseks, tööproovid); mitmesugused soonikkoed, parempidi-pahempidipinnad, kahevärvilise mustri kudumine, (tööproovid);\n\"vitsad\" ja \"nöörid\", (tööproovid);\nerinevad sokikanna ja -otsa töövõtted (tööproovid);\nKirbukiri ja aasaline sisepind töökinnastel (tööproovid)\nKihnu endine kindaranne (tööproov)\nPaistu punane kindaranne (tööproov)\nNarmaline Audru ja Tõstamaa kindaranne\nkudumite viimistlusvõtted; \nsokkide, sukkade, sääriste või labakinnaste kudumine ja viimistlemine. (valitud etnograafilisele piirkonnale iseloomulike kujundus-, kudumisvõtete ja värviskeemi tuvastamine, praktiliseks tööks vajaliku kavandi vormistamine, sobiva kudumismaterjali ja töövahendite valik, töö teostamine)\ntööproovide ja tehniliste kirjelduste põhjal metoodilise materjali koostamine"}, "objectives": [{"en": "Learning and mastering the principles of pattern colour composition and knitting techniques for producing traditional Estonian knitwear. To develop the ability to design and execute knitwear that is suited to modern times by way of interpreting the tradition.", "et": "Eesti rahvusliku tekstiilipärandisse kuuluvate silmkoeesemete mustri- ja värvikompositsiooni põhimõtete ning tehniliste kudumisvõtete tundmaõppimine ja omandamine. Jõuda traditsiooni interpreteerimise abil oskuseni kavandada ja teostada kaasaega sobivaid silmkoeesemeid.."}], "learning_outcomes": [{"en": "Upon passing the knitting subject, the student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- will, on the basis of observation of museum items and literature, know the regional characteristics, design principles of Estonian footwear and mittens, as well as their context as a part of clothing ensembles.", "et": "- teab muuseumiesemete vaatluse ja kirjanduse põhjal Eesti etnograafiliste jalakatete ning labakinnaste paikkondlikke karakteristikuid, kujundusprintsiipe, nende konteksti rõivakomplekti osana."}, {"en": "- will know the basic techniques for knitting Estonian knitwear and will be able to prepare methodological material based on samples and relevant literature ", "et": "- tunneb Eesti silmkoeliste sokkide, sukkade, sääriste ja labakinnaste kudumise tehnilisi põhivõtteid ning oskab teostatud tööproovidest ja asjakohasest kirjandusest koostada metoodilist materjali "}, {"en": "- will be able, pursuant to the terms of the assignment and on the basis of the regional particularities, to design and technically execute knitwear given by the teacher.", "et": "- oskab vastavalt püstitatud loovülesandele piirkondlikku eripära arvestades kujundada ja tehniliselt teostada etteantud eseme."}], "notes": {}}, "grading": {"independent_work": {"et": "Tööproovide valmistamine, metoodilise materjali koostamine.\nKavandite esitamine praktilise töö tarbeks, materjalide ja töövahendite valik.\nSokkide, sukkade, sääriste või labakinnaste kudumine ja viimistlemine.\n\nKnitting the swatches and assembling the methodical material.\nPresenting the design for the practical work.\nKnitting and finishing the socks, stockings, leggings or mittens."}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Väljundipõhised hindekriteeriumid - hinne kujuneb 2 väljundi pealt.\n\"Tunneb Eesti silmkoeliste jalakatete ja labakinnaste kudumise tehnilisi põhivõtteid ja oskab teostatud tööproovidest ja asjakohasest kirjandusest koostada metoodilist materjali\"\n\"The student knows basic technical methods of knitting Estonian etnographic mittens or footwear and is able to present methodical material based on literature published on the subject and knitted samples\" \nA - silmkoeliste tööproovide tehniline teostus suurepärane: varraste jämeduse ja lõnga omavaheline sobivus väljendub koepinna korrektses tiheduses ja ühtluses (koepind ei ole liiga hõre või liiga tihe) lõppviimistlus laitmatu; metoodiline materjal süsteemne: kirjalik materjal on ülesehituselt selge (kirjanduse kasutamine põhjalik ja süsteemne), tehnoloogilise  materjali esitus on vormistuselt korrektne. \nA - knitted samples are technically perfect: relation between the size of needles and yarn chosen results in the even knitted surface with the correct tensity (not too tight, not too loose), finishing of the samples is sufficient; methodical material is logically constructed and presented correctly\nE - silmkoeliste tööproovide tehniline teostus kasin: valitud on omavahel sobimatud töömaterjalid ja töövahendid, koepind on ebaühtlane, lõppviimistlus puudulik; met. materjal on lünklik  (kirjanduse kasutamine ebapiisav); tehnoloogilise materjali esitus on vormistuselt ebakorrektne  ja ebaesteetiline.\nE - samples are tecnically knitted in poor quality, the materials and tools are incompatible, knitting is uneven, lacking of finishing; methodical material is insufficient, presentation is sloppy.\nÜlejäänud hinded jäävad tugevaima ja nõrgima taseme vahepeale.\nOther marks remain between strongest and weakest levels.\n\n\"Oskab vastavalt püstitatud loovülesandele piirkondlikku eripära arvestades kujundada ja tehniliselt teostada silmkoelised jalakatted või labakindad\"\n\"Student is able to design and make a pair of mittens or footwear accordingly to the creative task proposed, taking into account local differences in ethnographic material\"\nA - töö tase on suurepärane: kujundus ja tehniline teostus laitmatu: koloriit,  kompositsioon ja materjalikasutus põhjendatud ja tasakaalustatud, kudumistihedus funktsionaalne, lõppviimistlus korrektne, piirkondlik eripära selgelt äratuntav. \nA - perfect design, with clear local character, well balanced colour scheme, adequate choice of materials and tools, tensity of knitting functional, correct final finishing, \nE - töö tase on kasin: kujundus ja tehniline teostus mittekvaliteetne; koloriit, kompositsioon ja materjalikasutus ebasobiv ja tasakaalustamata, kudumistihedus ebaühtlane ja vale tihedusega, lõppviimistlus puudulik.\nE - quality of the work is insufficient: design and technical fulfilment are of proor quality, choice of materials and colours are not suitable and out of balance, surface of knitting is uneven and of wrong tensity, final finishing is insufficient.\nÜlejäänud hinded jäävad tugevaima ja nõrgima taseme vahepeale.\nOther marks are between the strongest and weakest levels."}}], "grade_preconditions": {"et": "Teostatud ja viimistletud tööproovid, metoodiline materjal. Viimistletud kavand ja vastavalt ülesandele teostatud põhitöö.\n\nKnitted and finished samples, methodical material. Pair of mittens knitted according to the chosen design."}, "grade_evaluation": {"et": "Tööproovide, metoodilise mapi ja valmiseseme tehniline teostus, esteetiline tase ja viimistletud esitus. Tulemus kujuneb hindamiskomisjoni arutelu tulemusena.\n\nTechnical and esthetical level of samples, methodical material and finished work and presentation."}, "debt_elimination": {"et": "Mitteteostatud esemed valmivad sessiooni lõpus või järgmise alguses toimuvale kordusesitlusele.\n\nThe work not completed is presented for second presentation."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a75b8cee-f73c-4751-aa3e-0966c2195b8e", "type": "MOODLE", "code": "P2VK.01.283_SO", "base_url": "undefined", "linked_to_groups": ["e6de84d0-c647-b185-fbae-3423057ad269", "d16067c5-26b9-39a7-6e7e-59fa5b00cd06"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "2b016d2e-3b5c-fb95-b08a-4375eb31554d", "person_name": "Riina Tomberg", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"A": {"code": "1", "et": "Lektor", "en": "lecturer"}, "B": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "d16067c5-26b9-39a7-6e7e-59fa5b00cd06", "code": "A", "max_size": 10}, {"uuid": "e6de84d0-c647-b185-fbae-3423057ad269", "code": "B", "max_size": 10}]}, "schedule": {"weeks": {"et": "1-20"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Tutvumine eesti etnograafiliste jalakatetega ning labakinnastega kirjanduse, MUIS-i, metoodilise fondi materjalide põhjal.\n\nEstonian traditional knitted footwear and mittens in literature, MUIS, collection of Viljandi Culture Academy Native Crafts department."}, "study_group_codes": ["A", "B"]}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Silmuste loomise erinevad võtted, tööproovid.\nRingkoe tööproovid.\nLabakinda kudumisvõtted.\nErinevate sokikanna kudumise võtete tööproovid.\nKavandite analüüs, teostatava töö valik, materjalide valik.\nSukkade, sääriste, sokkide, labakinnaste kudumisel vajaminevad arvestused.\nTöökäigu analüüs.\nValmiseseme viimistlemine.\n\nDifferent methods of cast-on the stitches. Knitting of samples.\nSamples for circular knitting.\nKnitting techniques for mittens.\nDifferent methods of knitting the sock's heel. Knitting of samples.\nChoosing the practical work. Analyze of sketches, choosing the materials.\nCalculations necessary for knitting stockings, leggings, socks, mittens.\nAnalyze of working process.\nFinishing of the completed object."}, "study_group_codes": ["A", "B"]}]}, "registration_info": {"audience": {"et": "PTT1"}, "max_students": 20}, "confirmation_process": {"confirmation_uuid": "b94ee896-d190-95f3-f2d2-5e782a61191e", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "024ffa9a-09c7-a29a-4912-b4d51a3e0f6a", "parent_code": "P2VK.01.283", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}