{"uuid": "b87788ee-f625-3f3b-8ffa-c800a3c9fd21", "code": "P2VK.01.297", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Museology", "et": "Museoloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Lecture series with thematic lectures in three blocks (theoretical topics, practical topics and practical work) which form a cross-section of everyday museum work and help give a wider perspective on one of the most important preservers of cultural heritage.", "et": "Loengusari koosneb temaatilistest loengutest ning jaguneb kolme plokki (teoreetilised ja praktilised teemad ning praktiline töö), mis moodustavad läbilõike muuseumi igapäevatööst ning annavad laiema kultuurilise ülevaate ühest olulisemast pärandi säilitajast."}, "objectives": [{"en": "To provide an overview of contemporary research topics in museuology, the history of museums, the role of museums and their function in society today; analysis of  collection and  preservation politics;  documentation and description of museal objects.", "et": "Anda ülevaade kaasaegse museoloogia uurimisteemadest, muuseumide ajaloost, muuseumiinstitutsioonide rollist ja nende funktsioneerimisest tänapäeva ühiskonnas ning analüüsida museaalide kogumis- ja säilitamispoliitikat, museaalide dokumenteerimist ja kirjeldamist."}], "learning_outcomes": [{"en": "Upon successful completion of the course,students should:  have an overview of museology and its specifics; be familiar with the main historical developmental trends of museums; know the basics of  documenting and cataloguing museum objects;be able to describe museum objects; be able to find relevant information on the specialty; value cultural heritage.", "et": "Aine edukal läbimisel üliõpilane omab ülevadet museoloogia erialaspetsiifikast; tunneb muuseumiarengu ajaloolisi põhisuundi; omab ülevaadet kaasaegse museoloogia suundadest; teab museaalide dokumenteerimise ja kirjeldamise põhimõtteid; oskab kirjeldada museaale; oskab leida täiendavat valdkonda puudutavat informatsiooni; väärtustab kultuuripärandit."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}