{"uuid": "6bd02882-fd69-790b-84fc-16bd62e2ac7e", "code": "P2VK.01.109", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Forest Biology and Dendrology", "et": "Metsabioloogia ja dendroloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "DENDROLOGY. Groups of woody plants (trees, bushes, lianas). Biology and phenology of woody plants. Impact of environmental factors and distribution of woody plants according to requirements in regard to light, temperature and moisture, as well as  according to height and age. Taxonomic units. The systems of local and the  most important foreign tree species, their morphology, geographical distribution and distribution in culture,their phenology, characteristics and needs, growing and usage.\nFOREST BIOLOGY. Introduction. Estonian forests, composition by species, growth and  age. Changes in forests and forestry during the last 50 years. World and European forest resources.\nThe definition of a forest. The definition of forest stands. Categories of forests. Components of a forest stand. Forestry terminology. Differentiation of trees and  natural thinning of forest stands, and growth classes. \nForests and the environment: forests and light, forests and temperature, forest and water, forests and the atmosphere, forests and the soil. Forests and  the understory. Forest growing description of pure and mixed forest stands. Succession in tree species. Major trends and reasons of  succession. Forest habitat types. Terminology and classification basics (according to E. Lõhmus). Forest protection. Knowing fungi-creating trees and wet rot. Seed, crop, needle, leave and sprout diseases, non-rot trunk diseases. The most typical pests (bark beetles, pine weevils). Game and weather damage in forests.", "et": "DENDROLOOGIA. Puittaimede rühmad (puu, põõsas, liaan). Puittaimede bioloogia ja fenoloogia. Keskkonnategurite mõju ja puittaimede jagunemine valguse, temperatuuri ja niiskuse nõuete ning kõrguse ja vanuse järgi. Taksonoomilised üksused. Kodumaiste ja tähtsamate võõrpuuliikide süstemaatika, morfoloogia, geograafiline levik ja levik kultuuris, fenoloogia, omadused ja nõudlused, kasvatamine ja kasutamine.\nMETSABIOLOOGIA. Sissejuhatus. Eesti metsad, nende liigiline koosseis, juurdekasv, vanus. Muutused metsades ja metsanduses viimase 50 aasta jooksul. Maailma ja Euroopa metsaressurss.\nMetsa mõiste. Puistu mõiste. Metsakategooriad. Puistu koostisosad. Metsanduslikud terminid. Puude diferentseerumine ja puistute isehõrenemine, kasvuklassid. \nMets ja keskkond: mets ja valgus, mets ja temperatuur, mets ja vesi, mets ja atmosfäär, mets ja muld. Mets ja alustaimestik. Puht- ja segapuistute metsakasvatuslik iseloomustus. \nPuuliikide vaheldus. Vahelduse peamised suunad ja põhjused. Metsa kasvukohatüübid. Mõiste ja klassifitseerimise alused (E. Lõhmuse järgi). \nMetsakaitse. Puu- ja puidumädanikku tekitavate seente tundmine. Seemnete, viljade, okaste, lehtede ja võrsete haigused, mittemädanikulised tüvehaigused. Olulisemad putukkahjurid (üraskid, männikärsakad). Uluki- ja ilmastikukahjustused metsas."}, "objectives": [{"en": "The aim of the course is to provide an overview of Estonian and most common alien woody plants as well as on the basics of forest biology.", "et": "Anda ülevaade kodumaistest puistaimedest ja Eestis levinumatest võõrpuistaimedest ning metsabioloogia alustest."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:", "et": "Kursuse edukal läbimisel üliõpilane"}, {"en": "-\tknow and recognize groups of woody plants;", "et": "-      tunneb ja eristab puittaimede rühmi;"}, {"en": "-\tknow the relationships between major environmental factors and the development of woody plants;", "et": "-      tunneb põhiliste keskkonnategurite ja puittaimede arengu vahelisi seosed;"}, {"en": "-\tcan recognize native and major major alien tree and bush species;", "et": "-      oskab looduses ära tunda peamised kodumaised ja tähtsamad võõrmaised puu- ja põõsaliigid;"}, {"en": "-\tknow the particulars of growing and using native and major alien tree species;", "et": "-      tunneb kodumaiste ja tähtsamate võõrpuuliikide kasvatamise ja kasutamise keskseid eripärasid;"}, {"en": "-\tknow the composition of species in Estonian forests;", "et": "-      \ttunneb Eesti metsade liigilist koosseisu;"}, {"en": "-\tknow the basic forest terminology;", "et": "-      \ttunneb metsanduslikke põhimõisteid;"}, {"en": "-\tknow major trends in and reasons for alternation in tree species;", "et": "-      \ttunneb puuliikide vahelduse peamisi suundi ja põhjuseid;"}, {"en": "-\tknow and can name major types of forest habitat;", "et": "-      \ttunneb ja oskab nimetada peamisi metsakasvukohatüüpe;"}, {"en": "-\tknow the general regulations of forest protection, major types of forest damage and causes for forest damage.", "et": "-      \ttunneb metsakaitse üldaluseid, peamisi metsakahjustuste tüüpe ja metsa kahjustajaid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}