{"uuid": "024ffa9a-09c7-a29a-4912-b4d51a3e0f6a", "code": "P2VK.01.283", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Knitting I", "et": "Silmuskudumine I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Casting on the stitches (different ways of casting with one or two colours, swatches);\nmultiple ways of knitting the ribbing and other knit and purl surface patterns, two-coloured knitting (swatches);\ndifferent braids (\"vits\", \"nöör\", swatches);\nmultiple ways of making the heel and finishing the stockings (swatches);\nfinishing tips for the knitted garment;\nknitting of the pair of socks, stockings, leggings or mittens (establishing the design, colour and knitting characteristics typical for the area of ethnographic material, preparing the design, material and tools for the practical work , completing the work)\nassembling methodical material based on swatches and technical descriptions\nNB! Foreign students are expected to:\n*\tHave good manual skills and previous basic knitting experience;\n*\tBe prepared to purchase materials and a few tools.", "et": "Silmuste loomine, (erinevad töövõtted ühe ja kahe värviga silmuste loomiseks, tööproovid); mitmesugused soonikkoed, parempidi-pahempidipinnad, kahevärvilise mustri kudumine, (tööproovid);\n\"vitsad\" ja \"nöörid\", (tööproovid);\nerinevad sokikanna ja -otsa töövõtted (tööproovid);\nKirbukiri ja aasaline sisepind töökinnastel (tööproovid)\nKihnu endine kindaranne (tööproov)\nPaistu punane kindaranne (tööproov)\nNarmaline Audru ja Tõstamaa kindaranne\nkudumite viimistlusvõtted; \nsokkide, sukkade, sääriste või labakinnaste kudumine ja viimistlemine. (valitud etnograafilisele piirkonnale iseloomulike kujundus-, kudumisvõtete ja värviskeemi tuvastamine, praktiliseks tööks vajaliku kavandi vormistamine, sobiva kudumismaterjali ja töövahendite valik, töö teostamine)\ntööproovide ja tehniliste kirjelduste põhjal metoodilise materjali koostamine"}, "objectives": [{"en": "Learning and mastering the principles of pattern colour composition and knitting techniques for producing traditional Estonian knitwear. To develop the ability to design and execute knitwear that is suited to modern times by way of interpreting the tradition.", "et": "Eesti rahvusliku tekstiilipärandisse kuuluvate silmkoeesemete mustri- ja värvikompositsiooni põhimõtete ning tehniliste kudumisvõtete tundmaõppimine ja omandamine. Jõuda traditsiooni interpreteerimise abil oskuseni kavandada ja teostada kaasaega sobivaid silmkoeesemeid.."}], "learning_outcomes": [{"en": "Upon passing the knitting subject, the student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- will, on the basis of observation of museum items and literature, know the regional characteristics, design principles of Estonian footwear and mittens, as well as their context as a part of clothing ensembles.", "et": "- teab muuseumiesemete vaatluse ja kirjanduse põhjal Eesti etnograafiliste jalakatete ning labakinnaste paikkondlikke karakteristikuid, kujundusprintsiipe, nende konteksti rõivakomplekti osana."}, {"en": "- will know the basic techniques for knitting Estonian knitwear and will be able to prepare methodological material based on samples and relevant literature ", "et": "- tunneb Eesti silmkoeliste sokkide, sukkade, sääriste ja labakinnaste kudumise tehnilisi põhivõtteid ning oskab teostatud tööproovidest ja asjakohasest kirjandusest koostada metoodilist materjali "}, {"en": "- will be able, pursuant to the terms of the assignment and on the basis of the regional particularities, to design and technically execute knitwear given by the teacher.", "et": "- oskab vastavalt püstitatud loovülesandele piirkondlikku eripära arvestades kujundada ja tehniliselt teostada etteantud eseme."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}