{"uuid": "91b00a0e-57c8-c519-b58a-fcbfd52ffcb5", "code": "P2VK.01.350", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of Estonian Metalwork", "et": "Eesti ajalooline metallehistöö"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "An overview of ancient toreutic and archeological findings in Estonia; an introduction to the traditions of guild crafts , analysis of the work and products of local workshops. An overview of ethnographic  decorations, the history of alchemy, traditions related to metal from  mysticism to science history.", "et": "Antakse ülevaade Eesti aladelt leitud muinasaegsest metallehistööst ja arheoloogilistest leidudest. Tutvustatakse tsunftikäsitöö traditsioone ja analüüsitakse kohalike töökodade töökorraldust ja tooteid. Antakse ülevaade etnograafilistest ehetest.\nAntakse ülevaade alkeemia ajaloost, tutvustatakse metallidega seotud traditsioone müstikast teadusajalooni."}, "objectives": [{"en": "To introduce archaeological findings  from Estonia, guild handicraft, ethnographic ornaments and the history of alchemy as related to metals.", "et": "Tutvustada Eesti aladelt leitud arheoloogilisi leide, tsunftikäsitööd, etnograafilisi ehteid ja metallidega seotud alkeemia ajalugu."}], "learning_outcomes": [{"en": "Upon successful completion of  the course, students should: have an overview of the  ancient toreutics and archaeological findings in Estonia;  be able to analyse guild craft; know the differences  in the making of ethnographic decorations during different periods.", "et": "Aine edukal läbimisel üliõpilane omab ülevaadet Eesti aladelt leitud muinasaegsest metallehistööst ja arheoloogilistest leidudest; oskab analüüsida tsunftikäsitööd; tunneb etnograafiliste ehete valmistamise perioodide erinevusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}