{"uuid": "cbc3f23b-b56e-1c38-3b8d-67b8ca36ecc3", "code": "P2VK.01.205", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Architectural Composition", "et": "Arhitektuurne kompositsioon"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Architectural dimensional composition basics. Expressing architectural ideas in three dimensions. Forms used in architecture. Room analysis: the part height, shape, colour and lighting  in creating a room; relations between dimensions and details. Light and shade  - using light and shade in architecture on the basis of samples. Natural and artificial light. The use of light in different types of buildings. Light and climate. Material, colour, texture - usage possibilities of different materials, colour and characteristics on the basis of samples. Work on a model: scale, proportion, and material.\nIf possible visiting the Architecture Museum or an archive with a collection of models.", "et": "Arhitektuurse mahulise kompositsiooni alused. Arhitektuurse idee väljendamine ruumiliselt. Arhitektuuris kasutatavad vormid. Ruumianalüüs: kõrguse, vormi, värvi ning valguse osa ruumi loojana; mahu ja detailide vaheline suhe. Valgus ja vari -valguse ja varju kasutusest arhitektuuris näidete varal. Loomulik valgus, tehisvalgus. Valgustuse kasutamine erinevate hoonetüüpide puhul. Valgus ja kliima. Materjal, värv, tekstuur - erinevate materjalide kasutusvõimalused, värvus ja omadused näidete varal. Töö maketiga: mõõtkava, proportsioon, materjal.\n\nVõimalusel Arhitektuurimuuseumi või muu maketikoguga arhiivi külastamine."}, "objectives": [{"en": "Develop the sense of proportion and spatial modeling skills.", "et": "Arendada proportsioonitaju ja ruumilise modelleerimise oskust."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:", "et": "Kursuse edukal läbimisel üliõpilane"}, {"en": "-\tknow the purpose and possibilities of room analysis;", "et": "-\ttunneb ruumianalüüsi otstarvet ja võimalusi;"}, {"en": "-\tknow the role of proportion, form, color and light as the design elements  of creating a room;", "et": "-\ttunneb proportsiooni, vormi, värvi ning valguse osa ruumi loojana;"}, {"en": "-\tperceives proportions;", "et": "-\ttajub proportsioone;"}, {"en": "-\thave an overview of marking techn iques and equipment;", "et": "-\tomab ülevaadet maketeerimistehnikatest ja -vahenditest;"}, {"en": "-\tcan mark simpler spatial objects in their suitable scale and true to material.", "et": "-\toskab maketeerida lihtsamaid ruumilisi objekte kohases mõõtkavas ja materjalitruult."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}