{"uuid": "e996dc27-5285-cc2c-b785-71b00b08909f", "code": "P2VK.01.029", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Specialty Composition I", "et": "Eriala kompositsioon I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Work in composition classes includes designing various textile elements. A selection of these elements is then produced in the specialty practicum.\nIn the first academic year, students work with simple surface design elements, and proceed with more complicated assignments thereafter. The course also includes ensemble assignments, where different textiles must be rendered to an integral whole (spatial design or costume).  Very important also is sifting through the special literature.", "et": "Töö eriala kompositsiooni I semestri tundides seisneb tutvumises kavandamise vahenditega ja nende kasutamisega harjumisega. Tunnid toimuvad praktikumi vormis, mis tähendab seda, et kohapeal tegeletakse püstitatud ülesande lahendamisega kavandamise kujul. \nEsimesel õppesemestril tegeletakse lihtsamate pinnakujunduselementidega, nagu triibud ja triibustikud, teisel semestril ruuduliste pindadega. Tegeletakse ka ansambliülesannetega, kus erinevatest tekstiilidest peab moodustuma tervik ruumis või rõivastuses. \nTutvutakse semestri ülesannete raames erialakirjandusega, etnograafiliste tekstiilide- ja koopiajoonistega, mis on aluseks erialakompositsiooni ülesannete teostamisel."}, "objectives": [{"en": "The name of the specialty reveals that we have selected Estonian ethnographic handicraft heritage as our creative source. The course thus also aims at introducing ethnographic textile archives, characteristic color resonance and ornaments. The emphasis lies on teaching students how to interpret ethnographic heritage on the basis of the acquired skills, and use these skills for creating or teaching handicraft.", "et": "Õppeaine üldeesmärgiks on oskus Eesti etnograafilist pärandit loominguliselt interpreteerida ja kasutada seda tänapäeval käsitööesemete valmistamisel. "}, {"en": "The course aims at developing the students' aesthetic perception and skills (sense of colour, visual rhythm recognition, sense of proportion, technical skills required for preparing designs), which are related to visual self-expression by performing tasks related to different textile compositions.", "et": "Õppeaine eesmärgiks on erialaainetega seotud ülesannete kavandamise kaudu arendada üliõpilase esteetilisi arusaamu ja oskusi end visuaalselt väljendada (värvimeel, visuaalse rütmi tajumine, proportsioonitunne, kavandi tegemisel vajalikud tehnilised oskused)."}], "learning_outcomes": [{"en": "A student gets to know Estonian ethnographic textile tradition (including technology, colouring, ornament) and is able to apply the knowledge in creating new items.", "et": "Aine edukal läbimisel üliõpilane:\n- oskab Eesti ajaloolistele tekstiilidele omast koloriiti ja ornamenti rakendada uute esemete kavandamisel \n- on saavutanud kavandmise tehniliste oskuste algtaseme"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}