{"uuid": "476bff18-6426-cc7e-44e6-b7b1753358fa", "code": "P2VK.01.532", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-27T16:35:42", "title": {"en": "Unique Jewellery", "et": "Unikaalehe"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Introduction to the task. Gathering material from ethnographic sources and analysing it; designing the unique jewellery or set; choosing suitable materials and techniques; preparing the work plan; making and assembling the jewellery parts; analysing the convenience of wearing the piece; finishing the piece, documenting and presenting it.", "et": "Lähteülesande tutvustamine. Etnograafilistest allikatest materjali kogumine ja analüüsimine; unikaalse ehte või ehtekomplekti kavandamine; sobivate ehtematerjalide ja tehnoloogiate valimine; tööplaani koostamine; ehte detailide valmistamine ja monteerimine; kandmismugavuse analüüsimine; töö viimistlemine, dokumenteerimine ja esitlemine"}, "objectives": [{"en": "Using combined techniqus to design and make unique jewellery or a set.", "et": "Kombineeritud tehnikates unikaalehte või ehtekomplekti kavandamine ja valmistamine"}], "learning_outcomes": [{"en": "After successfully completing the course the student is able to make unique jewellery or a set; knows how to gather materials for creating the jewellery, design the jewellery, choose suitable materials and technologies, prepare work process schedule and plan, make the parts of the jewellery and assemble them, finish the jewellery and present it.", "et": "Aine edukal läbimisel oskab üliõpilane valmistada unikaalehet või ehtekomplekti; oskab ehte loomiseks koguda materjali, kavandada ehet, valida sobivad materjalid ja tehnoloogiad, koostada tööprotsessi ajakava ja plaani, valmistada ehte detailid ja need kokku monteerida ja viimistleda, valminud tööd esitleda."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}