{"uuid": "fba4634e-e29d-cf2c-2aae-6713fade18c5", "code": "P2VK.05.389", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Culture Studies", "et": "Eesti kultuurilugu"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Main spheres and concepts:\nThe preconditions and development of Estonian professional culture. The role of education in the professionalisation of culture. Classical types of culture: theater, music, cinema, literature and fine arts. The merging of boundaries between types of culture. New art culture: multimedia and other high-tech possibilities. Cultural policy of democratic and totalitarian society. Commercialisation of culture. Creative industry.", "et": "Peamised mõisted ja valdkonnad:\nEesti professionaalse kultuuri kujunemise eeldused ja areng. Hariduse roll kultuuri professionaliseerumisel. \nKlassikalised kultuuriliigid: teater, muusika, kino, kirjandus ja kujutav kunst. Kultuuriliikide vaheliste piiride segunemine. Uus kunstikultuur: multimeedia ja teised kõrgtehnoloogilised võimalused. Demokraatliku ja totalitaarse ühiskonna kultuuripoliitika. Kultuuri kommertsialiseerumine. Loomemajandus."}, "objectives": [{"en": "The purpose of the course is to introduce Estonian culture development and achievements. The subject expands on development of various culture types and their relationship with different culture paradigms.", "et": "Kursuse eesmärgiks on tutvustada eesti kultuuri arengut ning saavutusi. Aines käsitletakse erinevate kultuuriliikide arenguetappe ja nende seoseid erinevate kultuuriparadigmadega."}], "learning_outcomes": [{"en": "General competences:\nStudents are aware of different concepts and key achievements of Estonian cultural history. \nCompetences:\nIs able to analyse the developments and tendencies of different types of culture.Is able to put cultural terms and facts into use.\nIs able to analyse the background and operating mechanisms of culture-related phenomena.", "et": "Üldised oskused:\n\nÜliõpilane teab Eesti kultuurilooga seonduvaid mõisteid ja olulisemaid saavutusi.\n\nOskused:\nOskab analüüsida erinevate kultuuriliikide arenguid ja suundumusi. Oskab kasutada kulturoloogilisi termineid ja fakte oma erialases töös. Oskab analüüsida kultuurinähtuste taustu ja toimemehhanisme."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}