{"uuid": "621f559e-7ed8-ea4d-d45e-d9ff8708d5f2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-06T16:46:26", "title": {"en": "Supervision Practice", "et": "Juhendamispraktika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 A block mode HV", "et": "24/25 S SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 74, "individual_work": 2, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The practice is divided into two parts.\n1. In cooperation with the teaching staff, the master's student is guided through the seminar or final thesis within a specialty and on the level of applied higher education, or through another larger specialty project from planning stage to defence, or holds a course in their speciality. Another alternative is for students to manage a project outside of the academy, hold a course on the level of further, re- or professional education, etc. \n2. The master's student should review a student's seminar paper or thesis  on the level of applied higher education and within a related specialty. An alternative is to review a professional project outside the academy.", "et": "Praktika võib moodustuda mitmest osast või kui maht on saavutatud esimese või teisega, siis piisab:\n1. Vastutava õppejõuga koostöös juhendab magistrand rakenduskõrgharidusõppe taseme lähedase eriala üliõpilase seminari- või lõputööd või muud mahukat erialaprojekti kavandamisest kaitsmiseni või viib läbi erialakursuse - siinkohal tuleb vastavast soovist varakult märku anda! Võib toimuda oma varasema kodukõrgkoolis ka näiteks!\n2. Alternatiivina võimalik koolivälise professionaalse projekti juhendamine, täiend- või ümber- või kutseõppekursuse, koolituse läbiviimine vms. Kui võimalik, siis õppekava huvides võiks koolitust teha ka mõnes kõrgkoolis, kust võiks meile uusi magistrante võrsuda. \n3. Magistrant retsenseerib rakenduskõrgharidusõppe taseme lähedase eriala üliõpilase seminari- või lõputööd. Alternatiivina võimalik koolivälise professionaalse projekti retsenseerimine."}, "objectives": [{"en": "The aim of the practice is to prepare students through research, educational or creative project for independent development work within their specialty and the schooling of workers.", "et": "Valmistada üliõpilast korraldusliku, uurimusliku, koolitus- või loomeprojekti juhendamise kogemuse abil ette iseseisvaks erialaseks arendustööks ja töötajate väljaõppeks."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the students should", "et": "Aine edukal läbimisel üliõpilane "}, {"en": "1) be able to divide the specialty into research, development, training or creative stages;", "et": "1) oskab liigendada erialast uurimis-, arendus-, koolitus- või loomeprojekti mõõdetavateks etappideks;"}, {"en": "2) be able to carry out a research, development, training or creative project; ", "et": "2) oskab erialast uurimis-, arendus-, koolitus- või loomeprojekti läbi viia;"}, {"en": "3) understand the instructions given to them by the supervisor, as well as their obligations, rights and responsibility;", "et": "3) mõistab juhendaja ülesandeid, kohustusi, õigusi ja vastutust;"}, {"en": "4) be familiar with the academic defence process and be able to contribute to it;  ", "et": "4) valdab akadeemilise kaitsmise protseduuri ja oskab sellesse adekvaatselt panustada;"}, {"en": "5) be able to analyse specialty work and critically evaluate it;", "et": "5) oskab erialaseid töid analüüsida ja kriitiliselt hinnata;"}, {"en": "6) be able to write reviews.", "et": "6) oskab kirjutada retsensiooni."}], "notes": {}}, "grading": {"independent_work": {"et": "Leida vastavalt eelkinnitatud praktikakavale ja juhendajaga kokkkulepitud individuaalplaanile sobiv praktika koht ja tegevus. Viia läbi praktikategevused. Pidada praktikapäevikut. Koostada praktikaaruanne ja esitada see tähtaegselt praktika kaitsmisele."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Hindamisel arvestatakse nii praktika aruannet, juhendaja/ kuraatori hinnangut kui ka kaitsmise protsessi. Hindamiskriteeriumid on järgmised:\n\"A\" - suurepärane\nÜliõpilane viibis praktikal kogu ettenähtud aja, on koostanud praktikabaasist põhjaliku ülevaate ja tegevuse analüüsi, on täitnud järjepidevalt ja põhjalikult praktikapäevikut ning kogunud praktikamappi kogu oma praktilist tegevust iseloomustava materjali. On koostanud objektiivse ja ammendava eneseanalüüsi. Juhendaja poolt antud tagasisside on hinnatud hindega \"A\". Praktikaaruande kaitsmine on põhjalik ja asjakohane, üliõpilane oskab vastata kõigile komisjoni poolt esitatud küsimustele.\n\"B\" - väga hea\nÜliõpilane viibis praktikal vähemalt 90% ettenähtud ajast, on koostanud praktikabaasist põhjaliku ülevaate ja tegevuse analüüsi, on täitnud järjepidevalt ja põhjalikult praktikapäevikut ning kogunud praktikamappi oma praktilist tegevust iseloomustavat materjali. On koostanud objektiivse ja ammendava eneseanalüüsi. Juhendaja poolt antud tagasisside on hinnatud hindega \"A\" või \"B\" Praktikaaruande kaitsmine on põhjalik ja asjakohane, üliõpilane oskab vastata komisjoni poolt esitatud küsimustele. Spetsiifilistele küsimustele vastamisel võib esineda ebatäpsusi.\n\"C\"- hea\nÜliõpilane viibis praktikal vähemalt 80% ettenähtud ajast, on koostanud praktikabaasist ülevaate ja tegevuse analüüsi, on täitnud järjepidevalt praktikapäevikut ning kogunud praktikamappi oma praktilist tegevust iseloomustavat materjali. On koostanud eneseanalüüsi, mis pole piisavalt objektiivne ja ammendav. Juhendaja poolt antud tagasisside on hinnatud hindega \"B\" või \"C\" Praktikaaruande kaitsmine on asjakohane, üliõpilane oskab vastata peaaegu kõigile komisjoni poolt esitatud üldistele küsimustele. Spetsiifilistele küsimustele vastamisel esineb eksimusi.\n\"D\" - rahuldav\nÜliõpilane viibis praktikal vähemalt 70% ettenähtud ajast. On koostanud minimaalse eneseanalüüsi. Praktikabaasist koostatud ülevaade ja tegevuse analüüs on pealiskaudne, praktikapäeviku täitmisel esineb puudujääke ning praktikamappi kogutud praktilist tegevust iseloomustav materjal on vähene. Juhendaja poolt antud tagasisside on hinnatud hindega \"C\" või \"D\" Praktikaaruande kaitsmine on asjakohane, üliõpilane oskab vastata enamikele komisjoni poolt esitatud küsimustele, kuid esineb ebatäpsusi.\n\"E\"- kasin\nÜliõpilane viibis praktikal vähemalt 60% ettenähtud ajast Praktikabaasist koostatud ülevaates ja tegevuse analüüsis esineb puudujääke, praktikapäevik on täidetud lünklikult. Praktikamapis sisalduv üliõpilase praktilist tegevust iseloomustav materjal on kasin. Eneseanalüüs on pealiskaudne. Juhendaja poolt antud tagasiside on hinnatud hindega \"D\" või \"E\". Praktikaaruande kaitsmine on miinimumtasemel ja ebakindel.\n\"F\" - puudulik\nÜliõpilane viibis praktikal vähem kui 50 % ettenähtud ajast. Juhendaja poolt antud tagasisside on hinnatud hindega \"E\" või \"F\" ."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Praktikaaruanne vastavalt PT praktikajuhendile"}}], "grade_preconditions": {"et": "Praktika täitmine täies mahus ja praktika aruande tähtaegne esitamine kaitsmisele."}, "grade_evaluation": {"et": "Praktika arvestamise eelduseks on nõuetekohase kirjaliku praktikaaruande esitamine. Üldjuhul toimub praktikate hindamine tagasisideseminaril, kus komisjon (eriala õppejõud, kuraator vms) annab hinnangu üliõpilase praktikale. Vajaduse või osapoolte soovi korral ja vastastikusel kokkuleppel korraldatakse igale praktikandile eraldi arenguvestlus.\n\nSeminaril teevad üliõpilased kokkuvõtte praktika tugevatest ja nõrkadest külgedest ning vastavad komisjoni küsimustele. hindamisel arvestatakse üliõpilase praktikal viibimise tegelikku aega, praktiliste tööde sooritamise taset, valmidust tööprotsessis osaleda ja iseseisvat tööd vastavalt praktikapäevikule, eneseanalüüsile ja juhendaja hindamislehele.\n\nHindamisel arvestatakse nii praktika aruannet, juhendaja/ kuraatori hinnangut kui ka kaitsmise protsessi."}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "10aface7-3e9a-daba-8f9a-faf063283c8a", "person_name": "Madis Rennu", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "f6ee7f6b-e62c-35ea-95a5-00537f7f1619", "person_name": "Indrek Ikkonen", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "b93b1291-9276-bce7-a428-d6b5bf73a333", "person_name": "Kristi Jõeste", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "0636ab1f-7597-8f19-7ae7-6c44a071cfa7", "person_name": "Ave Matsin", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatav seminar. Individuaalse praktika sisu määratlemine, eesmärgistamine, kavandamine."}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {"et": "Iseseisva praktika teostamine individuaalse praktikakava alusel."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Praktika aruande esitlemine ja tagasisidestamine."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "61aa437b-9557-e700-a497-ae04d229266a", "parent_code": "P2VK.01.355", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}