{"uuid": "99baf25c-2f03-2194-d480-8c5da1f86170", "code": "P2VK.05.350", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-13T08:44:13", "title": {"en": "Cultural Politics", "et": "Kultuuripoliitika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces the key concepts of \"culture\", \"politics\" and \"policy\", and presents the main justifications for cultural policy over the last century. The policy-making process and cycle will also be introduced. The focus of the course is on the Estonian \"Cultural Development Plan 2021-2030\" and all topics will be analyzed in the light of sectoral examples. A brief introduction to the relationship between European Union and Estonian cultural policies and forms of international cultural cooperation will also be provided. The course consists of lectures and discussions, two seminars during which students will present their group work outlines, and independent reading and other media resources.", "et": "Kursus avab peamised mõisted \"kultuur\" ja \"poliitika\" ning tutvustab kultuuripoliitika peamisi põhjendusi viimase sajandi lõikes. Samuti tutvutakse poliitikakujundamise protsessi ja tsükliga. Kursuse fookuses on Eesti \"Kultuuri arengukava 2021-2030\" ning kõiki teemasid analüüsitakse valdkondlike näidete valguses. Põgusalt tutvutakse ka Euroopa Liidu ja Eesti kultuuripoliitikate seostega ning rahvusvahelise kultuurikoostöö vormidega. Kursus koosneb loengutest ja aruteludest, kahest seminarist, mille raames õpilased tutvustavad oma grupitöö visandeid ning iseseisvast lugemis- ja muust meediavarast."}, "objectives": [{"en": "The aim of the course is to provide an overview of the foundations and justifications of cultural policy, its central themes and problems, and the ways of shaping cultural policy and intervention logics, primarily using the example of Estonia. The Estonian \"Cultural Development Plan 2021-2030\" will be analysed in general and through specific sectoral examples. An overview of the connections between Estonian and EU cultural policies and international cultural cooperation in various forms will be provided.", "et": "Aine eesmärk on anda ülevaade kultuuripoliitika alustest ja põhjendustest, kesketest teemadest ja probleemidest, kultuuripoliitika kujundamise viisidest ja sekkumisloogikatest peamiselt Eesti näitel. Analüüsitakse Eesti \"Kultuuri arengukava 2021-2030\" üldiselt ja konkreetsete valdkondlike näidete varal. Antakse ülevaade Eesti ja ELi kultuuripoliitika seostest ja rahvusvahelisest kultuurikoostööst erinevates vormides."}], "learning_outcomes": [{"en": "Upon completing the course, the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "*\tknows and understands the basic concepts, objectives, and policy-making process of cultural policy.", "et": "*\tteab ja tunneb kultuuripoliitika põhilisi mõisteid, eesmärke ning poliitikakujundamise loogikat;"}, {"en": "*\thas an overview of the main themes and problems that contemporary cultural policy needs to address in Estonia and elsewhere in Europe.", "et": "*\tomab ülevaadet peamistest teemadest ja probleemidest, millega kaasaegne kultuuripoliitika peab Eestis ja mujal Euroopas tegelema;"}, {"en": "*\tis able to analyse a specific cultural initiative, idea, problem or challenge in the context of cultural policy.", "et": "*\toskab analüüsida konkreetset kultuurivaldkonna algatust, ideed, probleemi või väljakutset kultuuripoliitika kontekstis;"}, {"en": "*\tis familiar with the cultural policy support measures of Estonia and the European Union.", "et": "*\torienteerub Eesti ja Euroopa Liidu kultuuripoliitilistes toetusmeetmes."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}