{"uuid": "f203bc97-4115-1d9a-2ffa-206fba1052ff", "code": "P2VK.01.284", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Weaving I", "et": "Telgedel kudumine I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "I term: Plain weave- the main topic is rag rug weaving. Measuring the yarn and calculating the material. Warping the loom. Weaving the samples. Executing the rag rug designed in the composition course. Finishing.\n\nII term: the students are familiarized with the typical Estonian native textile fabrics (plaids, shawls, etc.) and their weaving patterns (pattern design, colour differences of time and space, use of the item, technical realization, materials). Execution of a woollen shawl designed in the composition course. Finishing.\nNB! Foreign students are expected to:\n*\tHave good manual skills;\n*\tBe prepared to purchase materials and a few tools.", "et": "I semester: Labane sidus - peateema on kaltsuvaiba kudumine. Lõime käärimine, materjali arvestamine. Lõime rakendamine telgedele. Tööproovide kudumine. Eriala kompositsiooni tunnis valminud kaltsuvaiba kavandit teostatakse materjalis. Viimistlus.\n\nII semester: tutvutakse eesti rahvakunstis välja kujunenud erinevate rahvuslike (sõbade, suurrättide, ülevisete) kangaste ja nende rakendustega (mustrijaotus, ajaline ja paikkondlik värvierinevus tekstiilidel, eseme kasutus, tehniline teostus, materjalid). Teostatakse eriala kompositsiooni tunnis valminud villase üleviske kavand materjalis. Viimistlus."}, "objectives": [{"en": "The purpose of the subject is to teach students to set up looms to weave basic textiles, weave, and finish woven work.", "et": "Õppeaine eesmärgiks on õpetada üliõpilastele lihtsaimate kangaste rakendamist kirikangastelgedele, kangaste kudumist ja viimistlemist."}, {"en": "In the loom weaving lessons, students will be taught to apply the knowledge gained in practice and will execute the designs produced in composition lessons.", "et": "Telgedel kudumise tundides õpitakse sidusõpetuse aines omandatud teadmisi rakendama praktikas ja teostatakse eriala kompositsioonitundides valminud kavandeid materjalis."}], "learning_outcomes": [{"en": "Upon passing the subject, the student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- will be able to execute the design in material and, for this purpose, to select the suitable woven materials and techniques;", "et": "- oskab kavandit materjalis teostada ja selleks valida sobivaid kudumismaterjale ning töövahendeid;"}, {"en": "- will know how to weave and finish rag rugs (as a first semester assignment)", "et": "- oskab kududa ja viimistleda kaltsuvaipa (I semestri ülesandena)"}, {"en": "- will know how to weave and finish an all-wool throw (second semester assignment)", "et": "- oskab kududa ja viimistleda läbivillast üleviset (II semestri ülesandena)"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}