{"uuid": "48f1be55-02ba-dc7b-bfac-dff899bb4e19", "code": "P2VK.01.072", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Folk Costume", "et": "Eesti rahvarõivad"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Lectures on the history and development of Estonian folk costumes on the basis of the examples from the Estonian National Museum. A more focused approach to everyday and festive clothing in various regions in Estonia. Generalizations are made and details are considered.", "et": "Loengud eesti rahvariiete ajaloost ja kujunemisest ERMi tekstiilikogu näidete varal. Lähemalt vaadeldakse nii töö- kui pühapäevariideid Eesti neljas rahvariidegrupis. Tehakse üldistusi, aga tutvutakse ka detailidega."}, "objectives": [{"en": "The course aims at developing an integrated picture of Estonian folk costume and its wearing tradition.", "et": "Kursuse eesmärgiks on kujundada tervikpilt Eesti rahvarõivastest ja nende kandmise traditsioonidest."}], "learning_outcomes": [{"en": "Upon successful completion of the course students:\n-\thave received an overview of the development trends in Estonian folk costumes, of the influences and of the differences and similarities of the costumes as well as accessories of different regions, of the materials, design and ornamentation;\n-\tknow and can distinguish different development periods of folk costumes;\n-\tknow the influences of urbanization on folk costumes at the end of the 19th century;\n-\thave an overview of the influences of neighboring countries on Estonian folk costumes;\n-\tcan use written resources on the basis of which are able to prepare, both in theory and in practice, folk costumes of different Estonian parishes for women, men and children.", "et": "Aine edukal läbimisel üliõpilane:\n- on saanud ülevaate Eesti rahvarõivaste arengusuundadest, mõjutustest, erinevate piirkondade rõivaste ja aksessuaaride  erinevustest ja sarnasustest, materjalidest, kujundusest ja ornamentidest;\n- tunneb ja suudab eristada rahvariiete erinevaid arenguetappe;\n- tunneb rahvariiete funktsionaalseid omadusi;\n- tunneb linnastumise mõjusid rahvariietele 19. saj lõpus;\n- omab ülevaadet naabermaade mõjutustest eesti rahvariietes; \n- valdab erinevate Eesti kihelkondade rahvariidekomplektide koostamise metoodikat."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}