{"uuid": "b127bc0d-e49a-5f44-e7c3-d5a3d349353d", "code": "P2VK.01.226", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Specialized Literature Course", "et": "Eriala kirjanduskursus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "IHow to read research literature in a foreign language? How to find relevant sources: databases, key words, searching skills. The structure of a research article. Reviewing, quoting, and referring to research literature. Formatting references. Abstract, translating one. Presenting an overview of a research article in a foreign language. \n\nInternational literature on native construction or textile or metalwork in UT VCA. The most common supply chains of international literature. Supply chains of specific literature. Revision of academic referencing. Referencing to specific sources (interviews, conversations, field work, museum collections and objects).\nDuring the course short summaries of specific sources of information are made and bibliographic records are drawn up.", "et": "Kuidas lugeda võõrkeelset erialakirjandust? Kuidas seda leida: andmebaasid, märksõnad, infootsing. Teadusartikli struktuur. Refereerimine, tsiteerimine, viitamine, viidete vormistamine, Abstract; selle tõlkimine. Võõrkeelse erialaartikli referaadi esitamine. \n\nRahvuslikku ehitust või tekstiili või metalli puudutav rahvusvaheline kirjandus TÜ VKA raamatukogus. Tavapärasemad rahvusvahelise kirjanduse hankekanalid. Erialakirjanduse hankekanalid. Akadeemilise viitamise kordamine. Viitamine spetsiifilistele allikatele (intervjuud, vestlused, välitööd, muuseumikogud, esemed ja objektid).\nKursuse käigus koostatakse võõrkeelsete erialaaliikate lühikokkuvõtteid ning vormistatakse bibliokirjeid."}, "objectives": [{"en": "To give students an overview of the databases of research literature and to improve their searching skills; to practice reading, reviewing and using research literature in one's academic work.", "et": "Omandada ülevaade võõrkeelse erialakirjanduse leidmise viisidest ning kasutamise võimalustest, harjutada võõrkeelse teadusteksti lugemist, refereerimist, kasutamist akadeemilises uurimistöös."}], "learning_outcomes": [{"en": "Upon the successful completion of the course the student:", "et": "Kursuse edukal läbimisel üliõpilane:"}, {"en": "- has an overview of the international research literature available in the Library of UT VCA;", "et": "- omab ülevaadet võõrkeelsest erialakirjandusest TÜ VKA raamatukogus;"}, {"en": "- is familiar with the databases of research literature and knows how to search them;", "et": "- tunneb erialakirjandust sisaldavaid andmebaase ja oskab neis sooritada otsingut;"}, {"en": "- is able to refer to, quote and review  research literature relevant in their field;", "et": "- oskab võõrkeelset erialakirjandust viidata, tsiteerida ja refereerida ;"}, {"en": "- has a command of foreign specific vocabulary;", "et": "- valdab keskset võõrkeelset erialasõnavara;"}, {"en": "- is able to make short summaries of specific sources of information;", "et": "- oskab koostada erialaallika lühikokkuvõtteid;"}, {"en": "- has a command of drawing up bibliographic records.", "et": "- on omandanud bibliokirjete koostamise vilumuse."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}