{"uuid": "9d8cfa52-922f-0f33-92ac-d652d17b5d7a", "code": "P2VK.05.191", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Organizational Studies", "et": "Organisatsiooniõpetus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Through lecturing and active group-works, discussions students will obtain knowledge on following topics: different definitions of organisation, parameters of organisation (objectives, mission, vision, structure, strategy, efficiency, and organisation culture); how related organisation culture and national culture are; organisational approaches through classical theories (Taylor, Fayol, Weber)till the nowadays post modernistic approaches; classifications of organisations; formulation of organisations and changes-drifts in the principles of organisations functioning .", "et": "Põhifookus on organisatsioonil, alustades tekkest, liikudes toimimiseni, rääkides ja arutledes erinevate aspektide üle mis nende kahe tegevusega seotud on."}, "objectives": [{"en": "Introduce to the students different theoretical approaches of organisations and to provide basic knowledge for analysing organisations. Introductory course giving basic knowledge and preparation for following courses: organisation management and organisational behaviour.", "et": "Anda õpilastele teadmised organisatsiooni tekkemehhanismidest, selle toimimisest, erinevatest vormidest ja arutleda kuhu liiguvad tänapäeva organisatsioonid, teisisõnu millised arengusuunad ootavad organisatsioone ees."}], "learning_outcomes": [{"en": "After passing the course student will have knowledge on different organisation definitions, theoretical organisational approaches. Student is able to identify and analyse different organisational parameters and has knowledge on nowadays trends in organisational thinking and changes.", "et": "Üliõpilane teab:\n1. organisatsiooniõpetuse teoreetilisi aluseid;\n2. kuidas organisatsioon tekib ja toimib;\n3. mis on motivatsioon ja erinevaid viise inimeste motiveerimiseks\n4. mis on grupid ja meeskonnad ning kuidas need toimivad;\n5. mis on juhtimine ja eestvedamine ja kuidas neid kasutatakse\n6. millised on peamised organisatsiooni struktureerimise põhimõtted\n7. mis on organisatsioonikultuur"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}