{"uuid": "8b311848-b747-0235-c5a9-19d82ad0fa65", "code": "P2VK.01.307", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Leather Processing History", "et": "Naha töötlemise ajalugu"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Takes place in the form of lectures, seminars and workshops.\nTerminology. Historical leather techniques. Estonian material: typology of the leather items found in Estonia. Comparison of the Estonian material with the Northern and Central European one. Ways to interpret archaeological leather. Using leather and fur items, relation to other utility objects. Leather  clothing and accessories in Estonia - how and when were used. Leather clothing and accessories in other cultures. Work with original items - observing, drawing, measuring.", "et": "Toimub loengute, seminaride ja praktilise tegevuse vormis. \n\nTerminoloogia. Ajaloolised naha tehnoloogiad. Eesti materjal: Eestis leitud nahkesemete tüpoloogia, Eesti materjali võrdlus Kesk- ja Põhja-Euroopaga. Arheoloogilise naha käsitlemise metodoloogia. Arheoloogilise naha interpreteerimisvõimalused. Nahast ja karusnahast esemete kasutamine, seosed muu tarbevaraga. Nahast rõivaesemed ja aksessuaarid eestlastel, kuidas ja kus neid kasutati. Nahast rõivaesemed ja aksessuaarid teistel rahvastel. Töö originaalesemetega - vaatlemine, maha joonistamine, mõõdistamine."}, "objectives": [{"en": "Gives an overview of historical leatherworking technologies and types of object. Introducing the leatherworking sources and methods for the primary handling of leather found in the earth's bowels.", "et": "Anda ülevaade ajaloolistest nahatöötlemise tehnoloogiatest ja esemeliikidest. Tutvustada nahatöötlemise uurimise allikaid ning meetodeid maa seest tulnud naha esmaseks käsitlemiseks."}], "learning_outcomes": [{"en": "Upon passing the subject, the student:", "et": "Aine edukal läbimisel üliõpilane"}, {"en": "- will have an overview of the historical leather working methods and leather items made;", "et": "- omab ülevaadet ajaloolistest nahatöötlemise meetoditest ning valmistatud nahkesemetest;"}, {"en": "- has an overview of Estonian archaeological leather;", "et": "- omab ülevaadet Eesti arheoloogilisest nahast;"}, {"en": "- is familiar with various traditional leather items and their use;", "et": "- tunneb erinevaid traditsioonilisi nahast esemeid ja nende kasutamist;"}, {"en": "- knows how to handle leather items found in digs - giving \"first aid\" and document its condition;", "et": "- oskab käituda väljakaevamistel saadud nahkesemetega - anda \"esmaabi\" ja fikseerida;"}, {"en": "- knows how to work with originals (e.g. museum items) - draw them, measure them.", "et": "- oskab töötada oringinaalesemetega (nt museaalid) - üles joonistada, mõõdistada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}