{"uuid": "de87ebcf-a021-4167-8704-c7b32cde6bb0", "code": "P2VK.05.385", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Creativity and Activity Study", "et": "Loovus- ja tegevusõppe alused"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The  focus of the course is on organization and the more common forms of  the creative and experiential educational activities (outdoor education, adventure education and creative activities, games, simulations, creative and problem solving tasks, etc.). \nFor teaching methods are implemented lectures, seminars, and practical work that provide an overview of specialization modules of curriculum.  Action and experiential learning course will be part of fieldwork  and held in outdoor enviroment.\nThe main themes are non-formal education methods and tasks that are suitable for school leisure time manager-teacher and youth worker professional work . \nThe subject is compulsory for students who specialize in creative activities or experiential education.", "et": "Kursusel keskendutakse loovus- ja tegevusõppe korraldusele ning enamlevinud vormidele (õuesõpe, seiklus- ja loovtegevused, mängud, simulatsioonid, loovusülesanded jne). \nÕppetöös rakendatakse loenguid, seminare ning praktikume, mis annavad ülevaate spetsialiseerumismoodulite ainetest. Tegevusõppe osa toimub väljasõidu ja õuesõppe vormis.\nLäbivateks teemadeks on huvijuhi ja noorsootöötaja kutsetööks sobivad, mitteformaalses õppes rakendatavad meetodid.\nAine on kohustuslik üliõpilastele, kes soovivad läbida loovus- või tegevusõppe spetsialiseerumist."}, "objectives": [{"en": "1. Provide an overview of ", "et": "1.\tAnda ülevaade "}, {"en": "- Creative and experiential educational activities, principles and organization (goal setting, group process management, emotional and physical safety, feedback and reflection)", "et": "-\tloovus- ja tegevusõppe olemusest, põhimõtetest ja korraldamise protsessist (eesmärgistamine, grupiprotsessi juhtimine, emotsionaalne ja füüsiline turvalisus, tagasisidestamine)"}, {"en": "- Competences that are necessary to implement the conscious cultivation of creativity and education ", "et": "-\tpädevustest, mis on vajalikud loovuse teadlikuks rakendamiseks kasvatuses ja hariduses "}, {"en": "- The creation of a learning environment resources and goals", "et": "-\tõpikeskkonna loomise vahenditest ja eesmärkidest "}, {"en": "2. to provide primary skills ", "et": "2.\tanda esmased oskused "}, {"en": "- The manifestation of creativity techniques to support the implementation at various levels (individual, learning environment, work environment) ", "et": "-\tloovuse avaldumist toetavate tehnikate rakendamiseks erinevatel tasanditel (üksikisik, õpikeskkond, töökeskkond) "}, {"en": "-  links to generalize the results of action", "et": "-\ttegevuse tulemusena tekkivate seoste üldistamiseks"}], "learning_outcomes": [{"en": "The student  is able to:", "et": "Õppeaine läbinud tudeng "}, {"en": "- Understands the nature of creativity and experiential learning", "et": "-\tmõistab loovus- ja tegevusõppe olemust "}, {"en": "- Have an overview of creative activities and teaching methods ", "et": "-\tomab ülevaadet loovus- ja tegevusõppe meetoditest"}, {"en": "- Knows principles of creation of enriching and supportive learning environments", "et": "-\tteab arendavate ja toetavate õpikeskkondade loomise põhimõtteid;"}, {"en": "- Knows the art of creative self-expression tools: visual (shape, color), auditory (sound and music), kinaesthetic (movement, dance), etc. ", "et": "-\tteab loova eneseväljendamise kunstivahendeid: visuaalsed (kujund, värv), auditiivsed (heli, muusika), kinesteetilised (liikumine, tants) jmt"}, {"en": "- Knows the steps of learning activities ", "et": "-\tteab tegevuste kaudu õppimise etappe"}, {"en": "- Understands the needs of the target group, how to map and structure the purpose of the activity ", "et": "-\tmõistab sihtrühma vajaduste kaardistamise ja tegevuse struktureerimise otstarvet"}, {"en": "- describe personal strengths and development needs of the creative and organizing educational activities", "et": "-\toskab kirjeldada isiklikke tugevusi ja arenguvajadusi loovus- ja tegevusõppe korraldamisel"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}