{"uuid": "fd04b633-982e-aa99-7a10-69e50beb6131", "code": "P2VK.01.291", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Belt Weaving I", "et": "Vöökudumine I"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Samples of braided ribbons, reconstructed set of garters or braided belt.\nTablet-woven bands (width wise strips, checked, diagonal, zigzag, fish tale, \"Setu thick\", \"Setu thin\", hollow tablet-woven belt), apron fringe from Pärnu-Jaagupi, belts with long threads, Halliste maiden's skirt edge, Muhu tablet- woven belt.\nNB! Foreign students are expected to:\n*\tHave good manual skills and previous basic experience in crafts;\n*\tBe prepared to purchase materials and a few tools.", "et": "Eesti traditsioonilised vööd: nende kandmis- ja kasutusviisid ning paikkondlikud eripärad. Materjalide ja töövahendite tutvustus, erinevate vöökudumise tehnoloogiate  tundmaõppimine ja oskuste praktiline  omandamine.\nI osa: punutud paelte tööproovid, (säärepaelte koopiakomplekt või punutud vöö)\nII osa: kõlavööd (ristitriibuline, ruuduline, diagonaalne, sik-sak, kalasaba, Setu \"paks\", Setu \"õhuke\", õõnes kõlavöö, Pärnu-Jaagupi põllenarmad, pikkade lõngajooksudega vöö, Halliste neiu seeliku pook."}, "objectives": [{"en": "Students will learn to weave and knit Estonian ethnographic belts and ribbons. They will begin with the simplest and progress to more complicated techniques.", "et": "Õppida põimima ja kuduma Eesti etnograafilisi paelu ja vöid. Alustatakse lihtsaimast ja liigutakse keerukamate võteteni."}], "learning_outcomes": [{"en": "- the student knows the techniques for weaving Estonian ribbons, patterned belts and mesh belts and is able to prepare methodological material based on the samples and relevant literature", "et": "- üliõpilane tunneb Eesti paelte punumise, kõlavööde kudumise tehnilisi võtteid ning oskab teostatud tööproovidest ja asjakohasest kirjandusest koostada metoodilist materjali"}, {"en": "- the student can make a copy of woven belts, tablet woven hems and mesh belts based on a specific assignment", "et": "- üliõpilane oskab valmistada koopiat punutud-põimitud paelast ja kõlapoogast vastavalt konkreetsele ülesandele"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}