{"uuid": "1fbd652f-f916-e187-0aec-d74b2975a3ff", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-05T23:16:03", "title": {"en": "Embroidery I", "et": "Tikkimine I"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVVK", "name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "email": "kultuur@ut.ee", "phone": "+372 435 5232", "webpage_url": "https://viljandi.ut.ee", "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "HV"}, "label": {"en": "24/25 S block mode HV", "et": "24/25 K SÕ HV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVVK", "structural_unit_name": {"en": "Viljandi Culture Academy", "et": "Viljandi kultuuriakadeemia"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 6, "practice": 18, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the introductory course to embroidery patterns of the main stiches used in Estonian native embroidery are made and correct materials and tools of embroidery are dealt with. As a practical task embroidery patterns are made like cross stitch, Seto box stitch and embroidery of the Mulgi headgear. The embroidery patterns are used to make study material (samples and corresponding literature), stitches are used to design and make a needle book. As a creative task a loose pocket with geometrical embroidery is made.\nNB! Foreign students are expected to:\n*\tHave good manual skills and previous basic experience in embroidery;\n*\tBe prepared to purchase materials and a few tools.", "et": "Tikkimise sissejuhataval kursusel tehakse tööproovide vormis läbi eesti rahvuslikus tikandis esinevad tikkimispisted (sellega seoses õpitakse valima ka õigeid materjale ja töövahendeid). Praktiliste ülesannetena sooritatakse tikkimispistete tööproovid, tehakse süvendatult läbi ristpistetikandi proov, seto kastpiste tikandi proov ja Mulgi ristikpistes tanumaali proov. Valminud materjalist koostatakse metoodiline materjal (tööproovidest ja vastavast kirjandusest), pistete põhjal kujundatakse ja valmistatakse nõelaraamatu. Loomingulise ülesandena valmib tikandiga kaunistatud ese."}, "objectives": [{"en": "Students will become familiar with Estonian ethnographic embroidery in clothing and applied art styles. Students will learn various stitches and embroidery techniques. They will learn about various types of embroidery and technical execution. Creative interpretation of embroidery characteristic of folk art and their use in modern textiles.", "et": "Tutvuda eesti etnograafiliste tikanditega nii rõivastuses kui ka tarbetekstiilis. Õpetada erinevaid pisteid ja tikkimistehnikaid. Tutvuda erinevate tikandite liikidega ja tehnilise teostusega. Rahvakunstile omaste tikandite loov interpreteerimine ja kasutamine kaasaegses tekstiilis."}], "learning_outcomes": [{"en": "Upon passing the subject, the student:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- will know the principal stitches of folk embroidery;", "et": "- oskab rahvusliku tikandi põhilisi pisteid;"}, {"en": "- will be able to prepare methodological material from work samples and literary sources;", "et": "- oskab koostada tööproovidest ja kirjandusallikatest metoodilist materjali;"}, {"en": "- will be able to decorate modern clothing using old-fashioned or geometric embroidery, selecting suitable embroidery materials and colour.", "et": "- oskab taimeainelist- või geomeetrilist tikandit kasutades kaunistada kaasaegset riideeset, valides selleks sobivad tikandimaterjalid ja koloriidi."}], "notes": {"et": "Vahendid: nõelad, käärid, peenvillased lõngad, mulineed, labane linane ja villane kangas (tükid) jne.\nPraktiline tikanditöö valitakse vastavalt soovile (erinevad materjalid). Individuaalne juhendamine."}}, "grading": {"independent_work": {"et": "Tikkimispistete tööproovid kodus lõpetada. Kaugõppe korral teostatakse iseseisvalt kirjanduse abil. Valida nõelaraamatu teostamiseks materjalid, kujundada, teostada, viimistleda. \nTeostada taimeainelise ja geomeetrilise tikandi erinevad tööproovid, lähtuvalt kavandist valida praktilise töö materjalid, teostada tikand, viimistleda. \nMetoodilise materjali koostamine õppejõu individuaalsel juhendamisel. Kohustusliku kirjanduse lugemine ja refereerimine metoodilisse õpimappi."}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Väljundipõhised hindekriteeriumid - hinne kujuneb esitatud esemete põhjal kolme aspekti pealt.\n\"Oskab põhilisi rahvusliku tikandi pisteid\":\nA - tikkimispistete tehniline teostus ja viimistlus suurepärane: pistete suurus on vastavuses nii alus- kui tikkimismaterjaliga, pisted teostatud korrektselt, ühtlaselt, täpselt, lõppviimistlus laitmatu;\nB- tikkimispistete tehniline teostus ja viimistlus väga hea: pistete suurus on vastavuses nii alus- kui tikkimismaterjaliga, pisted teostatud korrektselt ja ühtlaselt, lõppviimistlus peaaegu perfektne;\nC- tikkimispistete tehniline teostus ja viimistlus hea: pistete suurus on kohati mittevastavuses alus- ja tikkimismaterjaliga, pisted teostatud üldjoontes korrektselt, kuid kohati ebaühtlaselt, lõppviimistluses esineb puudujääke;\nD- tikkimispistete tehniline teostus ja viimistlus rahuldav: pistet suurus pole vastavuses alus- ja tikkimismaterjaliga, teostatud enamasti ebakorrektselt ja kasutatud on küsitavaid viimistlusvõtted;\nE - tikkimispistete tehniline teostus ja viimistlus kasin: sobimatu materjalivalik, ebakorrektne teostus, ebasobivad viimistlusvõtted\n\n\"Oskab koostada metoodilist materjali\":\nA - kirjalik materjal on ülesehituselt selge (kirjanduse kasutamine põhjalik ja süsteemne), kvaliteetselt teostatud ja viimistletud tööproovide esitus korrektne ja nauditav;\nB - kirjalik materjal on ülesehituselt selge (kirjanduse kasutamine süsteemne), kvaliteetselt teostatud ja viimistletud tööproovide esitus korrektne;\nC- kirjalik materjal on ülesehituselt hea (kirjanduse kasutamine kohati lünklik ja süsteemitu), tööproovide esituses esineb esteetilisi ebakorrektsusi;\nD- kirjalik materjal on rahvuldava tasemega, infot liiga vähe, tööproovid esitatud lünklikult (midagi on puudu või lõpetamata) ja ebaesteetilisel kujul;\nE - kirjalik materjal on puudulik, infot minimaalselt, tööproovid esitatud lünklikult (midagi on puudu või lõpetamata) ja ebaesteetilisel kujul.\n\n\"Oskab tikandit kasutades kaunistada kaasaegset riideeset või tarbetekstiili\":\nA - tekstiilesemete kaunistuse tehniline teostus ja kujundus laitmatu, originaalne ja silmapaistev; koloriit ja materjalikasutus harmoonilised;\nB - tekstiilesemete kaunistuse tehniline teostus ja kujundus laitmatu; koloriit ja materjalikasutus õiged;\nC-  tekstiilesemete kaunistuse tehniline teostus ja kujundus hea, kohati tuim; koloriit ja materjalikasutus võivad tekitada küsimusi;\nD-  tekstiilesemete kaunistuse tehniline teostus ja kujundus rahuldav; koloriit ja materjalikasutus põhjendamatud;\nE - tekstiilesemete kaunistuse tehniline teostus kasin: koloriit, kompositsioon ja materjalikasutus ebaesteetiline, põhjendamatu ja tasakaalustamata."}}], "grade_preconditions": {"et": "Esteetiliselt kaunil kujul vormistatud metoodiline materjali sisaldab: lõpetatud ja korrektselt viimistletud tööproove, asjakohast ning sisukat kirjalikku ülevaadet eesti arhailise ja geomeetrilise tikandi kohta (refereering). Teostatud on nõelaraamat ning tikandiga kaunistatud ese (valida kahe tikandiliigi vahel üks).\nLoengutes ja praktikumides osalemine vähemalt 75% ulatuses."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb eksamisessiooni ajal toimuval esitlushindamisel, kus kõiki praktilisi erialatöid hindab vastavate ainete õppejõududest koosnev komisjon. Hinnatakse väljundipõhiselt."}, "debt_elimination": {"et": "Kordusesitus."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "eb80d47d-997a-4dd2-83fd-d45515ca6e68", "type": "MOODLE", "code": "P2VK.01.052_SO", "base_url": "undefined", "linked_to_groups": ["056a59e1-12b3-e47d-6738-1baf8c812bc9", "1550a891-1893-b92d-a17d-a0ff1446ae82", "9ddd91cd-9baa-9da6-1505-51cd24b06855", "02301fbd-4c46-b7d6-3c70-eb6d24ed4dbd", "0c2318f8-21d2-0495-bc60-e841644fe379", "5bfda8da-d768-8bfb-99c8-6b078f1e90ef"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Linnus, Hilda 1955. Tikand Eesti rahvakunstis. I-II osa. Tallinn: Eesti Riiklik Kirjastus.\nRiitsaar, Raili 2007 ja 2013. \"Seto tikand\". Obinitsa.\nTammis, Irina ja Lutsepp Elo 2010. \"Eesti tikand. 280 rahvuslikku mustrit\".\nVunder, Elle 1992. Eesti rahvapärane taimornament tikandis. Tallinn: Kunst.\nSteinberg, M.    Rahvapärane tikand. Eesti Õppekirjanduse Keskus, 1990.\nBrown, P.\t  Tikkimise entsüklopeedia. Sinisukk, 2003\nBarnden, B.\t  Ristpistetehnikate entsüklopeedia. Sinisukk, 2003\nPaine, Sheila.    Embroidered textiles. A World Guide to Traditional Patterns. \n  Thames & Hudson,    2008. (ISBN:  978-0-500-51394-I)\nGrasmane, Maruta. Latviešu Tautas Terpi. Raksti.Izšušana. Apgads Rasa ABC, SIA, 2000, 2002. (ISBN: 9984-653-25-0)\nJürgen, T. Mulgi rahvarõivad. Viljandi, 2015\nEesti rahvarõivaid XIX sajandist ja XX sajandi algult. Tallinn, 1957\nSoone, O. Tikime. Tallinn \"Valgus\", 1988\nMaria Merimaa seminaritöö Tarvastu tanudest (vt osakonna veeb)\nTriin Amuri seminaritöö Tarvastu ja Paistu naistesärkide tikanditest (vt osakonna veeb)", "recommended_materials": "Valikuliselt tikkimisõpikuid ja rahvakunsti alaseid ülevaateraamatuid Viljandi Kultuuriakadeemia raamatukogust.\nJürgen, T. Mulgi rahvarõivad. Viljandi 2015\nKabur, A, Pink, A, Meriste, M. Meite Muhu mustrid. Saara Kirjastus, 2010\nPiiri, R. Rahvarõivaid Eesti Rahva Muuseumist. Tallinn, 2006.\nSoone, O. Tikkimine. Tallinn, 1998\nKivilo, L. Lilltikand. Tallinn, 1992\nLaanpere, L., Raidla, H. Tikkimine. Tallinn \"Valgus\", 1989\nPink, A., Teder, K. Tikkimine. Saara Kirjastus, 2005"}, "participants": {"lecturers": [{"person_uuid": "fa5e7a25-04b5-4911-111c-d059b4d29b0d", "person_name": "Christi Kütt", "structural_unit": {"code": "HVVK02", "name": {"en": "Academic Staff", "et": "akadeemilised töötajad"}, "address": "Posti 1\n71004 Viljandi linn, \nViljandimaa \nEST", "city": "Viljandi linn", "street": "Posti 1", "zip": "71004", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVVK"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"A": {"code": "1", "et": "Lektor", "en": "lecturer"}, "B": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "056a59e1-12b3-e47d-6738-1baf8c812bc9", "code": "A", "max_size": 10}, {"uuid": "1550a891-1893-b92d-a17d-a0ff1446ae82", "code": "B", "max_size": 10}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Loeng - Mulgimaa ja Kihnu taimtikandi areng ja levik vanemat tüüpi rõivastel. Eesti taimornamendi vanima astme motiivistiku, värvi-, kompositsiooni- ja ornamentaalse lahenduse  ning selle keskaegse päritolu tutvustamine ja levik Eestis.  Arhailine tikand maailmarahvaste tarbe- ja rõivatekstiilidel."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "1. Materjalide ja töövahendide valik (alusmaterjali valik ja ettevalmistamine, mustri valik ja riidele kandmine), tikkimispistete teostamine (eelpiste, tikkpiste, järelpiste, liivapiste, ristpiste, aedpiste,ristikpiste,sidepiste,madalpiste,mähkpiste)\n2. Põhipisted - tikkimispistete teostamine(Hääbepiste, narmaspiste, punuspiste,varspiste,ahelpiste, linnusilmapiste sämppiste, nöörpiste, \"laisalõng\")\n3. Põhipisted - tikkimispistete teostamine (kastpiste, põlvikpiste, püvisilmpiste, võrkpiste). Riideserva ääristamine pistetega: üleloomispiste-ääris, sämppiste-ääris, punuspiste-ääris, \"losud\"\n4. Metoodiline näidis- ja õppematerjal (sisaldab tehnikast lähtuvalt valmistamisõpetusi koos jooniste ja materjalinäidistega) - põhipisted.\n5. Nõelaraamat (teostus, ääristus, viimistlus)"}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "6. Ristpistetikandi tööproov (Tarvastu tanu)\n7. Ristikpistetikandi tööproov (Tarvastu tanu)-valikuliselt.\n8. Kastpistetikandi tööproov (Seto puusapõll)\n9. Praktiline töö. Tikandi viimistlus ja hooldus.\nNB! ajakava esitatud tinglikult. Teemade käsitus jaguneb vastavalt kontakttundidele."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Loeng - geomeetrilise tikandi kasutusalad Eesti rahvarõivastel ja tarbetekstiilidel. Värvid, materjalid."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Tehikapõhised algteadmised ja -oskused."}}]}, "registration_info": {"audience": {"et": "PTT 1"}, "min_students": 5, "max_students": 20}, "confirmation_process": {"confirmation_uuid": "9867643a-8fca-427a-3123-1297141301e0", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "29a6a2eb-ce71-09bd-6bec-139998f23a90", "parent_code": "P2VK.01.052", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}