{"uuid": "ededc775-23d0-873b-ee8c-06de271905c6", "code": "SHHI.03.054", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "The Bilingual Child - the Child with Special Needs?", "et": "Kakskeelne laps - erivajadustega laps?"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "3d739d22-7f01-17dd-2724-d7c04f0e3ad8", "code": "HTEP.02.025", "title": {"en": "Psycholinguistics", "et": "Kõnetegevuse psühholoogia"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "The definition, typology, research of bilingualism. The development of a bilingual child. Interference. Estonian-Russian bilingualism. The critical analysis of the legislation and  educational possibilities of minority-children. Bilingualism and special education.Compiling individual education plans for minority-children.", "et": "Kakskeelsuse (mitmekeelsuse) määratlus, tüpoloogia, uurimine. Kakskeelse lapse areng. Kakskeelse lapse kõne/keelelist arengut mõjutavad tegurid. Interferents. Mitmekeelse lapse keelelise arengu hindamine/jälgimine. Muukeelsete laste õpetamisega seotud seadusandlus Eestis. Eestis olemasoleva muukeelsete laste õpetamise süsteemi kriitiline analüüs. Muu(kaks)keelsus ja eripedagoogika."}, "objectives": [{"en": "The aim of the course is to give theoretical knowledge of the development of bilingual children with the emphasis on speech development/second language acquisition. To give an overview of currently available educational options for minority-children and to teach students  to identify and analyse the possible problems in development and education of minority-children..", "et": "Anda ülevaade kakskeelsete laste arengust, rõhuga kõne arengul/teise keele omandamisel. Tutvustada haridusvõimalusi teisest rahvusest pärit lastele. Õpetada märkama ja analüüsima puudulikust keeleoskusest tulenevaid arengu- ja õpiprobleeme."}], "learning_outcomes": [{"en": "The student knows in what way the speech production and comprehension as well as speech development of monolingual children and bilingual children differ; differs the mistakes in language use  due to the influence of the second language and due to speech and language disorder; chooses appropriate methods and materials for supporting second language acquisition; develops a supportive attitude towards multilingualism and multiculturalism in the Estonian educational system.", "et": "Üliõpilane teab kakskeelse ja ükskeelse lapse kõne arengu ning kõneloome ja -taju erinevusi; \neristab teise keele mõjust tingitud keelekasutuse vigu keelepuudega (alakõnega) lastele iseloomulikest vigadest; \nteab sobivaid võtteid ja materjali kõne arengu/teise keele omandamise hindamiseks ning toetamiseks koolieelses eas ning õpiabi võimalusi koolieas; \nsuhtub toetavalt mitmekeelsusesse ja mitmekultuurilisusesse Eesti haridussüsteemis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}