{"uuid": "9c1f80aa-d4f0-8609-7c90-13cd044cb290", "code": "SHHI.02.026", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching the Field \"Me and Environment\" at Pre-school Age", "et": "Valdkonna \"Mina ja Keskkond\" õpetamine koolieelses eas"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of the aim and content of the topic \"Me and the environment\" as well as  of  its educational activities, teaching methods and possibilities of implementing them in practice. Theoretical matierials are supported by practical work, illustrations, examples and guidance.", "et": "Kursusel antakse ülevaade valdkonna Mina ja keskkond eesmärkidest, sisust ja  õppe- ja kasvatustegevustest, õppemeetoditest ja nende rakendamise võimalustest. Teoreetilist materjali toetatakse praktiliste tööde, praktiliste harjutuste, näidete ja nõuannetega."}, "objectives": [{"en": "To give necessary knowledge and didactical and practical skills to teach the topic \"Me and the environment\" at pre-school.", "et": "Anda üliõpilastele vajalikud teadmised ja didaktilised oskused valdkonna Mina ja keskkond õpetamiseks ja tegevuste läbiviimiseks koolieelses eas."}], "learning_outcomes": [{"en": "By the end of the course a student ", "et": "Õppeaine läbinud üliõpilane :"}, {"en": "1) will know the aim, content and principles of educational activities for the theme \"Me and the enviornment\" and can use them for planning both indoor and outdoor activities as well as in composing  study materials:", "et": "1)\ttunneb õppe- ja kasvatustegevuse kavandamise põhimõtteid, valdkonna Mina ja keskkond eesmärke ja sisu ning oskab neid kasutada tegevuste planeerimisel (rühmaruumis ja välitingimustes) ja õppematerjali koostamisel;"}, {"en": "2) will have  an overview of methods to teach the topic \"Me and the enviornment\";", "et": "2)\tomab ülevaadet meetoditest valdkonna Mina ja keskkond käsitlemiseks;"}, {"en": "3) will know how to integrate the content and teaching activities with other subjects, considering general educational principles;", "et": "3)\toskab lõimida valdkonna õppesisu ja õppetegevusi teiste valdkondadega lähtudes üldõpetuslikust põhimõttest;"}, {"en": "4) will know how to observe objects in nature using suitable observation techniques;", "et": "4) oskab vaadelda loodusobjekte ja tunneb vaatlusvõtteid;"}, {"en": "5) know how to build a simple nature trail; ", "et": "5) oskab koostada lihtsat õpperada;"}, {"en": "6) can  make observation guides and activity plans;", "et": "6) on võimeline iseseisvalt koostama vaatlusjuhendit, tegevuskonspekti;  "}, {"en": "7) will practice  different activities.", "et": "7) harjutab praktiliste tööde tegemist ja tegevuste läbiviimist."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}