{"uuid": "18ef4a0e-e1c7-8127-4904-859748ece72d", "code": "SHHI.02.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching Art Activities at Pre-school", "et": "Kunstitegevuste õpetamine koolieelses eas"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of various theories of creativity, and gives suggestions of  how to support a child's creativity. Students learn to find creative solutions through art.", "et": "Kursusel antakse ülevaade erinevatest õppimisteooriatest ning näidatakse kuidas toetada lapse loovust. Käsitletakse lapse arendamise võimalusi kunstivaldkonna kaudu."}, "objectives": [{"en": "The aim of the course is to give an overview of art education at pre-school and the field of technology at primary school as well as various creativity theories. To develop didactics competencies for teaching art at preschool.", "et": "Üldeesmärk on saada ülevaade kunstivaldkonnast koolieelses lasteasutuses ning erinevatest õppimise ja õpetamise meetoditest. Kujundada kunstididaktikaalased pädevused tööks lasteaiaõpetajana."}], "learning_outcomes": [{"en": "By the end of the course a student\n1) will know the objectives, content and outcomes of art education at preschool; \n2) will know the aims and learning activities in the field of technology set for primary school in the National Curriculum;\n3) will know different creativity theories and can foster a child's creativity;\n4) can plan and carry out activities according to the curriculum and the age of children; \n5) will consider child development in teaching; \n6) can make samples using right techniques.", "et": "Õppeaine läbinud üliõpilane:\n1. teab ja võrdleb I kooliastme tööõpetuse ja kunsti õppeainete ning alushariduse kunstivaldkonna ainekava eesmärke, sisu ning õppe- ja kasvatustegevuse tulemusi;\n2. teab ja rakendab kunsti teemade läbiviimisel õppimise ja õpetamise meetodeid ning oskab toetada lapse loovust;\n3. kunstitegevuste kavandamisel lähtub ainekavast ja lapse arengust ning kasutab õiget terminoloogiat;\n4. nimetab ja oskab kunstitehnikates kasutatavaid töövõtteid, koostab näidistöödest metoodilise õppematerjalide kogu ning analüüsib ja annab hinnangu oma tööle."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}