{"uuid": "7b8c3310-7da2-15c0-b172-ad205213b840", "code": "SHHI.03.056", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Neurocognitive Aspects of Learning", "et": "Õppimise neurokognitiivsed aspektid"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "\"Neurocognitive aspects of learning\" is a course focusing on affective and cognitive processes such as perception, language, memory, attention, reasoning, and emotion /motivation within nervous systems from neural circuitry to brain organization. It provides neuroscience's current understanding of information processing gained largely from both human and animal research. The relevance of these findings and concepts to understanding human behavior will be discussed. Different types of learning and multiple memory systems will be compared and contrasted, some of the molecular mechanism thought to underlie these processes will be discussed. We will also discuss how disruptions to these mechanisms or specific brain regions can result in perception, learning and memory deficits. Students will be encouraged to use their knowledge in teaching and improving their own learning.", "et": "\"Õppimise neurokognitiivsed aspektid\" on ainekursus, mis keskendub afektiivsete ja kognitiivsete protsesside nagu taju, keel/kõne, mälu, tähelepanu/teadvus, mõtlemine ja emotsioonid ning motivatsioonid kirjeldamisele närvisüsteemi erinevatel tasemetel (närviringetest ajuosadeni). Antakse edasi uuem teadmine, mida neuroteaduslikud uuringud loomadel ja inimestel taju, õppimise, mälu, tähelepanu ja mõtlemise kohta on leidnud. Tulemusi selgitatakse inimkäitumise võtmes. Kursuses käsitletakse erinevat tüüpi õppimise- ja mälusüsteeme, mida võrreldakse ning kirjeldatakse nende protsesside aluseks olevaid molekulaarseid ja süsteemseid mehhanisme. Räägitakse ka sellest, milliseid puudujääke võib ette tulla tajus, õppimises ja teistes kognitiivsetes funktsioonides, kui nimetatud toimimismehhanismid kahjustatud saavad.  Õppijaid julgustatakse kasutama teadmisi õpilaste õppimise toetamisel ning enda õppimise, mälu ja tähelepanu tõhustamisel."}, "objectives": [{"en": "- to explain the organization and action of the nervous system sufficient for comprehensive understanding of neural basis of cognitive functions. ", "et": "- Selgitada närvisüsteemi organisatsiooni ja tegevust tasemel, mis võimaldab süvendatud arusaama kognitiivsete funktsioonide toimimisest."}, {"en": "- to give an overview of molecular, cellular and system level approaches of information processing, learning and memory.", "et": "- Anda ülevaade infotöötluse, õppimise ja mälu molekulaarse-, raku- ja süsteemse taseme käsitlustest. "}, {"en": "- to explain cognitive, affective and motor aspects of learning in context of special educational needs.", "et": "- Selgitada õppimise kognitiivseid, afektiivseid ja motoorseid aspekte hariduslike erivajaduste kontekstis."}], "learning_outcomes": [{"en": "By the end of the course, the student will:\n1. Describes the role of nervous system on cognitive and affective functions, learning and memory.\n2. Describes and differentiates the various types of learning, memory and attention, and the brain regions that underlie these different processes.\n3. Understands how research in the field of affective and cognitve functions is performed.\n4. Evaluates his/her own learning and understands how to improve learning, attention and memory in different settings.", "et": "1.\tKirjeldab närvisüsteemi osalust afektiivsete ja kognitiivsete funktsioonide toimimisel. \n2.\tTeab ja eristab erinevaid õppimise, mälu ja tähelepanu liike ning ajupiirkondi, mis nende protsesside eest vastutavad.\n3.\tMõistab, kuidas toimub tänapäevane uurimistöö afektiivsete ja kognitiivsete funktsioonide valdkonnas.\n4.\tOskab hinnata oma õpiprotsessi ning mõistab kuidas edendada õppimist, tähelepanu ja mälu erinevates tingimustes."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}