{"uuid": "d402f865-1fa2-8f80-c45f-b769e4e48bde", "code": "SHHI.03.053", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Educational Technology in Special Education and Speech Therapy", "et": "Haridustehnoloogia eripedagoogikas ja logopeedias"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course treats use of modern digital solutions in working with learners with special educational needs.", "et": "Õppeaines käsitletakse kaasaegsete digitaalsete võimaluste kasutamist erivajadustega õppijatega töötamisel."}, "objectives": [{"en": "The main goal of the course is to enhance students' capability to apply educational technology safely and efficiently in special education in teaching students with special educational needs, including in developing their digital literacy.", "et": "Õppeaine põhieesmärgiks on toetada üliõpilaste valmisolekut rakendada haridustehnoloogilisi võimalusi turvaliselt ja tõhusalt töötades erivajadustega õpilastega nende erinevate õpieesmärkide, sh digitaalse kirjaoskuse saavutamisel."}], "learning_outcomes": [{"en": "By the end of the course the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1)\tis able to apply effectively modern technological solutions in formation developmental and learning environment for learners with special educational needs;", "et": "1)\toskab tulemuslikult rakendada kaasaegseid tehnoloogilisi võimalusi arengu- ja õppekeskkonna kujundamisel erivajadustega õppijatega töötades;"}, {"en": "2)\tis able to use educational technologies for monitoring and evaluating development of students with special educational needs;", "et": "2)\toskab kasutada haridustehnoloogilisi lahendusi erivajadustega õppijate arengu jälgimisel ja hindamisel;"}, {"en": "3)\tunderstands the risks accompanied with spread of digital culture and is able to cope with these in guiding children and in counselling parents.", "et": "3)\tmõistab digikultuuri laienemisega kaasnevaid ohte ja oskab neid arvestada laste suunamisel ja lapsevanemate nõustamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}