{"uuid": "a32a0362-b642-a544-60ee-a7180000a308", "code": "SHHI.02.029", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Bachelor's Thesis", "et": "Bakalaureusetöö"}, "credits": 10, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The student compiles a research (e.g. pilot research for specifying the methodology and research instrument of the main research) or a reference research paper (analyses of scientific literature) aiming to solve a pedagogical problem, and it meets the requirements of research paper.", "et": "Üliõpilane koostab uurimusliku (nt pilootuuring põhiuuringu metoodika ja mõõtevahendi täpsustamiseks) või referatiivse iseloomuga töö (teadusliku kirjanduse analüüs), mis on suunatud konkreetse pedagoogilise probleemi lahendamisele ning vastab teadustöö nõuetele."}, "objectives": [{"en": "To carry out research in pedagogy, educational psychology or subject didactics.", "et": "Õpetada läbi viima uurimust pedagoogikas, hariduspsühholoogias või ainedidaktikas."}], "learning_outcomes": [{"en": "The student who has compiled his/her bachelor's thesis:", "et": "Bakalaureusetöö koostanud üliõpilane:"}, {"en": "1. Establishes a problem statement based on scientific literature, formulates the aim of the research and the research questions and/or hypotheses in accordance with the problem statement.", "et": "1. Püstitab teaduskirjandusele toetudes uurimisprobleemi ning sellega kooskõlas sõnastab uurimuse eesmärgi ja uurimisküsimused ja/või hüpoteesid."}, {"en": "2. Finds, analyzes and synthesizes relevant scientific literature, the theoretical approaches and research results presented in it.", "et": "2. Leiab, analüüsib ja sünteesib teemakohast teaduskirjandust, selles esitatud teoreetilisi käsitlusi ning uurimistulemusi."}, {"en": "3. Chooses the most suitable research method for the study, justifies the choice, processes and analyzes research data.", "et": "3. Valib oma uuringuks sobivaima uurimismeetodi, põhjendab selle valikut, töötleb ja analüüsib uurimisandmeid."}, {"en": "4. Presents the results of the research and interprets them based on the theoretical framework and the results of previous research.", "et": "4. Esitab oma uuringu tulemused ning tõlgendab neid lähtuvalt teoreetilistest lähtekohtadest ja varasemate uurimuste tulemustest."}, {"en": "5. Follows the academic writing requirements in accordance with the theses formatting guide.", "et": "5. Järgib akadeemilise kirjutamise nõudeid kooskõlas lõputööde vormistamise juhendiga. "}, {"en": "6. Presents the results of the work and defends them in public academic discussion.", "et": "6. Esitleb tööd ja kaitseb oma seisukohti avalikus akadeemilises diskussioonis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}