{"uuid": "b78a325e-36c3-90c5-2960-ef8cb277f335", "code": "SHHI.01.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Pedagogical Practice", "et": "Pedagoogiline praktikum"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "5ebb1a80-f626-ba35-4157-00803d4e2b97", "code": "SVHI.01.092", "title": {"en": "Teaching for Learning", "et": "Õppimist toetav õpetamine"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "00fb056d-638b-2b19-e55a-c0fc07070725", "code": "SHHI.01.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Learning and Instruction Design", "et": "Õppe kavandamine"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}]}, "overview": {"description": {"en": "The course supports students's professional development by creating opportunities to associate theoretical studies with practical teacher's activities in the university teaching laboratory. As a result of videoanalysis, videotraining, microteaching and simulation the course creates opportunities to analyse and therefore to give an adequate evaluation to his/her knowledge, skills, and attidudes and needs for professional development concerning the following domains: communication, designing learning and instruction, teaching. In addition, domain- and subject-competences and didactics are taken into account.", "et": "Ainekursus toetab üliõpilase professionaalset arengut, luues võimalused õpingute raames omandatavate teoreetiliste teadmiste lõimimiseks. Ainekursus loob võimaluse arendada oma teadmisi, oskusi ja pädevusi järgnevatel teemadel: õppe kavandamine ja juhtimine, suhtlemine, õpetamine, õpikeskkond ja õpivara, kaasav haridus, arvestades valdkonna- ja erialaspetsiifilisi kompetentse ja didaktikat. Aine 1. osa fookuses on eelkõige õppija üldpedagoogiliste pädevuste arendamine, aine 2. osas keskendutakse rohkem ainedidaktilistele pädevustele."}, "objectives": [{"en": "The main goal of the course is to support a student in becoming a teachers, creating opportunities to practice the acquirable from different base module courses and domain- and subject-didactics courses in the university before starting corresponding practices in the environment of the educational institution. The goals should be achieved jointly with the courses of the base module, domain- and subject-didactics and continuous pedagogical traineeship.", "et": "Õppeaine üldeesmärgiks on toetada üliõpilase kujunemist õpetajaks, luues võimalused erinevates alusmooduli ning valdkonna- ja ainedidaktika mooduli ainetes omandatava seostamiseks ja erinevate rakendamisvõimaluste vaatlemiseks, analüüsimiseks ja tagasisidestamiseks. Õppeaine eesmärgi saavutamine on kavandatud koos alusmooduli õppeainete, valdkonna- ja ainedidaktikamooduli õppeainete ning pideva pedagoogilise praktikaga."}], "learning_outcomes": [{"en": "1) Plans, in collaboration with a fellow student or individually, a mini-lesson / activity integrating subjects, selecting appropriate learning materials and teaching methods, and integrating the knowledge, skills and attitudes acquired in different domain- and subject-courses to create a safe, supportive, motivating and inclusive learning environment\n2) Reflects on the basis of the video their teaching activities based on the theoretical knowledge acquired in the courses about designing a supportive and inclusive learning environment\n3) Observes fellow students' mini-lesson / activity, participates in group discussion after the activity, and provides constructive feedback", "et": "Aine läbinud üliõpilane:\n1)\tanalüüsib ja hindab õpetamiseks kavandatud eesmärgile sobivat õpivara ja õppemeetodeid toetudes erinevates alusmooduli, valdkonna- ja ainedidaktika ainetes omandatud teadmistele, oskustele ja hoiakutele turvalise, õppimist ja üldpädevuste/üldoskuste saavutamist toetava, motiveeriva ja kaasava õpikeskkonna kujundamisest;\n2)\tanalüüsib läbiviidavaid minitunde/tegevusi ja annab edasiviivat tagasisidet;\n3)\treflekteerib saadud kogemusi ja oma õpetamistegevust toetudes omandatud teoreetilistele teadmistele õppimist ja õppijat toetava ja kaasava õpikeskkonna kujundamisest;\n4)\tanalüüsib rühma ja õppija taseme vastavust tegevuses/tunnis seatud eesmärkidele, valitud meetoditele ja õppesisule."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}