{"uuid": "fa44e5bb-b228-2d8e-f177-9b9174d6f129", "code": "SHHI.02.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Content and Language Integrated Learning (CLIL)", "et": "Lõimitud aine- ja keeleõpe"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of the essence, aims and principles of CLIL, considering the National Currriculum of Basic School and modern multicultural learning environment.", "et": "Kursus annab ülevaate LAK-õppe olemusest, eesmärkidest ja õppe läbiviimise põhimõtetest, arvestades Põhikooli riiklikku õppekava ja kaasaegset mitmekultuurilist õpikeskkonda."}, "objectives": [{"en": "To give students knowledge and skills enabling them to create and manage study process that integrates and values content knowledge, language skills, culture and cognition.", "et": "Anda üliõpilastele teadmisi ja oskusi, loomaks ning juhtimaks ainet (sisu), keelt, kultuuri  ja õpioskusi lõimivat ning väärtustavat õppeprotsessi."}], "learning_outcomes": [{"en": "By the end of the course a student", "et": "Kursuse läbinud üliõpilane: "}, {"en": "*knows the aims, principles and key concepts of CLIL;", "et": "*\tomab arusaama LAK-õppe olemusest, põhimõtetest ja eesmärkidest;"}, {"en": "*can make interdisciplinary connections, while developing students' content knowledge, language and study skills;", "et": "*\toskab luua ainetevahelisi ja aineteüleseid seoseid, arendades õppijate aine- ja keeleteadmisi ning õpioskusi;"}, {"en": "*knows the tools to create a learning environment that supports active learning and develops learner autonomy;", "et": "*\tomab ülevaadet võimalustest kujundada õpikeskkonda, mis toetab õpilase arenemist iseseisvaks ja aktiivseks õppijaks;"}, {"en": "* knows how to use a cross-curricular approach, create suitable topic-related activities while choosing, adapting, and designing study materials for the CLIL classroom;", "et": "*\toskab luua aineüleseid teemakäsitlusi ning teemadega seotud tegevusi ja ülesandeid LAK-õppe tunnis, koostades ja/või kohandades õppematerjali;"}, {"en": "*knows the assessment principles used in the CLIL classroom, can develop and implement CLIL-specific assessment tools and minimize sources of bias;", "et": "*\ttunneb LAK-õppe hindamise põhimõtteid ning oskab anda hinnanguvaba tagasisidet;"}, {"en": "* knows some leading authors and useful websites in the field of CLIL.", "et": "*\tomab ülevaadet vastavat valdkonda käsitlevast kirjandusest ja veebilehtedest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}