{"uuid": "6529742d-9d86-c16e-be7c-9c3ad9b6a7a7", "code": "SHHI.03.012", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Giftedness - Psychological and Pedagogical Issues", "et": "Andekuse psühholoogia ja pedagoogika küsimusi"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Intelligence, specific abilities; theories and models of giftedness; cognitive, affective and social differences; gifted identification; creativity; an expertise performance approach; giftedess as SEN; gifted education. Seminar topics: identification and counceling; profiles of gifted learners; emotional and social needs; underachievement; talent/creativity development; gifted student in inclusive education (good practices).", "et": "Intelligentsus ja erivõimed, andekuse uurimine ja mudelid; andekate kognitiivsed, afektiivsed ja sotsiaalsed iseärasused;  andekate tuvastamine; loovus andekuse komponendina, huvi/motivatsioon ja harjutamine tippsaavutuses; andekus kui HEV: andekus haridusseadustikus, õppekava planeerimine ja strateegiad, aktseleratsioon ja rikastamine, õpikeskkonna karakteristikud; \nSeminaride teemad: andekate tuvastamine ja nõustamine; andeka õppija profiilid (juhtumianalüüs); andekate emotsionaalsed ja sotsiaalsed vajadused; andekate alasooritus (underachievement); andekuse/loovuse arendamine; andekas õppija kaasava hariduse kontekstis (praktilised näited)"}, "objectives": [{"en": "The aim of the course is to widen the participant's knowledge of the theories and contemporary models of giftedness and talent, to notice and recognize specific needs of gifted children.", "et": "Kursuse eesmärgiks on anda  ülevaade andekuse  kontseptsioonidest ja kaasaegsetest mudelitest, andekate tuvastamise viisidest, andekusega seotud  psühholoogilistest probleemidest ning andekusest tulenevate hariduslike erivajadustega seonduvast ."}], "learning_outcomes": [{"en": "Participants have knowledge about contemporary approach of giftedness and talent, can understand the special needs of gifted children and possibilities for talent development.", "et": "Kursusel osaleja omab ülevaadet andekuse kaasaegsetest käsitlustest, oskab tähelepanu pöörata andekate tunnetuslikele, sotsiaalsetele ja emotsionaalsetele vajadustele ning omab teadmisi andekuse (ja loovuse) arendamise võimalustest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}