{"uuid": "5e90ecf0-25ac-5a44-3309-1eacf5153e81", "code": "SHHI.03.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Examination in Special Education and Speech Therapy", "et": "Bakalaureuseeksam eripedagoogikas ja logopeedias"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The graduation examination will consist of questions with multiple choices as well as open questions . The questions will cover themes addressed in the obligatory modules of the bachelor's curriculum of special education.  The duration of the exam will be 3 hours (180 minutes)", "et": "Bakalaureuseeksam hõlmab eripedagoogika bakalaureuseõppekava kohustuslikku suunamoodulit ja kohustuslikku erialamoodulit ning kolme ainet õppekavaspetsiifilisest alusmoodulist:  \"SHPH.00.029 Tunnetuspsühholoogia\"; \"SOPH.00.283 Arengupsühholoogia\" ja \"HTEP.01.035 Erivajadustega laste psühholoogia alused\". \n\nEksam on kirjalik, sisaldab nii valikvastusega kui avatud küsimusi. \nEksami kestus on 3 tundi (180 minutit)."}, "objectives": [{"en": "The general goal of graduation examination is to evaluate whether the educational goals of obligatory modules have achieved.", "et": "Bakalaureuseeksami üldine eesmärk on hinnata eripedagoogika õppekava kohustuslike moodulite läbimisel omandatud teadmisi."}], "learning_outcomes": [{"en": "Students passing the exam demonstrate", "et": "Bakalaureuseeksami positiivsele hindele sooritanud üliõpilane"}, {"en": "- systematic overview of basic concepts and research methods in special education;", "et": "- omab süsteemset ülevaadet eripedagoogika põhimõistetest ja uurimismeetoditest;"}, {"en": "- general knowledge of theoretical approaches, trends and contemporary issues in the field of educating children with special educational needs (SEN);", "et": "- tunneb erivajadustega laste arendamise teoreetilisi koolkondi, arengusuundi ja aktuaalseid probleeme;"}, {"en": "- ability to notice the interdisciplinary associations;", "et": "- oskab märgata interdistsiplinaarseid seoseid;"}, {"en": "- basic knowledge of the organization of educational system for children with SEN in Estonia;", "et": "- omab ülevaadet erivajadustega laste arendamise ja õpetamise korraldusest Eestis;"}, {"en": "- basic knowledge of the anatomical, physiological and neurological background of SEN;", "et": "- omab erivajaduste mõistmiseks vajalikke teadmisi anatoomiast, füsioloogiast ja neuroloogiast;"}, {"en": "- knowledge about specifics of psychological development of children with SEN;", "et": "- tunneb erivajadustega laste psüühika arengu iseärasusi;"}, {"en": "- basic knowledge of methodology of mother tongue and mathematics for children with SEN;", "et": "- omab alusteadmisi emakeele ja matemaatika õpetamise erimetoodikast;"}, {"en": "- basic knowledge in teaching preschool children with SEN;", "et": "- omab alusteadmisi erivajadustega laste õpetamisest koolieelses eas;"}, {"en": "- basic knowledge about the data collecting and interpreting in educational sciences;", "et": "- omab alusteadmisi andmete kogumisest ja tõlgendamisest pedagoogikateaduses;"}, {"en": "- sufficient theoretical preparation for continuing his/her studies in special education at the master level;", "et": "- omab piisavat teoreetilist ettevalmistust jätkamaks õpinguid eripedagoogika magistriõppes;"}, {"en": "- can independently use study skills.", "et": "- oskab iseseisvalt rakendada õpioskusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}