{"uuid": "dd97891d-7cf9-a0e2-764d-dc8870596adc", "code": "SHHI.02.055", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "English for Teachers (C1)", "et": "Erialane inglise keel (C1 keeletase)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The programme includes reading and working on scientific literature (topic include, e.g. studying at university, special educational needs, assessment, 21st century skills), learning presentation techniques and  structure and parts of a research article and essay. Students will make a presentation based on a scientific article and write a research essay.", "et": "Kursuse käigus töötatakse erinevate haridusalaste tekstidega (õppimine ülikoolis, hariduslikud erivajadused, hindamine, 21.sajandi õpioskused jne), õpitakse tundma teadusartikli struktuuri ja osi, kirjutama esseed ja koostama suulist ettekannet."}, "objectives": [{"en": "To enlarge students' vocabulary and develop language skills on C1 language level to work independently on scientific literature.", "et": "Rikastada üliõpilaste sõnavara ja keelelisi oskusi C1 keeletasemel töötamaks iseseisvalt erialase kirjandusega"}], "learning_outcomes": [{"en": "After successful completion of the course students will know the main terminology to understand education-related texts on C1 language level; discuss orally and in written educational topics; be able to paraphrase and summarise texts and know the requirements for referencing; know the structure of research articles; know the structure of a research essay; devise and write an essay according to the requirements; use suitable presentation techniques to deliver a presentation; analyse oral presentation of their peers.", "et": "Kursuse läbinud üliõpilane \n*tunneb ja kasutab oma erialaga seotud põhimõisteid; \n*arutleb õpitud sõnavara piires suuliselt ja kirjalikult erinevatel pedagoogilistel teemadel; \n*oskab parafraseerida ja refereerida erialast teksti ning korrektselt viidata kasutatud allikatele;\n* tunneb teadusartikli struktuuri;\n* teab uurimusliku essee koostamise nõudeid ning kavandab ja koostab vastavalt nõuetele uurimuslikku essee; \n* koostab ettekande ühe teadusartikli põhjal, arvestades suulise ettekande koostamise printsiipidega ;\n* analüüsib kaasüliõpilase ettekannet."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}