{"uuid": "5063a77b-b14a-e1b2-359a-3c1572555edd", "code": "SHHI.02.008", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical English Grammar for Teachers of Young Learners (II)", "et": "Inglise keele praktiline grammatika I ja II kooliastme õpetajale (II)"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "009f6704-0b7c-3a9d-dd44-969de411d8c0", "code": "HTHT.02.004", "title": {"en": "Practical English Grammar for Teachers of Young Learners I", "et": "Inglise keele praktiline grammatika I ja II kooliastme õpetajale (I)"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Advanced grammar course focuses on complex grammar structures and syntax (Modal verbs, Conditionals, Suppositionals, Relative clauses, Article, Reported speech, Participle, Gerund and Infinitive etc.) This course logically follows the course Practical Grammar I both of which prepare students for understanding and teaching grammar in the school stages I and II. The themes of the course advance students' linguistic competence and prepare them to work with language structures in the school stages I and II, to analyze their students' mistakes. Students also compile different task types and apply them in the form of team work in the seminars. Students develop their grammar knowledge in different situations, role-plays and mini presentations. The aim of the course is both to advance correct grammar usage and grammar teaching skills in the school stages I and II.", "et": "Edasijõudnute (advanced) grammatikakursus, mille käigus käsitletakse keerulisemaid grammatikastruktuure ja lauseõpetust (modaalverbid, tingimuslaused, erinevat liiki kõrvallaused, artikli kasutamine, kaudne kõne, partitsiip, infitiiv ja gerundium jne.) See on kursuse Praktiline grammatika I järg, mis valmistab üliõpialased ette õpetama grammatikat II kooliastmes. Käsitletavad grammatika teemad arendavad üliõpilaste keelelist kompetentsust ja valmistavad nad ette õpetama keerukamaid keelestruktuure ja analüüsima I ja II kooliastme õpilaste keelekasutust grammatika õpetamise seisukohast. Üliõpilased koostavad ise õpitavate teemade piires õpiülesandeid ning rakendavad ja analüüsivad neid seminarides. Üliõpilased arendavad grammatika alaseid teadmisi erinevates situatsioonides, rollimängudes ja lühiesinemistes. Keelestruktuure õpitakse eesmärgiga omandada korrektne keelekasutus ja oskus valida grammatika õpetamiseks ja II kooliastmes sobivad õpetamisvõtted ning oskus tegelda õpilaste vigadega."}, "objectives": [{"en": "To advance students' knowledge of grammar in the school stages I and II. To enforce complex language structures and learn to apply them in context.", "et": "Süvendada üliõpilaste grammatikaalaseid teadmisi ja arendada nende rakendamisoskust I ja II kooliastmes. Kinnistada olulisemaid keelestruktuure praktilise keelekasutuse seisukohast lähtudes."}], "learning_outcomes": [{"en": "The students know basic grammar rules of the areas covered; can form and correctly use complex grammar structures, knows different strategies how to teach grammar in school stages I and II and can choose suitable methods from among them. The student can compile tasks on a certain grammar theme and practice their efficiency in a team work.", "et": "Õppeaine läbinud üliõpilane:\n*\tteab grammatikareegleid läbivõetud teemade piires; \n*\toskab moodustada ja korrektselt kasutada keerulisemaid keelestruktuure;\n*\ttunneb I ja II kooliastmes grammatika õpetamise erinevaid võtteid ja oskab nende hulgast antud kooliastmetele sobivad valida.\n*\toskab koostada ja leida konkreetse grammatika teema kohta ülesandeid; katsetada mõne võtte tõhusust kaasüliõpilaste peal ja nii enda kui kaasüliõpilaste grammatika õpetamise võtte tõhusust hinnata;\n*\toskab koostada miniettekandeid konkreetsete grammatika teemade kohta.\n*\ttunneb grammatika termineid;\n*\tteab grammatikareegleid läbivõetud teemade piires;\n*\toskab moodustada ja korrektselt kasutada  olulisemaid keelestruktuure."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}