{"uuid": "52cf5f90-ba32-c84a-5db6-859392fdc393", "code": "SHHI.02.049", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teaching Practice for Primary Teachers III", "et": "Klassiõpetaja põhipraktika III"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "School placement", "et": "Üliõpilane tutvub praktikakooli töökorraldusega ja vaatleb ja analüüsib koolipoolsete juhendajate tunde. Praktika perioodi vältel täidab üliõpilane kõiki klassiõpetaja töökohuseid. I kooliastme proovitundide arv : 30 (või 20)  tundi.  II kooliastme proovitundide arv : 10  (või 20) tundi, II kooliastme ained valib üliõpilane omal soovil. Soovituslik on anda proovitunde ettenähtud normist  rohkem.\nPraktika kestab minimaalselt 4 nädalat või kauem. Põhipraktika III  sooritatakse tervikpraktikana, st mitte üksikute päevade kaupa.\nI ja II kooliastme õpetajatena töötavad üliõpilased saavad töö ja praktika omavahel siduda, täites praktika aruandluses nõutavad ülesanded."}, "objectives": [{"en": "The course has three main goals that should be achieved based on the completed studies in the university and jointly with continuous pedagogical traineeship:\n1) to support student's improvement to be a teacher by creating opportunities to integrate previously completed studies altogether with practical teacher's activities in an educational institution;\n2) to create opportunities to explore the educational process as a whole and to teach during a complete educational period;\n3) to enable to practice principles related to subject-didactics.", "et": "Õppeainel on kolm üldeesmärki, mis saavutatakse, tuginedes läbitud ülikooliõpingutele ja koos pideva pedagoogilise praktikaga: 1) toetada üliõpilase kujunemist õpetajaks, luues võimalused eelnevalt läbitud õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses; 2) luua võimalused õppe- ja kasvatustöö kui terviku tundmaõppimiseks ja läbiviimiseks kompaktse õppeperioodi vältel; 3) võimaldada ainedidaktiliste põhimõtete rakendamist."}], "learning_outcomes": [{"en": "By the end of the traineeship the student:\n1) is able to plan, implement, analyze and evaluate his/her activities related to subject and education;\n2) is able to plan teaching process, to teach and to support learners taking into account learners' speciality, prior knowledge, needs (including educational needs) and interests;\n3) arranges teaching systematically, based on evidence and creatively taking into account national basic documents, speciality of the educational institution, level of education, and/or subject, the needs and interests of students;\n4) integrates successfully the knowledge, skills and attitudes acquired during the studies in the university.", "et": "Aine läbinud üliõpilane: 1) oskab kavandada, ette valmistada, läbi viia, analüüsida ja hinnata oma õppe- ja kasvatustöö alaseid tegevusi; 2) oskab õpet kavandades ja läbi viies ning õppijaid toetades arvestada nende eripära, eelteadmiste, vajaduste (sh erivajaduste) ning huvidega; 3) kavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja/või õppeaine eripärast ning õppijate vajadustest ja huvidest; 4) integreerib tulemuslikult ülikooliõpingutes omandatud teadmisi, oskusi ja hoiakuid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}