{"uuid": "90e2e0f6-9c9d-232f-6cc2-77b51e855f7d", "code": "SHHI.02.028", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Musical Activities at Pre-school Age", "et": "Muusikalised tegevused koolieelses eas"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The subject provides an overview of the aims and principles of musical activities in accordance with the national curriculum. Teaching methods and possibilities of teaching musical activities at pre-schol age. The subject deals with the possibilities of implementing musical activities in group work and connecting music with other subject areas.", "et": "Aines antakse ülevaade muusikaliste tegevuste eesmärkidest ja põhimõtetest vastavalt riiklikule õppekavale. Tutvustatakse koolieelses eas muusikalise tegevuse õpetamise meetodeid ning võimalusi. Käsitletakse võimalusi muusikaliste tegevuste kasutamiseks rühmatöös ning muusika seostamiseks teiste õppevaldkondadega."}, "objectives": [{"en": "To provide an overview of child's musical development,the essence and importance of teaching of rhythm  in comprehensive development of children and possibilities of musical development at pre-school age. To teach planning and conducting of musical activities at pre-school age.", "et": "Anda ülevaade lapse muusikalisest arengust, rütmiõpetuse olemusest ja vajalikkusest laste igakülgsel arendamisel ning muusikalise tegevuse võimalustest koolieelses eas. Õpetada kavandama ja läbi viima muusikalisi tegevusi koolieelses eas."}], "learning_outcomes": [{"en": "The student having completed the subject::", "et": "Aine läbinud üliõpilane:"}, {"en": "1) knows the goals anf the content of music teaching in the national curriculum and is able to plan and conduct musical activities at pre-school age in accordance with the curriculum;", "et": "1)\tteab riikliku õppekava muusika valdkonna eesmärke ja sisu ning oskab õppekavast lähtuvalt kavandada ja läbi viia muusikalisi tegevusi koolieelses eas;"}, {"en": "2) can implement correct teaching methods bearing in mind the integration of different fields and the principles of educational activities in the national curriculum;", "et": "2)\trakendab õigeid didaktilisi võtteid arvestades valdkondade vahelise lõimingu ning õppe- ja kasvatustegevuse põhimõtteid riiklikus õppekavas;"}, {"en": "3) has a complete overview of child's musical education at pre-school age.", "et": "3)\tomab terviklikku ülevaadet koolieelses eas lapse muusikakasvatusest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}