{"uuid": "8f575253-0451-baf8-c96f-8a93a2613b3c", "code": "SHHI.02.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Pre-School Methodology", "et": "Koolieelne didaktika"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview of themain terminology, principles and meaning of pre-school education; deals with the history of establishing kindergartens in Estonia and Europe; teaches child-centeredness in planning, conducting and analysing educational activities. Theory is supported by examples, practical tasks and advice. In seminars examples of students' practice acitivites are analysed, in practical classes students carry out relevant tasks. Action plans and lesson plans for conducting educational activities in kindergartens are compiled as independent work.", "et": "Kursusel antakse ülevaade alushariduse põhimõistetest, printsiipidest ja tähendusest; käsitletakse lasteaedade kujunemislugu Eestis ja Euroopas; õpetatakse lähtuma lapsekesksest  õpetamisest ja kasvatamisest õppe- ja kasvatustegevuse kavandamisel, läbiviimisel ja analüüsimisel. Teoreetilist materjali toetatakse näidete, praktiliste harjutuste ja nõuannetega. Seminarides analüüsitakse näiteid üliõpilaste proovitegevustest, praktikumides sooritatakse teemakohaseid ülesandeid. Iseseisva tööna koostatakse tegevuskavad ja konspektid õppekasvatustöö läbiviimiseks koolieelses lasteasutuses."}, "objectives": [{"en": "General aim is to form the theoretical basis necessary for subject specific studies in order to prepare students to plan and analyse educational activities in pre-schools.", "et": "Üldeesmärk on valdkonnaspetsiifilistes õpingutes vajaminevate teoreetiliste aluste kujundamine, valmistamaks üliõpilasi ette kavandama ja analüüsima õppekasvatustegevust koolieelses lasteasutuses."}], "learning_outcomes": [{"en": "The student having completed the subject:\n1. knows the main principles and history of pre-school education;\n2. knows the basis and principles of planning, conducting, evaluating educational activities in kindergartens;\n3. can compile a plan of educational activities based on child-centered approach.", "et": "Õppeaine läbinud üliõpilane:\n1. Tunneb alushariduse põhimõisteid, didaktikaprintsiipe, lapse õppimise seaduspärasusi ja ajalugu.\n2. Teab lapsest lähtuva kasvatuse ja nüüdisaegse õpikäsituse olemust ja põhimõtteid ning rakendab neid õppe- ja kasvatustegevusi kavandades.\n3. Planeerib õppe- ja kasvatustegevusi lähtudes koolieelse lasteasutuse riiklikus õppekavas kirjeldatud õpikäsitusest ja koolieelse didaktika põhimõtetest.\n4. Analüüsib õppe- ja kasvatustegevust õpikäsitusest ja koolieelse didaktika põhimõtetest lähtuvalt."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}