{"uuid": "6b6a5342-dace-e8e2-e739-2f1fb9df5124", "code": "SHHI.01.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Continuous Domain- and Subject-traineeship", "et": "Sotsiaalainete õpetaja pidev praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI01", "structural_unit_name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI01", "name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "email": "educ@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 3, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course is for supporting student's professional development by creating continuous opportunities to associate studies of  domain- and subject-didactics with teacher's activities in an educational institution. As a result of continuous reflection the course creates opportunities to analyse and therefore to give an adequate evaluation to his/her knowledge, skills, attitudes and needs for professional development concerning social domain- and subject-specific competence and didactics.", "et": "Praktikaülesannete täitmine koolis või haridusasutuses (10 tööpäeva või kokku minimaalselt 40 tundi kohalolekut ja panustamist haridusasutuse töösse) vastavalt praktika ainele ja praktika juhendile. Praktika perioodi ja koha (kool või haridusasutus) võib üliõpilane ise valida. Praktikakoha puudumisel leiab koha praktika koordinaator.\n\nAinekursus toetab üliõpilase professionaalset arengut, luues võimalusi seostada sotsiaalvaldkonna- ja ainedidaktikaga seotud ülikooliõpingud pidevalt õpetaja tegevusega õppeasutuses.\n\nAinekursus toetab üliõpilase professionaalset arengut, luues võimalusi seostada valdkonna- ja ainedidaktikaga seotud ülikooliõpingud pidevalt õpetaja tegevusega õppeasutuses."}, "objectives": [{"en": "The course has two main goals that should be achieved jointly with the domain- and subject-didactics courses and pedagogical practice:", "et": "Õppeainel on kaks üldeesmärki, mis saavutatakse koos valdkonna- ja ainedidaktika õppeainete ning pedagoogilise praktikumiga:"}, {"en": "1) to support student's improvement to be a teacher by creating opportunities to associate studies of subject, domain- and subject-didactics with teacher's activities in an educational institution;", "et": "1) toetada üliõpilase kujunemist õpetajaks, võimaldades ülikoolis toimuvate aineõpingute ning sotsiaalvaldkonna- ja ainedidaktika õpingute pidevat seostamist õpetaja tegevusega õppeasutuses;"}, {"en": "2) to give a student an opportunity to perform traineeship tasks in educational institutions on different levels of education.", "et": "2) anda üliõpilasele võimalused täita praktikaülesandeid erinevatel kooliastmetel haridusasutuses."}], "learning_outcomes": [{"en": "By the end of the traineeship the student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) is able to plan teaching process and to analyze class or educational activity in the area of social studies taking into account learners' speciality, prior knowledge, needs and interests;", "et": "1) oskab analüüsida sotsiaalainete ainetundi või õppetegevust, arvestades õppijate eripära, eelteadmisi, vajadusi ning huve;"}, {"en": "2) notices educational special needs and has the potential to intervene;", "et": "2) märkab õpilase hariduslikke erivajadusi ning omab eeldusi sekkumiseks;"}, {"en": "3) is able to analyze based on his/her experience his/her competence, skills and needs related to subject and domain of social studies in order to plan his/her further actions for professional development.", "et": "3) oskab analüüsida oma kogemustele tuginedes enda aine- ja sotsiaalvaldkonnaalaseid pädevusi, oskusi ja vajadusi ning vastavalt sellele kavandada edasisi tegevusi enese professionaalseks arendamiseks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}