{"uuid": "60bf1a19-8a6f-d0af-63cf-41fe3c6db80d", "code": "SHPH.00.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Developmental Psychopathology", "et": "Arenguline psühhopatoloogia"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In lectures an overview of development of psychopathological symptoms and mental disorders, etiology and pathogenetical mechanisms of disorders and main intervention strategies will be given.", "et": "Loengutes antakse ülevaade arengulistest psühhopatoloogilistest sümptomitest ja vaimsetest häiretest, kõrvalekallete etioloogiast ja patogeneetilistest mehhanismidest ning sekkumise strateegiatest."}, "objectives": [{"en": "The goal of the course is to introduce developmental trajectories of psychopathological symptoms based on current  neurobiological and clinical data.  In lectures an overview of  psychopathological symptoms and mental disorders, aetiology and pathogenetical mechanisms of disorders will be given.", "et": "Kursuse eesmärgiks on tutvustada uute neurobioloogia ja kliiniliste alaste andmete toel psühhopatoloogiliste sümptomite arengulisi trajektoore, anda ülevaade psühhopatoloogilistest sümptomitest ja vaimsetest häiretest, kõrvalekallete etioloogiast ja patogeneetilistest mehhanismidest."}], "learning_outcomes": [{"en": "After the completion of this course the student:", "et": "Pärast kursuse läbimist on üliõpilane:"}, {"en": "- is able to notice symptoms and syndromes of mental disorders that may manifest during different age stages (mood, anxiety and conduct disorders, ADHD, eating disorders, autism spectrum disorders, psychotic syndromes etc.),", "et": "- teab  vaimse kõrvalekalde sümptomeid ja sündroome, mis võivad ilmneda erinevas vanuses (meeleolu-, ärevus- ja käitumishäired, ADHD, söömishäired, autismispektri häired, psühhootilised sündroomid)."}, {"en": "- knows the most probable causes of the common mental disorders, as well as main intervention strategies", "et": "- teab kõige tõenäolisemaid  enim levinud vaimsete häirete põhjuseid  ja peamisi sekkumise strateegiaid"}, {"en": "- knows the clinical picture of common mental disorders, their different manifestations as well as maintaining factors", "et": "- teab enim levinud vaimsete häirete kliinilist pilti, selle erinevaid versioone ja häireid alal hoidvaid mehhanisme."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}