{"uuid": "bad24c72-3d60-36a9-964c-249eb398189f", "code": "SHPH.00.041", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methods of Group Work", "et": "Grupitöö meetodid"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of group work principles, group dynamics and methods. Different types of groups, indications and limitations of their implementation, and opportunities for group work in different target groups are introduced. The ethics of group work and problematic behavior in the group are discussed.", "et": "Kursus annab ülevaate grupitöö põhimõtetest, grupidünaamikast ja meetoditest. Tutvustatakse erinevaid grupitüüpe, nende rakendamise näidustustest ja piirangutest ning grupitöö võimalusi erinevates sihtrühmades.  Arutletakse grupitöö eetilisuse ning probleemse käitumise üle grupis."}, "objectives": [{"en": "The aim of the course is to provide theoretical basis about the types of group work and implementation in the context of psychological help. The practical aspects of conducting group work are discussed. Passing the course is a prerequisite for group work methods training.", "et": "Aine eesmärk on anda teadmisi grupitöö rakendamise võimalustest ja formaatidest psühholoogilises abis. Käsitletakse grupitöö läbiviimise praktilisi aspekte. Kursuse läbimine on eeldus grupitöö meetodite treeningule."}], "learning_outcomes": [{"en": "Knows the models of group development and knows the goals and ways of managing psychological processes in a group.", "et": "Tunneb grupiarengu mudeleid ja teab psühholoogiliste protsesside juhtimise eesmärke ning viise grupis."}, {"en": "Knows the structure of group work, principles of implementation and ways of intervening in a group.", "et": "Tunneb grupitöö struktuuri, läbiviimise põhimõtteid ja grupis sekkumise viise."}, {"en": "Can distinguish different types of groups according to their goals, methods and needs of group participants.", "et": "Oskab eristada erinevat liiki gruppe nende eesmärkide, meetodite ja grupis osalejate vajaduste järgi."}, {"en": "Can describe the role, tasks and characteristics of a group leader.", "et": "Oskab kirjeldada grupijuhi rolli, ülesandeid ja omadusi."}, {"en": "Knows the ethical principles of group work.", "et": "Teab grupitöö eetilisuse põhimõtteid."}, {"en": "Can use theoretical knowledge in solving practical group work planning tasks.", "et": "Suudab kasutada teadmisi praktiliste grupitöö planeerimise ülesannete lahendamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}