{"uuid": "a9958d76-2be9-cc7a-e593-478d362e3487", "code": "SHPH.00.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-09T14:29:45", "title": {"en": "Basic Functions of the Mind", "et": "Psüühika põhifunktsioonid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides a systematic introduction to the mind. It assumes that the evolutionary function of the brain involves information processing for generating appropriate behavior.  The course looks at the main functions required for this broad aim.\n1)\tReception - sensation and perception\n2)\tRepresentation - representations and language\n3)\tRetention - memory and learning\n4)\tIntegration - executive functions and thinking\n6)\tAction - the body and movement\n5)\tGoals - motivation and emotion\nNB! Graded study activities start right in the beginning of September.", "et": "Kursuse eesmärk on anda süstemaatiline lühiülevaade psüühikast. Lähtuvalt eeldusest, et aju ja selles tekkiva psüühika evolutsiooniline otstarve on informatsiooni töötlemine käitumise juhtimiseks, vaatleb kursus peamisi selle pealisülesande täitmiseks vajalikke psüühika funktsioone.\n1) Info vastuvõtmine - kuidas meeled ammutavad keskkonnast informatsiooni, mille põhjal luuakse tajus terviklik reaalsuse kuvand.\n2) Info representeerimine - kuidas teave võib olla esindatud erinevat tüüpi märkidena (representatsioonid), mis võimaldavad seda paindlikult töödelda (keel).\n3) Info talletamine - kuidas teabe talletamine ja taaskasutamine (mälu) võimaldab käitumist muuta keskkonnale vastavaks (õppimine).\n4) Info integreerimine - kuidas erineva päritolu ja vormiga info üheaegne esindatus töömälus ja väljaspool seda võimaldab luua uut teavet (mõtlemine).\n5) Käitumise juhtimine - kuidas psüühika suhestub keskonnaga keha ja tegevuse kaudu, mille esindused ajus on üks töödeldava info liik.\n6) Eesmärgipärasus - kuidas käitumise kasulikkuse tagamiseks (motivatsioon) tõlgendab psüühika infot organismi eesmärkidest lähtuvalt (emotsioonid).\nNB! Hindelised õpitegevused algavad juba septembris."}, "objectives": [{"en": "Provide a structured introduction to the basic functions of the mind.", "et": "Anda struktureeritud lühiülevaade psüühika peamistest funktsioonidest."}], "learning_outcomes": [{"en": "- An ability to analyse the mind as an information processing system aimed at guiding behaviour.", "et": "- Oskus analüüsida psüühikat informatsiooni töötlemise ja käitumise juhtimise süsteemina."}, {"en": "- Preliminary understanding of the functions of sensation and perception; representations and language; memory and learning; executive functions and thinking; body and action; as well as motivation and emotion.", "et": "- Esmane ettekujutus, milliseid ülesandeid ja kuidas täidavad meeled ja tajumine; representatsioonid ja keel; mälu ja õppimine; töömälu ja mõtlemine; keha ja tegevus; ning motivatsioon ja emotsioonid."}, {"en": "- Knows how to read and acquire knowledge from academic texts and knows how to process information effectively -", "et": "- oskab iseseisvalt lugeda akadeemilisi tekste ja teab, millised on efektiivsed infotöötlemise viisid (töömälu ja mõtlemise teemaplokk)"}, {"en": "- Knows what are effective learning methods that support long term memory and what methods do not support memorizing materials", "et": "- teab, millised on efektiivsed, pikaajalist mäletamist toetavad õppimisviisid ja millised ei ole (mälu ja õppimise teemaplokk)"}, {"en": "- Knows how to plan studding during academic course", "et": "- oskab oma aega õppimisele planeerida"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}