{"uuid": "09c44c48-aa31-9633-c4d7-b74e390b8e15", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-05T11:40:51", "title": {"en": "Religion and Politics", "et": "Religioon ja poliitika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 4, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Religion and politics is by definition an interdisciplinary domain of academic research. This course introduces the study of religion and politics from social scientific perspective in general, and from perspectives of comparative politics and international relations in particular. \nThe course is organized in two parts. First half of the course focuses on analytic tools, conceptualization of key terms, typologies, categories and theoretical approaches used by studies of religion and politics in the disciplines of comparative politics and international relations. \nSecond part of the course is devoted to the study of empirical processes and patterns of interaction between religion and politics in Western and Eastern Europe, and in traditionally Lutheran, Catholic and Orthodox cultures, in the Middle East, North and South America, and in Asian countries.", "et": "Religioon ja poliitika on üldise akadeemilise uurimise objektina interdistsiplinaarne on juba definitsiooni poolest. Sellel kursusel lähenetakse religiooni ja poliitika uurimisele sotsiaalteaduslikust, täpsemalt võrdleva poliitika ja rahvusvaheliste suhete, vaatenurgast. Kursus on organiseeritud kahes osas. Esimeses käsitletakse analüütilisi vahendeid, võtmemõistete kontseptualiseerimist, tüpoloogiaid, kategooriad ja teoreetilisi lähenemisi, mida kasutatakse nii võrdlevas poliitikas kui rahvusvahelistes suhetes religiooni ja poliitika uurimisel. \nKursuse teises pooles uuritakse religiooni ja poliitika suhteid Lääne- ja Ida-Euroopas ning võrdlevalt ka traditsiooniliselt luterlikes, katoliiklikes ja õigeusklikes kultuurides, Lähis-idas, Põhja- ja Lõuna Ameerikas ning Aasias."}, "objectives": [{"en": "1. To cultivate in students an understanding of the distinctively social scientific (in particular comparative politics and international relations) approach to studying religion and politics. ", "et": "1. arendada tudengites võimet uurida ja mõtestada religiooni ja poliitikat sotsiaalteaduslikult (iseäranis võrdleva poliitika ja rahvusvaheliste suhete lähenemiste kohaselt)  "}, {"en": "2. to give an overview of the main approaches and concepts, models and theories that are used in academic study of religion and politics", "et": "2. tutvustada tudengitele peamisi religiooni ja poliitika uurimisel kasutatavaid lähenemisi ja mõisteid, mudeleid ja teooriaid "}, {"en": "3. to give an overview of the development and manifestations of religion and politics in the contemporary world", "et": "3. anda ülevaade peamistest religiooni ja poliitika kokkupuute punktidest ja arengusuundadest tänapäeva maailmas "}, {"en": "4. to bring examples how various social, political and religious institutions and groups have used religion for different (often contradictory) political purposes", "et": "4. tuua näited sellest, kuidas erinevad ühiskondlikud, poliitilised ja usulised ühendused ja institutsioonid on kasutanud religiooni erinevatel (ja tihti vastandlikel) poliitilistel eesmärkidel"}], "learning_outcomes": [{"en": "After competing the course, the student should:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "1. have an understanding of the key debates related to social scientific study of religion and politics;", "et": "1. tunneb peamisi kaasaegse sotsiaalteadusliku religiooni ja poliitika uurimisega seotud akadeemilisi debatte  "}, {"en": "2. know how to go about analyzing the themes, dimensions and aspects of religion and politics from social scientific perspective and be familiar with central concepts and theories as well as analytical approaches, typologies and categories used in the disciplines of comparative politics and international relations;", "et": "2. oskab analüüsida religiooni ja poliitikaga seotud teemasid, valdkondi ja aspekte sotsiaalteaduslikust lähenemisest lähtudes ning tunneb keskseid mõisteid ja teooriaid, analüütilisi lähenemisi, tüpoloogiaid ja kategooriaid, mida kasutatakse võrdleva poliitika ja rahvusvaheliste suhete lähenemiste puhul "}, {"en": "3. have an understanding of key areas in which religion and national politics and-both religion and international relations interact;", "et": "3. omab arusaamist peamistest (alateema)valdkondadest, kus religioon ja rahvuslik politiika ning religioon ja rahvusvaheline poliitika kokku puutuvad"}, {"en": "4. have an awareness of the ways how cultural, confessional, historic, economic and political contexts mold the patterns of religion and politics interaction;", "et": "4. omab arusaamist sellest, kuidas mõjutab religiooni ja poliitika suhteid kultuuriline, konfessionaalne, ajalooline, majanduslik ja poliitiline kontekst."}, {"en": "5. be able to identify the similarities and differences in ways how religious actors relate to political regimes and cultural communities, to political processes and public policies;", "et": "5. oskab tuvastada sarnasusi ja erinevusi viisides, kuidas erinevad usulised toimijad suhestuvad riigi ja kultuurkogukonna, poliitiliste protsesside ja avaliku poliitika tulemitega.  "}, {"en": "6. have the ability to undertake independent social scientific research of religion and politics ", "et": "6. oskab iseseisvalt ja sotsiaalteadusliku lähenemise kohaselt religiooni ja poliitikat uurida"}, {"en": "7. be able to carry on an informed and informing conversation with others about the issues and problems related to religion and politics.", "et": "7. oskab religiooni ja poliitikaga seotud küsimuste ja probleemidega seotud arutelusid mõista ning neisse aruteludesse ka iseseisvalt panustada."}], "notes": {}}, "grading": {"independent_work": {"et": "- 24%, short in-class exercises (12x2p)\n- 36%, tests (12 x 3p - tests will be from 2nd week until 14th week of the semester)\n- 8%, outline of home assignment\n- 24%, home assignment\n- 4%, peer assessment of home assignments\n- 4%, 2 reflective mini-essays (4-5 sentences each) \"what did I learn from paper presentations\"\n- 4%, presentation (and response to comments from peer reviewer and instructor) of home assignment"}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "due_date": "2024-04-10", "description": {"et": "OUTLINE of HOME ASSIGNMENT. \nPresent: a. theme of study, b. case or cases your study (a case can be a country, religious or political actor or institution, conflict, electoral campaign etc), c. Specify time period you focus on and source data (information sources) you have an access to and will be using in addition to academic articles (laws, media coverage, survey data, social media data, speeches etc), 4. list of related thematic literature (at least 4 articles, book chapters or monographs) that you will be using in the study (in case of need you can omit or add sources later). Upload to Moodle in the form of docx or pdf. Deadline: April 10, 2024."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "due_date": "2024-05-13", "description": {"et": "HOME ASSIGNMENT. \nYou are free to chose any case and theme that is related to religion and politics or religion in International Relations (IR).\n1. Select an empirical case (or cases) to be studied (for example, president of France Emmaanuel Macron's 2020 measures against radical Islamism).\n2. Identify research theme(s) that are related and relevant for the study of this empirical case (or cases) (laicism as French version of secularism, governance of religious minority, securitization of minority religion, civil religion or some other theme).\n3. Use at least 4 academic articles or chapters from edited volumes for the analysis (if you use monographs, then one monograph equals to two academic articles/chapters) of the research themes (this review of literature does neither describe nor study directly the empirical case(s) that you chose; review of literature deals with previous and pre-existing studies on themes relevant for the study of the empirical case of your choice). Review of literature can function as a theoretical framework in your study.\n4. present findings in an organized manner. \n5. Total length of the assignment is between 3 and 4 pages (paragraph spacing 1, from Introduction up to the list of References).\n6.Upload your paper to Moodle by May 13, 2024."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "WEEKLY TESTS (in Moodle, deadline 72h after the class, on required literature and on the content discussed in the class of the related week (starting from week 2 and up to paper presentation seminars)"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2024-05-20", "description": {"et": "peer assessment of home assignments"}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "due_date": "2024-05-20", "description": {"et": "2 reflective mini-essays (4-5 sentences each) \"what did I learn from paper presentations\""}}, {"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "due_date": "2024-05-20", "description": {"et": "presentation (and response to comments from peer reviewer and instructor) of home assignment"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "short in-class exercises, where students rehearse the application of concepts, approaches and methods on case studies, starting from 2nd week"}}], "grade_preconditions": {"et": "1. Upload home assignment and an outline of home assignment in Moodle in proper time. Late submissions are allowed only in extraordinary circumstances and if the instructor has been informed beforehand.\n2. Positive grade (over 14 points out of 28) of the course paper (assessment is based on the criteria listed in the instructions for the home assignment).\n3. The sum total of tests on required study materials and on the content discussed in lectures/class must be over 18 points (out of 36)."}, "grade_evaluation": {"et": "- 24%, short in-class exercises (12x2p)\n- 36%, tests (12 x 3p - tests will be from 2nd week until 14th week of the semester)\n- 8%, outline of home assignment\n- 24%, home assignment\n- 4%, peer assessment of home assignments\n- 4%, 2 reflective mini-essays (4-5 sentences each) \"what did I learn from paper presentations\"\n- 4%, presentation (and response to comments from peer reviewer and instructor) of home assignment"}, "debt_elimination": {"et": "Make-ups will be allowed only in case of exceptional, documented circumstances (serious illness, etc)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "About 25 pages reading for each seminar. Class conspectus (slides) will be uploaded to Moodle after each class.", "recommended_materials": "1. Jeffrey Haynes (ed.) (2022) The Routledge Handbook of Religion, Politics and Ideology. London and New York: Routledge.\n2. Christine Schliesser et al (2021) On the Significance of Religion in Conflict and Conflict Solution. London and New York: Routledge.\n3. Jeffrey Haynes (ed.) (2021) Handbook on Religion and International Relations. Cheltenham, UK; Northampton, MA: Edward Elgar.\n4. Luca Ozzano (2020) The Masks of the Political God: religion and Political Parties in Contemporary Democracies. Lanham: ECPR Press, Rowman & Littlefield.\n5. Eva-Maria Euchner (2019) Morality Politics in a Secular Age: Strategic Parties and Divided Governments in Europe. Cham: Palgrave Macmillan.\n6. Zeev Maoz and Errol A. Henderson (2020) Scriptures, Shrines, Scapegoats, and World Politics: Religious Sources of Conflict and Cooperation in the Modern Era. Ann Arbor: University of Michigan Press"}, "participants": {"lecturers": [{"person_uuid": "1a225f08-5974-10f7-ef3a-114e3110eaef", "person_name": "Alar Kilp", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction to the course. Social scientific study of religion in politics/IR. Overview of (sensitive, controversial) themes of religion and politics."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Concepts, typologies, approaches and analytic models in the study of religion in politics. Religion, state and political community, secularization, church and state relations. Secularism as Western, as colonial. Secularization of state, secularization of political process, secularization of marriage (and gender relations). Social secularization."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Religion, legitimacy, law and order. Religion, human rights and democracy. Pre-battle ritual of \"absolution from sins\".  Religious legitimation of traditional and progressive values. World religions and democratization. Human rights in world religions."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Religion in international relations (violence, war, terrorism, conflict escalation). Is religiously legitimated conflict-war more violent? Spiritual security. Religious leaders in global politics. Civilizational politics. Which one of world religions is least violent and which one most intolerant?"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Religion in international relations (dialogue, peace-building/peace-making, transitional justice, conflict solution, conflict de-escalation)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (1): politics of religion in European Union, religion and majority/minority identity in Europe. Euro-secularism (European law on religion). Counter-radicalization. Normative power Europe in foreign policy. European civil religion. Anti-islamophobia, anti-racism. State policies regarding Jehovah's Witnesses."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (2):  religion and politics in traditionally Protestant cultures: Estonia, Latvia, Scandinavia. Church and state relations, religion and nationalism, religiously oriented parties, politics of morality, social value orientations."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (3): religion and politics in traditionally Catholic cultures: Poland and France. Path dependence. Laicism in France. Catholicism in Americas. (Anti-)Gender Ideology. Catholic church in religious market. Politics of class, religion and populism. Pope in IR."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (4): religion and politics in traditionally Orthodox cultures: church and state in Russian Federation. Russian Orthodox Church in international and inter-Orthodox relations. Securitization of Orthodoxy. Sobornost and nationalizing imperialism in patriarch Kirill's religious conception of the 'Russian World'."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar on course paper. Discussion of paper outlines."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (5): religion, politics and IR in the United States and South America. (Presidential) elections, preferences of the religious electorate, religious market. Politics of secularism and religious freedom in domestic and international relations."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (6): religion, politics and IR in the Middle East. Religion and Social Movements. Israel, Syria, Iraq, Arab Spring, the Islamic State. Islamic law and political regime/democracy. 'Arab gap'. Islamic parties. Moderate Islamism. Social value orientations."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (7): Asia (1): Religion and politics in India. Diversity and Secularism in India. Hinduism, Buddhism and politics. Hindutva. Ideological profile of Narendra Modi. Buddhist Socialism and Buddhist nationalism in Asian countries of Theravada and Mahayana Buddhist tradition."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EMPIRICAL (8): Asia (2): Religion and politics in China and Central Asia. Confucianism and political regime. Religion in Chinese nationalism. Uyghurs in Xinjiang."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Presentation and discussion of papers."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Presentation and discussion of papers."}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 44}, "parent_uuid": "886b4827-d5c0-8d69-d556-bed208f61ef6", "parent_code": "SHRG.02.002", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}