{"uuid": "60807624-0d0a-0b0d-6c6a-f766770acc6b", "code": "sv-2018-autumn-fulltime-c6-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Public Governance", "et": "Kaasaja valitsemine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "18/19 A regular SV Eng", "et": "18/19 S PÕ SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course provides an overview of the definitions, concepts, and theories of governance and explores the emergence of new governance arrangements in relation to the traditional public administration (TPA) and New Public Management (NPM) in the operation of public sectors around the world. The course focuses on the implications of governance on public policy-making and service delivery and includes case discussions of the issues and challenges of various instruments of public action for effectiveness and democratic accountability.", "et": "Kursus teeb ülevaate nn. \"uue valitsemise\" <i>(new public governance)</i> paradigmast kaasaja demokraatlike ühiskondade valitsemises ning vaatleb selle esilekerkimist võrdlevas perspektiivis traditsioonilise avaliku halduse ja uue haldusjuhtimise mudelitega. Kursuse fookus on suunatud nn. \"valitsemise\" <i>(governance)</i> perspektiivi tagajärgede uurimisele halduspoliitikate kujundamisel ja elluviimisel. Lisaks loengutele vaadeldakse juhtumianalüüside käigus erinevate nn. \"valitsemise\" instrumentide kasutusvõimalusi ning nende mõju halduspoliitikate tulemuslikkusele ning demokraatlikule aruandlusele."}, "objectives": [{"en": "This is a course about public governance that introduces students to governance in public administration and public policy. In this course, students learn about the new approaches to solving public problems in the rapidly changing context of managing public affairs where the achievement of public purposes is increasingly dependent on the interactions between the state, market, and civil society actors in self-organizing inter-organizational governance arenas.", "et": "Kaasaja valitsemine on magistritaseme kursus, mis annab ülevaate avaliku sektori tomimises toimunud arengutest kaasaja demokraatlikes ühiskondades. Kursus keskendub nn. \"valitsemise <i>(governance)</i> paradigma esilekerkimisele ning halduspoliitikate kujundamisele ja elluviimisele keskkonnas, kus avalike probleemidele lahendamine sõltub järjest enam riigi, erasektori ja kodanikeühenduste omavahelisest koostööst."}], "learning_outcomes": [{"en": "Upon completion of this course, the students will be able to:", "et": "Kursuse läbinud üliõpilased:"}, {"en": "1) comprehend the evolution of the modes of public action in the operation of public sectors that have led to the emergence of new public governance;", "et": "1) omavad ülevaadet avaliku halduse arenguperspektiividest, mis on viinud nn. \"valitsetuse\" <i>(governance)</i> paradigma esilekerkimiseni;"}, {"en": "2) be able to explain the meanings of the major concepts of governance;", "et": "2) oskavad seletada \"valitsetuse\" kontseptsiooniga seotud mõisteid;"}, {"en": "3) identify and assess the principles, practices, and instruments of public action in the age of governance;", "et": "3) oskavad hinnata \"valitsetuse\" paradigmaga seotud halduspoliitika instrumente ning tunnevad nende kasutamise võimalusi ja piiranguid;"}, {"en": "4) be able to critically analyze and evaluate the impact of various forms of governance on policy effectiveness and democracy;", "et": "4) oskavad kriitiliselt hinnata \"valitsetuse\" instrumentide mõju valitsemise efektiivsusele ja demokraatlikule aruandlusele;"}, {"en": "5) master the basic skills of desiging, writing, and presenting a comparative analysis on the governance of a chosen issue.", "et": "5) on võimelised kavandama, läbi viima ja suuliselt ette kandma võrdleva analüüsi \"valitsetuse\" teemal."}], "notes": {}}, "grading": {"independent_work": {"et": "<b>(1) Weekly tasks.</b> Students are expected to complete the required reading prior to class and post their weekly tasks to the course website on Moodle 24 h before class. Weekly task assignments (1-2 pages single-spaced, 12 pt Times New Roman) should carefully follow the instructions provided in the course schedule below. Each task is different and may involve application of the required reading for the analysis of a real-life phenomenon, independent desk-research with various sources, analysis of policy papers etc. Each week students should be prepared to share their responses and contribute to the discussion during the seminar.\n\n<b>(2) Class participation.</b> Much of the learning experience in this course depends on interaction, so class participants are expected to come to class fully prepared to discuss the weekly readings and present their homework to the rest of the class members. Overall class participation will be judged based on active contributions to class discussions including asking/answering questions, and providing examples.\n\n<b>(3) Case analysis or debate.</b> Each student will be responsible for either completing a case analysis or debating an issue in the classroom associated with the topics covered during the course. Students will sign up for cases and debates during the first week of class. Both assignments involve submitting a written paper with your case analysis or debate notes (3-4 pages, single-spaced, 12 pt Times New Roman) 24 h before class. For more detailed requirements see the assignment sheet attached to the course syllabus.\n\n<b>(4) Comparative analysis assignment.</b> This course includes a comparative analysis assignment that develops students' writing skills, and helps draw connections between the theoretical knowledge acquired in the classroom and the real world of governing societal problems. For this assignment, you will choose a public problem of interest to you and compare its governance across at least two sites of rule. The governance arenas may include nation-states, regions, local governments, or other spaces of interest. The comparative analysis assignment will include four sub-tasks: (1) comparative analysis proposal, (2) discussion of another student's proposal (3) comparative analysis report, and (4) comparative analysis presentation. For more detailed requirements on how to complete this components of the course and deadlines see the assignment sheet attached to this syllabus."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "due_date": "2018-10-10", "description": {"et": "Comparative analysis proposal should be submitted 24 hours before class, i.e. by October 10th before 14.15 via Moodle. Requirements and grading criteria are outlined in the assignment sheet attached to the syllabus."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "due_date": "2018-10-11", "description": {"et": "Discussion of another student's proposal. No written work needs to be submitted, however, students come prepared to discuss and provide feedback to a proposal assigned to them. Requirements and grading criteria are outlined in the assignment sheet attached to the syllabus."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "due_date": "2018-11-26", "description": {"et": "Comparative analysis report is submitted by Monday, November 26th via Moodle. Requirements and grading criteria are outlined in the assignment sheet attached to the syllabus."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "due_date": "2018-11-29", "description": {"et": "Presentation of comparative analysis assignments takes place in two sessions on November 29th and December 6th (NB! Pre-registration needed for a time slot!). Requirements and grading criteria are outlined in the assignment sheet attached to the syllabus."}}], "grade_preconditions": {"et": "Completion of all course requirements."}, "grade_evaluation": {"et": "Students will be evaluated on the basis of (1) weekly tasks, (2) class participation, (3) case analysis or debate, and (4) comparative analysis assignment (composed of four sub-tasks).\n\nWeekly tasks - 40%\nClass participation - 15%\nCase analysis or debate - 15%\nComparative analysis assignment that contains four sub-tasks: 30%\n(1) Comparative analysis proposal: 5p\n(2) Discussion of another student's proposal: 5p\n(3) Comparative analysis report: 15p\n(4) Comparative analysis presentation: 5p\n\nThe grading scale will be as follows:\n100-91 points A\n90-81 points B\n80-71 points C\n70-61 points D\n60-51 points E\n50-0 points F"}, "debt_elimination": {"et": "Detailed requirements for each individual assignment are outlined in the course syllabus."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Course materials are available on Moodle."}, "participants": {"lecturers": [{"person_uuid": "b4e5d643-b72d-f929-c6bc-2fe3e46d836f", "person_name": "Kristina Muhhina", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2018-09-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 1: Introduction to the course</b>\n\nNB! Course syllabus and all reading materials are posted to Moodle!\n\nThe first class of the semester will introduce students to the topics and requirements of the course. We will review the basics of making and managing public policy, and recall the necessary material covered in undergraduate courses. Special attention will be paid to exploring the changing context of public policy and the implications involved for designing and implementing public action. We will lay out a roadmap for the exploration of public governance in the sessions to come.\n\nRequired reading:\n(1) Bovaird, T. & E. Löffler (2009). The changing context of public policy. In T. Bovaird & E. Löffler (Eds.), Public management and governance (pp. 15-26). London: Routledge.\n(2) Stoker, G. (1998). Governance as theory: Five propositions. International Social Science Journal 50, (1), 17-28.\n</br>"}}, {"time": "2018-09-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 2: The concept of governance - an interdisciplinary view</b>\n\nSecond week of the course will be devoted to exploring the concept of 'governance' in the sub-fields of political science and related disciplines. We will discuss the similarities and differences between various definitions and explore the utility of the concept. Also, we will try to find a common ground between the various approaches by turning to the theory of (new-)institutionalism.\n\nRequired reading:\n(1) Bevir, M. (2012). Governance: A very short introduction. Oxford: Oxford University Press. Chapter 1 (pp. 1-15).\n(2) Kjaer, A. (2004). Governance. Cambridge, UK: Polity Press. Chapter 1 (pp. 1-18).\n(3) Van Kersbergen, K. & F. Van Waarden (2004). Governance as a bridge between disciplines: Cross-disciplinary inspiration regarding shifts in governance and problems of governability, accountability, and legitimacy. European Journal of Political Research 43 (2), 143-171.\n</br>"}}, {"time": "2018-09-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 3: Governance in public administration and public policy</b>\n\nIn the third session, we will turn our attention to the notion of governance in public administration and public policy. We will discuss the reasons for the emergence of the governance perspective, and the rise of the 'post-bureaucratic' paradigm in public administration. You will learn how the modern state was transformed as the result of several waves of public sector reform in the late 20th century. You will understand how the subsequent changes in the structures and processes of governing have shaped the environment of public policy leading to an expanded policy domain that reaches beyond the traditional public bureaucracy.\n\nRequired reading:\n(1) Kjaer, A. (2004). Governance. Cambridge, UK: Polity Press. Chapter 2 (pp. 19-58).\n(2) Osborne, S. P. (2010). The New Public Governance? Emerging perspectives on the theory and practice of public governance. New York: Routledge. Chapter 1 (pp. 1-16).\n</br>"}}, {"time": "2018-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 4: Modes of governance: hierarchies, markets, and networks I</b>\n\nAs the result of the succession of public sector reforms, and the changing context of public policy, we can differentiate between at least three modes of orchestrating collective action that characterize the governing processes of contemporary societies: hierarchies, markets, and networks. We will explore the manifestation of these governing styles through case analyses from across the public sectors around the world. Students are encouraged to think about the changing mix of governance styles in the making and managing of public policy of their interest.\n\nRequired reading:\n(1) Bell, S. & Hindmoor, A. (2009). Rethinking governance: The centrality of the state in modern society. Cambridge: Cambridge University Press. Chapters 1, 2 & 3 (pp. 1-70).\n</br>"}}, {"time": "2018-10-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 5: Modes of governance: hierarchies, markets, and networks II</b>\n\nIn the fifth session we will discuss what policy-making and implementation is like in a network society where policy develops in complex networks of governmental and nongovernmental actors. We will focus on how policy is made and managed in these inter-organizational, multi-stakeholder settings, and examine the implications for solving public problems. Further, we will ask what is the role of modern states in contemporary governance processes (are they really being 'hollowed out'?), and what is the states' capacity to steer society in the era of markets and networks. \n\nRequired reading:\n(1) Klijn, E. H. & J. Koppenjan. (2016). Governance networks in the public sector. London: Routledge. Chapters 1-2 (pp. 1-39).\n(2) Klijn, E. H. (2008). Policy and implementation networks: Managing complex interactions. In S. Cropper, C. Huxham, M. Ebers, & P. S. Ring (Eds.), Oxford handbook of interorganizational relations (pp. 118-146). Oxford: Oxford University Press.\n</br>"}}, {"time": "2018-10-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 6: Presentations of comparative analysis proposals</b>\n\nThis week we will hear students' presentations of their proposals for comparative analysis of governance (for more detailed requirements see the assignment sheet in the appendix of the syllabus). Be prepared to discuss and provide feedback to a student paper assigned to you.\n</br>"}}, {"time": "2018-10-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 7: Tools of governance</b>\n\nWhat does governance imply for policy implementation? This week we will focus on the technology of public action, and discuss the changing mix of policy tools used for putting policies into effect. We will explore the features and characteristics of policy instruments applied in the age of governance. We will also try to determine whether governments have undergone a shift in their choice of methods for public intervention, and if so, what are the implications for various stakeholders involved in the policy process?\n\nRequired reading:\n(1) Salamon. L. (2002). The new governance and the tools of public action: An introduction. In L. Salamon (Ed.), The tools of government: A guide to the new governance (pp. 1-47). Oxford: Oxford University Press.\n(2) Jordan, A., Wurzel, R. K. W., & Zito, A. (2005). The rise of 'new' policy instruments in comparative perspective: Has governance eclipsed government? Political Studies 53: 477-496.\n(3) Lascoumbes, P. & Le Gales, P. (2007). Introduction: Understanding public policy through its instruments - From the nature of instruments to the sociology of public policy instrumentation. Governance 20 (1): 1-21.\n</br>"}}, {"time": "2018-10-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 8: Governance and democracy</b>\n\nIn this class we will examine the implications of the emergence of governance for democracy. We will discuss the challenges of governance to democracy, policy legitimacy, and accountability by posing the following questions: What are the democratic effects of governance? Do new arrangements of public action advance democracy or, on the contrary, pose problems for embedding public decisions in popular sovereignty? Does governance require a re-conceptualization of democracy? What are the mechanisms of participative governance that could be used for those purposes?\n\nRequired reading:\n(1) Hupe, P. & Edwards, A. (2012). The accountability of power: Democracy and governance in modern times. European Political Science Review 4 (2), 177-194.\n(2) Klijn, E. H. & J. Koppenjan. (2016). Governance networks in the public sector. London: Routledge. Chapters 9-10 (pp. 207-239).\n(3) Torfing, J., Peters, B. Guy, Pierre, J., Sørensen, E. (2012). Assessing and improving the democratic quality of interactive governance. In Interactive Governance: Advancing the Paradigm (pp. 187-207). Oxford: Oxford University Press.\n</br>"}}, {"time": "2018-11-01", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 9: 'Good governance' and institutional reform in development</b>\n\nThis week's session will be devoted to exploring 'good governance' in international development and its implications for public sector institutional reform in developing and transition countries. We will explore the public sector reform strategies of various agents of development aid, and evaluate the content and implications of their models and menus of institutional reform. We will also ask what could be the alternatives to the prevailing agenda of 'good governance' and how the currently prevailing orthodox model of institutional reform could be redefined. \n\nRequired reading:\n(1) Andrews, M. (2013). The limits of institutional reform in development: Changing rules for realistic solutions. Cambridge: Cambridge University Press. Chapters 1 & 2.\n(2) Brinkerhoff, D. W. & Brinkerhoff, J. M. (2015). Public sector management reform in developing countries: Perspectives beyond NPM orthodoxy. Public Administration and Development 35 (4), 222-237.\n(3) Grindle, M. S. (2004). Good enough governance: Poverty reduction and reform in developing countries. Governance 17 (4), 525-548.\n</br>"}}, {"time": "2018-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 10: Global governance</b>\n\nIn this session we will focus our attention to global governance as a perspective on contemporary world politics. We will explore the actors and arenas of transnational governance and familiarize ourselves with the new institutional forms of collective rule making and service delivery. \n\nRequired reading:\n(1) Dingwerth, K. and P. Pattberg. (2006). Global governance as a perspective on world politics. Global Governance 12 (2): 185-203.\n(2) Hale, T. & D. Held (2011). Handbook of transnational governance: Institutions and innovations. Cambridge, UK: Polity. Chapter 1 (pp. 1-36).\n</br>"}}, {"time": "2018-11-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 11: Governance and areas of limited statehood</b>\n\nIn this session we will explore a burgeoning stream of scholarship on governance in the areas of limited statehood (ALS). We will try to make sense of the variety of state and non-state governors and distinct modes of governance in the internationalized sites of rule in the Global South. Students will explore implications for normative political theory and policy of external actors.\n\nRequired reading:\n(1) Risse, T. (2011). Governance in areas of limited statehood: Introduction and overview. In T. Risse (Ed.), Governance without a state? Policies and politics in areas of limited statehood (pp. 1-35). New York: Columbia University Press.\n(2) Select one for Week 12 task:\n* Schäferhoff, M. (2014). External actors and the provision of public health services in Somalia. Governance 27 (4): 675-695.\n* Hönke, J. & C. R. Thauer (2014). Multinational corporations and service provision in Sub-Saharan Africa: Legitimacy and institutionalization matter. Governance 27 (4): 697-716.\n* Beisheim, M., Liese, A., Janetschek, H., & J. Sarre (2014). Transnational partnerships: Conditions for successful service provision in areas of limited statehood. Governance 27 (4): 655-673.\n</br>"}}, {"time": "2018-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 12: Independent work on papers</b>\n\nThere is no class this week. Please work on your comparative analysis assignment and prepare for the presentations the following week.\n</br>"}}, {"time": "2018-11-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 13: Presentation of comparative analyses I <i>(NB! Need to pre-register for a time slot!)</i></b>\n\nFirst set of presentations: Students present their comparative analyses to the rest of the class.\n</br>"}}, {"time": "2018-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 14: Presentation of comparative analyses II <i>(NB! Need to pre-register for a time slot!)</i></b>\n\nSecond set of presentations: Students present their comparative analyses to the rest of the class.\n</br>"}}, {"time": "2018-12-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Session 15: Critique of governance and course wrap-up</b>\n\nIn the final session we will sum up the course by looking at the ways in which the governance theory has been critiqued, highlight the unresolved issues, and outline a future research agenda for the students of governance and public policy.\n\nRequired reading:\n(1) Eagleton-Pierce, M. (2014). The concept of governance in the spirit of capitalism. Critical Policy Studies 8 (1): 5-21.\n</br>"}}]}, "registration_info": {"audience": {"et": "Graduate students of DG curriculum and other interested"}, "min_students": 15, "max_students": 30}, "parent_uuid": "59c4b9cd-ae84-5efd-044c-1c494ac33b55", "parent_code": "SHRG.02.020", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}