{"uuid": "c28e1547-6ac9-8912-dd52-849e0185a99e", "code": "SHRG.00.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Academic Writing and Speaking in Estonian", "et": "Eesti keele suuline ja kirjalik väljendusõpetus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course introduces the peculiarities and types of oral and written self-expression. The written self-expression focuses on scholarly texts. The oral self-expression deals with both, individual public speech as well as public debate (parliamentary debate). Students will learn how to develop and structure a text (both oral and written). The course will develop students' argumentation and contra argumentation skills. The course offers also an introduction into demagogy and provides hints on how to overcome it if one faces them in a discussion/debate. Students will get suggestions how to improve their public speaking skills in order to make speaking more efficient, as well as they will learn about the importance of body and paralanguage (non-verbal self-expression). Students will prepare several assignments through which they will learn how to draw up a well-argued and coherent written text. In addition, students will participate in a video training and a mini debate tournament.", "et": "Kursuses tutvustatakse erinevaid suulise ja kirjaliku eneseväljenduse eripärasid ja liike. Kirjalik eneseväljendus keskendub eelkõigile teaduslikule tekstile. Suuline eneseväljendus tegeleb nii individuaalse avaliku kõne kui ka avaliku väitlusega (parlamentaarne väitlusformaat). Kursuse käigus õpivad tudengid teksti (nii suulise kui ka kirjaliku) koostamist ja struktureerimist. Samuti õpetatakse argumenteerimist ning vastuargumenteerimist. Kursus õpetab ka demagoogiavõtete äratundmist ning annab soovitusi, kuidas nendega tegeleda. Lisaks antakse soovitusi, kuidas muuta oma esinemine mõjusamaks, mida silmas pidada keha- ja parakeele kasutamisel (mitteverbaalne eneseväljendus). Tudengid teevad mitu kodutööd, mille käigus nad õpivad koostama hästi argumenteeritud ja loogilist kirjalikku teksti, lisaks on kursusesse integreeritud videotreening ning miniväitlusturniir."}, "objectives": [{"en": "- to develop students' knowledge of Estonian grammar and writing in Estonian, in particular working with scholarly texts;", "et": "- arendada kirjaliku väljenduse oskust, eelkõige töötamist teadusliku tekstiga;"}, {"en": "- to develop oral expression skills, including both individual public speech as well as public debate;", "et": "- arendada suulise väljenduse oskusi, sh arenda nii individuaalse kõne kui ka väitlusoskusi"}, {"en": "- to familiarise with the main language reference resources and teach how to use them.", "et": "- anda ülevaade olulisematest keelehooldeallikatest ja õpetada nende kasutamist."}], "learning_outcomes": [{"en": "Students who have successfully passed the course:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "- are able to compose concise motivation letter;", "et": "- oskab koostada sisukat ja hästi struktureeritud motivatsioonikirja;"}, {"en": "- are able to analyse scholarly text and summarise it properly;", "et": "- suudab analüüsida teaduslikku teksti ning koostada selle põhjal kirjalik kokkuvõte;"}, {"en": "- are able to assess the quality of scholarly texts written by other students and edit them if necessary;", "et": "- oskab hinnata kaastudengite poolt koostatud akadeemilise teksti kvaliteeti ning seda vajadusel redigeerida;"}, {"en": "- are able to express their thoughts in a clear, grammatically and stylistically correct manner;", "et": "- oskab oma mõtteid väljendada õigekeelselt, ühemõtteliselt ja sobiva stiiliga;"}, {"en": "- have knowledge of developing a public speech (inc. non-verbal self-expression) and are able to deliver the speech; ", "et": "- omab avaliku kõne koostamiseks vajalikke alusteadmisi (sh mitteverbaalne eneseväljendus) ning suudab iseseisvalt kõnega esineda; "}, {"en": "- know how to develop argumentation to defend their point of view and are able to defend it in a public debate;", "et": "- oskab välja töötada argumentatsiooni oma seisukoha kaitseks ning on suuteline seda tegema elavas debatis;"}, {"en": "- recognise and react properly to demagoguery; ", "et": "- tunneb ära ja oskab sobivalt reageerida demagoogiavõtetele;"}, {"en": "- are able to assess critically their written and oral expression skills and are able to find solutions to overcoming occurring weaknesses regarding these skills.", "et": "- oskab kriitiliselt hinnata oma suulise ja kirjaliku väljenduse oskust ning suudab leida lahendusi sellega seotud võimalikele probleemidele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}