{"uuid": "c2602e9b-628e-1db3-a602-fa3325ab372e", "code": "sv-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:15:56", "title": {"en": "Conflict Management and Resolution", "et": "Konfliktiohjamine ja lahendamine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 18, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course explores the nature of different kinds of conflicts. It examines the prevention, management and the eventual resolution of various types of conflict that originate from inter-state and inter-group competition, and expands the existing scope of conflict management and resolution theories through the examination of emerging theories on the identity, power and structural dimensions of adversarial relationships. It discusses issues related to legality of war and legitimacy of the warring state; international peace-keeping, peace-building and peace enforcement; conflict mediation, negotiations, dialogical practices and expected outcomes in the form of reconciliation and power-sharing models.", "et": "Kursuse käigus käsitletakse erinevate rahvusvaheliste ja siseriiklike konfliktide lahendamiseks kasutatavaid strateegiaid ja meetodeid. Rahvusvahelistest konfliktidest tulenevad julgeolekuohud on säilitanud aktuaalsuse viimase aastakümne jooksul ja võimalused konfliktide eskaleerumiseks on suurenenud peale 11. septembrit 2001. Uuritakse eksisteerinud või eksisteerivate konfliktide arenguid ning vaadeldakse, missugused võiksid olla optimaalsed meetodid ühe või teise konflikti reguleerimisel. Arutletakse erinevate institutsioonide rolli konflikti reguleerimisel ja rahu vahendamisel. Seminarides anallüüsitakse erinevate konfliktide tekkepõhjusi, dünaamikat ja lahenduste väljavaateid."}, "objectives": [{"en": "The course is designed to examine the various approaches that have been developed to understand conflict in its different forms. It explores the ways in which actors conceptualize and seek how to deal with conflicts, by examining a variety of contemporary methods of conflict management, in particular through a consideration of the concerns of state and multilateral actors in the international system.", "et": "Magistriõppe kursus käsitleb rahvusvaheliste ja rahvusvahelist mõõdet omavate siseriiklike konfliktide, s.h. relvakonfliktide olemust, arengut, tunnuseid, põhjuseid ning lahendusi. Arutletakse erinevate konfliktide lahendusmeetodite üle."}], "learning_outcomes": [{"en": "Upon completion of the course, the participating students will be able to:", "et": "Ainekursuse läbimisel on tudengid:"}, {"en": "1) understand the nature and transformation of intra-state and international conflicts;", "et": "1) omandanud teadmised siseriiklike ja rahvusvaheliste konfliktide olemusest;"}, {"en": "2) explore and analyse the causal factors contributing to conflict escalation;", "et": "2) suutelised analüüsima konfliktide tekke ja nende edasiste laienemiste põhjuslikke seoseid;"}, {"en": "3) critically analyse the transformation of world order and international practice of interpreting legal principles on using the force;", "et": "3) võimelised mõistma võimusiirdeid ja kaasnevaid muutusi rahvusvahelises korras ja valitsevates praktikates (näit. jõukasutus);"}, {"en": "4) use conflict management skills and methods for designing settlement options in conflict situations.", "et": "4) omandanud praktilised oskused läbirääkimisteks ja rahuvahendamiseks."}], "notes": {}}, "grading": {"independent_work": {"et": "Group work aims to encourage research and the presentation of findings in teams. Students are divided into groups, each of them having a theme which arguably corresponds to the precedent-set logic of the Kosovo conflict. Every team has to a) define and conceptualize one of these selected key notions: peace enforcement, the responsibility to protect, humanitarian intervention, remedial secession, national self-determination, a just war, necessity and distress (explaining the use of force); b) demonstrate how this theoretical construct was applied in Kosovo's case; c) argue for or against the Kosovo conflict as a precedent-setting case while applying these theoretical constructs elsewhere. This is an assignment for groups of max 3 people with the final report not exceeding 4000 words.\n\nConflict analysis seeks to apply the conflict assessment toolbox in the empirical analysis of one of the selected conflicts from the proposed list. It aims to present the root causes, introduce the conflict parties and their main stakes, and to critically analyse the conflict management perspectives. More specifically, one should analyse dividers and connectors, principal players and secondary actors, drivers of conflict and peace, and finally, windows of vulnerability and opportunity in these complex situations, often referred to as 'frozen conflicts'. This individual assignment should take the shape of a designed powerpoint presentation where clarity, consistency and accuracy (both factual and visual) count the most in the final assessment."}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Group work is assessed according to the criteria: a) selected key notion is clearly defined and conceptualised; b) analysis of case is presented in coherent and comprehensive way, theory is applied; c) findings are presented in written form according to the best academic practices."}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Conflict analysis should take the shape of a designed powerpoint presentation where clarity, consistency and accuracy (both factual and visual) count the most in the final assessment."}}], "grade_preconditions": {"et": "Seminars are compulsory; attendance at a minimum of four seminars (from six) allows access to the final grading. All absences can be compensated by answering the seminar questions in written form."}, "grade_evaluation": {"et": "-\tGroup work compose 40% of the final grade\n-\tConflict analysis compose 60% of the final grade"}, "debt_elimination": {"et": "Upon agreement with course instructor"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "96447775-39eb-9f46-3e10-0482702a89a3", "person_name": "Eiki Berg", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"1. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "bab58a6b-7e3f-6d49-4f76-c29c2983bde0", "person_name": "Shpend Kursani", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "35be6d3d-c282-6856-042a-2f34cbc5bc75", "code": "1. rühm", "max_size": 20}, {"uuid": "d68103da-2323-7c8f-68d9-023431922632", "code": "2. rühm", "max_size": 20}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction to Global Chaos/Turbulent Peace\nLecture themes: The characteristics of conflicts; current threats to peace and stability. The curve of conflict and conflict intensities. Interstate and intrastate conflicts - their intensities, trends and dynamics."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Conflict and Peace in Theoretical Framings\nLecture themes: Mainstream theoretical approaches explaining war and peace. The Waltzian \"three images\" and analytical levels; power transition; hegemonic cycles; the democratic peace; perceptions and misperceptions."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Militarization and Pacification of States\nLecture themes: Understanding war and peace; militarization and pacifying the states. War rules and the concept of just wars. Approaches to integrating force and diplomacy."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The Meaning of War and the Legitimacy of Warring State\nTexts:\nJoenniemi, P. (2002), Kosovo and the End of War, in P. v. Ham and S. Medvedev (eds.) Mapping European Security after Kosovo. Manchester University Press, pp. 49-65.\nEhrhart, H.-G. 2017. Postmodern Warfare and the Blurred Boundaries Between War and Peace. Defense & Security Analysis, Vol. 33, No. 3, pp. 263-275.\nFoley, E. and C. Kaunert. 2022. Russian Private Military and Ukraine: Hybrid Surrogate Warfare and Russian State Policy by Other Means. Central European Journal of International and Security Studies, Vol. 16, No. 3, pp. 172-192.\nFilm: American Mercenaries Killing in Yemen (2024)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Interventions and Peace Operations\nLecture themes: Using force in conflict management. Variables defining the spectrum of intervention options. The evolution of peace-keeping and peace-building. Humanitarian intervention and peace enforcement. Intervention criticism."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Legality and Legitimacy of Peace Operations/Wars\nTexts:\nO'Connell, M. (2000), The UN, NATO, and International Law After Kosovo. Human Rights Quarterly, Vol. 22, No. 1, pp. 57-89.\nGreen, J. A., C. Henderson & T. Ruys (2022). Russia's Attack on Ukraine and the Jus ad Bellum. Journal on the Use of Force and International Law. Vol. 9, No. 1, pp. 4-30."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Understanding Conflicts. Analytical Tools\nLecture themes: Conflict assessment toolbox. Learning by doing - narrative analysis. Understanding the actors in the conflict, their motives and strategies. Recognising the \"ripeness\" of the conflict - mutually hurting stalemate."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Collective Memory, Victimization and Reconciliation Through Narratives\nTexts:\nZdravkovic-Zonta, H. 2009. Narratives of Victims and Villains in Kosovo. Nationalities Papers, Vol. 37, No. 5, pp. 665-692. \nVoronkova, A. 2013. Nationalism and Organized Violence in Nagorno-Karabakh: A Microspatial Perspective. Nationalism and Ethnic Politics, Vol. 19, No. 1, pp. 102-118\nFilm: My Son Shall be Armenian (2004)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The Anatomy of Conflict Management and Resolution\nLecture themes: Constitutive 'other' and group mobilization. De- and re-categorization; renegotiation of identities. Quest for power and anarchy; power symmetry and transition; structural conditions for conflict management. Peace-making and its criticism."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Myths, Power Asymmetry and Structural Shifts in Conflict Escalation and Maintenance\nTexts:\nBieber, F. 2002. Nationalist Mobilization and Stories of Serb Suffering: The Kosovo Myth from 600th Anniversary to the Present. Rethinking History, Vol. 6, No. 1, pp. 95-110.\nAmir, M. 2017. Revisiting Politicide: State Annihilation in Israel/Palestine. Territory, Politics, Governance, Vol. 5, No. 4, pp. 368-387.\nBerg, E. and M. Mölder 2014. When 'Blurring' Becomes the Norm and Secession Is Justified as the Exception. Revisiting EU and Russian Discourses in the Common Neighbourhood. Journal of International Relations and Development, Vol. 17, No. 4, pp. 469-488.\nFilm: Settlements Above the Law (2024)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sovereignty, Power-sharing and Failed States\nLecture themes: Sovereignty as a legal principle and political attribute. Conflict between self-determination and territorial integrity principles. Sovereignty practices and failed states. Secessionism and de facto states. Preconditions for power-sharing. Partition as last resort."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Peace Prospects for Protracted and Intractable Conflicts\nTexts:\nICG. (2014). Divided Cyprus: Coming to Terms on an Imperfect Reality. No. 229. Europe and Central Asia. International Crisis Group.\nBerg E. and S. Kursani 2019. Exchanging Occupied Territories for a Mutually Recognised Status of Nagorno-Karabakh, from De Facto States and Land-for-Peace Agreements: Territory and Recognition at Odds? Routledge, pp. 107-129.\nFilm: Bosnia and Herzegovina: A Fragile Peace (2024)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Conflict Settlement and Resolution Procedures\nLecture themes: A set of instruments and techniques for conflict settlement: The International Court of Justice and arbitrage; negotiations and mediation; dialogue on grass-root level. Ethical questions in reconciliation process."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Negotiations. Post-conflict Peace-building\nTexts:\nPreuss, G. (2003), Dialogical Development: A Kosovo Case Study. Journal of Peacebuilding and Develeopment, Vol. 1, No. 2, pp. 36-48.\nFridl, D. (2009), Kosovo Negotiations: Re-visiting the Role of Mediation. International Negotiation, Vol. 14, No. 1, pp. 71-93.\nKeranen, O. (2013). International Statebuilding as Contentious Politics: The Case of Post-Conflict Bosnia and Herzegovina. Nationalities Papers, Vol 41, No. 3, pp. 354-370.\nFilm: The Agreement (2013)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Post-Conflict Risks and Reconstruction\nLecture themes: Political and Judicial Capacity-Building. Disarmament, Demobilization and Reintegration (DDR). Security Sector Reform (SSR). Governing divided societies: lessons learned from Bosnia, Kosovo, Afghanistan and Iraq."}}]}, "registration_info": {"audience": {}, "max_students": 40}, "confirmation_process": {"confirmation_uuid": "b99e3d7d-78d4-4b3e-99c0-a322dc78b566", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "de79851e-8c82-45ee-4911-8117adc3278c", "parent_code": "SHRG.03.009", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}