{"uuid": "321b05b6-0b3f-57d8-2ee2-ddeff443ef50", "code": "SHRG.00.010", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Human Rights", "et": "Inimõigused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is not just a legal overview of human rights which are analysed from international relations perspective. In addition to introducing legal framework of main international treaties concerning human rights, the history of human rights will be covered during the course. \nThe roles of main international organisations, both governmental and non-governmental, will be analysed in protecting human rights.\nCourse will analyse the role of human rights in international relations theories and compare the standpoints of these theories.\nCourse will also give an overview of states practices concerning human rights.\nHuman rights in special situations as armed conflicts will also be analysed.", "et": "Ainekursuse näol pole tegemist puhtalt juriidilise käsitlusega, inimõigustele heidetakse pilk rahvusvaheliste suhete perspektiivist. Lisaks ülevaatele inimõigusi puudutavatest olulisematest õigusaktidest ja rahvusvahelistest lepingutest ning nende kaitsest eeskätt rahvusvahelisel tasandil, pööratakse tähelepanu inimõiguste ajaloolisele kujunemisele ja nende mõjule rahvusvahelistes suhetes. Kursuses käsitletakse ÜRO kui suurima rahvusvahelise organisatsiooni rolli inimõiguste kaitsel ning vaadeldakse ka regionaalseid organisatsioone. Rahvusvaheliste suhete uurimise seisukohalt on oluliseks tuvastada peamiste rahvusvaheliste suhete teooriate seisukohad inimõiguste küsimuses ning leida nende sarnasusi ja erinevusi. Välispoliitilises praktikas toimuv võetakse kokku riikide praktikat uurides. Samuti vaadeldakse inimõigusi eriolukordades nagu relvastatud konflikt."}, "objectives": [{"en": "General purposes of the course are:\n- To introduce human rights as research area in international relations;\n- To work through main legal acts concerning human rights;\n- To relate human rights to international relations theories;\n- To teach analysing human rights in practice of international relations.", "et": "- Tutvustada inimõigusi kui uurimisvaldkonda rahvusvahelistes suhetes;\n- Läbi töötada inimõiguste olulisemad alusdokumendid;\n- Lahti mõtestada inimõiguste rolli olulisemates rahvusvaheliste suhete teooriates;\n- Õpetada analüüsima inimõiguste rolli rahvusvahelistes suhetes praktiliselt."}], "learning_outcomes": [{"en": "After having passed the course successfully, the student will:", "et": "Aine edukal läbimisel üliõpilane:"}, {"en": "- Orientate in the legal framework of human rights;", "et": "- Orienteerub rahvusvaheliste inimõiguste juriidilistes alustes;"}, {"en": "- Relate problems of international politics with human rights issues;", "et": "- Seostab rahvusvahelise poliitika probleeme ning inimõigusi;"}, {"en": "- Analyse human rights as part of states' behaviour;", "et": "- Analüüsib inimõiguste osa riikide käitumises;"}, {"en": "- Analyse the role of human rights in international relations theories.", "et": "- Analüüsib inimõiguste osa rahvusvaheliste suhete teoorias."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}