{"uuid": "caf0072c-1b40-31f6-88b4-e2ceea5c927d", "code": "sv-2018-autumn-fulltime-c6-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Comparative Ethnopolitics", "et": "Võrdlev etnopoliitika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "18/19 A regular SV Eng", "et": "18/19 S PÕ SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Inter-group conflicts that are based on ethnically defined social boundaries remain a salient issue in today's world and prevent states from establishing lasting political and economic conditions for peace and growth. Not just the post-colonial world is frequently errupting in violence between groups that define themselves in ethnic, religious or linguistic terms; also other parts of the world, including the developed democracies are witnessing minority rights movements and ethnic separatism that challenge the status quo of the established nation-states. Finally, different migration waves and mass immigration into the rich \"Western\" democracies since the mid-20th century have put established understandings and practices of citizenship, democratic representation and justice into question calling for new ways of thinking both theoretically and practically about diversity management and social integration. But what exactly motivates individuals to identify with an ethnic group? What explains the resilience of ethnic identities and their seemingly easy political mobilization? And how can democratic states manage ethnic, linguistic and religious diversity without using violence or other forms of coercion? The course will address these and many other questions, focusing both on theoretical debates about ethnicity, ethnic group formation and conflict as well as on specific ethnopolitical regimes and modes of conflict regulation instituted in countries around the world.", "et": "Mis motiveerib inimesi samastuda etnilise grupiga? Mis on etnilise identiteedi vastupanuvõime ja kuidas see mõjutab poliitilist mobiliseerumist? Kuidas demokraatlikud riigid haldavad etnilist, keelelist ja religioosset mitmekesisust ilma vägivallata. Ainekursus tegeleb nende ja paljude teiste küsimustega, keskendudes teoreetilistele aruteludele rahvuse, etnilise grupi moodustamise, etnilise konflikti tekkimise ja selle konflikti reguleerimise üle."}, "objectives": [{"en": "This course will examine different ways in which democratic states can regulate and accommodate ethnocultural diversity. It will cover a wide range of cases and policies, discussing the pros and cons of various ethnopolitical regimes against the normative and institutional requirements of democratic governance.", "et": "Aine peamises fookuses on etnopoliitika - erinevad viisid, kuidas demokraatlikud riigid reguleerivad oma kodanikkonna etnilist mitmekesisust. Aines kanalüüsitakse etnose teoreetilisi ja kontseptuaalseid lähtekohti, arutatakse erinevate etnopoliitiliste situatsioonide ja etnopoliitiliste režiimide plusse ja miinuseid lähtuvalt demokraatlikust valitsemisest."}], "learning_outcomes": [{"en": "Upon completing the course, students:", "et": "Aine edukalt läbinu üliõpilane:"}, {"en": "- analyse ongoing debates over ethnicity and the salience of ethnic identities as well as their mobilization in the modern world; ", "et": "- oskab analüüsida käimasolevaid arutelusid rahvuse ja etnilise identiteedi ning selle mobiliseerumise üle tänapäevases maailmas;"}, {"en": "- reconstruct the complex ethnopolitical situations in different countries and identify different modes of ethnic conflict regulation by democratic states; ", "et": "- oskab mõtestada ja arutleda keeruliste etnopoliitiliste olukordade üle ja selgitada etnilise konflikti demokraatliku reguleerimise viise;"}, {"en": "- demonstrate research skills by investigating and reporting on specific country cases of ethnic conflict regulation; ", "et": "- tunneb erinevate riikide ethnopoliitilisi olukordi ja nendele olukordadele kohaseid lahendusi;"}, {"en": "- formulate relevant questions from the reading and organise a class discussion; ", "et": "- omab oskusi läbi viia teadustööd, uurida eri riikide etnilise konflikti reguleerimise konkreetseid juhtumeid;"}, {"en": "- reflect in writing on the concepts discussed and develop a sound position on critical questions.", "et": "- oskab sõnastada asjakohaseid küsimusi ning arendada diskussiooni."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "The position papers will be assessed according to how well they:\na) present and summarize the main points made in the reading of that week\nb) reflect critically on the issues discussed in the text based on arguments and evidence\nEach position paper counts for 11% of the final grade (max. 33 p)."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "The weekly reading assignment will be assessed according to\na) whether the answer to the question(s) is correct and formulated in the student's own words, thus reflecting on reading comprehension and independent thinking\nb) whether the student's own question reflects an understanding of the author's arguments and generates further thinking and/or discussion. \nUp to 2 points are given for each week's reading assignment.  (max. 14 p)."}}, {"work_type": {"code": "performance", "et": "Etendus", "en": "performance"}, "description": {"et": "Attendance and active participation in class discussions is expected. This can also be done by way of posing intelligent questions on the reading in written form and sending them to the instructor before class; you may also share interesting and related observations from the news during class. In any case, attendance is compulsory and missing more than three sessions will result in a loss of 2 points per week. Participation will count for 15% of the final grade."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "The comparative country report and presentation will be assessed according to how well\na)\tthe report summarizes key information about the particular ethnopolitical situation and regime in the two assigned countries \nb)\tthe report/presentation highlights the key elements and effects of the practiced mode of ethnic conflict management/regulation in each state from a comparative perspective, and \nc)\tthe report remains within the given page limits and relies on decent academic sources (reliable/verifiable internet sources, academic articles etc.) that are properly referenced\nd)\tthe presentation in class provides a critical summary of the main findings and is able to encourage discussion of the cases within the broader ethnopolitical regime-frame\ne)\tthe various tasks in class were well-distributed among group members and well-performed."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "All assignments must be submitted according to the relevant deadlines (see Moodle). Students may not skip any of the assignments. Attendance is a prerequisite for the final assessment."}, "grade_evaluation": {"et": "Active participation                 15% of the final grade\nReading assignment \t\t14% of the final grade (7x2)\nPosition papers \t\t        33% of the final grade (3x11)\nCase report/presentation \t33% of the final grade (5p - meeting; 14p - report; 14p - presentation/discussion) \nSelf-evaluation \t\t\t5% of the final grade"}, "debt_elimination": {"et": "Attendance in class is required. Absences must be clarified with Prof. Bloom prior to the session. Absences will be excused (1) for illness (to be certified later with a doctor's note) or (2) for academic activities (e.g. participation in a student conference or a study tour). Absences for private reasons (i.e. job-related activities) will not be accepted. If you are unable to attend class, you should notify Prof. Bloom via e-mail prior to the session."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "This course will take place in Moodle. Students registered for this course via the Study Information System will automatically obtain access to the course via their Moodle account."}, "participants": {"lecturers": [{"person_uuid": "8948aec1-8a51-aa12-1002-5b4d38bc0711", "person_name": "Ionut-Valentin Chiruta", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "e3620c38-abed-aa74-86ca-cba32785c52b", "person_name": "Stephen Rhyne Bloom", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "7d556aca-27a9-e9a1-0a0b-139883c8b871", "person_name": "Vello Andres Pettai", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The course calendar and all study materials are posted in Moodle."}}]}, "registration_info": {"audience": {"et": "MA students of D&G programme and other interested; Erasmus students welcome"}, "min_students": 10, "max_students": 32}, "parent_uuid": "81c41fd8-dc44-d073-b240-e4c1f0fae4ac", "parent_code": "SHRG.02.023", "parent_credits": 6, "_actions": {"is_editable": false, "is_moodle_editable": false, "is_deletable": false}}