{"uuid": "88e13b02-b715-8336-c196-6791bf5b7c16", "code": "sv-2025-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:13:40", "title": {"en": "International Relations", "et": "Rahvusvahelised suhted"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 A regular SV Eng", "et": "25/26 S PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course starts by discussing the mission of International Relations as a discipline driven by specific practical and theoretical concerns, followed by a short introduction into the evolution of the discipline. The second, and main, part of the course includes a series of lectures and seminars which focus on the key formative concepts, such as sovereignty, anarchy and governance, agency, structure and the state, international system and international society, power, security, war and peace, conflict and cooperation, norms and identity, the role of the individual. The concepts are introduced through some of the classical texts that have shaped the discipline over decades; as a rule, each concept is introduced both from the rationalist and the constructivist perspective, and where possible, also through the prism of empirical issues. The concluding part of the course sums it up by linking the problematic of IR with the notion of modernity and asking whether today's practice of world politics is evolving beyond modernity or back to pre-modern times.", "et": "Kursuse alguses sõnastatakse rahvusvaheliste suhete kui teadusharu definitsioon konkreetsetest praktilistest ja teoreetilistest vaatepunktidest lähtuvalt. Järgmine ning suurem osa kursusest keskendub põhimõistetele nagu süveräänsus, anarhia, valitsemine, toimija- ja struktuurikesksus, rahvusvaheline süsteem, võim, julgeolek, sõda ja rahu, konflikt ja koostöö, normid ja identiteet jt. Mõistet tutvustatakse klassikaliste tekstide kaudu ning reeglina nii ratsionalistlikust kui konstruktivistlikust perspektiivist. Kursus lõpeb aruteluga sellest, kuhupoole liigub tänapäeva maailma poliitika."}, "objectives": [{"en": "This course introduces the students to the current state of IR as a discipline. It discusses key practical and theoretical concerns that define the discipline, main theoretical debates, and key concepts that organise the disciplinary field.", "et": "Kursus käsitleb rahvusvaheliste suhete teadusdistsipliini tänast seisu, analüüsides peamisi teoreetilisi ja praktilisi murekohti, peamisi teoreetilisi seisukohti ja teadusharu põhimõisteid."}], "learning_outcomes": [{"en": "Upon completing the course, the students will be able to:", "et": "Kursuse läbinu:"}, {"en": "1) understand the disciplinary logic of IR and its evolution since the beginning of the twentieth century;", "et": "1) teab rahvusvaheliste suhete kui teadusharu olemust ning ajaloolist arengut;"}, {"en": "2) understand the key dividing lines between the rationalist and constructivist approaches in contemporary IR;", "et": "2) teab põhilisi murdejooni ratsionalistlike ja konstruktivistlike lähenemiste vahel kaasaegses rahvusvaheliste suhete teooriates;"}, {"en": "3) understand how and why IR theories differ in their approach to the key concepts that shape the disciplinary field;", "et": "3) teab, kuidas ja miks rahvusvaheliste suhete teooriad erinevad oma vaadetes teadusharu põhimõistetele;"}, {"en": "4) improve their critical reading skills;", "et": "4) on parandanud oma kriitilise lugemise oskust;"}, {"en": "5) enhance their ability to use scholarly concepts in speech and in writing.", "et": "5) oskab õigesti kasutada teadusmõisteid nii kõnes kui kirjas."}], "notes": {"et": "Students in this course are expected to know and follow the University rules regarding plagiarism. Materials explaining what plagiarism is and how to avoid it will be posted on the course's Moodle page. Offenders will punish themselves according to the UT rules; if the fact of plagiarism is confirmed by the Academic Fraud Committee, the perpetrator automatically fails the course."}}, "grading": {"independent_work": {"et": "All classes will include a combination of an introductory lecture and a discussion based on the readings. The students are expected to attend all classes, do compulsory readings before each class, and actively take part in discussions."}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Brief learning diaries: Students are expected to do the required weekly readings (on average 2 pieces a week) before coming to class. Students are expected to submit brief learning diaries on the required weekly readings 24 hours before the scheduled class. [If the class happens to be scheduled on Mondays and students don't want to work on Sundays or weekends, they must plan this beforehand so long as the diaries get submitted 24 hours before class]. Each weekly learning diary consists of a maximum 200 words. For the learning diaries, students will be asked to focus on (i) what they have found challenging or confusing from the readings; (i) what they have found interesting that they have learned from the readings; and/or (iii) pose a question they may have from the readings. Each weekly submission is worth 2 points of the final grade, with 15 submissions amounting to 30 points of the final grade. Missing the deadline will give students zero points; submitting a general, unrelated, or superficial comment on the diaries will give them 1 point; submitting meaningful and closely related to the readings learning diaries will grant them the maximum 2 points. Further details will be provided and communicated during the first meeting, and the online submission form will be explained."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Policy memos (group work): In groups (size TBD), students are expected to submit a brief policy memo on a specific and relevant topic to international relations. Policy memos will address the issue to either a head of state, a senior staff, or head of an international organization (such as the UN, EU, OSCE, etc), or a CEO of a private corporation. Students will have to assess an existing problem and provide a solution. Through policy memos, students must show the ability to apply the learned concepts (and theories) in class to real-world problems. Policy memos are capped at a maximum of 1,000 words, and the assignment is worth 25 points of the final grade. Further details will be provided and communicated during the first meeting, but also prior to the assignment deadline which shall be due sometime in the second half of the semester (the exact date TBD)."}}, {"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "Term paper (individual assignment): Students are expected to submit a term paper, which shall consist of no more than 2,500 words. Term papers will tackle one question out of a list of questions that will be posted during the second half of the semester. The questions the term papers must address relate directly to the topics covered during the entire semester. Detailed instructions and expectations on how to best tackle the questions shall be posted on Moodle. The term paper is worth 45 points of the final grade. Further details will be provided and communicated during the first meeting, but also prior to the assignment deadline which shall be due sometime after all the sessions of the semester (the exact date TBD)."}}], "grade_preconditions": {}, "grade_evaluation": {"et": "The final grade for the course will be based on the following criteria:\nLearning diaries (individual):              30 points (2 points per week)\nPolicy memo (group): \t                   25 points\nTerm paper (individual):\t                   45 points"}, "debt_elimination": {"et": "The grade for the course is incremental and depends on the timely completion of all assignments. Points for learning diaries on the readings, policy memos, and term papers, can only be earned by submitting them on time. Extensions can be granted only if there are emergencies or legitimate troubles, but ones that are communicated to the instructor prior to the deadline. Any post-deadline reasonings will not be taken into account."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "bab58a6b-7e3f-6d49-4f76-c29c2983bde0", "person_name": "Shpend Kursani", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 1.\tIntroduction. Course overview and requirements"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 2.\tThe origins and mission of IR as a discipline"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 3.\tThe grand debates and the evolution of the discipline"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 4.\tSovereignty. The state"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 5.\tLevels of analysis. Agency and structure"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 6.\tPower"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 7.\tAnarchy and governance"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 8.\tNational interest. Security"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 9.\tWar and peace"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 10.\tRelations and processes. Cooperation and conflict"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 11.\tInternational institutions"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 12.\tThe concept of norm. International law"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 13.\tInternational Political Economy. Inequality and centre-periphery relations"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 14.\tIdentity"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 15.\tThe role of the individual"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Week 16.\tModernity, postmodernity and IR"}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "eb8d803c-145b-f638-75a2-030eeb181d7d", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "94a6983a-c41a-5bda-228e-642a62bd569e", "parent_code": "SHRG.03.026", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}