{"uuid": "1d7d1bcd-3bbc-69ba-8fd9-0d70c6cfe31d", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-17T15:22:10", "title": {"en": "EU Institutions and Policy-making", "et": "EL-i institutsioonid ja poliitikakujundamine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 9, "practice": 0, "seminar": 1, "colloquium": 0, "web_learning": 0, "independent_work": 146, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This is a practically-oriented introductory course on the European Union that covers the EU's main institutions and decision-making processes. The main goal of the course is to enhance the students' understanding of the institutions, main policies, decision-making processes and overall nature of the EU. Throughout the course, our focus will be on the simple question: \"Can you explain how the EU works?\" We will also critically evaluate the EU political system and policy processes, and try to provide answers to the question: \"How could the EU function better?\" In addition to helping students build a solid knowledge base about the EU, the course also seeks to develop a range of general competencies and skills, including critical thinking, oral and written communication, analytical skills, working independently and as part of a team. \n\nThe emphasis of the course is on institutions, politics and policy-making. Legal aspects of integration will be covered in a separate course on \"EU law\" while theoretical approaches and history of integration will be explored in more detail in the course \"Theories of European integration.\"\n\nThe course is divided into four parts. After introducing the EU political system and considering the ways in which it both resembles and differs from democratic systems at the national level, we will focus on the key policy actors in the EU, including the Commission, the European Parliament, the Council of the EU, the European Council and the Court of Justice of the EU. Subsequently, we will shift the attention to constitutive and system-shaping policies, including the deepening of intergration, the process and politics of treaty reform, as well as enlargement. Finally, the course will focus on day-to-day legislative politics and policy-making in the EU. Throughout the course, we will also focus on current debates and topical issues in EU politics.", "et": "Tegemist on praktilise suunitlusega sissejuhatava kursusega, mis käsitleb Euroopa Liidu peamisi institutsioone ning poliitikakujundamise protsesse. Kursuse eesmärk on anda laiahaardeline ülevaade Euroopa Liidu peamistest institutsioonidest, nende pädevusest ja funktsioonidest ning otsustusprotsessidest. Kursus keskendub küsimustele: \"kuidas EL toimib?\" ja \"kuidas EL saaks toimida senisest paremini\"? Lisaks faktiteadmiste arendamisele aitab kursus arendada üldoskusi ja -pädevusi, sh kriitiline mõtlemine, kirjalik ja suuline eneseväljendus, analüütilised oskused ning oskus tõhusalt töötada nii iseseisvalt kui ka grupis. \nKursuse rõhuasetus on poliitikal ja poliitikakujundamisel -- integratsiooni õiguslikke aspekte käsitleb eraldiseisev kursus \"Euroopa Liidu õigus\" ning integratsiooni aja- ning mõtteloost annab ülevaate kursus \"Euroopa integratsiooni teooriad.\" Kursus on jagatud neljaks osaks: sissejuhatus EL poliitilisse süsteemi, peamised institutsioonid ja nende toimimine, konstitutiivsed ja süsteemi kujundavad poliitikad (süvenemine, laienemine); seadusloome ja poliitikakujundamise protsess. Kogu semestri jooksul käsitleme ka peamisi EL poliitikakujundamisega seotud väljakutseid ja dilemmasid ning arutleme võimalike väljapakutud lahenduste üle."}, "objectives": [{"en": "The course has two main objectives:", "et": "Kursuse eesmärk on:"}, {"en": "- enhance the students' understanding of the institutions, main policies, decision-making processes and overall nature of the EU;", "et": "- anda laiahaardeline ülevaade Euroopa Liidu peamistest institutsioonidest, poliitikatest ja otsustus- ning poliitikaloome protsessidest. "}, {"en": "- help students develop a range of general competencies and skills, including critical thinking, oral and written communication, analytical skills, working independently and as part of a team.", "et": "- arendada osalejate üldisi pädevusi ja oskusi nagu kritiiline mõtlemine, suuline ja kirjalik eneseväljendus, analüütilised oskused, võime efektiivselt töötada nii iseseisvalt kui grupis."}], "learning_outcomes": [{"en": "Upon completing the course, the students should:", "et": "Kursuse läbinu:"}, {"en": "1) be able to explain the composition, structure, powers and influence of the EU's main policy institutions;", "et": "1) omab põhjalikke teadmisi EL-i poliitikakujundamise protsessis osalevatest institutsioonidest, nende ülesehitusest, rollist ning mõjust;"}, {"en": "2) be able to describe, analyze and assess the EU policy and legislative processes;", "et": "2) oskab kirjeldada, analüüsida ja hinnata EL poliitikakujundamise ja seadusloome protsesse;"}, {"en": "3) be able to outline the EU's policy portfolio and explain why the extent of EU involvement varies across policy domains;", "et": "3) oskab kirjeldada ja iseloomustada EL poliitikate portfelli ja selgitada, miks EL roll varieerub valdkonniti;"}, {"en": "4) be able to provide a detailed account of major EU policies, including policy evolution over time, current problems  and dilemmas, as well as possible solutions to these;", "et": "4) suudab anda põhjaliku ülevaate EL peamistest poliitikatest ning kujunemisloost, olulisematest probleemidest ja dilemmadest ning võimalikest lahendustest;"}, {"en": "5) demonstrate greater competence and confidence in critical thinking, public speaking, problem solving, and teamwork. ", "et": "5) on parandanud ja täiustanud oma oskusi kriitilise mõtlemise, prohbleemide lahendamise, avaliku esinemise ning meeskonnatöö vallas;"}, {"en": "6) be familiar with EU-related career opportunities, know how to apply for jobs in EU institutions and how to prepare for the concours.", "et": "6) on kursis EL-ga seotud karjäärivõimalustega; teab, kuidas kandideerida tööle EL institutsioonidesse ning kuidas valmistuda concour'iks"}], "notes": {}}, "grading": {"independent_work": {"et": "The course page on Moodle (moodle.ut.ee: SHRG.03.027) serves as the learning platform for this course. All course materials, including assigned texts and videos, detailed guidelines for assignments, quizzes and questions for seminar discussion are available on this page. All assignments will be submitted via Moodle.\n\nIndependent work: assigned readings and videos. The students are expected to read assigned texts (about 50 pages per week) and watch assigned videos.\n\n10 short quizzes. To ensure that the students do the readings and watch assigned videos, all participants are expected to complete a short multiple-choice test on Moodle most weeks. Each test has the maximum value of 2.5 points (2.5% of the course grade) and it can be taken repeatedly (the highest score will count). \n\nDebate: Spitzenkandidaten pro et contra. There will be a debate focusing on the Spitzenkandidaten process - a proposed system for choosing the President of the European Commission. Detailed guidelines will be available on Moodle.\n\nPanel presentations. There will be a series of conference-style panel presentations on topical issues in EU politics. Each student is expected to appear as a panelist in one panel. The precise topics for each panel and for individual presentations will be determined jointly by the instructor and the students, based on brief proposals by the students.\n\nPosition papers (submit via Moodle). This brief paper (about 1800 words) serves as a basis for your statements on the panel. In your paper, you should make and defend an argument (or several) about the topic. Detailed instructions for the panels and the paper, together with assessment criteria, will be posted on Moodle. \n\nFinal exam. The exam is worth 50% of the grade. The exam is a combination of multiple choice, short answer and essay questions. A detailed study guide will be provided at least two weeks before the exam."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "10 short quizzes. To ensure that the students do the readings and watch assigned videos, all participants are expected to complete a short multiple-choice test on Moodle most weeks. Each test has the maximum value of 2.5 points (2.5% of the course grade) and it can be taken repeatedly (the highest score will count). Make-ups for missed tests will be allowed only in exceptional cases (serious illness, etc)."}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Panel presentations. There will be a series of conference-style panel presentations on topical issues in EU politics. Each student is expected to appear as a panelist in one in-class or online panel. The precise topics for each panel and for individual presentations will be determined jointly by the instructor and the students, based on brief proposals by the students.\nFormat of the panels: the allocated time is 45 minutes (i.e. we will have two  panels during the regular 90 minute class meeting). There will be five panelists, each of whom will have 6 minutes to make a statement (based on a position paper prepared and submitted in advance - see below). The instructor will serve as a discussant, offering brief comments about the papers (5 minutes).  There will be 10 minutes for Q&A with the audience. \nDetailed instructions will be available on Moodle."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Position papers (due a week before your scheduled panel presentation; submit via Moodle). This brief paper (about 1800 words) serves as a basis for your statements on the panel. In your paper, you should make and defend an argument (or several) about the topic. What you argue is up to you - but the argument should be interesting, important and supported by evidence and logic. Your paper should follow the rules of paragraph-level writing (clearly structured paragraphs focusing on one key thought or central argument, expressed clearly in the opening sentence). Detailed instructions for the panels and the paper, together with assessment criteria, will be posted on Moodle."}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Debate. There will be a debate focusing on the Spitzenkandidaten process - a proposed system for choosing the President of the European Commission. Group A will defend the position that the Spitzenkandidaten process should be used to select the Commission president, while Group B will argue that it should not be used. Members of each group have to work together before the debate to prepare their positions. During the debate, each group will advance its arguments and defend its positions. The format of the debate is as follows: \nEach group will choose a proposer, a seconder, and someone to make a concluding statement. The debate will begin with a proposing statement (10 minutes) and seconding statement (5 minutes) by Group A, followed by similar statements by Group B. This will be followed by a 'plenary' debate open to all members of the groups (35 minutes). After this, the groups will have 15 minutes to prepare their concluding statements. The debate ends with both groups presenting their concluding statements (a 7 minutes)."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Final exam. . The exam is worth 50% of the grade (max 50 points). It will be an in-class closed-book exam lasting 2 hours.  The exam is a combination of multiple choice, short answer and essay questions. A detailed study guide will be provided at least two weeks before the exam. The assessment criteria for the exam include: demonstrated familiarity with and understanding of the material covered in the course, including detailed factual knowledge about how the EU works; ability to analyze and synthesize material; ability to evaluate key aspects of the EU political system and policy-making processes; the quality of argumentation, clarity of writing."}}], "grade_preconditions": {"et": "-"}, "grade_evaluation": {"et": "-\tTen Moodle quizzes covering assigned readings and videos (25 pts, 25% of course grade)\n-\t1800-word position paper (10 pts, 10%) + in-class presentation (8 pts, 8%)\t\n-\tContribution to the debate (7 pts, 7%)\n-\tFinal exam (50 pts, 50%)\t\n\nFormation of the grade:\n91-100 points\tA\n81-90 points \tB\n71-80 points\tC\n61-70 points\tD\n51- 60 points\tE\nLess than 51\tF"}, "debt_elimination": {"et": "Make-ups for missed quizzes will be allowed only in exceptional cases (serious illness, etc). \nPosition papers that are submitted late lose 1 pt per day."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "5b4f5ba0-b094-428a-a688-a60ec06a6665", "type": "MOODLE", "code": "SHRG.03.027_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "All required and recommended reading materials and well as video lectures are available on Moodle.\nThe main textbook for the course is McCormick, John (2020). European Union Politics (3rd edition). Red Globe Press.", "recommended_materials": "*\tMcCormick, John (2017). Understanding the European Union: A Concise Introduction (7th Edition). Red Globe Press. \n*\tMcCormick, John (2013). Why Europe Matters: The Case for the European Union. Basingstoke: Palgrave MacMillan. \n*\tMcCormick, John and Olsen, Jonathan (2014, 2019 or 2020),  The European Union: Politics and Policies, Boulder, CO: Westview Press.\n*\tNugent, Neill (2017) The Government and Politics of the European Union, 8th edition, Basingstoke: Palgrave Macmillan.\n*\tBulmer, Simon and Christian Lequesne (2013) The Member States of the European Union, Oxford: Oxford University Press.\n*\tBuonanno, Laurie and Nugent; Neill (2013), Policies and Policy Processes of the European Union, Basingstoke: Palgrave Macmillan. \n*\tCini, Michelle and Nieves Perez-Solorzano Borragan (2019), European Union Politics, 6th edition, Oxford: Oxford University Press.\n*\tComan, Ramona, Amandine Crespy and Vivien Schmidt (2020), Governance and Politics in the Post-Crisis European Union, Cambridge University Press. \n\n\nYou should try follow developments in EU politics on a weekly basis. Recommended websites on current events, news and analysis include: \n\twww.politico.eu (note: can sign up to their Newsletters)     www.euronews.com\n\twww.euobserver.com\t\t\t\t\t\t\t    www.euractiv.com\n\twww.ft.com/world/europe\n\nKey academic journals dedicated to the study of European integration include: \nJournal of Common Market Studies, Journal of European Public Policy, European Union Politics, \tJournal of European Integration History, Journal of European Integration - Revue d Integration Europeenne (full text available via www.utlib.ee, databases)"}, "participants": {"lecturers": [{"person_uuid": "5d6b24c8-186b-eeb4-3a9f-e59baf708b1d", "person_name": "Piret Ehin", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "2b3d5847-43cf-d68b-8ed2-fd6015110e80", "person_name": "Yuliia Kopytsiak", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 1, "time": "2025-02-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "<b>Introduction</b> \nAims and organization of the course. Reasons for why one should study the EU. Sources of information on the EU. \n."}}, {"course_week": 2, "time": "2025-02-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "<b>The European Union as a Political System </b> \nWhat are the main institutions of the EU? What do they do and how do they relate to one another? How did the EU political system evolve? How similar is the EU political system to national political systems? What are the big debates about the nature and future of the EU? What are the key concepts we need to be familiar with in order to understand the EU political system and current debates about the EU? What criteria could we use to evaluate the functioning of the EU?\nQUIZ1 (2.5 pts)\n."}}, {"course_week": 3, "time": "2025-02-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "<b>European Commission</b> \nWhat does the European Commission do and why is it important? How is it formed and structured?\nHow has the institution evolved over time? What are the key debates regarding the role of the European Commission? How could we evaluate the work of the European Commission?\nQUIZ2 (2.5 pts)\n."}}, {"course_week": 4, "time": "2025-03-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {"et": "<b>The Councils (Council of the EU and the European Council)</b> \nWhat do the two Councils do and why are they important? How are they formed and structured?\nHow have the two institutions evolved over time? What are the key debates regarding their role? How could we evaluate the work of the two Councils?\nQUIZ3 (2.5 pts)\n."}}, {"course_week": 5, "time": "2025-03-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {"et": "<b>European Parliament </b> \nWhat does the European Parliament do and why is it important? How is it formed and structured? How are EP elections conducted and why are they frequently called \"second-order national elections\"? How has the Parliament evolved over time? What are the key debates regarding the role of the Parliament? How could we evaluate the work of the Parliament?\nQUIZ4 (2.5 pts)\n."}}, {"course_week": 6, "time": "2025-03-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "<b>Debate: Spitzenkandidaten pro et contra</b> \nGroup A will defend the position that the Spitzenkandidaten process should be used to select the Commission president, while Group B will argue that it should not be used. Members of each group have to work together before the debate to prepare their positions. During the debate, each group will advance its arguments and defend its positions.\nDEBATE (7p)\n."}}, {"course_week": 7, "time": "2025-03-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {}, "description": {"et": "<b>The Court of Justice and other important policy actors </b>\nWhat does the Court of Justice of the EU do and why is it important? How is it formed and structured? How has the Court evolved over time? What are the key debates regarding the role of the Court? How could we evaluate the work of the Court? What are some of the other key EU institutions and why are they important?\nQUIZ5 (2.5 pts)\n."}}, {"course_week": 8, "time": "2025-04-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 8, "topic": {}, "description": {"et": "<b>History-making decisions: Widening</b> (GUEST SPEAKER: Dr Stefano Braghiroli)\nEnlargement has been a key feature of the EU's historical evolution. Originally a community of 6 member states, the EU grew into a union of 28 countries before Brexit reduced the number of members to 27. How does the EU go about admitting new members? What is the process for enlargement and what is the role of various actors? How has enlargement changed over time? How could one evaluate the process of enlargement?\nQUIZ6 (2.5 pts)\n\n."}}, {"course_week": 9, "time": "2025-04-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 9, "topic": {}, "description": {"et": "<b>History-making decisions: Deepening </b> \nThe EU is based on a set of international treaties between the member states that set out the EU's constitutional basis. How are these treaties negotiated, reformed and ratified? Which actors are central to treaty-making? What are the obstacles to treaty reform? Has the EU become de facto constitutionalized?\nQUIZ7 (2.5 pts)\n."}}, {"course_week": 10, "time": "2025-04-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {}, "description": {"et": "<b>EU Legislative Processes</b> \nHow does the EU make laws? Who are the main actors involved in the legislative process and what are their roles? How has the legislative process evolved over time and how well does it work today? \nQUIZ8 (2.5 pts)\n."}}, {"course_week": 11, "time": "2025-04-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {}, "description": {"et": "<b>EU Policy Portfolio and Policy Modes.</b> \nThe EU is active in a wide range of policy areas, enjoying exclusive competences in some while sharing competences with the member states in other areas. What are the EU's key policies? How has the EU's policy portfolio evolved? How are policies made - what are the EU's policy modes? Why does EU involvement vary so greatly across policy areas? \nQUIZ9 (2.5 pts)\n."}}, {"course_week": 12, "time": "2025-04-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 12, "topic": {}, "description": {"et": "<b>Policy implementation </b>\n QUIZ10 (2.5 pts)\n\n\n."}}, {"course_week": 13, "time": "2025-05-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 13, "topic": {}, "description": {"et": "<b>Panel presentations on topical issues in EU politics I </b>\nPanel presentations on topical issues in EU politics, based on position papers submitted via Moodle. \nPOSITION PAPER (10  pts) + PRESENTATION (8 pts)\n."}}, {"course_week": 14, "time": "2025-05-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 14, "topic": {}, "description": {"et": "<b> Panel presentations on topical issues in EU politics II </b>\nPanel presentations on topical issues in EU politics, based on position papers submitted via Moodle.\nPOSITION PAPER (10 PTS) + PRESENTATION (8 pts)\n."}}, {"course_week": 15, "time": "2025-05-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 15, "topic": {}, "description": {"et": "<b>Concluding discussion, preparation for the final exam.</b>\nA study guide will be available at least 2 weeks before the final exam. \n."}}, {"course_week": 16, "time": "2025-05-28", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 16, "topic": {}, "description": {"et": "<b>FINAL EXAM </b>"}}]}, "registration_info": {"audience": {"et": "This is an MA-level course but advanced BA students are also welcome."}, "min_students": 10, "max_students": 40}, "parent_uuid": "a5754086-d91b-15ad-5e85-bf629f6c92fd", "parent_code": "SHRG.03.027", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}