{"uuid": "fc9b01ba-40f2-1a8f-80d2-a60e5e1ee5ce", "code": "sv-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:25:36", "title": {"en": "Sovereignty and Global Order", "et": "Suveräänsus ja maailmakord"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 12, "practice": 4, "seminar": 16, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Combining the perspectives of political theory and international relations, the course will look at the main theories in which this concept has evolved and been contested, while also exploring the practical contexts in which these theories have been formed. We will also highlight the dilemmas that arise when sovereignty is perceived to conflict with the ideals of international peace, democracy, national self-determination, and human rights, paying special attention to the current norms and practices of sovereignty in international relations.", "et": "Magistriõppe kursus uurib suveräänsuse idee ja maailmakorra suhte teoreetilisi lähtekohti (ja nende praktilisi, peamiselt poliitilisi ja etnilisi, tähendusi). Tudengitelt eeldatakse Westfaali rahu järgselt arenenud suveräänsuse ideede süsteemi ning ka selle arengu tundmaõppimist. Lugemismaterjalideks on väljavõtted raamatutest, mis käsitlevad suveräänsuse idee teket ja arengut ning vaidlusi selle üle. Autoriteks näiteks Grotius, Hobbes, Pufendorf, Leibniz, kuid samas on teemakohaseid tekste tänastelt mõtlejatelt."}, "objectives": [{"en": "Sovereignty is a key concept in theorising the institutional and normative underpinnings of the modern state and international order. Yet it is also contested both as a normative idea and analytical tool. The aim of the course is to enable the students to explore and discuss the meaning, role and normative status of the concept of sovereignty in different theories of international relations, combining the perspectives of political theory and international relations (IR).", "et": "Magistriõppe kursus uurib suveräänsuse idee ja maailmakorra suhte teoreetilisi lähtekohti (ja nende praktilisi, peamiselt poliitilisi ja etnilisi, tähendusi)."}], "learning_outcomes": [{"en": "Upon the completion of the course, the students will be able to:", "et": "Kursuse läbinu:"}, {"en": "1) understand the main theoretical debates in which the concept of sovereignty has evolved and served as a linchpin;", "et": "1) mõistab peamisi teoreetilisi lähenemisi, mille käigus suveräänsuse mõiste on arenenud;"}, {"en": "2) recognise the links of these debates to underlying conceptual and practical dilemmas as well as specific research agendas;", "et": "2) oskab ära tunda teooriate seost kontseptuaalsete ja praktiliste seisukohtadega ning erinevate uurimisprobleemidega;"}, {"en": "3) understand the relationship of sovereignty to other key concepts and values in international political theory (democracy, national self-determination, international peace, just war);", "et": "3) mõistab suveräänsuse seost teiste rahvusvahelise poliitika teooriate põhimõistetega (demokraatia, rahvuslik enesemääramisõigus, rahu, õiglane sõda)."}, {"en": "4) describe and discuss the main theories proposing the transcendence of sovereignty;", "et": "4) oskab kirjeldada ja arutleda põhiliste teooriate üle, mis suveräänsuse ülimuslikkust tunnustavad;"}, {"en": "5) describe and discuss the current norms and practices of sovereignty in international relations;", "et": "5) teab ja oskab analüüsida suveräänsuse tänapäevaseid norme ja praktikaid rahvusvahelistes suhetes;"}, {"en": "6) critically assess the usefulness of this concept both as a normative idea and as an analytical tool.", "et": "6) oskab kriitiliselt hinnata mõiste väärtust nii normatiivse idee kui analüütilise vahendina."}], "notes": {"et": "Case study deadline: 13. November \nResearch essay deadline: 22 December"}}, "grading": {"independent_work": {"et": "Students are required to write one case study and one research essay. Case studies should discuss one specific case relevant as illuminating the practical dilemmas related to the notion of sovereignty. The case can be chosen freely (but should be agreed with the lecturers), or can be chosen from the following topics: \n\n1)\tAmercian exceptionalism and 'double standards' - why has not the US signed/ratified some major human rights treaties?\n2)\tHumanitarian intervention in Kosovo - 'illegal, but legitimate'?\n3)\tEstonian e-residency - a new form of citizenship emerging?\n4)\tNational self-determination in Catalonia - pro and contra?\n5)\tThe politics of international recognition - the case of Palestine\n6)\tWhy is there no genuine humanitarian intervention in Syria? \n7)\tBrexit and sovereignty - the main arguments of right (or left) Brexiteers \n\n\nResearch essays discuss a central theoretical issue, and should demonstrate insight into some central academic debates on this issue. The topic of research essay can be chosen freely (but should be agreed with the lecturers), or can be chosen from the following topics: \n1)\t'Westphalian sovereignty' - a myth or a useful theoretical construct?\n2)\tWhat is the thing called 'international society'? \n3)\tWhat use for the idea of national self-determination?\n4)\tIs globalisation rendering the nation-state obsolete?\n5)\tDemocracy at the transnational level - pro and contra\n6)\tHumanitarian intervention - pro and contra\n7)\tHow sovereign is a EU member state?\n8)\tCan EU member states regain sovereignty through European integration?"}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Research paper. Both written assignments will be evaluated on how cogently and thoughtfully the topics are analysed, how accurately evidence is interpreted and credible sources are incorporated, and whether the reasoning and findings are sound."}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Case study. Both written assignments will be evaluated on how cogently and thoughtfully the topics are analysed, how accurately evidence is interpreted and credible sources are incorporated, and whether the reasoning and findings are sound."}}], "grade_preconditions": {"et": "Students are expected to read compulsory readings for individual sessions and to participate in their discussion on class and in seminars."}, "grade_evaluation": {"et": "Students will be evaluated on the basis of :\n1)\tClass participation \t\t\t\t\t\t\t\t20% \n2)\tResearch essay, 3000 words\t\t\t\t\t\t50%\n3)\tCase study, 1500 words\t\t\t\t\t\t\t30%"}, "debt_elimination": {"et": "By individual agreement with the instructor."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "96447775-39eb-9f46-3e10-0482702a89a3", "person_name": "Eiki Berg", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "1ff07011-8b53-4343-e595-c8c7e3e14201", "person_name": "Eva Piirimäe", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction\n\nWhat is sovereignty - is it a political ideal, legal norm or political practice? What is wrong with sovereignty? Why is it a contested concept?\n\nCompulsory reading: \nJackson, R. (1999). Sovereignty in World Politics: A Glance at the Conceptual and Historical Landscape in R. Jackson (ed) Sovereignty at the Millennium. Blackwell Publishers, pp. 9-34."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Westphalian Sovereignty\n\nIs sovereignty anything else than 'organized hypocrisy'? Sovereignty as a political practice - has there ever been a system of sovereign equality?\n\nCompulsory reading:\nKrasner, S. D. (1995/1996). Compromising Westphalia. International Security 20:3, pp. 115-118; 123-140; 150-151."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sovereignty and Early Modern Law of Nations\n\nSovereignty as a political and legal norm. Kant's 'sorry comforters' and the myth of Westphalia. Was sovereignty an absolute norm in early modern Europe? Was there an international society in early modern Europe or perhaps in the entire world?\n\nCompulsory reading:\nGlanville, L. (2014). 'Sovereignty in Early Modern Europe', Sovereignty and the Responsibility to Protect. Chicago University Press, pp. 31-59."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "From Popular Sovereignty to National Self-determination\n\nWhat is the source of sovereign power? What is the relationship between sovereignty and democracy? How does democracy affect the state's international status? What is the difference between peoples and nations?\n\nCompulsory reading:\nGlanville, L. (2014). 'The Rise of Popular Sovereignty', Sovereignty and the Responsibility to Protect. University of Chicago Press, pp. 60-81.\nJörg Fisch, 'Peoples and Nations, The Oxford Handbook of the History of International Law, ed. Bardo Fassbender and Anne Peters (Oxford, 2012/2015 online version), 1-25."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Quest for Self-determination\n\nIs there a right to self-determination? Which 'selves' are entitled to self-determination?\n\nCompulsory readings:\nMayall, J. (1999). Sovereignty, Nationalism, and Self-determination. Political Studies XLVII, pp. 474-502.\nMoore, M. (1997). On National Self-Determination. Political Studies, XLV, pp. 900-913. \nMuehlebach, A. (2003). What Self in Self-Determination? Notes from the Frontiers of Transnational Indigenous Activism. Identities: Global Studies in Culture and Power, Vol. 10, No. 2, pp. 241-268."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sovereignty, (De-)colonisation and Post-Imperialism\n\nWhat is the relationship of sovereignty to imperialism? Is sovereignty a 'gift of civilization'? Montevideo convention - what makes a state a state? What is a \"salt water test\"? Sovereignty games and quasi-states.\n\nCompulsory reading:\nGlanville, L. (2014). 'Sovereignty and the Non-European World', Sovereignty and the Responsibility to Protect. Chicago University Press, pp. 100-131.\nAalberts, T. (2004). The Sovereignty Game States Play: (Quasi-)States in the International Order. International Journal for the Semiotics of Law, Vol. 17, pp. 245-257."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sovereignty, Human Rights and Crimes Against Humanity\n\nWhat was the significance of the signing of the UN Charter in 1945 for the idea of sovereignty? What is the relationship between the 'rights of states' and those of individuals (human rights)?\n\nCompulsory reading:\nStefan Ludwig Hoffmann, 'Human Rights and History', Past and Present 232 (2016), 279-310.\nGlanville, L. (2014). 'Sovereignty after the Second World War', Sovereignty and the Responsibility to Protect. Chicago University Press, pp. 132-150."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Contested Sovereignty and Sovereignty Aspirants\n\nDe facto states. Why do they exist and what should/ can be done about them? Contexts of secession.\n\nCompulsory reading:\nBorgen, C. J. Imagining Sovereignty, Managing Secession: The Legal Geography of Eurasia's 'Frozen Conflicts', Oregon Review of International Law, Vol. 9, pp. 477-535."}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Film screening: How to Start Your Own Country (2011)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sovereignty and Globalisation Theories\n\nWhat is globalisation? Has it rendered the sovereign nation-state obsolete? Is there such a thing as virtual sovereignty?\n\nCompulsory readings:\nLuke, T. (1991). The Discipline of Security Studies and the Codes of Containment: Learning From Kuwait. Alternative: Social Transformation and Humane Governance, Vol. 16, pp. 315-344. \nLuke, T. (2007). Unbundling the State: Iraq and the `Recontainerization' of Rule, Production, and Identity. Environment and Planning A, Vol. 39, pp. 1564-1581.\nBetz, D. J. and T. Stevens (2011). Chapter Two: Cyberspace and Sovereignty. Adelphi Series, Vol. 51, No. 424, pp. 55-74."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Pooling Sovereignty: Europe as an Experiment\n\nWhat has happened to sovereignty in the EU? How sovereign are the EU member states?\n\nCompulsory readings:\nTroper, M. (2010). 'The Survival of Sovereignty', Sovereignty in Fragments. The Past, Present and Future of a Contested Concept, edited by Hent Kalmo and Quentin Skinner. Cambridge University Press,  pp. 132-151.\nBellamy, R. (2003). Sovereignty, Post-Sovereignty and Pre-Sovereignty: Three Models of the State, Democracy and Rights within the EU, in N. Walker (ed.), Sovereignty in Transition. Hart, pp. 167-190.\nAalberts, T. (2004). The Future of Sovereignty in Multilevel Governance Europe - A Constructivist Reading, Journal of Common Market Studies, Vol. 42, No. 1, pp. 23-46."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Cosmopolitan democracy and sovereignty\n\nSeminar: Is democracy possible at the transnational level? Does the concept of cosmopolitan citizenship make sense in the current world?\n\nCompulsory readings:\nHeld, H. (1999). The Transformation of Political Community: Rethinking Democracy in the Context of Globalization, in I. Shapiro and C. Hacker-Cordón (eds.) Democracy's Edges. Cambridge University Press, pp. 84-111.\nKymlicka, W. (1999). Citizenship in an Era of Globalization: Commentary on Held, in I. Shapiro and C. Hacker-Cordón (eds.) Democracy's Edges. Cambridge University Press, pp. 112-26.\nUrbinati, N. (2003). Can Cosmopolitan Democracy be Democratic, in D. Archibugi (ed.) Debating Cosmopolitics. Verso, pp. 67-85."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sovereignty and the Responsibility to Protect\n\nShould sovereignty be understood not as a right but as a responsibility? To whom is the responsibility owed? Is intervention on humanitarian grounds ever legitimate?\n\nCompulsory readings:\nInternational Commission on Intervention and State Sovereignty (ICISS) (2001) 'The Responsibility to Protect: Report of the International Commission on Intervention and State Sovereignty', Ottawa: IDRC, http://responsibilitytoprotect.org/ICISS%20Report.pdf \nPiirimäe, Eva (forthcoming in 2019), Sovereignty, Self-Determination and Human Rights from Walzer to Responsibility to Protect (R2P), Global Responsibility to Protect. \nMoses, J. (2013). Sovereignty as Irresponsibility? A Realist Critique of the Responsibility to Protect. Review of International Studies, Vol. 39, No. 1, pp. 113-135."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Alternatives to Sovereignty and Alternative Sovereignty Claims\n\nWhy does traditionally sino-centric China cling to the modern concept of sovereignty? What makes Russia a \"sovereign democracy\"? How can the Order of Malta be a sovereign entity?\n\nCompulsory readings:\nCarlson, A. (2011). Moving Beyond Sovereignty? A Brief Consideration of Recent Changes in China's Approach to International Order and the Emergence of the Tianxia Concept. Journal of Contemporary China, Vol. 20, No. 68, pp. 89-102.\nMorozov, V. (2008). Sovereignty and Democracy in Contemporary Russia: A Modern Subject Faces the Post-modern World. Journal of International Relations and Development, Vol. 11, pp. 152-180.\nCox, N. (2002). The Acquisition of Sovereignty by Quasi-States: The Case of the Order of Malta. Mountbatten Journal of Legal Studies, Vol. 6, No. 1 & 2, pp. 26-47."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Concluding discussion\n\nSeminar: What use for sovereignty today?\n\nCompulsory readings:\nThompson, H. (2006). The Modern State and Its Adversaries. Government and Opposition, Vol. 41, No. 1, pp. 23-42.\nCohen, J. L. (2004). Whose Sovereignty? Empire Versus International Law. Ethics & International Affairs, Vol. 18, No. 3, pp. 1-24.\nKoskenniemi, M. (2011). What Use for Sovereignty Today? Asian Journal of International Law, Vol. 1, pp. 61-70. http://www.helsinki.fi/eci/Publications/What%20use%20for%20Sovereignty-.pdf"}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "77bcd9a1-fcc3-9503-15f8-5fe7b1cc7bae", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "028a6c04-d0be-f756-7124-a3c71493fdac", "parent_code": "SHRG.03.011", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}