{"uuid": "a7bd7306-2a8e-34eb-979b-3fe32b5fc5dc", "code": "sv-2018-spring-fulltime-c3-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-04T12:01:51", "title": {"en": "Regional Conflicts in Eurasia", "et": "Euraasia regionaalsed konfliktid"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "18/19 S regular SV Eng", "et": "18/19 K PÕ SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 2, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course aims to provide an overview of a number of protracted regional conflicts in Eurasia. We will examine closely conflicts ranging from North and South Caucasus to Transnistria, and from Ukraine/Crimea to Central Asia, from the collapse of the Soviet Union until today. More specifically, we will apply conflict assessment toolbox, and analyse dividers and connectors, principal players and secondary actors, drivers of conflict and peace, and finally, windows of vulnerability and opportunity in these regional conflicts.", "et": "Kursus käsitleb mitmeid pikaajalisi ja raskesti juhitavaid regionaalseid konflikte Kesk-Aasias, Lõuna- ja Põhja-Kaukaasias, Transnistrias ja Ukrainas/Krimmis. Nende (\"külmutatud\") konfliktide analüüsimisel lahatakse teemasid, mis on olnud vastuolude põhjustajateks ja koostöö takistajateks; põhilisi ja teisejärgulisi osalejaid ja nende huvisid; samuti seda, kuidas osalejatel on õnnestunud mobiliseeruda konfliktiks ja pidurdada rahuotsinguid; ning viimaks, millised on konflikti lahendamise väljavaated."}, "objectives": [{"en": "This course aims to provide an overview of a number of protracted regional conflicts in Eurasia, to introduce their key players and their main stakes, and to critically analyse the conflict management perspectives. The course seeks to apply conflict assessment toolbox in the empirical analysis of the post-Soviet region conflicts.", "et": "Interaktiivse kursuse eesmärgiks on anda ülevaade kestvatest regionaalsetest konfliktidest Euraasias ja tutvustada nende osapooli ning nende peamisi huvisid. Kursuse käigus kasutatakse konflikti analüüsi meetodit hindamaks võimalike lahenduste väljavaadet."}], "learning_outcomes": [{"en": "Upon completion of the course, the students will:", "et": "Kursuse läbinu:"}, {"en": "1) have a comprehensive empirical understanding of the major regional conflicts in the former Soviet space;", "et": "1) saab põhjalikud teadmised suurematest regionaalsetest konfliktidest endise N. Liidu aladel;"}, {"en": "2) be able to analyse these frozen and on-going conflicts through conflict assessment toolbox;", "et": "2) oskab analüüsida külmutatud ja käimasolevaid konflikte spetsiaalsele analüüsimeetodile tuginedes;"}, {"en": "3) situate the texts read in the framework of the course and their authors in wider intellectual contexts; ", "et": "3) suudab asetada loetud tekstid ja omandatud teadmised konfliktidest laiemasse intellektuaalsesse konteksti;"}, {"en": "4) formulate, present and defend specific arguments in oral and written formats alike;", "et": "4) formuleerida, esitada ja kaitsta argumente suulises ja kirjalikus vormis;"}, {"en": "5) put forth a clear and well-argued policy advice on conflict management.", "et": "5) ettevalmistada selgelt argumenteeritud poliitilisi nõuaandeid konfliktide ohjamisest."}], "notes": {}}, "grading": {"independent_work": {"et": "The course is going to be interactive, combining lecture style presentations and discussion, with an emphasis on the latter. Students will be encouraged to apply their own insights to the conflicts under the discussions, and to amplify and clarify the points made by the lecturer. Small group discussions are encouraged throughout the course.\n\nStudents arrive in seminars having completed all the required readings and ready to contribute to a general discussion loosely organised around the study questions suggested beforehand by the instructor. Each student should have a couple of questions to offer for group discussion and analysis weekly. Every student is expected to speak in every seminar. Each session will be kicked off with a 30 minute presentation of the timeline of the key events and core issues in the conflict under discussion, including also actors' motives and settlement perspectives. The follow-up seminars will broaden the discussion on other specific aspects relevant to conflict dynamics. Active and meaningful participation in seminars is worth 20% of the final grade of the course.\n\nLearning to read and digest critically academic texts and putting forth informed arguments in writing assignments is an important study goal of this course. This course has one written assignment:\n1) a policy paper (7-9 pages), advising the European Union on one of the following topics:\n(a) taking a particular action vis-à-vis the Ukrainian-Russian crisis; \n(b) revisi(ti)ng its neighbourhood policy in light of the wars in Georgia (2008) and Ukraine (2014);\n(c) reinventing its Russia-policy in light of the frozen conflicts in Eurasia in general.\n\nThe aim of this exercise is to learn to present background information concisely and clearly for a time-deprived expert audience, to analyse the ongoing conflicts in Eurasia with clear policy implications in mind for the foreign policy actor on whom the students might actually have the greatest leverage in spe (i.e. the EU), and to put forth a clear and well-argued policy advice. This exercise will be worth 80% of the final grade. The particular requirements for this paper will be discussed in class in due course."}, "independent_work_assessments": [{"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Policy paper (max 80 points): written assignment will be evaluated on how cogently and thoughtfully the topics are analyzed, how accurately evidence is interpreted and credible sources are incorporated, and whether the reasoning, findings and recommendations are sound."}}], "grade_preconditions": {"et": "Seminars are compulsory; only fully completed attendance allows access to the final grading. All absences can be compensated by answering the seminar questions in written form."}, "grade_evaluation": {"et": "Seminar participation - 20% of the final grade\nPolicy paper - 80% of the final grade"}, "debt_elimination": {"et": "Upon the agreement with the instructor."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "As outlined in the course timetable.", "recommended_materials": "General background reading for the course:\n1. Waal, Thomas de (2003). Black Garden: Armenia and Azerbaijan through Peace and War. New York, NY: New York University Press.\n2. Krüger, Heiko (2010). The Nagorno-Karabakh Conflict: A Legal Perspective. Springer-Verlag.\n3. George, Julie A. (2009). The Politics of Ethnic Separatism in Russia and Georgia. Palgrave MacMillan.\n4. Asmus, Ronald D. (2010). A Little War that Shook the World: Georgia, Russia, and the Future of the West. Palgrave Macmillan.\n5. Schaefer, Robert (2010). The Insurgency in Chechnya and the North Caucasus: From Gazavat to Jihad. Praeger.\n6. Ware, Robert and Enver Kisriev (2010). Dagestan: Russian Hegemony and Islamic Resistance in the North Caucasus. Routledge.\n7. King, Charles (2000). The Moldovans: Romania, Russia, and the Politics of Culture. Hoover Institution Press.\n8. Wie Davis, van Elizabeth and Rouben Azizian (2007). Islam, Oil, and Geopolitics: Central Asia After September 11. Rowman and Littlefield Publishers.\n9. Heathershaw, John (2009). Post-Conflict Tajikistan: The Politics of Peacebuilding and the Emergence of Legitimate Order. London: Routledge.\n10. Kuzio, Taras (2007). Ukraine-Crimea-Russia: Triangle of Conflict. Stuttgart: ibidem-Verlag (Soviet and Post-Soviet Politics and Society Series). \n11. Sakwa, Richard (2015). Frontline Ukraine: Crisis in the Borderlands. I. B. Tauris.\n\n\nFilms:\n\"From Home to Home\" (2008), https://www.youtube.com/watch?v=6ye4gTsaxB8\n\"Absence of Will: A Journey Through Georgia's Conflict Zones\" (2009), https://www.youtube.com/watch?v=WAYAK-ALjGw\n\"Chechnya, War without Trace\" (2016) http://www.dailymotion.com/video/x2uf2p5\n\"PMR: In the State of Limbo\" (2014), https://www.reddit.com/r/Documentaries/comments/5d6ffv/pmr_in_the_state_of_limbo_2014_there_is_an/\n\"Operation Crimea\" (2014), https://www.youtube.com/watch?v=RU6wFr9pwZE\n\n\nUseful journals and websites:\nEurope-Asia Studies (e.g., vol. 64, no. 9, Special Issue: Many Faces of the Caucasus (November 2012) \nEurasian Geography and Economics\nKritika\nThe Slavic Review\nThe Russian Review\nJournal of Eurasian Studies\nThe Jamestown Foundation, Eurasia Daily Monitor, http://www.jamestown.org/programs/edm/\nPaul Goble blog: Window on Eurasia, http://windowoneurasia.blogspot.co.uk/ \nICDS blog, http://blog.icds.ee/ \nCenter for Strategic and International Studies' Russia and Eurasia Program, http://csis.org/program/russia-and-eurasia-program  \nPONARS Eurasia blog and policy papers at http://www.ponarseurasia.org/ \nNUPI Department of Russian and Eurasian Studies, http://english.nupi.no/Activities/Organization/Department-of-Russian-and-Eurasian-Studies \nSIPRI on conflict and peacebuilding in Caucasus, http://www.sipri.org/research/security/caucasus  \nPRIO Regions and Powers research group, http://www.prio.org/Research/Group/?x=11\nCentral Asia-Caucasus Institute & Silk Road Studies Program, http://www.silkroadstudies.org/new/\nCentral Asia-Caucasus Analyst, http://www.cacianalyst.org/\nInternational Centre for Black Sea Studies, http://www.icbss.org/\nEurasia Foundation, http://eurasia.org/\nEurasiaNet.org, http://www.eurasianet.org/ \nKavkaz Center, http://www.kavkazcenter.com/eng/"}, "participants": {"lecturers": [{"person_uuid": "96447775-39eb-9f46-3e10-0482702a89a3", "person_name": "Eiki Berg", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-31"}, "entries": [{"time": "2019-02-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction: Defining the Region, Delimiting the Conflicts, Designing Policy Advice\nReading list:\n1. Buzan, Barry and Ole Wæver (2003). The Post-Soviet Space: A Regional Security Complex Around Russia, from Regions and Powers: The Structure of International Security. Cambridge: CUP (pp. 397-436).\n2. Fischer, Sabine (2016). Russian Policy in the Unresolved Conflicts, in S. Fischer (ed) Not Frozen! The Unresolved Conflicts over Transnistria, Abkhazia, South Ossetia and Nagorno-Karabakh in Light of the Crisis over Ukraine. SWP Research Paper, 9-24."}}, {"time": "2019-02-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "South-Caucasus I: Nagorno-Karabakh Conflict.\nReading list:\n1. Voronkova, Anastasia (2013). Nationalism and Organized Violence in Nagorno-Karabakh: A Microspatial Perspective, Nationalism and Ethnic Politics, 19:1, 102-118\n2. Nagorno-Karabakh's Gathering War Clouds. International Crisis Group Europe Report N°244, 1 June 2017"}}, {"time": "2019-02-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "South Caucasus II: Abkhazia, South Ossetia, Russo-Georgian War of 2008.\nReading list:\n1. Hopf, T. (2005). Identity, Legitimacy, and the U se of Military Force: Russia's Great Power Identities and Military Intervention in Abkhazia. Review of International Studies, Vol. 31, pp. 225-243.\n2. Toal, Gerard (2009). Russia's Kosovo: A Critical Geopolitics of the August 2008 War over South Ossetia. Eurasian Geography and Economics, 49(6): 670-705.\n3. Abkhazia: Long Road to Reconciliation. Crisis Group Europe Report N°224, 10 April 2013."}}, {"time": "2019-03-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The Spread of Violence in North Caucasus: Chechnya and Dagestan.\nReading list:\n1. Kolossov, Vladimir & Gerard Toal (2007). An Empire's Fraying Edge? The North Caucasus Instability in Contemporary Russian Geopolitical Culture, Eurasian Geography and Economics, 48:2, 202-225\n2. Hansen, Lars Funch (2012). Renewed Circassian Mobilization in the North Caucasus 20-years after the Fall of the Soviet Union, Journal on Ethnopolitics and Minority Issues in Europe 11(2), 103-135.\n3. The North Caucasus: The Challenges of Integration (I), Ethnicity and Conflict, Crisis Group Europe Report N°220, 19 October 2012."}}, {"time": "2019-03-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Moldova and Transnistria.\nReading list:\n1. Troebst, Stefan (2003). \"We Are Transnistrians!\" Post-Soviet Identity Management in the Dniester Valley, Ab Imperio,  N°1, 437-466.\n2. Moldova's Uncertain Future. Crisis Group Europe Report N°175, 17 August 2006.\n3. Popescu, Nicu (2012). Transnistria: A Bottom-up Solution. ECFR Policy Brief N°63."}}, {"time": "2019-03-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Central Asian Conflicts.\nReading list:\n1. Allison, Roy (2004). Strategic Reassertion in Russia's Central Asia Policy, International Affairs 80(2): 277-293.\n2. Lynch, Dov (2001). The Tajik Civil War and Peace Process, Civil Wars, 4(4), 49-72,\n3. Stress Tests for Kazakhstan, Europe and Central Asia Briefing N°74, 13 May 2015.\n4. Kyrgyzstan: An Uncertain Trajectory, Europe and Central Asia Briefing N°76, 30 September 2015."}}, {"time": "2019-03-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Crimea and East Ukrainian Separatism of 2014.\nReading list:\n1. Biersack, John and Shannon O'Lear (2014). The Geopolitics of Russia's Annexation of Crimea: Narratives, Identity, Silences, and Energy. Eurasian Geography and Economics 55(3), 247-269\n2. Ukraine: Running out of Time. International Crisis Group Europe Report N°231, 14 May 2014.\n3. Ukraine: Military Deadlock, Political Crises. International Crisis Group Europe Briefing N°85, 19 December 2016."}}, {"time": "2019-04-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Wrap-up Discussion\nReading list:\n1. Toal, Gerard (2017). Why Does Russia Invade Its Neighbours?, from Near Abroad: Putin, the West and the Contest over Ukraine and the Caucasus. Oxford University Press, 17-54.\n2. Coyle, James (2017). Conclusion, from Russia's Border Wars and Frozen Conflicts, Palgrave Macmillan, 257-273."}}]}, "registration_info": {"audience": {"et": "Course is open for students with sufficient knowledge in IR and Conflict Studies"}, "min_students": 10, "max_students": 20}, "parent_uuid": "cc34defd-5f25-9ae9-caeb-0dde834c5aa9", "parent_code": "SHRG.03.033", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}