{"uuid": "fd27a84e-38b7-f769-ba64-535687ae393f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-22T16:17:34", "title": {"en": "Comparative Ethnopolitics", "et": "Võrdlev etnopoliitika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Inter-group conflicts that are based on ethnically defined social boundaries remain a salient issue in today's world and prevent states from establishing lasting political and economic conditions for peace and growth. Not just the post-colonial world is frequently errupting in violence between groups that define themselves in ethnic, religious or linguistic terms; also other parts of the world, including the developed democracies are witnessing minority rights movements and ethnic separatism that challenge the status quo of the established nation-states. Finally, different migration waves and mass immigration into the rich \"Western\" democracies since the mid-20th century have put established understandings and practices of citizenship, democratic representation and justice into question calling for new ways of thinking both theoretically and practically about diversity management and social integration. But what exactly motivates individuals to identify with an ethnic group? What explains the resilience of ethnic identities and their seemingly easy political mobilization? And how can democratic states manage ethnic, linguistic and religious diversity without using violence or other forms of coercion? The course will address these and many other questions, focusing both on theoretical debates about ethnicity, ethnic group formation and conflict as well as on specific ethnopolitical regimes and modes of conflict regulation instituted in countries around the world.", "et": "Mis motiveerib inimesi samastuda etnilise grupiga? Mis on etnilise identiteedi vastupanuvõime ja kuidas see mõjutab poliitilist mobiliseerumist? Kuidas demokraatlikud riigid haldavad etnilist, keelelist ja religioosset mitmekesisust ilma vägivallata. Ainekursus tegeleb nende ja paljude teiste küsimustega, keskendudes teoreetilistele aruteludele rahvuse, etnilise grupi moodustamise, etnilise konflikti tekkimise ja selle konflikti reguleerimise üle."}, "objectives": [{"en": "This course will examine different ways in which democratic states can regulate and accommodate ethnocultural diversity. It will cover a wide range of cases and policies, discussing the pros and cons of various ethnopolitical regimes against the normative and institutional requirements of democratic governance.", "et": "Aine peamises fookuses on etnopoliitika - erinevad viisid, kuidas demokraatlikud riigid reguleerivad oma kodanikkonna etnilist mitmekesisust. Aines analüüsitakse etnose teoreetilisi ja kontseptuaalseid lähtekohti, arutatakse erinevate etnopoliitiliste situatsioonide ja etnopoliitiliste režiimide plusse ja miinuseid lähtuvalt demokraatlikust valitsemisest."}], "learning_outcomes": [{"en": "Upon completing the course, students:", "et": "Aine edukalt läbinu üliõpilane:"}, {"en": "- analyse ongoing debates over ethnicity and the salience of ethnic identities as well as their mobilization in the modern world; ", "et": "- oskab analüüsida käimasolevaid arutelusid rahvuse ja etnilise identiteedi ning selle mobiliseerumise üle tänapäevases maailmas;"}, {"en": "- reconstruct the complex ethnopolitical situations in different countries and identify different modes of ethnic conflict regulation by democratic states; ", "et": "- oskab mõtestada ja arutleda keeruliste etnopoliitiliste olukordade üle ja selgitada etnilise konflikti demokraatliku reguleerimise viise;"}, {"en": "- demonstrate research skills by investigating and reporting on specific country cases of ethnic conflict regulation; ", "et": "- tunneb erinevate riikide ethnopoliitilisi olukordi ja nendele olukordadele kohaseid lahendusi;"}, {"en": "- formulate relevant questions from the reading and organise a class discussion; ", "et": "- omab oskusi läbi viia teadustööd, uurida eri riikide etnilise konflikti reguleerimise konkreetseid juhtumeid;"}, {"en": "- reflect in writing on the concepts discussed and develop a sound position on critical questions.", "et": "- oskab sõnastada asjakohaseid küsimusi ning arendada diskussiooni."}], "notes": {}}, "grading": {"independent_work": {"et": "Detailed instructions are provided in Moodle."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Class presentation of the case study.\nThe presentation of the ethnopolitical regime country case study in the class will be assessed according to how well \na) the presentation in class provides a critical summary of the main findings and is able to trigger discussion of the case within the broader ethnopolitical regime-frame;\nb) the presentation uses visual aids, graphs and videos where applicable to ease the comprehension of the topic at hand."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "The book report. Students have to select 1 book for reading from the list of 10 books provided in the reading list by the course instructors. The book report will be assessed according to how well it analyses the main theoretical discussions and conceptual and analytical frameworks provided in the book. The book report must be properly formatted, including all necessary references, title and the author of the book, author of the report."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Students have to choose one country case study presentation in which they perform as discussants. Discussant has to prepare 5-minutes commentary on the presentation in the class. Discussant will be assessed based on the depth of the analysis of the provided comments that demonstrate the comprehension of the topic at hand."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "There will be one mid-term exam after the first part of the course focusing on the theoretical and conceptual aspects of the course topic. Mid-term exam will be online and remotely administered."}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Ethnopolitical regime country case study. \nThe ethnopolitical regime country case study will be assessed according to how well\na)\tthe report summarizes key information about the particular ethnopolitical situation and resulting constellations in the assigned country; \nb)\tthe report critically reflects on the efficacy and effects of the established mode of ethnic conflict management/regulation in the country; \nc)\tthe report remains within the page limits and relies on decent academic sources (reliable/verifiable internet sources, academic articles etc.) that are properly referenced;\nd)\tthe report is properly formatted and designed in order to ease the reading."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "All assignments must be submitted according to the relevant deadlines (see Moodle). Students may not skip any of the assignments. In case of extraordinary situations please contact the course instructor."}, "grade_evaluation": {"et": "Book report \t\t                25 out of 100\nMid-term exam \t\t        15 out of 100 \nIn-class presentation               15 out of 100\nDiscussant                                 5 out of 100 \nCase study report \t                40 out of 100"}, "debt_elimination": {"et": "Assignments need to be submitted by respective deadlines. Extension of the deadlines is allowed only in exceptional circumstances that must be cleared prior with the instructor. Attendance at webinars is required. Absences will be excused (1) for illness or (2) for academic activities (e.g. participation in a student conference or a study tour). If you are unable to attend, you should notify the instructor via e-mail prior to the session."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "This course materials are in Moodle. Students registered for this course via the Study Information System will automatically obtain access to the course via their Moodle account."}, "participants": {"lecturers": [{"person_uuid": "482d0706-22c3-f2de-735d-10b8803e7c93", "person_name": "Kristina Kallas", "structural_unit": {"code": "SVNC12", "name": {"en": "Department of Teacher Education", "et": "õpetajakoolituse osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVNC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "76864fc7-7038-460b-189f-13a9ae71b944", "person_name": "Rasmus Põder", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2024-09-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Introduction to the course"}, "description": {}}, {"time": "2024-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ethnicity"}, "description": {"et": "We will begin our course with a discussion of the base concept of ethnicity. For, if 'ethnopolitics' involves politics that is driven by ethnicity, then what is ethnicity? We will focus on a framework that describes ethnicity as a socio-psychological process of communication aimed at building trust between humans. This kind of framework will, in turn, allow us to map out and compare different components that such processes (systems) might use to achieve this 'social communication'."}}, {"time": "2024-09-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Nations, nationalism, and nation-building"}, "description": {"et": "We will discuss politically and academically much-debated conceptual understandings of nation, nationalism and nation-state. Nationalism is often seen as synonymous with ethnopolitics. But we will try and show how nationalism is best seen as a historical phenomenon in which ethnicity (social communication) became mixed with the modern state and led to what might be termed 'politicized ethnicity'."}}, {"time": "2024-09-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ethnopolitical situations"}, "description": {"et": "When the modern state became 'ethnicized', the notion of nation-statehood began to spread around the globe. However, this diffusion played itself out in different ways, since the socio-economic-political contexts that this new notion came across in different parts of the world were often very different. As a result, ethnic groups in different parts of the world came into new relational contact with each other or what we will call 'ethnopolitical situations'. In this week, we will profile these situations in order understand how the background conditions to various types of ethnopolitics can differ."}}, {"time": "2024-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ethnopolitical regimes I"}, "description": {"et": "The core of this course involves understanding the ways in which modern state power is used to either promote or reduce ethnic diversity (or different social-communicative systems), and whether these processes are done democratically or forcibly. In first meeting, we will introduce a typology of ethnopolitical regimes that leverages these two dimensions. During the first part we will look at the democratic regimes. "}}, {"time": "2024-10-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Ethnopolitical regimes II"}, "description": {"et": "During the second meeting on ethnopolitical regimes we will look at the second half of the regimes - non-democratic ones."}}, {"time": "2024-10-25", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {"et": "Mid-term exam"}, "description": {}}, {"time": "2024-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Consociationalism and ethnic federalism"}, "description": {"et": "In-class case-study presentations"}}, {"time": "2024-11-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Integration, political nation and voluntary assimilation"}, "description": {"et": "In-class case-study presentations"}}, {"time": "2024-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Forced assimilation"}, "description": {"et": "In-class case-study presentation"}}, {"time": "2024-11-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Ethnic cleansing, genocide and ethnocracy and ethnic democracy"}, "description": {"et": "In-class case-study presentation"}}, {"time": "2024-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Multiculturalism"}, "description": {"et": "In-class case-study presentation"}}]}, "registration_info": {"audience": {"et": "BA students in Government and Politics, MA students in political science, international relations and regional studies; Erasmus students welcome"}, "min_students": 10, "max_students": 50}, "parent_uuid": "81c41fd8-dc44-d073-b240-e4c1f0fae4ac", "parent_code": "SHRG.02.023", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}