{"uuid": "e20d6d5c-76e3-ba8f-122b-9b1ed2fc803e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-28T12:56:05", "title": {"en": "Cognitive Mechanisms and Processes of Consciousness", "et": "Teadvuse kognitiivsed mehhanismid ja protsessid"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 12, "practice": 0, "seminar": 8, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course provides an overview of the concept, natural-scientific research methods, main problems and contemporary theories of consciousness. In the introductory part of the course basic understanding of the current cognitive psychology concepts is delivered, focusing on sensory processes, perception, attention, memory, decision-making and metacognition. The topics include: the \"hard problem\", consciousness as a variable, conscious and pre-conscious processes, neurophysiological correlates and psychophysiological signatures of consciousness, biochemical and psychopharmacological factors of consciousness, experimental methods of consciousness studies, neuropsychological methods, phenomena of consciousness, theories of consciousness.", "et": "Kursus annab ülevaate teadvuse mõistest, loodusteaduslikest uurimismeetoditest, peamistest vaidlusküsimustest ning teadvuse moodsatest teooriatest. Sissejuhatuse raames antakse ülevaade tänapäevasest ettekujutusest peamistest kognitiivsetest protsessidest - sensoorsed protsessid, taju, tähelepanu, mälu, otsustamine, metakognitiivsed protsessid. Käsitletavad teemad: \"raske probleem\", teadvustatus kui eksperimentaalne muutuja, teadvustatud ja teadvustamata vaimsed protsessid, taju, tähelepanu ja mälu seosed teadvusemehhanismidega, alt-üles ja ülalt-alla suunatud protsessid, teadvusseisundite ja -sisude neurofüsioloogilised korrelaadid ja psühhofüsioloogilised signatuurid, teadvusseisundite biokeemilised ja psühhofarmakoloogilised tegurid, teadvuseuuringute eksperimentaalsed meetodid: maskeerimine, \"flash-lag\" efekt, binokulaarne võistlus, muutusepimedus, liikumise poolt indutseeritud pimedus, transkraniaalne magneetiline stimulatsioon, neuropsühholoogilised meetodid (\"pimenägemine\", prosopagnoosia, Capgras' sündroom, ruumipiirkonna eiramine), mällu salvestamine anesteesiaseisundis, \"filling-in\" fenomenid, Ganzfeld, \"ülerahvastusefekt\", moodsad teadvuseteooriad (monistlikud ja dualistlikud teooriad, reduktsionistlikud ja emergentistlikud teooriad, Eccles'i ja Popperi teooria, Baars'i globaalse tööruumi teooria, Crick'i ja Koch'i neurobioloogiline teooria, Edelmani ja Tononi integreeritud informatsiooni teooria, Greenfieldi gestaltteooria, Scott'i emergentistlik teooria, Hameroffi ja Penrose'i kvantmehhaaniline teooria, Taylori komputatsiooniline teooria, Humphrey evolutsiooniline teooria, Revonsuo virtuaaltegelikkuse teooria, Libeti käsitlus teadvusest ja tahtest, gamma-sagedusliku sünkroonisatsiooniteooria, retusheerimisteooria, ajukoore püramiidrakkude mehhanismid teadvusseisundi ja teadvuse sisu vahendajatena)."}, "objectives": [{"en": "The aims of this course are to develop the understanding of the problem of consciousness in its natural-scientific and experimental psychological aspects, relate scientific consciousness studies to standard concepts of modern cognitive psychology, teach basic concepts of the science of consciousness, introduce main scientists, works and methods of this discipline and form initial skills in working with the databases in this area, show links between consciouness science and applied fields such as medicine and law, and build the theoretical basis for empirical studies in this domain.", "et": "Luua ettekujutus teadvuse probleemist selle loodusteaduslikes ja eksperimentaalpsühholoogilistes aspektides ning seostatuna üldpsühholoogiliste kognitiivsete protsessidega, õpetada teadvuseteaduse põhimõisted, tutvustada olulisemaid teadlasi, töid ja kontseptsioone ning uurimismeetodeid selles valdkonnas, näidata teadvuseprobleemi seoseid meditsiini ja õigusalaga, kujundada esimesed oskused töötada selles ainevaldkonnas andmebaasidega ja kirjandusega ning luua eeldused empiiriliste teadvuseuuringute juurde asumiseks."}], "learning_outcomes": [{"en": "Upon completion of this course, students:", "et": "KURSUSE LÕPPEDES PEAB ÜLIÕPILANE:"}, {"en": "- know and are able to explain main concepts of consciousness science, main methods of consciousness research and main consciousness theories from experimental psychology and neuroscience", "et": "- oskama välja tuua ja lahti mõtestada teadvuseteaduse põhimõisted, nende sisu, peamised uurimismeetodid ja olulisemad teooriad ning aru saama seostest teadvuseteaduse ning kognitiivpsühholoogia mõistete vahel"}, {"en": "- understand interdisciplinary nature of consciousness science, relation of consciousness phenomena and processes to other psychological and behavioural processes and practical domains", "et": "- mõistma teadvuseteaduse interdistsiplinaarset olemust, teadvusenähtuste kohta psüühika ja käitumise üldisemas kontekstis ning praktilistes rakendusvaldkondades"}, {"en": "- are capable of distinguishing  and evaluating main characteristics and criteria of conscious states and levels of (un)conscious information processing", "et": "- oskama välja tuua ja hinnata teadvusliku seisundi või teabetöötlustaseme peamisi tunnuseid ja kriteeriume"}, {"en": "- have skills and knowledge necessary for working with databases relevant for consciousness studies and know main publication outlets in this area.", "et": "- oskama kasutada teadvuseuuringute alase kirjanduse leidmiseks andmebaase ja tundma peamisi selle teadusteema jaoks olulisi väljaandeid."}], "notes": {}}, "grading": {"independent_work": {"et": "Aine kuulajad moodustavad vastavalt ette valmistatava referaadi temaatilisele ühishuvile 6-7 liikmelised rühmad, kes valivad õppejõuga konsulteerides rühmale refereerimiseks teadusartikli. Referaat esitab käsitletava artikli põhiteema, eesmärgid, esitatu põhisisu / tulemused, nende tähtsuse ning annab omapoolse hinnangu refereeritule. \n\nEsiteks esitatakse referaat hiljemalt esimese seminari alguseks paberkandjal instituudi õppekorralduse spetsialistide ruumi postiriiulisse (Näituse 2-211) või otse õppejõule. Maht 3-4 lk (reavahe 1.0 või 1.5, font Times New Roman suurusega 12). Referaadi lõpus tuuakse ära iga kaasautori panus referaadi valmimisse (kokku 100%). \n\nTeiseks tehakse sama referaadi põhjal seminaris ettekanne (soovitatav kasutada dataprojektorit, esitlus tuuakse auditooriumisse kohale mälupulgal või laetakse alla kohapeal veebist); ettekandjaks võib olla rühma esindaja või vaheldumisi mitu liiget."}, "independent_work_assessments": [{"work_type": {"code": "synopsis", "et": "Referaat", "en": "synopsis"}, "description": {"et": "vt Iseseisvate tööde tegemise juhised"}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "vt Iseseisvate tööde tegemise juhised"}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Hinne kujuneb kombinatsioonis grupitööna valminud referaadi (kodutöö) esitamisest (25%), ning suulisel eksamil antud vastuste tasemest (75%). Hindamise aluseks on põhimõistete ja -teooriate tundmise tase, oskus seostada erinevaid fakte ja käsitlusi, eksperimentaalpsühholoogiliste fenomenide seostamise oskus vastavate aju baasprotsesside tööga."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "."}}], "grade_preconditions": {"et": "Osalemine seminarides, esitatud referaat."}, "grade_evaluation": {"et": "Referaat 25%, eksam 75%."}, "debt_elimination": {"et": "Referaadi esitamine nädal pärast esimest esitamise tähtpäeva; eksami sooritamine kaks nädalat pärast esimest eksamikuupäeva."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "18ef9c90-20c6-433f-ac63-188bc861dd02", "type": "MOODLE", "code": "SOPH.00.318", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "e95f12cb-4cf7-18ff-3c8a-68ed8e469fa3", "person_name": "Talis Bachmann", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25,27,29,31"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Teadvuse mõiste ja peamised kontseptuaalsed probleemid teadvuseteaduses."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Teadvus kui eksperimentaalne muutuja. Nägemise ja kuulmise baasmehhanismid; kognitiivsete protsesside põhimõtteline struktuur. Peamised eksperimentaalsed meetodid teadvuseuuringutes. Teadvusefenomenid."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Mikrogeneetilised eksperimentaalsed meetodid ja fenomenid teadvuseuuringutes. Moodsad teadvuseteooriad. Teadvusseisundid ja -fenomenid neurobioloogia aspektist vaadatuna."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uusimad eksperimentaalsed uurimused teadvuse protsessidest ja seisunditest (Elsevier'i Trends- väljaannete, Nature ja Science'i jm andmetel). Magistrantide ettekanded ja diskussioon."}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}}, "parent_uuid": "2aae9d77-e128-6cb3-7f8a-8a3a14ca9a38", "parent_code": "SOPH.00.318", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}