{"uuid": "961d109f-82e4-2590-9e51-962c96ccce5c", "code": "SOPH.00.276", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-18T10:17:04", "title": {"en": "Mental Abilities", "et": "Vaimsed võimed"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Covered topics: approaches to intelligence at different levels of descriptions; leading researchers in the field of intelligence; models and theories describing the structure of intelligence; assessment of intelligence; the relationships of intelligence test scores to different life outcomes; genetic and environmental influences to differences in intelligence test scores; reductionist attempts to explain individual differences in psychometric intelligence through different parameters of information processing and brain; group differences; intelligence in everyday life.", "et": "Käsitletavad teemad: intelligentsuse käsitlemine erinevatel kirjeldustasanditel; juhtivad intelligentsuseuurijad; intelligentsuse struktuuri kirjeldavad mudelid ja teooriad; intelligentsuse hindamine; intelligentsusetestide tulemuste seosed inimeste toimetulekuga erinevates eluvaldkondades, inimestevaheliste erinevuste geneetilised ja keskkondlikud mõjutajad; reduktsionistlikud katsed seletada inimestevahelisi erinevusi  infotöötlus- ja ajuparameetritega; gruppidevahelised erinevused; intelligentsus igapäevaelus."}, "objectives": [{"en": "The general objective of the course is to give audience a structured outline of the basic approaches to human intelligence differences and of the basic research questions and results related to it. At the end of the course students have to be familiar with the fundamental concepts, know the basic approaches in intelligence research and empirical findings regarding intelligence. In the light of currently dominating theoretical standpoints the students must also be able to distinguish scientifically reasoned point of views regarding human intelligence differences from unscientific ones. The structure of the course attempts to be dialectic, contrasting and synthesising different approaches. The main focus of the course is on contemporary research trends and results.", "et": "Kursuse üldeesmärk on anda kuulajatele struktureeritud ülevaade intelligentsuse põhilistest käsitlusviisidest ning intelligentsusega seotud põhilistest uurimisküsimustest ja - tulemustest. Kursuse läbinu peab valdama põhimõisteid, tundma põhilisi intelligentsuse käsitlusviise ja empiirilisi leide, samuti peab läbinu olema võimeline hetkel domineerivate teoreetiliste seisukohtade valguses eristama teaduslikult põhjendatud intelligentsust puudutavaid seisukohti pseudoteaduslikest. Kursus püüab oma ülesehituselt olla dialektiline, vastandades ning sünteesides erinevaid käsitlusviise. Kursuse põhirõhk on kaasaegsetel uurimissuundadel- ja tulemustel."}], "learning_outcomes": [{"en": "At the end of the course students:", "et": "Kursuse läbinu:"}, {"en": "- have structured outline of basic contemporary approaches to intelligence", "et": "- omab struktureeritud ülevaadet põhilistest kaasaegsetest intelligentsuse käsitlusviisidest"}, {"en": "- know the models describing the structure of intelligence, methods and instruments used for assessing intelligence, and the basics about interpreting assessment results", "et": "- teab intelligentsuse struktuuri kirjeldavaid mudeleid, intelligentsuse hindamise viise ja -vahendeid ning hindamistulemuste tõlgendamise põhitõdesid"}, {"en": "- have overview of the predictive value of psychometrically measured intelligence in terms of different life outcomes", "et": "- omab ülevaadet psühhomeetriliselt mõõdetud intelligentsuse ennustusväärtusest erinevates eluvaldkondades"}, {"en": "- know possible factors that create individual differences in cognitive abilities", "et": "- teab võimalikke tegureid, mis kujundavad inimestevahelisi erinevusi vaimsetes võimetes"}, {"en": "- know the most common theories that try to explain the cognitive and biological basis of individual differences", "et": "- tunneb levinumaid teooriaid, mis püüavad kirjeldada inimestevaheliste erinevuste kognitiivset ning bioloogilist tagapõhja"}, {"en": "- have a conception of topics that have drawn public attention to intelligence research, such as possible group differences and the social meaning of individual and group differences.", "et": "- omab ettekujutust intelligentsuse uurimisele avalikku tähelepanu tõmmanud teemadest nagu võimalikud gruppidevahelised erinevused ning inimeste- ja gruppidevaheliste erinevuste sotsiaalse tähendused."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}