{"uuid": "34ad1ca9-e591-01c3-abc7-df492fb6b146", "code": "SOPH.00.301", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Advertising Psychology", "et": "Sissejuhatus reklaamipsühholoogiasse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In this course the topics include: the concept of advertising and psychological nature of advertising influence; main mechanisms of advertising effects; core elements of advertising messages and their structure; basic concepts and principles of persuasion; categories of advertising and their specific features.", "et": "KURSUSE RAAMES TULEVAD KÄSITLEMISELE: reklaami mõiste ja reklaami psühholoogiline olemus; peamised psühholoogilised toimemehhanismid reklaamis; reklaami põhielemendid ja struktuur; mõjustamispsühholoogia alusmõisted ja põhimõtted; reklaami liigid ja nende spetsiifika."}, "objectives": [{"en": "The aim of this course is to teach basic knowledge of advertising psychology, present an introductory overview of the basic topics and concepts of advertising psychology and to help acquire the skills of analyzing advertising messages in the context of commercial advertising and propaganda.", "et": "Kursuse eesmärk on õpetada alusteadmisi reklaamipsühholoogiast, anda sissejuhatav ülevaade reklaamipsühholoogia põhiteemadest ja -mõistetest ning õpetada analüüsima reklaamsõnumit kommerts- ja propagandakeskkonnas."}], "learning_outcomes": [{"en": "Upon completion of this course students:\r", "et": "Kursuse läbinu:\r"}, {"en": "- know the position of advertising psychology among other social science disciplines and its role and capabilities in practical advertising\r", "et": "- teab reklaamipsühholoogia kohta teiste sotsiaalteaduste hulgas ning selle osa ja võimalusi praktilises reklaami- ja propagandategevuses\r"}, {"en": "- understand mechanisms and tricks of the trade in advertising\r", "et": "- saab aru reklaami kui protsessi mehhanismidest ja peamistest võtetest\r"}, {"en": "- know basic concepts of advertising and psychology of influence\r", "et": "- tunneb reklaamiala ja –psühholoogia baasmõisteid\r"}, {"en": "- command skills of independent analysis and understanding of real advertising messages, their principal structure and ways of influence; \r", "et": "- on iseseisvalt võimaline lahti mõtestama tegelike reklaamide ja propagandasõnumite psühholoogilist ülesehitust ja toimimismehhanisme;\r"}, {"en": "- carry out analysis of real advertising communications.", "et": "-  tegema tegelike reklaamisõnumite analüüsi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}