{"uuid": "7acb000d-94b2-ccae-030f-96c194f97dd8", "code": "SOPH.00.083", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Culture and Development", "et": "Kultuur ja areng"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course presents both, the cross-cultural and the historical approach, linking findings from cultural psychology to child development. Cross-cultural comparisons will be presented, including those involving Estonians participants.", "et": "Tutvustatakse kultuuriti võrdlevat ja ajaloolist lähenemist lapse arengule ja kultuuripsühholoogiat. Erilist tähelepanu pööratakse kultuurifaktorite osale arengus. Tuuakse näiteid kultuuriti võrdlevatest uurimustest, eriti neist, milles on osalenud eestlased."}, "objectives": [{"en": "The purpose of the course is to provide insight into the variety of  socio-cultural contexts in which child development occurs, and to promote their culture-sensitivity and tolerance for different ways of child-rearing.", "et": "Eesmärgiks on pöörata tudengite tähelepanu sellele, et lapse areng toimub erisugustes sotsiokultuurilistes kontekstides ja muuta neid kultuuritundlikumaks ning sallivamaks erinevate kasvatusviiside suhtes."}], "learning_outcomes": [{"en": "After completion the student:", "et": "Aine läbinud üliõpilane:"}, {"en": "- Knows the recent findings of cross- cultural research on child development and parenting;", "et": "- on kursis nende uurimistulemustega lapse arengu ja laste kasvatamise kohta, mida on saadud kultuuriti võrdlevate uuringutega;"}, {"en": "- Notices the cultural and contextual variety in child development", "et": "- märkab kultuurilist ja kontekstuaalset mitmekesisust lapse arengus; "}, {"en": "- Becomes a culture-sensitive psychologist, teacher or just person; ", "et": "- temast saab kultuuritundlikum psühholoog, õpetaja või üldse inimene;"}, {"en": "- Adapts culture-specific intervention, teaching, child-rearing or communicative practices ", "et": "- kasutab kultuuritundlikke sekkumis-, õpetamis, kasvatamis- ja suhtlusstateegiad;"}, {"en": "- Takes the context of child development into account when planning his/her own research.", "et": "- teadusliku uurimistöö kavandamisel peab silmas ka lapse arengu konteksti."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}