{"uuid": "1ea76ad4-bffe-1413-05e1-1c868cdd9ce8", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-11T09:06:51", "title": {"en": "Individual and the Organization", "et": "Inimene ja organisatsioon"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course gives a comprehensive overview of human behaviour in the organisational context. Attention will be paid to the connections between management theory and practice. Topics covered: Management theories and their evolution, leadership, developing organisations, overseeing changes, organisational culture, motivation, individual differences and groups in organisations.", "et": "Õppeaine annab tervikliku ülevaate inimkäitumisest organisatsioonis. Käsitletavad teemad: juhtimine ja eestvedamine; organisatsioonide arendamine, muudatuste juhtimine, organisatsioonikultuur, ja selle seos töötajate vaimse tervisega; töörahulolu ja motivatsiooni toetamine; individuaalsed erinevused ja rühmad organisatsioonis. Pöörame tähelepanu teooria ja juhtimispraktika seostele."}, "objectives": [{"en": "The course aims to provide an overview of human behaviour in the context of an organisation, help comprehend the impact of human behaviour upon the functioning and performance of the organisation as well as understand the influence that the organisation's internal and external environment has over human behaviour.", "et": "Õppeaine eesmärk on anda ülevaade inimkäitumisest organisatsioonis, mõtestada käitumise ja organisatsiooni tulemuslikkuse seosesid ning organisatsiooni sise- ja väliskeskkonna mõju käitumisele."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "Following a successful completion of this course, students should:\nKnowledge\nhave a systematic knowledge of the connections between human behaviour and organisation;\nbe familiar to the basic concepts and key areas of organisational psychology;\nhave the knowledge of the main principles and opportunities in applying organisational psychology.\nCritical thinking\nunderstand the impact of the organisation's internal and external environment upon the human behaviour in the organisation and have the ability to critically analyse this impact;\nbe able to critically analyse the principal texts and research results in organisational psychology;\nbe able to critically analyse problems and cases to do with human behaviour in the organisation, and provide solutions to these by drawing upon theoretical knowledge.\nPresentation\nbe able to present comprehensive knowledge of human behaviour in the organisational setting and prove its validity in both written and oral form.\nCollecting information\nbe able to find and make use of both written and digital information on issues relating to human behaviour in the organisation.\nApproaches and attitudes\nknow and follow the ethical principles of operating in the context of an organization whilst performing roles in management and management consultancy;\nshow a desire to critically analyse organisational goals and use the knowledge in psychology to achieve these.", "et": "Teadmised: süsteemsed teadmised inimkäitumise ja organisatsiooni seostest, sh organisatsioonipsühholoogia põhimõistetest ja olulisematest valdkondadest ning organisatsioonipsühholoogia rakendamisest.\nMõtlemisoskus: oskus kriitiliselt analüüsida organisatsioonipsühholoogia infoallikaid ja uurimistulemusi ning mitmekülgselt ja argumenteeritult analüüsida organisatsioonis toimuvaid käitumisega seotud olukordi ja leida neile lahendusi.\nVäljendusoskus: oskus suuliselt ja kirjalikult argumenteeritult käsitleda organisatsioonis toimuvat käitumist.\nInformatsiooni kogumise ja kasutamise oskus: oskus leida, analüüsida ja kasutada asjakohast informatsiooni käitumise kohta organisatsioonis.\nHoiakud:\nteadlikkus ja soov järgida eetilisi printsiipe organisatsioonides tegutsedes, sh täites juhtimisega seotud rolle;\nsoov kriitiliselt analüüsida organisatsiooni eesmärke ning eetiliselt kasutada psühholoogiaalaseid teadmisi organisatsiooni eesmärkide saavutamiseks."}], "notes": {"et": "Loenguteemade õppimiseks on soovitav kavandada kokku ~48 tundi iseseisvat tööd, st iga paarisloengu kohta 12 tundi. Seda aega tuleks kasutada teema läbimõtlemiseks loenguslaidide, õpikupeatükkide, teaduspõhiste muude allikate (artiklid, taskuhäälingud) ning ülevaadete abil. Seminaride ettevalmistamiseks, arutatu analüüsimiseks ja õppimise reflekteerimiseks võiks planeerida ~12 tundi. Allika ülevaatele on soovitav kavandada ~24 ja esseele ~40 tundi. Kontrolltööks võiks valmistuda ~8 tundi.\nKontaktõpe aitab kaasa õppimisele, kuid selles osalemine ei ole kohustuslik. Lisaks loengutele on aines kaks online veebiseminari. Seminarid toimuvad rühmades, kummalegi rühmale on üks kahetunnine ja üks neljatunnine seminar. Tutvu täpsemate õpijuhistega Moodles."}}, "grading": {"independent_work": {"et": "Hindamine koosneb kolmest osast - allika ülevaade, essee ja kontrolltöö. \nAllika ülevaate esitamistähtaeg on 18. märts 2025. Maksimaalne punktide arv 10, lõpphindamisele pääsemiseks vajalik minimaalne punktide arv on 6. Selle kirjutamiseks on soovitav kavandada 24 tundi. \nEssee esitamise tähtaeg on 29. aprill 2025. Maksimaalne punktide arv 30, lõpphindamisele pääsemiseks vajalik minimaalne punktide arv on 10. Selle kirjutamiseks on soovitav kavandada 40 tundi.\nKontrolltöö toimub Moodles mais ning selle tegemisel võib kasutada kõiki infoallikaid, välja arvatud teiste inimeste abi. Kontrollltööle pääsemiseks peab olema allika ülevaate tulemus vähemalt 6 ja essee tulemus vähemalt 10 punkti. Maksimaalne kontrolltöö punktide arv 60, lõpphindamisele pääsemiseks vajalik minimaalne punktide arv on 36. \nÜlevaade, essee ja kontrolltöö annavad kokku maksimaalselt 100 punkti. \nLõpphinnet on võimalik ühe astme (st C-st B-ks või B-st A-ks jne) võrra tõsta koostöist õppimist toetava osalemisega seminarides ja loengutel. Hinde tõstmiseks on vaja koguda vähemalt 10 osalemispunkti ning punkte ei summeerita lõpphindesse. 10 punkti annab ettekande tegemine seminaris. Ettekande tegemise õiguse saavad vaid parimate esseede autorid. Igas paarisloengus või (paaris)seminaril on võimalik saada 2,5 aktiivsuspunkti. Selleks tuleb seminaris või loengus mitmel korral argumenteeritult esitada oma arvamus, esitada küsimus või tuua näide viisil, mis võiks aidata teistel osalejatel õpieesmärke saavutada. "}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Allika ülevaate tähtaeg on 18. märts 2025. Kirjutamiseks on soovitav kavandada 24 tundi.\nAllika ülevaate eesmärk on saada põgus ülevaade asjakohastest allikatest, käsitletavatest teemadest ning pakkuda kiiret tagasisidet õpiväljundite saavutamisest. Suurepärane ülevaade on argumenteeritud, terviklik ja hästi kirjutatud käsitlus ühest raamatust või alternatiivina kolmest artiklist või taskuhäälingu saatest. Ülevaateks valige asjakohane, see tähendab aine teemadega seotud allikas. Artikleid ja taskuhäälingu saateid kasutage vaid juhul, kui teadmised organisatsioonikäitumises on juba vähemalt head. \nÜlevaade vastab järgmistele küsimustele: \nmillised on peamised käsitletavad teemad; \nmilles on autori vaatepunkti huvitavus/eripära/piiratus/originaalsus; \nmilline on teksti/info esitus; kas ja kellele seda soovitada. \nÜlevaade on kuni 500 sõna pikk. Töö esitage  pdf või word vormingus failina Moodles ning näidake selle pikkus sõnades ilma kasutatud allikateta ja esitage andmed allika kohta. \nAllika ülevaate maksimaalne tulemus on 10 punkti, kontrolltööle ja lõpphindamisele pääseb tulemusega vähemalt 6 punkti.\nHINDAMINE\n10 punkti - sama, mis 9 punkti ja käsitlus isikupärane, lähenemine loov.\n9 punkti - seisukoht selgelt esile toodud; arutluskäik loogiline, kuid mõnevõrra ühekülgne või vähe originaalne; tekst sobivalt struktureeritud, lähenemine terviklik.\n8 punkti - seisukoht arusaadavalt esitatud; arutluskäik mõnevõrra vastuoluline või pinnapealne või ühekülgne; tekst liigendatud, kuid struktureeritus ei ole optimaalne: mõni teksti osa põhjendamatult pikk või lühike või vähe seostatud teiste osadega.\n7 punkti - üldjoontes seisukoht esitatud, arutlus loogiline, kuid pinnapealne ja ühekülgne; tekst struktureeritud, kuid laialivalguv, mõni osa puudub.\n6 punkti - seisukoht esitamata; arutlus triviaalne ja vasturääkiv; teksti ülesehitus ei aita kaasa teema avamisele, mitmed osad puuduvad.\n5 või vähem punkti - kirjutatud on teemast mööda, kaitstavat seisukohta ei ole esitatud, argumente ei leidu, puudub selge mõte; tekst on struktureerimata."}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Essee tähtaeg on 29. aprill 2025. Kirjutamiseks on soovitav kavandada 40 tundi.\nEssee on subjektiivses laadis kunstipärane teadusliku ja ühiskondliku sisuga kirjutis, mis avab teema isikupäraselt, sügavalt, mitmekülgselt ja argumenteeritult. \nEssee kirjutatakse ühel järgmistest teemadest: \nA. Juhtimisalane probleem ja selle võimalik lahendus minu organisatsioonis; \nB. Organisatsiooni arendamise ja vaimse tervise seosed; \nC. Hea töö - kelle vastutus?; \nD. Geenius ja meeskond; \nE vabalt valitud teema, mis käsitleb inimese ja organisatsiooni seoseid.\nEssees on kuni 1300 sõna pikk. Töö esitage  pdf või word vormingus failina Moodles ning näidake selle pikkus sõnades ilma kasutatud kirjanduseta ja esitage andmed allikate kohta. \nHindamise tulemused avaldan Moodles hiljemalt järgmisel päeval pärast mõlema grupi teise seminari toimumist. Essee maksimaalne tulemus on 30 punkti, kontrolltööle ning lõpphindamisele pääseb tulemusega vähemalt 10 punkti.\nHINDAMINE\n30 punkti - sama mis 25 punkti, kuid arutluskäik ja allikate kasutamine ning näited selgelt isikupärased, teema avamine uuenduslik, lähenemine loov.\n25 punkti - teadmised ja arusaamine teemast väga head; seisukoht selgelt esile toodud; arutluskäik loogiline ja sügav, kuid mõnevõrra ühekülgne või triviaalne; allikate kasutamine mitmekülgne ja asjatundlik, näited asjakohased; tekst sobivalt struktureeritud, arutluskäik hästi jälgitav.\n20 punkti - teadmised ja arusaamine teemast head; seisukoht arusaadavalt esitatud; arutluskäik mõnevõrra vastuoluline või pinnapealne või ühekülgne; allikaid kasutatud asjakohaselt, kuid ebapiisavalt; näidete kasutamine asjakohane, kuid ebapiisav; tekst liigendatud, kuid struktureeritus ei ole optimaalne: mõni teksti osa põhjendamatult pikk või lühike või vähe seostatud teiste osadega, arutluskäik raskesti jälgitav.\n15 punkti - teadmised ja arusaamine teemast rahuldavad; üldjoontes seisukoht esitatud, arutlus loogiline, kuid pinnapealne ja ühekülgne; sobivaid allikaid vähe ning toodud näited ja kasutatud kirjandus ei ava teemat piisavalt argumenteeritult; tekst laialivalguv, sissejuhatuses väide esitamata, kokkuvõte puudub või toob sisse uusi teemasid; arutluskäik raskesti jälgitav.\n10 punkti - teadmised ja arusaamine teemast on nõrgad, seisukoht esitamata; arutlus triviaalne ja vasturääkiv; toodud näited ja kasutatud kirjandus ei aita oluliselt kaasa teema avamisele; teksti ülesehitus ei aita kaasa teema avamisele, arutluskäik ei ole jälgitav.\n5 punkti - kirjutatud on teemast mööda, kaitstavat seisukohta ei ole esitatud, argumente ei leidu, puudub selge mõte; sobivat kirjandust ei ole kasutatud, sobivaid näiteid ei ole toodud; tekst on struktureerimata.\nParimate esseede autorid saavad õiguse teha seminaris ettekanne. Ettekande tegemise ettepaneku esitatan hiljemalt viis tööpäeva enne seminari. Ettekanne on kuni 10 minutit pikk ning see tõstab teiste õppimist toetava osalemisega ettekandja koguhinnet ühe astme võrra."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö toimub 22. või 29. mail 2025 Moodles. Kontrolltöö maksimaalne tulemus on 60 punkti. Lõpphindamiseks on vaja saada vähemalt 36 punkti. \nKontrolltöö eesmärk on hinnata ja anda tagasisidet õpiväljundite saavutamise kohta. Kontrolltööd tehes võib kasutada kõiki digitaalseid ja paberkandjal infoallikaid, kuid ei tohi kasutada abi teistelt isikutelt (sh õpingukaaslased). Hindan teadmiste süsteemsust ja sügavust, sh arusaamist mõistestest; arusaamist organisatsiooni kontekstis toimuva käitumise mõjuritest ning käitumise mõjutamise viisidest ja nendevahelistest seostest; oskust kasutada omandatud teadmisi organisatsioonikäitumisega seotud hüpoteetilistes olukordades ja oskust oma seisukohti argumenteeritult ja selgelt esitada. Kontrolltöö koosneb kolmest osast: esimeses vastate valikvastustega testile (maksimaalselt 24 punkti), teises toote näite ja esitate küsimuse (kummagi eest maksimaalselt 9 punkti, kokku maksimaalselt 18 punkti), kolmandas osas lahendate juhtumi (maksimaalselt 18 punkti). Kontrolltöö ülesehitusega tutvume seminaris.\nHINDAMINE\n56 - 60 punkti - teadmised suurepärased, mõistete kasutus täpne; seisukohad väga hästi argumenteeritud, lahedused ja põhjendused uuenduslikud ja isikupärased.\n51 - 55 punkti - teadmised, mõistete kasutamine ja arusaamine teemast väga head; seisukohad ja lahendused arusaadavalt esitatud; põhjendused loogilised, mitmekülgsed ja veenvad.\n46 - 50 punkti - teadmised, mõistete kasutamine ja arusaamine teemast enamasti head; seisukohad ja lahendused arusaadavalt esitatud; põhjendused mõnevõrra vastuolulised või pinnapealsed või ühekülgsed.\n41 - 45 punkti - teadmised, mõistete kasutamine ja arusaamine teemast enamasti rahuldavad; üldjoontes seisukohad ja probleemide lahendused esitatud, kuid argumenteeritus vastuoluline, pinnapealne või ühekülgne.\n36 - 40 punkti - teadmised on ebapiisavad, mõistete kasutamisel puudujäägid; puudub sügavam arusaamine mõjuritest ja seostest; probleemide lahendused pinnapealsed, arvamused ei ole selgelt esitatud; lahendused ja arvamused ebapiisavalt põhjendatud.\nkuni 36 punkti - teadmistes suured puudujäägid, mõistete kasutamisel vead; puudub piisav arusaamine mõjuritest ja seostest; probleemide lahendused esitamata või ebapiisavalt argumenteeritud."}}], "min_points_from_tests": 52, "grade_preconditions": {"et": "Kontrolltööle pääsemise tingimused: allika ülevaade vähemalt 6 punkti (maksimaalne 10), essee vähemalt 10 punkti (maksimaalne 30) ning mõlemad tööd  on esitatud hiljemalt kaks nädalat enne kontrolltööd.\nMadalamate tulemustega tööde korral on võimalik esitada uus töö hiljemalt üks nädal enne kontrolltööd.\nKontrolltöö tulemus vähemalt 36 punkti (maksimaalne 60 punkti).\n"}, "grade_evaluation": {"et": "Lõpphinne kujuneb allika ülevaate, essee ja kontrolltöö eest saadud punktide summeerimisel. \nLisaks on võimalik lõpphinnet ühe astme võrra tõsta kaaslaste õppimist toetava osalemisega seminarides ja loengutel."}, "grade_conditions": {"A": {"et": "91 - 100 punkti"}, "B": {"et": "81 - 90 punkti"}, "C": {"et": "71 - 80 punkti"}, "D": {"et": "61 - 70 punkti"}, "E": {"et": "52 - 60 punkti"}, "F": {"et": "51 punkti või vähem"}, "mi": {"et": "Mitteilmumine tähendab kontrolltööle pääsemise tingimuste õigeaegset mittetäitmist või kontrolltööl mitteosalemist / kontrolltöö mitte tegemist. "}}, "debt_elimination": {"et": "Allika ülevaate (vähemalt 6 punkti) ja essee (vähemalt 10 punkti) esitamine hiljemalt üks nädal enne kontrolltööd. Madalamate punktidega tööde puhul on ühel korral võimalik esitada uus töö, samuti nädal enne (järel)kontrolltööd.  Kui kontrolltöö eest saadav punktide arv on madalam kui 36, siis saab ühel korral teha kontrolltöö uuesti."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Allika ülevaate tagasisidestan Moodles hiljemalt 8. aprillil; tähtajast hiljem esitatud töö hiljemalt üks nädal enne kontrolltööd.\nEssee tagasisidestan Moodles hiljemalt 9. mail; tähtajast hiljem esitatud töö hiljemalt üks nädal enne kontrolltööd.\nKontrolltöö tulemused teatan hiljemalt viis tööpäeva pärast kontrolltöö toimumist."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "a2d45364-0f7a-4ad0-8df7-c6daa5b9e645", "type": "MOODLE", "code": "SOPH.00.526", "base_url": "undefined", "linked_to_groups": ["07d302cc-3dcb-f454-362d-d166086db47a", "07d94cdb-619f-425b-3dce-4d9b851cd48b"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Loenguslaidid, asjakohane õpik, muud teaduspõhised allikad. Allikate valimisel tuleb olla kriitiline ja hinnata nende teaduspõhisust, põhjendatust, objektiivsust. Mõned soovitused teemakohastele allikatele on Moodles."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}]}, "participants": {"lecturers": [{"person_uuid": "2ead2061-1498-52b0-be0d-a3341779707d", "person_name": "Mari Nõmm", "structural_unit": {"code": "MVPT02", "name": {"en": "Department of Nursing Science", "et": "õendusteaduse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "MVPT"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm (SÕ)": {"code": "1", "et": "Lektor", "en": "lecturer"}, "1. rühm (PÕ)": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "assistants": ["eea04589-1011-6286-3c86-8f80e0a4b89b"], "study_groups": [{"uuid": "07d302cc-3dcb-f454-362d-d166086db47a", "code": "1. rühm (PÕ)", "max_size": 56}, {"uuid": "07d94cdb-619f-425b-3dce-4d9b851cd48b", "code": "2. rühm (SÕ)", "max_size": 45}]}, "schedule": {"weeks": {"et": "25, 27, 31, 32, 37, 38"}, "entries": [{"course_week": 25, "time": "2025-02-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Sissejuhatus ja põhimõisted. Juhi ülesanded ja rollid."}, "description": {}}, {"course_week": 25, "time": "2025-02-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Juhtimine ja eestvedamine. Juhtimismeetodid."}, "description": {}}, {"course_week": 27, "time": "2025-03-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Organisatsiooni ja töötajate arendamine"}, "description": {}}, {"course_week": 27, "time": "2025-03-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Muutmisprotsess. Positiivne organisatsioonikultuur"}, "description": {}}, {"course_week": 31, "time": "2025-04-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "Motivatsiooni toetamine"}, "description": {}}, {"course_week": 31, "time": "2025-04-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "Tasustamine"}, "description": {}}, {"course_week": 31, "time": "2025-04-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Tagasiside allika ülevaadetele. Juhtumite lahendamine. "}, "description": {"et": "Toimub Moodles BBB keskkonnas. Ei ole järelevaadatav"}, "study_group_codes": ["2. rühm (SÕ)"]}, {"course_week": 32, "time": "2025-04-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Tagasiside allika ülevaadetele. Juhtumite lahendamine. "}, "description": {"et": "Toimub Moodles BBB keskkonnas. Ei ole järelevaadatav"}, "study_group_codes": ["1. rühm (PÕ)"]}, {"course_week": 37, "time": "2025-05-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"et": "Individuaalsed omadused organisatsioonis"}, "description": {}}, {"course_week": 37, "time": "2025-05-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"et": "Rühmad, grupiprotsessid ja meeskonnatöö organisatsioonis"}, "description": {}}, {"course_week": 37, "time": "2025-05-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Tagasiside esseedele. Ettekanded ja arutelud esseede põhjal."}, "description": {"et": "Toimub Moodles BBB keskkonnas. Ei ole järelevaadatav"}, "study_group_codes": ["2. rühm (SÕ)"]}, {"course_week": 37, "time": "2025-05-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Arutelu. Juhtumite lahendamine. Kontrolltööks valmistumine. "}, "description": {"et": "Toimub Moodles BBB keskkonnas. Ei ole järelevaadatav"}, "study_group_codes": ["2. rühm (SÕ)"]}, {"course_week": 38, "time": "2025-05-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Tagasiside esseedele. Ettekanded ja arutelud esseede põhjal."}, "description": {"et": "Toimub Moodles BBB keskkonnas. Ei ole järelevaadatav"}, "study_group_codes": ["1. rühm (PÕ)"]}, {"course_week": 38, "time": "2025-05-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {"et": "Arutelu. Juhtumite lahendamine. Kontrolltööks valmistumine. "}, "description": {"et": "Toimub Moodles BBB keskkonnas. Ei ole järelevaadatav"}, "study_group_codes": ["1. rühm (PÕ)"]}, {"course_week": 38, "time": "2025-05-22", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {"et": "Kontrolltöö"}, "description": {"et": "Toimub Moodles"}}, {"course_week": 39, "time": "2025-05-29", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {"et": "Kontrolltöö"}, "description": {"et": "Toimub Moodles"}}]}, "registration_info": {"audience": {}, "max_students": 101}, "parent_uuid": "7f96f06c-81d3-e69b-2ab4-102e07e37937", "parent_code": "SOPH.00.526", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}