{"uuid": "0fb542ae-fe9a-046a-fafa-7618a61e32d8", "code": "SOPH.00.331", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research Seminar of Developmental and Cultural Psychology", "et": "Arengu- ja kultuuripsühholoogia teadusseminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is intended for all students examining the role of cultural factors in children's development and psychological adjustment. More attention is paid to the development of language, communication skills, self-concept, and value priorities. Other students interested in developmental and cultural psychology are also welcome. In seminars, we review newest literature on students'research topic, analyze problems arising in the research process, discuss the obtained results, and plan the next steps of the research. The seminar aims to open up a lively exchange of thoughts; an active participation is expected from the students. Different research methods in developmental and cultural psychology, and the analysis and the interpretation of the obtained results will be discussed. Newest articles published in the journals, such as Culture and Development, Child Development, Developmental Psychology, and International Journal of Behavioral Development, will be discussed.", "et": "Teadusseminar on mõeldud kõikide õppeastmete tudengitele, kelle uurimistöö käsitleb kultuurifaktorite osa lapse arengus ja psühholoogilises kohanemises. Teretulnud on ka teised arengu-ja kultuuripsühholoogiast huvitatud tudengid.Rohkem tähelepanu pööratakse kõne, suhtlusoskuste, enesekäsitluse ja  väärtuseelistuste arengule. Teadusseminaris käsitletakse üliõpilase uurimistöö teemaga seonduvat uuemat kirjandust, analüüsitakse uurimistöös ettetulevaid probleeme, arutletakse tulemuste üle ning planeeritakse uuringute edasisi etappe. Eesmärgiks on elav mõtte- vahetus seminari vormis, üliõpilastelt oodatakse kõrget osalusaktiivsust.  Vaatluse all on erinevad arengu- ja kultuuripsühholoogia uurimismeetodid ning tegeletakse konkreetsete uurimuste jaoks kogutud andmete analüüsi ja nende tulemuste tõlgendamisega. Arutletakse arengupsühholoogia  ajakirjade (Culture and Development, Child Development, Developmental Psychology, International Journal of  Behavioral Development jt.) viimastes numbrites avaldatud artiklite üle."}, "objectives": [{"en": "To provide insight into the research on child development.", "et": "Lapse arengu uurimisega tutvumine."}], "learning_outcomes": [{"en": "After completion of the course the student:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "-\tcan search, review, and analyze scientific literature from databases, has knowledge about classic and new research studies in developmental and cultural psychology", "et": "-\t oskab otsida, refereerida ja analüüsida erialast kirjandust andmebaasidest, on kursis valdkonna klassikaliste ja uuemate teadusuuringutega"}, {"en": "-\tcan give a clear and comprehensive overview of scientific results related to his or her research topic", "et": "-\t oskab selgelt ja ülevaatlikult tutvustada oma uurimisvaldkonnaga seotud uurimistulemusi"}, {"en": "-\tcan associate the newest science results of his or her research topic with previous theories and approaches", "et": "-\toskab oma uurimisvaldkonna uuemaid teadustulemusi seostada varasemate teooriate ja käsitlustega"}, {"en": "-\tcan conduct research on a current psychological problem", "et": "-\toskab paremini mingit aktuaalset psühholoogilist probleem uurida."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}