{"uuid": "f837f124-7ed9-03c2-67da-18d9833897e3", "code": "SOPH.00.391", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Career Counselling", "et": "Sissejuhatus karjäärinõustamisse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course gives an overview of career counselling including the main theoretical approaches in career counselling, information gathering, and decision making.\nThe laws and research relevant to career counselling is discussed. \nThe course supports the development of students' skills of information-gathering, self-analysis, and career planning. It also provides the basic skills required to work in the field of career guidance.", "et": "Kursus annab ülevaate karjääri planeerimise olemusest,  põhilistest karjäärinõustamise valdkonda kujundavatest teooriatest ja karjääriotsuste tegemise põhimõtetest. Lisaks tutvustatakse karjäärinõustamisega seotud seadusandlust ja valdkonnaspetsiifilisi uurimusi.\nKursuse läbimine õpetab otsima infot töömaailma kohta, toetab eneseanalüüsi ja karjääri kujundamise oskuste arengut ning annab esmased oskused karjääriplaneerimise valdkonnas tegutsemiseks."}, "objectives": [{"en": "To provide an overview of career counselling and thus prepare people for work in the field of career counselling (career counseling, school psychology, education, social work).", "et": "Kursuse eesmärgiks on anda ülevaade karjäärinõustamise põhiolemusest ja seeläbi valmistada inimesi ette tööks karjääriplaneerimise valdkonnas (kajräärinõustamine, koolipsühholoogia, pedagoogika, sotsiaaltöö)."}], "learning_outcomes": [{"en": "After completing the course the student:", "et": "Kursuse läbimise järgselt õppija:"}, {"en": "Is familiar with career-counsellors' field of work and knows the job-opportunities in the field. ", "et": "Tunneb  karjäärinõustaja töövaldkonda ning võimalusi seal töötamiseks;"}, {"en": "Applies the knowledge about career-counselling theories, career counselling system, laws, and scientific research to analyse the need for counselling;", "et": "Rakendab kursuse käigus omandatud teadmisi teooratest, karjäärinõustamise süsteemi ülesehitusest, õigust loovatest aktidest ja teadusuuringutest nõustamisvajaduse analüüsimisel; "}, {"en": "Formulates the preliminary counselling hypothesis;", "et": "Püstitab esmase nõustamishüpoteesi;"}, {"en": "Puts together a preliminary action plan for career planning.", "et": "Koostab esmase karjääriplaneermise tegevuskava."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}