{"uuid": "ddf76fd4-51ce-db0b-8812-0d9a918b9a95", "code": "sv-2018-autumn-fulltime-c6-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2023-12-21T16:34:08", "title": {"en": "Theories of European Integration", "et": "Euroopa integratsiooni teooriad"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "18/19 A regular SV Eng", "et": "18/19 S PÕ SV Eng"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 18, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course provides a critical overview of the main theoretical approaches to the European Union and the process of European integration, with an emphasis on contemporary political science theories. The EU has been widely regarded as a social science puzzle because it does not fit neatly into existing conceptual categories and disciplinary divisions. Scholars disagree about whether theories located in the International Relations or Comparative Politics discourses are better equipped to explain European integration; these tensions are also reflected in the rivalry between intergovernmentalist approaches and theories of supranational governance. In addition to these, the course covers a variety of other approaches from the three pre-theories (federalism, functionalism, and transactionalism) to neofunctionalism, the debate between liberal intergovernmentalism and supranationalism, neoinstitutionalism, constructivism and theories of Europeanization. Our discussion of the theories of integration focuses on four central questions:\n1.\tWhat is the EU (an international organization, a technocratic regime, a form of intergovernmental cooperation, a supranational state-like entity, a federation)?\n2.\tHow does integration proceed and who or what drives integration (member-state governments, supranational institutions, interest groups, etc)?\n3.\tWhat patterns of interaction and influence characterize the relationship between the EU and the member states?\n4.\tHow will the EU continue to evolve in the future and what does the European experience tell us about regional integration and supranational governance in general?\n\nIn terms of teaching and learning formats, the course emphasizes academic writing and is designed to prepare students for writing an MA thesis (especially the theoretical sections of the thesis).", "et": "Kursus annab ülevaate peamistest teoreetilistest lähenemistest Euroopa Liidule ja eurointegratsioonile rõhuasetusega tänapäevastel politoloogilistel käsitlustel. \nEuroopa Liitu on nimetatud sotsiaalteaduste suureks mõistatuseks, kuna ta ei sobitu selgepiiriliselt  olemasolevatesse kontseptuaalsetesse kategooriatesse. EL asub rahvusvaheliste suhete ja võrdleva politoloogia ristumispunktis, kus omavahel võistlevad valitsustevaheline lähenemine (intergovernmentalism) ja rahvusülese valitsemise teooriad (supranational governance). Lisaks eelmainitutele leiavad kursuse raames käsitlemist mitmed teised suunitlused, alates funktsionalismist kuni ratsionaalse valiku, kahetasandiliste mängude, mitmetasandilise valitsemise ning konstruktivistlike teooriateni. Kursus\nkeskendub kolmele põhilisele küsimusele:\n1) Mis on Euroopa Liit (rahvusvaheline organisatsioon, tehnokraatlik režiim, valitsustevahelise koostöö vorm, rahvusülene riigilaadne süsteem, föderatsioon, jne)?\n2) Kuidas toimub Euroopa integratsioon ning kes või mis on integratsiooni mootoriks (liikmesriikide valitsused, rahvusülesed institutsioonid, jne)?\n3) Millises suunas Euroopa Liit areneb ning mida võime Euroopa näite varal järeldada regionaalse integratsiooni ja/või globaalse valitsemise kohta laiemalt?"}, "objectives": [{"en": "The overarching objective of the course is to offer a comprehensive overview of the main theoretical approaches to the European Union and the process of regional integration. A critical engagement with the ideas, concepts, and theories that have been developed to describe and explain far-reaching regional integration in Europe enables us to gain a deeper understanding of what the European Union is, how it works, how it came about, and how it might develop in the future. Studying theories of European integration also makes us better equipped to answer the question of whether and how comparable levels of regional integration could be reached in other parts of the world.", "et": "Kursuse eesmärk on anda ülevaade peamistest teoreetilistest lähenemistest Euroopa Liidule ja eurointegratsioonile."}], "learning_outcomes": [{"en": "Upon completing the course, the students should be able to:\n1) explain why we need theories in social science research and explicate how theories can and should be assessed;\n2) describe, compare,  contrast, and critically assess the main theoretical approaches to European integration; \n3) be familiar with the historical context in which these theories arose;\n4) apply these approaches to concrete cases, problems and developments in European integration;\n5) locate and use a wide variety of sources on the EU and the process of integration;\n6) write a research paper that conforms to graduate-level standards in terms of the soundness of research design and quality of academic writing.  \n7) demonstrate greater competence across a range of general skills, including critical thinking, abstract reasoning, making and defending an argument, as well as clarity of writing and speaking.", "et": "Olles kursuse läbinud, peaksid osalejad: \n1)\toskama kirjeldada, võrrelda ja arvustada peamisi teoreetilisi lähenemisi Euroopa integratsiooni uurimisel;  \n2)\trakendada integratsiooniteooriaid EL poliitika ja valitsemisega seonduvate aktuaalsete küsimuste ja arengute analüüsimisel; \n3)\tomama põhjalikku ülevaadet erinevatest allikatest, kust saab teavet Euroopa integratsiooni kohta ning omama praktilist kogemust nende allikate kasutamisel; \n4)\tteadma, kuidas kirjutada magistriõppe nõuetele vastavat uurimistööd."}], "notes": {}}, "grading": {"independent_work": {"et": "Three short writing assignments: Students are required to write three very short papers (1000-1200 words or about 2 pages each, font 11, Times New Roman) for selected seminars. The papers serve two objectives: a) they help ensure everyone is prepared for the seminar discussions and b) they help you practice specific writing and research skills, such as effective paragraph-level writing, summarizing a (set of) research article(s), characterizing a body of literature, and connecting theory and case by spelling out the observable implications of the theory. Detailed instructions -- see syllabus.\n\nResearch proposal: Students are required to write a research proposal that discusses/interprets a concrete event, case, development or puzzle in European integration in light of one or several theoretical approaches covered in the framework of this course. Note that a research proposal is a carefully designed, elaborate PLAN for conducting a theoretically-informed empirical investigation. In other words, you do not have to do any actual empirical analysis (collecting or analyzing data) for this assignment, nor are you expected to provide an answer to the research question you pose. However, the project that you propose should be realistic and in principle, doable. Detailed written guidelines for preparing the research proposal will be distributed in class and posted on ÕIS. Late papers will lose 1.5 points per day (out of a maximum of 35 points). Format: Times New Roman, font 12, spacing 1.5; suggested length: 8-10 pages (including a list of sources)."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "due_date": "2018-09-27", "description": {"et": "Writing assignment 1 (5% of the grade): Write a short paper (2 pages) that  makes three important points about neofunctionalism. The paper should consists of three excellent paragraphs (that follow the rules of paragraph writing introduced in class). Bring the paper to class on September 27. The assignment is designed to help you practice paragraph-level writing as well as the art of characterizing a body of literature."}}, {"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "due_date": "2018-10-25", "description": {"et": "Participation in a debate (5% of the grade). There will be a debate focusing on the question \"Do member state governments control the process of European integration?\" Group A will defend the position that they do, while Group B will argue that they do not. Members of each group have to work together before the debate to prepare their positions. During the debate, each group will advance its arguments and defend its positions. \nThe format of the debate is as follows:\nEach group will choose a proposer, a seconder, and someone to make a concluding statement.\nThe debate will begin with a proposing statement (10 minutes) and seconding statement (5 minutes) by Group A, followed by similar statements by Group B. This will be followed by a 'plenary' debate open to all members of the groups (35 minutes). After this, the groups will have 15 minutes to prepare their concluding statements. The debate ends with both groups presenting their concluding statements (a 10 minutes). Note that the concluding statements must be based on points made during the debate and should not be pre-prepared.\nStudents are expected to prepare their group positions in advance and defend these during the debate. Each group will be assessed based on the quality of the arguments (logic, evidence, factual accuracy), the effectiveness of presentation, and ability to rebut claims of opponents. Points will awarded to groups which will then decide how these will be allocated among members."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "due_date": "2018-11-08", "description": {"et": "Writing assignment 2 (5% of the grade): Practice applying a theory to a case by first providing a succint summary of how rationalism and constructivism explain the decision to enlarge, followed by a (bullet-pointed) list of the observable implications of each theoretical approach (max 2 pages) for this particular case. In other words, what should we be able to observe if the LI, SG or constructivist account of EU enlargement is accurate? Bring the paper to class and hand it in."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "due_date": "2018-11-22", "description": {"et": "Writing assignment 3 (5% of the grade) Find an academic article that uses the framework of Europeanization to analyze a particular policy area in (a) particular country/countries. Write a 1-2 page summary of the article, using the template provided (theory/data/case/method/results/ assessment). Bring your summary to class. The assignment, together with the seminar discussion, allows you to hone the skill of summarizing and reviewing a body of empirical research"}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "due_date": "2018-11-29", "description": {"et": "Submit a 1-2 page initial outline of your research proposal (in class). Describe your idea: what theory do you plan to use, what is the case that you apply it to? The outline will not be graded but I will provide feedback on your idea."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "due_date": "2018-12-20", "description": {"et": "The final exam will be held on December 20. It is closed-book written exam lasting up to 2 hours. The exam includes both short-answer questions (definitions, identification questions) as well as questions that require a longer answer in which you synthesize and assess material covered in the course. The exam focuses on the theories of integration as well as the historical context in which these theories arose. A study guide will be provided. The exam gives a maximum of 45 points (45% of the course grade)"}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "due_date": "2019-01-14", "description": {"et": "Research proposal: Students are required to write a research proposal that discusses/interprets a concrete event, case, development or puzzle in European integration in light of one or several theoretical approaches covered in the framework of this course. Note that a research proposal is a carefully designed, elaborate PLAN for conducting a theoretically-informed empirical investigation. In other words, you do not have to do any actual empirical analysis (collecting or analyzing data) for this assignment, nor are you expected to provide an answer to the research question you pose. However, the project that you propose should be realistic and in principle, doable. Detailed written guidelines for preparing the research proposal will be distributed in class and posted on ÕIS. Late papers will lose 1.5 points per day (out of a maximum of 35 points). Format: Times New Roman, font 12, spacing 1.5; suggested length: 8-10 pages (including a list of sources)."}}], "grade_preconditions": {"et": "The final grade for the course consists of the following components: \n- Contribution to the Debate (5% of the grade)\n- Three short writing assignments (each worth 5% of the grade, total 15 %) \t\t\t\n- Final exam (45%)\t\t\t\t\n- Research proposal (35%)"}, "grade_evaluation": {"et": "The final grade for the course consists of the following components: \n- Contribution to the Debate (5% of the grade)\n- Three short writing assignments (each worth 5% of the grade, total 15 %) \t\t\t\n- Final exam (45%)\t\t\t\t\n- Research proposal (35%)"}, "debt_elimination": {"et": "Exam times are fixed. Make-ups are scheduled only in extraordinary, documented circumstances (e.g. serious illness).\nResearch proposals are accepted after the deadline but will lose 1.5 points per day (out of a maximum of 35 points)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "9349c591-e70e-4c62-8517-908af8fffea3", "type": "MOODLE", "code": "SORG.04.019_Eng", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "See course schedule for a complete list of assigned readings.", "recommended_materials": "The following books offer an overview of theories of European integration: \n*\tBen Rosamond, Theories of European Integration, Basingstoke: Palgrave Macmillan, 2006.\n*\tSabine Saurugger, Theoretical Approaches to European Integration, Basingstoke: Palgrave Macmillan, 2014.\n*\tMette Eilstrup Sangiovanni, Debates in European Integration, Basingstoke: Palgrave Macmillan, 2006.\n*\tAntje Wiener and Thomas Diez, European Integration Theory, Oxford: Oxford University Press, 2004. \n*\tBrent F. Nelsen and Alexander Stubb, The European Union: Readings on the Theory and Practice of European Integration, Basingstoke: Palgrave Macmillan, 2003.\nRecent, recommended textbooks on the European Union include:\n*\tJohn McCormick and Jonathan Olsen, The European Union: Politics and Policies, Boulder, CO: Westview Press, 2014.\n*\tJohn McCormick, European Union Politics, Basingstoke: Palgrave Macmillan, 2011.\n*\tDesmond Dinan, Origins and Evolution of the European Union, Oxford: Oxford University Press, 2014.\n*\tMichelle Cini and Nieves Perez-Solorzano Borragan, European Union Politics, Oxford: Oxford University Press, 2013.\n*\tErik Jones, Anand Menon, Stephen Weatherill, The Oxford Handbook of the European Union, Oxford: Oxford University Press, 2012.\n*\tNeill Nugent, The Government and Politics of the European Union, 7th edition, Basingstoke: Palgrave Macmillan, 2010.\n*\tLaurie Buonanno and Neill Nugent, Policies and Policy Processes of the European Union, Basingstoke: Palgrave Macmillan, 2013. \n*\tSimon Bulmer and Christian Lequesne, The Member States of the European Union, Oxford: Oxford University Press, 2013.\n*\tDesmond Dinan, Europe Recast: A History of European Union. Basingstoke: Palgrave Macmillan, 2014."}, "participants": {"lecturers": [{"person_uuid": "5d6b24c8-186b-eeb4-3a9f-e59baf708b1d", "person_name": "Piret Ehin", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2018-09-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>Introduction. </b>\nIntroduction, aims and organization of the course. \nWhat is a theory, why do theories matter and what criteria should we apply when assessing theories? \nRequired reading:.\n-    Course syllabus    \n-   Ben Rosamond, \"Introduction\", in Theories of European Integration, pp.1-19.    \n- J.Goes and M. Simon, Standards for Evaluating A Theory.    \nSLIDES:\n\n."}}, {"time": "2018-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b> Key debates in theories of European integration. A roadmap for the course</b>\nWhat kind of animal is the EU? How did it evolve? Which theories and debates will be covered in this course, and is there method to the madness (how can one make sense of all these \"-isms\"?)?. Three big debates: IR vs CP; rationalism vs constructivism; MS governments vs supranational institutions. \nRequired reading:\n- McCormick (2011), Ch 1     \n- McCormick (2011), Ch 2   \n- Pollack, Mark A. \"Theorizing the European Union: international organization, domestic polity, or experiment in new governance?\" Annual Review of Political Science. 2005, Vol. 8 Issue 1, p357-398.\n- President Juncker's State of the Union speech (will be delivered on September 12, 2018) \n  \nLECTURE SLIDES:  \n."}}, {"time": "2018-09-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b> The structure of the post-WWII academic debate: federalism, functionalism, transactionalism </b>\nWhat are the main claims and assumptions underlying each of the so-called pre-theories of integration? What do they have in common, and where do the three diverge? To what extent are the pre-theories political programmes as opposed to academic theories? What developments on the ground are consistent with each approach? \nRequired reading:.\n-\tMcCormick, (2011) ch 4.   \n- Eilstrup Sangiovanni, pp. 17-36.    \n- the Schuman Declaration 1950    \nRequired video:\n-\t\"The Changed Face of Europe - The Big Picture\" focusing on political and economic realities and dilemmas in post-war Europe,  (29 min),    \nRecommended reading:\n-\tSergio Pistone, \"Altiero Spinelli and the Strategy for the United States of Europe\", in Nelsen and Stubb, pp. 85 - 92. (see link below)\n-\tDavid Mitrany, \"A Working Peace System\", in Nelsen and Stubb, pp. 93-113. (see link below)\n-\tKarl Deutsch et al., \"Political Community in the North Atlantic Area\", in Nelsen and Stubb, pp. 115 -137. (see link below)\n \nHANDOUT: . \nSLIDES \n."}}, {"time": "2018-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Seminar: Neofunctionalism vs intergovernmentalism</b>\nWhat does the theory of NF argue, and how does it differ from functionalism? What is spillover and why does it occur? Describe, compare and contrast NF and early intergovernmentalism: what are the questions they are asking, how are they trying to answer these, and who do they consider to be the main players? Why was NF declared obsolete in the mid-1970s?\nReadings and videos: see Moodle.\n<b>Writing assignment 1 DUE! </b> See Moodle.  \n."}}, {"time": "2018-10-04", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>Liberal Intergovernmentalism</b>\nAfter decades of limited progress and \"eurosclerosis,\" the project of European integration acquired new momentum under Commission President Jacques Delors and with the conclusion of the Singe European Act (1986). This prompted new theorizing about European integration. Why do sovereign states voluntarily pool sovereignty in supranational institutions? Do they retain control over the process of integration? The explanation provided by Andrew Moravcsik in his seminal book (1998) became a focal point for these debates. What are Moravcsik's main arguments? What is \"liberal\" about LI? What are the three stages of his \"tripartite analytical framework\"? What happens at each stage? How does LI explain the emergence and considerable powers of supranational institutions? \nReadings and videos: see Moodle.\n.\n."}}, {"time": "2018-10-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>Supranational governance</b>\nMoravcsik had many critics. Most prominent among those were the representatives of the supranational governance approach. They argued that major policy reforms in EC/EU were initiated and led by supranational institutions (mostly the Commission acting in tandem with the Court) who responded to societal need for European-level rules and regulation. This approach pays great attention to market liberalization that occurred after the adoption of the Single European Act: in a number of policy domains, such as telecommunications, air transportation, postal and broadcasting services, etc, powerful national monopolies were dismantled and markets were opened up to competition. Market liberalization/de-regulation has been followed by re-regulation at the European level.The creation of supranational policy regimes has, in turn, strengthened the EU's supranational actors who have become managers and guardians of the new order. Please consider: what advantages do supranational actors have over governments? Can you trace continuities from earlier approaches (especially transactionalism and neofunctionalism)? Why is supranational governance sometimes referred to as neo-neofunctionalism? What are the main points of contestation between SG and LI? What are the limitations of this debate?\nRequired and recommended reading: see Moodle.\n."}}, {"time": "2018-10-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Neoinstitutionalism</b>\nIn what ways do \"institutions matter\"? How does new institutionalism differ from old institutionalism and what are its main tenets? Note that there are three strands of neoinstitutionalism. What are they and how do they differ from one another?\nRequired readings: see Moodle\n."}}, {"time": "2018-10-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>Debate: Do member state governments control the process of European integration?</b>\nGroup A will defend the position that they do, while Group B will argue that they do not. Members of each group have to work together before the debate to prepare their positions. During the debate, each group will advance its arguments and defend its positions. The format of the debate is as follows:\nEach group will choose a proposer, a seconder, and someone to make a concluding statement. The debate will begin with a proposing statement (10 minutes) and seconding statement (5 minutes) by Group A, followed by similar statements by Group B. This will be followed by a 'plenary' debate open to all members of the groups (35 minutes). After this, the groups will have 15 minutes to prepare their concluding statements. The debate ends with both groups presenting their concluding statements (a 10 minutes). Note that the concluding statements must be based on points made during the debate and should not be pre-prepared. No prescribed literature for the debate, you are free to rely on whatever sources you deem relevant.\nDetailed guidelines: see Moodle.\n."}}, {"time": "2018-11-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>Social constructivism</b>\nWhat are the main assumptions and arguments associated with the constructivist approach in international relations? How, and with what effects, have these been applied to the EU? Constructivism emphasizes the role of identities and ideas. What does this contribute to our understanding of the EU? \nRequired readings: see Moodle.\n."}}, {"time": "2018-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b> Seminar: Explaining the decision to enlarge</b> \nWhich theoretical approach - rationalism or constructivism -- can best explain the EU's decision to admit 10 new countries in 2004? \n<b>Writing assignment 2 DUE!</b> :  Practice applying a theory to a case by writing a short paper (max 2 pages) that first provides a succinct summary of how rationalism and constructivism explain the decision to enlarge, followed by a (bullet-pointed) list of the observable implications of each theoretical approach for this particular case. Observable implications are things we would expect to observe in the real world if our theory is right. In other words, what should we be able to observe if the rationalist/ constructivist account of EU enlargement were accurate? Bring the paper to class and hand it in. Keep following the rules of paragraph-level writing that we practiced earlier. Note that the focus of this assignment is on why the EU was willing to enlarge (take in relatively poor Eastern European countries), as opposed to why the candidate countries wanted to join (or any other aspect of enlargement). Keep this focus, do not veer off course. The required texts for the assignment are listed below. You are free to use additional sources, if you want (but don't have to). When thinking about observable implications, it is probably best to rely on your own brain (as opposed to the internet). After you have read the texts below, set them aside, and think (i.e. ask yourself: what kind of evidence would lend support to the rationalist/constructivist explanation of why the EU decided to enlarge?)\n\nFormat of the seminar: discussion in groups, focusing on the question provided above, followed by a brief presentation by each group.\nRequired reading: see Moodle.\n.\n."}}, {"time": "2018-11-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>Theories of Europeanisation</b>\nHow does the EU influence the member states? What kind of changes at the national and subnational level occur because of EU membership? What are the main research questions posed by the Europeanization literature? What answers does it provide? Why is it often claimed that Europeanization is not a theory but an analytical framework? What is meant by uploading and downloading? What is \"goodness of fit\" and why does it matter?\nRequired readings: see Moodle.\n."}}, {"time": "2018-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b>Seminar: Examples of Europeanization research</b>\n<b>Writing assignment 3 DUE! \nDetails: see Moodle.\n."}}, {"time": "2018-11-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b>The comparative and governance turns in EU studies: the EU as a (federal) political system and as a system of multi-level governance </b>\n<b>BRIEF OUTLINE OF RESEARCH PROPOSAL (2 PAGES) DUE! </b>\nHas the EU become integrated to the extent that it can now be considered a normal polity and compared to other federal states? Can we apply regular comparative politics theories to the EU and what do we gain by doing so? What is the value of studying the EU through the lens of the governance approach?  Is politicization the right cure for the EU? Why/why not? \nRequired readings: see Moodle.\n."}}, {"time": "2018-12-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "<b> New and emerging approaches in European integration studies </b>\nHave the multiple crises in the EU stimulated new thinking and new approaches to grand and middle-ranged theory? What critical perspectives are out there, and how seriously should we take their arguments? Finally, we could we learn from scholars working on the margins or outside of the theoretical mainstream?\nRequired readings: see Moodle.\n."}}, {"time": "2018-12-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "<b> Regional integration in a comparative perspective. Summary assessment & concluding remarks. Preparation for the final exam. </b>\nWhat is the state of other regional integration projects around the world? How are these similar to and different from the European one? What factors account for this such variation? Can we use the same theories and methods to study regional integration in different parts of the world? Should we expect to see more or less regional integration in the future? What have we learned from theories of integration? What have these omitted; what new approaches are out there?\nRequired readings: see Moodle.\n."}}, {"time": "2018-12-20", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Final exam. </b>\nA two-hour written exam. A study guide will be provided."}}]}, "registration_info": {"audience": {"et": "MA students enrolled in the International Relations and Regional Studies, Democracy and Governance, Baltic Sea Region Studies and EU-Russia Studies MA programmes. Other MA students welcome, space permitting."}, "min_students": 10, "max_students": 50}, "parent_uuid": "61ce76c8-9214-c28c-a647-040048806be3", "parent_code": "SORG.04.019", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}