{"uuid": "edb9ea27-5359-c4e3-b8a6-41afaae5fa7f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-04T11:49:02", "title": {"en": "Bachelor's Thesis", "et": "Bakalaureusetöö"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 156, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "92a6b698-c360-e3b3-2c3b-4e4a453bcda0", "code": "SORG.00.001", "title": {"en": "Basics of Academic Research", "et": "Teadustöö alused"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "A Bachelor's thesis is a final stage to complete 3 years long bachelor's studies. Upon completion of the curriculum students is graduated with the Baccalaureus Artium degree.\n\nA thesis is an independently composed research paper in accordance with this guide with a clear problem statement where scientific methods are applied to a concrete object of research. The general goals of a thesis are to investigate an issue or problem concerning the specialty in depth, to collect original empirical material or data and to analyse this in light of the corresponding conceptual or theoretical framework, providing the research results as clear and reasoned conclusions. A thesis shows the student's theoretical and/or practical knowledge and skills in using literature of the field, substantiating their arguments and expressing them in written form. A thesis is not a reference of existing research or an essay on personal observations and evaluations. A thesis could be either theoretically or practically oriented and must contain a theoretical component. It is also advisable to include an empirical component.\n\nThe thesis defence procedure is Pursuant to the Guidelines for submission and defending of the final thesis, adopted by the Johan Skytte Institute of Political Studies.", "et": "Bakalaureusetöö kaitsmisega lõpeb 3-aastane põhi- ehk bakalaureuseõpe. Riigiteaduste bakalaureuseõppe lõpetanu saab bakalaureuse akadeemilise kraadi Baccalaureus Artium. \n\nBakalaureusetöö on kirjalike tööde koostamise ja vormistamise juhendi nõuetele vastav iseseisvalt koostatud uurimistöö, mis näitab üliõpilase teoreetilisi ning praktilisi teadmisi, oskust kasutada erialakirjandust, koguda uut empiirilist materjali või andmeid, analüüsida andmeid asjakohasest teoreetilisest või kontseptuaalsele raamistikust lähtuvalt, põhjendada oma seisukohti ja väljendada neid kirjalikult. Bakalaureusetöö on selge probleemipüstitusega analüüsiv uurimus, kus rakendatakse teaduslikke meetodeid konkreetse uurimisobjekti käsitlemiseks. Bakalaureusetöö ei ole teiste autorite seisukohtade refereering ega isiklikel tähelepanekutel ja hinnangutel põhinev essee. Bakalaureusetöö võib olla nii teadusliku kui rakendusliku suunaga ning peab sisaldama teoreetilist ja soovituslikult ka empiirilist komponenti. \n\nBakalaureusetöö kaitsmise protseduur on sätestatud Johan Skytte poliitikauuringute instituudi lõputöö, kaitsmiskomisjoni koosseisu moodustamise ja retsensendi määramise ning kaitsmise ja korduskaitsmise korras."}, "objectives": [{"en": "The aim of the course is to provide knowledge in a specific political science research field of how to use social science methodology and research skills, find, use and analyse disciplinary texts, compare various points of views, opinions and methods and, as a result, write a comprehensive research paper.", "et": "Aine eesmärk on õpetada uurima aktuaalset riigiteadustega seotud probleemi, selleks kasutama riigiteaduste uurimis- ja analüüsimeetodeid, otsima, refereerima ja analüüsima erialast kirjandust, võrdlema seal leiduvaid seisukohti, uurimistulemusi ja kasutatud meetodeid ning selle tulemusena kirjutama sisukalt ja kokkuvõtvalt  uurimistöö käsitletud probleemist."}], "learning_outcomes": [{"en": "A student who has defended a Bachelor's thesis: \n- establishes research questions independently and select suitable theoretical treatments and methods for their analysis;\n- structures research logically and purposefully; \n- independently finds and uses suitable empirical and theoretical sources; \n- argues and justifies their standpoints understandably and logically; \n- uses terms, data and facts correctly and knows the rules of formalising research work; \n- bases their conclusions on analysis and summarises in conformity with the line of thought of the thesis; and \n- can explain and defend the results of their research in academic discussion and answer questions related to their research.", "et": "Bakalaureusetöö kaitsnud üliõpilane:\n- püstitab uurimisküsimusi ning valib nende uurimiseks sobivaid teoreetilisi käsitlusi ja metoodikaid;\n- struktureerib tööd loogiliselt ja otstarbekalt;\n- kasutab korrektseid termineid, andmeid ja fakte ning tunneb uurimistöö vormistuse reegleid;\n- argumenteerib ning põhjendab oma seisukohti arusaadavalt ja loogiliseltning, toetab neid sobivate allikatega;\n- kasutab arvandmeid ning neid tõlgendab;\n- tugineb oma järeldustes analüüsile ning teeb kokkuvõtteid, mis on kooskõlas töö eelneva arutluskäiguga;\n- kasutab akadeemilisi ja mitte-akadeemilisi allikaid;\n- vormistab töö korrektselt s.h. kasutab nii stiililiselt kui grammatiliselt korrektset keelt, vormistada viited ning kasutatud allikad järgides ühtset stiili ning akadeemilise viitamise tavasid;\n- oskab selgitada ja kaitsta oma uurimistöö tulemusi akadeemilises diskussioonis ning vastata uurimistööga seotud küsimustele."}], "notes": {"et": "Komisjoni otsust on võimalik vaidlustada TÜ õppekorralduseeskirjas ette nähtud korras."}}, "grading": {"independent_work": {"et": "Bakalaureusetöö kirjutamine ja edukas kaitsmine lähtuvalt lõputööle esitatavatest Johan Skytte poliitikauuringute instituudi poolt ette nähtud nõuetest (vt Kirjalike tööde kirjutamise ja vormistamise juhend)."}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "due_date": "2025-06-02", "description": {"et": "Lõputöö hindamisel võetakse aluseks järgmised kriteeriumid: \n\n* Uurimistöö disain ja teooria (30%): a) Uurimisküsimus(ed) ja uurimisprobleem, b) Teoreetiline kirjandus, c) Teoreetiline argumentatsioon, d) Kontseptualiseerimine ja operatsionaliseerimine, e) Uurimismeetod, f) Teoreetilise raamistiku rakendamine\n* Empiiriline analüüs (30%): a) Andmete kasutamine, b) Andmete kogumine, c)  Analüüsi tulemused ja järeldused, d) Kriitilisus allikate ja töö piirangute suhtes, e) Argumentatsioon, f) Uued teadmised\n* Uurimistöö ülesehitus (20%): a) Uurimuse loogilisus, b) Uurimuse sidusus, c) Arutluskäigu loogilisus ja sidusus\n* Tehnilised nõuded (20%): a) Keelekasutus, õigekiri , b) Töö pikkus ja muud tehnilised nõuded, c) Viitamine\n\nHindamine on eristav TÜ-s kehtiva hindamisskaala järgi (\"suurepärane\" - A, \"väga hea\" - B, \"hea\" - C, \"rahuldav\" - D, \"kasin\" - E, \"puudulik\" - F)."}}], "grade_preconditions": {"et": "Õppekava on täidetud. Kaitsmisele pääsemiseks peavad olema kõik tulemused ÕIS-is hiljemalt 28.05.2025."}, "grade_evaluation": {"et": "Lõputöö hindamisel võtab komisjon arvesse:\n* töö sisu ja vormistust;\n* üliõpilase esinemist kaitsmisel (ettekande sisu ja selle esitamist, küsimustele vastamist);\n* retsensiooni ja juhendaja arvamust.\n\nPärast bakalaureusetöö kaitsmist otsustab komisjon kinnisel arutelul, kas anda kraaditaotlejale Sotsiaalteaduse bakalaureuse kraad ja millist hinnet kraaditaotleja teadmised väärivad. Retsensendi ja juhendaja arvamus ei ole komisjoni jaoks siduv."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "1a225f08-5974-10f7-ef3a-114e3110eaef", "person_name": "Alar Kilp", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"time": "2025-05-19", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Lõputöö esitatakse Moodlesse vastavalt Johan Skytte poliitikauuringute instituudi lõputöö, kaitsmiskomisjoni koosseisu moodustamise ja retsensendi määramise ning kaitsmise ja korduskaitsmise korrale."}}]}, "registration_info": {"audience": {"et": "Riigiteaduste bakalaureuseõppekava üliõpilased"}, "min_students": 1}, "parent_uuid": "68b1fb10-0844-b505-cd19-d9a94240bc6d", "parent_code": "SORG.00.004", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}