{"uuid": "92a6b698-c360-e3b3-2c3b-4e4a453bcda0", "code": "SORG.00.001", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Academic Research", "et": "Teadustöö alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces the mechanism of the composition of the academic texts, starting from the sources used and ending with the idea, structure and formulation of the text.  In seminars students have to present several assignments, which are aimed at increasing their capability of finding academic sources, critical analysis of academic texts and good academic writing.", "et": "Kursuses tutvustatakse akadeemiliste tekstide koostamise mehhanismi, alates kasutatavatest allikatest kuni töö mõtte, struktuuri ja vormistuseni. Seminaride käigus esitavad tudengid mitu kodutööd, milles nad õpivad leidma andmebaasidest akadeemilisi allikmaterjale ning akadeemilisi tekste kriitiliselt analüüsima ja korrektselt vormistama."}, "objectives": [{"en": "- to give an overview of the main ethical and practical principles of academic writing\n- to give an overview of the methods and structure of academic writing\n- to increase the motivation of the students to be engaged with academic writing by practical exercises and by professional examples", "et": "- anda bakalaureuseõppe ainetes uurimistööde kirjutamiseks vajalikke baasteadmisi ja -oskusi;\n- anda ülevaade teadustööde kirjutamise eetilistest ja praktilistest põhimõtetest;\n- anda ülevaade kõigist akadeemilise uurimistöö koostisosadest ning olulisematest uurimistöö kirjutamisprotsessi osadest;\n- harjutada ja arendada teadustööde kirjutamise oskust praktiliste harjutuste vahendusel."}], "learning_outcomes": [{"en": "The student who successfully passes the course:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "- is able to differentiate the component parts of the academic argumentation and understands the structure of the academic argumentation", "et": "- oskab eristada akadeemilise argumentatsiooni erinevaid osasid ning tunneb akadeemilise argumentatsiooni struktuuri;"}, {"en": "- is capable of finding academic sources and to formulate his or her own argumentation based on these sources", "et": "- oskab leida akadeemilisi allikmaterjale ning nendele toetudes argumenteerida;"}, {"en": "- has analysed critically academic texts and has also experienced academic criticism regarding his or her own text", "et": "- oskab teadustekste kasutada ning nende põhjal koostada uurimistööd"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}