{"uuid": "85b6f29a-bd8a-923a-1305-d0ea4238ddc4", "code": "SORG.00.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T15:20:20", "title": {"en": "Public Administration", "et": "Avalik haldus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces public administration as an ever-changing discipline being part of the academic world.  \"Introduction to Public Administration\" provides an overview of why and on what basis the public sector has developed. The course also covers policy-making, intersectoral relations, regional and local government, taxation and the public budgets, civil service, organizational theory, etc.\nThe course focuses on understanding public administration as daily life and provides a basis for understanding the core of the public sector. The course is open to all students from all faculties. No prerequisite subject is needed.", "et": "Kursus juhatab kuulaja sisse avaliku halduse paeluvasse ja pidevalt muutuvasse maailma. \"Avaliku halduse alused\" annab hea ülevaate miks ja millistel alustel kujunes üldse avalik sektor, kuivõrd erinev on avalik haldus erinevates riikides ning kui mitmetahuline on see valdkond isegi nii väikeses riigis nagu Eesti. Kursuse jooksul räägitakse nii avaliku halduse eeldustest kui tutvustatakse tudengitele avaliku haldust oma igapäevastes toimingutes. Kuidas juhtida avalikke organisatsioone ja millest lähtuvalt otsustada poliitikate elluviimisel? Kuidas tagada avaliku sektori läbipaistvus ning kuhu suunduvad reformid? Kuivõrd erinev on haldusjuhtimine personalijuhtimisest? Lisaks käsitletakse halduspoliitika kujundamist, sektorite vahelisi suhteid, regionaalset ja kohalikku valitsemist, makse ja riigieelarvet, avalikku teenistust ning organisatsiooniteooria põhialuseid. Kursus keskendub avaliku halduse kui meid ümbritseva igapäevaelu paremale mõistmisele ning annab hea aluse avaliku sektori tundmaõppimiseks. Kursusel võivad osaleda kõikide teaduskondade üliõpilased. Eeldusained puuduvad."}, "objectives": [{"en": "This course introduces public administration as an ever-changing discipline being part of the academic world. The lectures focus on the principles, challenges, trajectories, trends, and context of public administration. The course aims to provide an overview of the development of public administration as a discipline and discuss some of the main topics related to public administration as a practical field. The course provides a good premise for a better understanding of the most current issues in public administration.", "et": "Antud kursus juhatab kuulaja sisse avaliku halduse paeluvasse ja pidevalt muutuvasse maailma. Kursus annab ülevaate nii sellest, milleks meil üldse on nt ministeeriumid ja erinevad avalikud ametid, kui ka sellest, milline on avaliku sektori tegutsemise baasloogika. Loengute jooksul räägitakse nii avaliku halduse eeldustest kui erinevate riikide kogemustest, nii haldus- kui personalijuhtimisest, nii bürokraatiast kui korruptsioonis, nii haldusreformidest kui maksudest, nii koostööst kui otsustamisest. Kursus keskendub eelkõige avaliku halduse kui praktilise valdkonnaga seonduvatele teemadele ja probleemidele. Kursus annab hea eelduse mõistmaks paremini ükskõik millise avaliku sektori töökoha laiemat keskkonda."}], "learning_outcomes": [{"en": "Professional knowledge and skills. After successfully passing the course, the student can:\n-\tunderstand the nature of public administration and the general need for the public sector;\n-\tnotice the fundamental differences of public and private spheres and the ensuing principles of action;\n-\tunderstand the contextually and situatedness of public administration concerning its political and socio-economic environment;\n-\tcritically evaluate daily discussions around administrative topics and possible reforms;\n-\tdevelop a comparative analysis of administrative tasks and functions of public organizations.\n\nTransferable competencies. Upon successful completion of the course, the student can:\n-\tprovide constructive feedback on both lectures and reading materials;\n-\treflect their learning skills and associate them with the real-world cases throughout the course;\n-\tprepare an independent class and present it in front of an unfamiliar audience (additional option).", "et": "Erialased teadmised ja oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tmõista avaliku halduse olemust ja analüüsida vajadust avaliku sektori järele; \n-\thoomata avaliku ja erasfääri fundamentaalseid erinevusi ning sellest johtuvaid erinevaid tegutsemispõhimõtteid;\n-\tmõista avaliku halduse seoseid seda ümbritseva poliitilise ning sotsiaal-majandusliku keskkonnaga;\n-\torienteeruda avaliku haldusega seotud praktilistes valdkondades ja on teadlik nende peamistest probleemidest ja põhiküsimustest;\n-\thinnata kriitiliselt hetke diskussioone halduskorralduse ja võimalike reformide üle;\n-\tarendada võrdlevat analüüsi avalike organisatsioonide haldusülesannete ja funktsioonide suhtes.\n\nÜlekantavad oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tanda operatiivselt ja konstruktiivselt tagasisidet nii loengutele kui lugemismaterjalidele;\n-\treflekteerida jooksvalt oma õpikogemust ja seostada seda ümbritsevate sündmustega;\n-\tesineda avaliku loenguga võõra auditooriumi ees (lisavaliku võimalus)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}