{"uuid": "65968585-7af4-5c2c-c506-b0ad1033134e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-29T09:23:30", "title": {"en": "Comparative Politics", "et": "Võrdlev poliitikateadus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 156, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Individual work with the literature of the given research field, following a list/ plan agreed with the lecturer. The time of the exam will be negotiated with the lecturer responsible.\nThis is not a 'fact-oriented' exam, where students are tested to see if they can recite what author X said in chapter 3 or author Y in article 4. Rather, it's about demonstrating a level of maturity concerning the field and being able to compare and synthesize material in a free and open intellectual exchange. Students should view the exam as a way of establishing for themselves a lasting feeling of familiarity with their discipline, as well as an opportunity to strategically develop different scholarly profiles, which will help them both in their dissertation work as well as future teaching activities. This is the chance to master important aspects of the field in order to prepare oneself both for research and a professional career.", "et": "Doktoriõppe üliõpilaste individuaaltöö erialakirjandusega. Töö toimub kokkuleppel õppejõuga."}, "objectives": [{"en": "The aim of the course is to help a PhD student obtain deep theoretical and empirical knowledge in a field relevant for their PhD dissertation. At the same time, the course can serve as a partial preparation for potential teaching opportunities in the same field.", "et": "Ainekursuse eesmärk on aidata doktorandil omandada süvendatud teoreetilised ning empiirilised teadmised oma doktoritöö tegemiseks vajalikus teemavaldkonnas, andes ühtlasi ettevalmistuse võimalike samateemaliste ainekursuste (osaliseks) lugemiseks."}], "learning_outcomes": [{"en": "Upon completing the course, the students:", "et": "Aine edukalt läbinu:"}, {"en": "1) understand the disciplinary logic of comparative politics within political science domain and its evolution since the beginning of the twentieth century;", "et": "1) mõistab võrdleva poliitika distsipliini ja selle arengut poliitikateadustes;"}, {"en": "2) demonstrate both a strong grounding in methodological issues as well as a broad background in different sub-disciplines of comparative politics;", "et": "2) mõistab erinevaid kontseptsioone tänapäevases võrdlevas poliitikas ning opereerib metodoloogise töörista kastiga, sünteesib erinevate teooriate seisukohti distsipliini põhimõistete suhtes;"}, {"en": "3) demonstrate their critical reading skills;", "et": "4) demonstreerib väga head kriitilise lugemise oskust;"}, {"en": "4) use scholarly concepts and theories for their research.", "et": "5) kasutab teaduslikke mõisteid ja teooriaid oma teadustöös."}], "notes": {}}, "grading": {"independent_work": {"et": "The exam is based on self-study. There are no formal seminars or classes meant to prepare for the exam. However, in addition to independent reading and reflection, students are also highly encouraged:\n(a)\tto audit (where relevant) MA-level courses that cover the same literature; this will provide you with a structured context for engaging the literature and discussing thoughts with others;\n(b)\tto form study groups with other doctoral students when preparing for the actual exam. If you plan to take the exam during a certain semester, contact your fellow doctoral colleagues at least two months in advance about perhaps forming a study group, and then draw up a schedule of meetings (preferably weekly). \n\nThe format of the exam is oral. The student is given five questions, from which he/she must choose two. The student has up to 60 minutes to prepare in relation to each question a 20-minute presentation. During the presentation the student must bring in the relevant theoretical literature as well as examples drawn from his/her chosen countries. After the presentation, the exam committee may ask for clarifications or pose other questions. Generally the exam lasts up to 60 minutes.\n\nThe exam is composed of three parts. \n- The first set of readings (General Political Science and Methodology) is required for all students.  \n- Second, each student must choose two thematic fields, whose required readings must be completed. As a rule, each section contains about 700 pages of required reading. Among these works, however, there is usually at least one book, the contents of which do not always have to scrutinized in every detail; rather, students should aim to extract all of the main arguments.\n- Third, the student must prepare knowledge of the political system of two separate countries in order to demonstrate an ability to apply theories and concepts in an empirical context. The countries must be chosen from separate geographical regions: Western Europe, Eastern Europe, North America, Latin America, Africa or Asia. Students can choose themselves the relevant country material they wish to use. They should make sure, however, to concentrate on those aspects that fit with the thematic fields they have chosen. That is, if one chooses, for example, Civil Society, Regime Transitions, Brazil and India, one should think about what kinds of social movements have been in these two countries, what kinds of problems of democratic consolidation have they had, what is the relevance of the concept of social capital in the two countries, etc. In this respect, the choice of countries should not be purely random. Rather, the selection of good comparative cases will also help in passing the exam."}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "The examinee is expected to demonstrate a thorough understanding of the most important theoretical debates and key texts in general political science and methodology, comparison and contrast of different theoretical approaches in two thematic fields, and assessment of its strengths and weaknesses."}}], "grade_preconditions": {"et": "Successfully passed oral examination"}, "grade_evaluation": {}, "debt_elimination": {"et": "As agreed with the instructor"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "All the required literature is numerically listed and is available electronically (ask your programme managers for details).\n\nBooks are available in the library of the University of Tartu (ESTER system). The remaining works on the list are highly recommended in order to gain a complete perception of the field. Where possible, students should try to at least skim these works. Most of them are available; where not, they can be obtained via inter-library loan or during a trip to a foreign library."}, "participants": {"lecturers": [{"person_uuid": "5d6b24c8-186b-eeb4-3a9f-e59baf708b1d", "person_name": "Piret Ehin", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}}, "registration_info": {"audience": {}, "min_students": 1}, "parent_uuid": "bbfefdc5-5670-3369-3a05-369b63bb72a9", "parent_code": "SORG.03.024", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}