{"uuid": "a33298d4-9bba-5d5e-6ab1-8e136709cff6", "code": "sv-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:27:36", "title": {"en": "Security Politics", "et": "Julgeolekupoliitika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 11, "practice": 0, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This master-level course analyses 'security' as one of the central concepts of international relations. We will discuss how the discipline of Security Studies has developed as an academic field from its narrow beginnings as 'Strategic Studies' to its contemporary complex and broadened field of social and political inquiry. The course investigates how 'security' sits with other core IR concepts, such as 'power' and 'sovereignty', and problems, such as war and the use of force in international politics across different traditional and critical traditions.", "et": "Magistriõppe üliõpilastele suunatud kursus analüüsib julgeoleku kui rahvusvaheliste suhete distsipliini ühe keskseima mõiste ajalugu ning vaatleb julgeoleku-uuringute akadeemilise välja kujunemist kitsalt strateegilistest uuringutest kompleksse ja avara sotsiaalse ja poliitilise analüüsi allvaldkonnaks. Kursuse raames analüüsitakse, kuidas 'julgeolek' asetub teiste rahvusvaheliste suhete kesksete mõistete (nagu 'võim' ja 'suveräänsus') ja sõlmküsimuste (nagu sõda ja jõu kasutamine rahvusvahelises poliitikas) suhtes erinevate traditsiooniliste ja kriitiliste käsitluste taustal."}, "objectives": [{"en": "This master-level course examines 'security' as one of the key concepts in International Relations theory, providing a thorough overview of the evolution of Security Studies as an academic sub-field from traditional Strategic Studies to contemporary critical approaches. The aim is to critically engage with major theories, concepts and debates of Security Studies. The course will provide a theoretical and conceptual scaffolding for analysing contemporary world politics through the lens of security. Looking for the politics behind speaking and acting security, we will discuss how the discipline of Security Studies has developed as an academic field from its narrow beginnings as 'Strategic Studies' to the contemporary complex and broadened field of social and political inquiry. The course investigates how 'security' sits with other core IR concepts, such as 'power' and 'sovereignty', and problems, such as war and the use of force in international politics across different traditional and critical traditions. The course outlines the main traditional and critical approaches to security, discussing competing ideas and criticism on various theoretical approaches in the study of security. It intertwines the reading and discussion of the central debates, concepts and issues of security politics with students' own thinking and research projects. The course, thus, aims to help students to master major writings and thinking in the field, and to support their own MA dissertation projects.", "et": "Kursus annab põhjaliku ülevaate julgeoleku-uuringute (Security Studies) kujunemisest akadeemilise väljana traditsioonilistest strateegilistest uuringutest (Strategic Studies) kaasaegsete kriitiliste käsitlusteni. Eesmärgiks on analüüsida olulisemaid julgeolekuteooriaid, kontseptsioone ja debatte, rõhuasetusega kaasaegsetel kriitilistel julgeolekukäsitlustel."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "By the end of this course, students are able to:\n\n1)\tdescribe, differentiate, criticise and apply major traditional and critical approaches to security;\n2)\tcontextualise contemporary security theories vis-à-vis earlier theoretical traditions and argumentations;\n3)\tcritically read and analyse theoretical texts as well as apply them for examining practical research questions in their own research;\n4)\tapply reflective skills to practical problem solving in contemporary security scene.\n\nDuring the course, students will develop their: \n1)\treading skills, ability to digest and criticise theoretical arguments; \n2)\twriting skills through composing a research paper; \n3)\treflective skills by critically evaluating and synthesising competing conceptions and theories of security as well as applying them to contemporary security challenges.", "et": "Kursuse lõpuks peaksid osalejad:\n\n1) suutma kirjeldada, eristada, arvustada ja rakendada peamisi traditsioonilisi ja kriitilisi lähenemisi julgeoleku analüüsimisel;\n2) oskama suhestada kaasaegseid julgeolekupoliitika teooria arenguid varasemate julgeolekupoliitiliste argumentatsioonidega;\n3) valdama teoreetiliste tekstide kriitilise lugemise ja analüüsi oskust praktiliste uurimisküsimuste lahendamisel.\n\nKursus arendab:\n\n1) akadeemilise eneseväljenduse ja debateerimise oskust seminaride kaudu;\n2) akadeemilise kirjutamise oskust uurimistöö kirjutamise kaudu;\n3) julgeolekuprobleemide teoreetilise mõtestamise ning praktiliste lahendustega seostamise oskust."}], "notes": {}}, "grading": {"independent_work": {"et": "The course is structured around a series of interactive lectures and seminars. As the course is purposefully interactive (including the lectures), attendance (>75%) and active participation during the seminars, exercises and discussions is a requirement for successful completion of the course. Students are expected to come to class fully prepared, having worked with the assigned readings, and ready to engage in a discussion of these topics. \n\n- Seminar preparation: Preparation for the seminars is a precondition for active and meaningful participation in the seminars. Preparation for the seminars is assessed through short exercises which students complete either ahead of or during the seminars and in which students demonstrate their familiarity with the assigned course readings. The assessment of the exercises is non-differentiated (pass/fail). In order to receive the maximum of 5 points, students have to complete the exercise in a way that demonstrates good knowledge of the assigned texts (i.e. pass the threshold of 50% correct answers). Non-completion of the exercise, absence, or the failure to pass the threshold results in 0 points. \n\n- Research paper: The research paper is the result of student's independent research project which applies a selected theoretical perspective to analyse a particular security-related issue or problem. The aim of this exercise is to assess your ability to critically engage a particular theoretical perspective on security in relation to a problem/issue of world politics of your choice. Part of the assessment pertains to students' ability to formulate conceptual, theoretical, and empirical questions and problems in relation to the course material. Therefore, no topics are provided by the instructor. The process of writing the research paper consists of three parts: (1) the proposal (max. 10 points), (2) the draft and peer review (max. 20 points), (3) the final paper (max. 45 points)."}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "The process of writing the research paper consists of three parts: (1) the proposal, (2) draft and peer review, (3) the final paper.\n\nThe paper proposal is assessed according to:\n- clarity and suitability of the proposed research topic\n- precision of the description and explanation of the research problem\n- the formulation and suitability of the proposed research question(s)\n- the suitability of proposed theoretical and methodological framework.\n\nThe paper draft is assessed according to:\n- adherence to the basic structure of a research paper\n- adherence to the formal requirements for the draft (length/parts)\n\nThe peer review of the paper draft is assessed according to:\n- detail of the feedback given\n- comprehensiveness of the feedback given\n- displayed level of understanding of conducting social science research\n\nThe research paper is assessed according to\n- precision of the description and explanation of the research problem\n- the formulation and suitability of the research question(s)\n- the description and elaboration of a theoretical framework that is suitable for answering the proposed research question\n- validity of findings and the establishment of clear links between theory and empirical evidence\n- clarity and coherence of structure and consistency of argumentation \n- the sufficiency of relevant sources and materials used\n- adherence to the formal standards of a graduate-level research paper"}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Seminar preparation is assessed according to\n- the demonstrated level of familiarity with the assigned readings\n- sufficiency of background research"}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "All course requirements have to be met in order to earn a final grade."}, "grade_evaluation": {"et": "- Seminar preparation (25% of the final grade)\n- Research paper (75% of the final grade)"}, "debt_elimination": {"et": "Upon the agreement with the lecturer, granted only in exceptional cases.\n\nCourse participants who want to improve their final grade can do so by completing an additional written assignment. Further instructions will be provided upon request. The additional written assignment is worth max. 10 points"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "be9a0ac9-4d57-ecfe-639d-60d3eaf34b67", "person_name": "Thomas Michael Linsenmaier", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "What is security? The politics and study of security"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Strategic Studies & Realism"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Nuclear (non-)proliferation"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The role of domestic institutions"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Humanitarian intervention"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Constructivist approaches to security"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Alliances and alignment in international politics"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "NO CLASS - individual work on the research papers"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Securitization, de-securitization, and politization"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sociological approaches to the study of security"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Cyber security"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Security and emancipation: Critical approaches to security:"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Terrorism"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The transformation of war"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Small states and international security: The case of Estonia"}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "534d9b99-8810-a41c-2e22-e7ea53c4c6f4", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "586b8565-6580-d16c-f806-59fccda2d86b", "parent_code": "SORG.04.010", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}