{"uuid": "968eee01-0b05-1cc0-2416-778ca51d6d80", "code": "sv-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-12T14:43:24", "title": {"en": "Foreign Policy Analysis", "et": "Välispoliitika analüüs"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 11, "practice": 3, "seminar": 1, "independent_work": 141, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course will combine factor-based and model-based approaches to examine the contemporary literature that comprises Foreign Policy Analysis (FPA) as a seminal sub-field in International Relations. Foreign policy is ubiquitous with international politics as it is the most commonly recognized mode of state agency. Foreign policy is driven and constrained by a wide variety of \"international\", \"transnational\" and \"domestic\" variables. To provide structured examination of the influence that the most pertinent variables in these categories have on the foreign policy decision-making process, this course is divided into two different sections. Section I will examine the principal factors that regularly affect the foreign policy decision-making process. This includes assessment of the external, domestic, formal institutional, transnational and ideational factors that shape foreign policy. Part II will examine the strengths and weaknesses of the main models proposed to explain the main decision-dynamics involved in the foreign policy formation process, this will include assessment of the rational-actor model; the governmental politics model; the leadership trait approach; the operational code approach; prospect theory; poliheuristic theory; analogical reasoning; and groupthink.", "et": "Andmaks kõige parem ülevaade erinevatest mõjudest välispoliitika otsustusprotsessides, jagatakse kursus kaheks osaks. Kursuse esimeses pooles uuritakse peamisi tegureid, mis mõjutavad välispoliitika otsustusprotsesse. Erilist tähelepanu pööratakse  välistele, kohalikele, ametlikele ja kontseptuaalsetele faktoritele, mis kujundavad välispoliitikat. Kursuse teises pooles  uuritakse välispoliitika dünaamikat mõjutavate mudelite, tugevaid ja nõrku külgi."}, "objectives": [{"en": "The course examines the key theories and concepts applicable to analysing foreign policy objectives, strategies and mechanisms of key international actors. The course seeks to explain how foreign policy leaders, high ranking diplomats and decision makers act in situations of uncertainty, international crises and security challenges.", "et": "Kursuse raames uuritakse peamisi teooriaid ja kontseptsioone, mida kasutatakse erinevates välispoliitika analüüsides. Loengute raames vaadeldakse, kuidas käituvad ja tegutsevad välispoliitika juhid ja diplomaadid ebakindlates ja julgeolekuprobleemsetes olukordades ning rahvusvahelistes kriisides."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "Upon successful completion of this course, students will: \nHave obtained a detailed knowledge of the main factors that shape the foreign policy formation process, allowing them to apply these throughout their MA studies; \nHave obtained a comprehensive knowledge of the main models proposed to account for decision-making dynamics in the foreign policy formation process, allowing them to apply these throughout their MA studies; \nHave obtained a detailed understanding of the physiological, cognitive and rational-choice approaches regularly applied in the Foreign Policy Analysis (FPA) literature; \nHave gained detailed insights into the linkages between FPA and International Relations Theory;  \nHave learned to practically apply models explaining foreign policy decision-making to \"real-world\" events through a group presentation; \nHave furthered their skills in researching and writing policy memorandums and argumentative scholarly essays.", "et": "Pärast edukat kursuse lõpetamist, üliõpilased:\n- on saanud põhjalikud teadmised peamistest teguritest, mis kujundavad välispoliitika muutuseid; \n- on saanud põhjalikud teadmised erinevatest lähenemisviisidest, mida kohaldatakse välispoliitikat kajastatavates väljaannetes; \n- on saanud põhjalikud teadmised välispoliitika ja rahvusvaheliste suhete teooria suhtest;\n- on õppinud rakendama praktiliselt erinevaid mudelid, mida kasutatakse välispoliitika otsustusprotsessides;\n- on täiendanud uurimustööde ja esseede kirjutamise oskuseid."}], "notes": {"et": "All papers must be submitted using the page of the course in Moodle.\n\nStudents in this course are expected to know and follow the University rules regarding plagiarism (see, in particular, Procedure for processing cases of academic fraud in the Faculty of Social Sciences at http://sotsiaalteadused.ut.ee/ and the file 'What is plagiarism and how to avoid it', uploaded with the rest of the course materials in Moodle). No plagiarism will be tolerated thus offenders punished."}}, "grading": {"independent_work": {"et": "Students are expected to actively take part in the study sessions discussing assigned readings. The reading list will be provided by the course instructor. Students should be able to present their understanding of the conceptual and analytical frameworks, operate relevant terminology and involve themselves into the regular discussions with peers and classmates during moderated session by the instructors. All students will need to demonstrate their knowledge of reading materials which will be the prerequisite for final assessment.\n\nTEAMWORK EXERCISE: Crisis Management and Response Simulation\nStudents are requested to work in groups to analyze a specific case of crisis escalation, and explain the security challenges faced by a state's foreign policy decision-making institutions in light of an applied example. The group presentation will be weighted at 40% in calculating the final grade for this course.\n\nPOLICY PAPER: \nStudents are required to draft one policy paper / memo of 2000 words maximum. The topic of policy memo should be selected from the list and will be weighted at 40% in calculating the final grade for this course. The due date for the policy paper component will be 5 June 2024. Submission should be made via the Moodle platform."}, "independent_work_assessments": [{"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "TEAMWORK EXERCISE:\nA - Exceptional delivery of brainstorming results, consistent engagement with the proposed scenario and its challenges, The group demonstrated  adaptability in handling unexpected events on the ground, and exhibited strong problem-solving skills. The responses to critical developments effectively contributed to addressing issues within the simulation. The proposed policy moves presented realistic- and relevant solutions and procedural steps.\nB - The group showed sufficient consistency and accuracy in defining policy objectives, and an ability to conduct information-based analysis. The wording of briefings is clear and reasonable, with some room for improvement in structure of the analysis \nC - The proposed solutions are relevant yet lack sufficient justification and precision when it comes to specific policy steps. The general logic of analysis is understandable, but there are occasional lapses in articulation, indicating potential  for a more engaging and focusing presentation\nD -  Presentations displays results of a team work, provides some connections between changes on the ground and their explanations, but not all proposed measures seem to be realistic, which limits their implementation. The understanding of the topic is basic, and the level of critical thinking is moderate \nE - Ample factual mistakes are detectable in presentation. some of the proposed solutions don't look relevant. Engagement with practical questions of foreign policy making is low."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "POLICY PAPER is assessed according to the following criteria:\nA - the paper demonstrates student's perfect knowledge of the reading materials and the course content, excellent writing skills, and contains conclusions relevant for the course. The academic / political controversies are duly described and commented\nB - the student is familiar with the recommended literature, is aware of key concepts discussed during the course, and showed her/his ability to highlight its key points without getting into details and making comparisons with other similar cases or texts;\nC- the student can engage with most of the academic arguments, is capable of analytically approaching the discussed topics and properly comprehend the main ideas of the course\nD - the student is only superficially aware of the main issues touched upon by the recommended authors and the course instructor, and lacks a clear vision of the problems discussed\nE - the student only scarcely discusses the key concepts in the literature and is minimally prepared for giving his/her expert opinion on the subject\nF - the submitted paper is vague in language, or simply reiterates the well known facts, or is politically biased (for example, gives preference to one of many discourses or arguments), or is detached from empirical facts, or fails to cover alternative viewpoints existing in the literature or in political narratives. The paper lacks a clear structure or a concluding argument that summarizes the research."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "The test contains 10 questions, all based on the homework reading. Each correct answer corresponds to 2 points"}}], "grade_preconditions": {"et": "Successful submission of all assignments and active participation in study sessions based on the weekly assigned readings. If you are unable to attend a study session, please notify the instructor as soon as possible."}, "grade_evaluation": {"et": "Test - 20 % of the total grade\nTeamwork-based presentation - 40 % of the total grade \nPolicy paper - 40% of the total grade"}, "debt_elimination": {"et": "In line with Study regulations, with the agreement of the instructor."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "f473e099-60a5-5825-bc83-fb62ee18fb81", "person_name": "Andrey Makarychev", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "This class aims to present an overview on the eminent theories and paradigms in Foreign Policy Analysis (FPA). This will involve examination of FPA's place in the domain for political action between states in the international system. The underlying logics for some of the classic models of foreign policy decision-making will be introduced."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Focal points: agency and performativity; normative and ethical agency"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Case Study: Russian Foreign Policy from the Cold War to the Invasion of Ukraine"}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Focal point: heritage diplomacy"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Case study: new spatial dynamics of rebordering in Central / Eastern Europe and the Baltic Sea Region"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Trans-border Migrations as a Foreign Policy Issue"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Focal points: money laundering and asset freezing"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Case study: Estonian Foreign and Security Policies"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Focal point: urban diplomacy"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Methodological workshop: How to Use Visuals for Studying Foreign Policy?\nCase Study: Visual Propaganda, Mis- and Mal-information"}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {"et": "Escalation Scenario 2"}}, {"work_type": {"code": "internship", "et": "praktika", "en": "practical training"}, "topic": {}, "description": {"et": "Escalation Scenario 3"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "FPA: cognitive potential, academic merits and policy relevance"}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "51ea96e2-0f4d-f402-c76d-5252e490def8", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "b1f43be8-d479-cb7c-96a8-37535c6b2c7a", "parent_code": "SORG.04.011", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}