{"uuid": "3a7da1a8-ef2c-7c11-6d33-cbd3692427de", "code": "SORG.00.053", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "University Teaching Practice", "et": "Ülikoolis õpetamise praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "A student's responsibility is to assist the responsible teacher in seminars, creating and moderating the e-learning component (e.g. Moodle), operate with the learning materials (scanning, copying, composing etc.), administer questions and course related matters (e.g. collection of essays, calculating grades, forwarding feedback). The role of study assistant is not related to any teaching activity, such as lecturing, assessment, giving feedback, etc.\nStudy assistants are chosen based on their study performance and successful fulfillment of their own curricula.", "et": "Üliõpilase ülesanne on abistada vastutavat õppejõudu seminaride läbiviimisel, aidata vastutaval õppejõul tagada kursusele Moodle tugi (vajadusel luua toe põhi, laadida üles materjale, korraldada arutelusid foorumis, vastata küsimustele jne). Samuti on üliõpilase ülesanne aidata õppejõude kursuse administratiivse poolega: koguda kokku esseid ja kodutöid, kanda sisse tulemusi jne. Õppeassistendid iseseisvalt ei vii läbi loenguid, ei hinda ega paranda kontrolltöid, ei anna sisulist tagasisidet.\nÕppeassistendid valitakse edukamate tudengite hulgast."}, "objectives": [{"en": "Students' participation in the study process helps to create affiliation to the institute and develop skills of the most successful students, and therefore guide them towards the doctoral studies at the University of Tartu. The objective of the practice is to provide knowledge and experience in university-level teaching and to apply teaching and learning knowledge and skills in a didactic context. During practice a student can develop the skills of preparing studying materials, giving feedback, argumentation and active listening, helping out during seminars under supervision of the responsible lecturer, operating in e-learning environment (e.g. Moodle), and solving course related matters.", "et": "Üliõpilaste osalemine õppetöö läbiviimisel aitab tihendada suhteid üliõpilastega ning arendada andekamate üliõpilaste õpetamisoskusi, millega on omakorda neid võimalik suunata jätkama doktoriõpinguid Tartu Ülikoolis. Praktika eesmärk on anda teadmisi ja kogemusi kõrgkoolipedagoogika alal ning rakendada nii didaktilises kui ka praktilises kontekstis õpetamise ja õppimise teadmisi ja oskusi. Praktika käigus harjutatakse õppeülesannete koostamist, tagasiside andmist, argumenteerimist ja aktiivse kuulamise oskust, seminaride juhendamine vastutava õppejõu käe all, Moodle keskkonna haldamine ja kursusega seotud paberimajandusega tegelemine."}], "learning_outcomes": [{"en": "After passing the practice a student knows the specificity of university-level teaching (e.g. knows how to prepare and teach a lecture course or a seminar, evaluate students' independent work, give feedback) and use active learning methods, i.e. e-learning.", "et": "Praktika edukal läbimisel tunneb üliõpilane kõrgkoolis õpetamise spetsiifikat (nt teab kuidas pidada akadeemilist loengut, viia läbi seminari, oskab hinnata üliõpilaste iseseisvat tööd, anda tagasisidet) ja oskab kasutada aktiivõppe meetodeid (sh e-õppe)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}