{"uuid": "70a01036-ad98-dd18-4665-a46133aeedff", "code": "sv-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:29:27", "title": {"en": "The Baltic Sea Region in the International System", "et": "Läänemere regioon rahvusvahelistes suhetes"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 14, "practice": 2, "seminar": 10, "independent_work": 130, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will examine the Baltic Sea as an integral region and its role within the international relations framework of today. It aims to impart a comprehensive understanding of the Baltic Sea region and the stances of various countries (Denmark, Estonia, Finland, Germany, Latvia, Lithuania, Norway, Poland, Russia, and Sweden) within this context. Additionally, it explores their contributions to regional cooperation and the influence of this region on their foreign policy decisions. Primarily analysed in a European setting, the course also addresses the impact of internal dynamics on foreign policy and the role of Baltic Sea nations in global affairs.\n\nStructured into five modules, the semester begins with a succinct overview of each regional country's foreign policy. Subsequently, various themes are explored from a comparative viewpoint. The second module delves into regional cooperation in both the Baltic and closely associated Arctic regions. The third module examines the regional security framework, encompassing traditional military security and broader societal security aspects. The fourth module offers insights into the global political roles of Baltic Sea region countries, including development cooperation, environmental policies, peacekeeping, and more. Each module comprises interactive lectures and a seminar, after which students are expected to consolidate their learning in a reflective analysis. The final module involves simulation exercises on a security crisis, requiring students to represent a Baltic Sea nation. Post-simulation, students must articulate their reflections on the crisis. The course concludes with an examination.", "et": "Antud kursus analüüsib Läänemere piirkonda tervikliku regioonina tänastes rahvusvahelistes suhetes. Kursus annab üldisema arusaama Läänemere regioonist ja kuidas erinevad riigid (Eesti, Leedu, Läti, Norra, Poola, Rootsi, Saksamaa, Soome, Taani ja Venemaa) selles regioonis positsioneeruvad, kuidas nad aitavad kaasa regionaalsele koostööle ja kuidas Läänemere regioon mõjutab nende välispoliitilisi otsuseid. Kuigi kursus keskendub peamiselt Läänemere regioonile Euroopa kontekstis, proovib kursus hinnata ka Läänemere maade rolli globaalses kontekstis ning vaadata nende riikide sisemisi mõjureid välispoliitilistes otsustes.\nKursus on jagatud viieks teemaplokiks. Semester algab Läänemere maade välispoliitikate võrdleva ülevaatega. Järgnevates plokkides analüüsitakse erinevaid teemasid tervikliku regiooni kontekstis. Teine plokk keskendub regionaalsele koostööle nii Läänemere piirkonnas kui ka sellega lähedalt seotud Arktikas. Kursuse kolmas plokk tegeleb Läänemere regiooni julgeolekustruktuuriga. Julgeolekut vaadatakse nii traditsioonilise sõjalise julgeoleku tähenduses kui ka laiendatud ühiskondliku julgeoleku mõõtmest lähtudes. Kursuse neljas plokk keskendub Läänemere maade rollile maailmas (arengukoostöö, keskkonnakaitse, rahuvalve jms). Iga plokk jaguneb interaktiivseteks loenguteks ning seminariks, mille lõppedes tuleb koostada teemat reflekteeriv lühianalüüs. Kursuse viimases plokis toimub üks julgeolekukriisi teemaline simulatsiooniharjutus, kus tudengid peavad esindama mõnda riiki Läänemere regioonis. Simulatsiooniharjutuse lõpus peavad tudengid koostama eneserefleksiooni. Kursus lõpeb eksamiga."}, "objectives": [{"en": "The aim of the course is to analyse and understand major topics and challenges of the Baltic Sea countries today. More precisely, the course aims:", "et": "Kursuse eesmärgiks on analüüsida ja mõista peamisi küsimusi ja probleeme, millega Läänemeremaad tänasel päeval tegelevad. Konkreetsemalt on kursuse eesmärkideks:"}, {"en": "- to give an overview of the geopolitical position of the Baltic Sea region and its countries mutual relations;", "et": "- anda ülevaade Läänemere geopoliitilisest positsioonist ja nende riikide omavahelistest suhetest;"}, {"en": "- to analyse regional cooperation and cross-border cooperation in the Baltic Sea region and the Arctic;", "et": "- analüüsida regionaalset koostöövõrgustikku ja piiriülest koostööd Läänemere regioonis ja Arktikas;"}, {"en": "- to analyse security dimension of the Baltic Sea region;", "et": "- analüüsida Läänemere ruumi julgeolekualast mõõdet;"}, {"en": "- to analyse the role of the Baltic Sea region countries in global politics;", "et": "- analüüsida Läänemere maade rolli maailmapoliitikas"}, {"en": "- to apply theoretical approaches in order to analyse crucial topics for the Baltic Sea region countries;", "et": "- rakendada teoreetilisi käsitlusi analüüsimaks Läänemere regiooni riikide jaoks olulisi välispoliitilisi teemasid;"}, {"en": "- to offer an opportunity to cope with a security crisis and to reflect own capability to succeed in this situation.", "et": "- anda võimalus toime tulla julgeolekukriisis ja hinnata oma võimekust selles hakkama saada."}], "learning_outcomes": [{"en": "Upon completion of the course, the student will:", "et": "Kursuse lõppedes tudeng:"}, {"en": "- define major foreign policy interests and priorities of the Baltic Sea countries and assess their implementation; ", "et": "- defineerib Läänemere maade peamised välispoliitilised prioriteedid ning hindab nende elluviimist;"}, {"en": "- know institutions of regional cooperation in the Baltic Sea region and the Arctic and assess their efficiency;", "et": "- tunneb regionaalseid koostööinstitutsioone Läänemere regioonis ja Arktikas ning hindab nende efektiivsust;"}, {"en": "- analyse and assess the security structure of the Baltic Sea region, based on the broader definition of security;", "et": "- analüüsib ja hindab Läänemere regiooni julgeolekustruktuuri, lähtudes julgeoleku laiapõhjalisest definitsioonist;"}, {"en": "- analyse and assess the role of the Baltic Sea countries in global politics;", "et": "- analüüsib ja hindab Läänemere maade rolli maailmapoliitikas;"}, {"en": "- manage an escalating security crisis and reflects own actions during the crisis.", "et": "- haldab eskaleeruvat julgeolekukriisi ning analüüsib oma tegevust selles kriisis."}], "notes": {}}, "grading": {"independent_work": {"en": "List of the course independent works:\n4 reflection papers on the study modules\nCountry's position paper in the security crisis\nPost-crisis self-evaluation\n\nSee the course page in Moodle for detailed instructions. ", "et": "Kursuse iseseisvad tööd on:\n4 reflektiivset õpipäevikut\nriigi seisukohtade alusdokument julgeolekukriisis\njulgeolekukriisi järgne eneseanalüüs\n\nJuhendid on detailselt esitatud kursuse õpitoe (Moodle) lehel."}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"en": "The reflection will be assessed based on pass/fail result:\n<b>Pass result</b> - a comprehensive analysis that outlines the main characteristics, demonstrates good understanding of the topic\n<b>Fail result</b> - superficial summary, incoherent analysis or missing analysis, lacking important aspects, poor understanding of the topic", "et": "Reflektiivset õpipäevikut hinnatakse skaalal arvestatud/mitte arvestatud:\n<b>Arvestatud tulemus</b> - põhjalik analüüs, mis kirjeldab hästi analüüsitud teema olemust ning selle kujunemise põhjuseid, samuti näitab head teema mõistmist.\n<b>Mittearvestatud tulemus</b> - teema pealiskaudne kokkuvõte, ebaselge analüüs või analüüs puuduv üldse, olulised aspektid on katmata, nõrk teema mõistmine."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"en": "The country's position paper, constituting the initial segment of the simulation exercise, will be evaluated using the following grading scale:\n<b>10 points</b> - The paper is thorough and precise, employing relevant and robust argumentation to formulate the country's position, and demonstrates a comprehensive understanding of the situation.\n<b>5 points</b> - The paper attempts to summarise various pieces of information; however, it lacks clear deliberation regarding the necessity of this data. The country's positions are somewhat superficial or imprecise.\n<b>1 point</b> - The document is superficial and disorganised, making it challenging to discern the positions and the rationale for their inclusion in the document.", "et": "Riigi seisukohtade alusdokumendi (rollimängu esimene osa) hindamine toimub järgneva skaala alusel:\n<b>10 punkti</b> - Töö on põhjalik ja realistlik, kasutades asjakohast infot ja hästi põhjendatud argumentatsiooni riigi seisukohtade kujundamiseks ning see peegeldab julgeolekuolukorra põhjalikku mõistmist.\n<b>5 punkti</b> - Töö on proovinud kokku võtta erinevaid infokilde, kuid nende väärtus dokumendis pole eriti selgelt läbi mõeldud, mistõttu nende andmete vajalikkus on küsitav. Riigi seisukohad on pigem pealiskaudsed või ebatäpsed ning julgeolekuolukorda ei ole väga hästi mõistetud.\n<b>1 punkt</b> - Dokument on pealiskaudne ja kaootiline, muutes riigi seisukohtade mõistmise keeruliseks ja dokumendis kajastatud informatsiooni põhjused või vajalikkus on ebaselged."}}, {"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"en": "Assessment of the second part of the simulation exercise is based on final reflection.\n<b>Criteria are the following:</b>\n- thoroughness of the self-evaluation (max 6 points)\n- critical evaluation of self-performance (max 5 points)\n- argumentation (max 5 points)\n- structure (max 3 points)\n- technical requirements (max 1 point)", "et": "Julgeolekukriisi rollimängu teise osa hindamine põhineb eneseanalüüsil. \n<b>Kriteeriumid on järgmised:</b>\n- enesehindamise põhjalikkus (maksimaalselt 6 punkti)\n- kriitiline enda rollitäitmise hindamine (maksimaalselt 5 punkti)\n- analüüso argumenteeritus (maksimaalselt 5 punkti)\n- struktuur (maksimaalselt 3 punkti)\n- tehniliste nõuete täitmine (maksimaalselt 1 punkt)"}}], "grade_preconditions": {"en": "Minimum criteria for achieving the final grade include:\n- Students must attend at least 75% of the scheduled classroom sessions.\n- All reflection papers must be submitted, with at least three out of four achieving a pass result.\n- Full participation in the simulation exercise is required, encompassing the submission of all mandatory assignments and active involvement during both online and classroom phases.", "et": "Lõpphinde saamise miinimumnõuded on järgmised:\n- Üliõpilased peavad osalema vähemalt 75% planeeritud klassiruumi kohtumistest.\n- Esitada tuleb kõik reflektiivsed õpipäevikud, millest vähemalt kolm peavad saama arvestatud tulemuse.\n- Rollimängus tuleb osaleda täiemahuliselt, mis hõlmab kõikide nõutud ülesannete esitamist ja aktiivset kaasalöömist nii online tegevustes kui klassiruumi kohtumisel."}, "grade_evaluation": {"en": "The final result will consist of 3 components: \n- reflection papers (20%, each 5%), \n- simulation exercise (30% (10%+20%), \n- final exam (50%)\n\nStudents should obtain at least \n18 points out of 30 for the simulation exercise\n30 points out of 50 for the final exam", "et": "Lõpptulemus koosneb kolmest komponendist:\n- reflektiivne õpipäevik (20%, igaüks 5%),\n- julgeolekukriisi rollimäng (30% (10%+20%),\n- lõpueksam (50%).\n\nÕpilased peaksid saama vähemalt\n18 punkti 30-st simulatsiooniharjutuse eest\n30 punkti 50-st lõpueksami eest."}, "debt_elimination": {"en": "Assignments must be submitted punctually; late submissions are only accepted under extraordinary circumstances (for instance, illness substantiated by a medical certificate). Due to its nature as a group assessment, it is not feasible to compensate for the simulation exercise.", "et": "Ülesanded tuleb esitada õigeaegselt, hilinenud esitamisi aktsepteeritakse ainult väga erandlikel juhtudel (nt haigus, mida tõendab arstitõend). Kuna rollimäng on grupihindamine, siis seda ei ole võimalik kompenseerida."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "2cb62b6a-eed9-82c4-021d-f2411c405e2c", "person_name": "Heiko Pääbo", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-33, 35-37, 39"}, "entries": [{"course_week": 24, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"en": "Introduction to the course", "et": "Kursuse tutvustus"}, "description": {"en": "The first meeting of the course is designed to lay a foundational understanding for the participants. It will provide a comprehensive overview of the course content, introducing the various requirements that students are expected to fulfill. Additionally, this session will establish the learning targets, setting expectations and cooperation principles for the duration of the course. This initial meeting is crucial in aligning the students' understanding with the course's educational goals and framework.", "et": "Kursuse esimene kohtumine on mõeldud osalejatele kursusest ülevaate andmiseks. See annab põhjaliku ülevaate kursuse sisust, tutvustades erinevaid nõudeid, mida õppuritelt oodatakse. Lisaks seatakse sellel kohtumisel individuaalsed õpieesmärgid ja koostööpõhimõtted kursuse jooksul. See kohtumise eesmärgiks on õppijate arusaama ühtlustamine kursuse hariduslike eesmärkide ja raamistikuga."}}, {"course_week": 25, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"en": "Foreign policy of the small states", "et": "Väikeriikide välispoliitika"}, "description": {"en": "The lecture delves into the intricacies of foreign policy as practised by small states in the Baltic Sea region, namely Estonia, Latvia, Lithuania, Finland, Denmark, Norway, and Sweden. It begins by examining the definition of 'small states', exploring the unique characteristics that define their foreign policy in the context of the Baltic Sea region. The lecture then moves on to identify and explain the specialisations of these states within the context of the Baltic Sea region, providing a general understanding of their roles and strategies in international relations.", "et": "Loeng keskendub väikeriikide välispoliitika eripäradele Läänemere piirkonnas, keskendudes Eestile, Lätile, Leedule, Soomele, Taanile, Norrale ja Rootsile. Alustatakse aruteluga väikeriigi definitsioonist, uurides nende välispoliitika ainulaadseid omadusi Läänemere piirkonna kontekstis. Seejärel liigub loeng edasi nende riikide spetsiifikate tuvastamisele ja selgitamisele Läänemere piirkonna kontekstis, luues üldarusaama nende rollidest ja strateegiatest rahvusvahelistes suhetes."}}, {"course_week": 26, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"en": "Foreign policy of the large states", "et": "Suurte riikide välispoliitika"}, "description": {"en": "The lecture presents an exploration of the foreign policies of the larger countries in the Baltic Sea region, namely Poland, Germany, and Russia. It commences by comparing the size and geopolitical stature of these three nations, highlighting their relative scales and influence in the international system. The lecture then progresses to a detailed comparison and contrast of the unique characteristics of each country's foreign policy. This analysis carves out distinct profiles for each of the three nations, elucidating their individual approaches, priorities, and strategies within the Baltic Sea context.", "et": "Loeng tutvustab suuremate riikide, nimelt Poola, Saksamaa ja Venemaa, välispoliitikat Läänemere piirkonnas. Alustatakse nende kolme riigi suuruse ja geopoliitilise staatuse võrdlemisega, keskendudes nende suhtelisele suurusele ja mõjule rahvusvahelises süsteemis. Seejärel liigutakse edasi iga riigi välispoliitika eripärade võrdlemisega ja kontrastide väljatoomisega. See analüüs toob välja iga kolme riigi profiilid, selgitades nende individuaalseid lähenemisi, prioriteete ja strateegiaid Läänemere kontekstis."}}, {"course_week": 27, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"en": "Comparative analysis of foreign policy", "et": "Välispoliitikate võrdlev analüüs"}, "description": {"en": "The seminar discussion centres on a three-tiered comparative framework for analysing the foreign policy of countries in the Baltic Sea region. The initial level is devoted to descriptive analysis, where the focus is on delineating the specific policies and actions of these nations. The second level delves into explanatory analysis, aiming to unravel the underlying reasons and motivations driving these policies. The final tier involves a critical assessment of policy capabilities and performance, evaluating the effectiveness and impact of the foreign policies implemented by these Baltic Sea region countries.", "et": "Diskussioon seminaris rakendatakse kolmetasandilist mudelit analüüsimaks Läänemere regiooni riikide välispoliitikaid. Esmane tasand on pühendatud kirjeldavale analüüsile, kus keskendutakse nende riikide konkreetsete poliitikate ja tegevuste võrdlusele. Teine tasand tegeleb selgitava analüüsiga, mille eesmärk on arutleda nende poliitikate põhjuste ja motiivide üle. Viimane tasand hõlmab poliitilise suutlikkuse ja tulemuslikkuse kriitilist hindamist, arutledes nende Läänemere piirkonna riikide välispoliitika tõhusust ja mõju."}}, {"course_week": 28, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"en": "Regional cooperation in the Baltic Sea region", "et": "Läänemere regiooni koostöö"}, "description": {"en": "The lecture commences with the conceptualisation of regionalism, drawing a comparative analysis between Old and New Regionalism. This introduction sets the stage for a concise historical overview of the evolution of region-building in the Baltic Sea region. The narrative then seamlessly transitions to a discussion on regional governance, culminating in an introduction to the EU Strategy for the Baltic Sea Region.", "et": "Loeng algab regionalismi kontseptualiseerimisega, tutvustades regionalismi vana ja uut käsitlust. Seejärel antakse ajalooline lühiülevaade Läänemere regiooni kujunemisest. Seejärel liigub loeng regionaalse valitsemise mudeli tutvustamisele, mis kulmineerub ELi Läänemere regiooni strateegia tutvustamisega."}}, {"course_week": 29, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"en": "Regional cooperation in the Arctic", "et": "Koostöö Artikas"}, "description": {"en": "The lecture begins by defining the Arctic region, establishing a foundational understanding of its geographical and geopolitical context. Following this, it introduces the principal territorial disputes that are characteristic of the Arctic, explaining the complexities and contentious issues involved. In the second half, the lecture shifts focus to outline the main challenges and issues prevalent in the region. It then briefly introduces the key institutions that facilitate regional cooperation in the Arctic, providing an overview of the collaborative efforts that shape the dynamics of this strategically significant area.", "et": "Loeng algab Arktika piirkonna määratlemisega, luues aluse selle geograafilisele ja geopoliitilisele kontekstile. Seejärel tutvustatakse peamisi territoriaalseid vaidlusi, mis on Arktika piirkonnale iseloomulik, selgitades nendega seotud vaidlusküsimuste keerukust. Teises loengupooles arutletakse peamiste väljakutsete ja probleemide üle Artika piirkonnas. Seejärel tutvustatakse lühidalt peamisi institutsioone, mis hõlbustavad piirkondlikku koostööd Arktikas, andes ülevaat jõupingutustest koostööd teha, mis kujundavad selle strateegiliselt olulise piirkonna dünaamikat."}}, {"course_week": 30, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"en": "Comparative regionalism in the Baltic Sea region and the Arctic", "et": "Regionaalse koostöö võrdlus Läänemere regioonis ja Arktikas"}, "description": {"en": "The seminar delves into an analysis of the factors that either foster or hinder cooperation in the Arctic and the Baltic Sea region. It explores various elements influencing the dynamics of collaboration in these areas, examining political, economic, environmental, and security-related aspects. The discussion then progresses to assess regionalism in both regions, critically evaluating their current state and the effectiveness of their cooperative frameworks. Finally, the seminar offers an outline of future perspectives, contemplating potential developments and challenges that may shape the trajectory of regionalism in the Arctic and Baltic Sea regions.", "et": "Seminaris analüüsitakse tegureid, mis soodustavad või takistavad koostööd Arktika ja Läänemere piirkonnas. Analüüs keskendub erinevatele faktoriele, mis mõjutavad koostöö dünaamikat nendes valdkondades, uurides poliitilisi, majanduslikke, keskkonnaalaseid ja julgeolekuga seotud aspekte. Seejärel edeneb arutelu, et hinnata mõlema piirkonna regionalismi, hinnates kriitiliselt nende praegust olukorda ja koostööraamistike tõhusust. Samuti antakse seminaril ülevaade regionalismi tulevikuväljavaadetest, mõtiskledes võimalike arengute ja väljakutsete üle, mis võivad mõjutada Arktika ja Läänemere piirkonna regionalismi."}}, {"course_week": 31, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"en": "Military security in the Baltic Sea region", "et": "Sõjaline koostöö Läänemere regioonis"}, "description": {"en": "The lecture commences with an exploration of the concept of security, placing particular emphasis on hard security, which involves military and defence aspects. It then transitions to a succinct overview of the evolution of hard security issues in the Baltic Sea region, tracing developments from the interwar period to the present day. This historical context sets the stage for the final segment of the lecture, which is dedicated to outlining the contemporary security environment in the Baltic Sea region.", "et": "Loeng algab julgeoleku termini lahti mõtestamisega, pannes rõhu nn kõvale julgeolekule, mis hõlmab sõjalisi ja kaitsealaseid aspekte. Seejärel antakse lühiülevaade kõva julgeolekuga seotud teemade arengust Läänemere piirkonnas, jälgides neid teemasid sõdadevahelisest perioodist tänapäevani. See ajalooline kontekst paneb aluse loengu viimasele osale, mis on pühendatud Läänemere piirkonna tänapäevase julgeolekukeskkonna kirjeldamisele."}}, {"course_week": 32, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"en": "Societal security in the Baltic Sea region", "et": "Ühiskondlik julgeolek Läänemere regioonis"}, "description": {"en": "The lecture initiates with a discussion on the concept of societal security, incorporating the notion of resilience. This part of the lecture aims to provide a clear understanding of what societal security entails, emphasising its significance in the contemporary security discourse. Following this conceptual groundwork, the lecture proceeds to offer a general overview of the primary risks and vulnerabilities facing countries in the Baltic Sea region. This overview encompasses a range of challenges, from political and social to environmental and economic, thus painting a comprehensive picture of the multifaceted nature of security issues in this region.", "et": "Loeng algab aruteluga ühiskondliku julgeoleku mõiste üle, sh ühiskondliku kerksuse mõiste. Loengu selle osa eesmärk on anda selge arusaam sellest, mida ühiskondlik julgeolek endaga kaasa toob, rõhutades selle olulisust kaasaegses julgeolekudiskursuses. Pärast seda kontseptuaalset eeltööd annab loeng üldise ülevaate peamistest riskidest ja haavatavustest, millega Läänemere piirkonna riigid silmitsi seisavad. Käesolev ülevaade hõlmab mitmesuguseid väljakutseid, alates poliitilistest ja sotsiaalsetest kuni keskkonna- ja majandusprobleemideni, andes sellega tervikliku arusaama selle piirkonna julgeolekuküsimuste mitmetahulisest olemusest."}}, {"course_week": 33, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"en": "SWOT analysis of Security in the Baltic Sea region", "et": "Läänemere regiooni julgeoleku SWOT analüüs"}, "description": {"en": "The seminar employs the SWOT analysis method to discuss thoroughly the security environment of the Baltic Sea region, focusing on its strengths, weaknesses, opportunities, and threats. This analytical approach is applied to both hard and soft security dimensions, offering a comprehensive assessment. The seminar aims to compose a balanced and in-depth understanding of the multifaceted security landscape in the Baltic Sea region, integrating both traditional military considerations and broader societal security aspects.", "et": "Seminaris kasutatakse SWOT-analüüsi meetodit Läänemere piirkonna julgeolekukeskkonna põhjalikuks analüüsiks , keskendudes selle tugevustele, nõrkustele, võimalustele ja ohtudele. Seda analüütilist lähenemisviisi rakendatakse nii kõva kui ka pehme julgeoleku teemade suhtes, võimaldades mitmekülgset analüüsi. Seminari eesmärk on luua tasakaalustatud ja põhjalik arusaam Läänemere piirkonna mitmetahulisest julgeolekumaastikust, integreerides nii traditsioonilisi sõjalisi kaalutlusi kui ka laiemaid ühiskondliku julgeoleku aspekte."}}, {"course_week": 34, "work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic_number": 4, "topic": {"en": "Independent study week", "et": "Iseseisva õppe nädal"}, "description": {"en": "This week is designated for the preparation of the security crisis simulation exercise. During this period, students are expected to dedicate their efforts to crafting their respective <b>country's position paper</b>. This document will form the foundational basis for the interaction stage scheduled for the following week. It is essential that the position papers are well-researched and thoughtfully composed, as they will play a crucial role in guiding the discussions and negotiations in the simulation. This preparatory phase is critical for ensuring that students are adequately equipped with the necessary knowledge and perspective to engage in the upcoming interactive segment of the exercise effectively.", "et": "See nädal on mõeldud julgeolekukriisi rollimängu ettevalmistamiseks. Sel perioodil eeldatakse, et üliõpilased keskenduvad oma <b>riigi lähtekohtade dokumendi</b> koostamisele. See dokument on aluseks järgmisel nädalal toimuval interaktsioonifaasile. On oluline, et lähtekohad oleksid põhjalikult läbimõeldud, sest neil on oluline roll rollimängus arutelude ja läbirääkimiste suunamisel. See ettevalmistav etapp on ülioluline tagamaks, et osalejad on korralikult varustatud vajalike teadmiste ja perspektiividega, et tõhusalt osaleda harjutuse eelseisvas interaktiivses osas."}}, {"course_week": 35, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 4, "topic": {"en": "Security crisis exercise", "et": "Julgeolekukriisi rollimäng"}, "description": {"en": "<b>Security crisis exercise: online interaction (entire week, 29.04-06.05.2024).</b> \nDuring the interaction stage of the simulation, students are required to engage with the unfolding events on the course forum actively. They must strategically plan their responses, initiate negotiations with other countries, and endeavour to navigate their way through the crisis. This phase demands astute attention to detail, collaborative efforts, and tactical decision-making to effectively manage and, ideally, overcome the challenges presented by the simulated crisis.", "et": "<b>Julgeolekukriisi rollimäng toimub veebipõhiselt terve nädala jooksul (29.04-06.05.2024)</b> \nSimulatsiooni interaktsioonifaasis peavad üliõpilased aktiivselt reageerima kursuse foorumis toimuvate sündmustele. Nad peavad strateegiliselt planeerima oma reageeringuid, algatama läbirääkimisi teiste riikidega ja püüdma kriisis orienteeruda. See etapp eeldab hoolikat tähelepanu detailidele, ühiseid jõupingutusi ja taktikaliste otsuste tegemist, et simuleeritud kriisist tulenevaid väljakutseid tõhusalt hallata ja ideaaljuhul ületada."}}, {"course_week": 36, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {"en": "Security crisis exercise", "et": "Julgeolekukriisi rollimäng"}, "description": {"en": "The simulation exercise reaches its climax with face-to-face negotiations aimed at delineating a final action plan. This pivotal meeting will convene only if the participants deem it necessary, providing a platform for direct dialogue and collaborative decision-making. This stage is critical for consolidating the outcomes of previous discussions and crystallising a cohesive strategy to address the simulated crisis.", "et": "Julgeolekukriisi rollimängu klminatsiooniks on silmast silma peetavate läbirääkimised, mille eesmärk on kokku leppida lõplik tegevuskava. See koosolek kutsutakse kokku ainult juhul, kui osalejad seda vajalikuks peavad, pakkudes platvormi otseseks dialoogiks ja ühiseks otsustusprotsessiks. See etapp on otsustava tähtsusega, et konsolideerida varasemate arutelude tulemused ja luua sidus strateegia simuleeritud kriisi lahendamiseks."}}, {"course_week": 37, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"en": "Baltic Sea region and Global development", "et": "Läänemere regioon ja üleilmne areng"}, "description": {"en": "The lecture offers a historical perspective on global development policies, highlighting the unique aspects of the Baltic Sea region countries. It then proceeds to outline the profiles of these nations as donor countries, shedding light on their specific priorities and distinct characteristics. Additionally, the lecture briefly addresses the involvement of Baltic Sea region countries in United Nations peacekeeping missions, providing insights into their contributions and roles in these international efforts.", "et": "Loeng tutvustab globaalse arengupoliitika ajaloolist kujunemist, tuues selles esile Läänemere piirkonna riikide eripärad. Seejärel visandatakse nende riikide kui doonorriikide profiilid, heites valgust nende riikide prioriteetidele ja eripäradele. Lisaks käsitletakse loengus lühidalt Läänemere piirkonna riikide osalemist ÜRO rahuvalvemissioonides, andes ülevaate nende panusest ja rollist nendes rahvusvahelistes jõupingutustes."}}, {"course_week": 39, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"en": "Baltic Sea region in the global politics", "et": "Läänemere regioon globaalses poliitikas"}, "description": {"en": "The seminar conducts a comparative analysis of the Baltic Sea region's contributions to global development and security. It delves into the motivations and capabilities of these countries, examining them from a comparative perspective. Furthermore, the session outlines an assessment of the development policies implemented by the Baltic Sea region countries, providing a critical evaluation of their effectiveness and impact in the broader context of international development and security.", "et": "Seminaril analüüsitakse võrdlevalt Läänemere piirkonna panust globaalsesse arengusse ja julgeolekusse. See analüüsib nende riikide motivatsioone ja võimekusi, lähtudes võrdlevast vaatenurgast. Lisaks antakse hinnang Läänemere piirkonna riikide arengupoliitikatele, mõtiskledes nende tõhususele ja mõjule rahvusvahelise arengu ja julgeoleku kontekstis."}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "86cade04-4451-c2e9-30a9-06e846317d12", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "2063c93f-3592-50f6-5d9e-6fbe14dacedf", "parent_code": "SORG.04.015", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}