{"uuid": "d5a635c2-7108-1713-cde3-595555a34742", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-09T08:37:36", "title": {"en": "Basics of Academic Research", "et": "Teadustöö alused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 14, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 64, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course introduces the mechanism of the composition of the academic texts, starting from the sources used and ending with the idea, structure and formulation of the text.  In seminars students have to present several assignments, which are aimed at increasing their capability of finding academic sources, critical analysis of academic texts and good academic writing.", "et": "Kursuses tutvustatakse akadeemiliste tekstide koostamise mehhanismi, alates kasutatavatest allikatest kuni töö mõtte, struktuuri ja vormistuseni. Seminaride käigus esitavad tudengid mitu kodutööd, milles nad õpivad leidma andmebaasidest akadeemilisi allikmaterjale ning akadeemilisi tekste kriitiliselt analüüsima ja korrektselt vormistama."}, "objectives": [{"en": "- to give an overview of the main ethical and practical principles of academic writing\n- to give an overview of the methods and structure of academic writing\n- to increase the motivation of the students to be engaged with academic writing by practical exercises and by professional examples", "et": "- anda bakalaureuseõppe ainetes uurimistööde kirjutamiseks vajalikke baasteadmisi ja -oskusi;\n- anda ülevaade teadustööde kirjutamise eetilistest ja praktilistest põhimõtetest;\n- anda ülevaade kõigist akadeemilise uurimistöö koostisosadest ning olulisematest uurimistöö kirjutamisprotsessi osadest;\n- harjutada ja arendada teadustööde kirjutamise oskust praktiliste harjutuste vahendusel."}], "learning_outcomes": [{"en": "The student who successfully passes the course:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "- is able to differentiate the component parts of the academic argumentation and understands the structure of the academic argumentation", "et": "- oskab eristada akadeemilise argumentatsiooni erinevaid osasid ning tunneb akadeemilise argumentatsiooni struktuuri;"}, {"en": "- is capable of finding academic sources and to formulate his or her own argumentation based on these sources", "et": "- oskab leida akadeemilisi allikmaterjale ning nendele toetudes argumenteerida;"}, {"en": "- has analysed critically academic texts and has also experienced academic criticism regarding his or her own text", "et": "- oskab teadustekste kasutada ning nende põhjal koostada uurimistööd"}], "notes": {"et": "Aine toimub auditoorselt kontaktõppena. Kontaktõppes osalevad üliõpilased peavad kinni ülikooli poolt seatud nõuetest õppetöös osalemiseks. Vajadusel (pandeemia ja piirangute süvenedes) korraldatakse aine distantsõppes."}}, "grading": {"independent_work": {"et": "Uurimistööd esitage kursuse Moodle'i leheküljel.\n1. uurimistöö ülesanne. Valige uurimistöö teema. Kitsendage valitud teema piisavalt ehk selliseks, et ta on uurimise teostamiseks valmis. Teadusajakirjadest leitud ja uurimistöös kasutatavatest 10st allikast vormistage korrektne kasutatud kirjanduse nimekiri. Esitage uurimistöö teema nimetus, lühikokkuvõte (vt kolmanda loengu konspekt) ning korrektselt vormistatud kasutatud kirjanduse nimekiri töös kasutatavatest allikatest. Selles ja järgnevates uurimistöö ülesannetes võib kasutada vähemalt kümmet ja AINULT eelretsenseeritud ajakirjadest pärinevat teadusartiklit (allikana ei tohi kasutada ajakirjandust, teatmeteoseid, võrguteavikuid, Wikipediat, Economisti ega raamatuid). Hindamine on arvestuslik, arvestatuks loetakse ainult selliseid töid, milles kasutatud kirjanduse nimekiri on nõuetekohaselt vormistatud. \n2. uurimistöö ülesanne.  Esitage 1 lehekülje pikkune osa oma uurimistöö tekstist, milles kasutate (korrektselt, vastavalt läbitud õppematerjalidele) refereeringuid, tekstisisest viitamist ja vähemalt üht tsitaati (tsitaat võib olla osa lausest). Korrektselt vormistatud (ja selles tekstiosas viidatud allikaid loetlev) kasutatud kirjanduse nimekiri on lisaks ühele leheküljele tekstile. Hindamine on arvestuslik, arvestatuks loetakse ainult selliseid töid, milles on korrektselt kasutatud tekstisisest viitamist ja allikate kasutust (sh refereerimist). \n3. ülesanne. Esitage kõikidele kursusel käsitletud nõuetele vastav uurimustöö (sh esitlusstiilis \"väide-põhjendus-näide/andmed\"). Töö vormistage korrektselt koos kõikide koostisosadega: pealkiri, sisukord, põhjendatav väide, loogiline jaotus alateemadeks, üleminekud ühelt teemalt või lõigult teisele, kokkuvõte, kasutatud kirjandus. Kodutöös kasutage tekstisisest viitamist. Hindamine toimub vastavalt hindamiskriteeriumitele."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Neli testi loengukonspektis ning lisamaterjalides oleva ja auditoorselt käsitletu teadmiste tundmise ja oskuste valdamise üle."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Valige uurimistöö teema. Kitsendage valitud teema piisavalt ehk selliseks, et ta on uurimise teostamiseks valmis. Teadusajakirjadest leitud ja uurimistöös kasutatavatest 10st allikast vormistage korrektne kasutatud kirjanduse nimekiri. Esitage uurimistöö teema nimetus, lühikokkuvõte (vt kolmanda loengu konspekt) ning korrektselt vormistatud kasutatud kirjanduse nimekiri töös kasutatavatest allikatest. Selles ja järgnevates uurimistöö ülesannetes võib kasutada vähemalt kümmet ja AINULT eelretsenseeritud ajakirjadest pärinevat teadusartiklit (allikana ei tohi kasutada ajakirjandust, teatmeteoseid, võrguteavikuid, Wikipediat, Economisti ega raamatuid). Hindamine on arvestuslik, arvestatuks loetakse ainult selliseid töid, milles kasutatud kirjanduse nimekiri on nõuetekohaselt vormistatud."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Esitage 1 lehekülje pikkune osa oma uurimistöö tekstist, milles kasutate (korrektselt, vastavalt läbitud õppematerjalidele) refereeringuid, tekstisisest viitamist ja vähemalt üht tsitaati (tsitaat võib olla osa lausest). Korrektselt vormistatud (ja selles tekstiosas viidatud allikaid loetlev) kasutatud kirjanduse nimekiri on lisaks ühele leheküljele tekstile. Hindamine on arvestuslik, arvestatuks loetakse ainult selliseid töid, milles on korrektselt kasutatud tekstisisest viitamist ja allikate kasutust (sh refereerimist)."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Esitage kõikidele kursusel käsitletud nõuetele vastav uurimustöö (sh esitlusstiilis \"väide-põhjendus-näide/andmed\"). Töö vormistage korrektselt koos kõikide koostisosadega: pealkiri, sisukord, põhjendatav väide, loogiline jaotus alateemadeks, üleminekud ühelt teemalt või lõigult teisele, kokkuvõte, kasutatud kirjandus. Kodutöös kasutage tekstisisest viitamist. Hindamise kriteeriumid: \n1. NÕUETELEVASTAVUS. AUS JA KORREKTNE VORMISTUS. Plagiaat või akadeemiline petturlus ebakorrektselt vormistatud  viitamise vormis = kursuse hinne F, kogu töö tulemus 0. Ebakorrektselt vormistatud (tekstisisene viitamine või kasutatud kirjanduse nimekiri) tööd ei kuulu hindamisele.\n2. HEA STIIL, SELGE MÕTTEESITLUS ja -ARENDUS. Tekstis on üheselt arusaadav, kus on autori enda mõtted, kus kõnelevad viidatavad autorid ning kus on autori sõnastatud refereeringud. Viitamissüsteemi ühetaoline kasutus ja korrektne vormistusstiil (sh viitamine lehekülje täpsusega). Ei ole õigekirjavigu, isekõnelevaid tsitaate, kompilatsiooni. Kasutatud kirjanduses on autori eesnimi välja toodud. Tekstis esitatakse autori nimi esmakordsel nimetamisel koos eesnimega.\n3. FOOKUS ja SÕNUM. Teema piiritletus, analüüsitavus ja konkreetsus. Selge, konkreetne ja ühemõtteline sõnum. Allikate vastavus teemale. Selgelt sõnastatud ja ühemõtteliselt tajutav sõnum, mida ilmestavad nii pealkiri, alapealkirjad, töö struktuur, teemaarendus kui kokkuvõte.\n4. LOOGILINE STRUKTUUR ja SIDUS TEEMAARENDUS. Töö teeb, mida lubab teha, ei tee seda, mida ei luba teha ning seda, mida teeb, teeb süsteemselt ja sidusalt, analüüsivalt ja loogiliselt.\n5. VÄITED. Ei ole põhjendamata jäänud väiteid, põhjendus väidetele ei ole ühekülgne, ei ole ülevõimendatud või üle-üldistatud väiteid. [viimases kodutöös peab KOGU tekst olema esitatud stiilis väide-põhjendus-näide.]\n6. MAHT (alates sissejuhatusest kuni kokkuvõtteni, ehk tiitelleht ja kasutatud kirjanduse nimekiri on lisaks) minimaalselt 4 lk, maksimaalselt 6 lk, Times New Roman, 12p, reavahe 1."}}], "grade_preconditions": {"et": "Kodutööde õigeaegne esitamine, kodutööd on korrektselt ja nõuetekohaselt vormistatud.\nTestide positiivne koondtulemus (üle 24ne 48st võimalikust)."}, "grade_evaluation": {"et": "Neli testi loengukonspektis oleva ja auditoorselt käsitletu üle (a 12 %)  - 48% \nUurimistöö ülesanne nr 1. - 11% (hindamine on arvestuslik)\nUurimistöö ülesanne nr 2. - 11%\nÜlesanne nr 3 - 30% (hindamisele pääsemiseks peab kodutöö olema korrektselt vormistatud, hindamine toimub vastavalt hindamiskriteeriumitele)\n\n\nHinne kujuneb erinevate elementide eest kokku saadava summa alusel: A 91-100 punkti, B 81-90 punkti, C 71-80 punkti, D 61-70 punkti, E 51-60 punkti, F - 50 punkti või vähem."}, "debt_elimination": {"et": "Hilinenud kodutöid vastu ei võeta, kui töö esitamise tähtajaks ei ole õppejõudu teavitatud mõjuvast mitte-esitamise põhjusest.\nTestid sooritatakse loengukavas ettenähtud aegadel."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "16931151-761c-460f-90e5-e72ec138f01e", "type": "MOODLE", "code": "SORG.00.001", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Õppejõu poolt koostatud loengu konspekt.", "recommended_materials": "Isaac, Joel (2012) Working Knowledge : Making the Human Sciences from Parsons to Kuhn. Boston, MA: Harvard University Press. (ebrary)\nLee Abbott, Martin (2013) Understanding and Applying Research Design. Somerset, NJ: Wiley. (ebrary)\nHartley, James (2008). Academic Writing and Publishing: A Practical Handbook. London: Routledge.\nBailey, Stephen (2004). Academic Writing: A Practical Guide for Students. London: Routledge.\nScott, Gregory M.; Garrison, Stephen M. (2000) The Political Science Student Writer's Manual. 3rd Ed. Upper Saddle River: Prentice Hall.\nGermov, John (2000) Get Great Marks for Your Essays. Allen & Unwin: Crows Nest.\nCantor, Jeffrey A. (1993) A Guide to Academic Writing. Westport, CT: Praeger. \nSchmidt, Diane E. (1993) Expository Writing in Political Science: A Practical Guide. New York: Harper Collins Publishers."}, "participants": {"lecturers": [{"person_uuid": "916e0d62-bdc5-ee22-b222-c6fa03673455", "person_name": "Helen Urmann", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2,4,6,8,10,12,14,16"}, "entries": [{"course_week": 2, "time": "2024-09-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "1. Loeng. Sissejuhatus ainesse. Õppimine ülikoolis. Kirjutamistõrge. Kirjutamise edasilükkamine. Kirjutamine kui idiosünkraatiline tegevus. Monomaania. Hea akadeemilise töö tunnused. \nEnne loengut loe: ainekava ja 1. loengu konspekt, tutvu Moodles testi ning videoga."}}, {"course_week": 4, "time": "2024-09-23", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "2. Loeng.  Iseseisva uurimustöö juhend. Uurimustöö hindamiskriteeriumid. Teemavalik. Teema kitsendus. Teadusallikate leidmine ülikooli andmebaasidest (andmebaasid, märksõnad).   \nEnne loengut loe: 2. loengu konspekt."}}, {"course_week": 6, "time": "2024-10-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "3. Loeng. Vormistus. Lühikokkuvõtte kirjutamine. Kasutatud kirjandus. Viitamine tekstis (joonealune ja tekstisisene. Akadeemiline eetika (plagiaat, petturlus, kompilatsioon). \nEnne loengut loe: 3. loengu konspekt. \nTest 1."}}, {"course_week": 8, "time": "2024-10-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "4. Loeng.  Allikate põhjal \"oma teksti\" kirjutamine (faktid, andmed, üldiselt teadaolev, tsitaat, refereering). Refereerimine ilma allikteksti mõtet moonutamata või võimendamata. Allikate kriitiline hindamine. Hea teemavaliku välimääraja. Sisukord ja struktuur. Alapealkiri. Lõik. Kokkuvõte. Sissejuhatus. \nEnne loengut loe: 4. loengu konspekt. \nTest 2. \nESIMESE uurimistöö ülesande esitamine Moodlesse."}}, {"course_week": 10, "time": "2024-11-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "5. Loeng.  Uurimusküsimus. Hüpotees. Politoloogia erialalised mõisted. Töö tulemuste (ja järelduste) põhjendatus. Argumentatsiooni osad. Hea ja halva argumendi välimääraja.\nEnne loengut loe: 5. loengu konspekt. \nTest 3. \nTEISE uurimistöö ülesande esitamine Moodlesse."}}, {"course_week": 12, "time": "2024-11-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "6. Loeng. Teksti toimetamine ja sidustamine. Tulemuste esitlus stiilis \"väide-põhjendus-näide\". \nEnne loengut loe: 6. loengu konspekt. \nTest 4."}}, {"course_week": 14, "time": "2024-12-02", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 7, "topic": {}, "description": {"et": "Iseseisev uurimustöö kirjutamine, auditoorset tundi ei toimu. \nKOLMANDA uurimistöö ülesande esitamine Moodlesse."}}, {"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "Uurimistööde kättesaamine ja individuaalne tagasiside."}}]}, "registration_info": {"audience": {}, "min_students": 15}, "parent_uuid": "92a6b698-c360-e3b3-2c3b-4e4a453bcda0", "parent_code": "SORG.00.001", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}