{"uuid": "940aafb7-3d03-1d2c-7339-f42335584994", "code": "SORG.00.069", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Internship", "et": "Praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students may obtain an internship in the state civil service, media outlets, international organisations, local municipalities, third sector units, etc. Internship may be also conducted in the form of fieldwork, data mining, research and teaching assistance. Interns are expected to work closely with both their academic and site supervisors. At the conclusion of the internship period, the site supervisor forwards a written and signed evaluation of the student's performance.", "et": "Praktika on valikaine, mille läbimisel on üliõpilasel võimalik saada 3 EAP. Praktika loetakse sooritanuks, kui üliõpilane on teinud erialast tööd riigi keskvalitsuses (ministeeriumid), meediaorganisatsioonides (ajalehtede ja ajakirjade toimetused, telejaamade uudistetoimetused), Riigikogus (komisjonid, fraktsioonid jt.). Lisaks eelnevalt nimetatud institutsioonidele on praktikat võimalik sooritada ka rahvusvahelistes organisatsioonides, suurtes eraorganisatsioonides, kohalikes omavalitsustes, mitteriiklikes organisatsioonides jne. Taolistel juhtudel toimub praktika arvestamise arutelu iga konkreetse juhtumi puhul eraldi. Praktikana arvestatakse ainult erialast tööd."}, "objectives": [{"en": "The primary goal of an internship is to provide the student with the opportunity to apply knowledge gained in the classroom to solve practical real-world problems in a professional setting.", "et": "Praktika eesmärgiks on võimaldada magistrantidel oma erialaseid teadmisi rakendada organisatsioonides ja töökollektiivides."}], "learning_outcomes": [{"en": "Upon completing the internship, the students will:\n- know standard operating procedures and best practices applied in public/private/non-governmental professional settings dealing with international relations;\n- develop professionally relevant competencies and relationships in a professional setting;\n- understand professional organisational culture;\n- demonstrate communication skills, cognitive skills and teamwork.", "et": "Aine läbinu:\n- tunneb rahvusvaheliste suhete ja/või võrdleva poliitika  häid tavasid Eestis;\n- oskab iseseisvalt analüüsida rahvusvaheliste suhete ja/või võrdleva poliitika valdkonda puudutavat informatsiooni, oskab välja tuua vastuolusid ning põhjendada esitatud seisukohti;\n- oskab nõuetekohaselt vormistada kirjalikke aruandeid ning kokkuvõtvaid seisukohti suuliselt esitada ja kaitsta."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}