{"uuid": "0634e3d4-a25d-2fdd-ef7e-fb023f82d8f0", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-05T11:38:43", "title": {"en": "European Union Politics", "et": "Euroopa Liidu poliitika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}, {"code": "bachelor_master", "et": "integreeritud bakalaureuse- ja magistriõpe", "en": "integrated bachelor's and master's studies"}], "hours": {"lecture": 16, "practice": 4, "seminar": 10, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The lectures will provide a general and multifaceted overview on the political-institutional developments of the EU and its history. In particular the following aspects will be discussed: the integration process over time, the most recent institutional developments, the EU's theoretical foundation and the main related concepts, the Union's institutional, political, and economic nature, and the tension between \"widening\" and \"deepening\".  Group discussion is favoured.", "et": "Loengud annavad üldise ja mitmetahulise ülevaate EL-i poliitilis-institutsionaalsetest arengutest ja ajaloost. Iseäranis keskendutakse järgmistele küsimustele: lõimumisprotsessi dünaamika, kõige tähtsamad hiljutised institutsionaalsed arengud, EL-i teoreetiline alus ja sellega seotud mõisted, Liidu institutsiooniline, poliitiline ja majanduslik olemus ning pinged \"laienemise\" ja \"süvenemise\" vahel. Auditoorses tegevuses kasutatakse arutelusid rühmades."}, "objectives": [{"en": "The aim of this course is to give an overview and a clear understanding of the political, institutional, and historical dimensions of the EU and of European integration. Part of the course investigates and discusses different theoretical perspectives, thereby enabling students to understand and interpret the recent transnational developments critically. A part of the course is devoted to the understanding and problematization of some of the most controversial contemporary issues such as the current economic crisis in the Eurozone, prospects for further political integration, and enlargement.\nCORE QUESTIONS:\n- What is the EU?\n- What are the main institutions of the EU and how do they work?\n- How are decisions and policies made in the EU?\n- Where is the EU going? How sustainable it is in the long term?\n- Which are the lessons that can be learned from the past mistakes in the process of European integration?\n- What is Estonia's role in the EU?\n- How far should/can European integration go?\n- Is the EU democratic and legitimate?", "et": "Kursuse eesmärgiks on anda ülevaade ja selge arusaamine Euroopa Liidu ja Euroopa integratsiooni poliitilistest, institutsionaalsetest ja ajaloolistest mõõdetest. Osa kursusest uurib erinevaid teoreetilisi lähenemisi, mis võimaldavad tudengitel mõista ja kriitiliselt tõlgendada aktuaalselseid transnatsionaalseid arenguid. Osa kursusest tegeleb kõige vastuolulisemate teemade mõistmisega, nagu eurotsooni majanduskriis ning väljavaated jätkuvaks poliitilise integratsiooni ja laienemiseks."}], "learning_outcomes": [{"en": "At the end of the course, student will have a solid understanding of the nature, foundation, history, and overtime institutional and political developments of the EU. They will have developed a critical perspective on the major achievements of European integration and will be able to problematize the most relevant EU-related issues.", "et": "Kursuse lõppedes mõistab tudengil põhjalikult Euroopa Liidu olemust, aluseid, ajalugu ning institutsionaalseid ja poliitilisi arenguid. Tudeng on omandanud kriitilise vaate Euroopa integratsiooni suurimate saavutuste osas ning on võimeline problematiseerima kõige olulisemaid EL-iga seotud küsimusi."}, {"en": "By the end of the course students are expected to:", "et": "Kursuse lõppedes tudeng:"}, {"en": "- Be familiar with the EU development and structure", "et": "- tunneb ELi arengud ja struktuuri"}, {"en": "- Critically read the institutional and political developments EU and discuss the future trajectories", "et": "- hindab kriitiliselt EL-i institutsioonilisi ja poliitilisi arenguid ja arutab kriitilised EL-i tulevikuarengusuundi"}, {"en": "- Contextualize the EU within the debate on federalism, inter-governamentalism, functionalism, etc. ", "et": "- kontekstualiseerib EL-i föderalismi, valitsustevahelisuse, funktsionalismi jt lähenemiste valgel"}, {"en": "- Be able to discuss the most recent and most relevant pan-European issues", "et": "- oskab arutleda kõige hiljutisemate ja olulisemate üle-euroopaliste küsimuste üle"}, {"en": "- Understand (and problematize) the democratic and political process in the EU", "et": "- mõistab ja oskab tõstatada küsimusi ELi demokraatliku ja poliitilise protsessi kohta"}, {"en": "- Be familiar with the EU policy-making", "et": "- on kursis EL-is toimuva poliitiliste otsuste tegemise protsessiga ja selle tulemitega."}], "notes": {"et": "This course is developed and implemented with the support of the Jean Monnet Module \"Neighbourhood Enlargement and Regionalism in Europe\" (NearEU). The project has received funding from the European Union's Erasmus+ Jean Monnet programme under Grant Agreement 620279-EPP-1-2020-1-EE-EPPJMO-MODULE.\n\nKui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}}, "grading": {"independent_work": {"et": "The final evaluation will be based on the assessment of different learning components: written critical review (2),  preparation of the simulation/negotiation exercise (1), and final test (1)."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Final written exam: The last class meeting will be devoted to a final written exam. It consists of a mix of open and closed questions addressing the main dimensions discussed during the course."}}, {"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "In the last meeting students will be involved in a negotiating exercise of the Council of the EU where the knowledge and notions acquired during the lectures and the seminars are tested and put into practice. In particular, students are grouped as representatives of Member States. Students' activism is taken into account and the preparation of the material assessed on a differentiated basis."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Written assignments: Throughout the course, students are expected to submit two short critical assessments based on the proposed articles (around 600 words). A collective discussion will follow during the successive class meeting."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "In order to be considered for the final assessment, students are expected to attend at least 4/5 of the classes and actively participate to class activities, submit at least 1 of the 2 written critical review, and prepare the material for the simulation/negotiation exercise."}, "grade_evaluation": {"et": "All the components of the final evaluation will be assessed according to an A-E(F) grading scale.\n\nThe components of the final evaluation will weight in the definition of the final grade according to the following percentages and distribution of points:\n\nWork description: Max. points\nWritten critical review (30% of the final grade): 30\t\nFinal test (40% of the final grade): 40\nPreparation of simulation/negotiation exercise (30% of the final grade): 30\nTotal max: 100\n\nThe required threshold to pass is 51 points, while the final grade is computed as follows:\n\nGrade\tPoint range\nA (Excellent)\t100-91\t\nB (Very good)\t90-81\t\nC (Good)                80-71\nD (Satisfactory)     70-61\nE (Acceptable)       60-51\nF (Fail)\t                  50-0\n\t\t\nREQUIREMENTS:\n1.\tStudents are expected to attend all course meetings and to come to class well prepared to discuss the readings.\n2.     Students who are not satisfied with the outcome of the final written exam and wish improve their course grade can submit a 4-page critical review of a short reading previously agreed with the instructor. A max of 5 points can be added to the final grade according to the quality of the review.\n3.     Plagiarism is not tolerated and can lead to failing the course. More details are available at www.plagiarism.org\n4. The use of systems based on artificial intelligence (including, but not limited to, ChatGPT) for the development, drafting, and production of written assignments within the framework of this course is considered academic fraud, unless explicitly authorized by the instructor. If in doubt, contact the instructor.\n\nNOTE\nIf you are a special needs student and need adjustments in your studies, please consult with the website https://ut.ee/en/content/counselling-students-special-needs and turn to the Special Needs Adviser. It is strongly recommended that you make the appointment as early as possible before the beginning of the semester."}, "debt_elimination": {"et": "Students who are not satisfied with the outcome of the final written exam and wish improve their course grade can submit a 4-page critical review of a short reading previously agreed with the instructor. A max of 5 points can be added to the final grade according to the quality of the review."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Articles and readings for the seminars and lectures will be made available via the Moodle environment in due time\n\nTextbook: John McCormick. European Union Politics. Palgrave McMillan", "recommended_materials": "Students' independent work is a key and fundamental element of the course. It is fundamental for a successful and proficient learning process and - as such - it will be evaluated and assessed during every meeting. Students are expected to work independently between sessions. This is crucial both in order to better interiorize the notions and experiences acquired during the preceding session (i.e. individual reflection on the results of the class discussion and application of the introduced research methods) and to prepare the informative background necessary to successfully participate to the successive meeting (preparations for the discussions in class)."}, "participants": {"lecturers": [{"person_uuid": "88dc55da-3957-ca43-2bf8-28ea2a626f60", "person_name": "Stefano Braghiroli", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Introduction and description of the course\nConstruction of the European Union (1950s - 1970s)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Construction of the European Union (1980s- 1991)"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Construction of the European Union (1992 - today)"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar discussion: Construction of the European Union: Constitutional Treaty, Lisbon Treaty, and potential future trajectories"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The European Commission"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The European Parliament"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The Council of the EU and the European Council"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar discussion: tracking the legislative process of different portfolios"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "EU foreign and security policy"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The enlargement process: deepening and widening"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The Euro and the Eurozone"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar discussion: Ukraine's future in the European Union"}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "Final written exam"}}, {"work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "SIMULATION OF DECISION MAKING"}}]}, "registration_info": {"audience": {"et": "Riigiteaduste bakalaureuseõppekava üliõpilased ja kõik huvilised"}, "min_students": 15, "max_students": 70}, "parent_uuid": "c4cc0d27-5b97-629e-4489-4831b73a3813", "parent_code": "SORG.00.075", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}