{"uuid": "e59d3d94-2d87-a01e-0276-fb0ce770e752", "code": "SORG.00.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to PhD Studies in Political Science", "et": "Sissejuhatus doktoriõpingutesse politoloogias"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This compulsory course in the PhD programme prepares new doctoral students for the period of intensive doctoral studies ahead of them. It not only facilitates a clearer sense of the own project and the writing of a dissertation prospectus (to be defended at the end of the first year), but also introduces doctoral candidates to the life of the advanced academic researcher and teacher.", "et": "Doktorantidele on seminarid kohustuslikud. Seminarid aitavad oma teadustööd mõtestada ning ainekursuse lõpuks peab valmima doktoritöö laiendatud kavand, mida kaitstakse avalikult 1. aasta lõpus."}, "objectives": [{"en": "The objective of the course is to help PhD students acquire the knowledge, skills and competences that are necessary for successfully completing PhD studies in the field of Political Science and for working as a researcher or top-level specialist in the field.", "et": "Kursuse eesmärk on aidata doktorandil omandada teadmised, oskused ja pädevused, mis on vajalikud doktoriõppe edukaks läbimiseks politoloogia erialal ning teadlase või tippspetsialisti töös politoloogia valdkonnas."}], "learning_outcomes": [{"en": "Upon completion of the seminar, students should:\n-be familiar with the Political Science specialization module of the Social Sciences PhD program and be able to make informed choices about which courses to take; should know the requirements and structure of courses belonging to the specialization module. \n- have a better understanding of what a political science dissertation \"looks like\" and how to go about writing one; be aware of typical difficulties and problems as well as ways to avoid/address these;\n- be familiar with general criteria/standards that a research article should meet; be able to make informed choices about where to submit your article; understand the peer review and publication process; be aware of relevant publication classification systems;\n- be familiar with the evolution and developments of political science as well as with the various recent trends in IR and Comparative politics; \n- be familiar with the main professional associations in the discipline, as well as major political science conferences; be able to make informed choices about which conferences to attend; know what to expect and how to benefit from conference participation;\n- get a sense for the many roles a political scientist may assume in academia, society and state institutions; be aware of the possible challenges and opportunities a PhD in political science may pose in finding jobs outside the world of academia \n- have a more thorough understanding of  key issues related to teaching in higher education, be aware of standards and recommended practices; be able to design a syllabus for a BA-level course that reflects this knowledge; feel more confident about your own (prospective) teaching.", "et": "Ainekursuse läbinu:\n- on kursis politoloogia erialamooduliga sotsiaalteaduste doktoriprogrammis, oskab erialaaineid valida ning on kursis erialaainete nõudmiste ja ülesehitusega;\n- teab nõudeid doktoritööle politoloogia erialal, oskab teha tulemuslikku koostööd juhendajaga ning on koostanud ja kaitsnud oma doktoritöö laiendatud kava;\n-  on kursis publitseerimise nõuete ja tavadega politoloogia erialal; omab ülevaadet eriala juhtivatest ajakirjadest ja oskab valida ajakirja, kuhu  artikkel esitada;\n- tunneb politoloogia distsipliini ajaloolist arengut ning olulisemaid trende tänapäeval;\n- teab peamisi erialaseid organisatsioone ning konverentse;\n- on tuttav politoloogi erinevate rollidega ühiskonnas;\n- tunneb ja teaduseetika põhimõtteid ja järgib neid erialast teadustööd tehes;  \n- on kursis õpetamise ja juhendamise heade tavade ja standarditega valitud erialal;\n- omab ülevaadet erialase teadustöö rahastamise võimalustest ning tunneb taotluste koostamise ja grandiprojekti juhtimise olulisemaid põhimõtteid ja protsesse."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}