{"uuid": "9f261c3e-8a96-a76f-6379-629b1a95dd8a", "code": "SORG.00.064", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "International Political Economy", "et": "Rahvusvaheline poliitökonoomia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course consists of two broad halves. The first gives an overview of the issue areas inn the field of political economy. The issues to be discussed include trade, finance, innvestments, globalisation and development. The second half of the course gives and overview of the major theoretical schools of political economy like liberalism, nationalism and Marxism.", "et": "Aine koosneb üldiselt kahest osast. Kõigepealt annab ta ülevaate peamistest rahvusvahelise poliitökonoomia probleemidest ja valdkonnast. Käsitlusele tulevad valdkonnad nagu kaubandus, rahandus, investeeringud, globaliseerumine ja areng. Kursuse teises pooles saavad tudengid ülevaate peamistest poliitökonoomia teooriatest nagu liberalism, natsionalism ja marksism."}, "objectives": [{"en": "General purposes of the course are:", "et": "Kursuse eesmärkideks on:"}, {"en": "- To introduce main research areas of political economy;", "et": "- Tutvustada poliitökonoomia uurimisvaldkonda;"}, {"en": "- To introduce and analyze main theoretical concepts and models of political economy;", "et": "- Tutvustada ja mõtestada poliitökonoomiat seletavaid teoreetilisi kontseptsioone ja mudeleid;"}, {"en": "- To introduce and analyze centrsl issues and major actors of the field and to connect them to main theoretical schools.", "et": "- Tutvustada ja analüüsida keskseid küsimusi ning tegutsejaid rahvusvahelises poliitökonoomias ning seostada nene seletusi teoreetiliste kontseptsioonidega."}], "learning_outcomes": [{"en": "Main learning outcome is a transferable skill of analysis. When completing the course a student will be able to find relations between political and economic variables and analyse how these two sets of variables interact. Student knows main terminology of the field and finds one's way in variables and theories. During the course, the student must complete written and oral tasks hence developing respective communication skills.", "et": "Peamine kursuselt saadav oskus on ülekantav analüüsioskuks. Kursuse läbide oskab üliõpilane \notsida ja leida seoseid poliitiliste ja majanduslike muutujate vahel ning analüüsida, kuidas need omavahel seotud on ja üksteist mõjutavad. Ta tunneb aine peamist terminoloogiat ning orienteerub muutujates ja teooriates. Kursuse käigus peab üliõpilane esitama kirjalikke töid ning osalema seminarides, mis lihvib tema kirjalikku ja suulist väljendusoskust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}