{"uuid": "0fe9e56a-2ed1-622b-1faf-ea22878ad079", "code": "SVHI.00.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Complex Exam", "et": "Lõpueksam"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 4, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Topics: research questions, research strategy, finding and analysing evidence based information, data collection methods, data analysis methods, action research, self-analysis, proof of competence, reflection, academic discussion.\n\nComplex exam will be composed with the support of a supervisor. The problem statement is coordinated with supervisor and discussed in the subject of \"Evidence based research and development of practice\".  The complex exam is written according to the rules and regulations of the Institute of Education.", "et": "Lõpueksam on kahest osast koosnev komplekseksam. Esiteks tuleb koostada vanemõpetaja, tase 7 portfoolio ja teiseks läbi viia tegevusuuring ja selle tulemusi avalikult kaitsta. Portfoolio koostatakse vastavalt õpetajate kutse andja juhistele. Selle koostamist toetatakse lõpueksami seminaris. Tegevusuuringus käsitletakse õppija töökohal olulist probleemi, mis kooskõlastatakse ja arutatakse läbi juhendava õppejõuga. Tegevusuuring koostatakse vastavalt Haridusteaduste instituudis kehtivatele nõuetele. Tegevusuuringu läbiviimise metoodika omandamist toetatakse tõenduspõhise praktika uurimise ja arendamise õppeaines."}, "objectives": [{"en": "The aim is to support learners' knowledge and skills on planning and carrying out action research in the area of inclusive education. Support the analysis and practical application of theoretical knowledge and personal experiences.", "et": "Õppeaine eesmärkideks on:\n- võimaldada õppijal teadmiste ning oskuste süvendamist kaasava hariduse valdkonna tegevusuuringu kavandamisest ja läbiviimisest;\n- võimaldada õppijal omandada vilumused teoreetiliste teadmiste ja isiklike kogemuste teadlikuks analüüsimiseks ning rakendamiseks praktikas."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "The learner can carry out educational action research (6 ECTS) and to analyse its results; the learner can carry out self-analysis in the context of professional development and composes self-analysis portfolio (9 ECTS).", "et": "Õppija oskab läbi viia haridusvaldkonnas tegevusuuringut (6 EAP) ning analüüsida selle tulemusi; õppija oskab läbi viia eneseanalüüsi oma professionaalse arengu kontekstis, koostades selleks portfoolio (9 EAP).\n\nLõpueksami läbinud üliõpilane:\n- oskab püstitada kaasva haridusega seotud uurimisküsimusi ning valida tegevusuuringu läbiviimiseks sobiva uurimisstrateegia;\n- oskab leida ja kriitiliselt analüüsida teaduslikku infot;\n- oskab rakendada sobivaid andmekogumis- ja andmeanalüüsi viise uurimisprobleemile lahenduse leidmiseks;\n- oskab loogiliselt ja otstarbekalt struktureeritud tegevusuuringus ning eneseanalüüsis oma mõtteid arusaadavalt ning argumenteeritult sõnastada;\n- oskab oma tööd analüüsida ja vaneõpetaja kompetentse tõendada;\n- reflekteerib oma professionaalset arengut, kogudes oma tegevuse kohta tagasisidet;\n- on suuteline esitama ja kaitsma akadeemilises diskussioonis oma vanemõpetaja portfoolios esitatud seisukohti."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}