{"uuid": "14fd63ec-7749-2350-e278-b2cd2785f491", "code": "SVHI.01.100", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Culturally Responsive Teacher", "et": "Kultuuritundlik õpetaja"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course, intercultural teaching competence is dealt with in depth, deepening the knowledge about involving students' culture into learning. It introduces culturally responsive and linguistically responsive teaching, addresses topics related to learning materials and the learning environment to acquire practical skills that support a multicultural learner. The focus of the subject is supporting the academic development of students with diverse backgrounds in such a way that subjective well-being is also ensured. The participants reflect on their competencies, acquire and create practical tools that support working in a multicultural classroom.", "et": "Õppeaine läbimise vältel tegeletakse sügavuti interkultuurilise õpetamispädevusega, süvendades teadmisi õppijate kultuuri kaasamise kohta. Tutvutakse kultuuritundliku ja keeletundliku õpetamisega ning käsitletakse õppematerjalide ja õppekeskkonnaga seotud teemasid, et omandada praktilisi oskusi mitmekultuurilise õppija toetamiseks. Õppeaines on fookuses erineva taustaga õppijate akadeemilise arengu toetamine selliselt, et ka subjektiivne heaolu oleks tagatud. Õppeaine läbija reflekteerib enda pädevuste üle ning omandab ja loob praktilisi tööriistu, mis mitmekultuurilises klassiruumis töötamist toetavad."}, "objectives": [{"en": "The aim of the course is to develop the participants' intercultural teaching competence by introducing the ways of involving student's culture, including the principles of culturally and linguistically responsive teaching.", "et": "Õppeaine eesmärk on arendada osalejate interkultuurilist õpetamispädevust tutvustades õpilase kultuuri kaasamise viise, sh kultuuri- ja keeletundliku õpetamise põhimõtteid."}], "learning_outcomes": [{"en": "1.\tDescribes why it is important to acknowledge the student's cultural background in the context of the Estonian educational landscape.", "et": "1.\tKirjeldab, miks on oluline õpilase kultuuritausta arvestada Eesti haridusmaastiku kontekstis. "}, {"en": "2.\tAnalyzes their own intercultural teaching competence. ", "et": "2.\tAnalüüsib enda interkultuurilist õpetamispädevust. "}, {"en": "3.\tExplains how culture is connected to learning and teaching.  ", "et": "3.\tSelgitab kultuuri seost õppimise ja õpetamisega. "}, {"en": "4.\tApplies intercultural teaching competence when planning learning activities. ", "et": "4.\tRakendab interkultuurilist õpetamispädevust õppetöö planeerimisel."}, {"en": "5.\tIdentifies elements of culturally responsive teaching. ", "et": "5.\tNimetab kultuuritundliku õpetamise põhimõtteid. "}, {"en": "6.\tIdentifies elements of linguistically responsive teaching. ", "et": "6.\tNimetab keeletundliku õpetamise põhimõtteid. "}, {"en": "7.\t.", "et": "7.\tToob näiteid kultuuri- ja keeletundliku õpetamise kohta. "}, {"en": "8.\tIdentifies and describes the elements of a learning environment that support the inclusion of the student's culture.", "et": "8.\tNimetab ja kirjeldab õppekeskkonna elemente, mis toetavad õpilase kultuuri kaasamist. "}, {"en": "9.      Associates the principles of culturally responsive teaching with intercultural teaching competence.", "et": "9.\tSeostab kultuuritundliku õpetamise põhimõtteid interkultuurilise õpetamispädevusega."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}