{"uuid": "04b6cd37-fd9b-f030-f03c-e98217fbf576", "code": "SVHI.00.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teacher's Identity and Agency", "et": "Õpetaja identiteet ja tegevusvõimekus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course introduces the learning professional approach and the teacher's professional agency model that are applied in the analysis of the student's life and learning experience to the creation of a teaching vision at the level of the individual and the group of teachers. Cultural, structural and material factors affecting the teacher's work, including regulations affecting the teacher's work, are introduced. Evidence-based methods are introduced to enhance collaboration with different parties. The possibilities of inquiry-based approach to support the professional development of teachers is analysed. The process of compiling educational regulations is discussed and the possibilities of contributing to it will be examined.", "et": "Ainekursusel tutvutakse õppiva professionaali käsitluse ja õpetaja tegevusvõimekuse mudeliga ning rakendatakse neid üliõpilase elukogemuse ja õpingute raames omandatud pagasi analüüsil ning õpetamise visiooni loomisel indiviidi ja õpetajate rühma tasandil. Tutvutakse õpetaja tööd mõjutavate kultuuriliste, struktuuriliste ja materiaalsete teguritega, sh õpetaja tööd mõjutavate regulatsioonidega. Kasutatakse tõenduspõhiseid meetodeid erinevate osapooltega koostöö tõhustamiseks. Analüüsitakse uurimusliku lähenemise võimalusi õpetaja professionaalse arengu toetamiseks. Tutvutakse haridusvaldkonna arengut suunavate dokumentide koostamisprotsessi ja sellesse panustamise võimalustega."}, "objectives": [{"en": "To support the development of the teacher's personal and collective agency and taking active role both in the teachers' community and in society.", "et": "Toetada õpetaja isikliku ja kollektiivse tegevusvõimekuse kujunemist ning aktiivse rolli võtmist nii õpetajate kogukonnas kui ka laiemalt ühiskonnas."}], "learning_outcomes": [{"en": "Student who has passed the subject:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) Understands how the teacher's agency and professionalism is formed.", "et": "1)\tMõistab, kuidas kujuneb õpetaja tegevusvõimekus ja professionaalsus."}, {"en": "2) Evaluates how his / her own biography, practical knowledge and values and attitudes allow him / her to work as a teacher.", "et": "2)\tHindab, kuidas tema enda elulugu, praktilised teadmised ning väärtused ja hoiakud võimaldavad tal töötada õpetajana."}, {"en": "3) Creates a vision of his / her teaching that integrates personal and professional long-term goals.", "et": "3)\tLoob oma õpetamise visiooni, mis seob personaalsed ja professionaalsed pikaajalised eesmärgid."}, {"en": "4) Understands how cultural, structural and material factors at different levels affect the work of a teacher.", "et": "4)\tMõistab, kuidas kultuurilised, struktuurilised ja materiaalsed tegurid erinevatel tasanditel mõjutavad õpetaja tööd."}, {"en": "5) Is able to apply evidence-based methods of teacher collaboration and inquiry-based approach to form teachers' shared professional knowledge and vision.", "et": "5)\tOskab rakendada tõenduspõhiseid õpetajate koostöö ja uurimusliku lähenemise meetodeid õpetajate jagatud erialase teadmuse ja visiooni kujundamiseks."}, {"en": "6) Is able to apply evidence-based methods for collaboration with learners' families and local community.", "et": "6)\tOskab rakendada tõenduspõhiseid meetodeid koostööks õppijate perede ja kogukonnaga."}, {"en": "7) Understands how educational regulations are developed and how to contribute to it, e.g. through professional associations and expert groups in the field.", "et": "7)\tMõistab, kuidas koostatakse haridusvaldkonna arengut suunavaid dokumente ja kuidas selles panustada, sh valdkonna ühenduste ja ekspertgruppide kaudu."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}