{"uuid": "13938011-9097-fe94-ab33-14ed55884ddc", "code": "SVHI.03.042", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methods of Scientific Research", "et": "Uurimistöö metodoloogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course consists of seminars and individual practical assignments, including working with literature in order to get familiar with different aspects of science methodology. The seminars deal with different steps of the research process: planning, designing and conducting research. Students will be informed about the principles of research design and basic quality requirements. The course provides an overview on both qualitative and quantitative research methods and the basics of statistical analysis of the data. Using research methods and planning research is practiced as individual assignments.", "et": "Ainekursus koosneb loengutest ning seminaridest ja iseseisvast tööst kirjandusega uute teadmiste omandamiseks ning uurimisülesannete praktiliseks lahendamiseks. Loengutes ja seminarides tutvutakse uurimistöö üldloogika, põhikomponentide ning kvaliteedikriteeriumitega, samuti käsitletakse uuringu kavandamise ja teostamise etappe. Saadakse ülevaade põhilistest kvalitatiivsetest ja kvantitatiivsetest meetoditest ning statistilise andmeanalüüsi alustest. Iseseisva tööna harjutatakse uurimismeetodite kasutamist ning uurimustöö kavandamist."}, "objectives": [{"en": "To support the acquisition of knowledge and skills about the methods needed for planning and conducting research in the field of special education and/or speech therapy", "et": "Toetada eripedagoogilise ja/või logopeedilise sisuga uurimistöö kavandamiseks ja koostamiseks vajalike metodoloogiliste teadmiste ning oskuste omandamist"}], "learning_outcomes": [{"en": "After that course student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- is aware of the principles in scientific research and knows the ethics of research ", "et": "- teadvustab olulisemaid teadustöö põhimõtteid ja tunneb teadustöö eetikat "}, {"en": "- understands the links between theory, hypothesis, research question, data, and data analysis", "et": "- mõistab, kuidas on omavahel seotud teooria, hüpotees, uurimisküsimus, andmed ja andmeanalüüs "}, {"en": "- is able to read critically and refer research papers and articles ", "et": "- on võimeline kriitiliselt lugema ja refereerima erialast kirjandust "}, {"en": "- is acquainted to the principles and steps in research design, and is able to plan research in the field of special education and/or speech therapy", "et": "- omab ülevaadet uurimisprotsessi etappidest ja oskab planeerida eripedagoogika ja/või logopeedia-alast uurimust"}, {"en": "- is able to collect and organize data by using different methods", "et": "- oskab koguda andmeid, kasutades selleks erinevaid meetodeid"}, {"en": "- knows the differences between qualitative and quantitative research methods, their main merits and demerits", "et": "- tunneb kvalitatiivsete ja kvantitatiivsete uurimismeetodite erinevusi, peamisi eeliseid ja puudusi "}, {"en": "- is able to choose appropriate research method regarding the nature of research question and gathered data", "et": "- oskab valida sobiva uurimismeetodi tulenevalt uurimisülesande laadist ja andmete iseloomust"}, {"en": "- is able to structure his/her master thesis/research paper properly", "et": "- oskab magistritööd/uuringuraportit õigesti üles ehitada"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}