{"uuid": "203b3268-6d6f-f8a1-db45-feaeb0745d6e", "code": "SVHI.01.056", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basic Practice", "et": "Põhipraktika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Completing the course supports professional development of the student by offering opportunities to integrate the studies with practical work in selected organisation. The student performs supervised and independent practice tasks in the work environment, reflecting the course of activities in the practice logbook. The acquired knowledge enables the student to integrate his/her knowledge and skills with practical work. The student completes the practice, taking account his/her field of specialization and additional competences. It is recommended to link the practice to the Master's thesis. Detailed conditions can be found in the practice guide.", "et": "Õppeaine läbimine toetab üliõpilase professionaalset arengut, luues võimalusi seostada ülikooliõpingud tervikuks praktilises professionaalses töös enda poolt valitud organisatsioonis. Üliõpilane täidab juhendatud ja iseseisvaid praktikaülesandeid töökeskkonnas, reflekteerides toimuvat praktikapäevikus.  Omandatud kogemused aitavad üliõpilasel seostada seniseid teadmisi ja oskusi praktilise tööeluga. Üliõpilane sooritab praktika, arvestades oma spetsialiseerumisvaldkonna ja lisapädevusega, samuti on soovituslik seostada praktika magistritööga. Täpsemad tingimused on esitatud praktikajuhendis."}, "objectives": [{"en": "The course has to general objectives which are achieved based on completed studies and supervision:", "et": "Õppeainel on kaks üldeesmärki, mis saavutatakse, tuginedes läbitud ülikooliõpingutele ja juhendamisele/supervisioonile:"}, {"en": "- to support student's development to a professional in the chosen field, offering opportunities to link previous studies with practice in the educational institution/organisation in an integrated manner;", "et": "- toetada üliõpilase kujunemist valitud suuna/valdkonna professionaaliks, luues võimalused eelnevalt läbitud õpingute terviklikuks seostamiseks praktilise tegevusega haridusasutuses/organisatsioonis;"}, {"en": "- create opportunities to experience the processes of learning, teaching and education, and the management of these processes as a whole within a compact study period.", "et": "- luua võimalused õppimise ja õpetamise ning kasvatustöö ja nende protsesside juhtimise kui terviku tundma õppimiseks ja läbiviimiseks kompaktse õppeperioodi vältel."}, {"en": "In addition, the course aims at facilitating field specific practice in a practice base, in order to integrate theoretical knowledge and methodical competence in the field with practical work in an educational institution/organisation.", "et": "Lisaeesmärk on võimaldada valdkonnaspetsiifiline praktika prartikabaaasis, integreerimaks valdkonna teoreetilisi teadmisi ja metoodilisi pädevusi praktilise tegevusega haridusasutuses/organisatsioonis."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- is able to plan, prepare, implement, analyse and evaluate his/her professional activity;", "et": "- oskab kavandada, ette valmistada, läbi viia, analüüsida ja hinnata oma professionaalset tegevust;"}, {"en": "- is able to direct attention to the individualities, previous knowledge, needs (incl. special needs) and interests of colleagues/learners; ", "et": "- oskab oma tegevusi kavandades ja läbi viies pöörata tähelepanu kolleegide/õppijate eripäradele, eelteadmistele, vajadustele (sh erivajadustele) ning huvidele;"}, {"en": "- plans his/her professional activities in a systemic, evidence-based and creative manner, according to relevant regulations, characteristics of the educational institution, level of education and/or study course, and needs and interests of the learners;", "et": "- kavandab oma professionaalseid tegevusi süsteemselt, tõenduspõhiselt ja loovalt, lähtudes asjakohastest regulatsioonidest, haridusasutuse, haridusastme ja/või õppeaine eripärast ning õppijate vajadustest ja huvidest;"}, {"en": "- integrates effectively knowledge, skills and attitudes acquired in university studies.", "et": "- integreerib tulemuslikult ülikooliõpingutes omandatud teadmisi, oskusi ja hoiakuid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}