{"uuid": "b7babb71-d17a-fda1-68e5-0e7c6c9df45a", "code": "SVHI.01.097", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Occupational Well-Being", "et": "Tööheaolu alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI01", "structural_unit_name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI01", "name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "email": "educ@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course, students will receive an overview of the psychological and social factors of the work environment. Participants will get to know the possibilities of assessing and managing the positive and risk factors of the work environment and preventing work stress and burnout.", "et": "Kursuse käigus saavad üliõpilased ülevaate töökeskkonna psühholoogilistest ja sotsiaalsetest teguritest ehk psühhosotsiaalsest töökeskkonnast. Tekib ettekujutus töökeskkonna positiivsete tegurite ja ohutegurite hindamise ja juhtimise ning tööstressi ja läbipõlemise ennetamise võimalustest."}, "objectives": [{"en": "To provide an overview of the psychological and social factors of the work environment and of the possibilities of promoting occupational well-being at both the organizational and employee level.", "et": "Anda ülevaade töökeskkonna psühholoogilistest ja sotsiaalsetest teguritest ning tööheaolu edendamise võimalustest nii organisatsiooni kui ka töötaja tasandil."}], "learning_outcomes": [{"en": "Upon completion of the course a student:", "et": "Õppeaine läbimisel üliõpilane:"}, {"en": "1. Knows the psychological and social factors of the work environment and the general requirements of occupational health.", "et": "1.\tTunneb töökeskkonna psühholoogilisi ja sotsiaalseid tegureid ning töötervishoiu üldnõudeid."}, {"en": "2. Explains the concepts and principles of promoting well-being at work and is able to apply them.", "et": "2.\tSelgitab tööheaolu edendamise mõisteid ja põhimõtteid ning oskab neid rakendada."}, {"en": "3. Applies the knowledge gained when drawing up a plan for the promotion of well-being at work.", "et": "3.\tRakendab töötaja ja organisatsiooni tasandi meetmeid tööheaolu edendamise kava koostamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}