{"uuid": "39a99e64-222b-ab6a-f817-aa4f152ee31b", "code": "SVHI.02.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Biological Diversity", "et": "Elu mitmekesisus"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course gives an overview of the structure of different organism groups (e.g. animals, plants, mushrooms), their systems, biology, adaptation, spread and endangerment. Skills necessary for teachers are practised in seminars and practical lessons by using different study methods.", "et": "Kursusel antakse ülevaade erinevate organismirühmade (nt loomad, taimed, seened) ehitusest, süsteemist, bioloogiast, kohastumustest, levikust ning ohustatusest. Õpetajatele vajalikke õpioskusi täiendatakse seminarides ja praktikumides erinevaid õpimeetodeid kasutades."}, "objectives": [{"en": "To introduce students to wildlife objects and phenomena related to them; to develop students' knowledge and skills of guiding children to notice, experience and explore the surrounding world.", "et": "Eluslooduse objektide ja nendega seotud nähtuste tundmaõppimine;  teadmiste ning oskuste kujundamine, et suunata lapsi märkama, kogema ning uurima ümbritsevat maailma."}], "learning_outcomes": [{"en": "On completion of the course the student:\n- knows the wildlife system and its diversity;\n- uses various sources for searching topic-related information;\n- explains the role of different organisms in the ecosystem and aspects related to their protection;\n- chooses and uses appropriate methods, activities and forms of classroom work while teaching the topics related to biological diversity in a preschool educational institution.", "et": "Aine läbinud üliõpilane:\n- tunneb eluslooduse süsteemi ja selle mitmekesisust; kasutab erialase info otsimiseks erinevaid allikaid, analüüsib ja hindab neis sisalduva info tõesust;\n- selgitab erinevate organismide rolli ökosüsteemis ning nende kaitsmisega seotud aspekte;\n- valib ja kasutab sobivaid meetodeid, tegevusi ja õppetöö vorme elu mitmekesisusega seotud teemade õpetamiseks koolieelses lasteasutuses."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}