{"uuid": "52be487d-26a0-39f2-d67b-af528df72efa", "code": "SVHI.00.016", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Inclusive Education", "et": "Kaasav haridus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course the knowledge of the concept and meaning of inclusive education, its effective implementation and inclusive school development strategies is obtained.\nThe main topics:\nThe concept and meaning of inclusive education. Inclusive school culture.\nLegislation-based school policy in implementing inclusive education. School documentation.\nSupport systems and co - operation within schools. Roles and responsibilities of different parties.\nInclusive learning environment and resources. Universal design. Proven strategies for implementing inclusive education.\nNetworks and the role of the teacher in the network.\nInclusive pedagogy and inclusive teacher.\nData collection and analysis to assess the quality of inclusive education.\nDevelopment of a strategic plan for inclusive school education.", "et": "Aine käigus omandatakse teadmised ja arusaamad kaasava hariduse tähendusest, tõhusa rakendamise võimalustest ning kaasava kooli arendustegevustest.\nLäbitavate teemade loetelu:\nKaasava hariduse mõiste ja tähendus. Kaasav koolikultuur.\nSeadusandlusel põhinev kooli poliitika kaasava hariduse rakendamisel. Kooli dokumentatsioon.\nTugisüsteemid ja koolisisene koostöö. Erinevate osapoolte rollid ja vastutus. \nKaasav õpikeskkond ja ressursid. Universaalne disain. Kaasava hariduse rakendamise tõendatud strateegiad.\nKoostöövõrgustikud ja õpetaja roll koostöövõrgustikus.\nKaasav pedagoogika ja kaasav õpetaja. \nAndmete kogumine ja analüüs kaasava hariduse kvaliteedi hindamiseks.\nKooli kaasava hariduse strateegilise plaani koostamine."}, "objectives": [{"en": "The aim of the course is to develop the readiness and necessary knowledge for meaningful implementation of inclusive education in school level.", "et": "On kujunenud valmisolek ning omandatud vajalikud teadmised kaasava hariduse tähenduslikuks rakendamiseks."}], "learning_outcomes": [{"en": "After the completing the course, the learner:\n- knows the principles and application possibilities of inclusive education at school level;\n- is familiar with legislation in the field of SEN, understands and uses the most common terminology used in the field of SEN;\n- knows the principles of preparation of documents guiding the development of the organization and is ready to participate in their planning and process management;\n- knows the features of an inclusive learning environment at the organizational level, is able to analyze them and prepare development activities;\n- is able to plan, monitor and evaluate his / her work as an inclusive teacher and plan self-development based on it.\n- knows his / her role in the work of cooperation networks, is able to create the necessary communication networks, make cooperative decisions and analyze the effectiveness of cooperation;\n- is able to analyze the key components of an inclusive school and their interaction in the school;\n- is able to assess the development needs of an educational institution in the field of inclusive education;", "et": "\"Aine läbinud õppija:\n- teab kaasava hariduskorralduse põhimõtteid ja rakendusvõimalusi koolis;\n- oskab analüüsida kaasava kooli võtmekomponente ning nende koosmõju enda koolis;\n- teab enda rolli koostöövõrgustike töös ja selle toetamisel kaasavas koolis, oskab nõustada kollleege ja lapsevanemaid kaasavate praktikate rakendamisel;\n- planeerib, monitoorib, hindab  oma tööd ja kavandab sellest lähtuvalt enesearengut;\n- koordineerib tegevusi ja toetab õpetajaid õpikeskkonna analüüsimisel ja tõenduspõhisel arendamisel.\""}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}