{"uuid": "9084ba14-67e6-f392-24c9-5e00ccbaa0e0", "code": "SVHI.01.042", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Managing and Administration of Educational Institution in the Context of Community and Environment", "et": "Haridusasutuse korraldus ja administreerimine ümbritseva keskkonna ja kogukonna kontekstis"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the study, the overview of the daily administration of the educational institution and the management of supporting the main processes will be covered. The goals of the self- and internal evaluation as the basis of organization and the handling of documentation are introduced. The students will be guided to connect daily administrative activities with the organization's strategic planning, evaluation of results and feedback.", "et": "Õppeaine läbimise käigus antakse ülevaade haridusasutuse igapäevasest administreerimisest ja põhiprotsesside toetamise juhtimisest. Tutvustatakse organisatsiooni enese- ja sisehindamise eesmärke, korraldamise aluseid ja dokumentatsiooniga ümberkäimist. Samuti aidatakse üliõpilasel seostada igapäevast administreerimistegevust organisatsiooni strateegilise planeerimise, tulemuste hindamise ning tagasisidestamisega."}, "objectives": [{"en": "1.\tEnable the the acquisition of knowledge, overview and understanding of the main processes of the administration in educational institution and support the knowledge and skills in field of school management.\n2.\tEnable the acquisition of knowledge and skillst about the goals of the organization's self- and internal evaluation, the administration system of educational institution in connection with the organization strategy.", "et": "Õppeaine eesmärkideks on:\n- võimaldada ülevaate omandamist haridusasutuse administreerimises ja põhiprotsesside toetamise juhtimise valdkonnas;\n- võimaldada teadmiste omandamist organisatsiooni enese- ja sisehindamise eesmärkidest, süsteemist ja korraldamise alustest ning seostest organisatsiooni strateegiaga."}], "learning_outcomes": [{"en": "1.\tA student has an overview of the basic documents of the educational institution's management and development activities, including internal evaluation, as the framework of the educational process.\n2.\tA student knows the management tactics and techniques used in the functioning of the school and knows how to relate them to educational strategies.\n3.\tA student can prepare and analyze the internal evaluation report and curriculum.\n4.\tA student knows how to involve additional resources necessary for the school's main activities and knows the corresponding communication channels and methods.", "et": "Õppeaine edukalt läbinud üliõpilane:\n- omab ülevaadet haridusasutuse juhtimise ja arendustegevuse, sh sisehindamise alusdokumentidest, kui õpi- ja kasvatusprotsessi raamistikust;\n- valdab kooli toimimisel kasutatavaid juhtimistaktikaid ja -võtteid ning oskab neid seostada atrateegiatega;\n- oskab koostada ja analüüsida sisehindamise aruannet ning õppekava;\n- oskab kaasata kooli põhitegevuseks tarvilikke lisaressursse ning tunneb vastavaid kommunikatsioonikanaleid ja -viise."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}