{"uuid": "74fcb226-33e8-d97c-12c9-84335e39c502", "code": "SVHI.06.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Building Communities of Practice", "et": "Erialase praktikakogukonna loomine"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is fully online, with materials shared on MS Teams. The course is a learning experience designed to help understand, create, and leverage communities of practice. Participants in the course will learn about the concept of communities of practice, their benefits, and how to identify or create them within their organization. The course will also cover topics such as collaboration, knowledge sharing, cultivating new expertise, all of which are essential for effective participation in a community of practice. By the end of the course, participants will have a better understanding of how communities of practice can contribute to organizational learning and development, and how to leverage them to improve performance and achieve objectives.", "et": "Kursus viiakse täies mahus läbi veebikeskkonnas ja kursuse materjale jagatakse MS Teamsis. Kursus pakub võimalust omandada kogemusi selles, kuidas mõista ja luua praktikakogukondi ning soodustada nende jätkusuutlikku arengut. Kursusel osalejad tutvuvad praktikakogukonna mõistega, saavad teada, millist kasu sellised kogukonnad tuua võivad ning kuidas neid oma organisatsioonis märgata ning luua. Kursusel käsitletakse ka sellised teemasid nagu koostöö, teadmiste jagamine, uute oskuste arendamine. Kõik need on tõhusaks praktikakogukondades osalemiseks olulised teemad. Kursuse lõpuks on osalejad teadlikud, kuidas praktikakogukonnad soodustavad organisatsioonisisest õppimist ja arengut, ja kuidas soodustada tulemuste parandamiseks ja eesmärkide saavutamiseks nende jätkusuutlikku ja tõhusat arengut."}, "objectives": [{"en": "The aim of this course is to introduce the concept of community of practice (CoP), and to invite students to explore how to create social learning spaces around educational technology use in their organisation. Building on their knowledge and understanding of different aspects of technology use in education, students can practice some aspects of working in and with CoP's. ", "et": "Kursuse eesmärk on tutvustada praktikakogukonna mõistet ja anda tudengitele võimalus uurida, kuidas oma organisatsioonis luua haridustehnoloogia ümber üksteiselt õppimise kogemus ja harjumus. Tuginedes eelnevatele teadmistele tehnoloogia kasutamise erinevatest aspektidest, on tudengitel võimalus katsetada praktikakogukondade loomist ja nendes tegutsemist. "}, {"en": "Specifically, the objectives of the course are:", "et": "Konkreetsemalt on kursuse eesmärgid:"}, {"en": "-\tto learn about the main pillars of CoP's;", "et": "-\tsaada ülevaade praktikakogukondade peamistest alussammastest;"}, {"en": "-\tto develop an understanding of how to encourage knowledge exchange;", "et": "-\tpraktiseerida tehnoloogiakesksete teadmiste vahendamist;"}, {"en": "-\tto explore how to cultivate new expertise.", "et": "-\tuurida võimalusi uute oskuste kujundamiseks."}], "learning_outcomes": [{"en": "After completing the course, the student a) understands the concept of communities of practice, what these are, how they function and what are their benefits; b) can identify and create communities of practice, with a focus on educational technology use; c) is able to promote collaboration and knowledge sharing to exchange ideas within a group; d) understands how to create a culture of continuous learning through encouraging peers and colleagues to participate in communities of practice and share their knowledge and expertise with others.", "et": "Kursuse läbinu a) on teadlik praktikakogukonna mõistest ja teab, mis on praktikakogukonnad, kuidas need toimivad ja millist kasu need tuua võivad; b) oskab märgata ja luua praktikakogukondi; c) oskab soodustada koos teistega töötamist ning grupis teadmiste ja ideede jagamist; d) on teadlik, kuidas soodustada praktikakogukondades osalemise ning teadmiste ja oskuste jagamise kaudu elukestva õppe harjumuste tekkimist."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}