{"uuid": "2169da4e-c01a-3687-cde2-bc00113846c2", "code": "SVHI.00.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-26T10:01:16", "title": {"en": "School Practice", "et": "Koolipraktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Observation- and pedagogical practice is the bachelor students first school practice. The main aim of the practice is to get an overview of the daily life of the school and teacher profession and to learn to analyze students learning and teachers teaching activities. During the practice period, the university student observes students and teachers activities and the general arrangements of the school life and gets the opportunity to participate in planning the lesson and to conduct the lesson. Students have the possibility to choose the practice school by themselves.", "et": "Tutvumis- ja vaatluspraktika on bakalaureuseõppe üliõpilaste esimene koolipraktika, mille üldiseks eesmärgiks on ülevaate saamine haridusasutuse õppe- ja kasvatusprotsessist kui tervikust ning õpetaja ja õpilaste tegevuste jälgimise ja vaatlustulemuste analüüsioskuse esmane omandamine.  Praktika käigus jälgib üliõpilane õpetaja ja õpilaste tegevust ning koolielu üldist korraldamist ja saab võimaluse osaleda õppetöö ettevalmistamises ja läbiviimises. Üliõpilastel on võimalus valida ise praktikakool."}, "objectives": [{"en": "Get a review of general principles about educational work at various types of schools and learn to analyze educational work and gain initial teaching experience.", "et": "Ülevaate saamine haridusasutuste õppe- ja kasvatusprotsessist kui tervikust; õpetaja ja õpilaste tegevuse jälgimise ja vaatlustulemuste analüüsimisoskuse esmane omandamine ning esmase õpetamiskogemuse saamine."}], "learning_outcomes": [{"en": "As a result of successful studies of the Observation- and Pedagogical Practice course the student will:", "et": "Praktika eduka läbimise tulemusena üliõpilane oskab:"}, {"en": "- be able to observe and analyze the daily work of the teacher;", "et": "*\tkirjeldada ja analüüsida õpilaste ja õpetaja tegevusi õppetundides ning vahetundides;"}, {"en": "- be able to analyze students' learning activities in classrooms;", "et": "*\tõpetaja abiga planeerida ja läbi viia õppetundi või õppetunni osa; "}, {"en": "- be able to plan and conduct lessons or part of lessons with the help of the teacher;", "et": "*\tõpetaja abiga valmistada ette õppevara ja abistada õpetajat kirjalike tööde parandamisel;"}, {"en": "- be able to analyze your own activities as a teacher (teacher assistant) in the classroom.", "et": "*\tanalüüsida oma tegevust õpetamisel või õpetaja abistamisel (õpetaja abina)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}