{"uuid": "d9cb9cc2-b5fe-ef73-9682-46aece509ef4", "code": "sv-2024-autumn-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-16T15:26:37", "title": {"en": "The Leadership of Professional Learning Communities", "et": "Professionaalse õpikogukonna (õpetajate õpigrupi) juhtimine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 119, "individual_work": 0, "internship": 9}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course, the students get an overview of the methodology of learning communities.\nThe instruction is experiential: introduced aspects of a topics will be tested using learning community method. Every session involves analysis and reflection of the previous work.\nThe following topics are covered:\nLearning community, teachers' professional learning community. Implementation of educational innovations, methods, benefits of learning community method. Formation of a learning community, management of group processes, group phases, resistance. Communication culture of a professional learning community (ethics of sharing, asking, listening and learning). Members of a professional learning community as action researchers. Self- and peer-evaluation, feedback, self-regulation. Formation of a school-based network, professional learning community as a player in this network. Use of digital tools in networking.", "et": "Õppeaine läbimise käigus võimaldatakse üliõpilastel omandada ülevaade õpikogukonna metoodikast. Kogu õpe on üles ehitatud sellisel moel, et käsitletava teema mõnede aspektidega tutvumise järel proovitakse need kohe õpikogukonna vormis järgi. Iga järgneva kohtumise esimene pool on senitehtud analüüs ja refleksioon. Käsitletakse järgmisi teemasid: Õpikogukond, professionaalne õpikogukond/õpetajate õpigrupp. Haridusuuenduste rakendamine, selle erinevad meetodid, õpikogukonna eelised. Õpikogukonna moodustamine, grupiprotsessid ja nende juhtimine, grupi faasid, vastupanu. Professionaalse õpikogukonna kommunikatsioonikultuur (jagamise eetika, küsimise eetika, kuulamise eetika, õppimise eetika). Professionaalse õpikogukonna liikmed oma tegevuse uurijatena. Enese- ja kaaslase hindamine, tagasiside ja edasiside, eneseregulatsioon. Koolikogukonna põhise võrgustiku kujunemine, professionaalse õpikogukonna/ õpigrupi roll võrgustikus. Digivõimaluste kasutamine võrgustikutöös."}, "objectives": [{"en": "The aim of the course is:", "et": "Õppeaine eesmärgid on:"}, {"en": "- to support the acquisition of the role of leader and educational innovator who values collective reflective learning both at classroom and school level, and is able to initiate and lead a professional learning community among collegaues;", "et": "- toetada õpetaja kui liidri ja teadliku haridusuuenduse rakendaja rolli omandamist, kes väärtustab kollektiivset reflekteerivat õppimist nii klassiruumi kui kogu õppeasutuse tasandil ning suudab kolleegide õpigruppi (professionaalset õpikogukonda) käivitada ja eest vedada;"}, {"en": "- to support the development of self-reflection and research skills;", "et": "- toetada eneseanalüüsioskuse ja uurimispädevuse kasvu;"}, {"en": "- to enrich the methodological basis in the context of adult education and lifelong professional development.", "et": "- rikastada õppemetoodilist pagasit täiskasvanuõppe ja elukestva professionaalse arengu raames."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine edukalt läbinud üliõpilane:"}, {"en": "- values his/her role in leading and planning the learning process and in directing his/her and colleagues' professional development;", "et": "- väärtustab oma liidrirolli nii õppeprotsessi juhtija ja kavandaja kui ka enda ja kolleegide professionaalse arengu suunajana;"}, {"en": "- is aware of the requirements of the contemporary learning paradigm for the competence of a teacher;", "et": "- teadvustab, milliseid nõudmisi uus õpikäsitus seab õpetaja pädevusele;"}, {"en": "- knows recent research on and theoretical approaches to the teachers' professional development, learning in networks and role of self-reflection;", "et": "- tunneb värskemaid uuringuid ja teoreetilisi käsitlusi õpetaja professionaalsest arengust, võrgustikes õppimise ning eneserefleksiooni rollist;"}, {"en": "- is able to benefit from the learning community method in instructional planning, formation of school culture, supporting the development of pupils` learning and cooperation skills, enhancing teacher cooperation, setting and achieving the development goals of individual teachers and a school as a whole; ", "et": "- oskab kasutada õpikogukonna meetodi võimalusi kooli õppe kavandamisel, koolikultuuri kujundamisel, õpilaste õpi- ning koostööoskuste arengu toetamisel, õpetajate koostöö tõhustamisel, õpetajate individuaalsete arengueesmärkide ja kooli kui terviku arengueesmärkide seadmisel ja saavutamisel;"}, {"en": "- knows various methods of analysis, leadership, change management and group work, to be applied in the learning community work;", "et": "- valdab erinevaid analüüsi-, eestvedamise ja muutuste juhtimise ning grupitöö meetodeid, mida kogukonnatöös rakendada;"}, {"en": "- is able to coordinate the activities of a school based learning community according to the goals of the organisation;", "et": "- oskab koordineerida koolipõhise õpikogukonna tegevust vastavalt kooli eesmärkidele;"}, {"en": "- is able to plan and implement the training of future learning community leaders in his/her school/kindergarten/area;", "et": "- oskab kavandada ja läbi viia tulevaste õpigruppide juhtide koolitust oma koolis/lasteaias/piirkonnas;"}, {"en": "- is able to find and recruit innovative teachers to professional learning communities;", "et": "- leida ja värvata haridusuuenduse rakendamiseks sobivate omadustega õpetajaid;"}, {"en": "- analyses and supports the work of learning communities.", "et": "- analüüsida ja toetada õpigruppide tööd."}], "notes": {}}, "grading": {"independent_work": {"et": "Refleksioonipäevik"}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Pedagoogiline dokumenteerimine, individuaalne- ja grupirefleksioon (enese- ja kaaslasehindamine) suuliselt seminarides ja õpipäeviku abil veebikeskkonnas (nt Moodle)."}}], "grade_preconditions": {"et": "Refleksioonipäeviku ja oma õpiringi tegevuse pedagoogilise dokumenteerimise materjalide õigeaegne esitamine, kaaslaste tööde tagasisidestamine."}, "grade_evaluation": {"et": "Õppeaine edukalt läbinud üliõpilane tõestab seminaride käigus ja refleksioonipäeviku/ pedagoogilise dokumenteerimise abil eesmärgiks seatud õpiväljundite saavutatust:\n- õpiringi koordineerimise oskust, \n- kogemust ja valmisolekut õpiringe koordineerida, nende tööd analüüsida ja toetada,\n- suutlikkust erinevaid analüüsi-, eestvedamise ja muutuste juhtimise ning grupitöö meetodeid õpiringi töös kasutada;"}, "debt_elimination": {"et": "Kokkuleppel õppejõuga"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "164b80c3-6707-88a2-5306-8dbd81889278", "person_name": "Maria Jürimäe", "structural_unit": {"code": "SVHI10", "name": {"en": "Centre for Innovation in Education", "et": "haridusinnovatsiooni keskus"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-20"}}, "registration_info": {"audience": {}}, "parent_uuid": "d799ec01-12e4-9e74-762e-e23cfbdc85c8", "parent_code": "SVHI.01.028", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}