{"uuid": "193257f2-4399-42bd-f1a8-4fc2ecafdef2", "code": "SVHI.06.036", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research in Educational Technology", "et": "Haridustehnoloogiline uurimistöö"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI06", "structural_unit_name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI06", "name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course starts with on-site session where students learn how to formulate research problems and aims of development work and how to design a study. Next, quantitative and qualitative research approach will be introduced in the context of design-based research and action research. Data collection and analysis methods are introduced for using interviews, questionnaires, content analysis, experimental design, comparative analyses and correlations. Basics of literature search and critical analysis will be learned. Every topic will be practiced in a seminar or practicum. The course continues in e-learning where the topics will be elaborated using course materials, recommended literature and discussions in Moodle. Every student runs a small research or development project and analyses the collected data. The course finishes with evaluation of peers' projects. Project works will be presented and discussed in a webinar.", "et": "."}, "objectives": [{"en": "The course gives general overview about research and development work in educational technology, formulating research problems and aims for development work, and about research designs for solving these problems. In addition, different methods for evaluating quality of research and development work and educational technology solutions will be introduced.", "et": "."}], "learning_outcomes": [{"en": "After completing the course, the student:\n(1) is able to formulate research problems and aims for a development project;\n(2) has skills to plan and execute research and development work in educational technology in using quantitative and qualitative approach in an appropriate way, including design-based and action research where interviews, questionnaires, content analysis, experimental design, comparative analyses or correlational analyses are in use;\n(3) is able to find and critically analyse scientific literature and best practices that are relevant for research and development work in educational technology in order to develop his/her own work based on that and to relate his/her own findings with this;\n(4) is able to evaluate the quality of research and development work in educational technology, developed solution or the work process.", "et": "."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}