{"uuid": "c1985799-f121-287c-75aa-84ce7ee0873a", "code": "SVHI.01.039", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-24T14:28:18", "title": {"en": "Leading Teaching and Learning", "et": "Õppimise toetamine ja juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course, knowledge and skills on supporting and leading the learning are deepened. Contemporary views on the planning and assessment of the learning process (goal-setting based on different national and school regulations), the choice and implementation of inclusive teaching methods, functions and methods of assessing and giving feedback on the learning results in school (incl. role and possibilities of ICT in diversifying the learning process, assessment and feedback), and basic principles of the development of the environment for learning is introduced. Students get an overview of teacher's teaching and supervision styles and will analyse their impact on the environment for learning. They will analyse the role of the person leading the learning process in creating a supportive physical and mental environment for learning.", "et": "Õppeaine läbimise vältel süvendatakse teadmisi ja oskusi õppimise toetamisest ja juhtimisest. Tutvutakse õppe kavandamise ja hindamise kaasaegsete seisukohtadega (eesmärgistamine erinevatele riiklikele ja koolipõhistele alusdokumentidele tuginedes), õppijat kaasavate õppemeetodite valiku ja rakendamise ning õpitulemuste kontrollimise ja tagasiside funktsioonide ning meetoditega koolis (sh info- ja kommunikatsioonitehnoloogia roll ja võimalused õppeprotsessi mitmekesistamisel, hindamisel ja tagasisidestamisel). Samuti viiakse ennast kurssi õppijat toetava õpikeskkonna kujundamise ja õppija motiveerimise põhialustega. Saadakse ülevaade õpetaja juhendamisstiilidest ja analüüsitakse selle mõju õppimist toetavale õpikeskkonnale, aga ka õppeprotsessi juhi rolli õppimist toetava keskkonna loomisel."}, "objectives": [{"en": "*\tto form and deepen the understanding of the conditions necessary for learning (environment for learning) and the skills to plan and facilitate the learning process (incl. assessing and giving feedback) by using inclusive teaching methods, incl. ICT;\n*\tto support the capacity to analyse the activities related to planning and assessing learning as a leader.", "et": "Õppeaine eesmärkideks on:\n- kujundada ja süvendada üliõpilaste arusaama õppimiseks vajalike tingimuste loomisest (õppimist toetava keskkonna loomisest);\n- võimaldada oskuste omandamist õppe kavandamisel ja läbiviimisel (sh hindamisel ning tagasisidestamisel) kaasavaid õppemeetodeid, sh IKT võimalusi, rakendades;\n- toetada suutlikkust analüüsida õppe kavandamise ja hindamise alast tegevust õppeprotsessi juhina."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine edukalt läbinud üliõpilane:"}, {"en": "*\tcan describe the basic principles of planning and facilitating the learning process (based on theories on learning) and plan the learning process (from goal-setting until assessing and giving feedback on the results) based on national and school regulations, and the needs and interests of the learner;", "et": "- oskab kirjeldada õppe kavandamise ja läbiviimise üldpõhimõtteid (tuginedes teoreetilistele lähtekohtadele/õppimisteooriatele) ja kavandada õpet (eesmärgistamisest õpitulemuste kontrollimise ja tagasisidestamiseni), lähtudes riiklikest ja koolisisestest alusdokumentidest ning õppija vajadustest ja huvidest;"}, {"en": "*\tduring planning, can choose inclusive teaching methods, incl. use of ICT (at all stages of planning and facilitating the learning process);", "et": "- oskab õpet kavandades valida õppijat kaasavaid õppemeetodeid, sh rakenda IKT võimalusi (kõigis õppetöö kavandamise ja läbiviimise etappides);"}, {"en": "*\tcan analyse impact of teacher's supervision styles on the environment for learning, and can form a safe environment for learning;", "et": "- oskab analüüsida õpetaja juhendamisstiilide mõju õppimist toetavale õpikeskkonnale ja kujundada õppimist toetava turvalise õpikeskkonna;"}, {"en": "*\treflects on planning and assessment activities and on his/her role as a leader of the learning process in creating the environment for learning.", "et": "- reflekteerib õppe kavandamist ja hindamisalast tegevust ning enda kui õppeprotsessi juhi rolli õppimist toetava keskkonna loomisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}