{"uuid": "e445f0e6-399e-e196-6916-9d697dcd8971", "code": "SVHI.03.041", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Assessing Child Development in Special Education", "et": "Lapse arengu eripedagoogiline hindamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "4474aa0a-69f1-f156-86a3-465637a71716", "code": "HTEP.01.051", "title": {"en": "Identification of Children's Special Needs", "et": "Erivajaduste identifitseerimine"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "An overview of cognitive and language skills assessment methods in preschool and school age is given. \nChoosing and modifying the assessment techniques and materials is learnt.\nAn assessment plan and materials for assessing the 2 children's (one with normal development and the other with SEN) cognitive and language skills are composed. \nA protocol of assessment and an assessment report in the area of cognitive and language skills are written.", "et": "Antakse ülevaade tunnetustegevuse, sh kõne uurimise metoodikast koolieelses ja koolieas. \nÕpitakse valima uurimisvõtteid, muutma uurimisvõtete ja -materjali raskusastet.\nKoostatakse uurimiskava ja materjalid ühe erivajadusega lapse arengu hindamiseks. \nKoostatakse EV lapse uuringu protokoll ja arengutaseme kirjeldus tunnetustegevuse ja kõne valdkonnas. püstitatakse arenduseesmärgid."}, "objectives": [{"en": "The aim of the course is to teach to assess cognitive and language skills of children in different ages.", "et": "Kursuse eesmärgiks on õpetada hindama erinevas vanuses laste tunnetustegevuse ja kõne arengut."}], "learning_outcomes": [{"en": "1. The student identifies the research methods used in special education, explains the nature of each method and identifies its advantages and limitations in comparison with other methods of assessing children.", "et": "1. Üliõpilane nimetab eripedagoogikas kasutatavaid uurimise meetodeid, selgitab iga meetodi olemust ning nimetab selle eelised ja piirangud laste uurimisel teiste meetoditega võrreldes. "}, {"en": "2. The student will design an assessment of the development of one child with special needs:", "et": "2. Üliõpilane kavandab ühe erivajadusega lapse arengu hindamise:"}, {"en": "(a) selects appropriate assessment methods based on the age and developmental level of the child to be assessed and selects and/or prepares research designs and materials for the assessment of the development of a particular child.  ", "et": "a) lähtuvalt uuritava lapse vanusest ja arengu tasemest valib sobivad hindamismeetodid ning valib ja/või koostab uurimisvõtted ja -materjali konkreetse lapse arengu hindamiseks.  "}, {"en": "(b) modifies the level of difficulty of the material and techniques according to the child being studied.", "et": "b) muudab materjali ja töövõtete raskusastet vastavalt uuritavale."}, {"en": "(c) takes into account the relationship between speech and cognition in the choice of research techniques.", "et": "c) arvestab uurimisvõtete valikul kõne ja tunnetustegevuse seostega."}, {"en": "3. The student carries out an assessment of one child with special needs on the basis of a self-designed assessment plan.", "et": "3. Üliõpilane viib ellu ühe erivajadusega lapse hindamise enda koostatud uuringukava alusel."}, {"en": "4. The student analyses the results of the child development assessment.", "et": "4. Üliõpilane analüüsib lapse arengu hindamise käigus saadud tulemusi."}, {"en": "5. The student draws up a description of the child's developmental level and sets developmental goals in the areas of cognition and speech.", "et": "5. Üliõpilane koostab lapse arengutaseme kirjelduse ning püstitab arenduseesmärgid tunnetustegevuse ja kõne valdkonnas."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}