{"uuid": "fb4fd6bf-7cc8-0db9-b05b-4770ddc3f7cd", "code": "SVHI.01.055", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 24, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The student works on his/her Master's thesis independently under the supervision of a university teacher / teachers or a practitioner and a university teacher. Research problems are negotiated with the supervisor and discussed in Masters' seminars. Master's thesis is compiled according to the requirements of the Institute of Education. In case of a large scale project / research task which is implemented as an integral whole, a team-based implementation is possible, given that the role and input of each team member can be established.", "et": "Magistritöö valmib magistrandi iseseisva tööna juhendava õppejõu/õppejõudude või praktiku ja õppejõu juhendamisel. Probleemistik kooskõlastatakse juhendava õppejõuga ja arutatakse läbi magistriseminarides. Magistritöö koostatakse vastavalt Haridusteaduste instituudis kehtivatele nõuetele. Suuremamahulise, terviklahendusena teostatava projekti/uurimisülesande puhul on üliõpilastel võimalik magistritöö teostada meeskonnana, kus iga meeskonnaliikme roll ja panus on selgesti eristatav."}, "objectives": [{"en": "The aim of the course is:", "et": "Õppeaine eesmärkideks on:"}, {"en": "- to facilitate the students to deepen their knowledge and skills on planning and implementing a research/development project on learning and teaching or management of an educational institution;", "et": "- võimaldada üliõpilastel teadmiste ning oskuste süvendamist õppimise ja õpetamise või harisuasutuse juhtimise valdkonna uurimistöö/arendusprojekti kavandamisest ja läbiviimisest;"}, {"en": "- to facilitate the acquisition of skills concerning the implementation of theoretical knowledge and empirical experience in practice.", "et": "- võimaldada üliõpilastel omandada vilumused teoreetiliste teadmiste ja empiiriliste kogemuste teadlikuks rakendamiseks praktikas."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Magistritöö läbinud üliõpilane:"}, {"en": "1. Establishes a problem statement based on scientific literature, formulates the aim of the research and the research questions and/or hypotheses in accordance with the problem statement.", "et": "1.\tPüstitab teaduskirjandusele toetudes uurimisprobleemi ning sellega kooskõlas sõnastab uurimuse eesmärgi ja uurimisküsimused ja/või hüpoteesid."}, {"en": "2. Finds, analyzes and synthesizes relevant scientific literature, the theoretical approaches and research results presented in it.", "et": "2.\tLeiab, analüüsib ja sünteesib teemakohast teaduskirjandust, selles esitatud teoreetilisi käsitlusi ning uurimistulemusi."}, {"en": "3. Chooses the most suitable research method for the study, justifies the choice, processes and analyzes research data.", "et": "3.\tValib oma uuringuks sobivaima uurimismeetodi, põhjendab selle valikut, töötleb ja analüüsib uurimisandmeid."}, {"en": "4. Presents the results of the research and interprets them based on the theoretical framework and the results of previous research.", "et": "4.\tEsitab oma uuringu tulemused ning tõlgendab neid lähtuvalt teoreetilistest lähtekohtadest ja varasemate uurimuste tulemustest."}, {"en": "5. Follows the academic writing requirements in accordance with the theses formatting guide.", "et": "5.\tJärgib akadeemilise kirjutamise nõudeid kooskõlas lõputööde vormistamise juhendiga."}, {"en": "6. Presents the results of the work and defends them in public academic discussion.", "et": "6.\tEsitleb tööd ja kaitseb oma seisukohti avalikus akadeemilises diskussioonis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}