{"uuid": "5e5e0d34-ee1e-bb3a-7eb5-5ed1bd33b37a", "code": "sv-2024-spring-openuniv-p2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-19T11:09:18", "title": {"en": "Inclusion of Students with Learning Difficulties", "et": "Õpiraskustega õpilaste kaasamine õppetöös"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode part 2 3 CP SV", "et": "24/25 K SÕ 2. osa 3 EAP SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Part I:\nNature and causes of learning difficulties. General (including mild intellectual disability) and specific learning difficulties (dyslexia, dysgraphia and dyscalculia). Assessment of learning skills and support for development in the classroom.\nAssessing writing, reading and math skills and supporting development. Supporting comprehension and text creation (storytelling).\nIndividualization of learning, selection of study material, preparation and adaptation, adaptation of learning environment.\nSupporting learners with activity and attention difficulties in the classroom.\nSupporting learners with autism spectrum disorders in the classroom.\nPart II:\nPreparation and implementation of an individual curriculum plan.\nFilling in the individual development monitoring card.\nOpportunities for networking in planning the learning of a learner in need of support (incl. Assistant teacher, support person). Counseling and guidance of parents and colleagues in supporting the learner in the learning process.", "et": "I osa:\nÕpiraskuste olemus ja põhjused. Üldised (sh kerge intellektipuue) ja spetsiifilised õpiraskused (düsleksia, düsgraafia ja düskalkuulia). Õpioskuste hindamine ja arengu toetamine klassis.\nKirjutamis-, lugemis- ja matemaatikaoskuse hindamine ja arengu toetamine. Tekstide mõistmise ja tekstiloome (jutustamisoskuse) toetamine.\nÕppe individualiseerimine, õppematerjali valik, koostamine ja kohandamine, õpikeskkonna kohandamine.\nAktiivsus- ja tähelepanuraskustega õppija toetamine klassis.\nAutismispektri häirega õppijate toetamine klassis.\nII osa:\nIndividuaalse õppekava koostamine ja rakendamine.\nIndividuaalse arengu jälgimise kaardi täitmine.\nVõrgustikutöö võimalused tuge vajava õppija õppe kavandamisel (sh abiõpetaja, tugiisiku). Lapsevanemate ja kolleegide nõustamine ning juhendamine õppija toetamisel õpiprotsessis."}, "objectives": [{"en": "The aim of this course is to raise teachers' awareness of noticing students in need of support, to support their competence in assessing learning, reading, writing and math skills, and to support students in their study.", "et": "Selle kursuse eesmärk on tõsta õpetajate teadlikkust tuge vajavate õppijate märkamisel, toetada kompetentsust õpi-, lugemis-, kirjutamis- ja matemaatikaoskuste hindamisel ja õpilaste toetamisel õppetöös."}], "learning_outcomes": [{"en": "The learner (Part I):", "et": "Aine läbinud õppija (I osa):"}, {"en": "- knows the causes of the most common learning difficulties and has an overview of general and specific learning difficulties;", "et": "- teab enamlevinud õpiraskuste põhjuseid ja omab ülevaadet üldistest ja spetsiifilistest õpiraskustest;"}, {"en": "- knows the cognitive characteristics of children with learning difficulties and their impact on learning;", "et": "- teab õpiraskustega laste kognitiivseid eripärasid ja nende mõju õppimisele;"}, {"en": "- identifies and describes the learning skills of the learner in need of support;", "et": "- selgitab välja ja kirjeldab tuge vajava õppija õpioskusi;"}, {"en": "- uses various tools, methods and techniques to support a learner in need of support;", "et": "- kasutab õppetöö läbiviimisel erinevaid vahendeid, meetodeid ja töövõtteid tuge vajava õppija toetamiseks;"}, {"en": "- selects, compiles or adapts suitable study materials in cooperation with a colleague;", "et": "- valib, koostab või kohandab sobilikke õppematerjale koostöös kolleegiga;"}, {"en": "-knows the signs of autism spectrum disorder; knows how to support children with autistic traits in learning (methodologies, strategies);", "et": "-teab autismispektri häire tunnuseid; teab kuidas autistlike joontega lapsi õppetöös toetada (metoodikad, strateegiad)."}, {"en": "-knows the signs of activity and attention deficit; knows how to support a child with activity and attention difficulties in class;", "et": "-teab aktiivsus- ja tähelepanuhäire tunnuseid; teab, kuidas toetada aktiivsus- ja tähelepanu raskustega last klassis. "}, {"en": "-provides achievable learning tasks and successful experience in the learning process;", "et": "-pakub saavutatavaid õpiülesandeid ja edukogemust õppeprotsessis;"}, {"en": "(Part II)", "et": "(II osa)"}, {"en": "- carries out activities supporting the development of the learner individually or in a group;", "et": "- viib läbi õppija arengut toetavaid tegevusi individuaalselt või rühmas; "}, {"en": "- analyzes the learning process carried out by oneself and colleagues;", "et": "- analüüsib iseenda ja kolleegide poolt läbiviidud õpiprotsessi;"}, {"en": "- prepares an individual curriculum plan (ICP) based on the level and needs of the learner;", "et": "- koostab lähtuvalt õppija tasemest ja vajadustest individuaalse õppekava (IÕK);"}, {"en": "- fills in an individual development monitoring card;", "et": "- täidab individuaalse arengu jälgimise kaarti;"}, {"en": "- is able to evaluate the effectiveness of the implemented support measures and make proposals for changing the study organization based on the needs of the students in need of support.", "et": "- oskab hinnata rakendatud tugimeetmete tõhusust ja teha ettepanekuid õppekorralduse muutmiseks lähtuvalt tuge vajavate õppijate vajadustest."}], "notes": {}}, "grading": {"independent_work": {"et": "-Individuaalse õppekava koostamine. Skaalal arvestatud-mittearvestatud.\n-Individuaalse arengu jälgimise kaardi täitmine. Skaalal arvestatud-mittearvestatud.\n-Moodle'is 3 video (IÕK, IAJK) põhjal testide sooritamine (3 testi). Maksimaalne punktisumma on 30. Test on sooritatud (arvestatud), kui iga testi tulemus on vähemalt 70%. Ühte testi saab teha 1 korra ja vastamiseks on aega 15 minutit (küsimusi on kokku 10).\n- Testiküsimustele vastamine. Täpsed juhised Moodle'is"}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Õppija täidab individuaalse arengu jälgimise kaarti. Täpsem tööjuhis on Moodle'is."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Juhtumi alusel individuaalse õppekava (IÕK) koostamine, kaasõppija töö tagasisidestamine ning vajadusel oma töö täiendamine. \nTäpsem kodutöö juhis on Moodle’is. Vajadusel täiendab õppija kodutööd õppejõu parandusettepanekute põhjal. Hinnatakse sõnalisel skaalal arvestatud/mittearvestatud."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Moodle’is videote (koosõpetamine, IÕK, IAJK) põhjal testide sooritamine (3 testi). Saadud tulemused kujundavad lõpliku hinde. Maksimaalne punktisumma on 10 (ehk kolme testi peale 30 punkti). "}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Arvestuslik töö, testiküsimustele vastamine. Saadud tulemus kujundab lõpliku hinde. Täpsemad juhised on lisatud Moodle’sse. "}}], "grade_preconditions": {"et": "Kõikides seminarides osalemine."}, "grade_evaluation": {"et": "Aine loetakse sooritatuks (arvestatud), kui iseseisvad tööd on esitatud õigeaegselt ja need on õppejõu poolt positiivselt hinnatud."}, "grade_conditions": {"arvestatud": {"et": "Kõikides seminarides osalemine ja iseseisvate tööde positiivne tulemus (arvestatud). "}}, "debt_elimination": {"et": "Võlgnevuse likvideerimine toimub kokkuleppel õppejõuga vastavalt õppekorralduseeskirjale. Seminarist puudumise korral peab õppija koostama kirjaliku kokkuvõtte seminaris käsitletud teemal (töötab läbi erialase kirjanduse, slaidid; vaatab lühivideoid). Pikkus vähemalt 2 A4 lehekülge."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "2f2a7303-a63f-6693-01fc-eb9401ce218a", "person_name": "Kirke Möllits", "structural_unit": {"code": "SVHI08", "name": {"en": "Centre for Teacher Education and Higher Education", "et": "õpetaja- ja kõrghariduse keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Individuaalse arengu jälgimise kaart. IAJK sisu, täitmine ja parendamine. Individuaalne õppekava. IÕK sisu, täitmine ja parendamine. "}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "Koosõpetamine. Selle põhimõtted, rakendamine. Võrgustikutöö. Osapoolte rollid (sh abiõpetaja, tugiisiku, lastekaitse). Lapsevanemate ja kolleegide nõustamine ning juhendamine õppija toetamisel õpiprotsessis. Ümarlaud. "}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "228adb01-098e-fa14-852e-0915ff3e3fd1", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "d1737c2e-3313-ec1a-a19e-0676acd641fc", "parent_code": "SVHI.00.018", "parent_credits": 9, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}