{"uuid": "d96c1e08-b040-3c17-12c5-865a061a6771", "code": "SVHI.00.036", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Giftedness and Twice-exceptionality in Context of Inclusive Education", "et": "Andekus ja topelt-erilisus kaasava hariduse kontekstis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview on contemporary approaches of giftedness and twice- exceptionality, conceptualization, as well as cognitive and personal characteristics and needs. Methods for adapting learning to the learner's individuality and abilities are discussed and best practices are introduced. Active independent and case-based group work plays an important role. Students should in small groups analyze needs and ways of adapting learning, based on specific examples, in order to support motivation and avoid underachievement. Discussions in the seminars are based on the theoretical and evidence-based knowledge covered in the course. In order to complete the course, it is necessary to provide as group or individual work a description of the strategy for supporting gifted or twice-exceptional learner and / or create differentiation tasks based on daily work in inclusive classroom  and complete a theoretical test.", "et": "Kursus annab ülevaate andekuse ja topelt-erilisuse kaasaegsetest käsitlustest, tänapäevastest kontseptualiseerimise viisidest, samuti kognitiivsetest ja isiksuslikest eripäradest ning vajadustest. Käsitletakse õppija individuaalsust ja võimeid arvestava õppe kohandamise meetodeid ja tutvustatakse parimaid praktikaid.   Oluline osa on  juhtumite põhisel aktiivselt iseseisval ja grupitööl.  Väikestes gruppides töötades on üliõpilaste ülesandeks analüüsida konkreetsetel näidetel põhinevate juhtumite puhul rakendatavaid õppe kohandamise vajadusi ja viise, sj silmas pidades motivatsiooni toetamist  ja alasoorituse vältimist.  Seminarides toimuvad arutelud grupitööde põhjal, toetudes kursusel käsitletud teoreetilistele ja tõenduspõhistele teadmistele. Kursuse lõpetamiseks on vaja esitada rühmatööna või soovi korral individuaalselt oma igapäevatööst ja kaasava hariduse kontekstis lähtuv  andeka või topelt-erilise õppija toetamise strateegia kirjeldus ja/või diferentseerimist võimaldavad ülesanded ning sooritada teoreetiliste teadmiste arvestuslik töö."}, "objectives": [{"en": "The course outlines concepts of giftedness and twice exeptionality and related special needs and strategies of support considering the context of inclusive education.", "et": "Aine eesmärgiks on anda ülevaade andekusega ja topelt-erilisusesega seonduvatest spetsiifilistest eripäradest, vajadustest ning niisuguste õppijate toetamisest kaasava hariduse kontekstis."}], "learning_outcomes": [{"en": "After completing the course, students are familiar with both giftedness- and twice-exceptionality-related", "et": "Kursuse läbinud tunnevad nii andekuse kui ka topelt-erilisuse"}, {"en": "- basic modern approaches, different forms and types", "et": "- põhilisi kaasaegseid käsitlusi, erivorme ja -liike"}, {"en": "- basic specific cognitive and personal characteristics and needs", "et": "- põhilisi spetsiifilisi kognitiivseid ja isiksuslikke eripärasid ning vajadusi  "}, {"en": "- strategies and effective methods for adapting learning, including technology", "et": "- õppe kohandamisega seotud strateegiaid ja efektiivseid, sh tehnoloogiat kaasavaid meetodeid"}, {"en": "- science-based practices for individualization and differentiation, prevention of underachievement and supporting motivation", "et": "- olulisemaid õppe individualiseerimise ja diferentseerimise, alasoorituse vältimise ja motiveerimisega seotud teaduspõhiseid praktikaid"}, {"en": "- needs and opportunities for counseling and supporting parents and colleagues", "et": "-  probleemidega seotud nõustamise ning lapsevanemate ja kolleegide toetamise vajadusi ja võimalusi"}, {"en": "Students demonstrate the ability to apply the acquired knowledge in their professional work and to reflect on their activities in the light of evidence-based theories and practices.", "et": "Üliõpilased ilmutavad oskust rakendada omandatud teadmisi oma erialases töös ning reflekteerida oma tegevust tõenduspõhiste teooriate ja praktikate valguses."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}