{"uuid": "14e9b18c-2830-fd22-dc2b-22eed063881e", "code": "SVHI.01.104", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Futures Thinking", "et": "Sissejuhatus tulevikumõtlemisse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course addresses how we can use futures thinking to create innovations. To do that, we start by looking at what innovation means and recognising the limits of how we usually think of innovation (based on backward-looking type thinking).\nNext, we analyse the various ways we usually think about the future, focusing on the limits of design and planning regarding more complex systems (such as classrooms, schools, and society at large). Then we shift towards more flexible ways of engaging the future, including questioning the dominant narratives of desirable futures and creating our visions.\n\nThe following topics will be addressed:\nThe limits of backward-looking type of thinking when it comes to innovation and innovative thinking;\nThe limits of design and planning when it comes to complex sociotechnical contexts;\nThe nature of futures thinking and its role in creating alternative futures; \nFutures workshop as a methodology to create desirable futures.", "et": "Kursusel käsitletakse seda, kuidas saame kasutada tulevikumõtlemist innoveerimiseks. Alustuseks vaatame, mida innovatsioon tähendab ja teadvustame nende meetodite piire, kuidas me tavaliselt innovatsioonist mõtleme (nn. tagasivaatav mõtlemine). Järgmisena analüüsime erinevaid viise, kuidas me tavaliselt tulevikule mõtleme, keskendudes eriti kavandamise ja planeerimise piiridele keerukamate süsteemide (nagu klassiruumid, koolid ja ühiskond laiemalt) kontekstis. Seejärel proovime liikuda paindlikemate viiside poole tulevikule mõtlemiseks. Sealhulgas seame kahtluse alla domineerivad narratiivid soositavatest tulevikest ning loome ka enda nägemused.\n\nKursusel käsitletakse järgmisi teemasid:\nPiirid, mida seab tagasivaatav mõtlemine innovatsioonile ja uuenduslikule mõtlemisele;\nKavandamise ja planeerimise piirid komplekssete sotsiotehniliste süsteemide kontekstisl;\nTulevikumõtlemise olemus ja selle roll alternatiivsete tulevike loomisel;\nTulevike töötuba kui metoodika soositava tuleviku loomiseks."}, "objectives": [{"en": "The course aims at engaging students in thinking about innovation in the context of creating futures. This includes recognising the limits of prediction and design, dealing with sociotechnical complexity, and learning to engage the present to give rise to desirable futures.", "et": "Kursuse eesmärk on kaasata õpilasi mõtlema innovatsioonile kui tuleviku loomise viisile. Sealhulgas tegeletakse ennustamise ja kavandamise piiride ja sotsiotehnilise keerukusega mõistmisega. Lisaks uuritakse, kuidas saab tulevikumõtlemist rakendada, et kasutada olevikku kutsumaks esile soositavaid tulevikke."}, {"en": "Specifically, the objectives of the course are:", "et": "Konkreetsemalt on kursuse eesmärgid:"}, {"en": "to share experiences and insights on innovation in the context of futures thinking;", "et": "Jagada kogemusi ja arusaamu innovatsioonist tulevikumõtlemise kontekstis;"}, {"en": "to give an overview of futures thinking;", "et": "Anda ülevaade tulevikumõtlemisest"}, {"en": "to develop a reflective stance on approaching futures.", "et": "Kujundada reflekteeriv hoiak tulevikega suhestumiseks."}], "learning_outcomes": [{"en": "Upon completion of the course the student is able:", "et": "Kursuse lõppedes õppijad:"}, {"en": "to analyse the various methods with which we engage the future;", "et": "analüüsivad erinevaid viise tulevikust mõtlemiseks;"}, {"en": "to understand the limits of prediction and planning;", "et": "mõistavad ennustamise ja planeerimise piire;"}, {"en": "to participate in the creation of desirable alternatives for the future.", "et": "loovad soositavaid tulevikualternatiive."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}