{"uuid": "ac1772e3-9618-4423-3227-d39c89c35969", "code": "sv-2024-spring-openuniv-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-21T11:06:54", "title": {"en": "Self-Regulation", "et": "Eneseregulatsioon"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV Eng", "et": "24/25 K SÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 104, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course is 100% web-based (in the Moodle). During the course, the learners read and discuss different topics of self-regulation and prepare interventions to support learners self-regulation. Topics: concepts, the importance of self-regulation, SR as an aptitude or event, measuring SR, supporting learners' self-regulated learning strategies, activities to plan, monitor and evaluate learning activities.", "et": "Kursus on 100% veebipõhine (Moodle-i keskkonnas). Kursuse käigus loevad ja arutlevad üliõpilased erinevate eneseregulatsiooni teemade üle ning valmistavad ette õpitegevusi õppijate eneseregulatsiooni toetamiseks. Teemad: mõisted, eneseregulatsiooni olulisus, eneseregulatsioon kui tunnus või tegevus, eneseregulatsiooni mõõtmine, eneseregulatsioonioskuse toetamine, võimalikud tegevused planeerimise, jälgimise ja hindamise toetamiseks."}, "objectives": [{"en": "The course gives knowledge of the concept of self-regulation, the importance and ways of supporting it, and guidelines and experience of developing self-regulated learning skills.", "et": "Kursus annab teadmisi eneseregulatsiooni mõistest, selle toetamise vajalikkusest ja viisidest, ning annab juhiseid ja kogemusi eneseregulatsiooni toetavate õpioskuste arendamiseks."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Kursuse läbinu"}, {"en": "(1) comprehends the concepts of self-directedness, self-regulation and metacognition, and their importance in the context of contemporary learning paradigm and life-long learning;", "et": "(1) mõistab enesejuhtimise, eneseregulatsiooni ja metakognitsiooni mõisteid ja nende tähtsust nüüdisaegse õpikäsituse ja elukestva õppe kontekstis;"}, {"en": "(2) understands his activities as a self-regulated learner and teacher;", "et": "(2) mõistab oma tegevust ennastreguleeriva õppija ja õpetajana;"}, {"en": "(3) is able to analyze his own and the learners' necessity of self-regulation, level and development proceeding from his or individual learners' characteristics;", "et": "(3) oskab analüüsida enda ja õppijate eneseregulatsiooni vajadust, taset ja arengut lähtuvalt enda või õppija eripärast;"}, {"en": "(4) is able to assess his own and learners' learning skills and learning motivation;", "et": "(4) oskab hinnata enda ja õppijate õpioskusi ja õpimotivatsiooni;"}, {"en": "(5) is able to plan learning activities to support learners' self-regulation;", "et": "(5) oskab planeerida õpitegevusi õppijate eneseregulatsiooni toetamiseks, valida sobivaid meetodeid ja hindamismudeleid, planeerida tegevuskava;"}, {"en": "(6) is able to create the learning environment to support learners' acquisition and use of metacognitive learning strategies;", "et": "(6) oskab luua õpikeskkonna, mis toetab õppijate metakognitiivsete õpistrateegiate omandamist ja kasutust;"}, {"en": "(7) is able to support learners to enhance their self-analysis and self-evaluation;", "et": "(7) oskab toetada õppijate eneseanalüüsi ja -hindamisoskuse kujunemist;"}, {"en": "(8) is able to analyze and reflect his activities when supporting learners' self-regulation, and regulate and adapt them according to needs.", "et": "(8) oskab analüüsida ja reflekteerida oma tegevust õppijate eneseregulatsioonioskuse toetamisel ning reguleerida ja kohandada seda vastavalt muutunud vajadustele."}], "notes": {}}, "grading": {"independent_work": {"et": "Õpipäevik - õpiplaani koostamine kursuse alguses, kursuse keskel ja lõpul oma tegevuse reflekteerimine. \nMudelite võrdlus - definitsioonide ja mudelite võrdlus (2 näite baasil), sarnasuste ja erinevuste väljatoomine, kaaslaste töö tagasisidestamine.\nVaatlusülesanne - õppijate õpiprotsessi jälgimine, enesereguleeritavate õpistrateegiate märkamine, analüüs eneseregulatsiooni mudeli baasil, vaatluslehe täitmine.\nPaaristöö - teadusartiklite lugemine erinevate eneseregulatsiooni mõõtmisviiside ja sekkumiste kohta, tulemustest ülevaate kirjutamine. \nMini-uuring - õppijate eneseregulatsiooni toetamiseks sekkumise loomine, mini-uuringu läbiviimine, tulemuste esitlemine. \n\nLearning diary - learning plan at the beginning of the course, reflecting the learning activities in the learning diary in the middle and at the end of the course..\nComparison of two models of SRL- comparison of definitions and models (based on 2 examples), finding similarities and differences, giving feedback to peers.\nObservation task - observing students' learning process, recognizing self-regulated learning strategies, analysis based on a model of SRL, filling in the observation sheet.\nPairwork - reading articles on different methods of measuring and supporting self-regulation and writing an overview on it (analysis, comparison).\nMini-research  - creating intervention to support learners' self-regulation, conducting the mini-research, reporting the results."}, "independent_work_assessments": [{"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "LEARNING DIARY\npassed - learning plan is compiled and mid-course and final reflection have been posted, self-analysis is thorough and meaningful, and reflects the learner's development within the course.\nfailed - only one submission (learning plan or mid-course or final reflection) has been posted, self-analysis is shallow. (outcomes: 2)"}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "COMPARISON OF TWO SRL MODELS\npassed - two different models of SRL have been compared, similarities and differences have been brought out. References have been added to the posting.\nfailed - only one model of SRL has been described OR references are missing. (1)"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "OBSERVATION TASK\npassed - observation sheet is completed, the learner's observations are focused, expressed clearly and objectively.\nfailed - observation sheet is incomplete, the learner has not noticed the signs of self-regulation or cannot express them. (3, 4)"}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "METHODS OF MEASURING AND SUPPORTING SRL (pairwork)\nA - the overview includes a thorough analysis of two methods of measuring SR and two ways of supporting learners' SR, the methods have been compared and contrasted, the advantages and disadvantages of both methods have been explained and fortified with evidence from empirical studies. Both partner's contributions are clearly visible.\nB - the overview includes a good analysis of two methods of measuring SR, the methods have been compared, the advantages and disadvantages of both methods have been explained but not fortified with evidence from empirical studies. Both partner's contributions are foreseeable.\nC - the overview includes analysis of two methods of measuring SR, the methods have been compared but the advantages and/or disadvantages of the methods have not been explained. Both partner's contributions are not visible.\nD - the overview includes descriptions of two methods of measuring SR but analysis and comparison are missing. Both partner's contributions are foreseeable.\nE - the overview includes descriptions of two methods of measuring SR but analysis and comparison are missing. Both partner's contributions are not visible. (1)"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "MINI-RESEARCH\nA - mini-research is conducted, the process is thoroughly documented and the results are presented clearly and understandably, all questions are responded adequately.\nB - mini-research is conducted, the process is thoroughly documented and the results are presented clearly, most questions are responded adequately.\nC - mini-research is conducted, the process is documented and the results are presented, most questions are responded to.\nD - mini-research is conducted, the results are presented, most questions are responded to.\nE - mini-research is conducted, the results are presented. (5, 6, 7, 8)"}}], "grade_preconditions": {"et": "Ülesanded peavad olema esitatud kursuse ajal.\nThe assignments have to be submitted during the course."}, "grade_evaluation": {"et": "Lõpphinne kujuneb järgnevalt:\nÕpipäevik - 20%\nVaatlusülesanne - 10%\nMõõtmis- ja toetusmeetodite analüüs - 20%\nMini-uuring - 50%\n\nThe final score is the combination of the assignments:\nLearning diary - 20%\nObservation task - 10%\nAnalysing methods of measuring and supporting SR - 20%\nMini-research - 50%"}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga õppekorralduse eeskirja kohaselt.\nAccording to the agreement with the teacher in charge, following the rules set in university's study regulations."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "fde5e79f-39d3-496f-af5e-7cf2968ded2a", "type": "MOODLE", "code": "SVHI.06.041_SO_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "c667d495-03e6-b951-12c9-daf74f88e624", "person_name": "Anait Akopyan", "structural_unit": {"code": "SVHI08", "name": {"en": "Centre for Teacher Education and Higher Education", "et": "õpetaja- ja kõrghariduse keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "efc0d8bc-3f43-d8cd-3371-86900bde5c3b", "person_name": "Katrin Saks", "structural_unit": {"code": "SVHI08", "name": {"en": "Centre for Teacher Education and Higher Education", "et": "õpetaja- ja kõrghariduse keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "c2d51a28-f60c-2bd6-d68e-ea9309008db7", "person_name": "Herta Hiiend", "structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}], "assistants": ["2d52676e-a058-9f11-cdc2-f93fa5dd5aa4"]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 35}, "parent_uuid": "dc43557e-5afe-1938-d2b5-0f5db9b94df8", "parent_code": "SVHI.06.041", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}