{"uuid": "e03fbf20-e50c-5d61-2658-ca546f3f2d77", "code": "SVHI.01.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basic Practice of Four-Subject Teacher", "et": "Nelja aine õpetaja põhipraktika"}, "credits": 11, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "43e07c6a-d65a-7579-8a8f-d45cd7b2fa53", "code": "SHHI.01.030", "title": {"en": "Communication and Feedback in School", "et": "Suhtlemine ja tagasiside haridusorganisatsioonis"}, "credits": 4, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "This course is for supporting student's professional development by creating opportunities to integrate the studies in the university altogether with practical teacher's activities in an educational institution.\nPractice will take place the second-level postgraduate education in the autumn or spring semester, minimum duration 10 weeks, Practice will take place in the form of a specific action plan for each student, individually, in accordance with the guideline. NB: social pedagogy practice volume is calculated separately, see more pedagogical practice guideline.", "et": "Põhipraktika toetab üliõpilase professionaalset arengut, luues võimalusi seostada ülikooliõpingud tervikuks praktilises õpetaja töös õppeasutuses.  Praktika toimub magistritaseme 2. õppeaasta sügis- või kevadsemestril kestusega 8-10 nädalat ning igale üliõpilasele individuaalses vormis kindla tegevuskava alusel vastavalt praktikajuhendile.  \nNB: sotsiaalpedagoogika praktika mahtu arvestatakse eraldi, vt täpsemalt pedagoogilise praktika juhendist."}, "objectives": [{"en": "The course has three main goals that should be achieved based on the completed studies in the university and jointly with continuous pedagogical traineeship:", "et": "Õppeainel on kolm üldeesmärki, mis saavutatakse, tuginedes läbitud ülikooliõpingutele ja koos pideva pedagoogilise praktikaga:"}, {"en": "1) to support student's improvement to be a teacher by creating opportunities to integrate previously completed studies altogether with practical teacher's activities in an educational institution;", "et": "1) toetada üliõpilase kujunemist õpetajaks, luues võimalused eelnevalt läbitud õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses;"}, {"en": "2) to create opportunities to explore the educational process as a whole and to teach during a complete educational period;", "et": "2) luua võimalused õppe- ja kasvatustöö kui terviku tundmaõppimiseks ja läbiviimiseks kompaktse õppeperioodi vältel;"}, {"en": "3) to enable to practice principles related to subject-didactics.", "et": "3) võimaldada ainedidaktiliste põhimõtete rakendamist, praktiseerida ainete ja didaktika alaseid teadmisi ja oskusi ja omandada kogemusi nende ainete õpetamiseks koolis  vastavalt riiklikule õppekavale."}], "learning_outcomes": [{"en": "By the end of the traineeship the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1) is able to plan, implement, analyze and evaluate his/her activities related to subject and education;", "et": "1) oskab kavandada, ette valmistada, läbi viia, analüüsida ja hinnata oma õppe- ja kasvatustöö alaseid tegevusi;"}, {"en": "2) is able to plan teaching process, to teach and to support learners taking into account learners' speciality, prior knowledge, needs (including educational needs) and interests;", "et": "2) oskab õpet kavandades ja läbi viies ning õppijaid toetades arvestada nende eripära, eelteadmiste, vajaduste (sh erivajaduste) ning huvidega;"}, {"en": "3) arranges teaching systematically, based on evidence and creatively taking into account national basic documents, speciality of the educational institution, level of education, and/or subject, the needs and interests of students;", "et": "3) kavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja/või õppeaine eripärast ning õppijate vajadustest ja huvidest;"}, {"en": "4) integrates successfully the knowledge, skills and attitudes acquired during the studies in the university.", "et": "4) integreerib tulemuslikult ülikooliõpingutes omandatud teadmisi, oskusi ja hoiakuid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}