{"uuid": "6eedafaf-abda-40f9-a6d1-f1e5342458b9", "code": "SVHI.01.053", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Observation Practice", "et": "Vaatluspraktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During the course, the student obtains experiences in the work environment by visiting different educational institutions and using job shadowing, and reflects the experience in the practice logbook. The obtained experiences enable the student to link his/her previous knowledge and skills with practical work and prepare for the practice.", "et": "Õppeaine käigus külastab üliõpilane erinevat tüüpi haridusasutusi ja omandab töökeskkonnas kogemusi töövarju meetodil ning reflekteerib kogetut praktikapäeviku abil. Omandatud kogemused aitavad üliõpilasel seostada seniseid teadmisi ja oskusi praktilise tööeluga ning valmistuda põhipraktikaks.\n\n\nVaatluspraktika raames peavad üliõpilased täitma praktikapäevikut, mis peaks olema vabalt valitud elektroonilises vormis. Praktikapäeviku kirjeldava analüüsi tähtaeg on hiljemalt nädal pärast vaatluspraktika päeva. \n\nÜliõpilased, kes ei saa mõnel vaatluspraktika päeval osaleda, peavad sellest eelnevalt informeerima vastutavat õppejõudu ja sooritama lisaülesande, milleks on analüüsida oma kursusekaaslaste vaatlusrefleksioone ning esitada nende põhjal koondraport ühes omapoolse kriitilise ja sünteesiva refleksiooniga. Lisaülesanne peab olema esitatud hiljemalt enne järgmist vaatluspraktika päeva."}, "objectives": [{"en": "The aim of the course is to enable the student to attune to the circumstances of the chosen practice site and to prepare for the practice.", "et": "Õppeaine eesmärk on võimaldada üliõpilasel valitud praktikakoha oludele häälestumist ning aidata tal ette valmistuda põhipraktikaks."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine edukalt läbinud üliõpilane:"}, {"en": "- has an overview of the characteristics of observed work environment ", "et": "- omab ülevaadet vaadeldud õpi- ja töökeskkonna eripäradest;"}, {"en": "- has an overview of the characteristics of observed position;", "et": "- omab ülevaadet vaadeldud ametikoha eripäradest;"}, {"en": "- is able to notice the relevant features of organisational processes and describe them.", "et": "- oskab tähele panna organisatsioonikultuuri olulisi tunnuseid ning neid kirjeldada."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}