{"uuid": "62679b82-3d85-d428-1712-a5a1ada40f88", "code": "SVHI.01.079", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "General Didactics and Basics of Education", "et": "Ülddidaktika ja kasvatustöö alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI01", "structural_unit_name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI01", "name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "email": "educ@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The nature and principles of didactics. Learning process and the factors influencing it. The communication between teachers and students in the learning process. Teacher's role in creating a supportive learning environment. Discipline. Teaching forms and methods; active learning. Lesson plans. Planning of instruction, selection and application of instructional methods, identifying and assessing learning outcomes. Feedback in the learning process, reflection. Documentation. Teacher&acute;s profession.", "et": "Didaktika olemus. Õppimiskäsitlused ja õpistrateegiad. \nÕppeprotsess ja seda mõjutavad tegurid. \nÕppetöö vormid ja meetodid; aktiivse õppimise viisid.\nÕppetöö planeerimine, õppetunni ülesehitus; tunni eesmärgistamine, õppemeetodite valiku alused, läbiviimine, tagasisidestamine.\nÕpetaja roll õppimist soodustava õpikeskkonna loomisel; distsipliin. Õpetaja ja õpilaste interaktsioon õppeprotsessis.\nÕppetegevuse analüüs.\nDokumentatsioon koolis ja õpetaja professioon."}, "objectives": [{"en": "To give an overview of teaching, learning. To introduce how to set goals for teaching and make plans for learning materials, design lessons, conduct them and collect the feedback. To introduce different teaching methods and analyze their use. To introduce creating a supportive learning environment and discipline, prevention and intervention strategies. To prepare students for practice at school.", "et": "Anda ülevaade õppimise ja õpetamise olemusest. Tutvustada õppetöö eesmärgistamise ja õppematerjali planeerimise, õppetunni ülesehituse ja läbiviimise ning tagasisidestamise põhimõtteid ja viise. Tutvustada erinevaid õpetamismeetodeid ja analüüsida nende kasutamist. Tutvustada õppimist toetava õpikeskkonna loomise võimalusi ja õppedistsipliini olemust ning sekkumisstrateegiaid. Valmistada üliõpilast ette praktikaks koolis."}], "learning_outcomes": [{"en": "After passing the course student\nThe prospective teachers develop the basic knowledge of general didactics and basic principles for planning, conducting, analyzing and developing the teaching and learning  process.\nAs a result of successful studies of this course the student will:\nKnow the principals of planning and conducting the studies.\nKnow the principals and techniques of designing a lesson and collecting, giving feedback.\nUnderstand the teacher&acute;s role of creating supportive learning environment.\nUnderstand the being of learning discipline and is aware of different prevention and intervention strategies.\nBe able to analyze the lessons.\nHave an overview of the main documentation that the teacher is filling out in school.", "et": "Õppeaine läbinud õppija:\nTulevasel õpetajal kujunevad teadmised ülddidaktika alustest ning esmased oskused õppetegevuse planeerimiseks, läbiviimiseks, analüüsimiseks ja arendamiseks.\nKursuse eduka läbimise tulemusena üliõpilane:\n*Selgitab õppetöö eesmärgistamise ja planeerimise põhimõtteid ning rakendab neid tunnikava ja minitunni kavandamisel ja läbiviimisel.\n*Kirjeldab õppetunni ülesehituse ja läbiviimise ning tagasisidestamise põhimõtteid ja viise ning on harjutanud nende rakendamist.\n*Kirjeldab erinevaid õpetamismeetodeid ja nende kasutusvõimalusi.\n*Kirjeldab õpetaja rolli õpikeskkonna loomisel ja toob näiteid, kuidas õpetaja saab luua õppimist toetava vaimse ja füüsilise õpikeskkonna.\n*Selgitab ennetavaid tegevusi klassis sotsiaalse korra saavutamiseks ja toob näiteid sekkumise strateegiatest distsipliiniprobleemide korral.\n*Analüüsib õppetundi.\n*Omab ülevaadet koolis õpetaja poolt täidetavast peamisest dokumentatsioonist (oskab nimetada ja kirjeldada lühidalt sisu ja otstarvet)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}