{"uuid": "3211ae0d-e1b3-0106-e22c-6528f6954b53", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-30T13:19:55", "title": {"en": "Educational Theory", "et": "Haridusteooria"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI01", "name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "email": "educ@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI01", "structural_unit_name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The beginning and the development of theoretical discussion on education in the Western cultural space. Different approaches.\nThe formation of education as an independent scientific discipline. General education. Herbart. The relationship between ethics and psychology in defining educational aims, content and methods.  \nDifferences between English-speaking, Continental European and Nordic traditions in defining educational research, general education and educational theory.   \nPractical examples and discussion on the relationship between theory and practice in current educational discourse", "et": "Teoreetilise haridusalase arutluse algus ja areng Lääne kultuuriruumis; vastandlikud käsitused.\nHaridusteaduse kui iseseisva teadusdistsipliini kujunemine ja areng. Üldpedagoogika. Herbart. Eetika ja psühholoogia omavaheline suhe hariduseesmärkide, hariduse sisu ja meetodite määratlemisel. \nInglise keeleruumi, Mandri-Euroopa ja Põhjamaade traditsioonide erinevused haridusteaduse, üldpedagoogika ja haridusteooria määratlemisel.\nPraktilised näited ja arutelu teooria ja praktika suhte üle kaasaegses haridusdiskursuses. \nIseseisev töö arvestuseks."}, "objectives": [{"en": "The objectives of the course are as follows: ", "et": "Eesmärkideks on:"}, {"en": "- to provide the participants with opportunities to comprehend the relationship between educational practice and theory and the different ways in which this relationship has been examined and conceptualised;", "et": "- võimaldada osalejatel omandada arusaam haridus- ja kasvatuspraktika ning valdkondliku teooria omavahelisest suhtest ja selle suhte erinevatest käsitlustest; "}, {"en": "- to provide the participants with knowledge and understanding about educational studies and general education (Allgemeine Pädagogik) as a discipline of its own, about its development and importance and about the different ways it has been addressed;", "et": "- võimaldada osalejatel omandada teadmised ja arusaam haridusteadusest ja üldpedagoogikast (Allgemeine Pädagogik) kui iseseisvast teadusdistsipliinist, selle arengust, olulisusest ja erinevatest käsitlustest;  "}, {"en": "- to develop the participants' capabilities to distinguish, understand and critically assess the specifically educational component in written and oral texts;  ", "et": "- arendada osalejates võimet eristada, mõista, arendada ja kriitiliselt hinnata eripäraselt hariduslikku komponenti suulises ja kirjalikus vormis;"}, {"en": "- to develop the participants' capabilities to distinguish, understand and critically assess the degree of generality of a particular educational problem or topic, to become able to distinguish between the general educational and the field specific aspects.", "et": "- arendada osalejates võimet eristada, mõista ja kriitiliselt hinnata vastava haridusliku probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ainest."}], "learning_outcomes": [{"en": "Those who have completed the course are expected to be able to:", "et": "Kursuse läbinu:"}, {"en": "- understand and distinguish between the practice- and experience-based and, on the other hand, the theoretical and conceptual in the educational discussion; consciously operate between these two levels in their written and oral texts;", "et": "- mõistab ja eristab ühelt poolt praktika- ja kogemuspõhist ning teiselt poolt teaduslik-teoreetilist tasandit haridusalases arutelus; suudab suulises ja kirjalikus vormis teadlikult liikuda nende tasandite vahel;"}, {"en": "- know and understand the reasons, the main developmental characteristics and the identity issues of general education as a discipline of its own; know and understand the traditional disciplinary and theoretical specificities of educational science in the English-speaking, the Continental European and the Nordic cultural spaces; understand and purposefully apply these specificities in their reading and writing;  ", "et": "- tunneb haridusteaduse ja üldpedagoogika väljakujunemise põhjusi, arenguloo peajooni ning peamisi eripärasid Mandri-Euroopa, ingliskeelses ning Põhjamaade kultuuriruumis; mõistab ja rakendab teadlikult nende kultuuriruumide eripäradest tulenevaid teoreetilisi ja mõistelisi erinevusi hariduses;   "}, {"en": "- distinguish, understand and critically assess the presence, the extent and the quality of a specifically educational component in written and oral scientific production;", "et": "- eristab, mõistab, arendab ja suudab kriitiliselt hinnata eripäraselt haridusliku komponendi olemasolu, ulatust ja kvaliteeti suulises ja kirjalikus teadusloomes;"}, {"en": "-  distinguish, understand and critically assess the degree of generality of a particular educational problem or topic; distinguish between the general educational and the field specific matter;", "et": "- mõistab, arendab ja suudab kriitiliselt hinnata vastava haridusalase probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ain"}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisvaks tööks on õppejõu poolt esitatud kirjanduse lugemine ning rühmatöö ühe haridusteooria-alase rahvusvahelise eelretsenseeritud teadusajakirja artikli tutvustmiseks kursuse viimasel kontaktseminaril. Täpsema selgituse iseseisva töö ning arvestuse saamise tingimuste osas esitab õppejõud esimesel loeng-seminaril 14. veebr 2025."}, "grade_preconditions": {"et": "Arvestuslik, st mittehindeline hindamine. Kriteeriumiks on osalemine loeng-seminaridel või mitteosalemise korral puudumise kompenseerimine vastavalt kokkuleppele õppejõuga. Osalemine rühmatööna esitaval haridusteeoria alase artikli tutvustusel kontaktõppe viimasel seminaril. "}, "grade_evaluation": {"et": "Selgitatud eelnevalt hindamismeetodite ja -kriteeriumite lõigus"}, "grade_conditions": {"arvestatud": {"et": "vt hindamismeetodite ja -kriteeriumite lõiku. Täpsem selgitus esimesel kontaktõppe kohtumisel."}, "mittearvestatud": {"et": "Loeng-seminarides, kodutöös ja suulises rühmaettekandes mitteosalemine, kompensatsiooniks pakutud võimaluste kasutamata jätmine."}, "mitteilmunud": {"et": "kontaktõppes ega kompensatsioonivormides mitteosalemine"}}, "debt_elimination": {"et": "Sõltuvalt võlgnevuste põhjustest, ulatusest ja laadist kokkuleppel õppejõuga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {"et": "Esimesel võimalusel pärast kontaktõppe lõppu, eriolukordade puhul vastavalt üliõpilase ja õppejõu kokkuleppele. "}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "472deeaa-58da-4ad8-8fb4-e11755aa98b8", "type": "MOODLE", "code": "SVHI.01.109", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "3e0a7d0c-380c-9133-5f6c-2d7927969f9a", "person_name": "Rain Mikser", "structural_unit": {"code": "SVHI01", "name": {"en": "Department of General Education", "et": "pedagoogika osakond"}, "email": "educ@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}}, "parent_uuid": "edcef35d-f6c5-4852-2ee8-1d4fe75b53b6", "parent_code": "SVHI.01.109", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}