{"uuid": "d4985577-6014-d531-ba12-dc0bc8c84f0f", "code": "SVHI.06.035", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-01T13:44:30", "title": {"en": "Digital Literacy", "et": "Digitaalne kirjaoskus"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI06", "structural_unit_name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI06", "name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is divided into four thematic blocks. Each block will cover one specific topic.\nBlock 1 - AI in society. Digital literacy entails the ability to navigate a world influenced by AI methods and tools, where various activities are mediated by AI, affecting information search, interactions, decision-making, etc. In this Block we are going to be addressing three main issues: What is AI? What activities do AI tools and techniques affect in your life? What lies behind AI tools and techniques?  \nBlock 2 - Information search&evaluation. In this block you are invited to search for information on the scenarios that will be shared with you closer the time. Within your groups, you will be asked to describe how you searched for information and whether you encountered any difficulties or controversies while doing your information search.\nBlock 3 - Digital literacy (DL) in the postdigital era. We will explore the concept of postdigital which suggests that digital technology has become so integrated into our lives that it's no longer a distinct or separate concept, but rather an integral part of our everyday experiences. The focus will be on three main topics: critical DL (which is also tied in with information search in the previous block), holistic approach to DL that looks at the cultural, societal and ethical aspects of DL, and digital wellbeing.\nBlock 4 - Content creation will focus on developing and/or adapting content, integrating digital resources into teaching and learning, and copyright rules and licenses.", "et": "Kursus on jagatud nelja temaatilise plokki. Iga plokk hõlmab ühte kindlat teemat.\n1. plokk - AI ühiskonnas. Digitaalne kirjaoskus hõlmab võimet navigeerida maailmas, mida mõjutavad AI meetodid ja tööriistad, kus AI vahendab erinevaid tegevusi, mis mõjutavad teabeotsingut, suhtlust, otsuste tegemist jne. Selles plokis käsitleme kolme peamist küsimust: Mis on AI? Milliseid tegevusi AI tööriistad ja tehnikad teie elus mõjutavad? Mis on AI tööriistade ja tehnikate taga?\n2. plokk - teabe otsing ja hindamine. Selles plokis kutsutakse teid otsima teavet stsenaariumide kohta, mida teiega lähemal ajal jagatakse. Rühmatööna palutakse teil kirjeldada, kuidas te teavet otsisite ja kas teil tekkis teabeotsingu tegemisel raskusi või vaidlusi.\n3. plokk - digitaalne kirjaoskus (DL) postdigitaalsel ajastul. Uurime postdigitaalsuse kontseptsiooni, mis viitab sellele, et digitaaltehnoloogia on meie ellu niivõrd integreeritud, et see pole enam eraldiseisev mõiste, vaid pigem meie igapäevaste tegevuste lahutamatu osa. Keskendutakse kolmele põhiteemale: kriitiline DL (mis on seotud ka eelmise ploks teabeotsinguga), terviklik lähenemine DL-ile, mis vaatleb DL-i kultuurilisi, ühiskondlikke ja eetilisi aspekte, ning digitaalne heaolu.\n4. plokk - sisu loomine keskendub sisu arendamisele ja/või kohandamisele, digitaalsete ressursside integreerimisele õpetamisesse ja õppimisse ning autoriõiguse reeglitele ja litsentsidele."}, "objectives": [{"en": "The course gives an overview of the components of digital literacy and possibilities for improvement in the context of learning and teaching.", "et": "Kursusel antakse ülevaade digitaalse kirjaoskuse komponentidest ja parendusvõimalustest õppimise ja õpetamise kontekstis."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "(1) has a general overview of digital literacy (including information and data literacy, communication and collaboration, digital content creation, safety); ", "et": "(1) omab üldist ülevaadet digitaalsest kirjaoskusest (sh info- ja andmepädevus, suhtlemine ja koostöö, digitaalse sisu loomine, ohutus);"}, {"en": "(2) is able to apply skills and knowledge related to information and data literacy, communication and collaboration, digital content creation, safety;", "et": "(2) oskab rakendada info- ja andmepädevuse, suhtlemise ja koostöö, digitaalse sisu loomise, ohutusega seotud oskusi ja teadmisi;"}, {"en": "(3) is able to create digital content that follows the concept of digital pedagogy and follows copyright rules and licenses;", "et": "(3) oskab luua digitaalset sisu, mis järgib digipedagoogika kontseptsiooni ning autoriõiguse reegleid ja litsentse;"}, {"en": "(4) understands the concept of Ai and its dimensions in relation to AI literacy.", "et": "(4) saab aru tehisintellekti mõistest ja selle tähendusest seoses tehisintellekti kirjaoskusega."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}