{"uuid": "a1ef1910-c27f-c3c2-c99d-1c85413f3c59", "code": "SVHI.03.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice for Speech Therapists: Remedial Teaching in School", "et": "Õpiabi praktikum logopeedidele"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "e783e124-5243-0faa-3871-4f80c4cfeb59", "code": "HTEP.02.084", "title": {"en": "Methodology of Mother Tongue for Children with SEN I", "et": "Eesti keele õpe erivajadustega lastele I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "5ad80215-944a-34f9-3a1b-ecf93419b10b", "code": "HTEP.01.047", "title": {"en": "Instruction of Mathematics for SEN Children I", "et": "Matemaatika õpe erivajadustega lastele I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Students learn to assess reading and writing skills and to notice the connections between the development of mathematical skills.\nStudents learn how to compose plans for therapy and sessions, choose and develop material for training, choose appropriative corrective work methods and sequence. Students practice (in the auditorium) applying corrective work methods (assistance lecturer).\nAnalyze cases (student descriptions and students written work).\nExamine and analyse lessons in regular school (pupils with reading and writing difficulties).", "et": "Õpitakse uurima ja hindama õpilaste kirjaliku kõne oskusi ning märkama seoseid matemaatiliste oskuste kujunemisega.\nÕpitakse kirjaliku kõne kujundamiseks ja korrigeerimiseks sobiva harjutusmaterjali valimist ja/või koostamist, töövõtete valimist ja järjestamist ning planeeritud tegevuste vormistamist tunnikonspektina.\nÜliõpilased harjutavad auditooriumis erimetoodiliste töövõtete rakendamist, õppeülesannete ning tunnietappide ettevalmistamist ja läbiviimist.\n\nAnalüüsitakse juhtumeid (õpilaste kirjeldused ja kirjalikud tööd).\nVaadeldakse ja analüüsitakse lugemis- ja kirjutamisraskustega õpilaste õpiabitunde tavakoolis."}, "objectives": [{"en": "Accumulate theoretical knowledge of how to assess and support the development of literacy (reading and writing skills) for pupils with learning difficulties in general education schools.", "et": "Teoreetiliste teadmiste seostamine ja kinnistamine õpiraskustega õpilaste kirjaliku kõne (lugemis- ja kirjutamisoskus) arengu  hindamise ja toetamise võimalustest üldhariduskoolis."}, {"en": "Practice planning and conducting teaching and development activities that support literacy skills development.", "et": "Kirjaliku kõne arengut toetavate õppe- ja arendustegevuste planeerimise ja läbiviimise harjutamine praktikumides."}], "learning_outcomes": [{"en": "1.\tStudent is able to assess the development of the students' literacy skills and their relation to the development of mathematical skills.\n2.\tThe student is able to plan learning and development activities based on the needs and to prepare or select study materials to support the development of the student's reading and writing skills.\n3.\tStudent has primary practice experience applying corrective work methods (practical lessons placement in the auditorium, supervised by lecturer).", "et": "1.\tÜliõpilane oskab hinnata õpilaste kirjaliku kõne arengut.\n2.\tÜliõpilane mõistab keelelise arengu (sh suulise ja kirjaliku kõne mõistmise) seost matemaatiliste oskuste kujunemisega.\n3.\tÜliõpilane oskab planeerida õppe- ja arendustegevusi ning koostada või valida sobivaid õppematerjale õpilase kirjaliku kõne arengu toetamiseks.\n4.\tÜliõpilane oskab kasutada erimetoodilisi töövõtteid  kirjaliku kõne osaoskuste arendamiseks õppejõu juhendamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}