{"uuid": "178758a5-941e-73bc-694e-3cfe44665260", "code": "sv-2025-autumn-openuniv-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-05T10:50:10", "title": {"en": "Tinkering with Educational Technology", "et": "Haridustehnoloogiaga tinkerdamine"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI06", "name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "label": {"en": "25/26 A block mode SV Eng", "et": "25/26 S SÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI06", "structural_unit_name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 104, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "While technology is usually conceived and investigated from the standpoint of those who design it, the significance and practical meaning that technology acquires over time is very much rooted in the way in which people and communities continuously tinker with technology creating purposes and new uses that were not originally envisaged by designers. This bears an untapped potential for education that this course would like to investigate.\nThe course is divided into three parts. The first part will offer a general introduction to an alternative approach to technology based on the notions of tinkering. This part of the course will provide the conceptual backbone for the activities that will be carried out in the next phases. \nIn the second part of the course students will be engaged in conducting an ethnographic inquiry whose main aim will be to allow them to apply ethnographic \"tools\" to gain first-hand knowledge into the practical meaning that tinkering have or may have in more educational practices. This part will be the chance for students to explore practically the notions described in the first part. \nThe third part of the course will be devoted to presenting and sharing the insights gained during the ethnographic inquiry.", "et": "Tehnoloogiat käsitletakse tavaliselt selle tootjate vaatepunktist, kuid olulisus ja praktiline tähendus, mille tehnoloogia ajapikku omandab, tuleneb paljuski hoopis viisist, kuidas inimesed ja kogukonnad tehnoloogiat pidevalt kasutavad ja sellele uusi kasutusotstarbeid ja -võimalusi nuputavad, mis ei olnud algselt tootjate poolt ette nähtud. Sellises loovas kasutuses (ingl k tinkering) peitub hariduse jaoks kasutamata potentsiaal, mida antud kursuse jooksul uuritakse.\nKursus koosneb kolmest osast. Esimene osa on sissejuhatus, kus tutvustatakse alternatiivset, loova kasutuse mõistel (tinkering) põhinevat lähenemisviisi tehnoloogiale ning laotakse teoreetiline aluspõhi järgmise kahe osa tegevustele.\nKursuse teises osas viivad üliõpilased läbi etnograafilise uurimuse, mille põhieesmärk on lasta neil rakendada etnograafilisi \"tööriistu\", omandamaks vahetuid teadmisi loova kasutuse praktilisest tähendusest hariduses. Kursuse esimeses osas käsitletud teooria leiab teises osas praktilise rakenduse.\nKolmandas osas esitletakse etnograafilise uurimuse käigus leitut ja õpitut."}, "objectives": [{"en": "The main goal of the course is to provide an overview and a first-hand experience concerning an alternative approach to technology that is based on the notions of tinkering. Specifically, the objectives of the course are: to get acquainted with the notions of tinkering with technology as alternative approach to technology in education; to explore the broader significance of tinkering with technology in our contemporary society; to identify, articulate and then share the main practical implications of a more bottom-up approach to technology based on tinkering for education; to gain first-hand experience as to the nature and practical relevance of tinkering in one's learning activities and workplace.", "et": "Kursuse peamine eesmärk on anda üliõpilastele ülevaade alternatiivsest lähenemisviisist tehnoloogiale, mis põhineb tehnoloogia looval kasutusel (ingl k tinkering), ning lasta neil seda ka vahetult kogeda. Täpsemalt on kursuse eesmärkideks (1) tutvustada ingliskeelset mõistet tinkering kui alternatiivset lähenemisviisi tehnoloogiale hariduses; (2) uurida tehnoloogia loova kasutuse laiemat tähendust meie kaasaegses ühiskonnas; (3) selgitada välja, sõnastada ning esitada tehnoloogia loova kasutuse peamised rakendusalad hariduses; (4) anda üliõpilastele vahetu kogemus, kuidas oma igapäevaelus ja töökohas tehnoloogiat loovalt kasutada ning mis on seesuguse loova kasutuse olemus ja praktiline tähendus."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "(1)\twill be acquainted with the notions of tinkering with technology as an alternative approach to technology in education; ", "et": "(1)\ttunneb tehnoloogia loova kasutuse mõistet (tinkering) kui alternatiivset lähenemisviisi tehnoloogiale hariduses;"}, {"en": "(2)\twill be able to make sense of the broader significance of tinkering with technology in our contemporary society;", "et": "(2)\tmõistab tehnoloogia loova kasutuse laiemat tähendust meie kaasaegses ühiskonnas;"}, {"en": "(3)\twill be able to identify, articulate and then share the main practical implications of a more bottom-up approach to technology based on tinkering for education; ", "et": "(3)\toskab selgitada välja, sõnastada ning esitada tehnoloogia loova kasutuse peamised rakendusalad hariduses;"}, {"en": "(4)\thas first-hand experience as to the nature and practical relevance of tinkering in one's everyday life and workplace;", "et": "(4)\ton omandanud vahetu kogemuse, kuidas oma igapäevaelus ja töökohas tehnoloogiat loovalt kasutada ning mis on loova kasutuse olemus ja praktiline tähendus;"}, {"en": "(5)\thas first-hand experience with an alternative approach to technology in education based on tinkering.", "et": "(5)\ton omandanud vahetu kogemuse, kuidas hariduses tehnoloogiale alternatiivselt läheneda, tuginedes loova kasutuse (tinkering) mõistele."}], "notes": {}}, "grading": {"independent_work": {"et": "E-learning: The main format in Block 1, 2, 3, 4 and 7 will be e-lectures. In block 6 e-learning will consist in the presentation (and discussion) of students' ethnographic inquiries.\n\nIndependent work in groups: Online discussions will be organized in Block 1,2,3,4. In each discussion students will be asked to join a debate a particular issue or case related to the topic discussed during the lectures. The discussions will take place in the course blog.\nEach online discussion will be opened in the course blog right after the end of the lecture, and it will remain open until the end of the block it concerns.\n\nIndependent individual work: During Block 5 students will be asked to conduct an ethnographic inquiry, which will give students the chance to put into practice the theoretical background introduce in the first part of the course. During Block 4 students will be given all details concerning how to conduct such inquiry. Students will be asked to select an issue and investigate it using ethnographic methods, which will be introduced in Block 4 (i.e., participant observation, auto-ethnography, interviews, etc.). \n\nGuidelines are given in the course blog."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Students will be asked to share the results of their  inquiry in a video presentation. \n"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "In order to pass the course, the students should share the results of the project work in a video presentation."}}], "grade_preconditions": {"et": "The presentation should be delivered by January 2026."}, "grade_evaluation": {}, "debt_elimination": {"et": "According to the agreement with the teacher in charge, following the rules set in university's study regulations."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "https://teams.microsoft.com/l/team/19%3AXEnfxaJCJM9CXNBslO1KRXvorG2VgbG08r_XxNQv8l41%40thread.tacv2/conversations?groupId=6477730e-3177-4963-9933-b76247f782ff&tenantId=6d356317-0d04-4abc-b6b6-8c9773885bb0", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "3bbe538a-8942-23a3-291d-6ef7bd65def1", "person_name": "Emanuele Bardone", "structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}, "min_students": 10}, "parent_uuid": "50313c0d-f752-4699-8441-f94377e465a7", "parent_code": "SVHI.06.046", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}