{"uuid": "787c1551-e1b8-9500-880a-5ea9e5864a44", "code": "SVHI.02.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-27T10:07:26", "title": {"en": "Assessment of a Child Development in Kindergarten", "et": "Lapse arengu hindamine koolieelses lasteasutuses"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "An overview of the nature, need and principles of child development assessment. Methods of assessing the child's development (observation, interview, tests, etc.). Analyzing the results of the child's development assessment, visualizing them to draw conclusions and documenting them (child's development folder). Taking into account the results of the child's development when planning and conducting educational and educational activities. Principles of preparing a description of the child's development. Cooperation with parents in assessing the child's development. The nature of school readiness and its different aspects. Assessment of school readiness.", "et": "Ülevaade lapse arengu hindamise olemusest, vajadusest ja põhimõtetest. Lapse arengu hindamise meetodid (vaatlus, intervjuu, testid jt). Lapse arengu hindamise tulemuste analüüsimine, nende visualiseerimine järelduste tegemiseks ja dokumneteerimine (lapse arengumapp). Lapse arengu tulemustega arvestamine õppe- ja kasvatustegevuse kavandamisel ja läbiviimisel. Lapse arengu kirjelduse koostamise põhimõtted. Koostöö lapsevanematega lapse arengu hindamisel. Koolivalmiduse olemus ja selle erinevad  aspektid. Koolivalmiduse hindamine."}, "objectives": [{"en": "To shape students' readiness to evaluate the child's development using appropriate methods in kindergarten up to school readiness. To develop skills to document the results of an assessment of child developmentand to take the results into account when planning and carrying out educational activities.", "et": "Kujundada tulevastes lasteaiaõpetajates valmisolek hinnata erinevate meetoditega lapse arengut koolieelses lasteasutuses koolivalmiduse saavutamiseni, arengu hindamise tulemusi dokumenteerida ja arvestada tulemustega õppe- ja kasvatustegevuste kavandamisel ja läbiviimisel."}], "learning_outcomes": [{"en": "The student having completed the subject:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1. understands the nature and principles of child development assessment and takes them into account in the assessment;", "et": "1. mõistab lapse arengu hindamise olemust ja põhimõtteid ning arvestab nendega hindamisel;"}, {"en": "2. knows and uses appropriate methods for assessment of child development, analyzes the results, draws conclusions and documents them;", "et": "2. teab ja oskab kasutada lapse arengu hindamiseks sobivaid meetodeid, tulemusi analüüsida, järeldusi teha ja dokumenteerida;"}, {"en": "3. uses the results of the assessment of the child's development for planning and conducting learning activities;", "et": "3. kasutab lapse arengu hindamise tulemusi õppe- ja kasvatustegevuse kavandamisel ja läbiviimisel;"}, {"en": "4. can assess the child's readiness for school;", "et": "4. oskab hinnata lapse koolivalmidust; "}, {"en": "5. can prepare a description of the child's development.", "et": "5. suudab koostada lapse arengu kirjeldust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}