{"uuid": "e51c6172-7e6e-2536-19a6-b2a5b540887c", "code": "SVHI.00.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-07-18T15:45:06", "title": {"en": "Development of Social and Emotional Skills", "et": "Sotsiaal-emotsionaalsete pädevuste arendamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Secure classroom climate, relationships in the classroom (teacher-student, between students, classroom culture), nurturing classroom climate. Brain maturation and executive functions, regulatory skills. Core regulatory processes (inhibitory control, attention control, set shifting, working memory), regulatory domains and domain-specific learning: social and emotional learning and skills. Noticing and supporting domain specific regulatory skills in the classroom. Teachers' responsibility and regulatory skills.  Behaviour recovery plan, the role of positive feedback in reinforcing positive behavior. The general and specific (tiered) impact in supporting regulatory skills, applying principles of UDL in supporting regulatory skills, noticing and supporting childrens' needs.", "et": "Teemad:\nTurvaline klassikeskkond, suhted klassis (õpilaste vahelised, õpetaja-õpilased), struktuur klassiruumis, klassikultuur). Aju areng, täidesaatvad funktsioonid, eneseregulatsioonioskused (baasilised ja valdkonna-spetsiifilised). Baasilised eneseregulatsioonioskused: (pidurdus, tähelepanu, ümberlülitus, töömälu). Spetsiifilised enesregulatsioonioskused: emotsiooni regulatsioon, sotsiaalsed oskused. Eneseregulatsiooni oskuste märkamine ja toetamine klassiruumis. Õpetajate endi eneseregulatsioonioskused, vastutus. Käitumise tugikava, tagasiside roll positiivse käitumise kinnistamisel. Eneseregulatsioonioskuste toetamise üldine ja spetsiifiline mõju, universaalselt kujundatud õppimine, lapse vajaduste märkamine ja toetamine."}, "objectives": [{"en": "To develop teachers' skills in structuring and guiding the teaching process with students of different ages and with different developmental needs. To shape the understanding of the importance of emotionally and socially secure classroom climate and develop skills for creating  a secure classroom climate. To support the formation of teachers self-efficacy for supporting children with special educational needs in the classroom environment.", "et": "Arendada õpetajate õppeprotsessi juhtimise ja struktureerimise oskusi erinevas vanuses ja erinevate arenguliste vajadustega õpilastega. \nToetada arusaama emotsionaalselt ja sotsiaalselt turvalise klassikliima kujundamise olulisusest ja arendada oskusi turvalise klassikliima kujundamiseks.  \nToetada õpetajate enesetõhusa hoiaku kujunemist erituge vajavate õpilaste toetamisel klassikeskkonnas."}], "learning_outcomes": [{"en": "The learner: \n- Understands and can support the development of regulatory skills in the classroom context. \n- Explains how support of regulatory skills and secure classroom climate supports the well-being and academic achievement of all students, and especially those who need extra support. \n- Has carried out an evidence-based intervention to support a student in the classroom, and analysed its impact.", "et": "\"Aine läbinud õppija:\n- loob vaimselt ja emotsionaalselt turvalise, arengut ja loovust toetava koostöise ning üksteist arvestava õpikeskkonna, lähtudes erinevate õppijate vajadustest.\n- mõtestab ja toetab õpilaste eneseregulatsiooni-oskuste arengut klassikontekstis.\n- põhjendab, kuidas eneseregulatsiooni-oskuste toetamine ja turvalise klassikeskkonna kujundamine mõjutab kõigi, sealjuures erituge vajavate õpilaste heaolu ja akadeemilisi tulemusi. \n- on ellu viinud sekkumistegevusi ühe õpilase toetamiseks ja tõenduspõhiselt analüüsinud oma tegevuse mõju. \""}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}