{"uuid": "34b215e9-9b82-1fa7-7ee0-7da83c96c462", "code": "SVHI.06.024", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Collaborative Learning", "et": "Koostöine õppimine"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI06", "structural_unit_name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI06", "name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is 100% web-based (in the Moodle). First, the students are introduced to a comprehensive understanding of collaborative learning through a framework of collaborative problem solving skills. Next, students complete a group assignment related to a collaborative problem solving activity. Once completed, they individually analyse the results from other groups, which are subsequently discussed in a webinar. Next, teaching of collaborative learning is introduced using instructional design principles found in cooperative learning. Then the second group assignment is posted in which students work together to prepare a presentation that will teach their classmates in the other groups about a topic provided by the instructor. Students work on this second assignment in steps with weekly deadlines. A final webinar is held to discuss the presentations from each group. Finally, the course finishes with an examination in the form of an e-test.", "et": "Kursus on 100% veebipõhine (Moodle'is). Esmalt selgitatakse üliõpilastele koostöise õppe ehk ühesõppe mõistet, rakendades selleks koostöiste probleemilahendamise oskuste raamistikku. Järgneb rühmaülesanne - koostöise probleemilahendamise ülesanne. Pärast ülesande lahendamist analüüsib iga rühmaliige teise rühma tulemusi, mida seejärel arutatakse nii foorumi kui vebinari vormis. Järgmisena tutvustatakse üliõpilastele koostöise õppe õpetamist, rakendades selleks ühisõppe õpikavanduse põhimõtteid. Seejärel postitatakse teine grupiülesanne. Selles valmistavad õpilased koos ette ettekande, milles õpetada teistele gruppidele õpetaja antud teemat. Õpilased täidavad iga nädal ülesande mõne etapi. Iga rühma esitluste üle arutlemiseks peetakse lõpus veebiseminar. Kursus lõpeb eksamiga, mis toimub e-testi vormis."}, "objectives": [{"en": "The aim of the course is to introduce a comprehensive understanding of collaborative learning through a framework of collaborative problem solving skills and to introduce principles for successfully teaching collaborative learning.", "et": "Kursuse eesmärk on aidata üliõpilastel omandada põhjalik arusaam koostöisest õppest ehk ühesõppest, rakendades selleks koostöiste probleemilahendamise oskuste raamistikku, ning tutvustada neile põhimõtteid koostöise õppe edukaks õpetamiseks."}], "learning_outcomes": [{"en": "After completing this course, students will be able to:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "(1) identify and understand different elements of collaborative learning;", "et": "(1) suudab tuvastada ja mõista koostöise õppe erinevaid elemente;"}, {"en": "(2) identify instructional principles for teaching collaborative learning;", "et": "(2) oskab tuvastada koostöise õppe õpetamise põhimõtteid;"}, {"en": "(3) analyse and assess collaborative learning activities;", "et": "(3) oskab analüüsida ja hinnata koostöiseid õpitegevusi;"}, {"en": "(4) critically think about methods for assessing collaboration skills.", "et": "(4) oskab mõelda kriitiliselt koostööoskuste hindamise meetoditele."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}