{"uuid": "cb052468-a9ef-0e6f-3ae3-014d6c1c3ef7", "code": "SVHI.01.080", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Learning", "et": "Õppimise alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course enables students to gain fundamental knowledge of the main cognitive and socio-emotional processes of learning in the context of learner development, in the following themes: cognitive development, physical development, brain and learning, perception and attention; memory; dangers of using digital devices; self-regulation and metacognition, learning competence; emotions; and language, speech and reading skills.", "et": "Ainekursus võimaldab omandada põhilised teadmised õppimise kognitiivsetest ja sotsioemotsionaalsetest põhiprotsessidest õppija arengu kontekstis läbi järgmiste teemade: kognitiivne areng, füüsiline areng, aju ja õppimine, taju ja tähelepanu; mälu; digivahendite kasutamisega kaasnevad ohud; eneseregulatsioon ja metakognitsioon, õpipädevus; emotsioonid ja pidurdusprotesseid; keel, kõne ja tekstimõistmine."}, "objectives": [{"en": "The course gives an overview of the main cognitive and socio-emotional processes of learning in the context of holistic development.", "et": "Kursus annab ülevaate õppimise kognitiivsetest ja sotsioemotsionaalsetest põhiprotsessidest õppija igakülgse arengu kontekstis."}], "learning_outcomes": [{"en": "On completion of the course, the student will", "et": "Kursuse läbinu "}, {"en": "*\tcomprehend learner's physical, cognitive and metacognitive development;", "et": "*\tmõistab õppija füüsilist, kognitiivset ja sotsioemotsionaalset arengut; "}, {"en": "*\tcomprehend the role of perception, attention, memory, emotions and self-regulation in the learning process;", "et": "*\tmõistab taju, tähelepanu, mälu, emotsioonide ja eneseregulatsioonioskuse rolli õpiprotsessis; "}, {"en": "*       notice the learners' self-regulation skills and interpret them based on theoretical models,", "et": "*      märkab õppijate eneseregulatsioonioskuse avaldumist ning tõlgendab seda teooriast lähtuvalt;"}, {"en": "*       set goals for his learning, plan and commit activities to support learners' self-regulation skills and learning competence proceeding from the needs,", "et": "*      kavandab ja viib ellu tegevusi toetamaks õppijate eneseregulatsioonioskust lähtuvalt praktika käigus märgatud vajadusest;"}, {"en": "*\tknow how to support pupils' learning process, considering their cognitive development,", "et": "*\tteab, kuidas õpetajana toetada õppijate õpiprotsessi ning õpipädevuse kujunemist arvestades nende kognitiivset arengut;"}, {"en": "*       be aware of dangers connected with using digital devices;", "et": "*      on teadlik digivahendite kasutamisega kaasnevatest ohtudest;"}, {"en": "*      analyze and feeds back his activities as a learner.", "et": "*      seab endale õppimiseks eesmärke, analüüsib ja tagasisidestab oma tegevust õppijana."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}