{"uuid": "1b367111-cc63-3058-c132-ee41192c411f", "code": "SVHI.01.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to New Learning Paradigm", "et": "Sissejuhatus nüüdisaegsesse õpikäsitusse"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course begins with an on-site session where contemporary learning paradigm with its main components will be introduced. The course continues with independent e-learning sessions, where the topics will be elaborated using course study materials, recommended literature which will be reinforced in the seminars. The students conduct a micro-study to understand how to capture the elements of the new learning paradigm in learning situations. Students analyse the studied situations and, based on what they have learned, propose alternative innovative solutions that meet the goal.", "et": "Kursus algab kontaktõppega, mille käigus tutvustatakse nüüdisaegse õpikäsituse kontseptsiooni ja avatakse selle põhikomponendid. Kursus jätkub e-õppes teemade käsitlemisega, tuginedes kursuse õppematerjalidele ja soovitatud kirjandusele. Üliõpilased viivad läbi mikro-uuringu, et mõista, kuidas leida nüüdisaegse õpikäsituse elemente õpisituatsioonides. Üliõpilased analüüsivad uuritud situatsioone ja pakuvad õpitule tuginevalt välja eesmärgile vastavaid alternatiivseid innovaatilisi lahendusi."}, "objectives": [{"en": "The course provides a general and systematic overview of contemporary learning paradigm and its characteristic learning and teaching methods. In addition, it guides students to relevant scientific literature and prepares them to study and shape educational practices.", "et": "Kursus annab üldise süsteemse ülevaate nüüdisaegsest õpikäsitusest ning sellele iseloomulikest õppimise ja õpetamise meetoditest. Lisaks juhatab kursus üliõpilased seotud teaduskirjanduse juurde ning valmistab neid ette omandatud teadmistele tuginevalt praktikaid uurima ja kujundama."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "(1) has a systematic overview about learning metaphors and its characteristic learning and teaching methods;", "et": "(1) omab süsteemset ülevaadet nüüdisaegsest õpikäsitusest ning sellele iseloomulikest õppimise ja õpetamise meetoditest;"}, {"en": "(2) has a general overview about problem-solving, inquiry-based learning, collaborative learning, and self-regulation and reflection;", "et": "(2) omab üldist ülevaadet probleemilahendamisest, uurimuslikust õppest, koostöisest õppimisest, eneseregulatsioonist ja refleksioonist;"}, {"en": "(3) has skills to analyse and plan for apt learning situations.", "et": "(3) oskab analüüsida ja kavandada sobivaid õpisituatsioone."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}