{"uuid": "09642bc9-fa13-8999-d6c6-607b7fc786d0", "code": "sv-2024-spring-openuniv-p2-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-13T11:37:26", "title": {"en": "English for Special Education Teachers (B2)", "et": "Erialane inglise keel eripedagoogidele (B2 keeletase)"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "label": {"en": "24/25 S block mode part 2 3 CP SV Eng", "et": "24/25 K SÕ 2. osa 3 EAP SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI02", "structural_unit_name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course students read and discuss different texts on special educational needs as well as other educational issues and get to know the related vocabulary. The topics include: studying at university, good learning practice, special educational needs, work of a SEN teacher, inclusive education, 21st century skills, etc. Students read scientific texts and make a literature review (autumn term) and an oral presentation (spring term).", "et": "Kursuse käigus töötatakse nii erinevate hariduslikke erivajadusi puudutavate kui ka üldiste haridusalaste tekstidega ning tutvutakse vastava sõnavaraga. Läbitavad teemad: õppimine ülikoolis, õppimise hea tava, hariduslikud erivajadused, eripedagoogi töö, kaasav haridus, 21. sajandi oskused jmt. Üliõpilased loevad erialast teksti ja koostavad selle põhjal kirjanduse ülevaate (sügissemester) ning suulise ettekande (kevadsemester)."}, "objectives": [{"en": "To expand students' vocabulary and improve their language skills on B2 language level for working independently with educational and methodological literature of their speciality.", "et": "Rikastada üliõpilaste sõnavara ja keelelisi oskusi B2 keeletasemel töötamaks iseseisvalt erialase (teadus)kirjandusega."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- knows essential vocabulary in the field of special education and general education, and comprehends speciality-related texts;", "et": "- tunneb olulisemat oskussõnavara ja mõistab erialaseid tekste;"}, {"en": "- discusses educational issues within the range of the vocabulary acquired;", "et": "- arutleb õpitud sõnavara piires haridusteaduslikel teemadel;"}, {"en": "- summarises and paraphrases educational texts;", "et": "- teeb kokkuvõtte erialasest tekstist ja parafraseerib seda;"}, {"en": "- compiles and makes an oral presentation on speciality-related literature;", "et": "- koostab ja esitab loetud erialase kirjanduse põhjal suulise ettekande;"}, {"en": "- analyses and gives feedback on peers' presentations.", "et": "- analüüsib ja tagasisidestab kaasüliõpilaste ettekandeid."}], "notes": {}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Eristav hindamine.\nKontrolltööde hinded moodustavad 50% (25%+25%) eksamihindest.\nMõlemas semestris toimub vähemalt 1 kontrolltöö.\nKontrolltööde abil hinnatakse erialase sõnavara omandamist, erialasest tekstist arusaamise oskust, kuulamisoskust, läbitud keelestruktuuride rakendamise oskust ja kirjutamisoskust B2 keeletasemel. Kontrolltöö koosneb erinevatest ülesandetüüpidest (näiteks: lünkade täitmine, valikvastustega ülesanded, teemale kirjutamine, õigete paaride sobitamine jne.).\nKontrolltöö hindamiskriteeriumid:\nA: 100-91%\nB: 90-81%\nC: 80-71%\nD: 70-61%\nE: 60-51%"}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Eristav hindamine.\nEttekande hinne moodustab eksamihindest 25%.\nEttekanne sooritatakse kevadsemestril kokkulepitud ajakava alusel ning tehakse inglise keeles.\nEttekanne põhineb üliõpilase poolt loetud haridusteemalisel ingliskeelsel teaduslikul artiklil või populaarteaduslikul tekstil ja kestab 6-8 minutit.\nEttekande koostamisel ja esitamisel lähtub üliõpilane suulise ettekande koostamiseks antud juhistest.\nEttekandega kontrollitakse erialasest teaduslikust tekstist arusaamist ja olulise informatsiooni leidmist, suulist väljendusoskust ja sõnavaralist ja grammatilist kompetentsust, esinemisoskust ja ettekande näitlikustamist.\nHindamiskriteeriumid:\nA: Esitlus on tervikuna väga veenev, loogiliselt üles ehitatud ja sorav. Esitlust on illustreeritud korrektsete slaididega ja see mahub etteantud ajavahemikku. Üliõpilane suudab vastata kuulajate küsimustele. Üliõpilane kasutab sihipäraselt B2 keeletasemele vastavat sõnavara, võib esineda üksikuid grammatilisi vigu ja hääldusvigu. Üliõpilane esineb selgelt ja arusaadavalt, omab väga head kontakti publikuga.\nB: Esitlus on üldiselt tervikuna veenev, loogiliselt üles ehitatud ja sorav. Esitlust on illustreeritud slaididega ja see mahub etteantud ajavahemikku. Üliõpilane suudab enamasti vastata kuulajate küsimustele. Üliõpilane kasutab küllaltki sihipäraselt B2 keeletasemele vastavat sõnavara, võib esineda grammatilisi vigu ja hääldusvigu. Üliõpilane esineb selgelt ja arusaadavalt, omab head kontakti publikuga.\nC: Esitlus on põhiosades selge ja veenev. Esitlust on illustreeritud slaididega ja see mahub üldjoontes etteantud ajavahemikku. Üliõpilane suudab enamasti vastata kuulajate küsimustele. Üliõpilane kasutab enamasti B2 keeletasemele vastavat sõnavara, esineb kohati grammatilisi vigu ja hääldusvigu. Üliõpilane esineb enamasti selgelt ja arusaadavalt, omab kontakti publikuga.\nD: Esitlus on vähe veenev. Slaidid ei illustreeri kohati ettekannet ja/või ettekanne ei mahu etteantud ajavahemikku. Üliõpilane ei suuda alati vastata kuulajate küsimustele. Üliõpilane kasutab osaliselt B2 keeletasemele vastavat sõnavara, esineb rohkesti grammatilisi vigu ja hääldusvigu. Üliõpilane esineb kohati ebaselgelt ja arusaamatult, kontakt publikuga nõrk.\nE: Esitlus on väga vähe veenev. Slaidid ei illustreeri ettekannet ja/või ettekanne ei mahu etteantud ajavahemikku. Üliõpilane ei suuda enamasti vastata kuulajate küsimustele. Üliõpilane kasutab vähesel määral B2 keeletasemele vastavat sõnavara, esineb rohkesti grammatilisi vigu ja hääldusvigu. Üliõpilane esineb kohati ebaselgelt ja arusaamatult, kontakt publikuga väga nõrk."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Mitteeristav hindamine\nArvestuse ja lõpphinde saamiseks peavad olema kodutööd sooritatud. Kodutöö alla kuuluvad erinevad kontrollitavad kirjalikud ja suulised ülesanded.\nHindamiskriteeriumid: Arvestatud töö vastab sisult, mahult ja vormistuselt esitatud nõuetele; kasutatud sõnavara ja keelestruktuurid vastavad enamasti B2 keeletasemele; võib esineda keelelisi vigu, kuid need ei sega teksti mõistmist."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Eristav hindamine.\nKodulugemise hinne moodustab 25% lõpueksami hindest.\nSügissemestril tuleb lugeda vähemalt 35 lk ingliskeelset erialast teksti ja välja kirjutada 35 väljendit, mille teadmist kontrollitakse kodulugemise vastamisel.\nHinne A - ülevaade on terviklik, esitus on ladus ja keelevigadeta; kasutatav sõnavara ja välja kirjutatud väljendid on vastavuses B2 keeletasemega; teab vähemalt 93% väljenditest.\nHinne C - ülevaade on arusaadav, kuid nõuab täpsustavaid küsimusi; esitus on üldiselt ladus, kuid esineb mõningaid keelevigu; kasutatav sõnavara ja välja kirjutatud väljendid vastavad enamasti B2 keeletasemele; teab vähemalt 77% väljenditest.\nHinne E - ülevaade on laialivalguv, kuid annab mõningase pildi; esitus on konarlik ja esineb rohkelt keelevigu; kasutatud sõnavara ja välja kirjutatud väljendid vastavad osaliselt B2 keeletasemele; teab vähemalt 60% väljenditest."}}], "grade_preconditions": {"et": "Mitteeristav hindamine (arvestus) sügissemestril, eristav hindamine kevadsemestril. Arvestuse saamiseks peavad olema sooritatud kontrolltööd positiivsele hindele, tehtud kodused tööd ja vastatud kodulugemine. Lõpphinde saamiseks peab olema sooritatud arvestus, kevadsemestri kodutööd, kontrolltööd ja sooritatud suuline ettekanne. \nOsavõtt auditoorsest tööst kohustuslik vähemalt 80% ulatuses.·Juhul, kui õppetööst on puudutud rohkem kui 50%, siis üliõpilane hindamisele ei pääse. Praktikumi- ja iseseisva töö tunnid tuleb läbida nii sügis- kui kevadsemestril."}, "grade_evaluation": {"et": "Õppeaasta kontrolltööde koondhinne 50% (25%+25%)\nSuuline ettekanne 25%\nKodulugemine 25%"}, "debt_elimination": {"et": "Võlgnevusi saab likvideerida kokkuleppel õppejõuga ning korduseksamit sooritada vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "ef9b2749-427f-4ce3-a25c-4e69dafdc762", "type": "MOODLE", "code": "SVHI.02.006_SO_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "c45d9b5b-a23d-5bc7-0471-2e8fe5365ac0", "person_name": "Evi Saluveer", "structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 24, "time": "2025-02-14", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Assessment. Inclusive education. 21st century skills"}, "description": {"et": "Types of assessment. Understanding inclusive education. Critical thinking"}}, {"course_week": 29, "time": "2025-03-21", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "21st century skills"}, "description": {"et": "Creative and criitical thinking. Digital skills "}}, {"course_week": 32, "time": "2025-04-25", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Making presentations"}, "description": {"et": "Choosing the topic. Oracy skills, signposting, presentation techniques"}}, {"course_week": 36, "time": "2025-05-09", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Summary of covered topics"}, "description": {"et": "Revision for the test"}}, {"course_week": 38, "time": "2025-05-23", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Test"}, "description": {"et": "Test"}}, {"course_week": 40, "time": "2025-06-06", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Making presentations"}, "description": {"et": "Student presentations"}}]}, "registration_info": {"audience": {}, "max_students": 18}, "parent_uuid": "a8a2fbab-30e7-f385-3086-b093cda07f67", "parent_code": "SVHI.02.006", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}