{"uuid": "e5a54ea3-7c79-52b6-d302-dc9624690486", "code": "SVHI.00.002", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "English for Early Years Teachers (B1)", "et": "Erialane inglise keel koolieelse lasteasutuse õpetajale (B1)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Different educational texts about pre-school education and early years' teachers' profession, teacher training practice in Estonia and elsewhere, most important issues, strategies, learning styles and methods, learning through playing, inclusive learning  and the themes chosen by students are treated. Discussions on educational issues are initiated. Different strategies are used: discussions, case studies, presentations, writing annotations in order to enrich both oral and written expression. Interactive approach and social learning are applied.", "et": "Kursuse käigus töötatakse erinevate pedagoogikaalaste tekstidega: alushariduse ja lasteaiaõpetaja elukutse spetsiifika; alushariduse õpetajate ettevalmistamine Eestis; õppimine mängu kaudu, erinevad õpistiilid ja -meetodid; kaasav õppimine, lasteaiad erinevates maades+üliõpilaste valitud teemad. Tundides arutletakse õpitud sõnavara piires tekstipõhistelt haridusteemadel. Arutelude, juhtumianalüüside ja ettekannete, rühma- ja paaristööd, suuliste ettekannete ja kirjalike refereeringute abil õpitakse rakendama suulist ja kirjalikku keelekasutust. Õpetamisel kasutatakse interaktiivseid võtteid ja sotsiaalset õppimist."}, "objectives": [{"en": "To enlarge students` vocabulary and develop their grammar skills on B1 language level in order to prepare students for independent work with literature in the field of pre-school and general education.", "et": "Rikastada üliõpilaste sõnavara ja grammatilisi oskusi B1 keeletasemel, töötamaks iseseisvalt alusharidusega seotud ja üldpedagoogilise kirjandusega."}], "learning_outcomes": [{"en": "On completion of the module the student:", "et": "Mooduli läbinud üliõpilane:"}, {"en": "- knows essential vocabulary in the field of education and comprehends speciality-related texts;", "et": "- tunneb olulisemat oskussõnavara ja mõistab erialaseid tekste;"}, {"en": "- discusses educational issues within the range of the vocabulary acquired;", "et": "- arutleb õpitud sõnavara piires haridusteaduslikel teemadel;"}, {"en": "- can summarize and paraphrase educational texts;", "et": "- oskab teha kokkuvõtte erialasest tekstist ja seda parafraseerida;"}, {"en": "- compiles and makes an oral presentation on speciality-related literature;", "et": "- koostab ja esitab loetud erialase kirjanduse põhjal suulise ettekande;"}, {"en": "- analyses and gives feedback on peers' presentations.", "et": "- analüüsib ja tagasisidestab kaasüliõpilaste ettekandeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}