{"uuid": "9b8d9129-5b05-5a68-ae18-d7c79da9a8a1", "code": "sv-2025-spring-openuniv-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-05T10:50:58", "title": {"en": "Educational Design for Complex Learning Tasks", "et": "Kõrgema taseme õppeülesannete kavandamine"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI06", "name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "label": {"en": "25/26 S block mode SV Eng", "et": "25/26 K SÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVHI06", "structural_unit_name": {"en": "Centre for Educational Technology", "et": "haridustehnoloogia keskus"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course content is mainly based on van Merriënboer and Kirchner's 4CID model.\nThe course is divided into four thematic blocks. Each block will cover one specific topic.\nBlock 1 will focus on the notion of instructional model, and it will introduce the ten steps design model, which is the instructional model that the course will be dealing with.\nWith Block 2 we will start dealing with the ten steps design model. The focus will be on how to define what a complex task is. We will then discuss the terms \"complex skill\" and \"complexity elements\".\nBlock 3 will focus on how to define \"tasks classes\" and \"learning tasks\".\nBlock 4 will focus on how to provide the right type of \"scaffolding\" for complex learning tasks.", "et": "Kursuse sisu põhineb peamiselt van Merriënboori ja Kirchneri 4CID mudelil.\nKursus on jagatud nelja temaatilisse plokki. Iga plokk hõlmab ühte kindlat teemat.\n1. plokk keskendub õppemudeli mõistele ja tutvustab kümneastmelist disainimudelit, mis on kursusel käsiteldav õppemudel.\n2. plokis hakkame tegelema kümneastmelise disainimudeliga. Keskendume sellele, kuidas määratleda, mis on keeruline ülesanne. Seejärel käsitleme mõisteid \"keerukas oskus\" ja \"keerukuse elemendid\".\n3. plokk keskendub \"ülesannete klasside\" ja \"õppeülesannete\" määratlemisele.\n4. plokk keskendub sellele, kuidas pakkuda keeruliste õppeülesannete jaoks õiget tüüpi tuge."}, "objectives": [{"en": "The overall objective of the course is to provide an overview of the design process for complex learning tasks paying attention to all its phases, namely, needs analysis, design, development, implementation, and evaluation. Students will also have the opportunity to develop concrete instructions, instructional materials, assessment and subsequently implement and evaluate them. The course will also aim at encouraging students to take responsibility for individual contributions, manage the design process and team members, as well as collaborate with the stakeholders.", "et": "Kursuse üldeesmärk on anda ülevaade keerukate õpiülesannete kavandamise protsessist, pöörates tähelepanu selle kõikidele etappidele, nimelt vajaduste analüüsile, kavandamisele, arendusele, rakendamisele ja hindamisele. Samuti on tudengitel võimalus välja töötada konkreetsed juhised, juhendmaterjalid, hindamine ning neid hiljem rakendada ja hinnata. Kursuse eesmärk on ka julgustada tudengeid võtma vastutust individuaalsete panuste eest, juhtima disainiprotsessi ja meeskonnaliikmeid ning tegema koostööd sidusrühmadega."}], "learning_outcomes": [{"en": "After completing the course, the student", "et": "Õppeaine läbinud õppija:"}, {"en": "1. has gained insight (scientific perspectives/criteria and customs) in the design process - needs analysis, design, development, implementation, and evaluation - for complex learning tasks.\n2. can apply the acquired insights to conduct a needs analysis in order to determine the necessity and demands of the to be developed series of lessons.\n3. can apply the acquired insights and needs assessment to develop a blueprint (design) for the customized instructions, instructional materials and assessments for a coherent and authentic series of lessons.\n4. is capable of developing concrete instructions, instructional materials, assessments and implementing them by providing pupil and teacher manuals.\n5. is capable of evaluating the quality and practical use of the series of lessons and offering suggestions for improvement (needs analysis, blue print, developed materials, and implementation).\n6. is capable to successfully participating in a design team by taking responsibility for individual contributions, managing the design process and team members, and collaborating with the stakeholders.", "et": "1. on omandanud ülevaate (teaduslikud vaatenurgad/kriteeriumid ja tavad) keeruliste õppeülesannete projekteerimisprotsessist - vajaduste analüüs, kavandamine, arendus, rakendamine ja hindamine.\n2. oskab omandatud teadmisi rakendada vajaduste analüüsi läbiviimiseks, et selgitada välja arendatava õppeülesande vajalikkus ja nõudmised.\n3. oskab omandatud teadmisi ja vajaduste hindamist rakendada kohandatud juhiste, juhendmaterjalide ja hinnangute kavandi väljatöötamiseks sidusa ja autentse õppeülesande jaoks.\n4. on võimeline välja töötama konkreetseid juhendeid, juhendmaterjale, hinnanguid ja neid ellu viima, pakkudes tudengitele ja õpetajatele mõeldud käsiraamatuid.\n5. on võimeline hindama õppetundide sarja kvaliteeti ja praktilist kasutamist ning pakkuma parendusettepanekuid (vajaduste analüüs, muster, väljatöötatud materjalid ja teostus).\n6. on võimeline edukalt osalema disainimeeskonnas, võttes vastutuse individuaalsete panuste eest, juhtides disainiprotsessi ja meeskonnaliikmeid ning tehes koostööd huvirühmadega."}], "notes": {}}, "grading": {"independent_work": {"et": "Guidelines will be provided in the course Moodle-environment."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Written work (the design and legitimation of series of lessons aimed at learning to carry out a complex learning task). Concrete guidelines for the assessment (content, number of words, grading, etc.) will be provided in the course Moodle-environment. The assessment will be carried out in groups of four (no more) students.\n\nFinal assessment(s) of part(s)\nDifferentiated assessment, in this course the following conversion table will be used:\nGrade and Numeric score\nA 9.00 - 10.00\nB 8.00 - 8.99\nC 7.00 - 7.99\nD 6.00 - 6.99\nE 5.00 - 5.99\nF 4.00 - 4.99\nG 1.00 - 3.99\n\nIn order to successfully complete this course, the assessment result should at least be graded with a \"D\"."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {}}], "grade_preconditions": {"et": "The assignment has to be submitted during the course and active involvement (e.g., working on assignment, discussing the course content) during the tutorials."}, "grade_evaluation": {"et": "A single assessment (i.e., written assignment) will be used, the course assessment result is, thus, solely based on this grade. In order to successfully complete this course, the assessment result should at least be graded with a \"D\"."}, "debt_elimination": {"et": "According to the agreement with the teacher in charge, following the rules set in university's study regulations."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "https:// Teams", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "3bbe538a-8942-23a3-291d-6ef7bd65def1", "person_name": "Emanuele Bardone", "structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}}, "parent_uuid": "e05e70ed-59c0-5419-edf9-eff7f3241e40", "parent_code": "SVHI.06.034", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}