{"uuid": "cbf24286-7c95-00f2-c7a6-17a29e62a455", "code": "SVHI.03.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practice for Special Educators: Remedial Teaching in School", "et": "Õpiabi praktikum eripedagoogidele"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI03", "structural_unit_name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI03", "name": {"en": "Department of Special Education and Speech Therapy", "et": "eripedagoogika ja logopeedia osakond"}, "email": "speced@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "e783e124-5243-0faa-3871-4f80c4cfeb59", "code": "HTEP.02.084", "title": {"en": "Methodology of Mother Tongue for Children with SEN I", "et": "Eesti keele õpe erivajadustega lastele I"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": true, "uuid": "5ad80215-944a-34f9-3a1b-ecf93419b10b", "code": "HTEP.01.047", "title": {"en": "Instruction of Mathematics for SEN Children I", "et": "Matemaatika õpe erivajadustega lastele I"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}]}, "overview": {"description": {"en": "Students learn to assess reading and writing skills and mathematical skills.\nStudents learn how to compose plans for therapy and sessions, choose and develop material for training, choose appropriative corrective work methods and sequence. Students practice (in the auditorium) applying corrective work methods (assistance lecturer).\nAnalyze cases (student descriptions and students written work).\nExamine and analyse remedial lessons in regular school.", "et": "Õpitakse uurima ja hindama õpiraskustega õpilaste kirjaliku kõne oskusi ning matemaatilisi oskusi.\nÕpitakse õpiraskustega õpilaste arengu korrigeerimiseks sobiva harjutusmaterjali valimist ja/või koostamist, töövõtete valimist ja järjestamist ning planeeritud tegevuste vormistamist tunnikonspektina.\nÜliõpilased harjutavad auditooriumis erimetoodiliste töövõtete rakendamist, õppeülesannete ning tunnietappide ettevalmistamist ja läbiviimist.\n\nAnalüüsitakse juhtumeid (õpilaste kirjeldused ja kirjalikud tööd).\nVaadeldakse ja analüüsitakse õpiabitunde tavakoolis."}, "objectives": [{"en": "Accumulate theoretical knowledge of how to assess and support student with learning difficulties in general education schools (reading and writing skills, mathematical skills).", "et": "Teoreetiliste teadmiste seostamine ja kinnistamine õpiraskustega õpilaste arengu  hindamise ja toetamise võimalustest üldhariduskoolis (lugemis- ja kirjutamisoskus, matemaatilised oskused)."}, {"en": "Planning and conducting learning and development activities to support the development of students with learning difficulties.", "et": "Õpiraskustega õpilaste arengut toetavate õppe- ja arendustegevuste planeerimise ja läbiviimise harjutamine praktikumides."}], "learning_outcomes": [{"en": "1. Student is able to assess reading and writing skills and mathematical skills.", "et": "1. Üliõpilane oskab uurida ja hinnata kirjaliku kõne oskusi ja matemaatilisi oskusi."}, {"en": "2. Student compose sessions plans, choose and develop material for training, based on the needs of student (reading and writing difficulties and/or mathematical difficulties).", "et": "2. Üliõpilane oskab koostada tööplaane ja tunnikavasid, valib või koostab sobivat harjutusmaterjali, lähtudes õpilase erivajaduse iseloomust (lugemis-ja kirjutamisraskused ja/või raskused matemaatikas)."}, {"en": "3. Student has primary practice experience applying corrective work methods (practical lessons placement in the auditorium, supervised by lecturer).", "et": "3. Üliõpilasel on esmased praktilise harjutamise kogemused erimetoodiliste töövõtete rakendamisel (praktikumid toimuvad auditooriumis õppejõu juhendamisel)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}