{"uuid": "7a1a4d8e-c63f-c149-ffc8-61845cedef94", "code": "SVHI.01.040", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Strategic Management of Educational Institution", "et": "Haridusasutuse strateegiline juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "During the course, the most common contemporary approaches to strategic management, planning and implementing the organisational strategy will be introduced. The various topics of performance management investigated in this course, while the themes of performance appraisal, compensation and development are more focused among others. Learning process serves as a framework for the courses \"Creation of the learning organisation culture and leadership in the context of community\" and \"Managing and administration of educational institution in the context of community and environment\". Practitioners are involved in teaching the course.", "et": "Õppeaine läbimise käigus antakse ülevaade levinumatest nüüdisaegsetest lähenemistest strateegilisele juhtimisele, organisatsiooni strateegia kavandamisest ning elluviimisest. Kursuse käigus käsitletakse töötajate töösoorituse juhtimise, sh hindamise, töötasustamise ja arendamise teemasid. Õppeprotsess on kavandatud raamistama ainete \"Õppiva organisatsiooni kultuuri loomine ja juhtimine kogukonna kontekstis\" ja \"Haridusasutuse korraldus ja administreerimine ümbritseva keskkonna ja kogukonna kontekstis\" läbimist. Aine läbiviimisel kaasatakse praktikuid."}, "objectives": [{"en": "The aims of the course are:", "et": "Õppeaine eesmärgid on:"}, {"en": "To provide an overview of contemporary approaches to strategic management and performance and quality management models.", "et": "Anda ülevaade strateegilise juhtimise nüüdisaegsetest mudelitest ning tulemuslikkuse- ja kvaliteedijuhtimise alastest lähenemistest"}, {"en": "To pass on experience on developing and implementing the strategy of an educational institution.", "et": "Edastada kogemust, kuidas kavandada ja ellu viia haridusasutuse strateegiat."}, {"en": "To support the creation of links between operating principles of an educational organisation and community (and societal) development.", "et": "Toetada seoste loomist haridusorganisatsiooni toimimise põhimõtete ning kogukonna  ja ühiskonna arengu vahel."}, {"en": "To support the capability of students to analyse the influence of education policy decisions to the education system and in a long term the society as a whole.", "et": "Arendada üliõpilaste võimekust analüüsida hariduspoliitiliste otsustuste mõju haridussüsteemile ja pikemas perspektiivis ühiskonnale tervikuna."}, {"en": "To acquire knowledge about performance management (performance appraisal, compensation) theories and skills in the context of employees and organization development and effectiveness.", "et": "Omandavad teadmised ja oskused töötajate  töösoorituse juhtimise (töötajate hindamise, motiveerimise ja tasustamise) uuematest käsitlustest ning organisasatsioni efektiivsuse tõstmisest ja arendamisest."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "Is able to evaluate the influence of education policy decisions on the school system and to describe the resulting power relations which influence the development of the society.", "et": "Oskab hinnata hariduspoliitiliste otsustuste mõju koolisüsteemile ning kirjeldada sellest tulenevaid uusi jõuvälju, mis mõjutavad ühiskonna arengut."}, {"en": "Understands the mechanisms influencing the development of the school system and society.", "et": "Mõistab koolisüsteemi ja ühiskonna arengut mõjutavate mehhanismide toimet."}, {"en": "Knows the principles and models of strategic management and performance and quality management.", "et": "Teab strateegilise ja tulemuslikkuse juhtimise ning kvaliteedijuhtimise põhimõtteid ja mudeleid."}, {"en": "Is able to draft a strategic management plan and process analysis for an organisation, based on a chosen model.", "et": "Oskab koostada organisatsiooni strateegilise juhtimise kava ja protsessianalüüsi, tuginedes ühele valitud mudelile."}, {"en": "Is able to relate strategic planning to the everyday management of the organisation.", "et": "Oskab seostada strateegilist planeerimist organisatsiooni igapäevajuhtimisega."}, {"en": "Understands the role of performance management in development of organisation from the manager's and the employee's perspective and in the context of organization effectiveness.", "et": "Mõistab ja oskab analüüsida töösoorituse juhtimise komponente ja kohta organisatsiooni arendamisel, nii töötaja kui juhi töö spetsiifikast ja organisatsiooni tulemuslikkusest lähtuvalt."}, {"en": "Can analyse theoretical and practical issues of performance management and foresee positive and negative effects performance management.", "et": "Oskab analüüsida töösoorituse hindamise ja töötasustamise teoreetilisi ja praktilisi küsimusi ning prognoosida töösoorituse juhtimise positiivseid ja negatiivseid tagajärgi organisatsioonis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}