{"uuid": "c93e1495-c7ad-ac6d-702b-850a8b0fc3ee", "code": "sv-2025-spring-openuniv-p2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-10T15:34:30", "title": {"en": "English for Early Years Teachers (B2)", "et": "Erialane inglise keel koolieelse lasteasutuse õpetajale (B2)"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S block mode part 2 3 CP SV", "et": "25/26 K SÕ 2. osa 3 EAP SV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 20, "seminar": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "During the course students read and discuss different texts on early childhood education as well as other educational issues and get to know the related vocabulary. The possible topics include: early years teachers and their work, pre-school curriculum and related topics, children's development, play and toys, special educational needs and inclusive education, studying at university and good learning practice, etc. Students read speciality-related (scientific) texts and make a literature review (autumn term) and an oral presentation (spring term).", "et": "Kursuse käigus töötatakse nii erinevate alusharidust puudutavate kui ka üldiste haridusalaste tekstidega ning tutvutakse vastava sõnavaraga. Võimalikud läbitavad teemad: koolieelse lasteasutuse õpetajad ja nende töö, koolieelse lasteasutuse õppekava ja sellega seotud temaatika, laste areng, mäng ja mänguasjad, hariduslikud erivajadused ja kaasav haridus, õppimine ülikoolis ja õppimise hea tava jmt. Üliõpilased loevad erialast teksti ja koostavad selle põhjal ülevaate (sügissemester) ning suulise ettekande (kevadsemester)."}, "objectives": [{"en": "To enlarge students` vocabulary and develop their language skills on B2 language levels in order to prepare students for independent work with literature in the field of pre-school and general education.", "et": "Rikastada üliõpilaste sõnavara ja keelelisi oskusi B2 keeletasemel, töötamaks iseseisvalt alusharidusega seotud ja üldpedagoogilise kirjandusega."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "- knows essential vocabulary in the field of education and comprehends speciality-related texts;", "et": "- tunneb olulisemat oskussõnavara ja mõistab erialaseid tekste;"}, {"en": "- discusses educational issues within the range of the vocabulary acquired;", "et": "- arutleb õpitud sõnavara piires haridusteaduslikel teemadel;"}, {"en": "- summarises and paraphrases educational texts;", "et": "- teeb kokkuvõtte erialasest tekstist ja parafraseerib seda;"}, {"en": "- compiles and makes an oral presentation on speciality-related literature;", "et": "- koostab ja esitab loetud erialase kirjanduse põhjal suulise ettekande;"}, {"en": "- analyses and gives feedback on peers' presentations.", "et": "- analüüsib ja tagasisidestab kaasüliõpilaste ettekandeid."}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisvate tööde loetelu ja juhised on Moodle'is."}, "independent_work_assessments": [{"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Eristav hindamine.\nKodulugemise hinne moodustab 25% lõpphindest.\nSÜGISSEMESTRIL tuleb lugeda vähemalt 35 lk ingliskeelset erialast teksti ja välja kirjutada 35 väljendit, mille teadmist kontrollitakse kodulugemise vastamisel.\nHinne A - ülevaade on terviklik, esitus on ladus ja keelevigadeta; kasutatav sõnavara ja välja kirjutatud väljendid on vastavuses B2 keeletasemega; teab vähemalt 93% väljenditest.\nHinne C - ülevaade on arusaadav, kuid nõuab täpsustavaid küsimusi; esitus on üldiselt ladus, kuid esineb mõningaid keelevigu; kasutatav sõnavara ja välja kirjutatud väljendid vastavad enamasti B2 keeletasemele; teab vähemalt 77% väljenditest.\nHinne E - ülevaade on laialivalguv, kuid annab mõningase pildi; esitus on konarlik ja esineb rohkelt keelevigu; kasutatud sõnavara ja välja kirjutatud väljendid vastavad osaliselt B2 keeletasemele; teab vähemalt 60% väljenditest."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Eristav hindamine.\nKontrolltööde hinded moodustavad 50% (25% sügissemester + 25% kevadsemester) lõpphindest.\nMÕLEMAS SEMESTRIS toimub üks kontrolltöö.\nKontrolltööde abil hinnatakse erialase sõnavara ja teemade omandamist, kuulamis- ja kirjutamisoskust B2 keeletasemel. Kontrolltöö koosneb erinevatest ülesandetüüpidest (näiteks: lünkade täitmine, valikvastustega ülesanded, teemale kirjutamine, õigete paaride sobitamine jne.).\nKontrolltöö hindamiskriteeriumid:\nA: 100-91%\nB: 90-81%\nC: 80-71%\nD: 70-61%\nE: 60-51%"}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Eristav hindamine.\nEttekande hinne moodustab lõpphindest 25%.\nEttekanne sooritatakse KEVADSEMESTRIL kokkulepitud ajakava alusel ja tehakse inglise keeles.\nEttekanne põhineb üliõpilase poolt loetud ingliskeelsel haridusteemalisel teaduslikul artiklil/populaarteaduslikul tekstil ja kestab 5 minutit. Suurte keelerühmade puhul tehakse ettekanne paaristööna (8-9 minutit).\nEttekande koostamisel ja esitamisel lähtub üliõpilane suulise ettekande juhendist (vt Moodle'is \"Checklist for an oral presentation\").\nEttekandega kontrollitakse erialasest (teaduslikust) tekstist arusaamist ja olulise informatsiooni leidmist, suulist väljendusoskust ning sõnavaralist ja grammatilist kompetentsust, esinemisoskust ja ettekande näitlikustamist.\nHindamiskriteeriumid:\nA: Esitlus on tervikuna väga veenev, loogiliselt üles ehitatud ja sorav. Esitlust on illustreeritud korrektsete slaididega ja see mahub etteantud ajavahemikku. Üliõpilane suudab vastata kuulajate küsimustele. Üliõpilane kasutab sihipäraselt B2 keeletasemele vastavat sõnavara, võib esineda üksikuid grammatilisi vigu ja hääldusvigu. Üliõpilane esineb selgelt ja arusaadavalt, omab väga head kontakti publikuga.\nB: Esitlus on üldiselt tervikuna veenev, loogiliselt üles ehitatud ja sorav. Esitlust on illustreeritud slaididega ja see mahub etteantud ajavahemikku. Üliõpilane suudab enamasti vastata kuulajate küsimustele. Üliõpilane kasutab küllaltki sihipäraselt B2 keeletasemele vastavat sõnavara, võib esineda grammatilisi vigu ja hääldusvigu. Üliõpilane esineb selgelt ja arusaadavalt, omab head kontakti publikuga.\nC: Esitlus on põhiosades selge ja veenev. Esitlust on illustreeritud slaididega ja see mahub üldjoontes etteantud ajavahemikku. Üliõpilane suudab enamasti vastata kuulajate küsimustele. Üliõpilane kasutab enamasti B2 keeletasemele vastavat sõnavara, esineb kohati grammatilisi vigu ja hääldusvigu. Üliõpilane esineb enamasti selgelt ja arusaadavalt, omab kontakti publikuga.\nD: Esitlus on vähe veenev. Slaidid ei illustreeri kohati ettekannet ja/või ettekanne ei mahu etteantud ajavahemikku. Üliõpilane ei suuda alati vastata kuulajate küsimustele. Üliõpilane kasutab osaliselt B2 keeletasemele vastavat sõnavara, esineb rohkesti grammatilisi vigu ja hääldusvigu. Üliõpilane esineb kohati ebaselgelt ja arusaamatult, kontakt publikuga nõrk.\nE: Esitlus on väga vähe veenev. Slaidid ei illustreeri ettekannet ja/või ettekanne ei mahu etteantud ajavahemikku. Üliõpilane ei suuda enamasti vastata kuulajate küsimustele. Üliõpilane kasutab vähesel määral B2 keeletasemele vastavat sõnavara, esineb rohkesti grammatilisi vigu ja hääldusvigu. Üliõpilane esineb kohati ebaselgelt ja arusaamatult, kontakt publikuga väga nõrk."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Mitteeristav hindamine\nArvestuse ja lõpphinde saamiseks peavad olema kodutööd sooritatud. Kodutöö alla kuuluvad erinevad praktikumides kontrollitavad kirjalikud ja suulised ülesanded.\nHindamiskriteeriumid: \nArvestatud töö vastab sisult, mahult ja vormistuselt esitatud nõuetele; kasutatud sõnavara ja keelestruktuurid vastavad enamasti B2 keeletasemele; võib esineda keelelisi vigu, kuid need ei sega teksti mõistmist."}}], "grade_preconditions": {"et": "Mitteeristav hindamine (arvestus) sügissemestril, eristav hindamine kevadsemestril. Arvestuse saamiseks peab olema sooritatud kontrolltöö positiivsele hindele, tehtud kodused tööd ja vastatud kodulugemine. Lõpphinde saamiseks peab olema sooritatud arvestus, kevadsemestri kontrolltöö, kodutööd ja sooritatud suuline ettekanne.\nOsavõtt auditoorsest tööst kohustuslik vähemalt 80% ulatuses. Juhul, kui õppetööst on puudutud rohkem kui 50%, siis üliõpilane hindamisele ei pääse. Praktikumi- ja iseseisva töö tunnid tuleb läbida nii sügis- kui kevadsemestril."}, "grade_evaluation": {"et": "Õppeaasta kontrolltööde koondhinne 50% (25% sügissemester + 25% kevadsemester)\nSuuline ettekanne 25%\nKodulugemine 25%"}, "debt_elimination": {"et": "Võlgnevusi saab likvideerida kokkuleppel õppejõuga ning korduseksamit sooritada vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Kontrolltööde tulemused selguvad 1-2 nädala jooksul peale kontrolltöö sooritamist (sõltuvalt rühma suurusest)."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "materials": [{"name": {"et": "Kohustuslikud õppematerjalid antakse õppejõu poolt kursuse jooksul või on üleval Moodle-is."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "ed2383c5-4084-706e-5fdc-424b4798674b", "person_name": "Kristel Ruutmets", "structural_unit": {"code": "SVHI02", "name": {"en": "School of Teacher Education", "et": "õpetajate seminar"}, "email": "ttc@ut.ee", "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Topic 5: Teachers' and children's health"}, "description": {}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {"et": "Topic 6: Special educational needs"}, "description": {}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {"et": "Topic 7: Fears and bullying"}, "description": {}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {"et": "Test (topics 5-7); Preparing for presentations"}, "description": {}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 5, "topic": {"et": "Making presentations"}, "description": {}}]}, "registration_info": {"audience": {"et": "KELA 2. kursuse sessioonõppe üliõpilased, kelle inglise keele tase on B2 (inglise keele riigieksami tulemus vähemalt 70p)."}, "min_students": 10, "max_students": 20}, "confirmation_process": {"confirmation_uuid": "7ce696c8-c2df-2949-3e69-d5949d412f27", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "c5603066-6c85-70cb-4ce3-0f5f12c5dd03", "parent_code": "SVHI.00.003", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}