{"uuid": "e67939cc-2db4-57bc-0970-6ff02125be55", "code": "sv-2025-autumn-openuniv-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-05T10:57:36", "title": {"en": "Critical Issues of Technology Use in Education", "et": "Tehnoloogiakasutuse kriitilised teemad hariduses"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 A block mode SV Eng", "et": "25/26 S SÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 104, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "In the last couple of decades the pace of technological change and development has been increasing and ubiquitous. New digital technologies comprising services, applications and gadgets have been introduced and as a result many aspects of education have been re-imagined in the light of new possibilities concerning where, how, and when teaching and learning experiences can take place. Besides, digital technologies have been often called for in order to provide immediate solutions to problems related to the organization of teaching and learning as well as their effectiveness. However, such promises did not quite materialize. Conversely, the rapid pace at which new gadgets, services and tools have been introduced has generated an unprecedented variety and increased complexity, affecting the way in which education can have an impact on society. \nThe course offers the opportunity to navigate the current educational landscape by developing the proper thinking tools to address complexity. \nThe course is divided into three parts. The first part will be revolving around the presentation and discussion of a number of cases related to the role of technology in education and society. The purpose of this block will be to engage students in deep conversations and help them develop a more multifaceted approach to technology.\nIn the second part of the course students will be engaged in conducting an inquiry whose main aim will be to investigate a case of interest for the student. This part will be the chance for students to explore practically the notions described in the first part and develop their ability to think.\nThe third part of the course will be devoted to presenting and sharing the insights gained during the inquiries conducted by the students.", "et": "Viimasel paaril kümnendil on tehnoloogia areng olnud üha kiirenev ja kõikehõlmav. Kasutusele on võetud palju uusi digitaalseid tehnoloogiaid - teenuseid, rakendusi ja vidinaid -, mille tulemusel on paljude uute võimaluste (kus, kuidas ja millal õppimine ja õpetamine saab toimuda) valguses muutunud ka suhtumine paljudesse hariduse aspektidesse. Samuti on digitehnoloogiast loodetud kohest lahendust õpetamise ja õppimisega seotud probleemidele ning nende efektiivsuse tõstmist. Need lootused ei ole aga päris realiseerunud. Vastupidi - uute vidinate, teenuste ja tööriistade kiire kasutuselevõtt on tekitanud pretsedenditu hulga valikuvõimalusi ja muutnud hariduse olukorra, sh hariduse võimalused ühiskonda mõjutada paljuski keerukamaks.\nKursus annab üliõpilastele võimaluse arendada oma mõtlemisoskusi, et suuta ja osata navigeerida tänapäeva keerukal haridusmaastikul. \nKursus koosneb kolmest osast. Esimeses osas esitletakse ja arutatakse näiteid tehnoloogia rolli kohta hariduses ja ühiskonnas. Selle osa eesmärk on kaasata üliõpilased sügavuti minevatesse aruteludesse ja aidata neil tehnoloogia suhtes välja kujundada mitmetahulisem hoiak.\nKursuse teises osas viivad üliõpilased läbi uurimuse neile huvitaval teemal. See võimaldab neil praktilisemalt uurida kursuse esimeses osas käsitletud teemasid ning arendada oma mõtlemisoskusi.\nKolmandas osas esitlevad üliõpilased oma uurimuste tulemusi ja jagavad nende käigus tekkinud mõtteid."}, "objectives": [{"en": "This course is designed so as to give students the chance to think and subsequently develop conversations on the broader meaning that technology (and innovation) has or could have in education. ", "et": "Kursuse eesmärk on anda üliõpilastele võimalus mõelda ja arutleda, mis on või võiks olla tehnoloogia (ja innovatsiooni) laiem tähendus hariduses."}, {"en": "Specifically, the objectives of the course are:", "et": "Täpsemalt on kursuse eesmärkideks"}, {"en": "- to give an overview of the kind of complexity characterizing the relationship between education and technology;", "et": "- anda ülevaade hariduse, ühiskonna ja tehnoloogia vahelise suhte keerukusest;"}, {"en": "- to develop a reflective stance on the meaning of innovation and technology in education;", "et": "- anda võimalus reflekteerida innovatsiooni ja tehnoloogia tähenduse üle hariduses;"}, {"en": "- to share experiences and insights as to the role that innovation and technology can play in education and society;", "et": "- jagada kogemusi ja mõtteid innovatsiooni ja tehnoloogia rolli kohta hariduses;"}, {"en": "- to develop the capacity to make decisions regarding complex issues related to technology and education.", "et": "- arendada võimet teha otsuseid tehnoloogia ja hariduse keerukatel teemadel."}], "learning_outcomes": [{"en": "After completing this course the student will:", "et": "Pärast kursuse läbimist on üliõpilane"}, {"en": "- be acquainted with complex relationships that are developing between education and technological innovation;", "et": "- kursis hariduse, ühiskonna, tehnoloogia ja innovatsiooni vaheliste suhete keerukusega;"}, {"en": "- adopt a reflective stance on innovation and technology in education;", "et": "- välja arendanud reflekteeriva hoiaku innovatsiooni ja tehnoloogia suhtes hariduses;"}, {"en": "- be able to articulate and share his/her own experiences and insights concerning the role of technology and innovation in the educational practice;", "et": "- suuteline määratlema ja jagama omaenda kogemusi ja mõtteid tehnoloogia ja innovatsiooni rolli kohta hariduses;"}, {"en": "- be able to make decisions concerning complex issues in education and technology.", "et": "- suuteline tegema otsuseid hariduse ja tehnoloogia keerukatel teemadel."}], "notes": {}}, "grading": {"independent_work": {"et": "Independent individual work: During Block 2 students will be asked to conduct an inquiry, which will give students the chance to put into practice the theoretical background introduce in the first part of the course. Students will be given all details concerning how to conduct such inquiry. Students will be asked to select an issue and investigate it using ethnographic methods, which will be introduced in Block 1 (i.e., participant observation, auto-ethnography, interviews, etc.).\n\nGuidelines are given in the course platform."}, "independent_work_assessments": [{"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Students will be asked to share the results of their ethnographic inquiry in a video presentation. \n\n"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "In order to pass the course, the students should share the results of the project work in a video presentation."}}], "grade_preconditions": {"et": "The oral presentation should be submitted by the 20th of January 2026."}, "grade_evaluation": {}, "debt_elimination": {"et": "According to the agreement with the teacher in charge, following the rules set in university's study regulations."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "Teams", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "3bbe538a-8942-23a3-291d-6ef7bd65def1", "person_name": "Emanuele Bardone", "structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {}}, "parent_uuid": "e1009ccf-5558-d97b-58bc-a303c3c79293", "parent_code": "SVHI.06.045", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}