{"uuid": "1faf0514-4f60-2625-47ac-058c317297a0", "code": "sv-2024-spring-openuniv-p1", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-04T13:28:56", "title": {"en": "Creating of Learning Organization and Leading in the Context of Community", "et": "Õppiva organisatsiooni kultuuri loomine ja juhtimine kogukonna kontekstis"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "1", "et": "1. osa", "en": "part 1"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode part 1 3 CP SV", "et": "24/25 K SÕ 1. osa 3 EAP SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 16, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course provides an overview of organizational leadership, leadership styles, empowerment, collaborative leadership and group coaching in the context of a learning organization. Acquiring the methodology of group coaching and conducting an experiment in an educational institution and shaping the corresponding organizational culture. Acquiring techniques based on coaching ideas: listening to each other, arguing, asserting oneself, etc. Managing conflicts in an educational institution.", "et": "Õppeaine läbimise käigus antakse ülevaade organisatsiooni eestvedamisest, eestvedamisstiilidest, mõjuvõimust, koostööl põhinevast eestvedamisest ja grupicoachingust õppiva organisatsiooni tingimustes. Grupicoachingu metoodika omandamine ja  eksperimendi läbi viimine haridusasutuses ning sellele vastava organisatsioonikultuuri  kujundamine.  Coachingu ideedel põhinevate tehnikate omandamine: teineteise kuulamine, argumenteerimine, enesekehtestamine jt. Konfliktide juhtimine haridusasutuses. "}, "objectives": [{"en": ".", "et": "Õppeaine eesmärkideks on:\nOmandada pädevused õppiva organisatsiooni määratlemise, kujundamise ja analüüsimise kohta haridusasutuses. Õppiva organisatsiooni eestvedamise, loovate arutelude ning haridusasutuse ja töötajate arendamise ja seda mõjutavate tegurite analüüsi ja sünteesi oskuste omandamine. Grupicoachingu metoodika omandamine ja GC eksperimendi läbi viimine."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "A student who has completed the subject:\nCan understand and creatively analyze the main activities of a learning organization in an educational institution.\nCan map the competencies of a manager/leader of a learning organization and analyze them when leading an educational institution in accordance with their own experience.\nUnderstanding and creatively implementing a collaborative organizational culture and conflict management in an educational institution.\nAcquiring, analyzing, and creatively implementing leadership and influencing techniques in directing the activities of an educational institution.\nAcquiring group coaching methodology and conducting a GC experiment in resolving work cases in educational institutions. Developing employees during GC. Acquiring cooperation development, management, and discussion skills.", "et": "Õppeaine edukalt läbinud üliõpilane:\nSuudab mõista ning loovalt analüüsida ja rakendada õppiva organisatsiooni põhitegevusi haridusasutuses.\nOskab kaardistada õppiva organisatsiooni juhi/liidri pädevusi ning neid analüüsida haridusasutuse eestvedamisel kooskõlas oma kogemustega.\nKoostöise organisatsioonikultuuri ja konfliktide juhtimise alaste teadmiste mõistmine ja loov rakendamine haridusasutuses.\nEestvedamise ja mõjutamise tehnikate omandamine, analüüsimine ja loov rakendamise haridusasutuse tegevuse suunamisel.\nGrupicoachingu metoodika omandamine ja GC eksperimendi läbi viimine tööjuhtumite lahendamisel haridusasutustes. Töötajate arendamine GC käigus. Koostöö arendamise ning juhtimis- ja diskussioonioskuste omandamine."}], "notes": {}}, "grading": {"independent_work": {"et": "1) Iga magistrant koostab personaalse õpipäeviku vastavalt õppeaine ajakavas toodud kolme (1, 3 ja 4) seminari põhiteemade raames. Grupicoachingu (teiseks) seminariks õpipäevikut koostada ei tule. Õpipäeviku koostamisel valige teid enam huvitavad alateemad (kuni kolmandiku ulatuses aines pakutavast). Käsitlege neid oma kogemustest lähtuvalt, tooge näiteid ja seostage õppematerjalidega ning 2023-2025. a. avaldatud teaduskirjandusega (viidake korrektselt; Autor, aasta). \nÜhe õpipäeviku maht on 3 lk (Word fail, mitte link; kokku 3x3=9 lk, ühes failis, reavahe üksik, täht 12). Kasutage kolmes õpipäevikus kokku vähemalt kuut 2023-2025.a. Scopuse või WoS andmebaasides avaldatud teadusallikat. Koostage analüütilisi ja sünteesivaid tabeleid ja/või jooniseid. Õpipäevikud esitage ühes failis iga kohtumise eel moodles (va GC seminariks) ning täiendage neid peale õppetöö toimumist. Hiljemalt 24 tundi enne viimast seminari esitage õpipäevikute 1+2+3 koondversioon moodles ning saatke oma GC tiimikaaslasele retsenseerimiseks (kellega viisite läbi GC eksperimendi). Esitage hiljemalt viimase seminari alguseks oma tiimikaaslase õpipäeviku retsensioon (moodle foorumis, kuni üks lk; tugevused ja võimalused).\n2) Grupicoachingu (GC) eksperiment viige läbi koostöös tiimikaaslas(t)ega, kelle valite esimeses seminaris. GC metoodika omandate vastavas seminaris (vt ka Saue-Türk. GC metoodika. 2024). Iga magistrant koostab koostöös tiimikaaslas(t)ega GC seminariks eestvedamise ja/või õppiva organisatsiooni alase tööjuhtumi (TJ) kuni poolel lehel (teemat ei pea õppejõuga kooskõlastama) ning laadib selle moodlesse (õppejõud annab tagasisidet). Siis viite GC eksperimendi läbi oma või tiimikaaslase organisatsioonis. GC protsessi juhtideks olete koos tiimikaaslas(t)ega ning TJ esitajaks on soovitatavalt keegi teie kolleegidest, kes on selle TJ-ga seotud.\n3) GC eksperimendi põhjal koostage kodutöö, mis saatke Word failina meiliga õppejõule hiljemalt 8. aprilliks (nõuded vt moodles)."}, "independent_work_assessments": [{"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Õppeaine on võimalik sooritada jooksvalt kui esitate õigeaegselt allpool esitatud tööd. Muudel juhtudel toimub suuline arvestus.\n1. Individuaalsed õpipäevikud koostage esimeseks, kolmandaks ja neljandaks seminariks (va grupicoachingu seminar). Õpipäevikud palun laadige õppeaine moodlesse (a' 3 lk, kokku 9 lk; single, 12). Kasutage kolmes õpipäevikus kokku vähemalt kuut viimasel kolmel aastal Scopuse või WoS andmebaasides avaldatud teadusallikat, mis viidake korrektselt.\nKõiki alateemasid ei pea käsitlema. Soovitan käsitleda kokku kuni kolmandiku õppeaine alateemadest (mis teid enam huvitab). Õpipäeviku koostamisel analüüsige ja sünteesige selleks kasutatavaid õppematerjale ning seostage valitud teemasid teaduskirjanduse ning oma kogemustega (tooge näiteid). Esitage osa põhitulemusi tabeli(te)s ja/või joonis(t)el.\nÕpipäevikud (1+2+3) esitage lõplikul kujul ühes Word failis hiljemalt 24 tundi enne viimast seminari moodles (palun täiendage oma õpipäevikut pidevalt). \n2. Kirjaliku retsensiooni koostamine tiimikaaslase kogu õpipäeviku kohta (ühel leheküljel, tugevused ja võimalused) hiljemalt viimaseks seminariks, mis esitage moodle vastavas foorumis."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "3. Grupicoachingu eksperimendi läbi viimine oma või tiimikaaslase organisatsioonis koostöös tiimikaaslas(t)ega õppiva organisatsiooni või eestvedamise teemal (vt iseseisvate tööde juhis; üksinda pole lubatud seda teha).\n4. Grupicoachingu eksperimendi järel kodutöö koostamine hiljemalt 8. aprilliks koostöös tiimikaaslas(t)ega (üksinda pole lubatud seda teha; nõuded vt õppeaine moodlest)."}}], "grade_preconditions": {"et": "Eksperimendi läbi viimine ja kirjalike tööde õigeaegne ja nõuetele vastav esitamine (kolm õpipäevikut, retsensioon ja GC kodutöö) ning sisukas osalemine vähemalt kolmes seminaris (sh grupicoachingu seminar on kohustuslik) võimaldab sooritada aine arvestuse jooksvalt. Muudel juhtudel toimub suuline arvestus (kordamisküsimusteks on õppetöö slaidid)."}, "grade_evaluation": {"et": "Arvestuse sooritamiseks on vaja osaleda õppetöös, koostada a) kolm õpipäevikut (lõpuks kõik ühes Word failis, mitte lingina) ning b) viia läbi GC eksperiment ja koostada selle põhjal GC kodutöö (vt nõuded ainekavast ja moodlest).\n1) Individuaalse õpipäeviku koostamine ja selle osade esitamine moodles kolmel korral enne vastavat seminari (va GC seminar): 3x3 lk; analüüs, süntees; seosed praktikaga ja uuema teaduskirjandusega (sh kokku min 6 viimasel kolmel aastal avaldatud teadusartiklit Scopus või WoS andmebaasidest). Õpipäevikuid tuleb peale vastava õppetöö toimumist edasi arendada.\n2) GC alane eksperiment ning selle põhjal koostatud kodutöö kahe/kolme magistrandi koostööna. Esitage Word failina moodles või meili teel hiljemalt 8. aprilliks. GC kodutööd esitlusele ei tule; nende kohta antakse kirjalik tagasiside."}, "grade_conditions": {"arvestatud": {"et": "Aine arvestuseks vaja kõik eespool esitatud tööd nõuetekohaselt sooritada."}, "mittearvestatud": {"et": "Nõuetele vastavad kodutööd esitamata ja/või seminarist puudumise korral täiendav kodutöö tegemata."}}, "debt_elimination": {"et": "Vastavalt Tartu Ülikooli õppekorralduseeskirjale ja kokkuleppele õppejõuga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "abeda15f-e1e6-408b-be53-16d275895678", "type": "MOODLE", "code": "SVHI.01.041_SO", "base_url": "undefined", "linked_to_groups": ["756d58fe-a342-fcc2-3bde-1d1be63564c0", "48e25db3-e923-b1d7-1109-dda0a1ebc48b"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Türk, K. 2025. Õppiv org. ja eestvedamine. Slaidid ja õppematerjal."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Türk, K. 2005. Inimressursi juhtimine; või Daft R. 2015. The Leadership Experience. 6-rd (laenutatav Delta raamatukogust)."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Türk, K. Konfliktide juhtimine. Loengukonspekt."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Türk, K. 2019 video. Tagasisidestamine ja arendamine (vt moodlest)."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Saue, K., Türk, K. 2024. GC metoodika."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Senge P. jt. 2009. Õppiv kool."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Türk, K., Saue, K. 2021. Töötajate arendamine ja grupikootsing: Selle võimalused ja tulemuslikkus. Akadeemia, 3, 2021."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Ahn, J. jt 2021. Leadership for Learning as an Organization-wide Practice: Evidence on its Multilevel Structure and\nImplications for Educational Leadership Practice and Research. IJLE."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Garvin, D., Edmondson, A., Gino, F. Is Yours a Learning Organization? HBR, 2019. "}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Peters, B., Göhlich, M. 2024. Transformative Learning Through Group Coaching. JTE."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Proches, C., Daya P., Strayer, J. jt. 2024. Exploring the Role of Dynamic Presencing in a Group Coaching Training Context for Fostering Transformative Leadership Development in Disruptive Times. FP."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Whitmore, J. 2009/2019.Coaching for Performance. Peatükid 16 ja 17."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "4a66c600-c2de-e0f4-46db-cd6da486f0e2", "person_name": "Kulno Türk", "structural_unit": {"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"2. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}, "1. rühm": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "48e25db3-e923-b1d7-1109-dda0a1ebc48b", "code": "1. rühm", "max_size": 12}, {"uuid": "756d58fe-a342-fcc2-3bde-1d1be63564c0", "code": "2. rühm", "max_size": 12}]}, "schedule": {"weeks": {"et": "24-41"}, "entries": [{"course_week": 24, "time": "2025-02-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "2L+2S - Kulno Türk\nÕppiv organisatsioon ja selle eestvedamine (Senge, Edmondson jt käsitlusest lähtuvalt). Töötajate ootused ja haridusasutuse juhtimine. Töötajate arendamine, tagasisidestmine ja coachingu kultuur. \nVaatame väljavõtteid videost: P. Lencioni. \nPalun lugeda ja läbi mõelda:\n1) Slaidid ja õppematerjal. 2025. K. Türk. Vastavad slaidid.\n2) Tutvuda: Senge, P. jt 2009. Õppiv kool: viie distsipliini käsiraamat haridustöötajatele, lapsevanematele ja kõigile, kellele haridus korda läheb, lk 13-27.\n3) Tutvuge vähemalt kahe õppiva organisatsiooni teadusartikliga, mis on esitatud esimese seminari õppematerjalides.\n4) Koostage õpipäevik 1 ülaltoodud teemadel esitatud slaidide põhjal, millest valige teile huvipakkuvamad alateemad ning esitage õpipäevik word failina moodles (vt iseseisvad tööd). Õpipäevikut saab peale õppetöö toimumist täiendada.\nMoodustage kaheliikmelised tiimid individuaalsete õpipäevikute vastastikuseks arutamiseks ning grupicoachingu (GC) eksperimendi läbi viimiseks ning kodutöö koostamiseks (teeme seda esimesel kohtumisel)."}}, {"course_week": 26, "time": "2025-02-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "4S - Kulno Türk - 28.02. Grupicoaching (GC) seminar - 1.rühm - 9.30-12.30. \n4S - Kulno Türk - 28.02. Grupicoaching (GC) seminar - 2.rühm - 13.00-16.00.\nOsavõtt kohustuslik - ilma selleta pole kodutööd võimalik teha. \nSeminariks tuleb kahesel tiimil koostada kuni poole leheküljeline kirjeldus eestvedamise või õppiva organisatsiooni alase TJ kohta (oma või tiimikaaslase) organisatsioonis ning laadida see hiljemalt 24 tundi enne seminari moodle vastavasse foorumisse (TJ teemat ei pea õppejõuga kooskõlastama; TJ kohta antakse kirjalikku tagasisidet).\nPeale seminari toimumist tuleb läbi viia eksperiment (TJ arutelu) oma või tiimikaaslase organisatsioonis GC metoodikaga, mille eesmärgiks on omandada metoodika haridusasutuse kogukonda hõlmavate arutelude kultuuri kujundamiseks organisatsioonis. Projekti kohta tuleb esitada kodutöö hiljemalt 8. aprillik koostöös tiimikaaslasega (üksinda pole lubatud eksperimenti ja kodutööd teha; vt täpsemalt allpool ja moodlest).  \nSeminariks ettevalmistumisel:\n1) Lugege ja mõelge läbi K. Türk (2025) vastavad slaidid.\n2) Tutvuge Saue, Türk. 2024. GC metoodika.\n3) Tutvuge Türk, Saue. 2021. Töötajate arendamine ja grupikootsing ... Akadeemia.\n4) Soovitavalt vaadake videot: Türk. 2019. Töötajate tagasisidestamine ja arendamine. \n5) Koostage kahese tiimi koostöös kuni poole lk. pikkune TJ oma või tiimikaaslase organisatsioonis eestvedamise või õppiva organisatsiooni teemal (teemat pole vaja kooskõlastada) ning laadida see hiljemalt 24 tundi enne seminari moodlesse.\nNB. Õpipäevikut selleks kohtumiseks koostama ei pea. Arendage edasi oma esimest õpipäevikut."}, "study_group_codes": ["1. rühm", "2. rühm"]}, {"course_week": 32, "time": "2025-04-10", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "2L+2S - Kulno Türk\nGC reflektsioon (GC kodutööd esitlemisele ei tule; neile antakse kirjalik tagasiside). \nEestvedamise arengusuunad ja -stiilid Hersey-Blanchard, Bass, Kelly käsitlustes ning nende rakendamine õppivas organisatsioonis. Mõjuvõimu (võimestamise) liigid ja rakendamise eripärad (French-Raven, Yukl, jt) ning töötajate võimustamise (empowerment) kultuuri kujundamine. Osaleva juhtimise ja jaotatud/jaotunud eestvedamise kultuuri kujundamine kogukonnas.\nLugeda ja läbi mõelda \n1) Lugege ja mõelge läbi K. Türk (2025) vastavad slaidid.\n2) Vaadake Martin Herem videot - Võim kui juhi tööriist.\n3) Esitage GC kodutöö koostöös tiimikaaslasega (üksinda pole lubatud kodutööd esitada) word failina hiljemalt 8. aprilliks moodles (või saata see kulno.turk.ut.ee, kui soovite tagada kodutöö konfidentsiaalsus).\n5) Koostage õpipäevik 2 word failina ning esitage see moodles hiljemalt 24 tundi enne seminari (valige huvipakkuvamad alateemad ning lisage see esimese õpipäeviku faili juurde). Õpipäevikut saab peale õppetöö toimumist täiendada."}}, {"course_week": 34, "time": "2025-04-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "4S - Kulno Türk Juhi pädevused ja omadused (Eesti juhtide näitel). Kooli juhtimine ja õppiv organisatsioon. Konfliktide juhtimise põhjused, eripärad ning Thomas-Kilmanni ja Nicotera konfliktimudelid. \nLugeda ja läbi mõelda: \n1) Lugege ja mõelge läbi K. Türk (2025) vastavad slaidid.\n2) Esitage lõplik õpipäevik (kõik kolm valmis õpipäevikut koos ühes failis, kokku 9 lk). Valige huvipakkuvamad alateemad analoogselt varasemate õpipäevikutega. Õpipäevik laadige moodlesse hiljemalt 24 tundi enne neljandat seminari. \n3) Hiljemalt neljandaks seminariks esitage tiimikaaslase õpipäevikute retsensioon moodles (ühel leheküljel, mis sisaldab õpipäevikute tugevusi ja võimalusi)."}}]}, "registration_info": {"audience": {}, "max_students": 24}, "confirmation_process": {"confirmation_uuid": "d9e029e8-4d23-3dd0-4285-da417f6f063c", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "7e610158-5977-18e7-e196-6fa8e177b2a0", "parent_code": "SVHI.01.041", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}