{"uuid": "0362c912-fb3f-3867-cbdc-c726fcc9c40c", "code": "sv-2024-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-19T00:25:50", "title": {"en": "Educational Theory", "et": "Haridusteooria"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 28, "independent_work": 50, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The beginning and development of theoretical discussion in education in the Western cultural space. Different approaches: sophists, Plato, Isocrates. \nThe formation and development of educational studies as a scientific discipline of its own. General education (Allgemeine Pädagogik). Herbart. The relationship between ethics and psychology as grounds for specification of educational aims and methods. Different cultural traditions (English-speaking, Continental European, Nordic) in addressing issues of educational studies, general education and educational theory. Education as a combination of basic disciplines - an alternative to the concept of general education as a discipline of its own. Different approaches to the relationship between general education and educational sub-disciplines.\nPractical examples and discussion about the theory-practice relationship, about the extent of educational scientific, and about the relationship between general educational and field-specific educational in the current international educational scientific production.", "et": "Teoreetilise haridusalase arutluse algus ja areng Lääne kultuuriruumis; vastandlikud käsitused: sofistid, Platon Isokrates. Liberaalne haridus, Paideia. \nHaridusteaduse kui iseseisva teadusdistsipliini kujunemine ja areng. Üldpedagoogika. Herbart. Eetika ja psühholoogia omavaheline suhe hariduseesmärkide ja vahendite määratlemisel. \nInglise keeleruumi, Mandri-Euroopa ja Põhjamaade traditsioonide erinevused haridusteaduse, üldpedagoogika ja haridusteooria määratlemisel. Käsitus haridusteadustest kui alusdistsipliinide kombinatsioonist vastandina käsitusele haridusteadusest kui iseseisvast terviklikust teadusdistsipliinist. Eri lähenemised üldpedagoogika ja pedagoogika aladistsipliinide vahelistele suhetele. \nPraktilised näited ja arutelu teooria ja praktika suhte, haridusteaduse osakaalu ning üldpedagoogilise ja valdkonnaspetsiifilise suhtest kaasaegses publitseeritud teadusloomes."}, "objectives": [{"en": "Objectives: ", "et": "Eesmärkideks on:"}, {"en": "- to provide the participants with opportunities to comprehend the relationship between educational practice and theory and the different ways in which this relationship has been addressed;", "et": "- võimaldada osalejatel omandada arusaam haridus- ja kasvatuspraktika ning valdkondliku teooria omavahelisest suhtest ja selle suhte erinevatest käsitlustest; "}, {"en": "- to provide the participants with knowledge and understanding of educational studies and general education (Allgemeine Pädagogik) as a discipline of its own, about its development and importance and about different ways it has been addressed;", "et": "- võimaldada osalejatel omandada teadmised ja arusaam haridusteadusest ja üldpedagoogikast (Allgemeine Pädagogik) kui iseseisvast teadusdistsipliinist, selle arengust, olulisusest ja erinevatest käsitlustest;  "}, {"en": "- to develop the participants' capabilities to distinguish, understand, develop and critically assess the specifically educational component in written and oral scientific production, including in their own doctoral thesis;  ", "et": "- arendada osalejates võimet eristada, mõista, arendada ja kriitiliselt hinnata eripäraselt hariduslikku komponenti suulises ja kirjalikus teadusloomes, sealhulgas oma doktoritöös;"}, {"en": "- to develop the participants' capabilities to distinguish, understand, develop and critically assess the degree of generality of a particular educational problem or topic, to become able to distinguish between the general educational and the field specific aspects.", "et": "- arendada osalejates võimet eristada, mõista, arendada ja kriitiliselt hinnata vastava haridusteadusliku probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ainest."}], "learning_outcomes": [{"en": "Those who have completed the course are expected to be able to:", "et": "Kursuse läbinu:"}, {"en": "- understand and distinguish between the practice- and experience-based and, on the other hand, the theoretical and conceptual in the educational discussion; consciously operate between these two levels in their written and oral scientific production, including in their doctoral thesis;", "et": "- mõistab ja eristab ühelt poolt praktika- ja kogemuspõhist ning teiselt poolt teaduslik-teoreetilist tasandit haridusalases arutelus; suudab suulises ja kirjalikus teadusloomes, sealhulgas oma doktoritöös, teadlikult liikuda nende tasandite vahel;"}, {"en": "- know and understand the reasons, the main developmental characteristics and the identity issues of educational studies and general education as a discipline of its own; know and understand the traditional disciplinary and theoretical specificities of educational studies in the English-speaking, the Continental European and the Nordic cultural spaces; understand and purposefully apply these specificities in their educational scientific publications, including in their doctoral thesis;  ", "et": "- tunneb haridusteaduse ja üldpedagoogika kui iseseisva teadusdistsipliini väljakujunemise põhjusi, arenguloo peajooni, haridusteaduse kui teadusdistsipliini identiteedi probleeme ning peamisi eripärasid Mandri-Euroopa, ingliskeelses ning Põhjamaade kultuuriruumis; mõistab ja rakendab teadlikult nende kultuuriruumide eripäradest tulenevaid teoreetilisi ja mõistelisi erinevusi haridusalases teadusloomes, sealhulgas oma doktoritöös;   "}, {"en": "- distinguish, understand, develop and critically assess the presence, the extent and the quality of a specifically educational component in written and oral scientific production, including in their own doctoral thesises;", "et": "- eristab, mõistab, arendab ja suudab kriitiliselt hinnata eripäraselt haridusliku komponendi olemasolu, ulatust ja kvaliteeti suulises ja kirjalikus teadusloomes, sealhulgas oma doktoritöös tervikuna ja selle osades;"}, {"en": "-  distinguish, understand and critically assess the degree of generality of a particular educational problem or topic; distinguish between the general educational and the field specific matter;", "et": "- mõistab, arendab ja suudab kriitiliselt hinnata vastava haridusteadusliku probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ainest;"}, {"en": "- analyse and critically assess the content of her/his scientific production, including that of her/his doctoral thesis within the broader theoretical, historical, cultural and general educational framework.", "et": "- suudab analüüsida, arendada ja kriitiliselt hinnata oma teadusloome, sealhulgas doktoritöö sisu selle laiemas teoreetilises, ajaloolises, kultuuriruumilises ja üldpedagooglises kontekstis."}], "notes": {}}, "grading": {"independent_work": {"et": "Reading compulsory literature. Independent work for presentation in the seminar."}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Oral presentation in the seminar (the written draft submitted to the teacher in charge beforehand), in which the participant introduces to the general education audience the social relevance of the problem setting and of the aim of her/his thesis, its broader historical, cultural and general educational context, its theoretical and conceptual framework and underlying considerations, and the possible alternatives together with their advantages and disadvantages. The    applicant also responds to the comments and questions form the audience and from the teacher in charge."}}], "grade_preconditions": {"et": "Participation in the seminars; submission of the written draft of the presentation to the teacher in charge in advance."}, "grade_evaluation": {"et": "Participation in the seminars; submission of the written draft of the presentation to the teacher in charge in advance."}, "debt_elimination": {"et": "In agreement with the teacher in charge."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "3e0a7d0c-380c-9133-5f6c-2d7927969f9a", "person_name": "Rain Mikser", "structural_unit": {"code": "SVHI08", "name": {"en": "Centre for Teacher Education and Higher Education", "et": "õpetaja- ja kõrghariduse keskus"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVHI"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-19"}}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "646ec7b7-e0d4-f778-e240-86522e6db7b8", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "81a3490b-2f78-4287-45ac-35770f8e6ad8", "parent_code": "SVHI.02.016", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}