{"uuid": "17feb8a4-f666-de2a-66e4-8ef3e6ad02fb", "code": "SVHI.01.044", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Career Planning and Career Service Management", "et": "Karjääriplaneerimine ja karjääriteenused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course consists of two parallel modules. First module gives an overview of the theoretical standpoints, patterns, contemporary approaches and practices of career development in Estonia and elsewhere in the world is given. Career education in the national curriculum and career education at school. Existing methodological materials and development of materials on career education. Career education quality evaluation criteria, evaluation instruments, the development of instruments and their interpretation. The organization of career services in general education school, vocational school, university and social contexts. Career counselling. decision making in career development. Labor market processes and prognoses. Education and training opportunities, and relations to the labor market and lifelong learning. Whole studies based on career self-assessment, analyze of work and labour market processes  through self-evaluating career opportunities in the context of career decision making and planning.\nThe second module of the course consists issues about main aspects of international career guidance. System of career services provided by education and labor market sectors and development trends elsewhere in the world giving examples from the international perspective. Module is international learning environment (Shared understanding of guidance in international context) connecting Estonian, Latvian and Finnish students.", "et": "Aine koosneb kahest paralleelselt toimuvast moodulist.  Esimene neist on üldmoodul, kus antakse ülevaade karjääri kujundamise teoreetilistest seisukohtadest, seaduspärasustest, nüüdisaegsetest lähenemisviisidest. Karjääriõpe riiklikus õppekavas ja karjääriõpetus koolis. Karjääriõppe alased metoodiliste materjalid ja nende koostamine. Karjääriõppe kvaliteedi hindamine ja hindamiskriteeriumid, hindamisvahendid, nende koostamine ja järelduste tegemine. Karjääriteenuste korraldus üldhariduskoolides, kutsekoolis, ülikoolis jt sotsiaalsetes kontekstides. Karjäärialane nõustamine. Karjääriotsuste tegemine. Rahvusvaheline mobiilsus. Tööturu protsessid ja prognoosid. Haridus- ja koolitusvõimalused ning seosed tööturuga ning elukestev õpe. Kogu õpe toetub eneserefleksioonile seoses karjäärialasele enesetundmisele ja oma võimaluste tundmisele karjääriplaneerimise ja -otsustamise kontekstis. Teise mooduli põhisuks on karjäärikujundamise rahvusvahelised aspektid. Haridus- kui tööturusektori pakutavate karjääriteenuste süsteem Eestis ja arengusuund mujal maailmas. Moodul on rahvusvahelise õppimise keskkond (Shared understanding of guidance in international context), mis ühendab Eesti, Läti ja Soome üliõpilasi."}, "objectives": [{"en": "The aim of the course is to give a theoretical overview of the patterns of career development and to support the acquisition of skills for career guidance in educational context through self-assessment.", "et": "Õppeaine eesmärk on edastada teoreetilisi teadmisi karjääri kujundamise seaduspärasustest ja toetada oskuste omandamist karjäärikujundamiseks haridusasutuses läbi enesehindamise."}], "learning_outcomes": [{"en": "After completing the course, the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows the most essential theoretical views on and development trends of career development, and have the makings of applying them in career guidance;", "et": "- tunneb olulisemaid karjääri kujundamise teoreetilisi seisukohti ja arengutendentse ning omab eeldusi neid karjäärisuunitlustöö praktikas rakendada;"}, {"en": "- orienting in international career guidance main aspects with having an overview about the career planning system in Finland, Estonia and Latvia;", "et": "- orienteerub karjäärikujundamise rahvusvahelistes aspektides omades ülevaadet Eesti, Läti ja Soome karjääriplaneerimise süsteemist;"}, {"en": "- is theoretically and methodologically prepared to teach career planning in educational context (including school);", "et": "- omab teoreetilist ja metoodilist ettevalmistust karjääriõppe läbiviimiseks haridusasutuses (s h koolis);"}, {"en": "- has prerequisites to evaluate career planning activities and to collect respective feedback through self-reflection;", "et": "- omab eeldusi karjääriplaneerimise hindamiseks ja selle kohta tagasiside kogumiseks läbi eneserefleksiooni;"}, {"en": "- has an overview of the system of career services, concepts of work and labour market processes evaluating career opportunities;", "et": "- omab ülevaadet karjääriteenuste süsteemist, töö erinevatest käsitlustest ja tööturu protsessidest hinnates töömaailma võimalusi;"}, {"en": "- has knowledge of the principles of working with career information and knows how to use the sources of career information and platforms;", "et": "- tunneb karjääriinfoga töötamise põhimõtteid ning oskab kasutada karjääriinfo allikaid ja keskkondi;"}, {"en": "- has knowledge and understanding of the labour market processes and training opportunities regarding the labour market based on the self-reflection of career planning and decision making.", "et": "- teab ja tunneb tööturu protsesse ning haridus- ja koolitusvõimalusi seoses tööturuga toetudes eneserefleksioonile seoses karjäärialase planeerimise ja otsustamisega."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}