{"uuid": "1aa92ee6-bfc6-b700-e7c5-58ab8f2cf3e2", "code": "SVHI.00.035", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Developing Writing Skills in English Class", "et": "Kirjutamisoskuse arendamine inglise keele tunnis"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVHI", "structural_unit_name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVHI", "name": {"en": "Institute of Education", "et": "haridusteaduste instituut"}, "email": "haridus@ut.ee", "phone": "+372 737 6450", "webpage_url": "https://haridus.ut.ee", "address": "Jakobi 5\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 5", "zip": "51005", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of different texts (e.g. description, short story, letters, essay etc.), their vocabulary, structure and style. Attention is paid to text organisation, commonly misspelt words and punctuation. Students practise writing and analyse tasks which are suitable for basic school students.", "et": "Kursusel antakse praktiliste ülesannete abil ülevaade erinevatest kirjalikest tekstidest (kirjeldus, lühijutt, kiri, essee jne), nende sõnavarast, struktuurist ja stiilist ja koostatakse erinevaid kirjalikke tekste. Tähelepanu pööratakse sõnavarale, teksti organiseerimise võtetele, õigekirjale, sh nii veaohtlikele sõnadele kui ka kirjavahemärkide kasutamisele. Analüüsitakse ja praktiseeritakse erinevaid kirjutamisülesandeid, mis on sobilikud kasutamiseks põhikooli inglise keele tunnis."}, "objectives": [{"en": "The aim of the course is to teach students to write and analyse different texts as well as enlarge their vocabulary and develop stylistic skills. To give students ideas how to use different writing activities in English lessons at basic school.", "et": "Õpetada kirjutama ja analüüsima erinevaid tekste ning kirjutamisülesandeid. Anda juhiseid ja soovitusi erinevate kirjutamisülesannete kasutamiseks põhikooli inglise keele tunnis."}], "learning_outcomes": [{"en": "After completing the course a student ", "et": "Õppeaine edukalt läbinud üliõpilane "}, {"en": "* will know the main features of different texts (description, a short story, essay, report, poem etc.) and pay attention to their specific features;", "et": "*tunneb erinevate tekstide tunnusjooni (kirjeldus, jutuke, essee, referaat, luuletus jne) ja pöörab tähelepanu nende eripäradele; "}, {"en": "*will compose different texts, using appropriate vocabulary and style;", "et": "*koostab erinevaid tekste, kasutades vastavalt tekstiliigile sobivat sõnavara ja stiili; "}, {"en": "*will know the main rules of punctuation and use punctuation marks correctly;", "et": "*teab kirjavahemärkide kasutamise põhireegleid ja kasutab kirjavahemärke õigesti;"}, {"en": "*will know the spelling of difficult words and can correct them;", "et": "*teab veaohtlikke sõnu ning märkab vigu; "}, {"en": "*will analyse and evaluate their peers' work;", "et": "*analüüsib ja hindab kaasüliõpilaste töid;"}, {"en": "*will know the types of different writing tasks and can analyse them; ", "et": "*tunneb erinevaid kirjutamisülesannete liike ja analüüsib õpikutes olevaid kirjutamisülesandeid;"}, {"en": "*can choose suitable writing tasks to develop students' writing skills in a basic school English class.", "et": "*oskab valida sobilikke kirjutamisülesandeid õpilaste kirjutamisoskuse arendamiseks põhikoolis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}