{"uuid": "515ec348-e7b2-4f5c-a823-3ac1cfa8c854", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-18T09:24:54", "title": {"en": "Regional Integration Processes in Europe and Eurasia", "et": "Piirkondlikud integratsiooni protsessid Euroopas ja Euraasias"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course aims to give a systematic overview of institutional and historical developments in the process of European and Eurasian integration in a changing world and of how they influence the interaction between the EU and Russia and the EaEU. The course looks at the process of supranational and regional integration in Europe and Russia and its causal relationship with analytical and practical issues related to EU politics, EU-Russia relations, nations, and societies.\nWhile addressing the above-mentioned learning components, the course will introduce and apply content analysis to case study approach, both in analytical and practical terms, with a specific focus on case selection criteria.The course is based on a constant process of active learning and interactive teaching.", "et": "Kursuse eesmärgiks on anda süstemaatiline ülevaade ühiskondlikest, rahvuslikest ja rahvusvahelistest arengutest muutuvas maailmas ja kuidas need arengud mõjutavad EL-i poliitikaid ja poliitikat ning EL-i suhet Venemaaga. Kursuse alguses analüüsitakse ühte \"šokk-juhtumit\" ja selle põhjuslikku suhet EL-i ja Venemaa poliitika, ühiskondade, ajaloo ning rahvusvahelise poliitikaga seotud analüütiliste ja praktiliste küsimustega."}, "objectives": [{"en": "The course explores the institutional and historical developments that relate to the emergence, transformation, and consolidation of the EU; while comparatively discussing the post-cold war attempts of regional integration in the former Soviet space. Part of the course will be specifically focused on the comparative dimension and the interaction between the EU and Russia from an historical and political perspective.\nThe course will focus on the multidimensionality of the process of regional integration in Europe and Eurasia moving throughout the analysis of the relevant cleavages in contemporary societies, determined by the progressive decline/redefinition of nation-states and the emergence of the transnational and multicultural polity in Europe.", "et": "Kursuse eesmärgiks on anda süstemaatiline ülevaade ühiskondlikest, rahvuslikest ja rahvusvahelistest arengutest, mis on seotud EL-i loomise, muutumise ja konsolideerumisega, ning EL-i suhtlusest globaalse rahvusvahelise süsteemi ja \"teistega\". Osa kursusest keskendub kitsamalt EL-i ja Venemaa vahelise suhtluse arengutele ja nende omavahelisele interaktsioonile ajaloolisest ja poliitilisest perspektiivist vaadatuna. Seega keskendub kursus Euroopa ja regionaalse integratsiooni protsessi mitmetahulisusele, analüüsides kaasaegsetes ühiskondades esile kerkinud lõhesid, mis on tekkinud rahvusriikide ümbermääratlemise ning rahvusülese ja multikultuurilise Euroopa (ümber)korralduse tulemusena."}], "learning_outcomes": [{"en": "Upon completion of the course a student will:\n- understand and critically assess the main institutional actors of the EU and of the EaEU;\n- make sense of the decision-making process in the EU and EaEU and of the role of the actors involved;\n- analytically and practically navigate throughout concepts and objects of the contemporary changing world;\n- connect different dimensions of politics and policy-making in Europe and Eurasia for different multi- disciplinary perspectives;\n- make sense of the historical developments of nation, state, and society in Russia and their relationship with the EU/European dimension", "et": "Kursuse läbinud üliõpilane:\n- navigeerib analüütiliselt ja praktiliselt mõistete ja objektide vahel, mis on iseloomulikud kaasaegsele muutuvale maailmale;\n- ühendab erinevaid poliitika ja poliitikakujundamise dimensioone erinevatest distsipliinidest ja perspektiividest lähtudes;\n- kirjeldab Euroopa integratsiooni protsessi läbi Euroopa ühiskondade, rahvuste ja riikide arengute;\n- tegutseb erinevates kultuurilistes keskkondades ja mõistab erinevaid EL-i (Euroopa), Venemaa, Balkanimaade, Balti riikide ja naabrite geo-territoriaalseid kontekste;\n- mõtestab lahti rahvuse, riigi ja ühiskonna arenguid Venemaal ja Venemaa suhteid EL-i ja Euroopaga;\n- tõlgendab suures koguses andmeid ja mõistab andmetel põhinevaid arutluskäike;\n- omab ülevaadet rahvusvaheliste suhete ajaloolisest arengust, EL-i põhilistest institutsioonidest selles süsteemis, EL-i ja Venemaa rollist selles ja nende omavahelistest suhetest."}], "notes": {"et": "This course is developed and implemented with the support of the Jean Monnet Module \"Neighbourhood Enlargement and Regionalism in Europe\" (NearEU). The project has received funding from the European Union's Erasmus+ Jean Monnet programme under Grant Agreement 620279-EPP-1-2020-1-EE-EPPJMO-MODULE."}}, "grading": {"independent_work": {"et": "1. Two tests based on closed-ended multiple choice questions addressing the main formal learning dimensions addressed during the specific module);\n2. Research paper: (around 3000 words), practically applying content analysis to a case study discussed during the course;\n3. Students will be involved in a virtual EU-Russia negotiating exercise (role game) - conducted, over the weeks, in the moodle environment - where the knowledge and notions acquired during the lectures and the seminars will be tested and put into practice.;\n5. Class practical activities, both at individual and team level, are expected to factually apply the dimensions of formal addressed in the pre-class and post-class phases"}, "independent_work_assessments": [{"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "Students are expected to deliver a research paper: (around 3000 words), practically applying content analysis to a case study discussed during the course. The essay, aimed to reflect the student's capacity to use and practically adapt the formal/practical knowledge acquired throughout the course and to provide applicable recommendations to policy-makers, is expected to be delivered not later than 15 days following the last class meeting.\n\nThe research paper is assessed according to the following criteria:\n- Practical ability / development\n- Problem solving\n- Critical thinking\n- Analytical ability\n- Connecting concepts and objects\n- Connecting theory and hypotheses\n- Methodological clarity\n\nThe research paper is assessed according to the following scale:\nE - The required minimum criteria are generally achieved; the formal aspects of the task are, on the whole, met; the descriptive part of the paper presents a sufficient level of development; however, analytical part is non-existent or clearly underdeveloped. The method appears only formal applied but not substantially interiorized and the student fails to properly include and discuss the consistent literature.\nD - The required minimum criteria are achieved; the formal aspects of the task are, generally, met; the descriptive part of the paper presents a satisfactory level of development; however, the analytical part and its research component present appear basic, inconsistent, and underdeveloped in most of the parts. The method appears only imperfectly formal applied and poorly interiorized and the student includes and discusses only the basic literature related to the paper.\nC - The required minimum criteria are achieved, not only formally, but also substantially; the descriptive part of the paper presents a good level of sophistication. The analytical part and its (generally satisfactory) research component, appear well developed, but still present some weakness at times. The method appears generally well applied and - on the whole - interiorized and the student includes and discusses not only the basic literature related to the paper, with some degree of sophistication.\nB - The required criteria are achieved, not only formally, but also substantially; almost the totality of the aspects of the task are met. The descriptive part presents a very high level of sophistication. The analytical part and its research component, appear highly developed and satisfactory, and present only very marginal weakness that does not affect the final result. The method appears well applied and interiorized and the student includes and discusses a consistent amount of literature related to the paper, with a satisfactory degree of sophistication.\nA - The required minimum criteria are achieved, not only formally, but also substantially; the totality of the aspects of the task are met. Both the analytical and descriptive part of the paper appear equally well developed and present a remarkably high level of sophistication in their arguments and consistency. The method appears remarkably applied and fully interiorized and the student includes and discusses a vast amount of literature related to the paper, with a high degree of sophistication."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "On week 16, students will be involved in a virtual EU-Russia negotiating exercise (role game) - conducted, over the weeks, in the moodle environment - where the knowledge and notions acquired during the lectures and the seminars will be tested and put into practice. In particular, students will be assigned institutional roles at the beginning of the course (Member States, Candidate countries, Government of the Russian Federation, European Parliament, Commission, Council, Committees, etc), and have to conduct - over the course - multi-lateral and bi-lateral negotiation accordingly. Students' constant activism is taken into account. The participation to the exercise is assessed on a non-differentiated basis (pass/fail). If the student participates to it, meeting the required minimum criteria, the task is considered achieved. The participation and submission of the necessary material for the exercise is a pre-requisite to be considered for the final assessment.\n\nThe EU-Russia negotiating exercise is assessed according to the following criteria:\n- Problem solving\n- Ability to work in team\n- Capacity to take independent decisions\n- Ability to discuss in group and to present motivated arguments\n- Connecting theory and practice\n- Sense of leadership and listening\n- Capacity to present arguments and points of view"}}, {"work_type": {"code": "performance", "et": "Etendus", "en": "performance"}, "description": {"et": "Class practical activities, both at individual and team level, are expected to factually apply the dimensions of formal addressed in the pre-class and post-class phases. The activities are aimed to better interiorize the notions and experiences acquired during the preceding session (i.e. individual reflection on the results of the class discussion and application of the case study methodology) and to prepare the informative background necessary to successfully participate to the successive meeting (preparations for the discussions in class). Without prejudice to requirement to attend at least 4/5 of the classes, the participation to class activities is assessed on a non-differentiated basis (pass/fail). If the student participates to it, meeting the required minimum criteria, the task is considered achieved. The participation to the simulation is a pre-requisite to be considered for the final assessment.\n\nClass practical activities is assessed according to the following:\n- Following instructions and recording results\n- Practical ability / development\n- Transfer formal knowledge to practical tasks\n- Sense of leadership and listening\n- Capacity to present arguments and points of view\n- Problem solving\n- Ability to work in team"}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "At the end of the course - during the semi final meeting of week 15 - and during another class (not previously announced) students will take two tests based on closed-ended multiple choice questions addressing the main formal learning dimensions addressed during the specific module).\n\nThe test based on closed-ended multiple choice questions is assessed according to the following criteria:\n- Formal knowledge and understanding\n- Analytical ability\n- Connecting concepts and objects\n- Problem solving\n- System thinking\n- Grouping ideas\n\nThe tests consists of closed questions each worth 2 point. The test is assessed according to the following scale: E (10-11 points), D (12-13 points), C (14-15 points), B (16-17 points), A (18-20 points)."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "In order to be considered for the final assessment, students are expected to attend at least 12 out of 14 the classes and actively participate to class activities, submit the EU-Russia simulation material, and take at least 1 of the 2 tests.\n\nPlagiarism is NOT TOLERATED and can lead to failing the course. More details are available at www.plagiarism.org."}, "grade_evaluation": {"et": "Once the minimum requirements to be considered for the final assessment are met, the components of the final evaluation will weight in the definition of the final grade according to the following distribution of points:\n\nWork description - Max. points\nPreparation of the EU-Russia simulation/negotiation exercise - 20\nTWO Tests of formal knowledge (multiple choice questions) - 40\nFinal paper - 40\nTotal max: 100\n\nGrade Point range\nA (Excellent) 100-91\nB (Very good) 90-81\nC (Good) 80-71\nD (Satisfactory) 70-61\nE (Acceptable) 60-51\nF (Fail) 50-0"}, "debt_elimination": {"et": "As agreed with the responsible lecturer.\n\nStudents who are not satisfied with the final outcome and wish improve their course grade can submit a 4-page critical review of a short reading previously agreed with the instructor. A max of 5 points can be added to the final grade according to the quality of the review"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "16af2434-755c-43b5-af96-151bcc2cc4bf", "type": "MOODLE", "code": "SVJS.00.030_Eng", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "recommended_materials": "Available in moodle."}, "participants": {"lecturers": [{"person_uuid": "88dc55da-3957-ca43-2bf8-28ea2a626f60", "person_name": "Stefano Braghiroli", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "time": "2024-09-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Introduction to the course & brainstorming"}}, {"course_week": 1, "time": "2024-09-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Conceptual toolbox: identity, nations, states, societies, and regional integration"}}, {"course_week": 1, "time": "2024-09-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "History of the European integration process I"}}, {"course_week": 1, "time": "2024-10-03", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "History of the European integration process II"}}, {"course_week": 1, "time": "2024-10-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "European Commission"}}, {"course_week": 1, "time": "2024-10-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "European Parliament"}}, {"course_week": 1, "time": "2024-10-31", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Council of the EU and European Council"}}, {"course_week": 1, "time": "2024-11-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Foreign and security policy dimension"}, "description": {}}, {"course_week": 1, "time": "2024-11-14", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {}, "description": {"et": "Mid-term test"}}, {"course_week": 1, "time": "2024-11-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Regional cooperation in the former soviet space"}}, {"course_week": 1, "time": "2024-11-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Institutions of EaEU and dynamics (Supreme Council, Intergovernmental Council, Commission)"}}, {"course_week": 1, "time": "2024-12-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "DISCUSSION: The future of the Eastern Partnership in the context of the war in Ukraine"}}, {"course_week": 1, "time": "2024-12-12", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "EU negotiation exercise on the war in Ukraine (Council of the EU)"}}, {"course_week": 1, "time": "2024-12-19", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Final test"}, "description": {}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 40}, "parent_uuid": "206cf224-c727-4657-da55-e0792440303a", "parent_code": "SVJS.00.030", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}