{"uuid": "ce04557e-bd62-1ec8-549d-bb5567189652", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-04T15:48:44", "title": {"en": "International Security", "et": "Rahvusvaheline julgeolek"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 26, "practice": 4, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course \"International Security\" introduces students of International Relations to the more specialized sub-field of Security Studies. Towards this end, the course provides students with an introduction to some of the most pressing security challenges characterizing the contemporary security environment, key concepts, as well as central in the field of Security Studies.\n\nThe problem of insecurity, and the need for states to ensure their security in an anarchic environment, is one of the most fundamental challenges states face and it is one of the most fundamental and durable features of international politics. As such, considerations of national and international security are at the very heart of the study of world politics, and the quest for security commands attention both as a matter of research and policy.\n\nAgainst this background, the course aims to enable students to navigate current debates about international security. It does so by, first, introducing some of the most pressing security challenges characterizing the contemporary security environment and, second, by equipping students with the analytical tools to critically engage with these security challenges and with wider debates about security policy.", "et": "\"Rahvusvahelise julgeoleku\" kursus tutvustab rahvusvaheliste suhete üliõpilastele julgeoleku-uuringute alavaldkonda. Kursus teeb sissejuhatuse mõnedesse kõige pakilisematesse julgeolekuprobleemidesse, mis iseloomustavad tänapäeva julgeolekukeskkonda, võtmekontseptsioonidesse, samuti julgeoleku-uuringute valdkonna kesksetesse teemadesse.\nPuuduliku julgeoleku probleem ja riikide vajadus tagada oma julgeolek anarhilises keskkonnas on üks põhilisemaid väljakutseid, millega riigid silmitsi seisavad, ning see on üks rahvusvahelise poliitika põhilisemaid ja püsivamaid tunnuseid. Seetõttu on riikliku ja rahvusvahelise julgeoleku kaalutlused maailmapoliitika uurimise keskmes ja julgeoleku tagamine on nii teadusuuringute kui ka poliitika seisukohast tähelepanu vääriv teema.\nSelle taustal on kursuse eesmärk võimaldada üliõpilastel orienteeruda praegustes rahvusvahelise julgeoleku alastes aruteludes. Selleks tutvustatakse esiteks mõningaid kõige pakilisemaid julgeolekuprobleeme, mis iseloomustavad tänapäeva julgeolekukeskkonda, ja teiseks antakse üliõpilastele analüütilised vahendid, et nad saaksid kriitiliselt tegeleda nende julgeolekuprobleemidega ja laiemate julgeolekupoliitikaga seotud debattidega."}, "objectives": [{"en": "The course aims to introduce students to the field of Security Studies. It does so by introducing key concepts in the study of international security, central issues and security challenges characterizing the contemporary security environment, and major debates related to international security.", "et": "Kursuse eesmärk on tutvustada üliõpilastele julgeoleku-uuringute valdkonda. Selleks käsitletakse rahvusvahelise julgeoleku uurimise põhimõisteid, tänapäeva julgeolekukeskkonda iseloomustavaid keskseid küsimusi ja julgeolekuprobleeme ning rahvusvahelise julgeolekuga seotud peamisi debatte."}], "learning_outcomes": [{"en": "Upon completion, course participants ", "et": "Kursuse läbinud:"}, {"en": "-\tare familiar with key characteristics of the contemporary security environment;", "et": "- on tuttavad kaasaegse julgeolekukeskkonna peamiste tunnustega;"}, {"en": "-\tare able to name, describe, apply central concepts of the field of Security Studies;", "et": "- oskavad nimetada, kirjeldada ja rakendada julgeoleku-uuringute valdkonna keskseid mõisteid;"}, {"en": "-\tare familiar with, and are able to assess, central debates/arguments in the field of Security Studies;", "et": "- tunnevad ja oskavad hinnata julgeoleku-uuringute valdkonna keskseid debatte/ argumente;"}, {"en": "-\tare able to apply key concepts of the field of Security Studies in order to critically analyze current security challenges.", "et": "- oskavad rakendada julgeoleku-uuringute valdkonna põhimõisteid, et analüüsida kriitiliselt praeguseid julgeolekuprobleeme."}], "notes": {"et": "Kursus toimub Moodle'is, mis on ka peamine kommunikatsioonikanal. Kursuse õppejõuga saab kontakteeruda ka e-kirja teel (thomas.linsenmaier@ut.ee)"}}, "grading": {"independent_work": {"et": "Independent work with the course readings; preparation for the in-class exercises or completion of exercises in the Moodle environment before or after class. More detailed instructions for the exercises will be provided through Moodle."}, "independent_work_assessments": [{"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "The poster presentation (final assessment): The final assignment for the course consists of a poster presentation. In the poster presentation, course participants present their analysis of one contemporary security challenge as it manifests itself in the context of a particular case.  The posters will be prepared in groups over the course of the semester. A list of topics will be provided by the course instructor together with detailed guidelines about the content and formatting requirements for the poster. \n\nThe assessment of the poster and the poster presentation is differentiated (0-40 points). The poster and the poster presentation are assessed according to:\n\n-\tthe detail and precision of the description and the explanation of the security issue;\n-\tthe description of the central concept and its application to the case under consideration;\n-\tthe visual presentation of content through the effective use of visualizations; \n-\tadherence to the formatting requirements and sufficiency of sources;\n-\tthe oral presentation of the poster.\n\nSuccessful completion of the final assignment, and receiving the points for the final assignment, presupposes that each team member contributes sufficiently to the common effort. Should the individual contribution of a team member fall short of the agreed share, no points will be assigned to the team member.."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "The quizzes (interim assessments): The interim assessments consist of three quizzes which course participants will complete over the course of the semester. In the quizzes, students will be asked about the contents of the preceding lectures and the readings assigned in preparation for the lectures (e.g. key characteristics of contemporary security challenges, central concepts, or central debates/arguments in the field of Security Studies). \n\nThe quizzes are assessed according to:\n-\tdemonstrated familiarity with defining features/key characteristics of contemporary security challenges; \n-\tdemonstrated familiarity with key concepts in the study of international security;\n-\tdemonstrated familiarity with central debates and arguments in the field of Security Studies and their correct assessment."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "In order to complete the course with a positive grade, course participants cannot miss more than two classes and all exercises must be completed. If any of the in-class or Moodle-based exercises is missed, the exercise can be compensated for by completing the exercise in written form."}, "grade_evaluation": {"et": "The overall course assessment is differentiated (A-F). The final grade is composed of the results of the interim assessments (60%) and the final assignment (40%). The final grade is computed as follows:\n\nA (excellent) 100-91\nB (very good) 90-81\nC (good) 80-71\nD (satisfactory) 70-61\nE (sufficient) 60-51\nF (fail) 50-0"}, "debt_elimination": {"et": "Late submissions will not be accepted. Missing the deadline for assignments results in failing the assignment.\n\nAn extension of deadlines is possible only in exceptional circumstances and upon prior agreement with the course instructor.  \n\nExtra credit: Course participants who want to improve their final grade can do so by completing an additional written assignment (wiki entry). The topic must be approved with the course instructor. Further instructions will be provided upon request. The additional assignment is worth max. 10 points."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "56b65186-84dd-4212-8c7e-2e37ab94bf18", "type": "MOODLE", "code": "SVJS.00.044_ENG", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "The mandatory course readings will be made available in Moodle.", "recommended_materials": "A selection of recommended books will be made available in the Social Science library."}, "participants": {"lecturers": [{"person_uuid": "be9a0ac9-4d57-ecfe-639d-60d3eaf34b67", "person_name": "Thomas Michael Linsenmaier", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-40"}, "entries": [{"course_week": 1, "time": "2025-02-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Introduction: International Security"}}, {"course_week": 2, "time": "2025-02-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "International Security and the Scourge of War"}}, {"course_week": 3, "time": "2025-02-26", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Preventing war through strength: Deterrence and international security"}}, {"course_week": 4, "time": "2025-03-05", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {}, "description": {"et": "Swords to ploughshare? Arms control, disarmament, and international security"}}, {"course_week": 5, "time": "2025-03-12", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {}, "description": {"et": "The path to perpetual peace? Democracy and international security"}}, {"course_week": 6, "time": "2025-03-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {}, "description": {"et": "Where are the people? Human security, humanitarian intervention, and international security"}}, {"course_week": 7, "time": "2025-03-26", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 7, "topic": {}, "description": {"et": "Workshop: How to design an academic poster"}}, {"course_week": 8, "time": "2025-04-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {}, "description": {"et": "United we stand, divided we fall: Alliances and international security"}}, {"course_week": 9, "time": "2025-04-09", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 9, "topic": {}, "description": {"et": "No class: Independent work on the posters "}}, {"course_week": 10, "time": "2025-04-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {}, "description": {"et": "'Only one Earth': International security and the environment"}}, {"course_week": 11, "time": "2025-04-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {}, "description": {"et": "Cyber-warriors, killer-robots, and drones: Technology and international security"}}, {"course_week": 12, "time": "2025-04-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 12, "topic": {}, "description": {"et": "Guns for hire: Private actors in international security"}}, {"course_week": 13, "time": "2025-05-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 13, "topic": {}, "description": {"et": "Where are the women? Gender, violence, and international security"}}, {"course_week": 14, "time": "2025-05-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 14, "topic": {}, "description": {"et": "'Why do they hate us'? Terrorism and international security"}}, {"course_week": 15, "time": "2025-05-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 15, "topic": {}, "description": {"et": "'The weak suffer what they must'? Small states and international security"}}, {"course_week": 16, "time": "2025-05-28", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 16, "topic": {}, "description": {"et": "Final assessment: Poster presentations"}}]}, "registration_info": {"audience": {"et": "The course is for students of the Riigiteadused program. Space permitting, students from other programs and visiting students are welcome to join."}, "min_students": 10}, "parent_uuid": "66ad495a-1eb4-7aca-31b5-8739dd7607f6", "parent_code": "SVJS.00.044", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}