{"uuid": "2bb4cd93-17db-6229-c64a-6c5d4ff008ff", "code": "SVJS.00.023", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Illiberal Turn in Europe and Russia", "et": "Illiberaalne pööre Euroopas ja Venemaal"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course aims to build new comparative knowledge and expertise on the emergence, consolidation, and diffusion of the illiberal phenomenon in the EU, Wider Europe, and Russia - by focusing, in particular, on the dimensions of conceptualization and theorization, through the development of original and coherent study material. After defining a consistent analytical toolbox, students will have the chance to familiarize with specific national and regional cases by being exposed to a systematic comparative overview of the historical developments when it comes to the political, electoral, and ideological trends in Europe and Eurasia. The course also explores in depth the dimension of Europeanization and the trends of mutual influence at the continental level.", "et": "Kursuse eesmärk on luua uusi võrdlevaid teadmisi konsolideerimise ja levitamise kohta ELis, aga ka laiemalt Euroopas ja Venemaal. Kursuse teises pooles on tudengitel  võimaluse tutvuda konkreetsete riiklike ja piirkondlike juhtumitega, puutudes kokku võrdleva ülevaadetega ajaloolistest arengutest. Kursuse toimumise jooksul uuritakse põhjalikult ka euroopastumise mõõdet ja vastastikust mõju mandri tasandil."}, "objectives": [{"en": "The course explores the emergence, consolidation, and diffusion of illiberal dynamics at the national level - in terms of regime types, ideologies, and values - and the broader impact in terms of international order. After setting up a consistent theoretical framework and comparative toolbox to frame the multiplicity of illiberal phenomena the course focuses on the dynamics in different regional contexts of the EU (Western E., Central and Eastern E., Southern E., and Nordic E.), candidate countries, EU neighbourhood, and on Russia's experience. The trends of mutual influence between Wider Europe and Russia are also discussed as well as the foreign policy projection of illiberalism.", "et": "Kursus uurib illiberaalse dünaamika tekkimist ja levikut riiklikul tasandil - režiimitüüpide, ideoloogiate ja väärtuste osas - ning laiemat mõju rahvusvahelisele korrale. Lisaks teoreetilisele raamistikule keskendub kursus dünaamikale ELi erinevates piirkondades (Lääne-Euroopa, Kesk- ja Ida-Euroopa, Lõuna- ja Põhja-Euroopa). Lisaks vaadeldakse kandidaatriikide, ELi naabrusriikide ja Venemaa kogemusi. Samuti käsitletakse Euroopa ja Venemaa vastastikust mõju ning illiberalismi välispoliitilist prognoosi."}], "learning_outcomes": [{"en": "By the end of the course students are expected to:\n- apply theories and concepts related to illiberalism\n- Critically read the ideological and political developments in Europe and Eurasia\n- Contextualize the various declinations of the phenomenon in different geo-territorial contexts\n- interpret of trends of mutual influence across the territorial contexts and role of the Europeanization process\n- Understand (and problematize) the internal and external policy implications\n- Critically read the repercussion on the EU neighbourhood", "et": "Kursuse lõpuks oskab tudeng:\n- rakendada illiberalismi teooriaid ja kontseptsioone\n- lugege kriitiliselt Euroopa ja Euraasia ideoloogilisi ja poliitilisi arenguid\n- tõlgendada vastastikust mõju territoriaalses kontekstis ja euroopastumisprotsessi rolli\n- mõista sise- ja välispoliitika mõjusid\n- mõista kriitiliselt tagajärgi ELi naaberriikidele"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}