{"uuid": "394a6e99-d3bd-0847-addd-58d56c4362ca", "code": "SVJS.00.036", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Seminar", "et": "Magistriseminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Master's seminar takes place in the autumn and spring semesters of the second study year. Learning will be organised in the e-seminar format. In autumn semester seminars, the students will present their research plans (incl. research question, theoretical framework, research methodology, and expected findings), answer questions about their research plans, and discuss the research plans of fellow students. In spring, the students will participate in a mock defence of their MA thesis draft.", "et": "Magistriseminar toimub teise õppeaasta sügis- ja kevadsemestril. Õppetöö viiakse läbi e-seminari vormis. Sügissemestri seminarides tutvustavad üliõpilased oma magistritöö kavandit (sh uurimisküsimus, teoreetiline raamistik, uurimismetoodika ja oodatavad tulemused), vastavad küsimustele kavandi kohta ja arutavad teiste üliõpilaste kavandeid. Kevadsemestril toimub magistritöö proovikaitsmine."}, "objectives": [{"en": "The aim of the course is to aid students in their thesis writing process. Using practical exercises, the course advances students' skills in conducting, presenting, critically assessing and discussing academic research, and thereby supports the successful completion of the MA thesis.", "et": "Kursuse eesmärk on aidata tudengeid lõputööde kirjutamisel. Kasutades praktilisi harjutusi, arendab kursus üliõpilaste oskusi akadeemiliste uuringute läbiviimisel, esitamisel, kriitilisel hindamisel ja arutamisel ning toetab seeläbi magistritöö edukat lõpetamist."}], "learning_outcomes": [{"en": "Students completing the course will (1) have improved their ability to plan their work; (2) be able to formulate a relevant, well-justified and original research question and choose an appropriate research design to answer that question; (3) be able to link theoretical approaches to research methods and empirical analysis; (4) be able to present analytical, structured and well-substantiated arguments, and (5) be familiar with principles of academic writing and code of conduct for academic research.", "et": "Kursuse läbinud õpilased (1) on parandanud oma oskusi oma tööd planeerida; 2) on võimelised sõnastama asjakohase, hästi põhjendatud ja originaalse uurimisküsimuse ning valima sellele küsimusele vastamiseks sobiva uurimiskava; (3) oskavad siduda teoreetilisi lähenemisviise uurimismeetodite ja empiirilise analüüsiga; 4) on võimelised esitama analüütilisi, struktureeritud ja põhjendatud argumente ning 5) tunnevad akadeemilise kirjutamise põhimõtteid ja head teadustava."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}