{"uuid": "544cbbdf-f64a-f781-4de9-86597c3c44dc", "code": "SVJS.00.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Central and East European, Russian and Eurasian Studies", "et": "Sissejuhatus Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringutesse"}, "credits": 12, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course aims to introduce issues, themes, and scope of the CEERES programme, to assist students in developing a targeted dissertation proposal. Two interconnected aims hence sit at the core of this course. On the one hand, the course intends to introduce the history, the politics, and key socio-economic developments across the region in question, namely Central, Eastern Europe and Eurasia, including Russia. On the other, the course aims to familiarise students with key concepts of the core disciplinary strands that underpin the CEERES programme. These two main topics divide the course also into two parts. In the first part, students work independently through e-learning materials that introduce either historical or contemporary developments in CEERE regions. After that, they create a digital presentation as a collective product where they analyse and compare particular developments in these regions. Those presentations get feedback in the weekly seminars. In the second half of the course, students work through independently video lectures that introduce the main Social Science concepts and theories. Based on those materials, students propose research puzzles that will be discussed in weekly seminars. The course ends with an oral examination where students demonstrate their knowledge of the main historical and contemporary developments in CEERE regions and their analytical skills. The final work of the course is students' research proposal of their MA theses that defines their 3rd-semester mobility.", "et": "Kursuse tutvustab Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringute õppekava peamisi teemasid, sõlmküsimusi ja uurimisfookust eesmärgiga toetada tudengite lõputöö uurimiskava arendamist. Kursus ühendab kahte põhiteemat: ühelt poolt annab kursus sissejuhatava ülevaate uuritava regiooni ja selle alaregioonide ajaloost, poliitikast ja sotsiaalmajanduslikest arengutest; teisalt tutvustab kursus regiooniuurinutega seotud alusdistsipliine ja nende põhimõisteid. Need kaks põhiteemat jagavadki kursuse kaheks mõtteliseks osas. Esimeses osas töötavad tudengid iseseisvalt läbi regioonide ajalugu või kaasaega puudutavad e-õppe materjalid ning loovad nende baasilt rühmatööna digitaalse ettekande, milles analüüsivad võrdlevalt konkreetseid arenguid nendes regioonides. Ettekandeid tagaisidestatakse iganädalastes seminarides. Kursuse teises pooles töötavad tudengid iseseisvalt läbi videoloengud, kus tutvustatakse peamisi sotsiaalteaduslikke kontseptsioone ja teooriaid. Lähtudes nendest põhimõistetest püstitavad tudengid uurimisprobleeme, mida arutatakse iganädalastes seminarides. Kursus lõppeb suulise eksamiga, kus tudengid demonstreerivad nii oma teadmisi regiooni ajaloolistest ja tänapäevastest arengutest kui ka analüüsi- ja sünteesioskusi. Kursuse lõpuks esitab tudeng ka oma lõputöö kavandi, mille tulemusel määratakse tema kolmanda semestri mobiilsus."}, "objectives": [{"en": "The course aims to create a general understanding of the main historical and contemporary developments in CEERE regions and introduce various disciplines in Social Sciences that enable scrutinising those developments. Thereby students have instruments to elaborate a research proposal for their dissertation. ", "et": "Kursuse eesmärkideks on luua üldine arusaam peamistest ajaloolistest ja tänapäevastest arengutest Kesk- ja Ida-Euroopas, Venemaal ja Euraasias ning tutvustada erinevaid sotsiaalteaduslikke distsipliine nende uurimiseks, et iseseisvalt välja töötada oma lõputöö uurimisplaan."}, {"en": "To achieve this general aim, the course develops various essential skills to graduate from the CEERES curriculum. Among them, the most crucial skills are:", "et": "Selle üldise eesmärgi saavutamiseks arendatakse kursusel erinevaid oskusi, mis on vajalikud CEERES õppekava läbimiseks. Nendest olulisemad on: "}, {"en": "- comparative analysis to compare and contrast various regions of the CEERES curriculum;", "et": "- võrdlev analüüsi oskus, et kõrvutada ja võrrelda erinevaid regioone, mis on õppekava uurimisfookuses;"}, {"en": "- synthesising to interpret and reflect the historical and contemporary social developments in CEERE regions;", "et": "- sünteesimisoskus, et lahti mõtestada õppekava uurimisfookuses olevates regioonides toimunud ja toimuvaid ühiskondlikke arenguid;"}, {"en": "- defining a research puzzle to develop a research proposal independently;", "et": "- oskus sõnastada uurimisprobleem, et selle baasilt iseseisvalt välja töötada uurimiskava;"}, {"en": "- peer-learning and constructive feedbacking to support independent learning;", "et": "- vastastikuse õppimise ja konstruktiivse tagasisidestamise oskus, et toetada iseseisvat õppimist;"}, {"en": "- creating academically rigorous digital joint production to enhance peer-learning skills;", "et": "- oskus luua akadeemiliselt pädevat digitaalset ühisloomet, et seeläbi tugevdada vastastikuse õppimise oskust;"}, {"en": "- cooperation skills of the study group to create and enhance the study cohort's identity.", "et": "- õppegrupi meeskonnatöö oskusi, et seeläbi luua nende õppegrupi ühine identiteet."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students should be able to:", "et": "Kursuse lõpetamisel tudeng"}, {"en": "- Critically analyse the history, the politics, and the socio-economic landscapes of Central and Eastern Europe, Eurasia, and Russia;", "et": "- analüüsib kriitiliselt ajalugu, poliitilisi ja sotsiaalmajanduslikke arenguid Kesk- ja Ida-Euroopas, Venemaal ja Euraasias;"}, {"en": "- Make coherent connections between historical processes and contemporary socio-political developments, including the international relations of the region in question;", "et": "- loob mõistetavaid seoseid ajalooliste protsessise ja kaasaegsete sotsio-poliitiliste arengute vahel, sh regiooni puudutavates rahvusvahelistes suhetes;"}, {"en": "- Understand and discuss key concepts of Political Science, International Relations, Sociology, Anthropology, Cultural Studies relevant to the study of the CEERES region;", "et": "- mõistab ja arendab diskussiooni põhiterminitega, mis on seotud politoloogia, rahvusvaheliste suhete, sotsioloogia, antropoloogia ja kulturoloogiaga;"}, {"en": "- Apply these concepts to elaborate a coherent analysis of the programme's focus region;", "et": "- rakendab neid põhitermineid terviklikus analüüsis õppeaine fookuses olevate regioonidega seoses;"}, {"en": "- Develop an independent research proposal related to one of the programme's core disciplinary fields with specific focus on one of the geographical constituents of CEERES's focus region.", "et": "- arendab iseseisva uurimiskava, mis tugineb vähemalt ühele õppekava alusdistsipliinile ja on seotud ühe õppekavaga seotud regiooniga."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}