{"uuid": "9a893341-18b8-d9d4-0bd0-60befb306ad8", "code": "SVJS.00.103", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T16:31:37", "title": {"en": "Prevention and Countering of Terrorism", "et": "Terrorismi ennetamine ja tõkestamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course covers the prevention and combating of terrorism at national, EU and international levels as well as introduces the organisations and documents vital to the prevention and combating of terrorism in the European Union. The course focuses on the impact of mass media, the Internet and new web technologies on terrorism as well as the prevention of terrorist and extremist content online. In addition, the course addresses the protection of critical infrastructure, use of drones by terrorists and as a conter-terrorism measure, responses to and management of terrorist acts, deradicalisation and deradicalisation programmes, and the importance of intelligence and respect for human rights in preventing and countering terrorism.", "et": "Kursus käsitleb terrorismi ennetamist ja tõkestamist riiklikul, Euroopa Liidu ülesel ja rahvusvahelisel tasandil ning tutvustab Euroopa Liidu terrorismi ennetamise ja tõkestamise vaates olulisi organisatsioone ja dokumente. Kursus keskendub massimeedia, interneti ja uude veebitehnoloogiate mõjule terrorismile ning terroristliku ja äärmusliku sisu tõkestamisele veebis. Lisaks käsitleb kursus kriitilise infrastruktuuri kaitset, droonide kasutamist terroristide ja terrorismivastases töös, terrorirünnakutele reageerimist ja nende ohjamist, deradikaliseerumist ja deradikaliseerimisprogramme ning luure ja inimõiguste järgimise olulisust terrorismi ennetamises ja tõkestamises."}, "objectives": [{"en": "The aim of the course is to familiarise students with measures to prevent and combat terrorism at national, EU and international level. The course addresses the impact of mass media and the Internet on terrorism as well as measures of preventing terrorist and extremist content online. The course also examines the protection of critical infrastructure, the importance of intelligence as well as respect for human rights in preventing and countering terrorism.", "et": "Kursuse eesmärk on tutvustada õppijatele terrorismi ennetamise ja tõkestamise meetmeid riiklikul, Euroopa Liidu ja rahvusvahelisel tasandil. Kursus mäsitleb massimeedia ja interneti mõju terrorismile ja terroristliku ja äärmusliku sisu tõkestamise meetmeid veebis. Samuti käsitleb kursus kriitilise taristu kaitset, luure ning inimõiguste järgmise tähtsust terrorismi ennetamis- ja tõkestamistöös."}], "learning_outcomes": [{"en": "Having completed the course, the learner will \n- describe terrorism prevention measures and counter-terrorism cooperation at national, EU and international levels;\n- analyse the impact of mass media and the Internet on terrorism;- know measures of prevention of the terrorist and extremist content online;\n- analyse the importance of respect for human rights and intelligence in the prevention and countering of terrorism.", "et": "Kursuse tulemusena õppija:\n - kirjeldab terrorismi ennetustööd ja terrorismivastast koostööd riiklikul, Euroopa Liidu ja rahvusvahelisel tasandil, \n- analüüsib massimeedia ja interneti mõju terrorismile, \n- teab terroristliku ja äärmusliku sisu tõkestamise meetmeid veebis,\n - analüüsib inimõiguste järgimise ja luure tähtsust terrorismivastases võitluses"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}