{"uuid": "84bd8657-26b6-63cc-8c98-99a3e30fcfdc", "code": "SVJS.00.095", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:35:06", "title": {"en": "Classics in Political Theory", "et": "Poliitikateooria klassikud"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview of the ideas of Europe's major political philosophers.  A selection of the following authors will be discussed: Socrates, Platon, Aristotle, Machiavelli, Hobbes, Locke, Montesquieu, Rousseau, Kant, Wollstonecraft, Burke, Herder, Hegel, Mill, Marx.", "et": "Kursus annab ülevaate Euroopa tähtsamate poliitikafilosoofide ideedest. Käsitletakse valikut järgmistest autoritest: Sokrates, Platon, Aristoteles, Machiavelli, Hobbes, Locke, Montesquieu, Rousseau, Kant, Wollstonecraft, Burke, Herder, Hegel, Mill, Marx."}, "objectives": [{"en": "The aims of the course are to:", "et": "Kursuse eesmärkideks on:"}, {"en": "- provide basic knowledge of the main ideas of the most important European political philosophers from Socrates to Marx;", "et": "- anda alusteadmised Euroopa tähtsamate poliitikafilosoofide peamistest ideedest Sokratesest Marxini;"}, {"en": "- teach students to analyse texts of political theory, specifying the main problem that the author is tackling, reconstructing the argument and assessing it critically;", "et": "- õpetada üliõpilasi analüüsima poliitikafilosoofilisi tekste, määratlema autori ees seisvat põhiprobleemi, rekonstrueerima argumentatsiooni ning seda kriitiliselt hindama;"}, {"en": "- teach students to analyse the authors` and their texts' relationship to historical context;", "et": "- õpetada üliõpilasi analüüsima autorite ja nende tekstide seoseid ajaloolise kontekstiga;"}, {"en": "- to raise students' awareness of the historical origins and complex evolution of our current central political concepts;", "et": "- suurendada üliõpilaste teadlikkust meie praeguste kesksete poliitiliste mõistete ajaloolisest päritolust ja komplekssest kujunemisloost;"}, {"en": "- teach students to discuss problems in political theory and to justify their normative views on politics.", "et": "- õpetada üliõpilasi poliitikateooria probleemide üle arutlema ning oma normatiivseid seisukohti põhjendama."}], "learning_outcomes": [{"en": "The student who has fulfilled the course successfully:", "et": "Õppeaine edukalt sooritanud üliõpilane:"}, {"en": "1) has an overview of the main ideas of the most important European political philosophers;", "et": "1) omab ülevaadet Euroopa tähtsamate poliitiliste filosoofide peamistest ideedest;"}, {"en": "2) is able to analyse texts of political theory, specifying the main aims and solutions of the author;", "et": "2) oskab analüüsida poliitikafilosoofilisi tekste, määratledes autori eesmärgid ning lahendused;"}, {"en": "3) is able to relate the key ideas of the texts discussed to the historical context;", "et": "3) omab teadmisi poliitikateooria klassikaliste tekstide seostest ajaloolise kontekstiga;"}, {"en": "4) can specify the most important interpretations of the key concepts of political philosophy, is able to compare and analyse their meaning in different contexts;", "et": "4) teab poliitikateooria põhimõistete erinevaid tõlgendusviise erinevates teooriates, oskab võrrelda ja analüüsida nende tähendust eri kontekstides;"}, {"en": "5) is able to discuss problems in political theory and to give a justification of their own normative views on politics.", "et": "5) oskab arutleda poliitikateoreetiliste probleemide üle ning oma normatiivseid poliitika-alaseid vaateid põhjendada."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}