{"uuid": "4193c887-fe40-c6a6-9fee-83d4438c4924", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-18T11:22:01", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 30, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 780, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "MA thesis is student's independent research project that is developed under supervision of their supervisors. Student will get cosupervisors from the University of Tartu and University of Glasgow and main supervisor from one of the third semester universities. MA thesis will be defended in front of joint commission where participates at least one representative of each degree awarding institutions. During the process of writing dissertation student can spend their fourth semester at the university of third semester or at the UT or UG. In exceptional cases, they can use also forth mobility if it is justified with necessity to collect data for the MA thesis. In this case student can go to one of the partner universities of their specialisation track.", "et": "Magistritöö on tudengi individuaalne uurimisprojekt, mida ta arendab koostöös oma juhendajatega. Üliõpilane saab kaasjuhendajad, kas Tartu Ülikoolist või Glasgow Ülikoolist ja põhijuhendaja ühest valikmooduli ülikoolist. Magistritöö kaitstakse ühiskomisjoni ees, kuhu kuuluvad iga kraadi andva partnerülikooli esindajad.\nMagistritöö kirjutamise ajal on tudeng kas samas ülikoolis, kus ta õppis kolmandal semestril või TÜ-s või GÜ-s, või kasutab neljandat mobiilsust (ainult juhul, kui see osutub vajalikuks magistritöö kirjutamisel), et siirduda sama spetsialiseerumissuuna teise ülikooli."}, "objectives": [{"en": "The Master's Thesis is intended to be a focused piece of work that, whilst building upon themes and issues covered in one or several of the course options permits students to develop their own ideas and demonstrate their capacity for original thought and independent research. The Master's Thesis aims to enable students to identify and research particular issues or problems at a deeper level than is possible within assessed essays and to develop a critical analysis of the existing body of academic work relating to their topic of choice. Finally, the Master's Thesis aims to prepare students for further research, study or professional careers through the development of their skills in data collection and analysis, use of original sources and the conducting and writing up of a detailed research project.", "et": "Magistritöö eesmärgiks on demonstreerida tudengi võimekust läbi viia individuaalset uurimistööd ja arendada iseseisvat mõtlemist lähtudes teemadest ja uurimissuundadest Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringute õppekavas.  Magistritöö võimaldab tudengil määratleda konkreetne uurimisprobleem, mida uurida põhjalikumalt kui eelnevate kursuste raames tehtud kirjatööd on seda võimaldanud. Selline uurimus arendab olemasoleva kriitilise analüüsimise oskust, tuginedes oma uurimisvaldkonna olulisima akadeemilise kirjanduse läbitöötamisest. Magistritöö eesmärgiks on valmistada tudeng ette tulevaseks uurijaks või muuks erialaseks karjääriks, arendades tudengi andmete kogumise ja analüüsimise, originaalallikate kasutamise ja akadeemilise kirjutamise oskusi."}], "learning_outcomes": [{"en": "Defended MA thesis confirms that student is able", "et": "Kaitstud magistritöö tõendab, et tudeng on suuteline"}, {"en": "- to devise a realistic programme of research into a topic;", "et": "- looma realistliku uurimiskava oma uurimistöö teemal;"}, {"en": "- to collect, select and review relevant background literature;", "et": "- koguma, organiseerima ja läbi töötama töö teema seotud akadeemilist kirjandust;"}, {"en": "- to identify and gather research data (i.e. from original language sources, memoirs, interviews, the media, archives, government reports);", "et": "- määratlema ja koguma uurimisandmeid (nt originaalkeelsed allikad, memuaarid, intervjuud, meediatekstid, arhiivimaterjalid, valitsusdokumendid);"}, {"en": "- to understand and select the appropriate methodology for dealing with sources and data;", "et": "- mõistma ja välja valima sobiliku metodoloogia oma uurimistöö jaoks;"}, {"en": "- to apply these methods (e.g. historical analysis, content analysis, discourse analysis, questionnaires, interviews, participant observation);", "et": "- rakendama oma uurimistöös korrektselt neid meetodeid (nt. ajalooline analüüs, kontentanalüüs, diskursuseanalüüs, küsimustikud, intervjuud, osalusvaatlus);"}, {"en": "- to organise the data collected and analyse your findings;", "et": "- organiseerima oma andmestikku ja analüüsima oma uuringutulemusi;"}, {"en": "- to write up an original research report, present research methodology and findings/results to academic and professional audience;", "et": "- kokku kirjutama originaalsed uurimistulemused, presenteerides selgelt metodoloogiat ja sellekohast tulemuste analüüsi akadeemilisele ja erialasele auditooriumile;"}, {"en": "- to be self-critical about your findings and the limitations of your analysis.", "et": "- olema enesekriitiline oma tulemuste analüüsimisel ja uurimistöö piirangute hindamisel."}], "notes": {}}, "grading": {"independent_work": {"et": "written thesis - MA thesis guidelines available under course materials."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Content assessment Criteria\nProblem Outline, Research Goals and Objectives, Hypothesis \nResearch Methodology  \nData analysis and interpretation  \nCoherence, Argumentation and Research Outcomes \n\nPresentation assessment criteria\nOrganization of the Presentation \nDiscussion, responding to questions\n\nDetailed assessment criteria are available in MA thesis guidelines under course materials."}}], "grade_preconditions": {"et": "Students should be aware that they will NOT BE PERMITTED to submit their final Master's Thesis unless a full draft has been seen and reviewed by their supervisor. The full draft must be submitted by the agreed deadline at each partner - normally around the end of the Spring term. The final Master's Thesis should be submitted by the first Monday of September. The oral defence takes place one month later."}, "grade_evaluation": {"et": "The Final score is calculated based on the following components: Glasgow reviewer (25%), Tartu reviewer (25%), Third mobility reviewer (25%), oral defence (25%)"}, "debt_elimination": {"et": "According to consortium partners regulations."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": false, "recommended_materials": "Allen, G. (1987) The Graduate Students' Guide to Theses and Master's Thesiss, San Francisco, London: Loosey-Bass.\nAnderson, J. (1998) Assignment and Thesis Writing, Brisbane: Wiley.\nBecker, H. (1998) Tricks of the Trade: How to Think About Your Research While You're Doing It, Chicago: University of Chicago Press.\nPiantanida, M. (1999) The Qualitative Master's Thesis: A Guide for Students and Faculty, Thousand Oaks: Corwin Press.\nRudestam K. (1992) Surviving your Master's Thesis, London: Sage.\nTaylor, G. (1989) The Students' Writing Guide for the Arts and Social Sciences, Cambridge: Cambridge University Press.\nTurabian, K. (1987) A Manual for Writers of Research Papers, Theses, Master's Thesiss, London: Heinemann.\nWatson, G. (1987) Writing a Thesis: A Guide to Long Essays and Master's Thesiss, London: Longman.\nWolcott, H. (1990) Writing Up Qualitative Research, London: Sage"}, "participants": {"lecturers": [{"person_uuid": "2cb62b6a-eed9-82c4-021d-f2411c405e2c", "person_name": "Heiko Pääbo", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {"et": "MACEERES students"}, "min_students": 1}, "parent_uuid": "6e68a447-3aa9-9ba1-5556-14b11dad1294", "parent_code": "SVJS.00.010", "parent_credits": 30, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}