{"uuid": "206cf224-c727-4657-da55-e0792440303a", "code": "SVJS.00.030", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Regional Integration Processes in Europe and Eurasia", "et": "Piirkondlikud integratsiooni protsessid Euroopas ja Euraasias"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course aims to give a systematic overview of institutional and historical developments in the process of European and Eurasian integration in a changing world and of how they influence the interaction between the EU and Russia and the EaEU. The course looks at the process of supranational and regional integration in Europe and Russia and its causal relationship with analytical and practical issues related to EU politics, EU-Russia relations, nations, and societies.\nWhile addressing the above-mentioned learning components, the course will introduce and apply content analysis to case study approach, both in analytical and practical terms, with a specific focus on case selection criteria.The course is based on a constant process of active learning and interactive teaching.", "et": "Kursuse eesmärgiks on anda süstemaatiline ülevaade ühiskondlikest, rahvuslikest ja rahvusvahelistest arengutest muutuvas maailmas ja kuidas need arengud mõjutavad EL-i poliitikaid ja poliitikat ning EL-i suhet Venemaaga. Kursuse alguses analüüsitakse ühte \"šokk-juhtumit\" ja selle põhjuslikku suhet EL-i ja Venemaa poliitika, ühiskondade, ajaloo ning rahvusvahelise poliitikaga seotud analüütiliste ja praktiliste küsimustega."}, "objectives": [{"en": "The course explores the institutional and historical developments that relate to the emergence, transformation, and consolidation of the EU; while comparatively discussing the post-cold war attempts of regional integration in the former Soviet space. Part of the course will be specifically focused on the comparative dimension and the interaction between the EU and Russia from an historical and political perspective.\nThe course will focus on the multidimensionality of the process of regional integration in Europe and Eurasia moving throughout the analysis of the relevant cleavages in contemporary societies, determined by the progressive decline/redefinition of nation-states and the emergence of the transnational and multicultural polity in Europe.", "et": "Kursuse eesmärgiks on anda süstemaatiline ülevaade ühiskondlikest, rahvuslikest ja rahvusvahelistest arengutest, mis on seotud EL-i loomise, muutumise ja konsolideerumisega, ning EL-i suhtlusest globaalse rahvusvahelise süsteemi ja \"teistega\". Osa kursusest keskendub kitsamalt EL-i ja Venemaa vahelise suhtluse arengutele ja nende omavahelisele interaktsioonile ajaloolisest ja poliitilisest perspektiivist vaadatuna. Seega keskendub kursus Euroopa ja regionaalse integratsiooni protsessi mitmetahulisusele, analüüsides kaasaegsetes ühiskondades esile kerkinud lõhesid, mis on tekkinud rahvusriikide ümbermääratlemise ning rahvusülese ja multikultuurilise Euroopa (ümber)korralduse tulemusena."}], "learning_outcomes": [{"en": "Upon completion of the course a student will:\n- understand and critically assess the main institutional actors of the EU and of the EaEU;\n- make sense of the decision-making process in the EU and EaEU and of the role of the actors involved;\n- analytically and practically navigate throughout concepts and objects of the contemporary changing world;\n- connect different dimensions of politics and policy-making in Europe and Eurasia for different multi- disciplinary perspectives;\n- make sense of the historical developments of nation, state, and society in Russia and their relationship with the EU/European dimension", "et": "Kursuse läbinud üliõpilane:\n- navigeerib analüütiliselt ja praktiliselt mõistete ja objektide vahel, mis on iseloomulikud kaasaegsele muutuvale maailmale;\n- ühendab erinevaid poliitika ja poliitikakujundamise dimensioone erinevatest distsipliinidest ja perspektiividest lähtudes;\n- kirjeldab Euroopa integratsiooni protsessi läbi Euroopa ühiskondade, rahvuste ja riikide arengute;\n- tegutseb erinevates kultuurilistes keskkondades ja mõistab erinevaid EL-i (Euroopa), Venemaa, Balkanimaade, Balti riikide ja naabrite geo-territoriaalseid kontekste;\n- mõtestab lahti rahvuse, riigi ja ühiskonna arenguid Venemaal ja Venemaa suhteid EL-i ja Euroopaga;\n- tõlgendab suures koguses andmeid ja mõistab andmetel põhinevaid arutluskäike;\n- omab ülevaadet rahvusvaheliste suhete ajaloolisest arengust, EL-i põhilistest institutsioonidest selles süsteemis, EL-i ja Venemaa rollist selles ja nende omavahelistest suhetest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}