{"uuid": "59ff1455-8c95-520c-b2a3-ec0c51fa4881", "code": "sv-2025-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:24:19", "title": {"en": "War and Peace in International Relations", "et": "Sõda ja rahu rahvusvahelistes suhetes"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 A regular SV Eng", "et": "25/26 S PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The main aim of the course is to equip students with the theoretical background to carry out analysis of different cases of conflicts and peace processes and is thus structured around questions that seek to stimulate both theoretical discussions as well as policy debates. The course is thus structured around these two aims. The course seeks to provide knowledge regarding different approaches to the understanding of conflict and the conceptualization of peace in international relations. Furthermore, the course aims to explain various cases of conflicts and peace processes and the involvement of international and regional organizations. By studying both theory and practices of international relations at the end of this course students will have acquired knowledge about the applicability and relevance of various theories and concepts to an understanding of war and peace in international relations.", "et": "Kursuse põhieesmärk on anda õpilastele teoreetiline taust erinevate konfliktide ja rahuprotsesside juhtumite analüüsimiseks ning on seega üles ehitatud küsimuste ümber, mille eesmärk on ergutada nii teoreetilisi arutelusid kui ka poliitilisi debatte. Kursus on seega üles ehitatud nende kahe eesmärgi ümber. Kursuse eesmärk on anda teadmisi erinevatest lähenemistest konfliktide mõistmiseks ja rahu kontseptualiseerimiseks rahvusvahelistes suhetes. Lisaks on kursuse eesmärk selgitada erinevaid konfliktide ja rahuprotsesside juhtumeid ning rahvusvaheliste ja piirkondlike organisatsioonide kaasamist. Õppides selle kursuse lõpus nii rahvusvaheliste suhete teooriat kui praktikaid, on üliõpilased omandanud teadmised erinevate teooriate ja kontseptsioonide rakendatavuse ja asjakohasuse kohta sõja ja rahu mõistmisel rahvusvahelistes suhetes."}, "objectives": [{"en": "The main aim of the course is to equip students with the theoretical background to carry out analysis of different cases of conflicts and peace processes and is thus structured around questions that seek to stimulate both theoretical discussions as well as policy debates. The course is thus structured around these two aims. The course seeks to provide knowledge regarding different approaches to the understanding of conflict and the conceptualization of peace in international relations. Furthermore, the course aims to explain various cases of conflicts and peace processes and the involvement of international and regional organizations. By studying both theory and practices of international relations at the end of this course students will have acquired knowledge about the applicability and relevance of various theories and concepts to an understanding of war and peace in international relations.", "et": "Kursuse põhieesmärk on anda õpilastele teoreetiline taust erinevate konfliktide ja rahuprotsesside juhtumite analüüsimiseks ning on seega üles ehitatud küsimuste ümber, mille eesmärk on ergutada nii teoreetilisi arutelusid kui ka poliitilisi debatte. Kursus on seega üles ehitatud nende kahe eesmärgi ümber. Kursuse eesmärk on anda teadmisi erinevatest lähenemistest konfliktide mõistmiseks ja rahu kontseptualiseerimiseks rahvusvahelistes suhetes. Lisaks on kursuse eesmärk selgitada erinevaid konfliktide ja rahuprotsesside juhtumeid ning rahvusvaheliste ja piirkondlike organisatsioonide kaasamist. Õppides selle kursuse lõpus nii rahvusvaheliste suhete teooriat kui praktikaid, on üliõpilased omandanud teadmised erinevate teooriate ja kontseptsioonide rakendatavuse ja asjakohasuse kohta sõja ja rahu mõistmisel rahvusvahelistes suhetes."}], "learning_outcomes": [{"en": "11) Understand the distinction between intra-state and inter-state conflicts in international relations; ", "et": "1) mõistab riikidevaheliste ja riikidevaheliste konfliktide eristamist rahvusvahelistes suhetes;"}, {"en": "2) Explore and analyse the various causes of war and conditions of peace; ", "et": "2) uurida ja analüüsida erinevaid sõja põhjuseid ja rahutingimusi;"}, {"en": "3) Critically analyse the changing nature of contemporary conflicts; ", "et": "3) analüüsida kriitiliselt kaasaegsete konfliktide olemust;"}, {"en": "4) Use theoretical knowledge for the research of various cases of conflicts and peace agreements.", "et": "4) Kasutada teoreetilisi teadmisi erinevate konfliktide ja rahulepingute juhtumite uurimisel."}, {"en": "5) Identify policy debates with regards to contemporary practices of conflict resolution and peacebuilding by as well as the way in which these have been addressed in the academic literature", "et": "5) Teha kindlaks poliitilised arutelud konfliktide lahendamise ja rahutagamise tänapäevaste tavade üle ning viisid, kuidas neid on akadeemilises kirjanduses käsitletud."}], "notes": {}}, "grading": {"independent_work": {}, "grade_preconditions": {"et": "Seminars are compulsory. Students have to attend at least 6 out of 8 seminars in order to access the final grade. All absences can be compensated by answering the seminar questions in written form.\nThe group work presentations encourage the presentation of research findings in teams. Students will be able to choose which seminar topic and question they wish to cover in a Power Point presentation that will be delivered on the day of the seminar.  This is an assignment for groups of max 4 people with group presentation not lasting more than 15 min each. The main aspects to be covered are 1. The type of conflict addressed. 2. The causes of the conflict. 3. The factors leading up to the prolonged nature of the conflict or the signing of a peace agreement. 4. The success or failure of a peace agreement in the case of the conflict covered.  \nThe research papers represent individual assessments submitted by each student with the possibility of choosing from the following questions:\n1.\tWhat is the distinction between inter- state in intra-state conflict?\n2.\tHow new are new wars? Are their causes similar or dissimilar from previous wars?\n3.\tHow can non state military actors be held responsible for their involvement in war?\n4.\tWhat is the distinction between positive and negative peace?\n5.\tWhat can we learn from previous means of resolving inter-state conflicts?\n6.\tHow does the political economy of intra-state conflicts influence the tools available for their resolution?\n7.\tWhat explains the success and failure of a particular peace agreement?\n8.\tCan the promotion of liberal peacebuilding interventions and democratic political institutions in situations of protracted conflict lead to peace? \n9.\tWhat is hybrid war and how can we understand it in practice?\n10.\tHow do tactics of cyber war play into traditional forms of military conflict?\nThe assignment should include the application of the theoretical knowledge gained in the lectures to a specific case study of intra or inter-st"}, "grade_evaluation": {"et": "The final grade is composed of the results of the group work presentation (40%) and the research paper (60%)."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "8793fc32-55ec-d4d8-ac9f-fd2cc2df9e99", "person_name": "Ana-Maria Albulescu", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 1: The distinction between inter-state and intra-state conflict \nThe aim of this first session is to introduce students with the aims, structure and requirements of the course as well as introduce them to the main questions regarding the use of IR theory for understanding war today's world: What is the distinction between inter- state and intra-state conflict? Students will have the opportunity to familiarize themselves better with the required reading that will be taught and assessed throughout the course. \nBrown, Michael Edward, ed. The international dimensions of internal conflict. No. 10. Mit Press, 1996.\nCunningham, David E., and Douglas Lemke. \"Combining civil and interstate wars.\" International Organization 67.3 (2013): 609-6\nJudt, Tony. \"Post-War: a History of Europe since 1945, 2005.\" London: Vintage (2010).\nSarkees, Meredith Reid, Frank Whelon Wayman, and J. David Singer. \"Inter-state, intra-state, and extra-state wars: a comprehensive look at their distribution over time, 1816-1997.\" International Studies Quarterly 47.1 (2003): 49-70.\nThe Correlates of War Project https://correlatesofwar.org/"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 2: Causes of war \nThis second section will explore various causes of war based on the previously discussed distinction on intra/inter -state wars. It will touch upon various debates regarding the causes of war and the debates regarding new wars. The questions that surrounds these debates is: How new are new wars? Are their causes similar or dissimilar from previous wars? This session will explore cases from across the world.\nBerdal, Mats. \"How\" new\" are\" new wars\"? Global economic change and the study of civil war.\" Global Governance 9.4 (2003): 477-502.\nKaldor, Mary. \"Elaborating the 'New War' Thesis.\" Rethinking the nature of war. Routledge, 2005. 210-224.\nLevy, Jack S. \"The causes of war and the conditions of peace.\" Annual Review of Political Science 1.1 (1998): 139-165.\nLevy, Jack S., and William R. Thompson. Causes of war. John Wiley & Sons, 2011.\nOhlson, Thomas. \"Understanding causes of war and peace.\" European Journal of International Relations 14.1 (2008): 133-160."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 3: The political economy of war \nThis session explores new ways of thinking about war and possible directions for research derived from a review of the existing literature. It looks particularly at the political economy of war, focusing on economic causes and consequences. The session deals with the political economy of intra states conflicts and seeks to cover cases from Europe and Africa. It seeks to understand the following question: What can a political economy of war lens tell us about the causes of intra-state conflict? Are theories related to greed and grievance still relevant today?  This session will explore cases of intra-state conflicts from Africa.\nBerdal, Mats R., and David Malone, eds. Greed & grievance: Economic agendas in civil wars. Lynne Rienner Publishers, 2000.\nCoyne, Christopher J., and Rachel L. Mathers, eds. The handbook on the political economy of war. Edward Elgar Publishing, 2011.\nKeen, David. \"Greed and grievance in civil war.\" International Affairs 88.4 (2012): 757-777."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 4: State and non-state actors and the conduct of war\nThis session will look at the way in which war is defined by the actors involved in battlefield. It will seek to clarify the distinction between what constitute state and non-state actors in war, their military strategy tactics and aims. It addresses the following question: How can non state military actors be held responsible for their involvement in war?  This session will focus on the case of the Wagner Group in Ukraine.\nBassiouni, M. Cherif. \"The new wars and the crisis of compliance with the law of armed conflict by non-state actors.\" J. Crim. L. & Criminology 98 (2007): 711.\nChenoweth, Erica, and Adria Lawrence. Rethinking violence: States and non-state actors in conflict. MIT press, 2010.\nCunningham, David E., Kristian Skrede Gleditsch, and Idean Salehyan. \"Non-state actors in civil wars: A new dataset.\" Conflict management and peace science 30.5 (2013): 516-531.\nSchabas, William A. \"Punishment of non-state actors in non-international armed conflict.\" Fordham Int'l LJ 26 (2002): 907."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 1: Military effectiveness in war \nThis session explores what makes the militaries of some states highly proficient fighting machines, whereas others seemingly cannot execute the simplest tasks. We begin by looking at the various ways military effectiveness has been defined in the existing literature, and the different levels of analysis that are used to examine effectiveness. The goal in this session of the course is to understand and criticize how scholars of military effectiveness measure the concept.  This session will answer the following question: What can enhance the military effectiveness of the two parties in the Russia-Ukraine war? \nBiddle, Stephen, and Stephen Long. \"Democracy and military effectiveness: A deeper look.\" Journal of Conflict Resolution 48.4 (2004): 525-546.\nMillett, Allan R., and Williamson Murray, eds. Military effectiveness. Vol. 3. Cambridge University Press, 2010.\nPilster, Ulrich, and Tobias Böhmelt. \"Coup-proofing and military effectiveness in interstate wars, 1967-99.\" Conflict Management and Peace Science 28.4 (2011): 331-350."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 2: Hybrid war/Cyber war\nWhat is hybrid war and how can we understand it in practice? How do tactics of cyber war play into traditional forms of military conflict? These two questions will guide this session towards understanding the way in which current conflicts are being played beyond the battlefield, bringing with them the involvement of a series of non-traditional actors.  This session will address the Pentagon leaks in the context of the Russia-Ukraine war.\nJohnson, Robert. \"Hybrid war and its countermeasures: a critique of the literature.\" Small wars & insurgencies 29.1 (2018): 141-163.\nRobinson, Michael, Kevin Jones, and Helge Janicke. \"Cyber warfare: Issues and challenges.\" Computers & security 49 (2015): 70-94.\nRõigas, Henry. \"Cyber war in perspective: lessons from the conflict in Ukraine.\" A Civil-Military Response to Hybrid Threats (2018): 233-257."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 5: Understanding peace, positive and negative peace\nA dichotomous negative and positive peace framework is perhaps the most widely used today. Negative peace refers to the absence of direct violence. Positive peace refers to the absence of indirect and structural violence, and is the concept that most peace and conflict researchers adopt. The basic distinction between positive and negative peace was popularized by prominent peace theorist Johan Galtung. This session will explore this conceptual distinction. The question guiding this session is: What constitutes the main distinction between negative and positive peace?  \nGaltung, Johan. \"Peace, positive and negative.\" The encyclopedia of peace psychology (2011).\nGaltung, Johan, et al. \"Positive and negative peace.\" Johan Galtung: Pioneer of peace research (2013): 173-178.\nHerath, Oshadhi. \"A critical analysis of Positive and Negative Peace.\" (2016)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 6: Resolving inter-state conflicts\nThis session will look of means for resolving intra-state conflicts. It will assess the tools available to such resolution based on the historical examples of the League of Nations and the United Nations as international structures designed to maintain world peace in the context of the two world wars. The question guiding this session is : What can we learn from previous means of resolving inter-state conflicts? This session will look at the Palestinian issue in international law and the way in which the United Nations has dealt with it.\nKolb, Robert. \"The eternal problem of collective security: from the League of Nations to the United Nations.\" Refugee survey quarterly 26.4 (2007): 220-225.\nJenne, Erin K. \"Managing European conflicts through devolution: Lessons from the league of nations.\" (2010).\nSteiner, Zara. \"The League of Nations and the quest for security.\" The Quest for Stability: Problems of West European Security, 1918-1957 (1993): 35-70.\nPotter, Pitman B. \"The Palestine Problem Before the United Nations.\" American Journal of International Law 42.4 (1948): 859-861."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 7: Resolving intra-state conflicts\nThis session will assess the tools available for resolving intra-state conflict. It will make the distinction between peacekeeping, peacebuilding and peace agreements in the context of intra-state conflicts. The question guiding this session is: How do current tools available for resolving intra-state conflicts deal with the underlining causes of these conflicts? The session will focus on theoretical debates regarding the role of third-parties and spoilers in the resolution of intra-state conflicts and the theory of ripeness of conflicts.  This session will cover cases of unresolved conflicts from the post-Soviet space.\nAlbulescu, Ana Maria. Incomplete Secession after Unresolved Conflicts: Political Order and Escalation in the Post-Soviet Space. Routledge, 2021.\nNilsson, Desirée, and Mimmi Söderberg Kovacs. \"Revisiting an elusive concept: A review of the debate on spoilers in peace processes.\" International Studies Review 13.4 (2011): 606-626.\nYilmaz, Muzaffer Ercan. \"Intra-state conflicts in the post-Cold War era.\" International Journal on World Peace (2007): 11-33.\nZartman, I. William. \"Ripeness: The hurting stalemate and beyond.\" International conflict resolution after the Cold War 2 (2000): 225-250."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Lecture 8: The political economy of peace \nThis session looks at the way in which current peacebuilding interventions deal with the informal systems of power in the aftermath of war seeking to address the agendas of local and national political and military actors. It looks at the way in which UN peace operations in the post-Cold War era have been designed to address these issues.  The question guiding this session is: How do UN peace operations address the political economy of civil war?  This session will focus on the case of South Sudan \nBerdal, Mats, and Jake Sherman, eds. The Political Economy of Civil War and UN Peace Operations. Taylor & Francis, 2023.\nBerdal, Mats, and David Shearer. \"Hard Lessons from South Sudan.\" Survival 63.5 (2021): 69-96.\nPugh, Michael, Neil Cooper, and Mandy Turner, eds. Whose peace? Critical perspectives on the political economy of peacebuilding. Springer, 2016."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 3: Liberal peace-building\nThis session will engage with the concept and practice of liberal peacebuilding as well as its criticisms and seek to understand the following question: Can the promotion of liberal peacebuilding interventions and democratic political institutions in situations of protracted conflict lead to peace? \nCall, Charles T., and Susan E. Cook. \"On democratization and peacebuilding.\" Global Governance 9 (2003): 233.\nMansfield, Edward D., and Jack Snyder. \"Democratization and the Danger of War.\" International security 20.1 (1995): 5-38.\nNewman, Edward. \"Liberal'peacebuilding debates.\" New perspectives on liberal peacebuilding (2009): 26-53.\nZaum, Dominik. \"Beyond the\" liberal peace\".\" (2012): 121-132."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 4: Peacebuilding effectiveness \nWhat explains the success and failure of a particular peace agreement? This session will look at theories of international mediation and conflict resolution that address the issue of local peacebuilding and will assess the record of effectiveness of international mediators in delivering various peace agreements in intra-state conflicts.\nAutesserre, Séverine. \"International peacebuilding and local success: Assumptions and effectiveness.\" International Studies Review 19.1 (2017): 114-132.\nBercovitch, Jacob, and Leah Simpson. \"International mediation and the question of failed peace agreements: Improving conflict management and implementation.\" Peace & Change 35.1 (2010): 68-103.\nDenskus, Tobias. \"Peacebuilding does not build peace.\" Development in Practice 17.4-5 (2007): 656-662."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 5: Iraq-Iran War (1980-1988)\nThis session examines key episodes of conflict between Iran and Iraq in the 20th century and investigates the longer-term roots of conflict and its social, political, and ideological consequences. The question guiding this session is: What were the causes of this conflict?\nSwearingen, Will D. \"Geopolitical origins of the Iran-Iraq war.\" Geographical Review (1988): 405-416.\nKarsh, Efraim. \"Geopolitical determinism: The origins of the Iran-Iraq war.\" Middle East Journal 44.2 (1990): 256-268.\nNonneman, Gerd. The Gulf states and the Iran-Iraq war: pattern shifts and continuities. Palgrave Macmillan US, 2004."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 6: The War in Syria (since 2011)\nThis session is an attempt to understand the roots, dynamics, and trajectory of the Syrian uprising, with particular attention to the oft-neglected social, economic, political, and institutional factors that exacerbated mass discontent prior. The question guiding this session is: Is the new wars debate applicable to the war in Syria?\nGupta, Ranjit. \"Understanding the War in Syria and the Roles of External Players: Way Out of the Quagmire?\" The Round Table 105.1 (2016): 29-41.\nMalantowicz, Arturz. \"Civil war in Syria and the new wars debate.\" Amsterdam LF 5 (2013): 52.\nHughes, Geraint Alun. \"Syria and the perils of proxy warfare.\" Small Wars & Insurgencies 25.3 (2014): 522-538."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 7: The Camp David Accords (Framework for Peace in Middle East) (1978)\nThis session will look at the content, provisions, negotiations and actors involved in the Camp David Accords. It will analyse this inter-state peace agreement from the perspective of success and failure in international mediation.  The question guiding this session is: Can this agreement count as a success of international mediation and why?\nSalameh, Mohammed Abdul Rahman Bani, Mohammed Torki Bani Salameh, and Mohammad Kanoush Al-Shra'h. \"The Camp David Accords: Lessons and Facts.\" The Arab Journal For Arts Vol 9.2A (2012): 41-66.\nTelhami, Shibley. The Camp David Accords: A case of international bargaining. Georgetown University. School of Foreign Service. Institute for the Study of Diplomacy, 1992.\nKURUVILLA, SAMUEL J. \"The Camp David Accords: A Revisit in 2022.\" Journal of Polity and Society 14.1 (2022)."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Seminar 8: The Naivasha Agreement (2005)\nThis session will look at the content, provisions, negotiations and actors involved in the Naivasha Agreement. It will analyse this intra-state peace agreement from the perspective of success and failure in international mediation.  The question guiding this session is: Can this agreement count as a success of international mediation and why?\nKalpakian, Jack Vahram. \"Peace agreements in a near-permanent civil war: Learning from Sudan and South Sudan.\" South African Journal of International Affairs 24.1 (2017): 1-19.\nTull, Denis Michael. Sudan after the Naivasha peace agreement: No champagne yet. No. 3/2005. SWP Comments, 2005.\nMorrison, J. Stephen, and Alex de Waal. \"Can Sudan escape its intractability.\" Grasping the nettle: Analyzing cases of intractable conflict (2005): 161-182."}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "03d3e3ca-0c84-8110-9c2d-a98b278c9f28", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "3ac56347-85ae-7d3c-91e1-91fdb1d4c6d8", "parent_code": "SVJS.00.074", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}