{"uuid": "ed00e28d-b596-72cb-ad4f-7c452ca79181", "code": "SVJS.00.092", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-18T11:14:30", "title": {"en": "International Relations", "et": "Rahvusvahelised suhted"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will provide students with the necessary knowledge of the key players in international relations and their activities in dealing with the issues that are topical in the international arena. The course will cover key actors such as the state and international organisations and their activities in major areas of international life and in addressing global problems.", "et": "Kursusega antakse üliõpilastele vajalikud teadmised rahvusvaheliste suhete olulistest toimijatest ning nende tegevustest probleemidega, mis on rahvusvahelisel areenil aktuaalsed. Kursuses käsitletakse olulisi toimijaid nagu riik ja rahvusvahelised organisatsioonid ning nende tegevusi peamiste rahvusvahelise elu valdkondades ja globaalprobleemide lahendamisel."}, "objectives": [{"en": "The aim of the course is to provide students with a basic knowledge of international relations studies: boundaries of the discipline, terminology, actors, main areas of research.", "et": "Õppeaine eesmärgiks on anda tudengitele baasteadmised rahvusvaheliste suhete teadusainest: distsipliini piirid, terminoloogia, toimijad, peamised uurimisalad."}], "learning_outcomes": [{"en": "The course will address what defines the discipline of international relations studies - who (or what) are the main actors in international relations, what are the relationships between them and what are the main problem areas. The course will provide the basis for a specialised module, where the basic knowledge acquired will be complemented by an understanding of the explanations of the interactions between actors. ", "et": "Kursusel käsitletakse, millega on rahvusvaheliste suhete teadusdistsipliin piiritletud - kes (või mis) on peamised toimijad rahvusvahelistes suhetes, millised on nendevahelised suhted ning millised on peamised probleemvaldkonnad. Kursus annab aluse erialamooduli läbimiseks, kus saadud baasteadmistele lisanduvad arusaamad toimijate omavahelise suhtluse seletustest. "}, {"en": "On completion of the course, the student will:", "et": "Kursuse läbides tudeng:"}, {"en": "1. knows the objects of study, variables and boundaries of international relations as a research discipline;", "et": "1. teab rahvusvaheliste suhete kui teadusdistsipliini uurimisobjekte, muutujaid ja piire;"}, {"en": "2. is familiar with the terminology of the subject;", "et": "2. tunneb erialast terminoloogiat;"}, {"en": "3. is oriented towards the main fields of international relations and global issues;", "et": "3. orienteerub rahvusvaheliste suhete peamistes valdkondades ning globaalsetes probleemides;"}, {"en": "4. is familiar with the main actors and related concepts;", "et": "4. tunneb peamisi toimijaid ja nendega seotud kontseptsioone;"}, {"en": "5. Can relate empirical behaviour of actors to concepts;", "et": "5. oskab toimijate empiirilise käitumise siduda kontseptsioonidega;"}, {"en": "In the course of the course, the student will develop the different skills - teamwork, oral and written expression, searching and using data - needed to solve the different tasks of the course.", "et": "Kursuse käigus arenevad tudengil erinevad oskused - meeskonnatöö, suuline ja kirjalik väljendusoskus, andmete otsimine ja kasutamine, mida kursuses erinevate ülesannete lahendamisel vaja läheb."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}