{"uuid": "bc7676e9-24db-fa43-4f04-05b3b55536c7", "code": "SVJS.00.089", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:05:06", "title": {"en": "Policy Analysis and Impact Assessment", "et": "Poliitikaanalüüs ja mõjude hindamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is divided conceptually into two larger parts:\n1) the theory, logic and methods to establish causality behind impact assessment/evaluation\n2) application of the methods on actual use cases and the interpretation of the results\n\nThe course will consist primarily of interactive lectures. The first part of the lecture gives an example of the problem and an actual impact assessment. This is followed by a practical task where students have to use the same analytical approach to go through the steps needed to conduct an impact assessment for a defined problem. \nFor selected examples, an actual data driven impact assessment will be conducted in class and the results interpreted.", "et": "Kursus on kontseptuaalselt jagatud kahte ossa:\n1) mõjuhindamise teooria, eeldused ja meetodid ning põhjuslikkus;\n2) meetodite rakendamine tegelike mõjuhinnangute näidetel, nende läbiviimine ja tulemuste mõtestamine.\n\nKursus koosneb interaktiivsetest loengutest. Loengu esimeses osas sõnastatakse esmalt probleem ja tuuakse tegelik näide mõjuhinnangu läbiviimisest. Loengu teises osas võetakse käsile praktiline ülesanne, mida lahendatakse loengu näites analoogselt tudengite poolse diskussiooni läbi. Diskussiooni sisuks on praktilise ülesande lahendamiseks vajalike analüütiliste sammude läbikäimine. Valitud teemade kohta viiakse osades loengutes koos tudengitega läbi andmete põhine reaalne mõjuhinnang ning selle tulemuste tõlgendamine."}, "objectives": [{"en": "The goal of impact assessment is to reduce the inherent uncertainty in any decision-making process, as well as to evaluate the outcomes of the decisions and actions taken. The need for impact assessment is universal but especially important in making policy and business decisions and re-evaluating their outcomes. Depending on the field conducting an impact assessment might even be compulsory, such as evaluating the impact of draft laws in the legislative process. Similarly, policy analysis ex post is crucial to ensure that public funds are being used responsibly and effectively.\n\nThe objective of this course is to demonstrate practical impact assessment before and after a decision, policy or business choice has been made. The course will introduce various formalized and not formalized impact assessment methods and tools that allows to arrive at measurable impact values. Both ex ante and ex post as well as qualitative and quantitative impact assessment methods will be examined. Also, market analysis and regulation impact assessment will be separately examined. Finally, policy analysis techniques will be examined in brief in order to understand which exact methods would be suitable for impact evaluation in the given policy designs.", "et": "Mõju hindamise eesmärk on vähendada otsustusprotsessides olemuslikult esinevaid riske ning hinnata tehtud otsuste tagajärgi. Vajadus selle järele on universaalne, kuid rõhutatult tugev poliitikate kujundamisel, äriliste otsuste vastuvõtmisel ning nende tegevuste hilisemal ümberhindamisel tekkinud info valguses. Näiteks seadusloomes on mõju hinnang lausa kohustuslik element iga õigusakti vastuvõtmise protsessis. Samuti on poliitikaanalüüs pärast ellurakendamist oluline avalike resursside mõistliku kasutamise tagamiseks.\n\nKursuse eesmärk on tutvustada praktiliste näidete abil mõju hindamise läbiviimist nii enne kui pärast otsuste vastuvõtmist. Tutvustatakse erinevaid formaliseeritud ja mitteformaliseeritud viise kuidas mõjusid hinnatakse, ja mil viisil leitakse erinevaid poliitika mõjude näitajaid.\nTutvustakse ja rakendatakse ex ante ja ex post mõju hindamise meetodeid. Samuti turuanalüüsi meetodeid, õigusaktide ja regulatsioonide oodatava mõjude hindamise viise ning lühidalt vaadatakse millised poliitikaanalüüsi disainide puhul on mõistlik mis sorti meetodeid rakendada."}], "learning_outcomes": [{"en": "Upon successfully passing the course students:", "et": "Kursuse läbinud tudeng:"}, {"en": "1) are able to dissect the analytical stages needed to conduct a policy impact assessment", "et": "1) eristab mõju hindamiseks vajalikke analüütilisi etappe;"}, {"en": "2) know the main theoretical approached to impact assessment and practical methods used to conduct an assessment", "et": "2) tunneb mõju hindamise tuntumaid teoreetilisi aluseid ning rakenduslikke meetoteid;"}, {"en": "3) can conduct an evidence-based impact assessment before and after a policy or business decision has been made;", "et": "3) hindab kvantitatiivselt ja kvalitatiivselt ning tõenduspõhiselt konkreetse poliitika või ärilise otsuse eeldatavat mõju enne rakendamist ja tegelikku mõju pärast rakendust;"}, {"en": "4) can identify metrics usable for impact evaluation;", "et": "4) leiab mõõdikuid ja oskab nende abil mõju hinnata;"}, {"en": "5) understand which type of data is necessary to be able to conduct impact assessment;", "et": "5) hindab, missuguse struktuuriga andmestikke on vaja mõju hindamiseks;"}, {"en": "6) know and can apply qualitative impact assessment methods.", "et": "6) teab ja rakendab kvalitatiivseid mõju hindamise viise."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}