{"uuid": "1ca43b4b-fa4c-d889-7e5a-ccd9985608c8", "code": "SVJS.00.058", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Public Procurement Documents", "et": "Hankedokumentide koostamine"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course primarily provides practical knowledge of how to prepare procurement contracts and documents related to public procurement. The course is conducted by experts in their field who have been dealing with procurement documents at a high level.", "et": "Kursus annab eelkõige praktilised teadmised sellest, kuidas koostada riigihangete juures olevaid hankelepinguid ning -dokumente. Kursust viivad läbi oma ala eksperdid, kes on hankedokumentidega tegelenud väga pikalt."}, "objectives": [{"en": "This course provides in-depth and practical knowledge of how to prepare procurement documents related to public procurement. Previous documents are also analyzed and the written language of procurement documents is practiced. The knowledge gained during the course has been valued on the labor market.", "et": "Antud kursus annab põhjalikud ja praktilised teadmised sellest, kuidas koostada riigihanke kõrval seisvaid hankedokumente. Samuti analüüsitakse varasemaid dokumente ning harjutatakse hankedokumentide kirjakeelt. Kursuse jooksul saadud teadmised on tööturul hinnatud."}], "learning_outcomes": [{"en": "Professional knowledge and skills. After successfully passing the course, the student can:", "et": "Erialased teadmised ja oskused. Õppeaine edukalt läbinud üliõpilane oskab:"}, {"en": "-\torient in the public procurement refister and public documents", "et": "-\tMõista riigihanke korraldust Eesti tasandil, oskab defineerida peamisi kitsaskohti ning nendega toime tulla;"}, {"en": "-\tthoroughly knows the objectives, processes and conditions of organizing public procurement", "et": "-\tKorraldada iseseisvalt riigihanget ning koostada sellega kaasnevaid dokumente;"}, {"en": "-\tprepare independently detailed procurement documents", "et": "-\tLeida enda riigihanke jaoks sobiva tarnija;"}, {"en": "-\tanalyse previously prepared procurement documents", "et": "-\tOrienteeruda Eesti riigihangete valdkonnas ning tunneb riigihangete e-keskkonda;"}, {"en": "-\tuse written language corresponding to official documents and read procurement-related laws", "et": "-\tKriitiliselt hinnata riigihankele kandideerivate ettevõtete tingimusi ning nende sobivust;"}, {"en": "-\tfind and notice typical mistakes made in procurement documents", "et": "-\tomab head ülevaadet hankeasjade planeerimisest ja korraldamisest"}, {"en": "-\tuse the programs needed to make and format documents (e.g. MS Word, MS Excel)", "et": "-\torienteeruda riigihangete registris ja avalikes dokumentides"}, {"en": "Transferable competencies. Upon successful completion of the course, the student can:", "et": "-\ttunneb põhjalikult riigihangete korraldamise eesmärke, protsesse ja tingimusi"}, {"en": "-\twrite a legal text and use formal written language", "et": "Ülekantavad oskused. Õppeaine edukalt läbinud üliõpilane oskab:"}, {"en": "-\tuse the digital tools and e-environments needed for work", "et": "-\tAnalüüsida varasemalt tehtud riigihangete kitsaskohti;"}, {"en": "-\twork in a group and lead it", "et": "-\tKirjutada juriidilist teksti;"}, {"en": "-\tformulate the needs of the organization/company and analyze them", "et": "-\tKasutada töös vajaminevaid digivahendeid ja e-keskkondi;"}, {"en": "-\tdefine specific procurement goals", "et": "-\tTeha grupis tööd ning vajadusel ka seda juhtida;"}, {"en": "-\treflect and evaluate his/her learning experience and the usability of the practical skills;", "et": "-\tsõnastada organisatsiooni/ettevõtte vajadusi ning neid analüüsida;"}, {"en": "-\twrite and choose specific document and format depending on the need;", "et": "-\treflekteerida ja hinnata oma õpikogemust ning praktiliste oskuste kasutamisvõimet."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}