{"uuid": "6758d196-cb92-5b32-a517-fe8167e29181", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-26T09:45:29", "title": {"en": "Introduction to Government and Politics", "et": "Sissejuhatus riigiteaduste erialasse"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 4, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course introduces the political studies realm from the perspective of its three disciplines - comparative politics, public administration and international relations. The course is organized in three parts:\n1) government and politics as a study path focuses on self-directed and informed choices regarding the personal planning of studies based on formal information of the study and curriculums as well as on the data, examples of the related choices made by earlier students of government and politics, and study materials covering three disciplines of political studies;\n2) government and politics as science (scientific path) introduces the research projects, research-based career paths based on projects and scholars of the Johan Skytte Institute of Political Studies, and study materials covering scientific research in three disciplines of political studies;\n3) government and politics as a career path deals with the theme \"professional jobs\" related to the academic discipline on the basis of career choices and paths of recent alumni of this discipline, who graduated the curriculum from 2 to 5 years earlier).", "et": "Aine tutvustab riigi- ja poliitikateadusi lähtuvalt kolmest erialast - võrdlev poliitika, avalik haldus ja rahvusvahelised suhted. Aine on korraldatud kolmes alaosas:\n1) riigiteadus kui õpe (õpirada) käsitleb enesestjuhitud kaalutletud valikuid õpingute ajalisel ja sisulisel planeerimisel lähtuvalt informatsioonist õppekorralduse ja õppekava kohta, lähtuvalt andmetest varasemate tudengite valikutest ning lähtuvalt õppematerjalidest kolme riigiteaduste eriala kohta;\n2) riigiteadus kui teadus (teadusrada) tutvustab teadusprojekte, teaduskarjääri võimalusi ja tudengite võimalusi neis projektides ka õpingute käigus osaleda lähtuvalt projektidest ja teadlastest Johan Skytte Poliitikauuringute Instituudis ning lähtuvalt õppematerjalidest kolme riigiteaduste eriala teadusuuringute kohta;\n3) riigiteadus kui amet (karjäärirada) käsitleb teemat \"erialased töökohad\" põhinedes näidetel ja andmetel sellest, millised on olnud hiljutiste vilistlaste (lõpetanud õppekava 2 kuni 5 aastat varem) töö- ja karjäärialased kaalutlused ja valikud."}, "objectives": [{"en": "The course enhances the skills of self-directed planning and decision-making, introduces the alternative paths and choices in the curriculum, top level scientific research in government and politics, career prospects outside of university. The aim of this course is to introduce the discipline of government and politics (public administration, international relations and comparative politics) from three dimensions: the disciplinary trajectory of studies; the disciplinary trajectory of science; the disciplinary trajectory of career in labor market. All three dimensions are tackled on the basis of academic course materials and the pragmatic choices and practical considerations of earlier students and the alumni (including scholars, researchers, civil servants etc.). Being informed about the choices and considerations of previous students allows first-year students of government and politics to make more informed self-directed choices in their own trajectories of study, research and career.", "et": "Riigiteaduste eriala tutvustav kursus toetab üliõpilase enesejuhtimisoskusi, tutvustab riigiteaduste õppekava läbimise valikuid ja võimalusi. Annab ülevaate riigiteadustega seotud teadustöödest, teaduskarjäärivõimalustest ning eriala karjäärivõimalustest pärast ülikooli lõpetamist. Õppeaine eesmärgiks on tutvustada riigiteaduste esmakursuslastele riigiteaduste eriala distsipliine - avalik haldus, võrdlev poliitika ja rahvusvahelised suhted - kolmest tahust lähtuvalt - riigiteadus kui õpe (õpirada); riigiteadus kui teadus (teadusrada); riigiteadus kui amet (karjäärirada). Kõigis kolmes tahus tuginetakse akadeemilistele õppematerjalidele ning käsitletakse ka varasemate tudengite (sh ka tänaste vilistlaste ja õppejõudude) valikuid ja kaalutlusi. Olles informeeritud varasemate tudengite valikutest ja kaalutlustest saavad riigiteaduste esmakursuslased langetada informeeritumaid enesest-juhitud valikuid nii oma õppe-, teadus- kui karjääritrajektooris."}], "learning_outcomes": [{"en": "Student who completes the course successfully is:", "et": "Ainekursuse läbinud üliõpilane:"}, {"en": "- informed about the choices and practical considerations of students of government and politics in three dimensions: academic discipline as a study, academic discipline as science, academic discipline as a career (in labor market);", "et": "- on informeeritud ja teadlik valikutest ja kaalutlustest, mida riigiteaduste tudengid teevad kolmes mõõtmes - riigiteadused kui õpe, riigiteadused kui teadus, riigiteadused kui amet;"}, {"en": "- capable of personally forming self-directed choices in three dimensions - academic discipline as a study, academic discipline as science, academic discipline as a career (in labor market);", "et": "- oskab langetada enesest-lähtuvaid informeeritud valikuid kolmes mõõtmes - riigiteadused kui õpe, riigiteadused kui teadus, riigiteadused kui amet;"}, {"en": "- able to plan autonomously and in a self-directed manner her/his paths of studies and of career.", "et": "- oskab iseseisvalt ja endast lähtuvalt planeerida oma riigiteaduste õpinguid ja töö-alast karjääri."}], "notes": {"et": "Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}}, "grading": {"independent_work": {"et": "Hinnatavad tegevused ja ülesanded toimuvad Moodle'is ja auditooriumis. Moodle'is hinnatavaid tegevusi ja ülesandeid käsitletakse ja harjutatakse auditoorsete tundide ajal nii iseseisvate ülesannete kui rühma-ülesannetena. Moodle'is sooritatakse kolm informeeritud enesestjuhitud kaalutluste ja valikute ülesannet kursuse kolmel alateemal (riigiteadused kui õpe; riigiteadused kui teadus; riigiteadused kui tööalane karjäär). Kursuse lõpus on kursusel läbitud teadmiste ja enesestjuhitud õppe- ja karjääritrajektoori sihistamise, planeerimise, enesejuhtimise ja prioriteetide seadmise kohta kokkuvõttev test."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2024-09-17", "description": {"et": "Viiel auditoorsel kohtumisel on auditoorsed ülesanded tunniks ettenähtud õppematerjali ja tunnis käsitletud teemade peale."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2024-10-01", "description": {"et": "Õpirajaga seotud enesestjuhitud informeeritud kaalutluste ja valikute ülesanded Moodle'is. Täpsemad tööjuhised on kirjas kursuse lehel Moodle keskkonnas."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2024-10-29", "description": {"et": "Teadusrajaga seotud enesestjuhitud informeeritud kaalutluste ja valikute ülesanded Moodle'is. Täpsemad tööjuhised on kirjas kursuse lehel Moodle keskkonnas."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "due_date": "2024-11-26", "description": {"et": "Tööalase karjäärirajaga seotud enesestjuhitud informeeritud kaalutluste ja valikute ülesanded Moodle'is. Täpsemad tööjuhised on kirjas kursuse lehel Moodle keskkonnas."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "due_date": "2024-12-10", "description": {"et": "Kursusel läbitud teadmiste ja enesestjuhitud õppe- ja karjääritrajektoori sihistamise, planeerimise, enesejuhtimise ja prioriteetide seadmise kohta kokkuvõttev test Moodle'i keskkonnas. \nTäpsemad tööjuhised on kirjas kursuse lehel Moodle keskkonnas."}}], "grade_preconditions": {"et": "Kolme enesestjuhitud kaalutluste ja valikute ülesande õigeaene sooritus Moodle'is ning koondtulemus vähemalt 19 punkti 36st võimalikust.\nLõpliku Moodle'i test-kontrolltöö õigeaegne sooritus.\nViie auditoorse ülesande koondtulemus vähemalt 21 punkti 40st võimalikust."}, "grade_evaluation": {"et": "Kursus on eristava hindamisega.\n40% - viis auditoorset ülesannet, a 8%\n36% - kolm enesestjuhitud kaalutluste ja valikute ülesannet, a 12%\n24% - hindeline test-kontrolltöö"}, "debt_elimination": {"et": "Vastavalt õppekorralduseeskirjale kokkuleppel vastutava õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Nädala jooksul peale hinnatava tegevuse sooritust."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "47904104-67a9-41a9-ba70-1bbbbc111e78", "type": "MOODLE", "code": "SVJS.00.077", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Õppematerjalideks on riigiteadusi ja selle alaosasid eriala ja teadusvaldkonnana tutvustav õppematerjal ning nii auditoorseteks tundideks kui Moodle'i iseseisvateks ülesanneteks andmestik ja informatsioon, mis tutvustab nii tekstilises vormis kui ka auditoorse tunni külalisesinejate vormis riigiteaduslikke erialaseid ja kajastavad riigiteadusi õppinud ja õppivate inimeste kaalutlusi ja valikuid: a. õpingutes, b. teaduskarjääris, c. töö-alases karjääris."}, "participants": {"lecturers": [{"person_uuid": "1a225f08-5974-10f7-ef3a-114e3110eaef", "person_name": "Alar Kilp", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1, 3, 5, 7, 9, 11, 13, 15"}, "entries": [{"course_week": 1, "time": "2024-09-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Kursuse tutvustus ja sissejuhatus riigiteaduste erala(de)sse."}}, {"course_week": 3, "time": "2024-09-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "Riigiteadus kui õpe (õpirada): avalik haldus, võrdlev poliitika, rahvusvahelised suhted. Valikud (1): põhieriala, kõrvaleriala, lõputöö."}}, {"course_week": 5, "time": "2024-10-01", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "Riigiteadus kui õpe (õpirada). Valikud (2): õppekava- ja õppetööväline: õppe prioritiseerimine ja planeerimine, sihistamine ja ajastamine, praktika, töövari, semester välismaal, tudengiseltsid ja -esindused."}}, {"course_week": 7, "time": "2024-10-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "Riigiteadus kui teadus (teadusrada): avalik haldus, võrdlev poliitika, rahvusvahelised suhted. Erialase teaduskarjääri trajektoorid üldiselt ja Skytte instituudis (teadusprojektid ja karjäärid ning tudengite osalusvõimalused)."}}, {"course_week": 9, "time": "2024-10-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "Riigiteadus kui teadus (teadusrada): avalik haldus, võrdlev poliitika, rahvusvahelised suhted. Erialase teaduskarjääri trajektoorid üldiselt ja Skytte instituudis (teadusprojektid ja karjäärid ning tudengite osalusvõimalused)."}}, {"course_week": 11, "time": "2024-11-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "Riigiteadus kui karjäär (karjäärirada: töö-alane karjääritrajektoor): avalik haldus, võrdlev poliitika, rahvusvahelised suhted. Karjäärivõimalused riigiteaduste bakalaureusekraadiga. Oskused ja teadmised, mis on vajalikud erinevatel riigiteadustega seotud ametitel ja töökohtadel."}}, {"course_week": 13, "time": "2024-11-26", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {}, "description": {"et": "Riigiteadus kui karjäär (karjäärirada: töö-alane karjääritrajektoor): avalik haldus, võrdlev poliitika, rahvusvahelised suhted. Karjäärivõimalused riigiteaduste bakalaureusekraadiga. Oskused ja teadmised, mis on vajalikud erinevatel riigiteadustega seotud ametitel ja töökohtadel."}}, {"course_week": 15, "time": "2024-12-10", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {}, "description": {"et": "Riigiteaduste eriala: üks kolmest, kolmest üks, inter-distsiplinaarsus."}}]}, "registration_info": {"audience": {}, "min_students": 10}, "parent_uuid": "b35b0372-e8c0-70e9-e323-9e10c5462cf6", "parent_code": "SVJS.00.077", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}