{"uuid": "a0038cc1-167d-3927-6493-435d89b4df2d", "code": "sv-2024-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-20T10:55:24", "title": {"en": "Introduction to Doctoral Studies at the Faculty of Social Sciences", "et": "Sissejuhatus doktoriõpingutesse sotsiaalteaduste valdkonnas"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SV", "structural_unit_name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course focuses on competences, skills and know-how that are relevant to all of the first-year students in the program, regardless of specialization. The topics covered include the planning and organization of studies in the Social Science PhD program, including the curriculum, its structure, requirements and options, individual study plans, and periodic progress reviews; the rights and obligations of PhD students and junior researchers; the process of planning, writing, submitting and defending a doctoral dissertation; the pros and cons of a monograph-style and article-based dissertation; supervision practices, co-supervision arrangements, issues related to co-authorship and ways to solve problems in the supervisor-supervisee relationship; the importance of feedback and criticism in research, and the ways to provide and receive feedback. The course provides an overview of the Estonian publication classification system and explains which publications meet the publication requirements for a doctoral dissertation at the UT. It will also cover the essentials of publishing in the social sciences, from considerations relevant to the choice of a journal to preparing and submitting manuscripts to responding to reviews and interacting with the editors. The course will also cover the basics of research dissemination and popularization, from conference participation to sharing one's research results with the media, via online networking sites and the social media. It will also focus on the fundamentals of research ethics, and the principles of open and responsible research. The course offers an introduction to applying for research funding and managing grant projects, focusing on the main sources of funding and types of grants before offering advice on proposal writing and sharing info on relevant support services at the UT. The course concludes with a discussion on how to survive and thrive as a PhD student and with sharing tips on time and self-management.", "et": "Loengute ja seminaride käigus tutvutakse doktoriõpingute korralduse ja eesmärkidega TÜs, doktoriõpingute planeerimisega, atesteerimisega, doktorandi ja nooremteaduri õiguste ja kohustustega, doktoritööle esitatavate nõuetega ja erinevate võimalustega doktoritöö kirjutamiseks (artiklipõhine doktoritöö ja monograafia), juhendamise praktikate ja heade tavadega, kaasjuhendamise ja kaasautorlusega. Samuti tutvutakse publikatsioonide klassifitseerimise süsteemidega, teadusartikli koostamise ja esitamisega, sh eelretsenseerimise põhimõtete ja tavadega, ning arutletakse ajakirja valiku üle ning õpitakse, kuidas vastata retsensentidele ning suhelda toimetajatega. Kursusel käsitletakse ka konverentsidel osalemise reegleid ja tavasid ning viise oma teadustöö nähtavuse tõstmiseks ning teadmiste jagamiseks ühiskonnaga. Samuti tutvutakse teadustöö eetika ja vastutustundliku ning avatud teaduse põhimõtetega ning antakse ülevaade teadusgrantide taotlemise ja nende elluviimise põhialustest. Kursuse lõpus arutame selle üle, mis aitab kaasa doktoriõpingute edenemisele, jagame aja- ja enesejuhtimise võtteid ja teeme selgeks, kust vajadusel abi ja toetust otsida."}, "objectives": [{"en": "The aim of the course is to provide first-year PhD students an overview of the goals and organization of doctoral studies at Faculty of Social Sciences at the University of Tartu (UT), to help them set goals and make informed choices about their studies and research, and to facilitate the transition to being a researcher by explaining and reflecting upon the rules, norms and 'ways of doing things' in contemporary social science, at the University of Tartu and in the program.", "et": "Aine eesmärk on anda esimese aasta doktorantidele ülevaade doktoriõpingute korraldusest ja eesmärkidest Tartu Ülikooli sotsiaalteaduste valdkonnas ja aidata neil teha informeeritud valikuid oma õpingute ja teadustööga seotud küsimustes. Kursus lihtsustab teadlasellu sisselamist, tutvustades sotsiaalteadustele, Eesti teadusele ja TÜ-le omaseid reegleid, norme ja ootusi ning pakkudes võimalusi nende üle arutleda."}], "learning_outcomes": [{"en": "Upon completion of the course, the doctoral student\n-\tunderstands the rules, procedures,and organization of doctoral studies at the UT's Faculty of Social Sciences, as well as the rights and obligations of PhD students and junior researchers;\n-\tis able to purposefully plan doctoral studies and set achievable goals, and is able to make informed choices about their studies and research;\n-\tis familiar with the requirements for a doctoral dissertation, as well as the process of planning, writing, submitting and defending a dissertation; is able to make an informed choice regarding the type of dissertation (monograph or article-based);\n-\tis familiar with the Estonian publication classification system and knows which publications meet the publication requirement of the doctoral thesis;\n-\tis familiar with the process and principles of academic peer-review and publishing; can make an informed choice regarding where to submit their work; knows how to prepare a manuscript for submission, how to  communicate with reviewers and editors;\n-\tis familiar with the rules, norms and conventions of participating in academic conferences;\n-\tknows how to increase the visibility of their research and how to share knowledge with the society;\n-\tis familiar with research ethics, and the principles of open and responsible science; is able to apply these norms and principles in their own work;\n-\tcan identify funding opportunities that match their profile; is familiar with the basics of preparing funding applications and managing grant projects; \n-\tis familiar with good supervision practices, knows how to work with the supervisor(s), co-authors and as part of a team;\n-\thas reflected upon what attitudes and behaviors contribute to or undermine progress in PhD studies/timely completion, and is familiar with strategies of time and self-management, as well as available channels of advice and support.", "et": "Aine edukal läbimisel doktorant mõistab doktoriõpet reguleerivaid õigusakte ning doktoriõppe ja teaduse hea tava põhimõtteid; teab oma õigusi ja kohustusi doktorandi ja nooremteadurina; oskab doktoriõpinguid  sihipäraselt planeerida ja teostatavaid eesmärke seada; teab doktoritööle esitatavaid nõudeid, omab ülevaadet doktoritöö kirjutamise, esitamise ja kaitsmise protsessist; tunneb publikatsioonide klassifitseerimispõhimõtteid; on kursis teadustöö retsenseerimise ja publitseerimise protsessi ja põhimõtetega; teab, kuidas valida teadusajakirja ning kuidas suhelda retsensentide ja toimetajatega; on kursis teaduskonverentsidel osalemise reeglite ja heade tavadega; teab, kuidas suurendada oma teadustöö nähtavust ja jagada teadmisi ühiskonnaga; tunneb teaduseetika ning vastutustundliku ja avatud teaduse põhimõtteid ning oskab neid oma töös rakendada; teab, kuidas leida teadustöö rahastamise võimalusi ning on kursis granditaotluste koostamise põhitõdedega; on kursis juhendamise hea tavaga ning teab, kuidas tõhusalt töötada koos juhendaja või kaasautoriga või teadusrühma liikmena; on reflekteerinud tegurite üle, mis mõjutavad doktoriõpingute edenemist, tunneb mõningaid aja- ja enesejuhtimise võtteid ning teab, kust leida vajadusel toetust ja abi."}], "notes": {}}, "grading": {"independent_work": {"et": "- submit a short (max 1.5 pages) statement that identifies three journals to which you could submit your research and justifies your choices;\n- submit a 250-word 'web page profile' that introduces you as a PhD student and your dissertation project, along with your ORCID ID, a link to your completed ETIS profile, and a link to your profile on one international academic networking site of your choice  (e.g. Google scholar, ResearchGate, academia.edu, etc);\n- submit a conference paper abstract (250 words), along with a justification (about half a page) for why you want to attend the conference in question, as well as an indicative budget for the conference trip;  \n- submit a 1-page reflection on ethics issues and considerations pertaining to your research;\n- submit a 1-page rationale section of an imaginary research funding proposal, providing reasons for why your research should be funded, considering both academic and societal relevance.\n\nAdditional guidelines for all assignments are available on Moodle."}, "grade_preconditions": {"et": "N/A"}, "grade_evaluation": {"et": "The course is evaluated on a pass/fail basis. To pass the course, the participants must:\n1)\tAttend 7 meetings out of 8 (exceptions granted in well-founded cases, if instructor is informed about absence in advance). NOTE: this is an in-person course but it will be possible to join online if you request this option at least 24 hours in advance.\n2)\tPhD student's period plan submitted and approved;\n3)\tsubmit a short (max 1.5 pages) statement that identifies three journals to which you could submit your research and justifies your choices;\n4)\tsubmit a 250-word 'web page profile' that introduces you as a PhD student and your dissertation project, along with your ORCID ID, a link to your completed ETIS profile, and a link to your profile on one international academic networking site of your choice  (e.g. Google scholar, ResearchGate, academia.edu, etc);\n5)\tsubmit a conference paper abstract (250 words), along with a justification (about half a page) for why you want to attend the conference in question, as well as an indicative budget for the conference trip;  \n6)\tsubmit a 1-page reflection on ethics issues and considerations pertaining to your research;\n7)\tsubmit a 1-page rationale section of an imaginary research funding proposal, providing reasons for why your research should be funded, considering both academic and societal relevance."}, "debt_elimination": {"et": "The instructor may extend the deadlines for assignments in exceptional circumstances (e.g. serious illness, etc)."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "9391cd87-a273-477b-bb91-301f9b3f025c", "type": "MOODLE", "code": "SVJS.00.043", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "1ff07011-8b53-4343-e595-c8c7e3e14201", "person_name": "Eva Piirimäe", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "229ed789-e9ab-97db-e761-095c14d7ffc1", "person_name": "Kairi Kreegipuu", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-15"}, "entries": [{"course_week": 1, "time": "2024-09-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "<b>Organization of doctoral studies at the Faculty of Social Sciences </b>\nThe curriculum, its objectives, structure, requirements and options; individual study plans; period plans; periodic progress reviews. Rights and obligations of PhD students and junior researchers. Relevant regulations and forms. Planning your studies and research and making informed choices. Codes of conduct, good practices. Various \"what if\" scenarios; Q&A."}}, {"course_week": 3, "time": "2024-09-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "<b>Doctoral dissertation</b>\nRequirements, relevant regulations, options (monograph or article-based), pros and cons of each option. Examples of both types of dissertations. Classification of research publications in the Estonian system. Web of Science, Scopus. Co-authored articles as part of the dissertation. Process and timeline: planning, writing, submitting and defending the dissertation. Role of supervisor, opponent, and council awarding the degree.Reference management tools. Academic writing tips."}}, {"course_week": 5, "time": "2024-10-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "<b>Publishing your research </b>\nPublication strategies, with a focus on journal articles and chapters in edited volumes. Selecting a journal, preparing the manuscript, going through peer-review, making revisions and responding to reviewers, dealing with 'reviewer 2.' How to obtain information about a journal: impact factor, citation indexes, rankings, etc. Submission systems and requirements. How to write cover letters, conflict of interest statements, funding notes, acknowledgements. Predatory journals, academic scam."}}, {"course_week": 7, "time": "2024-10-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "<b>Working with your supervisor, co-author and as part of a team </b>\nSupervision strategies and approaches. Codes of conduct, good practices. UT guidelines of equal treatment. Co-supervision arrangements. Co-authorship. Teamwork. Solving problems in the supervisor-supervisee relationship or in teamwork. Receiving and giving feedback, dealing with criticism."}}, {"course_week": 9, "time": "2024-10-31", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "<b> Professional associations, conferences, visibility and (social) media </b>\nThe importance of professional associations. Reasons for going to conferences. Types of conferences, how to choose a conference. Writing and submitting an abstract, writing and presenting your paper. Conference roles: chair, speaker, panelist, moderator, discussant, etc. Rules and norms of conference participation. Increasing the visibility of your research, sharing knowledge with the society. Working with the media, promoting your work on academic networking platforms and social media."}}, {"course_week": 11, "time": "2024-11-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "<b>Research ethics, responsible and open research </b>\nResearch ethics, responsible and open science\nEthics codes and procedures, ethics approvals, UT Research Ethics committee. Principles of RRI, open data, open science. Reflecting on research ethics and integrity in the context of your own research. Writing ethics sections of research proposals and funding applications."}}, {"course_week": 13, "time": "2024-11-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {}, "description": {"et": "<b>Preparing funding applications, managing grant projects </b>\nThe importance of external funding; major sources of funding (Estonian, EU, international); types of grants (personal/group/institutional; \"pure science\" vs applied research; identifying funding opportunities (Research Professional, grant matching tools); assessing the suitability of a call in light of your goals and credentials; key components of a grant proposal -- rationale, objectives, methods, activities, management, impact, dissemination. Proposal preparation and project management at the UT (Grant Center; grant web; finance web, etc)"}}, {"course_week": 15, "time": "2024-12-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 8, "topic": {}, "description": {"et": "<b>Surviving and thriving as a PhD student (and any other remaining issues) </b>\nAttitudes and behaviors that contribute to or undermine progress in PhD studies. Time and self-management techniques. Sources of advice and support."}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "bd1dadf5-70bd-ad70-525e-7cfdd9283b32", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "39e9b959-6367-4726-c40e-0864867d8700", "parent_code": "SVJS.00.043", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}