{"uuid": "8c80dd85-c2ad-c1f3-bbc3-b148d2d20bfc", "code": "SVJS.00.101", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-07-18T15:52:10", "title": {"en": "History, Causes, and Types of Terrorism", "et": "Terrorismi ajalugu, põhjused ja avaldumisvormid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course deals with the concept, history, and origins of terrorism in different contexts and regions. The course looks at the spread of terrorism in Estonia and elsewhere in the world. The course also focuses on explaining extremism and radicalisation as well as different theoretical approaches to them. The course examines suicide terrorism and its root causes, separatist terrorism, left-wing, right-wing, and Islamist extremism, their major narratives, symbols, group-based and individual perpetrators motivated by these ideologies as well as foreign terrorist fighters. In addition, the course focuses on the portrayal of terrorism in popular culture and the impact this exerts on societal perceptions of terrorism, its prevention, and deterrence.", "et": "Kursus käsitleb terrorismi mõistet, ajalugu ja põjuseid eri kontekstites ja piirkondades. Kursuse raames vaadatakse terrorismi levikut Eestis ja mujal maailmas. Samuti keskendub kursus äärmusluse ja radikaliseerumise selgitamisele ja neid puudutavatele eri teoreetilistele lähenemistele. Kursus käsitleb enesetaputerrorismi ja selle tegureid, separatistlikku terrorismi, vasak-, parem- ja islamiäärmuslust, nende põhinarratiive, sümboleid, rünnakute sooritavaid rühmitusi ja üksiküritajaid ning samuti naasvaid välisvõitlejaid. Lisaks keskendub kursus terrorimi kujutamisele popkultuuris ning selle mõjule ühiskondlikule arusaamale terrorismist, selle ennetamisest ja tõkestamisest."}, "objectives": [{"en": "The aim of the course is to introduce students to the phenomena of terrorism, extremism, and radicalisation as well as their nature and the complexities of their definition. The course examines left-wing, right-wing and Islamist extremism, their aims, major narratives, symbols, individual and group-based perpetrators. The course also investigates the portrayal of terrorism in popular culture and the impact this has on societal attitudes towards terrorism and counter-terrorism.", "et": "Kursuse eesmärk on tutvustada õppijatele terrorismi, äärmusluse, radikaliseerumise nähtusi, nende olemust ja nende määratlemise keerulist konteksti. Kursus käsitleb vasak-, parem- ja islamiäärmuslust, nende eesmärke, põhinarratiive, sümboleid, rünnakuid sooritavaid rühmitusi ja üksiküritajaid. Samuti selgitab kursus terrorismi kujutamist popkultuuris ja selle mõju ühiskondlikele hoiakutele terrorismi ja selle vastasele võitlusele."}], "learning_outcomes": [{"en": "Having completed the course, the learner will:", "et": "Kursuse tulemusena õppija: "}, {"en": "- define terrorism, extremism, and radicalisation and understands their nature; ", "et": "- määratleb terrorismi, äärmuslust ja radikaliseerumist ja mõstab nende olemust, "}, {"en": "- analyse the causes of terrorism in different contexts and regions; ", "et": "- analüüsib terrorismi põhjuseid erinevates kontekstites ja piirkondades, "}, {"en": "- knows the aims, basic narratives, and symbols of right-wing, left-wing and Islamist extremism; ", "et": "- tunneb parem-, vasak- ja islamiäärmusluse eesmärke, põhinarratiive ja sümboleid, "}, {"en": "- evaluate the impact of popular culture on society's perceptions of terrorism and counter-terrorism measures.", "et": "- hindab popkultuuri teoste mõju ühiskonna arusaamale terrorismist ja selle vastastest meetemetest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}