{"uuid": "ee97107c-63f7-eb27-cd3d-64ed69979a5e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-19T17:19:15", "title": {"en": "Green Transition in Europe", "et": "Euroopa rohepööre"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "As consequences of human-induced climate change are increasingly visible, the green transition has become an ever more salient political issue. On the global stage, the EU has emerged as one of the leaders of green transition, aiming at climate neutrality by 2050. To provide a comprehensive overview of the EU's green transition, this MA course sets out three intertwined goals. First, it will conceptualize the green transition as a major economic restructuring with variegated costs for different economic sectors and social groups. Second, it will provide students with a comprehensive overview of the EU's \"green\" initiatives as they have developed over time. Specific attention will be paid to the EU's current policies at the intersection of green finance, energy, and climate policies. Third, the course will explain how the European climate policy is situated in the broader context of EU politics and governance. Particular attention will be paid to the key roles of the European Commission, the Council, the Parliament, as well as the European Central Bank. Due to its topicality and societal relevance, the course is relevant to students interested in EU governance and policy but also how they are related to broader processes in the global economy.", "et": "Kuna inimtegevusest tingitud kliimamuutuste tagajärjed on üha nähtavamad, on rohelisest üleminekust saanud üha olulisem poliitiline probleem. Ülemaailmsel areenil on EL tõusnud üheks rohelise ülemineku eestvedajaks, mille eesmärk on saavutada kliimaneutraalsus aastaks 2050. Selleks, et anda terviklik ülevaade ELi rohelisest üleminekust, seab käesolev MA kursus kolm omavahel põimunud eesmärki. Esiteks käsitleb see rohelist üleminekut kui suurt majanduse ümberstruktureerimist, mille kulud on erinevatele majandussektoritele ja sotsiaalsetele rühmadele erinevad. Teiseks annab see õpilastele põhjaliku ülevaate ELi rohelistest algatustest, nagu need on aja jooksul arenenud. Erilist tähelepanu pööratakse ELi praegusele poliitikale rohelise rahanduse, energia ja kliimapoliitika ristumiskohas. Kolmandaks selgitatakse, kuidas Euroopa kliimapoliitika paikneb ELi poliitika ja valitsemise laiemas kontekstis. Erilist tähelepanu pööratakse Euroopa Komisjoni, nõukogu, parlamendi ja Euroopa Keskpanga võtmerollidele. Oma aktuaalsuse ja ühiskondliku olulisuse tõttu on kursus asjakohane üliõpilastele, kes on huvitatud EL valitsemisest ja poliitikast, aga ka sellest, kuidas need on seotud laiemate protsessidega globaalses majanduses."}, "objectives": [{"en": "This course is designed to provide a comprehensive understanding of how green transition is governed in Europe. By focusing on the EU's changing energy and climate policy, and the drivers of those policies, the course shows how the politics, policies and polity of the EU are the result of visionary ideas and power-play on the one hand, and functional necessities and global developments on the other hand. The course also aims to improve students' understanding of social science research methods, however, focusing on those elements that are most relevant for policy practice. As such, the course will be relevant to political science students focusing of the EU, international relations and regional studies, as well as would-be policy makers.", "et": "Selle kursuse eesmärk on anda terviklik arusaam sellest, kuidas Euroopas rohelist üleminekut juhitakse. Keskendudes ELi muutuvale energia- ja kliimapoliitikale ning nende poliitikate käivitajatele, näitab kursus, kuidas ELi poliitikad on ühelt poolt nägemuslike ideede ja võimumängu tulemus ning teiselt poolt funktsionaalsete vajaduste ja globaalsete arengute tulemus. Kursuse eesmärk on ka parandada õpilaste arusaamist sotsiaalteaduste uurimismeetoditest, keskendudes siiski neile elementidele, mis on poliitikapraktika jaoks kõige olulisemad. Sellisena on kursus asjakohane nii EL-ile, rahvusvahelistele suhetele ja regionaaluuringutele keskendunud politoloogiaüliõpilastele kui ka tulevastele poliitikakujundajatele."}], "learning_outcomes": [{"en": "Upon completing the course a student will: ", "et": "Kursuse läbimisel saab üliõpilane:"}, {"en": "- demonstrate knowledge and critically assess the current developments in EU energy and policy  ", "et": "- näidata teadmisi ja kriitiliselt hinnata praegusi arenguid ELi energeetikas ja poliitikas"}, {"en": "- assess the evolution of EU energy and climate policy in a historical context ", "et": "- hinnata ELi energia- ja kliimapoliitika arengut ajaloolises kontekstis"}, {"en": "- understand how energy and climate policy feeds into the broader picture of EU economic governance  ", "et": "- mõista, kuidas energia- ja kliimapoliitika panustub ELi majanduse juhtimise laiemasse pilti"}, {"en": "- assess the role of various EU institutions in in the governance process of EU energy and climate policy  ", "et": "- hinnata erinevate EL institutsioonide rolli EL energia- ja kliimapoliitika juhtimisprotsessis"}, {"en": "- will be able to carry out small-scale, basic policy-oriented research, i.e., formulating relevant research questions, finding and using official EU documents and legal texts, document and content analysis ", "et": "- osata teostada väikesemahulist põhipoliitikale suunatud uurimistööd, s.o asjakohaste uurimisküsimuste sõnastamist, EL ametlike dokumentide ja õigustekstide leidmist ja kasutamist, dokumendi- ja sisuanalüüsi"}, {}, {"en": "Key competences: sense-making, cross-cultural competency, trans-disciplinarity, design mindset, cognitive load management", "et": "Võtmepädevused: mõtete kujundamine, kultuuridevaheline pädevus, transdistsiplinaarsus, disaini mõtteviis, kognitiivse koormuse juhtimine"}], "notes": {}}, "grading": {"independent_work": {}, "grade_preconditions": {"et": "In order to be considered for the final assessment, students are expected to attend all but two classes, submit two assignments (memos), participate in a presentation, and submit a final essay (for details see below).\n\nFirst, students are expected to write 2 analytical memos of 500 words for any two meetings (apart from the first-, the last-, and the meeting devoted to presentations. The memo must engage with the 2-3 of the assigned readings, to answer the set of questions as prepared by the lecturer. The memos must be submitted 1 day before the respective sessions at 1pm. The function of the memos is NOT testing of knowledge, but to prepare for the class discussion.\n\nEach assignment will be assessed on a scale up to 15 points. For the two assignments students will be able to earn 30 points. If the submission deadline is missed, evaluation points will be decreased (2 for first, 1 for every next day; illness is not an excuse) \n\nSecond, students will have to participate in one group presentation of 20 min, to answer concrete questions (specified before) and lead a class discussion.\n\nPresentation will be assessed on a scale up to 30 points. Detailed instructions and assessment criteria will be outlined in guidelines in Moodle."}, "grade_evaluation": {"et": "Students will have to write a final essay of 2000 words, on a topic coordinated with the lecturer. The final assignment will be assessed on a scale up to 40 points, detailed instructions and assessment criteria will be outlined in guidelines in Moodle. If the submission deadline is missed, evaluation points will be decreased (1 for every day, illness is not an excuse).\n\nOnce the minimum requirements to be considered for the final assessment are met, the components of the final evaluation will weight in the definition of the final grade according to the following distribution of points:\n- Two assignments: 30 (differentiated)\n- Presentation: 30 (differentiated)\n- Final essay / course paper: 40 (differentiated)\nTotal max: 100 points\nMinimum points required for assessment: 51.\n\nPlagiarism is NOT TOLERATED and can lead to failing the course. More details are available at www.plagiarism.org."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "2a5ddefa-43b1-46ee-b0bd-a097fe8763ad", "type": "MOODLE", "code": "SVJS.00.075", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "9b3fcb6f-862f-fd52-3562-541b3b3ccddd", "person_name": "Edgars Eihmanis", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {"et": "Euroopa õpingute magistritudengid"}}, "parent_uuid": "fca4afbe-b23c-5ceb-259c-47e158ebe696", "parent_code": "SVJS.00.075", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}