{"uuid": "ad6f4f33-0c1b-2c7e-e61c-726f812dab6b", "code": "SVJS.00.087", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-07T16:33:02", "title": {"en": "Public Procurement Process", "et": "Riigihangete korraldamine I"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides a comprehensive and practical set of skills to work in the landscape of Estonian public procurement and to skillfully carry out public procurement. In this course, we approach in detail the practical side of organizing public procurement. Meetings are held both in class and online every week on Thursdays at 16.15. In the course, we will talk about how to plan and organize public procurements so that they are in compliance with the law. Experts in the field of public procurement teach important practical advice. We will answer the questions together, how to plan and organize public procurement so that it does not conflict with laws and good practices? What is the most important thing to keep in mind when planning public procurement? What should be relied on when preparing a public procurement?", "et": "Kursus annab põhjaliku ja praktilise oskuste pagasi töötamaks Eesti riigihangete maastikul ning viima oskuslikult läbi riigihankeid. Antud kursusel läheneme detailselt just riigihangete korraldamise praktilisele poolele. Kohtumised toimuvad nii klassis kui veebi teel igal nädalal neljapäeviti kell 16.15. Kursusel räägime sellest, kuidas planeerida ning korraldada riigihankeid nii, et need oleksid vastavuses seadustega. Olulisi praktilisi nõuandeid õpetavad riigihangete valdkonna eksperdid ning oskuslikud praktikud. Vastame koos küsimustele, kuidas planeerida ja korraldada riigihanget nii, et see ei läheks vastuollu seaduste ja heade tavadega? Mis on riigihanke planeerimise juures kõige olulisem silmas pidada? Millele peaks tuginema riigihanke koostamisel?"}, "objectives": [{"en": "This course provides in-depth and practical knowledge of how to organize public procurement. The topics are covering various aspects of what to keep in mind when conducting a procurement. Emphasis is also placed on the bottlenecks associated with public procurement and the details that every procurer should know and implement in practice.", "et": "Antud kursus annab põhjalikud ja praktilised teadmised sellest, kuidas korraldada riigihankeid ning mida silmas pidada hangete läbiviimisel. Samuti pannakse rõhku riigihangetega kaasnevatele kitsaskohtadele ning detailidele, mida peaks iga hankija teadma ning praktikas ka rakendama."}], "learning_outcomes": [{"en": "Professional knowledge and skills. After successfully passing the course, the student can:\n-\tunderstand the organization of public procurement in Estonia, can define the main bottlenecks and deal with them;\n-\torganize a public procurement independently and prepare accompanying documents;\n-\tfind a suitable supplier for the public procurement;\n-\torient in the field of Estonian public procurement system and knows the e-environment of public procurement;\n-\tcritically assess the conditions of companies applying for public procurement and their suitability;\n-\thas a good overview of planning and organizing procurement materials;\n-\torient in the public procurement register and public documents;\n-\tthoroughly knows the objectives, processes and conditions of organizing public procurement.\nTransferable competencies. Upon successful completion of the course, the student can:\n-\tanalyse previous procurement and typical errors;\n-\tuse the digital tools and e-environments needed for work;\n-\twork in a group and lead it;\n-\tformulate the needs of the organization/company and analyze them;\n-\tdefine specific procurement goals;\n-\treflect and evaluate his/her learning experience and the usability of the practical skills;\n-\twrite and choose specific document and format depending on the need.", "et": "Erialased teadmised ja oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tmõista riigihanke korraldust Eestis;\n-\tkorraldada iseseisvalt riigihanget ning koostada sellega kaasnevaid dokumente;\n-\tleida riigihanke jaoks sobivad tarnijad;\n-\torienteeruda Eesti riigihangete valdkonnas ning tunneb riigihangete e-keskkonda;\n-\tKriitiliselt hinnata riigihankele kandideerivate ettevõtete tingimusi ning nende sobivust;\n-\tomab head ülevaadet hankeasjade planeerimisest ja korraldamisest;\n-\torienteeruda riigihangete registris ja vastavates avalikes dokumentides;\n-\ttunneb põhjalikult riigihangete korraldamise eesmärke, protsesse ja tingimusi;\nÜlekantavad oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tanalüüsida varasemalt tehtud riigihangete kitsaskohti;\n-\tkasutada töös vajaminevaid digivahendeid ja e-keskkondi;\n-\tteha grupis tööd ning vajadusel seda ka juhtida;\n-\tsõnastada organisatsiooni/ettevõtte vajadusi ning neid analüüsida;\n-\treflekteerida ja hinnata oma õpikogemust ning praktiliste oskuste kasutamisvõimet."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}