{"uuid": "a596ea0a-5766-1fe0-17f4-4b32b5db55c8", "code": "sv-2025-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-11T10:24:44", "title": {"en": "Security Challenges in the Asia-Pacific", "et": "Julgeoleku väljakutsed Aasia Vaikse ookeani regioonis"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S regular SV Eng", "et": "25/26 K PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 28, "practice": 0, "seminar": 4, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course will be delivered in two parts. Part one will give an overview of the core concepts in regional security before proceeding to examine the particular trends that shape security in East Asia. This will include an overview of China's geopolitics and perceptions of world order; the evolution of Japan's security policy during and after the Cold War; tension in the Taiwan Straits; and the security situation along the Korean Peninsula. Part two will examine the security challenges in South-East Asia. This will centre around the sometimes turbluent politics of integration within the Association of South-East Asian Nations (ASEAN). Specific issues to be examined will include the security challenges arising from state weakness within certain South-East Asian states such as terrorism, civil war, and military involvement in politics; tensions surrounding proposed ASEAN democratization; ASEAN's integration process compared to other regional organizations; and ASEAN's place within the wider Asia-Pacific security order.", "et": "Ainekursus koosneb kahest osast. Esimene osa annab ülevaate piirkondliku julgeoleku põhilistest mõistetest ning seejärel uurib suundumusi, mis kujundavad julgeolekuolukorra Ida-Aasias. Antakse ülevaate Hiina geopoliitikast ja hiinlaste arusaamast maailmakorrast; Jaapani julgeolekupoliitika arengutest Külma Sõja ajal ja pärast seda; pingetest Taiwani väinas ja julgeolekuolukorrast Korea poolsaarel. Teine osa uurib julgeolekustamise probleeme Kagu-Aasias. Keskpunktiks on ASEAN-i turbluentne integratsioonipoliitika. Uuritakse julgeoleku väljakutseid teatud Kagu-Aasia riikide nõrkuste tulenevalt, nt terrorism, kodusõda ja sõjaline osalus; pinged pakutud ASEAN demokratiseerimise ümber; ASEANi integratsiooniprotsessi võrdlus teiste piirkondlike organisatsioonidega ja ASEANi koht laiemas Aasia-Vaikse ookeani julgeolekukorras."}, "objectives": [{"en": "This course aims to examine the main security challenges framing international relations around the Asia-Pacific basin. This course will be delivered in two parts. Part one will examine the impact of China's rise as an economic and political power on the regional security landscape in East Asia, as well as the evolving direction of Japan's security policy and the security situation along the Korean Peninsula. Part two will assess regional integration and security among the states of the Association of South-East Asian Nations (ASEAN).", "et": "Kursuse eesmärk on analüüsida peamisi julgeoleku väljakutseid Aasia-Vaikse ookeani regiooni rahvusvaheliste suhete kujundamisel. Aine koosneb kahest osast. Selle esimene osa uurib Hiina tõusu mõju majanduslikule ja poliitilisele võimule Ida-Aasia julgeoleku maastikul ning Jaapani julgeolekupoliitika ja Korea poolsaare julgeolekukorra arenemise suunad. Teise osa hindab piirkondliku integratsioonipoliitikat ja julgeolekut ASEAN riikides."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "By the end of this course, students will:\n- compare and contrast the varying security dynamics shaping international relations in the Asia-Pacific;\n- analyse the influence of China as a rising power on East Asia's regional security dynamics as well as the issues that shape China's relations with high-profile neighbours such as Japan, Taiwan and South Korea; \n- analyse the complicated security situation along the Korean Peninsula;\n- distinguish security and integration politics that define a regional organization of rising global importance, ASEAN;\n- thoroughly define the position and potential of ASEAN in the context of the wider Asian, Chinese, E.U. and U.S. positions in international affairs;\n- write critical, argumentative and scholarly discussion and research papers on important Asia-Pacific security topics.", "et": "Aine läbides üliõpilane:\n-\tVõrdleb ja vastandab piirkonna erinevaid rahvusvaheliste suhete kujundamise tegureid\n-\tAnalüüsib Hiina võimutõusu dünaamikat Ida-Aasia piirkonnas ning tegureid, mis kujundavad Hiina teravdatud suhted naabririikidega sh Jaapan, taiwan ja Lõuna-Korea; samuti analüüsib keerulist julgeolekuolukorra Korea poolsaarel;\n-\tEristab julgeoleku ja integratsiooni poliitikad, mis määratlevad globaalse tähtsusega piirkondliku organisatsiooni (ASEAN) kujunemist;\n-\tPõhjalikult defineerib ASEAN-i rahvusvaheliste suhete positsioone ja potentsiaali laiemas Aasia kontekstis, Hiinas, EL-s ja USA-s;\n-\tKirjutab akadeemilist teadustööd kriitiliselt ja argumenteeritult Aasia-Vaikse ookeani regiooni julgeoleku teemadel."}], "notes": {"et": "Recommended course to be passed before attending this course is International Relations.\n\nThis course will be based mostly on lectures. Each lecture and seminar will encourage an active learning environment integrating student questioning, discussions and debates. As assessments, students will be requested to submit one short policy paper and to participate in group work in order to attain the final grade.\n\nAdditional information can be requested from Prof Eiki Berg, eiki.berg@ut.ee."}}, "grading": {"independent_work": {"et": "Students are required to do the following: \n1. Undertake all required readings prescribed for this course;\n2. Participate actively in lectures and seminars, which requires planning and preparation of questions for in-class discussions;\n3. Plan and prepare for written work assessment components;\n4. Complete the two written assessments  assigned for this course: a) an argumentative policy paper (not exceeding 2500 words) on the specific incident affecting the regional dynamics in the longrun, b) a report, reflecting on the knowledge gained in the course to assess the future challenges likely to have an ongoing influence in shaping the Asia-Pacific region. The reflection paper should not exceed 4000 words and must carry full academic reference."}, "independent_work_assessments": [{"work_type": {"code": "case_analysis", "et": "Juhtumi analüüs (kaasus)", "en": "case analysis"}, "description": {"et": "Students must complete an argumentative policy paper (not exceeding 2500 words) on the specific incident affecting the regional dynamics in the longrun. Assessment is differentiated according to the following criteria:\nE - the form is, in general, in compliance with the requirements and correct; references are minimal and insecure; the elements of analysis and independent interpreting are there; the coverage of the subject is, in general, logical, but the connections are full of gaps;\nD - the form is in compliance with the requirements and, in general, correct; references are minimal, but relevant; the analysis and independent interpreting is understandable, but at times insecure; the coverage of the subject is logical and associated;\nC - the form is in compliance with the requirements and correct; references are relevant and sufficient; analytical connections and interpretations are proper and there is certainty in creating connections; the treatment of the subject is logical, but there are some weaknesses from the point of view of the whole;\nB - the form is excellent; the choice, amount and association of references with the text is very good; thorough analysis of connections and references; bold interpretation based on connections; the treatment of the subject as a whole is logical and smooth;\nA - the form is excellent; the choice, amount and association of references with the text is creative; the depth of the analysis and the level of independent interpretation is remarkable; the connections are thorough-going and creative; the treatment of the subject is innovative and logical; the text is a remarkable achievement on the whole."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Students must submit a reflection paper (not exceeding 4000 words) based on the group work and reflecting on the knowledge gained in the course to assess the future challenges likely to have an ongoing influence in shaping the Asia-Pacific region. Assessment is differentiated according to the criteria mentioned above."}}], "grade_preconditions": {"et": "A student is eligible to receive a final grade having submitted the policy paper, reflection paper, and while meeting the participation requirements (involvement to discussions during the class, commitment and participation in the group work)."}, "grade_evaluation": {"et": "Policy paper is worth 60% of the final grade.\nReflection paper based on group work is worth 40% of the final grade.\n\nBoth papers should comply with the guidelines for writing and formatting papers (available at www.skytte.ut.ee) and respect academic ethics. No plagiarism is tolerated."}, "debt_elimination": {"et": "To be agreed individually with the course instructor"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "96447775-39eb-9f46-3e10-0482702a89a3", "person_name": "Eiki Berg", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-39"}, "entries": [{"course_week": 24, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Kick-off seminar: Knowns and unknowns in regional security"}, "description": {}}, {"course_week": 25, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "East Asia: overview of the political landscape"}, "description": {}}, {"course_week": 26, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Chinese visions of world order and geopolitics"}, "description": {}}, {"course_week": 27, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {"et": "China's foreign policy in SE Asia, Central Asia and Africa"}, "description": {}}, {"course_week": 28, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 4, "topic": {"et": "China's approach to regional security: Territorial disputes and borders"}, "description": {}}, {"course_week": 29, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 5, "topic": {"et": "Cross-strait relations between the two \"mutually non-recognised areas\""}, "description": {}}, {"course_week": 30, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 6, "topic": {"et": "Japanese pacifism challenged"}, "description": {}}, {"course_week": 31, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 7, "topic": {"et": "The security situation along the Korean Peninsula"}, "description": {}}, {"course_week": 32, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 8, "topic": {"et": "South-East Asia: overview of the political landscape"}, "description": {}}, {"course_week": 33, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 9, "topic": {"et": "Internal security challenges: military politics, terrorism, and civil war (Karin Dean)"}, "description": {}}, {"course_week": 34, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 10, "topic": {"et": "Human rights and international pressures (Karin Dean)"}, "description": {}}, {"course_week": 35, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 11, "topic": {"et": "Indonesian regional hegemony: the first among the equals (Radityo Dharmaputra)"}, "description": {}}, {"course_week": 36, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 12, "topic": {"et": "Comparing ASEAN with other security organizations (Radityo Dharmaputra)"}, "description": {}}, {"course_week": 37, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 13, "topic": {"et": "ASEAN: between authoritarian and democratic norms? (Radityo Dharmaputra)"}, "description": {}}, {"course_week": 38, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 14, "topic": {"et": "ASEAN and the wider Asia-Pacific security order (Radityo Dharmaputra)"}, "description": {}}, {"course_week": 39, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "Reflection Seminar: will the past reflect the future for security in the Asia-Pacific?"}, "description": {}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "27dc35d6-0f7d-d52f-7de2-2a436844a0de", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "e4d9068c-dc13-916b-0322-e6dcf02e7a28", "parent_code": "SVJS.00.003", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}