{"uuid": "3372a6eb-7ade-eaac-aae7-c7ee95a8b940", "code": "SVJS.00.026", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Nations and Empires in a Globalizing World", "et": "Rahvused ja impeeriumid üleilmastuvas maailmas"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The world has been globalizing for at least a millenium.  However, its internal boundary haven't always received the attention they deserve in narratives and interpretations of globalization.  This course defines nations and empires as contrasting political ideal types (Max Weber), investigates their respective explanatory historical and historiographical roles in world history, tells the story of the 20th century as one of decolonization of empires into nation-states, and explores the uneasy balance of national and imperial dimension in the three most ideologically ambitious imperial nations of the 20th century:  Nazi Germany, Soviet Russia, and the USA", "et": "Maailm on üleilmastumas juba üle tuhande aasta.  Aga keskendudes kaasaegse üleilmastumisele ja unustades maailma juhtivaid poliitilisi vorme, meie pilt üleilmastumisest on puudulik.  See ainekursus defineerib rahvad ja impeeriumid idealtüüpidena (Max Weber), uurib nende seletatavat võimu ajaloos ja ajalookirjutamises, tõlgendab 20. sajandit dekoloniseerimise protsessina (impeeriumid saavad ümberkujundatud rahvus-vabariikideks), aj juhib tähelepanu imperialistliku ja rahvusliku printsiipide lepitamises kolmes 20. sajandi kõige ideoloogilisemas impeeriumis:  Natsi Saksamaa, Nõukogude Venemaa ja Ameerika Ühendriigid"}, "objectives": [{"en": "* To help students understand ongoing geopolitical globalization in terms of its underlying national and imperial dynamics over the course of the world historical longue durée  \n* To distinguish between nations and empires as ideal types of polity and to teach student to understand current globalization in terms national and imperial relationships, based especially on the theories of Benedict Anderson, John Hobson and Frantz Fanon", "et": "* Kasutada rahvad ja impeeriumid üleilmastuva maailma geopoliitilise korra mõistmiseks pikkas ajaloolises perspektiivis\n* Suurendada tudengite teadmisi maailma rahvaste ja impeeriumide ajaloost ja tekkelugudest.   \n* Täiendada õpilaste teoreetilisi teadmisi poliitajaloo mõistmise vallas, lähtudes eriti Benedict Andersoni, J. Hobsoni, ja Frantz Fanoni teooriatest."}], "learning_outcomes": [{"en": "Upon finishing the course the student ", "et": "Aine edukalt läbinu:"}, {"en": "* identifies both the theoretical differences between nations and empires as forms of political organization; ", "et": "* tunneb ja eristab rahvaste ja impeeriumide ajalugu ja tekkelugusid;  "}, {"en": "* speak intelligently about the place of nations and empires over the sweep of globalization as the big story of world history", "et": "* orienteerub  maailma ajaloo ja tänapäeva geopoliitilistes piiriküsimustes ja demonstreerib oma teadmisi kirjalikult ja suuliselt"}, {"en": "* write and think critically about the national and imperial dynamics of world history and contemporary geopolitics", "et": "* polemiseerib üleilmastuva maailma piiriküsimuste üle tuues näiteks rahvaste ja impeeriumide aja- ning arengulood."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}