{"uuid": "a716878d-0c68-6f73-ef6f-15867c6bb870", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-10T18:34:19", "title": {"en": "Introduction to Central and East European, Russian and Eurasian Studies", "et": "Sissejuhatus Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringutesse"}, "credits": 12, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 A regular SV Eng", "et": "25/26 S PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 3, "practice": 0, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 283, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course is designed to elucidate the issues, themes, and scope of the area studies encompassed within the CEERES curriculum, thereby aiding students in crafting a focused dissertation proposal. On the one hand, the course delves into the history, evolution of regions, politics, and pivotal socio-economic changes within the area, critically examining the changing connections and entanglements in the area, their constructed meanings and conceptual underpinnings. It encourages students to challenge the homogenisation of this diverse and complex area, whilst acknowledging the agency of the various nations residing within it. On the other hand, the course acquaints students with the fundamental concepts of the core disciplinary fields integral to area studies.\nThe course is bifurcated into two segments. Initially, students engage independently with e-learning materials that either highlight historical or contemporary developments within the CEERES curriculum's scope. Subsequently, they collaboratively craft a digital presentation that scrutinises and juxtaposes specific developments across different regional contexts. These presentations are then discussed during weekly seminars. In the latter half, students independently explore video lectures that shed light on the principal concepts and theories pertinent to area studies. Drawing on these resources, students formulate research puzzles, which are then deliberated in weekly seminars. The course culminates in an oral examination, wherein students demonstrate their comprehension of the key historical and contemporary dynamics of the regions, applying their analytical skills. The ultimate task is the submission of a research proposal for the MA thesis, aligned with the students' third-semester mobility plans.", "et": "Selle kursuse eesmärk on selgitada õppekavas fookuses olevate piirkonnauuringute probleeme, teemasid ja ulatust, aidates seeläbi üliõpilastel koostada selgelt fokusseeritud lõputöö kavand. Ühelt poolt keskendub kursus selle laialdase geograafilise ruumi ajalukku, regioonide kujunemisse, poliitikatesse ja pöördelistesse sotsiaalmajanduslikesse muutustesse, uurides kriitiliselt regioonide muutuvaid seoseid ja nende omavahelisi läbipõimumisi, nende konstrueeritud tähendusi ja ideoloogilisi põhjendatusi. See lähenemine võimaldab üliõpilastel küsimuse alla seada selle mitmekesise ja keerulise piirkonna homogeniseerimist, tunnustades samal ajal selles elavate erinevate rahvaste subjektsust. Teisalt tutvustab kursus üliõpilastele piirkonnauuringutega seotud uurimisvaldkondade põhimõisteid.\nKursus jaguneb kaheks osaks. Esialgu tegelevad üliõpilased iseseisvalt e-õppematerjalidega, mis tutvustavad ajaloolisi või kaasaegseid arenguid õppekavaga seotud regioonides. Seejärel koostavad nad koostöös digitaalse esitluse, mis analüüsib ja võrdleb spetsiifilisi arenguid erinevates regionaalsetes kontekstides. Neid ettekandeid arutatakse seejärel iganädalastel seminaridel. Kursuse teises pooles vaatavad üliõpilased iseseisvalt videoloenguid, mis tutvustavad piirkonnauuringutega seotud peamisi mõisteid ja teooriaid. Nendest materjalidest lähtudes sõnastavad üliõpilased uurimisprobleemi, mida seejärel arutatakse iganädalastel seminaridel. Kursus kulmineerub suulise eksamiga, kus üliõpilased näitavad oma arusaamist regioonide peamistest ajaloolistest ja tänapäevastest dünaamikatest, rakendades selleks oma analüüsioskusi. Kursuse lõppülesanne on esitada lõputöökavand, mis on kooskõlas üliõpilaste kolmanda semestri mobiilsusega."}, "objectives": [{"en": "The course aims to foster a comprehensive understanding of the key historical and contemporary developments within the CEERES curriculum area and introduce various Social Sciences disciplines that facilitate scrutinising these developments. In doing so, students are equipped with the tools necessary to formulate a research proposal for their dissertation.", "et": "Kursuse eesmärkideks on luua üldine arusaam peamistest ajaloolistest ja tänapäevastest arengutest geograafilises ruumis, millega Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringute õppekava tegeleb ning tutvustada erinevaid sotsiaalteaduslikke distsipliine nende uurimiseks, et iseseisvalt välja töötada oma lõputöö uurimisplaan."}, {"en": "To achieve this overarching goal, the course cultivates several essential skills required for graduation from the CEERES curriculum. Among these, the most critical skills include:", "et": "Selle üldise eesmärgi saavutamiseks arendatakse kursusel erinevaid oskusi, mis on vajalikud õppekava läbimiseks. Nendest olulisemad on: "}, {"en": "- comparative analysis to compare and contrast various regions within the CEERES curriculum;", "et": "- võrdlev analüüsi oskus, et kõrvutada ja võrrelda erinevaid regioone, mis on õppekava uurimisfookuses;"}, {"en": "- synthesis to interpret and reflect upon the historical and contemporary social developments in the CEERES curriculum area;", "et": "- sünteesimisoskus, et lahti mõtestada õppekava uurimisfookuses olevates regioonides toimunud ja toimuvaid ühiskondlikke arenguid;"}, {"en": "- defining a research puzzle to develop a research proposal independently;", "et": "- oskus sõnastada uurimisprobleem, et selle baasilt iseseisvalt välja töötada uurimiskava;"}, {"en": "- peer learning and constructive feedback to foster independent learning;", "et": "- vastastikuse õppimise ja konstruktiivse tagasisidestamise oskus, et toetada iseseisvat õppimist;"}, {"en": "- creating academically rigorous digital collaborative projects to enhance peer-learning skills;", "et": "- oskus luua akadeemiliselt pädevat digitaalset ühisloomet, et seeläbi tugevdada vastastikuse õppimise oskust;"}, {"en": "- developing cooperation skills within the study group to build and strengthen the identity of the study cohort.", "et": "- õppegrupi meeskonnatööoskused, et seeläbi luua ja tugevdada nende õppegrupi ühine identiteet."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students should be able to:", "et": "Kursuse lõpetamisel tudeng"}, {"en": "- Critically analyse the history, including the development of various regions, the politics, and the socio-economic landscapes within the CEERES curriculum area;", "et": "- analüüsib kriitiliselt õppekava regioonide ajalugu, sealhulgas erinevate piirkondade kujunemisi, poliitikaid ja sotsiaalmajanduslikke arenguid;"}, {"en": "- Make coherent connections between historical processes and contemporary socio-political developments, including the international relations of the CEERE area;", "et": "- loob mõistetavaid seoseid ajalooliste protsesside ja kaasaegsete sotsio-poliitiliste arengute vahel, sh rahvusvahelistes suhetes regioonides, mis on õppekava uurimisfookuses;"}, {"en": "- Understand and discuss key concepts from Political Science, International Relations, Sociology, Anthropology, and Cultural Studies that are relevant to area studies;", "et": "- mõistab ja arendab diskussiooni põhiterminitega, mis on seotud politoloogia, rahvusvaheliste suhete, sotsioloogia, antropoloogia ja kulturoloogiaga;"}, {"en": "- Apply these concepts to develop a coherent comparative analysis of the regions within the CEERES curriculum area;", "et": "- rakendab neid põhitermineid terviklikus analüüsis seoses õppeaine fookuses olevate regioonidega;"}, {"en": "- Develop an independent research proposal related to one of the core disciplinary fields of the curriculum, with a specific focus on at least one of the geographical constituents of the area.", "et": "- arendab iseseisva uurimiskava, mis tugineb vähemalt ühele õppekava alusdistsipliinile ja on seotud ühe õppekava fookuses oleva regiooniga."}], "notes": {}}, "grading": {"independent_work": {"et": "See the more detailed guidelines in the course webpage in the UT Moodle. \nGROUP WORKS: Preparation for the final exam. During weeks 2-7, students have to prepare <i>voiced PowerPoint presentation</i> that synthesizes the data from the video lectures. \nEXERCISE <i>Research puzzle and research question</i>: students have to prepare the starting point of the research proposal by defining the central key concept(s), research puzzle and research question(s). During the semester, students have to prepare 2 exercises, which are later discussed in online seminar. The recommended length of the exercise is 300-350 words. \nRESEARCH PROPOSAL:  <i>Extended research proposal</i> of 1,500-2,000 words + preliminary list of bibliographic references. The individual research proposal is expected to include the following elements: \nStudy Focus\nResearch Problem\nResearch Aim and Tasks\nResearch Questions/Hypotheses\nResearch Methodology\nLimitation of the Study\nStructure of the Dissertation\nWorking Schedule\nPreliminary List of Sources"}, "independent_work_assessments": [{"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "The research proposal is assessed based on the following criteria:\n- Clarity of study focus\n- Relevance of the research puzzle/problem\n- Clarity of study aim\n- Coherence of the study aim and research questions\n- Accuracy of research questions/hypothesis\n- Feasibility of research methodology\n- Reflectiveness of research limitation\n- Clarity of dissertation structure\n- Feasibility of working schedule\n- Relevance of the sources"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "The exercise: Research puzzle and research question is based on the following criteria:\n- Clarity and argumentation of the research puzzle\n- Coherence of the research question(s) with the research puzzle\n- Functionality and suitability of the research question(s)\n- Relevance of the selected key concepts in the context of the research puzzle\n- Overall suitability the selected topic for a MA research"}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "The oral examination is assessed based on the following criteria:\n- Description of main trends & developments\n- Analytical breadth\n- Comparative analytical skills\n- Application of relevant concepts\n- Suitability of illustrating examples\n- Clarity and structure of the presentation"}}], "grade_preconditions": {}, "grade_evaluation": {"et": "The final grade consists of\n1. Oral final exam (50% of the final grade)\n2. Exercise: Research puzzle and research question (20% of the final grade)\n3. Research proposals (30% of the final grade)\n\nTo pass the course, the student has to obtain at least <b> 26 points for the final exam </b> and <b>16 points for the research proposal</b>."}, "debt_elimination": {"et": "During January, one exam resit is possible in the case of a failing result. The research proposal can be amended once if the course instructors require it.\nIn the <b>case of plagiarism</b>, the student is not allowed to have any resubmission during the current semester and has to return to Tartu to <b>repeat the 1st semester in the next academic year</b>."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "2cb62b6a-eed9-82c4-021d-f2411c405e2c", "person_name": "Heiko Pääbo", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"Group 2": {"code": "1", "et": "Lektor", "en": "lecturer"}, "Group 1": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "37115d23-f361-0ece-9153-2a4a4d4055d4", "code": "Group 2", "max_size": 20}, {"uuid": "f8515d9b-76c0-b2c9-2b8a-27b88b55c550", "code": "Group 1", "max_size": 20}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"time": "2024-09-03", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "The introductory meeting is of utmost importance as it allows the course instructor to introduce the particular learning philosophy of the course, explain how to conduct the course assignments, and establish the first stage of the group process. Having a good start in the group process is essential for the team to function effectively."}}, {"time": "2024-09-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar covers an extensive time period, from the establishment of the first states until the late 18th century, in regions such as the Baltic, Central Europe, Balkans, Eastern Europe, Russia, South Caucasus, and Central Asia. The seminar reflects group works. \nThe first group compares statehood developments across these regions during this extensive period. The second group examines the geopolitical developments during this time period to understand how borders have changed and the consequences of these changes."}}, {"time": "2024-09-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar focuses on the 19th century and the rapid changes that took place in regions such as the Baltic, Central Europe, Balkans, Eastern Europe, Russia, South Caucasus, and Central Asia. The seminar reflects on the group works.\nThe first group analyzes the conditions that contributed to the emergence of modern nationhood in these regions, and compares the political systems that emerged during the interwar period. The second group analyzes the socio-economic developments that led to the collapse of the continental empires in the region."}}, {"time": "2024-09-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar deals with a period when the developments in the Baltic region, Central Europe, Balkans, Eastern Europe, Russia, South Caucasus, and Central Asia merged into the same pathway - the Soviet and Socialist systems. The seminar reflects on the group works. The first group compares the experiences of various nations during World War II, while the second group examines the evolution of the Soviet and Socialist regimes from the post-World War II period until their collapse."}}, {"time": "2024-10-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": " The seminar deals with turbulent period in the Baltic regions, Central Europe, Balkans, Eastern Europe, Russia, South Caucasus, and Central Asia. The collapse of the Soviet and Socialist regimes led to the triple transition: political, economic and social. Some nations succeed with their democratic transition, whereas the others failed and fell back to the autocracy. The seminar reflects on the group works. The first group compares the reasons and process of the collapse of the regime, whereas the the second group examines the establishment of new political regimes, evaluating the reasons of their success or failure to establish democracy. "}}, {"time": "2024-10-11", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar deals with contemporary politics in the Baltic region, Central Europe, Balkans, Eastern Europe, Russia, South Caucasus, and Central Asia. It reflects on the group works. The first group compares the political regimes in those regions, also analysing the political cleavages that define their party landscapes. The second group analyses the foreign policies of those countries and explores their security concerns."}}, {"time": "2024-10-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar covers a range of social issues prevalent in the Baltic region, Central Europe, Balkans, Eastern Europe, Russia, South Caucasus, and Central Asia, analysed through a comparative perspective. These issues encompass ethnic relations, religion, corruption, gender issues, demographics, and other relevant topics. Both groups are assigned the same issue to work on. The seminar includes a reflection on the group works."}}, {"time": "2024-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar discusses students' research puzzle assignments. The seminar is conducted and the puzzles are assessed by Leyla Sayfutdinova (UG)"}}, {"time": "2024-11-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar discusses students' research puzzle assignments. The seminar is conducted and the puzzles are assessed by by  Melina Sadikovi (UNSA)"}}, {"time": "2024-11-22", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar discusses students' research puzzle assignments. The seminar is conducted and the puzzles are assessed by Nygmet Ibadildin (KIMEP)"}}, {"time": "2024-11-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar discusses students' research puzzle assignments. Seminar is conducted and the puzzles assessed by Grzegorz Poarlik (JU)"}}, {"time": "2024-12-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "The seminar discusses students' research puzzle assignments. Seminar is conducted and the puzzles are assessed by Anna Osypchuk (NaUKMA)"}}, {"time": "2024-12-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "General meeting 10-13 (306)\nDuring the entire week, individual consultations are also available by students' own request."}}, {"work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic": {}, "description": {"et": "December 16-18 (sign up for the exam in SIS)"}}]}, "registration_info": {"audience": {"et": "Only CEERES students"}, "min_students": 10, "max_students": 40}, "parent_uuid": "544cbbdf-f64a-f781-4de9-86597c3c44dc", "parent_code": "SVJS.00.006", "parent_credits": 12, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}