{"uuid": "abe6353d-9e8d-9a27-e46a-87081dfbccdb", "code": "SVJS.00.038", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Statistical Analysis", "et": "Statistilise analüüsi alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is focussed on tha basics of statistical analysis and the statistical software R. It covers the basic concepts of statistical analysis, especially from the perspective of political science and the implementation of basic models in R. \nKursuse tuumiku moodustavad arvutiklassis toimuvad praktikumid, milles koos kursuses osalejatega töötatakse läbi praktikumideks ette valmistatud materjalid. Praktikume täiendavad keskelt läbi iga kolme nädala tagant toimuvad (võimalusel online) loengud, milles tutvustatakse käsitletavate meetodite üldisemaid põhimõtteid.", "et": "Kursus keskendub statistilise analüüsi algteadmiste tutvustamisele ning statistilise tarkvara R kasutamise baasokuste loomisele. Kursus on praktilise suunitlusega ning enamus käsitletud teemasid on orienteeritud konkreetsete statistilise analüüsiga seotud ülesannete ja toiminugte teostamisele R-is. Kursus algab statistilise analüüsi põhimõistete ning andmetüüpide ja struktuuride tutvustamisest. Põhirõhk on just sotsiaalteadustes ja eriti politoloogias põhiliselt kasutusel olevatel analüüsitüüpidel. Tutvume hüpoteeside statistilise testimise põhiloogikaga. Seejärel tutvustatakse R-i, kuna tegemist on kaasaja andmeanalüüsis kõige enam kasutatava ja tööturul hinnatud analüüsitarkvaraga. Kursuse põhiosas vaatame, kuidas R-i on võimalik kasutada, et hinnata seoseid erinevatel skaaladel mõõdetud muutujate vahel ning kuidas on võimalik R-is teostada põhilist regressioonianalüüsi. Käsitleme ka andmete visuaalse kuvamise põhilisi tehnikaid R-is."}, "objectives": [{"en": "The objectives of the course are:", "et": "Kursuse eesmärkideks on:"}, {"en": "- introducing the basic principles of statistical analysis in the social sciences;", "et": "- sotsiaalteadustes rakendatava statistilise analüüsi aluspõhimõtete tutvustamine;"}, {"en": "- introducing the basic methods of statistical analysis in the social sciences;", "et": "- põhiliste statistilise analüüsi meetodite tutvustamine;"}, {"en": "- teaching the basics of using R for statistical analysis;", "et": "- statistilise tarkvara R kasutamise aluste õpetamine;"}, {"en": "- implementing the basic methods for the analysis of a specific research task.", "et": "- õpitud meetodite rakendamine konkreetse uurimisülesande lahendamiseks."}], "learning_outcomes": [{"en": "Upon successful completion of the course, the students have acquired the basic knowledge to do and to understand statistical analyses in the social sciences and are able to implement such analyses using R. They are familiar with the basic concepts and models in statistics, are able to evaluate and prepare data for analyses and choose statistical models accordingly. They are also able to interpret and present the results of their analyses and visualise their data.", "et": "Kursuse edukalt läbinud üliõpilane omab baasteadmisi statistilise analüüsi teostamiseks ja mõistmiseks sotsiaalteadustes ning oskab seda teha kasutades statistilise analüüsi tarkvara R. Ta on tuttav statistilise analüüsi põhimõistete ja mudelitega, oskab analüüsiks vajalikke andmeid hinnata, ette valmistada ja valida vastavalt andmetele sobiv mudel. Ta on võimeline oma analüüsi tulemusi tõlgendama ja esitama ning oma andmetest esmaseid jooniseid looma."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}