{"uuid": "51dc1b5e-b9a9-14da-682c-a3154c0f9108", "code": "SVJS.00.046", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "The Politics of Self-determination, Secession, and State Creation", "et": "Enesemääramise poliitika, setsessioon ja riigiloome"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is taught in lecture and seminar forms. For lectures, students are required to do the assigned required readings before coming to class. Seminars are focused on students' ability to comprehend the required reading materials, discuss, and evaluate a number of questions that are posed prior to each seminar. Whereas group presentations and final written essay are designed for students to develop and show their ability to engage in group work and analyse, develop, and create novel arguments, respectively.", "et": "Kursust õpetatakse loengu- ja seminarivormis. Loengute jaoks on üliõpilased kohustatud enne tundi tulekut sooritama määratud kohustuslikud lugemised. Seminarid keskenduvad õpilaste võimele mõista vajalikku lugemismaterjali, arutada ja hinnata mitmeid küsimusi, mis enne iga seminari esitatakse. Rühmaesitlused ja lõplik kirjalik essee on mõeldud selleks, et õpilased saaksid arendada ja näidata oma võimet rühmatöös osaleda ning vastavalt analüüsida, arendada ja luua uudseid argumente."}, "objectives": [{"en": "The course aims to introduce students to concepts and theories of self-determination and secession. It, furthermore, attempts to relate these concepts, by use of empirical record, to the process of state creation in different historical periods, with a particular focus on the contemporary one. Lastly, the course aims to disentangle the theories and practices of state recognition in world politics.", "et": "Kursuse eesmärk on tutvustada õpilastele enesemääramise ja eraldumise mõisteid ja teooriaid. Lisaks proovib see empiirilisi andmeid kasutades seostada neid mõisteid riigi loomise protsessiga erinevatel ajalooperioodidel, keskendudes eelkõige tänapäevale. Lõpetuseks on kursuse eesmärk lahti harutada riigi tunnustamise teooriad ja praktikad maailmapoliitikas."}], "learning_outcomes": [{"en": "By the end of the course students will be able to: ", "et": "Kursuse lõpuks oskavad õpilased:"}, {"en": "Demonstrate a solid understanding of the creation and expansion of the international society of states; ", "et": "Demonstreerida kindlat arusaamist riikide rahvusvahelise ühiskonna loomisest ja laienemisest;"}, {"en": "Critically analyze notions of self-determination and secession in light of the (non)creation of states in the international system; ", "et": "Kriitiliselt analüüsida enesemääramise ja eraldumise mõisteid riikide (mitte)loomise valguses rahvusvahelises süsteemis;"}, {"en": "Interpret the multiple intricacies of state and government (non)recognition in world politics; ", "et": "Tõlgendada riigi ja valitsuse (mitte)tunnustamise keerukust maailmapoliitikas;"}, {"en": "Interpret the historical and contemporary secessionist and self-determination movements; ", "et": "Tõlgendada ajaloolist ja kaasaegset separatistlikku ja enesemääramisliikumist;"}, {"en": "Analyze the aims, goals, and strategies that different groups of people attempt, and have attempted, to use in promoting their self-determination claims and establishing their states;", "et": "Analüüsida eesmärke ja strateegiaid, mida erinevad inimrühmad püüavad ja on püüdnud kasutada oma enesemääramisnõuete edendamisel ja oma seisundite kehtestamisel;"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}