{"uuid": "395b8ad7-ed34-3101-ed68-83537eb72a84", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-25T10:28:30", "title": {"en": "EU Economic Governance", "et": "ELi majanduslik valitsemine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 24, "practice": 4, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 128, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Course description. Since the launch of the euro in the late-1990s, the EU's Economic and Monetary Union (EMU) has represented a stark symmetry between the fully integrated \"monetary\" arm and only partially integrated \"economic\" arm. The incomplete nature of the EMU was fully exposed by the sovereign debt crisis of 2010, entailing enforced macro-economic, fiscal (but also social) governance frameworks, new financial assistance funds, as well as significant advances in coordinating financial and capital markets. However, the Covid-19 crisis and the EU's responses to it - effectively endowing the European Commission with fiscal and debt-raising powers - have marked a major leap forward in EU economic governance, effectively closing the long-standing asymmetry between monetary and fiscal realms. \n\nThis MA course has two basic objectives. First, to provide an overview of the development of the EU's fiscal policy, monetary policy, and financial and capital market regulation before and after the Sovereign Debt Crisis. Second, to provide a topical perspective on the ongoing changes in EU economic governance in the current polycrisis, as related to COVID-19, climate change and Russia's war in Ukraine. The course will provide a broad overview of these policy developments and explain how they are shaped by national and supranational actors and institutions. The course will be of high relevance to MA students of political science, economics and law.", "et": "Alates euro kasutuselevõtust 1990. aastate lõpus on ELi majandus- ja rahaliit (EMU) kujutanud endast teravat sümmeetriat täielikult integreeritud \"raha\" ja ainult osaliselt integreeritud \"majanduse\" haru vahel. Majandus- ja rahaliidu ebatäielikkust paljastas täielikult 2010. aasta riigivõlakriis, mis tõi kaasa makromajandusliku, fiskaal- (aga ka sotsiaalse) juhtimisraamistiku, uued finantsabi fondid ning märkimisväärsed edusammud finants- ja kapitaliturgude koordineerimisel. Siiski on Covid-19 kriis ja ELi reageeringud sellele - andes Euroopa Komisjonile tõhusad volitused fiskaal- ja võlgade tõstmiseks - tähistanud suurt edasiminekut ELi majanduse juhtimises, kaotades tõhusalt pikaajalise asümmeetria raha- ja eelarvevaldkonna vahel. Sellegipoolest on praegusel hetkel raske ennustada, kas ja mil määral COVID-i järgsed kokkulepped kestavad.\n\n \n\nVaadeldes kõige olulisemaid arenguid ELi majanduse juhtimises ja poliitikas alates Maastrichti lepingust (1992) kuni Covid-19 kriisini (2020), näitab see MA kursus, kuidas ELi poliitika on visiooniliste ideede ja jõu tulemus. -ühelt poolt mäng ning teiselt poolt funktsionaalsed vajadused ja globaalsed arengud. Andes põhjaliku pildi sellest, kuidas erinevad ELi majanduspoliitikad on viimase kolme aastakümne jooksul muutunud - ja mida on juhtinud - erinevad riiklikud ja riigiülesed osalejad ja institutsioonid, pakub kursus huvi mitte ainult ELi poliitika ja rahvusvaheliste suhete eriala üliõpilastele vaid ka tulevastele poliitikakujundajatele. Lisaks on kursus kasulik abijuhend kvalitatiivse (politoloogia) metoodika rakendamisel EL-i poliitika ja integratsiooni uurimisel."}, "objectives": [{"en": "This course is designed to provide EU politics and IR students, but also policy makers to-be with expertise on EU economic governance and politics behind it. By specifically focusing on governance of fiscal, economic and social policy in a historical perspective, the course aims at profound understanding of the ever-changing policy agenda and modes of governance of the EU. It shows how the politics, policies and polity of the EU are the result of visionary ideas and power-play on the one hand, and functional necessities and global developments on the other hand. In addition, it provides basic understanding of social science research methods, focusing on those elements that are most relevant for policy practice.", "et": "Selle kursuse eesmärk on anda ELi poliitika ja rahvusvaheliste suhete üliõpilastele, aga ka tulevastele poliitikakujundajatele teadmisi ELi majandusjuhtimise ja selle taga oleva poliitika kohta. Konkreetselt keskendudes eelarve-, majandus- ja sotsiaalpoliitika juhtimisele ajaloolises perspektiivis, on kursuse eesmärk saada põhjalik mõistmine pidevalt muutuvatest poliitilistest tegevuskavadest ja ELi valitsemisviisidest. See näitab, kuidas ELi poliitika on ühelt poolt visiooniliste ideede ja võimumängu ning teiselt poolt funktsionaalsete vajaduste ja globaalsete arengute tulemus. Lisaks annab see põhiteadmised sotsiaalteaduste uurimismeetoditest, keskendudes elementidele, mis on poliitikapraktika jaoks kõige olulisemad."}], "learning_outcomes": [{"en": "Upon completing the course a student will: ", "et": "Kursuse läbimisel saab õpilane:"}, {"en": "- demonstrate knowledge and critically assess the current developments in EU monetary, fiscal, economic and social policy areas  ", "et": "- näidata teadmisi ja kriitiliselt hinnata praegusi arenguid ELi raha-, fiskaal-, majandus- ja sotsiaalpoliitika valdkondades"}, {"en": "- assess the evolution of EU socio-economic governance in a historical context ", "et": "- hinnata ELi sotsiaal-majandusliku juhtimise arengut ajaloolises kontekstis"}, {"en": "- understand EU governance modes in EU economic policy  ", "et": "- mõista ELi majanduspoliitika juhtimisviise"}, {"en": " - assess the role of various EU institutions in functioning of the EU socio-economic governance process ", "et": " - hinnata erinevate EL institutsioonide rolli EL sotsiaal-majandusliku juhtimisprotsessi toimimises"}, {"en": "- apply knowledge in basic qualitative research methods & research design in the social sciences, ", "et": "- rakendada teadmisi põhiliste kvalitatiivsete uurimismeetodite ja uurimistöö kavandamise kohta sotsiaalteadustes,"}, {"en": "- be able to carry out small-scale, basic policy-oriented research, i.e., formulating relevant research questions, finding and using official EU documents and legal texts, document and content analysis ", "et": "- teostada väikesemahulist aluspoliitikale suunatud uurimistööd, s.o asjakohaste uurimisküsimuste sõnastamist, EL ametlike dokumentide ja õigustekstide leidmist ja kasutamist, dokumendi- ja sisuanalüüsi"}, {}, {"en": "Key competences: sense-making, cross-cultural competency, trans-disciplinarity, design mindset, cognitive load management", "et": "Võtmepädevused: mõtete kujundamine, kultuuridevaheline pädevus, transdistsiplinaarsus, disaini mõtteviis, kognitiivse koormuse juhtimine"}], "notes": {"et": "Out of 14 sessions, 12 sessions consist of a lecture followed by a discussion. 2 sessions are fully devoted to student presentations.\n\nAll reading materials will be provided in the Moodle."}}, "grading": {"independent_work": {"et": "In order to be considered for the final assessment, students are expected to attend all but two classes, submit two assignments (memos), participate in a presentation, and submit a final essay (for details see below)."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "First, students are expected to write 3 analytical memos of 500 words for any three meetings (apart from the first-, the last-, and the meeting devoted to presentations. The memo must engage with 3 of the assigned readings, to answer the set of questions as prepared by the lecturer. The memos must be submitted 1 day before the respective sessions. The function of the memos is NOT testing of knowledge, but to prepare for the class discussion. The assessment criteria will mainly focus on whether and how the students have answered the set of questions. Each assignment will be assessed on a scale up to 10 points (from 5 points = \"sufficient\", to 10 points = \"excellent\"). For the three assignments students will be able to earn 30 points. If the submission deadline is missed, evaluation points will be decreased (2 for first, 1 for every next day; illness is not an excuse"}}, {"work_type": {"code": "presentation", "et": "Ettekanne", "en": "presentation"}, "description": {"et": "Second, students will have to participate in one group presentation of 15 min, to answer concrete questions (specified before). Presentation will be assessed on a scale up to 30 points (from 15 points = \"sufficient\", to 30 points = \"excellent\")"}}, {"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Students will have to write a final essay of 2000-3000 words, on a topic coordinated with the lecturer. The final assignment will be assessed from 20 points = \"sufficient\", to 40 points = \"excellent\"). If the submission deadline is missed, evaluation points will be decreased (1 for every day, illness is not an excuse)."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "First, students are expected to write 2 analytical memos of 500 words for any two meetings (apart from the first-, the last-, and the meeting devoted to presentations. The memo must engage with the 2-3 of the assigned readings, to answer the set of questions as prepared by the lecturer. The memos must be submitted 1 day before the respective sessions at 1pm. The function of the memos is NOT testing of knowledge, but to prepare for the class discussion.\n\nEach assignment will be assessed on a scale up to 15 points. For the two assignments students will be able to earn 30 points. If the submission deadline is missed, evaluation points will be decreased (2 for first, 1 for every next day; illness is not an excuse)\n\nSecond, students will have to participate in one group presentation of 20 min, to answer concrete questions (specified before) and lead a class discussion.\n\nPresentation will be assessed on a scale up to 30 points. Detailed instructions and assessment criteria will be outlined in guidelines in Moodle."}, "grade_evaluation": {"et": "Students will have to write a final essay of 2000 words, on a topic coordinated with the lecturer. The final assignment will be assessed on a scale up to 40 points, detailed instructions and assessment criteria will be outlined in guidelines in Moodle. If the submission deadline is missed, evaluation points will be decreased (1 for every day, illness is not an excuse).\n\nOnce the minimum requirements to be considered for the final assessment are met, the components of the final evaluation will weight in the definition of the final grade according to the following distribution of points:\n- Two assignments: 30 (differentiated)\n- Presentation: 30 (differentiated)\n- Final essay / course paper: 40 (differentiated)\nTotal max: 100 points\nMinimum points required for assessment: 51.\n\nPagiarism is NOT TOLERATED and can lead to failing the course. More details are available at www.plagiarism.org."}, "debt_elimination": {"et": "In agreement with course instructor"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "d7d17df1-6192-4173-bade-ebf26b068ea7", "type": "MOODLE", "code": "SVJS.00.047_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "All uploaded as pdf files and web links in the Moodle", "recommended_materials": "Selected readings:\n\nBan, C. (2020) 'The Economic and Monetary Union: How Did the Euro Area Get a Lender of Last Resort?', in A. Crespy, R. Coman, and V. A. Schmidt (eds). Governance and Politics in the Post-Crisis European Union. Cambridge: Cambridge University Press, pp. 179-195, doi:10.1017/9781108612609.012.\n\nHowarth, D. and Quaglia, L. (2021) 'Failing forward in Economic and Monetary Union: explaining weak Eurozone financial support mechanisms', Journal of European Public Policy 28(10): 1555-1572.\n\nKamps, C. and Leiner-Killinger, N. (2019) 'Taking Stock of the EU Fiscal Rules over the Past 20 Years and Options for Reform', Jahrbücher für Nationalökonomie und Statistik 239(5-6): 861-894.\n\nKreienkamp, J., Pegram, T. and Coen, D. (2022) 'Explaining transformative change in EU climate policy: multilevel problems, policies, and politics', Journal of European Integration 44(5): 731-748.\n\nQuaglia, L. (2019) 'The politics of an \"incomplete\" Banking Union and its \"asymmetric\" effects', Journal of European Integration 41(8): 955-969.\n\nSandbu, M. (2017) Europe's Orphan: The Future of the Euro and the Politics of Debt - New Edition, Revised edition., Princeton: Princeton University Press.\n\nSchelkle, W. (2021) 'Fiscal Integration in an Experimental Union: How Path-Breaking Was the EU's Response to the COVID-19 Pandemic?', JCMS: Journal of Common Market Studies 59(S1): 44-55.\n\nSchlosser, P. (2019) 'Enhancing EMU's Fiscal Arm: Towards Stronger Regulatory\n\nSurveillance', in P. Schlosser (ed.). Europe's New Fiscal Union. Cham: Springer International Publishing, pp. 45-72, doi:10.1007/978-3-319-98636-4_3.\n\nSchmidt, V. A. (2021) 'European emergency politics and the question of legitimacy', Journal of European Public Policy 0(0): 1-15.\n\nSchmitz, L. and Seidl, T. (n.d.) 'As Open as Possible, as Autonomous as Necessary: Understanding the Rise of Open Strategic Autonomy in EU Trade Policy', JCMS: Journal of Common Market Studies n/a(n/a), doi:10.1111/jcms.13428.\n\nTooze, A. (2018) Crashed: How a Decade of Financial Crises Changed the World, Penguin Publishing Group.\n\nvon Homeyer, I., Oberthür, S. and Jordan, A. J. (2021) 'EU climate and energy governance in times of crisis: towards a new agenda', Journal of European Public Policy 28(7): 959-979."}, "participants": {"lecturers": [{"person_uuid": "9b3fcb6f-862f-fd52-3562-541b3b3ccddd", "person_name": "Edgars Eihmanis", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "251fb7e4-c0f0-85ed-d6ab-4845e3894594", "person_name": "Simon Sebastian Manfred Kiecker", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "1. Introduction\n2. Conceptualizing EU governance"}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "3. The EU single market and EU as a regulatory state \n4. Economic and Monetary Union and the Euro-crisis"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "5. Fiscal policy \n6. Monetary policy "}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "7. EU energy policy \n8. EU energy crisis"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "9. The European Semester and coordination of socio-economic policies \n10. EU Recovery Fund and the governance of national plans"}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "11. Toward the Banking and Capital Markets Union\n12. Mobilising finance for green recovery"}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "13-14. Conclusions"}}]}, "registration_info": {"audience": {"et": "Mainly students from European Studies programme (Euroopa õpingud), but is open to Master’s students of other programmes"}, "max_students": 30}, "parent_uuid": "f5ddaca1-2e0e-4cda-ad1f-5068c82175af", "parent_code": "SVJS.00.047", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}