{"uuid": "6192145c-8fba-6818-2f88-6739971469af", "code": "SVJS.00.032", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Administration of Democracy and Elections", "et": "Demokraatia ja valimiste korraldus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will cover the legal and international challenges democratic instruments face domestically and internationally, discuss case studies from Estonia and abroad, and analyse scholarly research on these topics.", "et": "Kursus hõlmab õiguslikke ja rahvusvahelisi väljakutseid, millega demokraatlikud instrumendid silmitsi seisavad nii riigisiseselt kui ka rahvusvaheliselt, arutatakse juhtumiuuringuid Eestist ja välismaalt ning analüüsitakse nende teemadega seotud teadusuuringuid."}, "objectives": [{"en": "This course will give an insight into the organization and administration of elections and other democratic instruments such as petitions. The objective will be to understand the complexities of organizing these key events in a democracy, including their observation. The course is focusing also on its electronic derivates, such as the organization of electronic voting, participation, and participatory budgeting, amongst others.", "et": "Kursus annab ülevaate valimiste korraldamisest ja haldamisest ning muudest demokraatlikest vahenditest, näiteks petitsioonidest. Eesmärk on mõista nende võtmesündmuste korraldamise keerukust demokraatlikus riigis, sealhulgas nende vaatlemist. Kursus keskendub muu hulgas ka elektroonilistele tuletistele, nagu elektroonilise hääletamise korraldamine, osalemine ja osaluseelarve koostamine."}], "learning_outcomes": [{"en": "The students completing the course will (1) understand and have an overview of the key components and complexities that are involved in organizing elections, (2) be able to analyze the use of a democratic instrument in a given context using international standards, (3) be able to derive (technical) requirements for the implementation of democratic instruments using electronic means, and (4) have a reflective understanding of their own role in such processes whether as participant, candidate, organizer or observer.", "et": "Kursuse läbinud üliõpilased (1) mõistavad valimiste korraldamisel osalevaid põhikomponente ja nende ülevaadet ning omavad ülevaadet, (2) oskavad analüüsida demokraatlike vahendite kasutamist antud kontekstis rahvusvaheliste standardite abil, (3) ) olema võimelised tuletama (tehnilisi) nõudeid demokraatlike vahendite rakendamiseks elektrooniliste vahendite abil ja (4) olema reflektiivne arusaam oma rollist sellistes protsessides kas osaleja, kandidaadi, korraldaja või vaatlejana."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}