{"uuid": "b5ccdfbc-aaf1-49c5-eb10-d5ef145ce7e8", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-27T12:36:46", "title": {"en": "Political participation", "et": "Poliitiline osalus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 26, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Political participation explores how people think, perceive, and behave in the political process and in relation to politics. The course covers the main areas of study of political participation and behavior such as public opinion, political awareness, strategies, forms and ways of participation of various actors (from the citizen to the political elite), the influence of culture and media on political behavior, the influence of elites on the masses and vice versa.  \nThe course introduces various forms of political participation, political behavior, and experience of politics (what motivates me to be a member of a political party, who and how represents my interests in politics, what strategies to use in organizational power relations, how expert status helps in post-truth public opinion-making, how to influence the political elite, etc.) based on the empirical study of practical experiences, considerations, and choices of actors and institutioins of political participation.\nThe course develops empirical data analysis skills with which to study the political participation and behavior of various actors, elites, and masses.", "et": "Poliitiline osalus uurib, kuidas inimesed mõtlevad, tajuvad ja käituvad poliitilises protsessis ja poliitika suhtes. Kursus käsitleb peamisi poliitilise osaluse ja käitumise uurimisvaldkondi nagu avalik arvamus, poliitiline teadlikkus, erinevate toimijate (alates kodanikust kuni poliitilise eliidini) osaluse strateegiad, vormid ja viisid, kultuuri ja meedia mõju poliitilisele käitumisele, eliidi mõju massile ja vastupidi.  \nKursus juhatab laiahaardeliselt sisse poliitikas osalemise, poliitilise käitumise ja poliitika kogemise erinevatesse vormidesse (mis motiveerib olema erakonna liige, kes ja kuidas esindab minu huve poliitikas, milliseid strateegiaid kasutada organisatsioonilistes võimusuhetes, kuidas aitab ekspert-staatus tõejärgses avalikus arvamuskujunduses, kuidas mõjutada poliitilist eliiti jms) läbi toimijate praktiliste kogemuste, kaalutluste ja valikute poliitilise osaluse institutsioonides.\nKursus arendab empiirilise andmeanalüüsi oskusi, millega uurida erinevate toimijate, eliidi ja massi poliitilist osalust ja käitumist."}, "objectives": [{"en": "To provide an overview of the institutions, forms and skills of political participation as a voter, representative, party member, political leader, representative of the social movement, network and interest group, expert (of an analytical think tank), elite and public opinion maker.", "et": "Anda ülevaade poliitilise osaluse institutsioonidest, vormidest ja oskustest valijana, esindajana, partei liikmena, poliitilise juhina, sotsiaalse liikumise, võrgustiku ja huvigrupi esindajana, (mõttekoja) eksperdina, eliidina ja avaliku arvamuse kujundajana."}, {"en": "To provide an overview of the processes and aspects that shape political participation, such as political information and awareness, socialisation, organisation of the social structure, patterns of political attitudes and beliefs, polarisation, partisanship, fairness, resource allocation, public discourse, the formation of public opinion, the agenda setting, the aggregation of interests, group behaviour and psychology (including personality types) in human communities (including social movements and political parties), power, consensus and conflict, innovation in democracy (new participatory institutions and tools of deliberative, direct and participatory democracy such as referendums, mini-audiences, inclusive budget), influence of political culture, media and political campaigns on political behaviour, interaction between political elites and mass.", "et": "Anda võrdleva poliitika raamistikus ülevaade poliitilist osalust kujundavatest aspektidest ja protsessidest nagu poliitiline informeeritus ja teadlikkus, sotsialiseerumine, ühiskondliku struktuuri korraldamine, poliitiliste hoiakute ja uskumuste mustrid, polariseerumine, parteilisus, õiglus, ressursijaotus, avalik diskursus, avaliku arvamuse kujunemine, huvide koondumine, päevakorraseade, grupikäitumine ja -psühholoogia (sh isiksuse tüübid) inimkooslustes (sh sotsiaalsetes liikumistes ja erakondades), võim, konsensus ja konflikt, demokraatia innovatsioon (deliberatiivse, otse- ja osalusdemokraatia uued osalus-institutsioonid ja -vahendid nagu rahvahääletused, mini-publikud, kaasav eelarve), poliitilise kultuuri, meedia ja poliitiliste kampaaniate mõju poliitilisele käitumisele, poliitilise eliidi ja massi interaktsioon."}, {"en": "To provide the theoretical knowledge necessary for the analysis of political participation and to develop skills in thematic empirical data analysis.", "et": "Anda poliitilise osaluse analüüsiks vajalikud teoreetilised teadmised ning arendada temaatilise empiirilise andmeanalüüsi oskusi."}], "learning_outcomes": [{"en": "The student who successfully completed the course:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "- knows and understands the practical choices of the various actors participating in the various processes and institutions of a democratic society;", "et": "- teab ja mõistab, mis kaalutlustel osalevad inimesed demokraatliku ühiskonna erinevates protsessides, institutsioonides, gruppides ja rühmitustes;"}, {"en": "- is aware of what different ways and in different institutions people participate in modern politics;", "et": "- on teadlik sellest, millistel erinevatel viisidel ja erinevates institutsioonides inimesed tänapäeva poliitikas osalevad;"}, {"en": "- understands the main processes and institutions influencing political participation and behaviour, as well as the considerations and tactics that make political participation effective;", "et": "- mõistab peamisi poliitilist osalust ja käitumist mõjutavaid protsesse ja institutsioone ning kaalutlusi ja taktikaid, mis teevad poliitilise osaluse mõjusaks;"}, {"en": "- is able to analyze comparatively the chosen domain of political participation from the point of view of either the actor (individual, group, network, expert movement) and/or structure (e.g. patterns of beliefs and attitudes).", "et": "- oskab võrdlevalt analüüsida valitud poliitilise osaluse alaliiki kas toimija (indiviid, grupp, võrgustik, ekspert liikumine) ja/või struktuuri (nt uskumuste ja hoiakute mustrid) vaatest."}], "notes": {"et": "Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}}, "grading": {"independent_work": {"et": "Teadmiste testid Moodle'is enne tundide toimumist.\nAuditoorses tunnis lühiülesanded, mille käigus harjutatakse teadmiste, meetodite ja lähenemist rakendamist praktiliste näidete uurimisel ja andmestike alusel.\nPoliitilise osaluse või käitumise kodutöö kavand (1-2 lk, reavahe 1,5; juhend on Moodle'is). \nPoliitilise osaluse või käitumise uurimistöö (7-10 lk, reavahe 1,5). Uurimistöö käsitleb poliitilise osaluse ja poliitikakujunduse instrumente, institutsioone või vahendeid poliitilise toimija (erakond, huvigrupp, poliitikakujundaja vms) vaatest või poliitilise käitumise mustreid võrdleva analüüsi/meetodi alusel (juhend on Moodle'is)."}, "independent_work_assessments": [{"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "30%, (a 2,5%), alates esimesest tunnist (semestri teisel nädalal) on õppematerjalide ja auditoorselt käsitletu üle test (Moodle'is, 48h enne tunni algust)"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "24%, alates esimesest loengust (semestri teisel nädalal) kuni viimase loenguni (kaasa arvatud) on igas auditoorses tunnis ülesanne, milles harjutatakse õppe käigus käsitletud, lähenemiste, liigituste ja meetodite rakendamist praktiliste näidete ja andmestike uurimisel."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "10%, uurimistöö kavand. Hindamise aluseks on vastavus kavandi kirjutamise juhendile (moodle'is)."}}, {"work_type": {"code": "research", "et": "Uurimistöö", "en": "research paper"}, "description": {"et": "30%, uurimistöö. Hindamise aluseks on vastasuvs uurimistöö juhendile (Moodle'is)."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "2%, hinnang-tagasiside kaastudengi kodutöö kavandile (hindamise aluseks on vastavus kavandi juhendile)"}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "4%, hinnang-tagasiside kaastudengi tööle (hindamise aluseks on vastavus uurimistöö juhendile)"}}], "grade_preconditions": {"et": "Auditoorsete ülesannete positiivne koondtulemus (ehk üle 12 punkti 24st võimalikust).\nLugemismaterjalide, õppevideote ja loengutes käsitletu peale toimuvate testide positiivne koondtulemus (ehk üle 15 punkti 30st võimalikust).\nKavandi ja uurimistöö õigeaegne esitamine"}, "grade_evaluation": {"et": "30% (12 x 2,5%) - testid loengute lugemismaterjali, õppevideote ja eelnevas loengus käsitletu peale (48h jooksul enne vastavat loengut) Moodle's \n24% (12 x 2%) - auditoorsed lühiülesanded\n10% - uurimistöö kavand \n30% - uurimistöö (millest 4% on töö esitamine seminaris)\n2% -  hinnang-tagasiside kaastudengi kodutöö kavandile (hindamise aluseks on vastavus kavandi juhendile)\n4% - hinnang-tagasiside kaastudengi tööle (hindamise aluseks on vastavus uurimistöö juhendile)"}, "debt_elimination": {"et": "Teste ja auditoorseid ülesandeid tehakse ainult ajakavas ettenähtud aegadel. Teste ja auditoorseid ülesandeid uuesti või muul ajal sooritada ei saa välja arvatud juhtudel, kui mõjuvast puudumise põhjusest on õppejõudu teavitatud enne vastava testi toimumise aega."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Nädala jooksul peale hinnatava tegevuse sooritust."}}, "resources": {"web_based": {"code": "3", "et": "lähiõpe", "en": "face-to-face learning"}, "is_moodle_connected": true, "learning_environments": [{"uuid": "5a2f3e2e-d170-4352-9de8-ea9e740fc4f3", "type": "MOODLE", "code": "SVJS.00.100", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Õppematerjalid Moodle's.", "recommended_materials": "Õppematerjalid Moodle'is ja:\nDalton, Russell J. 2013. Citizen Politics: Public Opinion and Political Parties in Advanced Industrial Democracies, 6th Edition. University of California, Irvine.\nDalton, Russell J. 2009. The Good Citizen: How a Younger Generation is Reshaping American Politics. Washington, DC: CQ Press."}, "participants": {"lecturers": [{"person_uuid": "1a225f08-5974-10f7-ef3a-114e3110eaef", "person_name": "Alar Kilp", "structural_unit": {"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-16"}, "entries": [{"time": "2024-09-09", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ülevaade kursuse nõudmistest ja korraldusest. Sissejuhatus ainesse.  Poliitilise osaluse institutsioonid ja demokraatia innovatsioon: otse-demokraatlikud, osaleva demokraatia ja arutleva demokraatia instrumendid, institutsioonid ja praktikad."}}, {"time": "2024-09-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine: lihtkodanikest ekspertide ja (poliitilise) eliidini."}}, {"time": "2024-09-23", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine ja kommunikatsioon: võim ja staatus, mäng; koostöö, konsensus ja konflikt, legitimiseerimine, esindav kõne, raamistamine."}}, {"time": "2024-09-30", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline osalus: valija ja esindaja"}}, {"time": "2024-10-07", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline osalus: partei liige"}}, {"time": "2024-10-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline osalus: sotsiaalne liikumine, võrgustik"}}, {"time": "2024-10-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline osalus: organiseerunud huvi ja survegrupp"}}, {"time": "2024-10-28", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine: avalikkus, avalik arvamus, päevakordade kujundamine"}}, {"time": "2024-11-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimistöö kavandi seminar."}}, {"time": "2024-11-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine: uskumused"}}, {"time": "2024-11-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine: sotsiaalne identiteet"}}, {"time": "2024-11-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine: poliitiline eliit ja mass"}}, {"time": "2024-12-02", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Poliitiline käitumine: väärtushoiakud"}}, {"time": "2024-12-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimistöö (esitamise ja tagasisidestamise) seminar."}}, {"time": "2024-12-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Uurimistöö (esitamise ja tagasisidestamise) seminar."}}]}, "registration_info": {"audience": {}, "min_students": 15, "max_students": 44}, "parent_uuid": "15778998-c89b-5038-0336-f96d11f983c3", "parent_code": "SVJS.00.100", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}