{"uuid": "c819a27a-a0f0-e121-4b7b-0f9558de0e79", "code": "SVJS.00.096", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-29T14:34:29", "title": {"en": "Estonian politics: ideas, institutions and history", "et": "Eesti poliitika: ideed, institutsioonid ja ajalugu"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview of how political systems, institutions and ideologies have developed in the Estonian territory from the second half of the 19th century to the early 2000s. Overall, the course seeks to understand the history of the formation of the Estonian state and society today.\nAmong the central themes are the development of the Estonian national movement and the evolving idea of nation-statehood, the reception of political ideologies, the formation and development of political parties, different political systems and debates on democracy, ideas of legal continuity, and Estonia as a transition state. Each week, students will also have the opportunity to delve deeper into a specific case study, which will contribute to a deeper understanding of the overall theme.", "et": "Kursus annab ülevaate sellest, kuidas on arenenud poliitilised süsteemid, institutsioonid ja ideoloogiad Eesti alal 19. sajandi II poolest kuni 2000. aastate alguseni. Kursuse käigus püütakse mõista tänase Eesti riigi ja ühiskonna kujunemislugu.\nKesksete teemade hulgas on eesti rahvusliku liikumise areng ja rahvusriigi idee muutumine, poliitiliste ideoloogiate retseptsioon, poliitiliste erakondade kujunemine ja areng, eri poliitilised süsteemid ja demokraatia debatid, õigusliku järjepidevuse ideed ja Eesti kui siirderiik. Igal nädalal on tudengitel võimalus süveneda ka ühte konkreetsesse juhtumiuuringusse, mis aitab üldteemat sügavamalt mõista."}, "objectives": [{"en": "The aim of the course is to provide an overview of the formation and development of political systems, institutions and ideologies in the Estonian territory from the second half of the 19th century to the early 2000s.", "et": "Kursuse eesmärgiks on anda ülevaade poliitiliste süsteemide, institutsioonide ja ideoloogiate kujunemisest ja arenguloost Eesti alal 19. sajandi II poolest kuni 2000. aastate alguseni."}], "learning_outcomes": [{"en": "On successful completion of the course, the student:", "et": "Pärast kursuse edukat lõpetamist üliõpilane:"}, {"en": "- will have a basic knowledge of the development of institutions, political systems and ideologies in the Estonian territory over the last 150 years in relation to international developments;", "et": "- omab alusteadmisi institutsioonide, poliitiliste süsteemide ja ideoloogiate kujunemisest Eestis viimase 150 aasta jooksul seostatuna rahvusvaheliste arengutega;"}, {"en": "- is able to analyse provided sources and relate them to historical and contemporary issues;", "et": "- oskab analüüsida etteantud allikaid ja seostada neid aktuaalsete probleemidega minevikus ja tänapäeval;"}, {"en": "- is able to participate in a discussion on central themes of Estonian political and intellectual history and is capable of formulating proper arguments;", "et": "- on suuteline osalema diskussioonis Eesti poliitilise ajaloo ja mõtteloo kesksete teemade üle ning oma seisukohti argumenteerima;"}, {"en": "- is able to communicate the results of their research in a written form in a clearly argued and structured way, drawing on relevant sources.", "et": "- on suuteline edastama oma uurimistöö tulemusi kirjalikult selgelt argumenteeritult ja struktureeritult, tuginedes asjakohastele allikatele."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}