{"uuid": "e98ac019-7ac8-a808-a999-23ebced85805", "code": "SVJS.00.024", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "EU Enlargement and Challenges of Wider Europe", "et": "ELi laienemine ja Euroopa väljakutsed"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVJS", "structural_unit_name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVJS", "name": {"en": "Johan Skytte Institute of Political Studies", "et": "Johan Skytte poliitikauuringute instituut"}, "email": "skytte@ut.ee", "phone": "+372 737 5583", "webpage_url": "https://skytte.ut.ee", "address": "Lossi 36, ruum 301\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36, ruum 301", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course focuses on the transition processes, history of modernisation, globalisation, regionalisation and conditionality connected to the EU enlargement process and neighbourhood policy. It also reflects on the challenges of competing regionalisms in the European and Eurasian contexts. The course conceptually and analytically discusses the perspectives, problems and challenges of current and prospective candidate states as well as neighbourhood countries. It relates the latter to the zero-sum game dynamics of competing regionalisms, by looking at specific cases. In particular, the course will focus on the history of the enlargement process; theories, processes, and institutional & legal framework of the EU neighbourhood policy (with a focus on Eastern Partnership); case studies of success and failure of competing regionalisms; and recent developments and potential future trajectories.", "et": "Kursus keskendub üleminekuprotsessidele, moderniseerumise ajaloole, globaliseerumisele, piirkondade jaotamisele, mis on seotud ELi laienemisprotsessi ja naabruspoliitikaga. Kursus kajastab konkureeriva regionalismi väljakutseid Euroopa ja Euraasia kontekstis. Kursus vältel vaadeldakse  praeguste ja tulevaste kandidaatriikide kui ka naaberriikide väljavaateid, probleeme ja väljakutseid."}, "objectives": [{"en": "The aim of the course is to provide students with a specific and detailed understanding of the enlargement process and challenges related to the Wider Europe approach. The course develops conceptual, analytical, and theoretical tools to critically frame the specific nature of the external dimension of the Europeanization process and of regionalism in Europe and Eurasia. The course begins with a discussion of the historical development of the enlargement process and the related theoretical issues and widens the perspective to include different (and competing) experiences of regional integration in Europe and Eurasia. Different consistent dimensions of regionalism (and the related challenges) are discussed, including: size; diversity; pace of change; reach; external reactions. A similar approach is adopted when it comes to the EU's neighbourhood policy (with specific focus on its Eastern dimension). A discussion on Brexit will reflect on the dimension of de-Europeanization.", "et": "Kursuse eesmärk on anda õpilastele konkreetne arusaam Euroopa Liidu laienemisprotsessidest ja sellega seotud väljakutsetest. Kursus arendab kontseptuaalseid, analüütilisi ja teoreetilisi teadmisi, et tudengid oskaksid kriitiliselt hinnata euroopastumisprotsessi olemus ning regionaalsust Euroopas ja Euraasias. Kursuse vältel vaadeldakse laienemisprotsessi ajalooliste arengute ja sellega seotud teoreetiliste küsimuste üle. Kirjeldatakse ka regionaalsust ja sellega seotud väljakutseid. \nBrexit-i teemal peetav arutelu kajastab euroopastumise vastaseid mõõtmeid."}], "learning_outcomes": [{"en": "By the end of the course students are expected to:\n- historically, conceptually, and theoretically frame the process of enlargement\n- distinguish between different types of enlargement and different degrees of success in europeanization\n- contextualize the various declinations of the phenomenon in different geo-territorial contexts\n- identify and assess trends of mutual influence across the territorial contexts and role of the Europeanization process\n- assess perspectives and problems of the EU candidate and neighbourhood policy target countries\n- problematize the foreign policy implications\n- critically assess the developments in the candidate countries, partners, and Wider Europe", "et": "Kursuse lõpuks oskab tudeng:\n- rakendada illiberalismi teooriaid ja kontseptsioone\n- lugeda kriitiliselt Euroopa ja Euraasia ideoloogiliste ja poliitiliste arengutega seotud tekste\n- teha kindlaks ja hinnata vastastikust mõju territoriaalse konteksti ja europariseerumisprotsessi rollis\n- välispoliitiliste tagajärgede problematiseerimist\n- hinnata kriitiliselt arenguid kandidaatriikides, partnerriikides ja laiemas Euroopas"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}