{"uuid": "ab45774b-4bd0-fafa-7d2f-02b4075ab5f9", "code": "SVMJ.02.014", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Project-based Internship", "et": "Projektipraktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ02", "structural_unit_name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Projects are on   webpage (praktika.ut.ee) where the student has the opportunity to join a project team.\n\nThe project team consists of five to 10 students. The subject is partly web-based, and the Moodle environment outlines step-by-step activities related to analyzing both the project and the student's own development.\n\nAs a general rule, the project is carried out independently by the student's team. The level of students autonomy in the implementation of the project is discussed with the client/supervisor before the start of the project. Supervisor or client support is guaranteed throughout the project.\n\nThe following seminars are compulsory for the student:\n1.\tIntroductory seminar (giving an overview of expectations, discussing essential points for the project, etc.)\n2.\tmid-term seminar (mid-term review and mid-term reporting)\n3.\tfinal seminar (presentation and discussion of results, self-assessment, feedback from supervisor/client).\nThe student prepares self-analysis based on STARR methodology to support learning from his/her experience and to improve his/her career.", "et": "Projektide teemad on leitavad praktikavahenduse keskkonnas (praktika.ut.ee), kus üliõpilasel on võimalus liituda teda huvitava projekti meeskonnaga.\nProjekti meeskonnas on kolm kuni 10 üliõpilast. Aine on osaliselt veebipõhine, Moodle'i keskkonnas on etappide kaupa välja toodud tegevused, mis on seotud nii projekti kui üliõpilase enda arengu analüüsimisega. \n\nProjekt viiakse üliõpilaste poolt üldreeglina ellu iseseisvalt. Õppijate iseseisvuse määr projekti elluviimisel räägitakse läbi projekti tellijaga/juhendajaga enne projekti algust.  Kogu projekti vältel on tagatud juhendaja ja/või tellija tugi.\nÕppeaine raames on üliõpilasel kohustuslikud järgmised seminarid: \n1.\tSissejuhatav seminar (antakse ülevaade ootustest, arutatakse läbi projekti jaoks olulised punktid)\n2.\tvaheseminar(id) (toimub vahekokkuvõtete tegemine ja vahearuandlus)\n3.\tlõpuseminar (tulemuste ettekandmine ja arutelu, eneseanalüüside kokkuvõtted, tagasiside juhendajalt/tellijalt)\n\nKogemusest õppimise teadvustamiseks ning karjääri edendamiseks koostab üliõpilane lähtuvalt STARR metoodikast eneseanalüüsi. \nS (Situation) - situatsioon: kogemus(t)e kirjeldus, taustaandmete esitamine;\nT (Task) - roll, vastutus: mis oli õppija ülesanne, mille eest vastutas selle ülesande raames;\nA (Action) - tegevus: mida õppija tegi, miks just sellisel viisil;\nR (Result) - tulemus: kuidas ülesanne õnnestus, milline oli teiste meeskonnaliikmete tagasiside;\nR (Reflection) - refleksioon, analüüs: mida õppija sellest kogemusest õppis, mis olid tema hinnangul edutegurid, mis oli soovitud tulemuse mittesaavutamise põhjuseks, mida ta teeks edaspidi teisiti.\n\n6 EAP mahus aine läbimisel on iseseisva töö maht 148 tundi,  3 EAP mahus aine läbimisel on iseseisva töö maht 70 tundi."}, "objectives": [{"en": "The aim of the course is to apply professional knowledge and skills to implement a project (including achieving a result) in a real working environment within interdisciplinary teams and within the time and resources defined by the project.", "et": "Aine eesmärgiks on erialaste teadmiste ja kogemuste rakendamine reaalse projekti elluviimiseks (sh tulemuse saavutamine) töökeskkonnas õppijate koostööna interdistsiplinaarsetes meeskondades ning projektis kindlaks määratud aja ja ressursside raames."}], "learning_outcomes": [{"en": "Student:\n1.\tUnderstands the activities and problems related to project implementation.\n2.\tPlans the implementation of the project (the role of the project team, schedule, definition of resources).\n3.\tImplements project ideas and activities.\n4.\tEvaluates the results of the project and  own contribution.\n5.\tEvaluates own development in the process of project implementation.", "et": "6 EAP või 3 EAP mahus aine edukalt läbinud üliõpilane on omandanud kõik aine õpiväljundid, ainepunktide vahe tuleneb projekti elluviimisel ettenähtud iseseisva töö mahust. \nÕppeaine läbimisel õppija:\n1.\tSaab aru projekti elluviimisega seotud tegevustest ja probleemidest ning mõistab enda karjääri planeerimise võimalusi projektist lähtuvalt. \n2.\tPlaneerib projekti elluviimist (projektimeeskonna rollide jaotus, ajakava, ressursside määratlemine).\n3.\tViib ellu projekti tegevused lähtudes püstitatud eesmärgist ja tegevuskavast. \n4.\tHindab projekti tulemusi lähtudes püstitatud eesmärgist ning enda panust.\n5.\tAnnab hinnangu enda arengule projekti elluviimise protsessis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}