{"uuid": "f3d432a8-d31a-625d-5d81-f17dd5c24d87", "code": "SVMJ.08.011", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-21T10:47:56", "title": {"en": "Big Data Analytics and Real-Time Economic Policymaking", "et": "Suurandmete analüüs ja majanduspoliitika kujundamine reaalajas"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ08", "structural_unit_name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The nature of big data and its potential for solving complex problems. Field courses related to big data. The Nature of the Data Industry. models, regulations.", "et": "Suurandmete olemus ja võimalused keeruliste probleemide lahendamiseks. Suurandmetega seotud väljakursed. Andmetööstuse olemus, mudelid, regulatsioonid."}, "objectives": [{"en": "The aim of the course is to define big data and data industry, explain its structure, resources, value chain, services in different domains and sectors, but also business models in data industry and developing models of data industry. The course also reviews emerging regulation forms of data industry and connects real-time policymaking options and data industry.", "et": "Õppeaine eesmärgiks on selgeks teha suurandmete ja andmetööstuse mõiste, struktuur, ressursid, väärtusahel, teenused erinevates valdkondades ja sektorites ning selgitada ärimudeleid andmetööstuses, samuti kaasaegseid arenevad andmetööstuse mudelid, tekkivaid regulatsioonivorme andmetööstuses, ning siduda reaalajas poliitika kujundamine andmetööstuse võimalustega."}], "learning_outcomes": [{"en": "After passing the course student:", "et": "Kursuse edukalt läbinu:"}, {"en": "* Understands the implications of big data and the data industry on public sector governance and economic policy making;", "et": "* saab aru suurandmete ja andmetööstuse mõjudest avaliku sektori juhtimises ja majanduspoliitikate kujundamises;"}, {"en": "* Can see the possibilities of applying big data analysis to solve complex problems in specific areas of the public sector;", "et": "* oskab näha suurandmete analüüsi rakendamise võimalusi keeruliste probleemide lahendamiseks spetsiifilistes avaliku sektori valdkondades;"}, {"en": "* Has an overview of the various challenges and risks associated with the use of big data;", "et": "* omab ülevaadet erinevatest suurandmete kasutamisega seotud väljakutsetest ja riskidest;"}, {"en": "* Can evaluate the volumes and developments of the data industry and find cooperation partners;", "et": "* suudab hinnata andmetööstuse mahtusid ja arenguid ning leida koostööpartnereid;"}, {"en": "* Acquires contacts with technology companies and researchers from other fields (medicine, IT, robotics, environment)", "et": "* omandab kontakte tehnoloogiafirmadega ja teadlastega teistest valdkondadest (meditsiin, IT, robootika, keskkond)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}