{"uuid": "7bdd4465-5b14-41f4-9ee1-c5794d4c0aae", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-04T12:57:29", "title": {"en": "Knowledge-Based Start-Up Entrepreneurship II", "et": "Teadmuspõhine iduettevõtlus II"}, "credits": 2, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ02", "structural_unit_name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 28, "individual_work": 24, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course provides systemic overview of knowledge-based entrepreneurship, entrepreneurial process, helps to understand what makes knowledge-based company work; how to create successful knowledge-based start-up company. \nThe students will be introduced to the basic issues in knowledge-based entrepreneurship: entrepreneurial process, business opportunities, venture idea and product development, business models, knowledge transfer and internationalization, the role of intellectual property, the best practice of knowledge-based companies. \nThe course program focus on how to shape knowledge-based start-up entrepreneurial process; how to generate idea of knowledge-based project; how to find the idea sources; how to turn your idea into business opportunities, specific goals and business model; how to protect idea; how to find funding etc.\nThe course program includes such forms of activities as: development of group projects, readings, writing, tests, video presentation etc.", "et": "Kursus pakub süsteemset ülevaadet teadmuspõhisest ettevõtlusest, ettevõtlusprotsessist, aitab mõista teadmuspõhise ettevõtte ülesehitust; kuidas luua edukat teadmuspõhist start-up ettevõtet.\nÜliõpilastele tutvustatakse teadmuspõhise ettevõtluse põhimõtteid: ettevõtlusprotsess, ärivõimalused, riskikapital ja tootearendus, ärimudelid, teadmiste edasiandmine ja rahvusvahelistumine, intellektuaalomandi roll, teadmispõhiste ettevõtete edulood.\nKursus keskendub sellele, kuidas luua ja arendada teadmuspõhise start-up projekti ideed; kuidas leida ideede allikaid; kuidas muuta idee ärivõimaluseks, konkreetseteks eesmärkideks ja ärimudeliks; kuidas ideed kaitsta; kuidas leida rahastust jne\nKursus sisaldab selliseid tegevusi nagu: meeskonnatöö, töö kirjandusega, kodutööd, testid, video tegemine jms."}, "objectives": [{"en": "The aim of the course is to give an overview of entrepreneurial process in the knowledge-based sector,   trends on the technology market; business opportunities; venture idea and product development; business models; knowledge transfer and internationalization; the role and protection of intellectual property, etc.", "et": "Kursuse eesmärgiks on anda ülevaade teadmuspõhise sektori äriprotsessidest ja -võimalustest, sealhulgas: ülevaade tehnoloogiapõhisest ettevõtlusest, turusuundumused; ärivõimalused; riskikapital ja tootearendus; ärimudelid; teadmiste edasiandmine ja rahvusvahelistumine; intellektuaalomandi roll ja kaitse jne."}], "learning_outcomes": [{"en": "A. KNOWLEDGE, the students get:", "et": "A. TEADMISED, üliõpilasel on:"}, {"en": "Understanding of specific features and challenges of the knowledge-based entrepreneurship, entrepreneurial process, the role of knowledge in the entrepreneurial process, features of entrepreneurial process in the educational sector. ", "et": "Teadmuspõhise ettevõtluse eripärade ja väljakutsete, ettevõtlusprotsessi, teadmuse rolli ettevõtlusprotsessis, ettevõtlusprotsessi tunnused haridussektoris mõistmine."}, {"en": "Understanding of processes of launching a knowledge-based company, specific aspects of management and support processes, strategic options and growth trajectories.", "et": "Teadmuspõhise ettevõtte käivitamise protsesside mõistmine, juhtimis- ja tugiprotsesside konkreetsed aspektid, strateegilised variandid ja kasvuteed."}, {"en": "B. SPECIAL SKILLS AND COMPETENCES, the student:", "et": "B. ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane:"}, {"en": "Understands and can use in practice basic concepts, terminology, specific aspects of management and support processes of the knowledge-based business sector.", "et": "Mõistab ja oskab praktikas kasutada teadmuspõhise ettevõtlussektori põhikontseptsioone, terminoloogiat, juhtimis- ja tugiprotsessi konkreetseid aspekte."}, {"en": "C. KEY SKILLS AND COMPETENCES, the student:", "et": "C. VÕTMEOSKUSED JA PÄDEVUSED, üliõpilane:"}, {"en": "Can analyse and shape knowledge-based entrepreneurial process, strategy and business models for knowledge-based firms.", "et": "Oskab analüüsida ja kujundada teadmuspõhist ettevõtlusprotsessi, strateegiat ja ärimudeleid."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Students are required to complete home tasks in Moodle. On the basis of reading and video materials, students have to pass tests.\n2. Students have to develop knowledge-based business concept (student must weekly submit part of business concept). In the end of the course, students have to prepare final report and video presentation of they knowledge-based business concept."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "The course will require all assignments to be handed. \n\n40 points - home works (tests, development of business concept of knowledge-based project):\n*\tIndividual e-learning. Students have to pass tests. \nAssessment criteria: \n*\tStudents have to develop business concept of knowledge-based project (in teams) and weekly submit particular part of business concept.  \nAssessment criteria: relevance; the level of analysis."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "60 points - video presentation and final report on knowledge-based concept. \n*\tFinal report on knowledge-based project\n*\tVideo presentation of knowledge-based project."}}], "grade_preconditions": {"et": "Tests, development of business concept of knowledge-based projects, video presentation, final report on knowledge-based project.   \nMinimum number of points required to pass the course - 75% from all points."}, "grade_evaluation": {"et": "To pass the course, 75% from all points must be gathered."}, "debt_elimination": {"et": "Assignments over the due date will not be accepted."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "1. Duening, T.N., Hisrich, R.A., Lechter, M.A. (2010). Technology Entrepreneurship: Creating, Capturing, and Protecting Value. Elsevier, 562 p. (selected chapters)\n2. Fleisher, C.F., Bensoussan, B.E. (2015). Business and Competitive Analysis: Effective Application of New and Classic Methods. 2nd Revised edition. Pearson FT Press, 624 p. (selected chapters)", "recommended_materials": "1. Bell, J., McNaughton, R., Young, S. (2001). 'Born-again Global' Firms. An Extension to the 'Born Global' phenomenon. Journal of International Management, 7, 173-189.\n2. Compass Inc. (2017). The Startup Ecosystem Report 2017. \n3. Formica, P., Mets, T., Varblane, U. (2008). Knowledge transfer mechanisms in the European transition economies. In: Potter, J. (ed), Entrepreneurship and Higher Education, OECD, 289-311. e-book ISBN: 9789264044104.\n4. Garavaglia, C., Grieco, D. (2005). Hand in hand with entrepreneurship, a critical overview from entrepreneurship to knowledge-based entrepreneurship. Cespri Working Paper University Bocconi, Milan.\n5. Gong, Y., Baker, T., Miner, A. (2006). Failures of entrepreneurial learning in knowledge-based startups. Frontiers of Entrepreneurship Research, 26(15), Article 2.\n6. Kelli, A., Mets, T., Jonsson, L., Pisuke, H., Adamsoo, R. (2013). The changing approach in Academia-Industry collaboration: From profit orientation to innovation support. TRAMES - A Journal of the Humanities and Social Sciences, 17(67/62), 3, 215-241.\n7. Knowledge-based Estonia Estonian Research and Development and Innovation Strategy 2014-2020.\n8. Mets, T. (2017). Is ICT the solution of the problem for Estonia? In: Kaur, H., Lechman, E., Marszk, A. (eds), Catalyzing Development through ICT Adoption: The Developing World Experience. Springer International (USA).\n9. Mets, T., Kelli, A. (2013). The Impact of Intellectual Property Reward Regime on the Competitiveness of Innovative SMEs - Scientific Journal of RTU: Economics and Business, 24, 99-104.\n10. Mets, T. (2012). Creative Business Model Innovation for Globalizing SMEs. In: Burger-Helmchen, T. (ed), Entrepreneurship - Creativity and innovative Business Models, 169-190, InTech, Rijeka, Croatia.\n11. Mets, T., Kaarna, K., Kelli, A. (2010). Intellectual property - lever or barrier for the globalization of knowledge-intensive SMEs of small country origin. Engineering Economics, 21(4), 387-398.\n12. Mets, T. (2010). Entrepreneurial Business Model for Classical Research University. Engineering Economics, 21(1), 80-89.\n13. OECD Reviews of Innovation Policy. Knowledge-based Start-ups in Mexico (2013).\n14. Oyson, M., Whittaker, D.H. (2010). An opportunity-based approach to international entrepreneurship: pursuing opportunities internationally through prospection. Proceedings of The Eighteenth Annual High Technology Small Firms Conference. \n15. Shane, S.A. (2003). A General Theory of Entrepreneurship: The Individual-Opportunity Nexus. Cheltenham, U.K: Edward Elgar.\n16. Venkataraman, S. (2003). Foreword. In: Shane, S.A. (ed), A General Theory of Entrepreneurship. The Individual-Opportunity Nexus, xi-xii. Cheltenham, U.K: Edward Elgar."}, "participants": {"lecturers": [{"person_uuid": "b9c11b70-0967-6cdf-38a7-331ab6395272", "person_name": "Mervi Raudsaar", "structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "6f495099-6b59-a965-4320-a1b3d132f436", "person_name": "Iuliia Trabskaia", "structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Part I. Basic issues in knowledge-based startup entrepreneurship.\nIndividual work\n\n1. Entrepreneurial process in knowledge-based start-ups"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Topic 2. Starting knowledge-based start-up. From Idea to opportunity. Industry and technology analyses"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Topic 3. Business models. Market analysis and product development."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Topic 4. Knowledge transfer and internationalisation strategies."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Topic 5. Intellectual property.Topic 6. Financing sources."}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "PART 2. Developing business concept of knowledge-based projects \nTeam work\n\nGenerate idea"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Scan environment and assess opportunity\nDefine your market"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Protect your intellectual property\nGetting funded"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "Final presentation"}}, {"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "e-Consultations (chat conversations) are held: from 17.09-03.12 (each week on Tuesday at 18.10-19.30).\n\nPart 1. \nIndividual e-learning. Students have to work through reading and video materials and pass tests. \nTopics:\n1.1. Introduction. Knowledge-based entrepreneurship. Entrepreneurial process.\n1.2. Features of industry and technology analysis.\n1.3. Business opportunity.\nASSIGNMENT: test (topics 1.1-1.3)\n1.4. Business models. Business models for knowledge-based firms. Market analysis and product development. \n1.5. Knowledge transfer and internationalisation strategies.\n1.6. Intellectual property.\n1.7. Financing sources.\nASSIGNMENT: test (topics 1.4-1.7)\n\nPart 2. \nTeam e-learning. Students have to develop the business concept of knowledge-based projects (each part of the concept must be uploaded to the Moodle on the particular date). \nAt the end of the course, students have to prepare video presentation and final report on knowledge-based project (in team).\nFinal report on the business concept of knowledge-based projects must include:\n*\tBusiness idea\n*       Business opportunity assessment.\n*       Industry and technology analyses.\n*\tBusiness models and strategies. Market analysis and product development. \n*\tInternationalisation strategies.\n*\tIntellectual property protection strategy.\n*\tFunding strategy."}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 12}, "parent_uuid": "4aa0671d-de04-6b8c-ed00-f3e927025554", "parent_code": "SVMJ.02.019", "parent_credits": 2, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}