{"uuid": "7c5bf62d-78cd-e711-3ffd-396762e21dea", "code": "SVMJ.07.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Business and Economy in Japan", "et": "Äri ja majandus Jaapanis"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ07", "structural_unit_name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ07", "name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course focuses on the economic development in Japan throughout the post-war period and discusses critical junctures and institutional change during the last decades, which influence current market trends and the recent economy in the whole region. Further, the EPA and SPA are discussed with the implications on trade relations between Europe and Japan.\nThe course connects knowledge on economic development and regional characteristics with specific cultural aspects.", "et": "Kursus käsitleb Jaapani majanduslikku arengut alates Teisest Maailmasõjast tänapäevani. Kursuse käigus arutletakse institutsioonide muutusi viimastel aastakümnetel, mis on mõjutanud kaasaegseid turutrende ja majandust nii Jaapanis kui terves regioonis. Samuti uuritakse EPA ja SPA leppeid Euroopa Liidu ja Jaapani vahel ning nende lepingute mõju kaubandusele. Kursus ühendab majandusteadmised regionaalsete kultuuriliste eripäradega."}, "objectives": [{"en": "The main objective of the course is to provide an overview on economic development in contemporary Japan and Japanese business culture, analyze Japanese economy while taking into account Asian regional markets and provide opportunities for practical skills in multi-cultural business environments.", "et": "Aine eesmärk on anda ülevaade kaasaegse Jaapani majanduse arengust ning äripraktikatest, viia Jaapani majanduse areng suuremasse Aasia konteksti ning arendada oskusi praktiliseks suhtluseks rahvusvahelises ärikeskkonnas."}], "learning_outcomes": [{"en": "On successful completion of the course the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1.\tcan explain the development and characteristics of economy in contemporary Japan;", "et": "1.\tseletab kaasaegse Jaapani majanduse arengut ning karakteristikat;"}, {"en": "2.\tcan analyse Japanese economy in broader Asian context;", "et": "2.\tanalüüsib Jaapani majandust suuremalt Aasia regionaalses kontekstis;"}, {"en": "3.\tunderstands the background of EU-Japan economic and trade relations, knows main documents and developments;", "et": "3.\tmõistab Euroopa Liidu ja Jaapani majandussuhete tausta, põhilisi dokumente ja arengusuundi;"}, {"en": "4.\tunderstands the Japanese business culture and is ready for communication with partners.", "et": "4.\ttunneb Jaapani ärisuhtluskultuuri eripärasid ning on valmis praktilisteks suhtlusteks partneritega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}