{"uuid": "4916f627-9d59-9809-244b-32b27ec7d9e0", "code": "SVMJ.04.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Practical Training", "et": "Praktika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ", "structural_unit_name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students work in various institutions (ministries, Eesti Pank (central bank of Estonia) and other central banks, state agencies, think-tanks, international enterprises, universities, etc) on the study of a research problem proposed by the particular institution or the student(s). At the end of the practical training student(s) will submit the report of the practical training research, that includes also self-analysis. In addition to that student(s) will submit the assessment by the institution on his/her performance during the practical and feedback on the practical training process. The practical training will finish with the defence of the report of the practical training work. The format of the internship report may derive from the form of the internship organization or may be in the form of a logbook that describes the activities undertaken and the skills applied during the practical training according to the sample given. In addition to the report the student is expected to submit other materials, that would enable to understand and evaluate his or her practical training.", "et": "Töö asutustes ja organisatsioonides (ministeeriumid, Eesti Pank ja teised keskpangad, kommertspangad, riigiametid, uurimisasutused, rahvusvahelised suurettevõtted, ülikoolid jt.) asutuse või üliõpilas(t)e poolt välja pakutud uurimisprobleemi lahendamisel. Praktika lõpus esitab üliõpilane(sed) uurimistöö aruande, mis sisaldab ka eneseanalüüsi. Lisaks esitab üliõpilane praktikakoha hinnangu tema tegevusele ning tagasiside praktika protsessile. Praktika lõppeb praktika aruande kaitsmisega. Praktika aruande vorm võib tuleneda praktika organisatsiooni poolsest vormist või võib olla logiraamatu kujul, kus kirjeldatakse praktika käigus läbiviidud tegevusi ja omandatud oskusi vastavalt etteantud näidisele. Lisaks võiks üliõpilane prakatikaaruandele lisada muud materjalid, mis võimaldavad mõista ja hinnata tema praktikat."}, "objectives": [{"en": "The aim of the practical training is to apply obtained theoretical skills for the empirical or theoretical study of actual economic problems and for offering solutions to it.", "et": "Praktika eesmärgiks on rakendada õpitud teoreetilisi teadmisi reaalsete majandusprobleemide empiirilisel või teoreetilisel uurimisel ja lahendamisel."}], "learning_outcomes": [{"en": "* Ability to collect and analyze information and empirical data on the considered economic problem and by using these to describe the particular economic problem", "et": "*\tOskus käsitletava majandusprobleemi kohta informatsiooni ja andmeid koguda ning süstematiseerida, ja selle alusel kirjeldada käsitletavat majandusprobleemi"}, {"en": "* Ability to work with the economics literature", "et": "*\tOskus töötada erialakirjandusega "}, {"en": "* The ability to apply various studied research methods in order to solve the particular research problem, the ability to interpret and explain the obtained research results", "et": "*\tOskus rakendada uurimisprobleemi lahendamiseks erinevaid õpitud uurimismeetodeid, saadud tulemusi interpreteerida ja selgitada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}