{"uuid": "5b9f96d4-5477-7f36-03bc-696d3c60f7c4", "code": "SVMJ.04.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research and Data Analysis Methods in Economics", "et": "Uurimis- ja analüüsimeetodid majanduses"}, "credits": 10, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course introduces different qualitative research and data analysis methods used in economics and social sciences. An overview of basic principles of carrying out interviews, surveys, observations, case studies etc. will be given. Relationships between research object, research problems and aims, theoretical standpoints and research methods are introduced. Topics of research planning, data collection, data analysis and presenting of results in qualitative research will be covered. Course ends with an introduction of different quantitative and qualitative data analysis methods.", "et": "Kursuse raames tutvustatakse põhilisi majandus- ja sotsiaalteadustes kasutatavaid uurimis- ja analüüsimeetodeid. Tutvustatakse intervjuude, küsitluste, vaatluste, juhtumiuuringute jt meetodite läbiviimise põhimõtteid. Käsitletakse seoseid uurimisobjekti, uurimisprobleemide ja eesmärkide ning teoreetiliste lähtekohtade ning analüüsimeetodite valiku vahel. Käsitletavateks teemadeks on uurimuse ettevalmistamine, uurimisplaani koostamine, andmete kogumise, analüüsimise ja tulemuste esitamise viisid. Kursuse lõpus tutvustatakse erinevaid kvalitatiivseid ja kvantitatiivseid andmeanalüüsi meetodeid."}, "objectives": [{"en": "This course enables to get knowledge of different methods used in data gathering and analysis in qualitative and quantitative research in economics and social sciences and the main principles and problems of research methodology. Enables to develop students' analytical skills, critical thinking and is meant for improving the level of students' master projects.", "et": "Võimaldada üliõpilastel omandada teadmised majandus- ja sotsiaalteaduste valdkonnas enamkasutatavatest kvalitatiivsetest ja kvantitatiivsetest uurimus- ja analüüsimeetoditest ning teadusmetodoloogia kesksetest põhimõtetest ja probleemidest. Võimaldada arendada magistrantide analüüsioskust, kriitilist mõtlemist ning tõsta magistriprojektide akadeemilist taset."}], "learning_outcomes": [{"en": "After the course, the student:", "et": "Aine läbinud üliõpilane:"}, {"en": "*is able to reflect over the role of research in nowadays society ", "et": "*oskab reflekteerida uuringute rolli üle tänapäeva ühiskonnas "}, {"en": "* knows the main methodologies and methods, used in social sciences on ", "et": "* on kursis sotsiaalteaduste valdkonnas enim kasutatavate metodoloogiate ja meetoditega "}, {"en": "*is able to formulate a research problem for his/her master thesis ", "et": "*suudab iseseisvalt formuleerida oma magistritöö raames uurimisprobleemi "}, {"en": "*is able to create an introduction to his/her master thesis (research problem, research aim and research tasks) together with a logical structure of the thesis - the table of contents ", "et": "*on võimeline aines läbitu baasil looma magistritööle sissejuhatuse (uurimisprobleem, eesmärk ja uurimisülesanded) koos magistritöö loogilise kava ehk sisukorraga "}, {"en": "*knows how to conduct qualitative data analysis ", "et": "*oskab läbi viia kvalitatiivset andmeanalüüsi "}, {"en": "*knows how to conduct quantitative data analysis ", "et": "*oskab läbi viia kvantitatiivset andmeanalüüsi "}, {"en": "*has acquired the skills of writing a master thesis,", "et": "*on omandanud magistritöö kirjutamise oskused"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}