{"uuid": "04f63ed6-3ad6-7422-3410-1ac0ebb7c2e8", "code": "SVMJ.04.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Multivariate Statistical Analysis", "et": "Mitmemõõtmeline statistiline analüüs"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course introduces the main techniques and methods of multivariate statistical analysis employed by economists. The following topics are covered: principal component analysis and exploratory factor analysis, confirmatory factor analysis, cluster analysis, discriminant analysis.", "et": "Õppeaines käsitletakse mitmemõõtmelise statistika meetodite kasutamise võimalusi majandus- ja sotsiaalprotsesse iseloomustavate andmete analüüsimisel. Mitmemõõtmelise statistika meetoditest tutvustatakse kursuse raames põhikomponentide analüüsi ja eksploratiivset faktoranalüüsi, kinnitavat faktoranalüüsi, klasteranalüüsi, struktuurset modelleerimist, diskriminantanalüüsi."}, "objectives": [{"en": "Course will give students knowledge and experiences how to describe and define different economic and business problems in solving of which there is need to use multivariate statistical methods. Course will give skills and experiences how to apply different multivariate methods for analysing real life problems and how to interpret the gained results.", "et": "Anda teadmised uurimisprobleemide lahendamisel kasutatavate mitmemõõtmelise statistika meetodite kohta. Anda oskused ja kogemused nende meetodite kasutamiseks majandus- ja sotsiaalprotsesse iseloomustavate andmete analüüsimisel, püstitatud uurimisprobleemidele lahenduste leidmisel ning uurimistulemuste sisulisel tõlgendamisel."}], "learning_outcomes": [{"en": "Course will give students knowledge of different multivariate statistical methods, their application possibilities and interpretation of the gained results; knowledge and skills of applying multivariate analysis using software packages; skills and experiences to find suitable data for statistical data analysis, how to systemise and prepare data for multivariate analysis; skills how to carry out parametric multivariate statistical analysis, interpret results of statistical data analysis, how to generalise findings to the research questions and how to present research results.", "et": "Kursuse läbinud üliõpilane teab mitmemõõtmelise statistilise andmeanalüüsi meetodeid ning oskab neid rakendada ja tulemusi tõlgendada; oskab kasutada tarkvarapakette analüüsiülesannete lahendamiseks; oskab leida statistiliseks analüüsiks vajalikke ja sobivaid andmeid; oskab läbi viia parameetrilist ja mitteparameetrilist andmeanalüüsi, tõlgendada analüüsitulemusi ning neid üldistada ja uurimistulemusi esitada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}