{"uuid": "4aa0671d-de04-6b8c-ed00-f3e927025554", "code": "SVMJ.02.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Knowledge-Based Start-Up Entrepreneurship II", "et": "Teadmuspõhine iduettevõtlus II"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ02", "structural_unit_name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides systemic overview of knowledge-based entrepreneurship, entrepreneurial process, helps to understand what makes knowledge-based company work; how to create successful knowledge-based start-up company. \nThe students will be introduced to the basic issues in knowledge-based entrepreneurship: entrepreneurial process, business opportunities, venture idea and product development, business models, knowledge transfer and internationalization, the role of intellectual property, the best practice of knowledge-based companies. \nThe course program focus on how to shape knowledge-based start-up entrepreneurial process; how to generate idea of knowledge-based project; how to find the idea sources; how to turn your idea into business opportunities, specific goals and business model; how to protect idea; how to find funding etc.\nThe course program includes such forms of activities as: development of group projects, readings, writing, tests, video presentation etc.", "et": "Kursus pakub süsteemset ülevaadet teadmuspõhisest ettevõtlusest, ettevõtlusprotsessist, aitab mõista teadmuspõhise ettevõtte ülesehitust; kuidas luua edukat teadmuspõhist start-up ettevõtet.\nÜliõpilastele tutvustatakse teadmuspõhise ettevõtluse põhimõtteid: ettevõtlusprotsess, ärivõimalused, riskikapital ja tootearendus, ärimudelid, teadmiste edasiandmine ja rahvusvahelistumine, intellektuaalomandi roll, teadmispõhiste ettevõtete edulood.\nKursus keskendub sellele, kuidas luua ja arendada teadmuspõhise start-up projekti ideed; kuidas leida ideede allikaid; kuidas muuta idee ärivõimaluseks, konkreetseteks eesmärkideks ja ärimudeliks; kuidas ideed kaitsta; kuidas leida rahastust jne\nKursus sisaldab selliseid tegevusi nagu: meeskonnatöö, töö kirjandusega, kodutööd, testid, video tegemine jms."}, "objectives": [{"en": "The aim of the course is to give an overview of entrepreneurial process in the knowledge-based sector,   trends on the technology market; business opportunities; venture idea and product development; business models; knowledge transfer and internationalization; the role and protection of intellectual property, etc.", "et": "Kursuse eesmärgiks on anda ülevaade teadmuspõhise sektori äriprotsessidest ja -võimalustest, sealhulgas: ülevaade tehnoloogiapõhisest ettevõtlusest, turusuundumused; ärivõimalused; riskikapital ja tootearendus; ärimudelid; teadmiste edasiandmine ja rahvusvahelistumine; intellektuaalomandi roll ja kaitse jne."}], "learning_outcomes": [{"en": "A. KNOWLEDGE, the students get:", "et": "A. TEADMISED, üliõpilasel on:"}, {"en": "Understanding of specific features and challenges of the knowledge-based entrepreneurship, entrepreneurial process, the role of knowledge in the entrepreneurial process, features of entrepreneurial process in the educational sector. ", "et": "Teadmuspõhise ettevõtluse eripärade ja väljakutsete, ettevõtlusprotsessi, teadmuse rolli ettevõtlusprotsessis, ettevõtlusprotsessi tunnused haridussektoris mõistmine."}, {"en": "Understanding of processes of launching a knowledge-based company, specific aspects of management and support processes, strategic options and growth trajectories.", "et": "Teadmuspõhise ettevõtte käivitamise protsesside mõistmine, juhtimis- ja tugiprotsesside konkreetsed aspektid, strateegilised variandid ja kasvuteed."}, {"en": "B. SPECIAL SKILLS AND COMPETENCES, the student:", "et": "B. ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane:"}, {"en": "Understands and can use in practice basic concepts, terminology, specific aspects of management and support processes of the knowledge-based business sector.", "et": "Mõistab ja oskab praktikas kasutada teadmuspõhise ettevõtlussektori põhikontseptsioone, terminoloogiat, juhtimis- ja tugiprotsessi konkreetseid aspekte."}, {"en": "C. KEY SKILLS AND COMPETENCES, the student:", "et": "C. VÕTMEOSKUSED JA PÄDEVUSED, üliõpilane:"}, {"en": "Can analyse and shape knowledge-based entrepreneurial process, strategy and business models for knowledge-based firms.", "et": "Oskab analüüsida ja kujundada teadmuspõhist ettevõtlusprotsessi, strateegiat ja ärimudeleid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}