{"uuid": "0c1338d2-38be-82eb-253a-862975eb3cb5", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-20T15:06:30", "title": {"en": "Trade Policy Analysis", "et": "Kaubanduspoliitika analüüs"}, "credits": 5, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 15, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 103, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The first block  of the course includes lecturers on the following topics: 1) measuring and quantifying trade flows and trade policies; 2) The Gravity Model of International Trade: Introduction and Theoretical Foundations; 3) Estimating Structural Gravity (partial equilibrium): Analytical tools and applications; 4) General Equilibrium Analysis with the Gravity Model. Theory, Tools and Applications; 5) Other applications of gravity models: FDI, Migration. The second block of the course consist of hands-on lab sessions where students will apply the tools acquired in the 1st block using STATA. Students will have two main types of assignments: i) replication of published papers using gravity models; ii) research project. The research projects will be presented at the end of the course.", "et": "Kursuse esimene osa koosneb loengutest järgmistel teemadel: 1) kaubandusvoogude ja kaubanduspoliitikate mõõtmine ja kvantifitseerimine; 2) rahvusvahlise kaubanduse gravitatsioonimudel - sissejuhatus ja teoreetilised alused; 3) struktuurse osalise tasakaalu gravitatsioonimudeli hindamine; 4) üldise tasakaalu gravitatsioonimudel - teooria, tööriistad ja rakendused; 5) gravitatsioonimudelite muud rakendused. Kuruse teine pool koosneb praktilistest arvutipraktikumidest, kus üliõpilased rakendavad kursuse esimeses pooles omandatud oskusi STATA tarkvaraga. Üliõpilastrl on põhiliselt kahte tüüpi ülesandeid: a) gravitatsioonimudeleid kaustanud avaldatud teadusartiklite tulemuste replikeerimine; b) uurimisprojekt. Uurimisprojektid kantakse ette kursuse lõpus."}, "objectives": [{"en": "The aim of the course is by building on the theoretical insights gained in international trade and skills developed in applied econometrics to develope the empirical skills required for the quantification of trade flows and for trade policies impact evaluation.", "et": "Kursuse eesmärk on tuginedes rahvusvahelise kaubanduse teooriast ja rakenduslikust ökonomeetriast omandatud oskustele arendada empiirilisi oskusi, mis on vajalikud kaubandusvoogude kvamtifitseerimiseks ja kaubanduspoliitika mõjude hundamiseks."}], "learning_outcomes": [{"en": "After taking the course students will be able to use the structural gravity model in partial and general equilibrium settings in order to estimate and predict the effects of trade and trade-related policies on trade flows, on welfare, and on the distribution of income.", "et": "Pärast kursuse läbimist oskavad üliõpilased kasutada struktuurseid gravitatsioonimudeleid osalise ja üldise tasakaalu raamistikus hindamaks ja ennustamaks väliskaubanduspoliitikate ja seotud poliitikate mõjusid kaubavoogudele, heaolule ja sissetuleku jaotusele."}], "notes": {}}, "grading": {"independent_work": {"et": "Students will have two main types of assignments: i) replication of published papers using gravity models; ii) research project. The research projects will be presented at the end of the course."}, "grade_preconditions": {}, "grade_evaluation": {"et": "The final grade is a weighted average of:\na)\tA final written exam (45%)\nb)\tPresentation of a topical academic paper and discussion of two other papers (20%)\nc)\tReserach project, including presentation and discussion (35%)\nParticipation in parts a), b), and c) is mandatory to be able to pass. In case of resit scores of successful subparts can be transferred to the second exam period. Resit for part b) will be based on academic papers different from the first examination period. Resit for part c) involves upgrading the report."}, "debt_elimination": {"et": "Upon agreement with the instructor."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Loenguslaidid ja artiklid on kättesaadavad Bari Ülikooli online platvpormi kaudu.\n\nLecture slides and papers will be available through the University of Bari online learning platform.\n\n*\t\"An Advanced Guide to Trade Policy Analysis: The Structural Gravity Model\" Yotov, Y. V., R. Piermartini, J. A. Monteiro, and M. Larch co-published by UNCTAD and WTO, 2016.\n*\t\"Estimating Trade Policy Effects with Structural Gravity\" Piermartini, R. and Y. V. Yotov, 2016. \n*\t\"The Log of Gravity\" Santos Silva, J.M.C. and S. Tenreyro, 2006. Review of Economics and Statistics, 88(4): 641-658.\n*\t\"Practical Guide to Trade Policy Analysis\" World Trade Organization and United Nations Conference on Trade and Development, 2012.", "recommended_materials": "*\t\"Gravity with Gravitas: A Solution to the Border Puzzle\" Anderson, J. E., and E. van Wincoop. 2003. American Economic Review, 93(1): 170-192.\n*\t\"Estimating General Equilibrium Trade Policy Effects: GE PPML\" Anderson, J. E., M. Larch, and Y. V. Yotov, 2015. CESifo Working Paper Series 5446.\n*\t\"The Changing Incidence of Geography\" Anderson, J. E. and Y. V. Yotov, 2010. American Economic Review, vol. 100(5), pages 2157-86.\n*\t\"Technology, Geography, and Trade\" Eaton, J. and S. Kortum, 2002. Econometrica, vol. 70(5), pages 1741-1779.\n*\t\"The Gravity Model\" Anderson, J.E. 2011. Annual Review of Economics, 3:133-60.\n*\t\"Gravity for Dummies and Dummies for Gravity Equations\" Baldwin, R. and D. Taglioni, 2006. NBER Working Papers 12516.\n*\t\"Trade Theory with Numbers: Quantifying the Consequences of Globalization\" Costinot, A., and A. Rodríguez-Clare, 2014. in the Handbook of International Economics Vol. 4, eds. G. Gopinath, E. Helpman, and K. Rogoff."}, "participants": {"lecturers": [{"person_uuid": "95429ef7-7b37-5b9b-44d5-28748fd0a226", "person_name": "Jaan Masso", "structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "6,7,10,12"}}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 10}, "parent_uuid": "1de2d261-eea8-85bf-2070-984e467827de", "parent_code": "SVMJ.04.024", "parent_credits": 5, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}