{"uuid": "70bb72f9-323c-59e7-abd6-8cfb720508da", "code": "SVMJ.00.034", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Seminar", "et": "Magistriseminar"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ", "structural_unit_name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "During Master Seminar the participants get both theoretical and practical skills for writing their Master Thesis. Via practical tasks the students get support for choosing research topic, planning the structure and research process of the thesis.", "et": "Magistriseminaris antakse osalejatele teoreetilisi teadmisi ja praktilisi oskusi magistritöö koostamiseks. Praktiliste ülesannete raames toetatakse üliõpilasi magistritöö teema valikul, struktuuri ja uurimisprotsessi kavandamisel."}, "objectives": [{"en": "The aim of the Master Seminar is to explain and systematize the basic knowledge and research methods for completing the Master Thesis. During Master Seminar necessary presentation, reviewing and discussion skills are developed.", "et": "Magistriseminari eesmärgiks on selgitada ja süstematiseerida põhiteadmisi ja uurimismeetodeid, mis on vajalikud magistritöö koostamiseks. Magistriseminari käigus arendatakse vajalikke esinemis-, retsenseerimis- ja diskussioonioskusi."}], "learning_outcomes": [{"en": "After the course is passed the participant:\n*knows the requirements for completion the Master Thesis at this faculty\n*knows the basic research methods and their implementation in economic field\n*can formulate research problem, aim of the study and research tasks\n*can compile short research syllabus and plan research process\n*is able to find theoretical literature and can write a literature overview\n*can collect data for empirical research and analyse them\n*knows how to interpret both theoretical and empirical material, and make generalizations\n*can make a presentation of Master thesis' results and discuss them", "et": "Aine läbinud üliõpilane\n*tunneb TÜ majandusteaduskonnas magistritööle esitatavaid sisulisi ja vormilisi nõudeid;\n*tunneb peamisi majandusteaduses kasutatavaid uurimismeetodeid ja nende rakendamise võimalusi;\n*oskab sõnastada uurimuse probleemi, eesmärgi ja ülesanded;\n*oskab koostada magistritöö laiendatud kava ja kavandada uurimisprotsessi;\n*on võimeline leidma vajalikku teoreetilist kirjandust ja oskab koostada kirjanduse ülevaadet *oskab koguda empiiriliseks analüüsiks vajalikke andmeid ja viia läbi nende analüüsi;\n*teab kuidas magistritöö käigus saadud teoreetilisi ja empiirilisi tulemusi tõlgendada, sünteesida ja üldistada;\n*oskab magistritöö tulemusi esitleda ja nende üle diskuteerida"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}