{"uuid": "125b2384-820e-c101-a00c-8b03683f6cfd", "code": "SVMJ.03.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Strategic Leadership and Self-managing Organisation", "et": "Strateegiline eestvedamine ja isejuhtiv organisatsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course focuses on the concept of self-managing organisation, its basic design principles and operational practices within the context of collective leadership and, specifically, Holacracy. We dive deeper into the essence of strategic leadership, incl. the specifics of organisational capabilities, distributed authority and radically decentralised decision making as well as collective leadership in ensuring organisational alignment and coordination. In addition, the course deals with the hierarchy of purposes, dealineating the role boundaries as well as sensing, expressing and working through the tensions as prescribed by the Holacracy.", "et": "Õppeaines käsitletakse isejuhtivat organisatsiooni, tema ülesehituse põhimõtteid ja selle kujundamise praktikaid kollektiivse eestvedamise ning holakraatia kontekstis. Süvendatult käsitletakse strateegilise eestvedamise olemust isejuhtimise võtmes, sealhulgas organisatsiooni dünaamilisi võimekusi, jagatud võimu olemust ja radikaalselt detsentraliseeritud otsustusõigust ning kollektiivse eestvedamise võimekust organisatsiooni joondatuse ja koordinatsiooni tagamisel. Samuti käsitletakse eesmärkide hierarhia ja rollide määratlemist koos \"pingete\" (tensions) juhtimisega vastavuses holakraatia põhiprintsiipidega."}, "objectives": [{"en": "The aim of the course is to provide a theoretical overview along with the practical implications of non-hierarchical (self-managing) organisational structures and its operating principles within the broader strategic leadership context.", "et": "Aine eesmärgiks on anda ülevaade koos praktiliste meetmetega madala hierahiaga (isejuhtiva) organisatsiooni ülesehitusest ja tema juhtimise aspektidest strateegilise eestvedamise kontekstis."}], "learning_outcomes": [{"en": "Understands the theoretical and practical aspects of strategic leadership domain.", "et": "Mõistab strateegilise eestvedamise teoreetilisi ja praktilisi küsimusi."}, {"en": "Knows the concept of self-managing organisation and its basic operating principles (e.g. distributed authority and radically decentralised decision making), as well as how to develop organisational capabilities.", "et": "Teab isejuhtiva organisatsiooni kontseptsiooni ja selle toimimise printsiipe (nt jagatud võimu olemust ja radikaalselt detsentraliseeritud otsustusõigust) ning kuidas arendada organisatsioonilisi võimekusi."}, {"en": "Knows how to design the management processes within the non-hierarchical (self-managing) organisation.", "et": "Teab, kuidas kujundada juhtimisprotsesse madala hierarhiaga (isejuhtivas) organisatsioonis."}, {"en": "Is capable of applying various management practices (e.g. holacratic meeting formats) pertaining to the self-managing organisations in practice.", "et": "Oskab praktikas rakendada erinevaid organisatsioonilise isejuhtimise elemente meeskonnatöös, sh holakraatia koosolekuformaate."}, {"en": "Is capable of assessing various factors underlying the influence, power and authority of organisational members in the self-managing organisation.", "et": "Oskab hinnata, milliste teguritega tuleb arvestada inimeste mõjutamisel isejuhtivas organisatsioonis."}, {"en": "Has gained the experience of analysing organisation's capability to self-manange itself.", "et": "On omandanud kogemuse analüüsida organisatsiooni isejuhtivust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}