{"uuid": "03152db9-3b62-6d85-9227-52d2f812f990", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-07T12:48:09", "title": {"en": "Entrepreneurship", "et": "Ettevõtlus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 S regular part 2 3 CP SV Eng", "et": "24/25 K PÕ 2. osa 3 EAP SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ02", "structural_unit_name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "doctoral", "et": "doktoriõpe", "en": "doctoral studies"}], "hours": {"lecture": 0, "practice": 2, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 64, "individual_work": 8, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course helps the doctoral student develop both the theoretical knowledge and the practical skills needed by a startup entrepreneur to implement new ideas or how new ideas reach the operating company or the public sector. The course is aimed at doctoral students in a variety of disciplines, ranging from information technology, physics, chemistry, biology, medicine to the arts, philology, philosophy, history, semiotics, and social sciences. Doctoral students have the opportunity to collaborate with students and researchers from other disciplines.\nThere are different ways to take the course:\n1. Participating in all classroom work, including sTARTUp Lab (Practice Lab) events, completing tutorials, and doing homework alone or with a team.\n2. Participating in classroom work, including independently (in consultation with a lecturer), completing study material and developing student's own business idea, and doing homework (practicum) by designing alone or with a team.\n3. Participating (possibly partially) in classroom work or e-learning, including independently (in consultation with a lecturer), completing study material and developing one's own business idea, and doing homework (practicum) by designing alone or with a team.\nThe course is structured in two parts (3 ECTS each):\n1. In the first part of the course, a student will get an introduction to entrepreneurship and an assessment of the business idea and opportunity. The information collected for the case study will help to develop own business idea, map and analyze the field.\n2. Project to evaluate the business idea (plan) and / or business opportunity(ies) based on own business idea and knowledge. A feasibility study is a further development of the business opportunity project, but also a specific form, such as a research project.\nIn addition to study materials, video lectures and illustrations, business presentations and interviews with entrepreneurs in the form of video recordings are available at Moodle.", "et": "Käesolev kursus aitab doktorandil kujundada nii teoreetilisi teadmisi kui ka praktilisi oskusi, mida alustav ettevõtja vajab uute ideede elluviimiseks või kuidas uued ideed jõuavad tegutsevasse ettevõttesse või avalikku sektorisse. Kursus on suunatud doktorantidele erinevatel erialadel, alates infotehnoloogiast, füüsikast, keemiast, bioloogiast, meditsiinist kuni kunstide, filoloogia, filosoofia, ajaloo, semiootika ja sotsiaalteadusteni. Doktorantidel on võimalus teha koostööd teiste erialade tudengite ja teadlastega.\nKursuse läbimiseks on erinevaid võimalusi:\n1. Osaledes kogu auditoorses töös, sh sTARTUp Lab-i (Ideelabori) (praktikumi) üritustel, läbides õppematerjali ning ja tehes kodutöö (moodles) üksi või meeskonnaga.\n2. Osaledes auditoorses töös, sh iseseisvalt (konsulteerides õppejõuga) läbides õppematerjali ning arendades oma äriideed, ja tehes kodutöö (praktikumi) moodles üksi või meeskonnaga.\n3. Osaledes (võimalik osaliselt) auditoorses töös või e-õppena, sh iseseisvalt (konsulteerides õppejõuga) läbides õppematerjali ning arendades oma äriideed, ja tehes kodutöö (praktikumi) moodles üksi või meeskonnaga.\nKursus on üles ehitatud kahe-osalisena (kumbki osa 3 EAP):\n1. Kursuse esimene sisaldab sissejuhatust ettevõtlusse ja äriidee ja -võimaluste hindamisse. Juhtumi-uuringuks kogutav info aitab arendada oma äriideed, kaardistada ja analüüsida valdkonda. \n2. Õppuri äriideel ja teadmusvaldkonnal põhineva äriplaani ja/või ettevõtlusvõimalus(t)e hindamise projekt. Ettevõtlusvõimaluse hindamise projekti edasiarenduseks, aga ka erivormiks, nt teadusprojektile, on teostatavus-tasuvus-analüüsi (TTA) projekt.\nMoodles on kättesaadavad, lisaks õpimaterjalidele, videoloengud ja illustreeriv materjal, ettevõtjate esinemised ja intervjuud ettevõtjatega videosalvestiste näol."}, "objectives": [{"en": "The aim of the course is to provide an overview of the entrepreneurial process and business opportunities, including an overview of modern knowledge-based entrepreneurship in all areas, business models, sectoral differences, knowledge transfer and internationalization, specificities compared to other traditional business disciplines, financing, product development, the role of intellectual property (IP). Experienced entrepreneurs and staff from research institutions mediate their experience.", "et": "Aine eesmärgiks on anda ülevaade ettevõtlusprotsessist ja ettevõtlusvõimalustest, sealhulgas ülevaade kaasaegsest teadmus-põhisest ettevõtlusest kõigis valdkondades, ärimudelitest, sektoraalsetest erinevustest, teadmussiirdest ja rahvusvahelistumisest, eripäradest võrreldes teiste traditsiooniliste ettevõtluse valdkondadega, rahastamisest, intellektuaalomandi (IO) rollist, tootearendusest, jne. Oma kogemusi vahendavad tegutsevad ettevõtjad ja teadusasutuste töötajad."}], "learning_outcomes": [{"en": "A. KNOWLEDGE, the students get:", "et": "A. TEADMISED, üliõpilasel on:"}, {"en": "Understanding of specific features and challenges of the knowledge-based entrepreneurship, entrepreneurial process, the role of knowledge in the entrepreneurial process. ", "et": "Arusaamine ettevõtluse eripäradest ja väljakutsetest, ettevõtlusprotsessist, teadmuse rollist ettevõtlusprotsessis. "}, {"en": "Overview of the knowledge-based entrepreneurship in Estonia and worldwide, trends on market. Business opportunities in Estonia and globally.", "et": "Ülevaade uute ettevõtete arengu sektoraalsetest seaduspärasustest, uus-ettevõtete olukorrast maailmas ja Eestis, trendidest turul. Ülevaade ärivõimalustest: Eestis ja globaalselt. "}, {"en": "Understanding of processes of launching knowledge.based startup, specific aspects of management and support processes, strategic options and growth paths. ", "et": "Arusaamine uute ettevõtte käivitamisest,  rahastamisest, juhtimis- ja tugiprotsesside eripäradest, strateegilistest valikutest ja kasvuvõimalustest."}, {"en": "B. SPECIAL SKILLS AND COMPETENCES, the student: ", "et": "B. ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane:"}, {"en": "Understands basic concepts and terminology of the knowledg-based business sector. ", "et": "Orienteerub teadmuspõhiste ettevõtte ärikontseptsioonides ja valdkonna põhimõistetes "}, {"en": "C. KEY SKILLS AND COMPETENCES, the student:", "et": "C. VÕTMEOSKUSED JA PÄDEVUSED, üliõpilane:"}, {"en": "Can analyze and shape knowledge-based entrepreneurial process, and strategy and business models for knowledge-based companies.", "et": "Oskab analüüsida ja kujundada teadmuspõhist ettevõtlusprotsessi ja ettevõtte strateegiat ning ärimudelit teadmuspõhistes ettevõttes."}], "notes": {}}, "grading": {"independent_work": {"et": "Individuaalse või grupitööna Moodles etteantud kodutööde läbiviimine."}, "grade_preconditions": {"et": "To pass Entrepreneurship Part II. you should:\n\n1. Develop the final report - the business concept of your own start-up. \n\n2. Present the final project (the business concept of your own start-up) in class. \n\n3. Upload all home task on time.\n\n4.  Read materials from part I. and part II."}, "grade_evaluation": {"et": "To pass Entrepreneurship Part II. you should:\n\n1. Develop the final report - the business concept of your own start-up. \n\n2. Present the final project (the business concept of your own start-up) in class. \n\n3. Upload all home task on time.\n\n4.  Read materials from part I. and part II."}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "6f495099-6b59-a965-4320-a1b3d132f436", "person_name": "Iuliia Trabskaia", "structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "b9c11b70-0967-6cdf-38a7-331ab6395272", "person_name": "Mervi Raudsaar", "structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": false}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "2.1 Idea of Startup. Idea and Reality. Idea and Creativity"}}, {"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "2.2 Scan Environment. Analyse industry. Identify Opportunity. Recreate Idea"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "2.3 Protect Idea. Intellectual Property issue"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "2.4 Bring the Idea into the Market"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "2.5 Define Capital Needs and Get Funding"}}, {"work_type": {"code": "individual_lesson", "et": "individuaaltund", "en": "individual lesson"}, "topic": {}, "description": {"et": "2.6 Few Minutes can Define your Entrepreneurial Journey. Pitch and Presentation Strategy."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "ffe4bd5b-d2ad-59bf-aaef-5fb8ea0d9086", "parent_code": "SVMJ.02.013", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}