{"uuid": "6b203f75-ce05-5d17-911c-7da9ebe7ee6f", "code": "SVMJ.08.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-07-18T15:50:58", "title": {"en": "e-Estonia Masterclass", "et": "e-Eesti meistriklass"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ08", "structural_unit_name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The role of technology in solving complex problems in the public sector. Digital solutions and their challenges and implementation risks. Examples and lessons from e-Estonia digital solutions.", "et": "Tehnoloogia roll keeruliste probleemide lahendamisel avaliku sektori valdkonnas. Digilahendused ning nende väljakutsed ja rakendamise riskid. Näited ja õppetunnid e-Eesti digilahendustest."}, "objectives": [{"en": "The aim of the course is to define e-government and give a through-rough description of Estonian case in this frame. The concepts reviewed are: e-government and macro-, micro- and picaeconomics (Bannister), general economic topics for e-government among which to choose the cases that are discussed with practitioners of the field: public goods and government failure (markets, non-rival public goods & motivation for provision, incentives and government failure); digital economics and e-government (reduced search, replication, transportation, tracking, verification costs); ICT and public sector efficiency (demand articulation, transaction costs and access); learning and information (information economics, organizational learning); micro-level service supply topics (incentives and crowding out).", "et": "Õppeaine eesmärgiks on E-riigi mõiste määratlemine ja Eesti juhtumi kirjeldus ja analüüs selles raamistikus. Käsitletavad mõisted on seotud e-riigi ning makro-, mikro- ja pikaökonoomikaga (Bannister), e-riigi üldiste majandusteemadega, mille hulgast valida erinevate praktikute kaasabil analüüsitavaid näited: avalikud hüved ja valitsuse ebaõnnestumine (turud, mitte-konkureerivad avalikud hüved ja pakkumise tagamine, stiimulid ja valitsuse ebaõnnestumine); digiökonoomika ja e-riik (vähenenud otsingu-, paljundus-, transpordi-, jälgimis- ja kontrollikulud); IKT ja avaliku sektori tõhusus (nõudluse liigendamine, tehingukulud ja juurdepääs teenustele); õppimine ja kommunikatsioon (infomajandus, organisatsiooniline õppimine); mikrotasandi teenuste pakkumise teemad (stiimulid ja väljatõrjumine)."}], "learning_outcomes": [{"en": "After passing the course student knows thoroughly the story of e-Estonia and is able to explain it as a spokesperson.", "et": "Õppeaine läbinud õppija tunneb põhjalikult e-Eesti lugu ja suudab seda kõneisikuna selgitada."}, {"en": "Successful graduate of the course:", "et": "Kursuse edukalt läbinu: "}, {"en": "*\tUnderstands the interrelationships between technology and market failures, and, consequently, public intervention mechanisms;", "et": "* saab aru tehnoloogia ja turutõrgete omavahelistest seostest ning sellest tulenevalt riigi sekkumismehhanismidest; "}, {"en": "*\tCan see the possibilities of applying technologies to solve complex problems in specific areas of the public sector;", "et": "* oskab näha tehnoloogiate rakendamise võimalusi keeruliste probleemide lahendamiseks spetsiifilistes avaliku sektori valdkondades; "}, {"en": "*\tHas an overview of various challenges and risks of digital solutions;", "et": "* omab ülevaadet erinevatest digilahenduste väljakutsetest ja riskidest; "}, {"en": "*\tKnows thoroughly the story of e-Estonia and is able to explain it as a spokesperson.", "et": "* tunneb põhjalikult e-Eesti lugu ja suudab seda kõneisikuna selgitada."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}