{"uuid": "2fe83de8-52ae-815c-1105-204ea349ed0a", "code": "SVMJ.04.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-22T11:01:03", "title": {"en": "Futures Thinking and Scenario Planning", "et": "Tulevikumõtlemine ja tulevikustsenaariumite arendamine"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The Futures Thinking course provides a thorough examination of strategies and methodologies to anticipate and navigate future uncertainties. Covered topics encompass analyzing emerging trends, discerning weak and strong signals of the future, overcoming cognitive biases, and cultivating alternative perspectives through scenario planning. The course also emphasizes collaborative foresight exercises and real-world applications, preparing students to proactively engage with and influence future developments.", "et": "Tulevikumõtlemise kursus annab põhjaliku ülevaate erinevate strateegiate ja metoodikate kohta tulevikutrendides ja määramatustes navigeerimiseks. Kursus hõlmab tulevikutrendide analüüsimist, nõrkade ja tugevate tulevikusignaalide märkamist, kognitiivsete eelarvamuste ületamist ning alternatiivsete vaatenurkade kujundamist stsenaariumite planeerimise kaudu. Õpitavaid teemasid aitavad kinnistada koostööpõhised tulevikuharjutused ja praktiline kursuse projekt."}, "objectives": [{"en": "The aim of this course is to equip students with knowledge, tools, and methodologies in the direction of foresight, shaping proactive readiness for future trends and uncertainties via \"what if..?\" thinking.", "et": "Selle kursuse eesmärk on varustada õppijaid teadmiste, tööriistade ja metoodikatega tulevikumõtlemise suunal, kujundamaks proaktiivset valmisolekut tuleviku suunal alternatiivide stiilis \"mis siis kui..?\" mõtlemise läbi."}], "learning_outcomes": [{"en": "1. By the end of the course, students will be adept at working with various sources, critically assessing the reliability of different sources, capable of composing literature reviews, and demonstrating proficiency in the use of automated referencing software.\n2. Develop a comprehensive understanding of key concepts and methodologies related to foresight, enabling students to analyze and interpret future trends and uncertainties.\n3. Acquire practical skills in utilizing various tools and techniques for foresight, including scenario planning.\n4. Cultivate critical thinking and strategic foresight capabilities, empowering students to assess the potential impacts of emerging technologies, social changes, and global events on various sectors.\n5. Engage in collaborative foresight exercises and project, applying acquired knowledge and skills to real-world scenarios, and develop effective communication strategies for conveying foresight insights to diverse stakeholders.", "et": "Kursuse lõpuks:\n1. Suudavad õppijad osavalt töötada erinevate allikatega, kriitiliselt hinnata erinevate allikate usaldusväärsust, oskavad koostada kirjanduse ülevaateid, ning näitavad vilumust automatiseeritud viitamistarkvara kasutamisel.\n2. Omavad õppijad põhjalikku ülevaadet tulevikuga seotud põhikontseptsioonidest ja metoodikatest, võimaldades neil analüüsida ja tõlgendada tulevikutrende, signaale ning tuvastada kriitilisi määramatusi.\n3. Omandatakse praktilised oskused erinevate tööriistade ja tehnikate kasutamisel tulevikku suunatud mõtlemiseks, sealhulgas stsenaariumite planeerimiseks.\n4. Kujundatakse kriitilise mõtlemise ja strateegilise tulevikumõtlemise võimekust, võimaldades õppijatel hinnata uute tehnoloogiate, sotsiaalsete muutuste ja globaalsete sündmuste potentsiaalseid mõjusid erinevatele sektoritele.\n5. Läbi kursuse projekti ja erinevate harjutuste rakendatakse omandatud teadmisi ja oskusi reaalsetes stsenaariumides ning arendatakse tõhusaid suhtlusstrateegiaid tulevikuprognooside edastamiseks erinevatele osapooltele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}