{"uuid": "fd8fc83d-3d56-beb9-25b2-4d17de61bedc", "code": "SVMJ.08.010", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-21T10:37:52", "title": {"en": "Digital Public Finance and Service Development", "et": "Digitaalne riigirahandus ja teenuste arendus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ08", "structural_unit_name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Public digital services, principles of their design and examples of applications.", "et": "Avalikud digiteenused, nende kujundamise põhimõtted ja näited rakendustest."}, "objectives": [{"en": "Aim of the course is to introduce general principles and specific applications of service design in tax administration, education, health, social security and payments, financial services, civic engagement. It is desired to demonstrate radical and more diverse solutions and to discuss future possibilities with the help of practitioners.", "et": "Õppeaine eesmärgiks on selgitada avalike digiteenuste kujundamise üldpõhimõtteid ja konkreetseid rakendusi (nt maksuhalduses, hariduses, tervishoius, sotsiaalkindlustuses ja maksetes, finantsteenustes, kodanikuosaluses). Soovitakse demonstreerida julgemaid ja eriilmelisemaid lahendusi ning diskuteerida tulevikuvõimaluste üle praktikute kaasabil."}], "learning_outcomes": [{"en": "Successful graduate of the course understands the effects of technological developments in the design of public services.\nSuccessful graduate of the course:\n* Understands the effects of technological developments in the design of public services;\n* Can see the possibilities of applying technologies to solve complex problems in specific areas of the public sector;\n* Has an overview of various challenges and risks of digital solutions;\n* Can estimate the cost of investment in the creation of digital services.", "et": "Kursuse edukalt läbinu: \n* saab aru tehnoloogiliste arengute mõjudest avaliku sektori teenuste kujundamises; \n* oskab näha tehnoloogiate rakendamise võimalusi keeruliste probleemide lahendamiseks spetsiifilistes avaliku sektori valdkondades; \n* omab ülevaadet erinevatest digilahenduste väljakutsetest ja riskidest;   \n* suudab hinnata digitaalsete teenuste loomise investeeringute maksumust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}