{"uuid": "addbf0a6-10f1-c40c-9ea1-6ed2c24e4531", "code": "SVMJ.08.020", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Fuzzy Sets: Analysis, Systems & Applications", "et": "Sissejuhatus hägusate hulkade käsitlusse: analüüs, süsteemid ja rakendused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ08", "structural_unit_name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The topics discussed are the following:\n1. Possibilities of using fuzzy sets and fuzzy logic for modeling in economics and techniques \n2. Fundamentals of fuzzy modeling methodology\n3. Basic concepts of fuzzy set theory \n4. Sequence of main stages of fuzzy modeling\n5. Fuzzy inference rules and inference algorithms\n6. Review of computer tools and special software products for fuzzy modeling.", "et": "Käsitletavad teemad on järgmised:\n1. Hägushulkade ja hägusloogika kasutamise võimalused modelleerimisel majanduses ja ärijuhtimises\n2. Hägusate andmete modelleerimise metoodika alused\n3. Hägusate andmete hulgateooria põhimõisted\n4. Hägusate andmete modelleerimise põhietapid ja nende järjekord\n5. Hägusate andmete analüüsi järeldusreeglid ja järeldusalgoritmid\n6. Spetsiaalsete tarkvaratoodete ja tööriistade ülevaade."}, "objectives": [{"en": "This course provides a review of the theoretical foundations and applied methods of new modern technology of mathematical modeling of management, production, and broader economic problems - fuzzy modeling - in the context of solving practical problems of economic analysis, marketing, logistics, management, and creation and use of software and information technology. The purpose of the course is to provide practitioners and students, including masters, and graduate students with opportunities to learn the basics of fuzzy set theory and practical skills in fuzzy modeling.", "et": "See kursus annab ülevaate hägusate andmete problemaatika teoreetilistest alustest ja praktikas rakendatud uutest meetoditest kaasaegse juhtimise, tootmise ja laiemate majandusprobleemide käsitlemisel. Häguste andmete modelleerimine on väga vajalik just praktilise lahendamise kontekstis nii majandusanalüüsi, turunduse, logistika, juhtimise valdkondades. Kursuse eesmärk on vastavate analüüsiks kasutatavate tarkvarade võimaluste tutvustamine. Kursuse eesmärk on anda praktikutele ja üliõpilastele, sh magistrantidele ja doktorantidele võimalus õppida hägusate andmete hulgateooria põhitõdesid ja praktilisi oskusi hägusate andmete modelleerimise alal."}], "learning_outcomes": [{"en": "The course presents material selected and tested on real problems, which gives students the opportunity to independently determine the ways and methods of applying fuzzy modeling. It is envisaged to provide the necessary theoretical foundations to the extent necessary to understand the basic ideas of fuzzy modeling. The construction and analysis of fuzzy models of specific applied practical problems is aimed at illustrating the peculiarities of the implementation of fuzzy modeling, in particular in the MATLAB environment, and specialized tools to support fuzzy modeling.", "et": "Kursusel esitatakse reaalsete majandus- ja äriprobleemide valitud ja testitud käsitlus, mispakub üliõpilastele võimaluse iseseisvalt kasutada erinevaid analüüsiviise ja -meetodeid hägusate andmete analüüsiks. \nKursuse läbija omandab vajalikud teoreetilised alused põhiideede mõistmiseks ning konkreetsete rakenduslike mudelite konstrueerimiseks ja analüüsiks. \nKursuse läbija saab praktilise ülevaate probleemidest ja võimalustest seesuguste andmetega töötamisest ning spetsiaalsed tööriistad erinevate tarkvarade näol (MatLab, Excel jt)."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}