{"uuid": "a92d16b8-3763-4485-cde2-dba610475d51", "code": "SVMJ.05.005", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Macroeconomics", "et": "Makroökonoomika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ05", "structural_unit_name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ05", "name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This macroeconomics course covers following topics:\nPart I: determination of aggregate demand and supply, GDP and GNI; intertemporal decisions of households and firms (about consumption and investments); functioning of the labour market and unemployment; monetary economics (money supply and demand, banking, inflation); open economy framework (exchange rates and current account); long-run economic growth (Solow model). \nPart II: economic growth, convergence and business cycles; output determination in a closed and open economy (IS-LM framework); tradeoff between inflation and unemployment; stabilisation policy; government debt and budget deficit.", "et": "Makroökonoomika kursus annab ülevaate järgmistest teemadest:\nI OSA: SKP mõiste, mõõtmine ning kujunemine kogunõudluse ja kogupakkumise koosmõjul; jooksevkonto ja maksebilanss; rahaturu toimimise põhimõtted, inflatsioon ja selle mõjud; tööturu toimimise põhimõtted; majanduskasvu mõjurid pikal perioodil (Solow mudel).\nII OSA: Majandusarengu selle tsüklilisus; makromajandusliku tasakaalu kujunemine IS-LM mudeli raamistikus suletud ja avatud majanduses; majanduse lühiajaline stabiliseerimine eelarve- ja rahapoliitikaga; valitsuse eelarvedefitsiit ja riigivõlg."}, "objectives": [{"en": "To introduce students with modern macroeconomic concepts and models in order to understand the operation mechanisms of economy as whole, and possibilities to influence economic system with different policies.", "et": "Tutvustada üliõpilastele kaasaegseid makroökonoomika kontseptsioone ja mudeleid eesmärgiga mõista majanduse kui terviku toimimise mehhanisme ning võimalusi makromajandusliku tasakaalu mõjutamiseks erinevate poliitikatega."}], "learning_outcomes": [{"en": "Student who has passed the course:", "et": "Aine läbinud üliõpilase"}, {"en": "Professional competences:", "et": "Erialased pädevused:"}, {"en": "1) Knows the main research questions of macroeconomics and the economic models used in their research;", "et": "1) tunneb makroökonoomika peamisi uurimisküsimusi ning nende uurimisel kasutatavaid majandusmudeleid;"}, {"en": "2) Is able to analyze the economy in both the short term (cyclical fluctuations) and the long term (convergence and long-term economic growth);", "et": "2) oskab analüüsida makromajanduses toimuvat nii lühiperioodil (tsüklilised kõikumised) kui pikal perioodil (konvergents ja pikaajaline majanduskasv);"}, {"en": "3) Is able to solve standard exercises on the topics covered in the course both mathematically and graphically;", "et": "3) oskab lahendada kursusel käsitletud teemade kohta standardülesandeid nii matemaatiliselt kui graafiliselt;"}, {"en": "4) Knows the possibilities, necessity and outcomes of the implementation of various economic policies;", "et": "4) tunneb erinevate majanduspoliitiliste meetmete rakendamisvõimalusi, vajadust ja tagajärgi; "}, {"en": "5) Can critically assess the practical application possibilities of macroeconomic model;", "et": "5) oskab kriitiliselt hinnata makromajanduslike mudeli praktilisi rakendusvõimalusi;"}, {"en": "6) Is able to find and use macroeconomic statistics about Estonia and other countries.", "et": "6) oskab leida ja kasutada makromajanduslikku statistikat nii Eesti kui teiste riikide kohta;"}, {"en": "General competences and transferable skills:", "et": "Üldpädevused ja ülekantavad oskused:"}, {"en": "1) is able to find relevant scientific literature for analyzing specific m", "et": "1) oskab leida teemakohast teaduskirjandust kodutöö koostamiseks; 2) oskab analüüsida aktuaa"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}