{"uuid": "4f263e22-937b-27c0-1db3-b98826b24dd9", "code": "SVMJ.03.025", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-22T15:24:19", "title": {"en": "European Business Strategies and Intercultural Management", "et": "Rahvusvaheline ärikultuur: õppereis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The module consists a study tour to leading states of European Union to observe the international institutions, influencing European business environment. During the visits the main operating aspects of the institutions and their role in the business environment will be discussed. The module includes also company visits to discuss their adaptation to business environment changes.", "et": "Kursus hõlmab  õppereisi Euroopa juhtriiki tutvumaks Euroopa ettevõtluskeskkonda reguleerivate rahvusvaheliste institutsioonidega. Külastuste käigus tutvutakse institutsioonide erinevate tegevuse aspektidega ja rolliga ettevõtluskeskkonna kujundamisel. Samuti külastatakse ettevõtteid ja tutvutakse nende adapteerumisaspektidega ettevõtluskeskkonna  muutumisel ning kuulatakse loenguid kohalikus partnerülikoolis."}, "objectives": [{"en": "The module gives an overview of international institutions, influencing European business environment, their main operating aspects and impacts on companies' operations.", "et": "Anda teadmisi Euroopa ettevõtluskeskkonda reguleerivatest rahvusvahelistest institutsioonidest, nende tegevuspraktikast ja mõjust ettevõtete tegevusele."}], "learning_outcomes": [{"en": "Students acquire knowledge of business environment and communication about international, economic, political and cultural features and skills and experience for professional communication in a foreign language.", "et": "Kursuse läbinud omandavad teadmisi ärikeskkonna ja -suhtluse rahvusvahelistest, majanduslikest, poliitilistest ja kultuurilistest iseärasustest ning oskusi ja kogemusi erialaseks suhtlemiseks võõrkeeles."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}