{"uuid": "94509542-1c21-2474-8a7d-e61fada02554", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-12T11:16:44", "title": {"en": "Practical Training", "et": "Praktika"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ", "structural_unit_name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 76, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Students work in various institutions (ministries, Eesti Pank (central bank of Estonia) and other central banks, state agencies, think-tanks, international enterprises, universities, etc) on the study of a research problem proposed by the particular institution or the student(s). At the end of the practical training student(s) will submit the report of the practical training research, that includes also self-analysis. In addition to that student(s) will submit the assessment by the institution on his/her performance during the practical and feedback on the practical training process. The practical training will finish with the defence of the report of the practical training work. The format of the internship report may derive from the form of the internship organization or may be in the form of a logbook that describes the activities undertaken and the skills applied during the practical training according to the sample given. In addition to the report the student is expected to submit other materials, that would enable to understand and evaluate his or her practical training.", "et": "Töö asutustes ja organisatsioonides (ministeeriumid, Eesti Pank ja teised keskpangad, kommertspangad, riigiametid, uurimisasutused, rahvusvahelised suurettevõtted, ülikoolid jt.) asutuse või üliõpilas(t)e poolt välja pakutud uurimisprobleemi lahendamisel. Praktika lõpus esitab üliõpilane(sed) uurimistöö aruande, mis sisaldab ka eneseanalüüsi. Lisaks esitab üliõpilane praktikakoha hinnangu tema tegevusele ning tagasiside praktika protsessile. Praktika lõppeb praktika aruande kaitsmisega. Praktika aruande vorm võib tuleneda praktika organisatsiooni poolsest vormist või võib olla logiraamatu kujul, kus kirjeldatakse praktika käigus läbiviidud tegevusi ja omandatud oskusi vastavalt etteantud näidisele. Lisaks võiks üliõpilane prakatikaaruandele lisada muud materjalid, mis võimaldavad mõista ja hinnata tema praktikat."}, "objectives": [{"en": "The aim of the practical training is to apply obtained theoretical skills for the empirical or theoretical study of actual economic problems and for offering solutions to it.", "et": "Praktika eesmärgiks on rakendada õpitud teoreetilisi teadmisi reaalsete majandusprobleemide empiirilisel või teoreetilisel uurimisel ja lahendamisel."}], "learning_outcomes": [{"en": "* Ability to collect and analyze information and empirical data on the considered economic problem and by using these to describe the particular economic problem", "et": "*\tOskus käsitletava majandusprobleemi kohta informatsiooni ja andmeid koguda ning süstematiseerida, ja selle alusel kirjeldada käsitletavat majandusprobleemi"}, {"en": "* Ability to work with the economics literature", "et": "*\tOskus töötada erialakirjandusega "}, {"en": "* The ability to apply various studied research methods in order to solve the particular research problem, the ability to interpret and explain the obtained research results", "et": "*\tOskus rakendada uurimisprobleemi lahendamiseks erinevaid õpitud uurimismeetodeid, saadud tulemusi interpreteerida ja selgitada."}], "notes": {"et": "In agreement with lecturer / Kokkuleppel õppejõuga"}}, "grading": {"independent_work": {"et": "The student must either compile a written research report or a reflection logbook after completing the internship. The written research report can follow the form of the internship organization. An example of the logbook can be found under study materials and it should describe the internship activities and the obtained skills according to the example. In addition to the report the student is expected to submit other materials, that would enbale to understand and evaluate his or her practical training. / \nÜliõpilane peab peale praktika läbimist esitama kas kirjaliku uurimisraporti või aruande logiraamatu kujul. Uurimistöö kirjalik raport võib järgida praktika organisatsiooni vormi. Logiraamatu näide on leitav õppematerjalide all. Logiraamatus kirjeldatakse praktika käigus läbiviidud tegevusi ja omandatud oskusi vastavalt etteantud näidisele. Lisaks võiks üliõpilane prakatikaaruandele lisada muud materjalid, mis võimaldavad mõista ja hinnata tema praktikat."}, "independent_work_assessments": [{"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "The performance at the internship will be evaluated in the defence of the practical training based on the practical training report and the student's presentation of the latter. The assesment of the practical training will be based on: 1) submitted internship report - feedback for the report; 2) feedback from the internship supervisor - questionnaire at the UT School of Economics and Business Administration practical training webpage (https://sisu.ut.ee/internship); 3) feedback from the internship process and submitted proposals (in the final internshipp seminar) - predetermined questions. The final seminar of the internship must be attended by all students and they are to listen to each other's presentations. /\nPraktika sooritamist hinnatakse peale selle läbimist toimuval praktika kaitsmisel lähtudes praktika aruandest ja üliõpilase ettekandest. Praktika hindamise aluseks on: 1) esitatud praktika aruanne - tagasiside aruandele; 2) saadud tagasiside praktikajuhendajalt - küsimustik TÜ majandusteaduskonna praktika lehel (https://sisu.ut.ee/internship); 3) antud tagasiside praktikaprotsessile ja tehtud ettepanekud (lõpuseminaris) - etteantud küsimused. Praktika lõpuseminaril peavad osalema kõik üliõpilased ja kuulama üksteist."}}], "grade_preconditions": {"et": "The assessment will be based on the report of the practical training and its defence, feedback from the internship supervisor, feedback on the internship process. /\nHindamine põhineb praktikaaruandel ja selle kaitsmisel, tagasisidel praktikajuhendajalt, tagasisidel praktikaprotsessile."}, "grade_evaluation": {"et": "Internship report/logbook along with an official evaluation from the place of internship (time of internship, evaluation of the performance of internship task and activities of the intern) to be submitted in Moodle. / \nPraktika raport uurimisraporti või logiraamatu kujul koos praktikakoha hinnanguga tema tegevusele (praktika aeg, praktika ülesannete sooritamine, ülevaade tegevustest). Materjalid esitatakse Moodle keskkonnas."}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "95429ef7-7b37-5b9b-44d5-28748fd0a226", "person_name": "Jaan Masso", "structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "fc841f44-66b2-572d-15e3-7b8161d88254", "person_name": "Krista Jaakson", "structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "6f495099-6b59-a965-4320-a1b3d132f436", "person_name": "Iuliia Trabskaia", "structural_unit": {"code": "SVMJ02", "name": {"en": "Chair of Entrepreneurship", "et": "ettevõtluse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {"et": "Master students of the Quantitative Economics master’s programme"}, "min_students": 10}, "parent_uuid": "4916f627-9d59-9809-244b-32b27ec7d9e0", "parent_code": "SVMJ.04.022", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}