{"uuid": "8c6a25c2-982f-fdb0-d5e5-72eb0d139233", "code": "SVMJ.03.013", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Management", "et": "Juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Management is an intensive, interactive and practical course that consists of three modules: manager and employee (managerial roles, managerial job, values, attitudes, work motivation, organisational culture), manager and team (project management, group development and group roles, trust in team), and manager and organization (financial management, strategic management, analysis of external and internal environment). \nTo complete this course in volume 3 ECTS the student chooses two modules out of three. \n\nThe course is based on various interactive, creative and analytical methods of teaching (i.e. set of lectures, seminars, written assignments, group assignments). The participants are expected to prepare for every class in accordance of the proposed plan.", "et": "Juhtimine on intensiivne, interaktiivne ja praktiline kursus, kus käsitletakse integreeritult kolme moodulit: juht ja töötaja  (juhi rollid, juhi töö, väärtused, hoiakud, töömotivatsioon,organisatsioonikultuur), juht ja meeskond (projektijuhtimine, grupi areng ja rollid grupis, usaldus meeskonnas) ning juht ja organisatsioon (finantsjuhtimine, strateegiline juhtimine, välis- ja sisekeskkonna analüüs). \n3 EAP mahus aine läbimiseks valib üliõpilane  eelpoolmainitud moodulitest kaks.\n\nAines rakendatakse erinevaid interaktiivseid, loomingulisi ja analüüsivõimet arendavaid õppemeetodeid (suhtluspõhine loeng, seminar, kirjalik kodutöö, essee, kaasusanalüüs, grupitöö). Eeldatakse, et kursusel osalejad valmistuvad loenguteks ja seminarideks ette, tutvudes eelnevalt vastava kirjandusega või koostades seminarideks kirjalikke kodutöid."}, "objectives": [{"en": "The aim of the course is to acquire and develop managerial knowledge and skills for understanding and managing teams and organizations.", "et": "Juhtimise aine eesmärgiks on omandada ja arendada juhi tööks vajalikke teadmisi ja oskusi, mis võimaldavad mõista ja juhtida meeskondade ja organisatsioonide tegevust."}], "learning_outcomes": [{"en": "The student who has successfully completed this course in volume 6 ECTS has acquired all following learning outcomes and student who has successfully passed this course in volume 3 ECTS has acquired four learning outcomes out of the following:", "et": "6 EAP mahus aine edukalt läbinud üliõpilane on omandanud kõik aine õpiväljundid ning 3 EAP mahus aine edukalt läbinud üliõpilane on omandanud neli õpiväljundit järgnevast:"}, {"en": "1. Understands the values, attitudes and motivation of an individual related to work and work environment as well as their impact on the functioning of the organisation.", "et": "1. Mõistab indiviidi töö ja töökeskkonnaga seotud väärtusi, hoiakuid ja motivatsiooni ning nende mõju organisatsiooni toimimisele."}, {"en": "2. Understands organisational culture and how human resources policies affect it.", "et": "2. Mõistab organisatsioonikultuuri olemust ja selle kujundamist läbi personalipoliitika"}, {"en": "3. Understands the phases of Project Management, team and team functioning principles and has acquired teamwork experience.", "et": "3. Omab ülevaadet projektijuhtimise etappidest, mõistab grupi ja meeskonna toimimise põhimõtteid ning on omandanud meeskonnatöö kogemuse."}, {"en": "4. Has solved the problems related to organisational communication, including those affecting organisational image.", "et": "4. On lahendanud organisatsioonikommunikatsiooni sõlmküsimusi, mh organisatsiooni kuvandi seisukohalt."}, {"en": "5. Is able to see the organisation in its entirety and is able to analyse its environment.", "et": "5. Oskab näha organisatsiooni tervikpilti, sh mõistab organisatsiooni keskkonda ja oskab seda analüüsida."}, {"en": "6. Understands the basic principles of financial management of an organisation and indicators of economic performance in the context of strategic management.", "et": "6. Mõistab organisatsiooni finantsjuhtimise põhiprintsiipe ja majandustegevuse tulemuslikkuse näitajaid strateegilise juhtimise kontekstis."}, {"en": "Additionally, the student is able to creatively formulate theoretical and practical problems of organisational management and offer solutions to them.", "et": "Lisaks on üliõpilane võimeline loovalt formuleerima organisatsiooni juhtimise teoreetilisi ja praktilisi probleeme ning pakkuma neile lahendusi, näidates üles kriitilist mõtlemist, vastutustunnet ja innovaatilisust."}, {"en": "Upon completion of the course in volume 6 ECTS the student has applied selected methods of managerial work in (knowledge-intensive) organization.", "et": "Aine läbimisel 6 EAP mahus on üliõpilane rakendanud (teadmusmahuka) organisatsiooni juhi/liidri töövõtteid"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}