{"uuid": "59dcb8ea-bb47-b9ed-28cb-8e51c9b47be5", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-27T16:13:33", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 20, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV Eng", "et": "24/25 S PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ", "structural_unit_name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 520, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The Master's thesis is an independent research project, written by the student in cooperation with his or her supervisor or supervisors in order to successfully complete the master's program. The subject of the Master's thesis must be related to the subjects of the master's programme. The student defends the Master's thesis in front of a commission, preceded by a pre-defense.\nThe thesis is compiled according to the rules of the University of Tartu.", "et": "Magistritöö on iseseisev uurimistöö, mille tudeng kirjutab koostöös oma juhendaja või juhendajatega magistritõppekava edukaks lõpetamiseks. Magistritöö teema peab olema seotud õppekava teemadega. Tudeng kaitseb magistritöö komisjoni ees. Magistritöö kaitsmisele eelneb eelkaitsmine.\nMagistritöö koostatakse vastavalt Tartu Ülikoolis kehtivatele nõuetele."}, "objectives": [{"en": "The aim of the Master's thesis is to prepare the student for an academic career. The aim is to demonstrate student's ability to conduct individual research based on the curriculum topics and academic research principles. The aim of the Master's thesis is to develop student's ability to set up a research question, to position the research topic within the academic field, to develop the skills of data collection and critical analysis, and the ability of academic writing.", "et": "Magistritöö eesmärgiks on valmistada tudeng ette akadeemiliseks karjääriks. Eesmärk on demonstreerida tudengi võimekust läbi viia individuaalset uurimistööd lähtudes õppekava teemadest ja teadustöö põhimõtetest. Magistritöö eesmärk on arendada tudengi võimekust püstitada teaduslikust huvist ja vajadusest lähtuv uurimisküsimus, positsioneerida uurimisteema akadeemilise kirjanduse raames, arendada andmete kogumise ja kriitilise analüüsimise oskust ja akadeemilise kirjutamise oskust."}], "learning_outcomes": [{"en": "Defended MA thesis confirms that student is able", "et": "Kaitstud magistritöö tõendab, et tudeng on suuteline"}, {"en": "- to devise a realistic programme of research into a topic;", "et": "- looma realistliku uurimiskava oma uurimistöö teemal;"}, {"en": "- to collect, select and review relevant background literature;", "et": "- koguma, organiseerima ja läbi töötama töö teema seotud akadeemilist kirjandust;"}, {"en": "- to identify and gather research data (i.e. from original language sources, memoirs, interviews, the media, archives, government reports);", "et": "- määratlema ja koguma uurimisandmeid (nt originaalkeelsed allikad, memuaarid, intervjuud, meediatekstid, arhiivimaterjalid, valitsusdokumendid);"}, {"en": "- to understand and select the appropriate methodology for dealing with sources and data;", "et": "- mõistma ja välja valima sobiliku metodoloogia oma uurimistöö jaoks;"}, {"en": "- to apply these methods (e.g. historical analysis, content analysis, discourse analysis, questionnaires, interviews, participant observation);", "et": "- rakendama oma uurimistöös korrektselt neid meetodeid (nt. ajalooline analüüs, kontentanalüüs, diskursuseanalüüs, küsimustikud, intervjuud, osalusvaatlus);"}, {"en": "- to organise the data collected and analyse your findings;", "et": "- organiseerima oma andmestikku ja analüüsima oma uuringutulemusi;"}, {"en": "- to write up an original research report, present research methodology and findings/results to academic and professional audience;", "et": "- kokku kirjutama originaalsed uurimistulemused, presenteerides selgelt metodoloogiat ja sellekohast tulemuste analüüsi akadeemilisele ja erialasele auditooriumile;"}, {"en": "- to be self-critical about your findings and the limitations of your analysis.", "et": "- olema enesekriitiline oma tulemuste analüüsimisel ja uurimistöö piirangute hindamisel."}], "notes": {"et": "A Master's Thesis can be admitted to final defense:\n- if the supervisor of the thesis agrees that the thesis is ready to defend\n- if there is no plagiarism according to the rules of UT on academic fraud"}}, "grading": {"independent_work": {"et": "The student writes his or her thesis under the guidance of his supervisor or supervisors. Pre-defense preceds the thesis' defence."}, "grade_preconditions": {"et": "The courses in the curriculum (except Master's thesis) should be completed. The Master's thesis course requirements and deadlines should be respected. Students should be aware that they will not be permitted to submit their final Master's thesis unless a full draft has been seen and reviewed by their supervisor. The full draft must be submitted by the agreed deadline."}, "grade_evaluation": {"et": "The final grade depends on the quality of the Master's thesis. It is decided by the thesis committee, who takes into account the opponents' and supervisors' opinions."}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "3a7f7d39-a31d-65f6-3ba7-ef42f05639c3", "person_name": "Eva Liias", "structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "5-41"}}, "registration_info": {"audience": {"et": "Students of the curriculum \"Contemporary Asian and Middle Eastern Studies\""}}, "parent_uuid": "defae8de-7fb1-5233-3761-0f57a62ed80d", "parent_code": "SVMJ.00.024", "parent_credits": 20, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}