{"uuid": "25b9be57-1a74-8ed0-5ef3-d0300ae43f89", "code": "SVMJ.03.016", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Designing Organization and Strategy", "et": "Organisatsiooni ja strateegia kavandamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides the theoretical and practical knowledge and experiences about strategic management, organizational theory and culture. The focus is on the central ideas, concepts and problems in organizational theory, that have been most discussed and influential. Within the course sustainable and responsible management principles are addressed. The collaboration with the firms takes place in order to analyze the real-life problems.", "et": "Õppeaines käsitletakse organisatsiooniteooria põhikontseptsioone ning organisatsiooni kujundamise võtteid. Aine annab teadmised organisatsioonide adapteerumisest ning seda mõjutavatest kontekstuaalsetest ja organisatsioonisisestest teguritest. Samuti käsitletakse jätkusuutliku juhtimise olemust ja rolli organisatsiooni konkurentsivõime tagamisel. Aines tehakse koostööd ettevõtetega, et analüüsida organisatsioonide reaalelulisi probleeme."}, "objectives": [{"en": "To give an overview of strategic management and organizational theory and culture  as a research field and as a practical tools for managing organization.", "et": "Aine eesmärgiks on anda ülevaade juhtimist toetavatest organisatsiooniteooria ja -kultuuri ning strateegia praktilistest meetmetest."}], "learning_outcomes": [{"en": ".Know and are able to use the main concepts of organizational theory and culture.\nUnderstands the role of national/societal culture for the organizations.\nKnows the main principles how the organizations adjust to the environment from the perspective of strategic planning and implementations of strategy.\nKnow how to solve complex and unstructured organizational problems from perspectives of structure, technology.\nKnow how to apply the organizational theory when analyzing management and performance problems..\nAre able to express (including the written format) their opinions about the functioning of organizations.\nKnows and understands the main problems and trends how to develop sustainable and responsible organization.", "et": "Aine edukalt läbinu:  \n* tunneb ja oskab kasutada organisatsiooniteooria põhikontseptsioone ning mõistab (rahvus)kultuuri rolli organisatsioonis;\n* teab organisatsiooni adapteerumise teoreetilisi ja praktilisi aluseid (strateegiline planeerimine ja strateegia rakendamine); \n* on harjutanud organisatsioonide võrdlevat analüüsi eri aspektidest (struktuur, tehnoloogia, kultuur, strateegia);\n* on analüüsinud organisatsiooni adapteerumisega seotud praktilist kaasust;\n* mõistab vastutustundliku ja jätkusuutliku juhtimise tähtsust organisatsioonis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}