{"uuid": "591c1c58-11b3-9da8-21cf-872dbc659d06", "code": "SVMJ.05.006", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Microeconomics", "et": "Mikroökonoomika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ05", "structural_unit_name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ05", "name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course is divided into two parts. The first part of the course, which represents one third of the total volume of the course, uses verbal and graphical tools to introduce microeconomic research methods. In addition to the mainstream approach of microeconomics, the first part of the course introduces a behavioral economics and classroom experiments will be conducted.\nIn the second part of the course, which represents two thirds of the total volume of the course, mathematical models are used in addition to verbal and graphical tools.\nAt first the course deals with the problems of utility maximization and optimal choice. Issues of individual and market demand and equilibrium will be analysed. Special treatment will be given to questions considering cost minimization and profit maximization problems. Asymmetry of information will be analysed. Further the course gives a closer look at different market structures and the influence of market structure on market outcome. The variety of market structures will be analysed. Issues, such as differentiation of the product, advertising, price discrimination, mergers, market entry barriers, and innovative activity will be analysed. In the analysis of market structures, models of game theory are used to analyze strategic interaction.", "et": "Kursus jaguneb kaheks osaks.\nKursuse eimeses osas, mis moodustab ühe kolmandiku kursuse kogumahust kasutatakase verbaalseid ja graafilisi vahendeid mikroökonoomika uurimismeetodite tutvustamiseks. Lisaks majandusteaduse peasuuna käsitlusele tutvustatakse kursuse esimeses osas ka käitumusliku majandusteaduse lähenemist ja viiakse läbi klassruumieksperimente.\nKursuse teises osas, mis moodustab kaks kolmandiku kursuse kogumahust kasutatakse lisaks verbaalsetele ja graafilistele vahenditele ka matemaatilisi mudeleid.\nEsmalt leiavad käsitlemist kasulikkuse maksimeerimise ja optimaalse valikuga seotud küsimused. Vaatluse alla tulevad individuaalse nõudluse ja turunõudluse ning turutasakaalu kujunemisega seotud küsimused. Eraldi käsitlemist leiavad kasumi maksimeerimise ja kulude minimeerimisega seotud probleemid. Samuti analüüsitakse informatsiooni asümmeetriat. Edasi käsitletakse turgude struktuuri määravaid tegureid ning struktuuri mõju turgude toimimisel. Käsitletakse ettevõtete suuruste struktuuri, selle põhjuseid ning mõju turule. Analüüsitakse turgude ja tööstusharude erinevaid mudeleid ning ettevõtte käitumisega seotud küsimusi nagu toote mitmekesistatus, reklaam, hinna diskrimineerimine, ühinemised, sisenemisbarjäärid turule ning innovaatiline tegevus. Turustruktuuride analüüsimisel kasutatakse strateegilise vastasmõju analüüsimiseks mänguteoreetilisi mudeleid."}, "objectives": [{"en": "The aim of the course is to provide students with skills for understanding the problems of microeconomics. Knowledge and competencies acquired during the course will make an important basis for understanding the problems of individual production and consumption decisions. Successful students will have systematic understanding of the issues concerning behaviour of consumers and produces in the market, the formation of prices and quantities in the market, and the optimum use of limited resources.", "et": "Õppeaine varustab üliõpilase oskuste pagasiga mikroökonoomika probleemistiku mõistmiseks. Aine raames omandatavad teadmised ja loodavad pädevused on oluliseks baasiks individuaalsete tootmis- ja tarbimisotsuste tegemisel ning kitsama suunitlusega majandusliku sisuga ainete edukaks läbimiseks. Kursuse edukalt läbinud üliõpilane omab süsteemset arusaamist tarbijate ja tootjate käitumisest turul, hindade ja koguste kujunemisest turul ning piiratud ressursside optimaalsest kasutamisest."}], "learning_outcomes": [{"en": "1. Has an overview of microeconomic research methods and understands how economy operates under limited resources.", "et": "1. Tunneb mikroökonoomika uurimismeetode ja mõistab, kuidas toimib majandus piiratud ressursside tingimustes."}, {"en": "2. Explainsthe behaviour of consumers and producers in the market with theoretical microeconomic models.", "et": "2. Selgitab tarbijate ja tootjate käitumist turul kasutades teoreetilisi mikroökonoomika mudeleid."}, {"en": "3. Analyses the formation of market prices and quantities applying verbal, graphic and mathematical models.", "et": "3. Analüüsib hindade ja koguste kujunemist kasutades verbaalseid, graafilisi ja matemaatilisi mudeleid."}, {"en": "4. Can critically assess the practical application possibilities of microeconomic model.", "et": "4. Hindab kriitiliselt mikroökonoomika praktilise rakendamise võimalusi."}, {"en": "5. Is able to use the acquired knowledge for further studies and professional work.", "et": "5. Oskab kasutada omandatud teadmisi edasistes õpingutes ja erialases töös."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}