{"uuid": "406ce887-b886-c9c6-8a7d-e0f70e45c216", "code": "SVMJ.06.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Fundamentals of Green Finance", "et": "Rohelise rahanduse alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ06", "structural_unit_name": {"en": "Chair of Finance and Accounting", "et": "rahanduse ja majandusarvestuse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ06", "name": {"en": "Chair of Finance and Accounting", "et": "rahanduse ja majandusarvestuse õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course delves into the pivotal role of finance in shaping environmental sustainability. It provides a comprehensive exploration of green financing and investment products, highlighting their distinctions from conventional financial products and addressing the associated issues and challenges in their creation and utilization. The course also tackles the concern of greenwashing within the financial context. Throughout the program, Estonian financial practitioners make significant contributions by sharing their practical experience in developing green financial solutions.", "et": "Õppeaines käsitletakse rahanduse rolli keskkonnaalase jätkusuutlikkuse kujundamisel. Süvendatult käsitletakse erinevaid rohelisi finantseerimis- ja investeerimistooteid, nende eripärasid võrreldes tavapäraste finantstoodetega ning taoliste roheliste toodete arendamise ja kasutuselevõtuga seonduvad probleeme ja väljakutseid. Samuti käsitletakse rohepesu problemaatikat rahanduse kontekstis. Õppeaine läbiivimisel on märkimisväärne panus ka Eesti finantspraktikutel, kes jagavad roheliste finantslahenduste väljatöötamise kogemust."}, "objectives": [{"en": "The course aims to familiarize participants with the main concepts, trends, and challenges in the field of Green Finance through the prism of green financial products.", "et": "Aine eesmärgiks on anda ülevaade rohelise rahanduse valdkonna peamistest kontseptsioonidest, trendidest ja väljakutsetest läbi roheliste finantstoodete prisma."}], "learning_outcomes": [{"en": "Upon completing the course, participants will: ", "et": "Kursuse läbimisel osalejad:"}, {"en": "- understand the significance of sustainability and the primary sustainability challenges in financial decision-making; ", "et": "- mõistavad jätkusuutlikkuse ja peamiste jätkusuutlikkusega seonduvaid väljakutsed finantsotsuste langetamisel; "}, {"en": "- establish a connection between climate change science and finance;", "et": "- oskavad siduda omavahel kliimateaduse ja rahanduse;"}, {"en": "- acquire knowledge of key terms, metrics, and financial instruments related to sustainability;", "et": "- omandavad teadmisi jätkusuutlikkuse valdkonnaga seotud võtmeterminitest, näitajatest ja finantsinstrumentidest;"}, {"en": "- gain insights into the barriers to green finance and the challenges of transforming conventional financial products and services into environmentally-friendly ones;", "et": "- omandavad ettekujutuse rohelise rahandusega seotud takistustest ja tavapäraste finantstoodete ja -teenuste transformeerimisest keskonnasõbralikeks toodeteks ja teenusteks;"}, {"en": "- recognize the issue of greenwashing in finance.", "et": "- mõistavad rohepesu probleemi rahanduses."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}