{"uuid": "561c468f-f291-3206-a48d-9e16d39fcaa8", "code": "SVMJ.04.018", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Economics of Causality", "et": "Põhjuse ja tagajärje seosed"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This course provides an introduction to the following methods: the Rubin model; difference-in-differences methods; propensity score matching; RA, IPW and IPWRA; regression discontinuity design; other evaluation and policy analysis methods. The second part of the course mainly deals with ex-post evaluation methods, ex randomised controlled trials, quasi-experimental methods (DiD, RDD, IVs), panel- and cross-sectional regressions. During the course we will also discuss the requirements for policy evaluations in practice that are regulated. In the end of the course, students will design a research plan to answer research questions for causal inference for the best possible outcome based on real world scenarios.", "et": "Kursus annab sissejuhatuse järgmistesse meetoditesse: Rubini mudel; Diferents-diferents hindamine; Tõenäosuspõhine sobitamine; Regressiooni kohandamise (RA), tõenäosuslik pöörd-kaalumine (IPW) and (IPWRA); regressioonikatkestuse meetod; muud hindamis- ja poliitikaanalüüsi meetodid. Peamiselt käsitletakse aines järelhindamiseks rakendatavaid meetodeid, näiteks kontrollitud eksperimendid, pool eksperimentaalsed lähenemised (DiD, RDD, instrumentaalmuutuja), paneel- ja ristandmete regressioonid. Kursuse käigus tutvume nõuetega poliitikakujundamise jaoks kehtivate nõuetega mõjude hindamiseks. Kursuse lõpuks disainivad üliõpilased ise vastavalt uurimisküsimusele parima võimaliku lähenemise mõjude hindamiseks koostades uuringuplaani."}, "objectives": [{"en": "The main objective of the course is that students are exposed to and are able to apply the most used methods to elicit and measure causal relationships in social phenomena.", "et": "Kursuse põhiliseks eesmärgiks on tutvustada üliõpilastele ja õpetada neid rakendama enim kasutatavaid meetodeid sotsiaalsete fenomenide põhjuslike seoste mõõtmiseks."}], "learning_outcomes": [{"en": "Students learn the main theoretical underpinnings and the main technical aspects of: the Rubin model; difference-in-differences methods; propensity score matching; RA, IPW and IPWRA; regression discontinuity design; other evaluation and policy analysis methods.", "et": "Üliõpilased õpivad järgmiste meetodite põhilisi teoreetilisi aluseid ja põhilisi tehnilisi aspekte: Rubini mudel; diferents-diferents hindamine; tõenäosuspõhine sobitamine; regressiooni kohandamise (RA), tõenäosuslik pöörd-kaalumine (IPW) ja (IPWRA); regressioonikatkestuse meetod; muud hindamis- ja poliitikaanalüüsi meetodid."}, {"en": "Students who pass the course:", "et": "Aine läbinud üliõpilased:"}, {"en": "*\tAre familiar with the main assumptions to design their research and apply most widely used tools for causal inference.", "et": "*\tTeavad mõjuhindamise peamisi eeldusi uuringute disainimiseks ning rakendamiseks."}, {"en": "*\tKnow the basics about policy evaluation regulations in Estonia.", "et": "*\tTunnevad Eesti poliitikakujundamisel kehtivaid nõudeid mõjude hindamiseks."}, {"en": "*\tAre able to choose the most appropriate from above for a particular dataset and research question.", "et": "*\tOskavad valida ülaltoodud meetoditest kõige sobivama konkreetse andmestiku ja uurimisküsimuse jaoks."}, {"en": "*\tAre able to write a code in Stata in order to produce descriptive statistics, run an econometric model and test hypotheses.", "et": "*\tOn võimelised kirjutama koodi Stata tarkvarapaketis genereerimaks kirjeldavaid statistikuid, hindamaks ökonomeetrilisi mudeleid, testimaks hüpoteese."}, {"en": "*\tHave developed their ability to interpret statistics, output from econometric models and the results from hypothesis tests.", "et": "*\tOn arendanud oma oskusi interpreteerimaks statistikuid, ökonomeetrilise mudeli hindamise tulemusi, hüpoteeside testimise tulemusi."}, {"en": "*\tKnow about common issues regarding ex-post and ex-ante evaluations and mainly used methods.", "et": "*\tTeavad, mis on levinumad probleemid eel- ja järelhindamisel ning mis meetodid võimalikud on. "}, {"en": "*\tCan critically evaluate impact evaluation studies.", "et": "*\tOskavad kriitiliselt hinnata mõjusid hindavaid uuringuid."}, {"en": "*\tHave developed their critical thinking when reading and appraising a research paper.", "et": "*\tOn arendanud oma kriitilist mõtlemist läbi teadusartiklite lugemise ja hindamise."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}