{"uuid": "e3036778-fff2-bc07-70c8-9eaf3ce1476c", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-27T09:38:39", "title": {"en": "Innovation in the Public Sector and Economic Policy Making", "et": "Innovatsioon avalikus sektoris ja majanduspoliitika kujundamises"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ08", "structural_unit_name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The Innovation Policy course is an excellent opportunity to introduce students to the theory of innovation in the context of the public sector, thus opening up the nuances of policy-making and the opportunities (and also the boundaries) for vertical as well as cross-policy and cross-sectoral action.\n\nThe choice between the various mechanisms available to countries is often full of controversial arguments, which is why the course discusses the roles of the public, private and third sectors and the models for cooperation in increasing the effectiveness of policies. Opportunities and ways in which the state can increase the competitiveness of companies through its innovation policy, as well as modernize its own processes and services, will also be discussed. The nature and possibilities of experimental economic policy are also addressed.\n\nThe course consists of 16 academic hours divided into four central topics. To begin with, the trends and so-called hard facts will be discussed, which will create a context for both economic policy and innovation in the public sector. Next, innovation theory, its nature and innovation management in the private, public and third sectors will be undertaken. The third part of the lecture cycle focuses more specifically on innovation policy and innovation systems and related techniques in economic policy-making. The fourth part of the subject focuses on public entrepreneurship, its possibilities, the factors that boost or hinder it, and change management in the wider public sector.", "et": "Innovatsioonipoliitika kursus on suurepärane võimalus tutvustada tudengitele innovatsiooniteooriat avaliku sektori kontekstis, avades seeläbi poliitikakujundamise telgitaguseid ning võimalusi (ja ka piire) nii vertikaalseks kui ka valdkondade ja sektorite üleseks tegutsemiseks.\n\nSageli ongi valik riikide käes olevate erinevate mehhanismide vahel täis vastuolulisi argumente, mistõttu arutletaksegi kursusel avaliku-, era- ja kolmanda sektori rollide ning koostöömudelite üle poliitikate mõjususe suurendamisel. Teemaks võetakse nii eksperimentaalne majanduspoliitika kui ka võimalused ja viisid, kuidas saab riik oma innovatsioonipoliitika abil ettevõtete konkurentsivõimet suurendada ning ka iseenda protsesse ja teenuseid ajakohastada.\n\nKursus koosneb 16 akadeemilisest tunnist, mis jagunevad nelja keskse teema vahel. Alustuseks leiavad käsitlemist trendid ja nö ausad faktid, mis loovad konteksti nii majanduspoliitikale kui ka innovatsioonile avalikus sektoris. Järgmiseks võetakse ette innovatsiooniteooria, selle olemus ja innovatsioonijuhtimine era-, avalikus ning vabasektoris. Loengutsükli kolmas osa keskendub konkreetsemalt innovatsioonipoliitikale ja innovatsioonisüsteemidele ning nendega seotud tehnikatele majanduspoliitika kujundamisel. Õppeaine neljandas osas on fookuse all ettevõtlikkus, selle võimalikkus, seda soodustavad ja takistavad tegurid ning muutuste juhtimine laiemalt avalikus sektoris."}, "objectives": [{"en": "The aim of the course is to deepen the knowledge of strategic management students about various aspects of innovation and economic policy that affect both the competitiveness of the economy and the innovativeness of the public sector itself.", "et": "Kursuse eesmärgiks on süvendada strateegilise juhtimise tudengite teadmisi erinevatest innovatsiooni- ja majanduspoliitika aspektidest, mis mõjutavad nii majanduse konkurentsivõimet kui ka avaliku sektori enda uuendusmeelsust."}], "learning_outcomes": [{"en": "The student successfully passing the course:", "et": "Aine eduka sooritamise tulemusena üliõpilane:"}, {"en": "1. Understands and analyses the innovation capacity and branch specifics of various public sector institutions, organisations, municipal or state enterprises and offers solutions for the development of their innovation capacity.", "et": "1. Mõistab ja analüüsib erinevate avaliku sektori asutuste, organisatsioonide, munitsipaal- või riigiettevõtete innovatsioonivõimekust ning haruspetsiifikat ja pakub lahendusi konkreetse asutuse, riigiettevõtte või valdkonna innovatsioonivõimekuse arendamiseks;"}, {"en": "2. Understands the core problems of economy and public administration and their complexity, analyses and proposes solutions from the toolbox of innovation policy and experimental economic policy.", "et": "2. Mõistab majandus ja riigijuhtimise tuumikprobleeme ning nende komplekssust, analüüsib ja pakub välja lahendusi innovatsiooni- ja eksperimentaalse majanduspoliitika tööriistakastist."}], "notes": {"et": "\"Innovatsioon avalikus sektoris ja majanduspoliitika kujundamises\" (4 EAP), loengud 2025 kevadel:\n(1) Trendid ja faktid, mis loovad konteksti nii majanduspoliitikale kui ka innovatsioonile avalikus sektoris (4h)\n(2) Innovatsiooni olemus ja juhtimine era-, avalikus ja vabasektoris (4h)\n(3) Innovatsiooni- ja majanduspoliitika kujundamise tehnikatest teoorias ning praktikas (4h)\n(4) Ettevõtlikkusest, eestvedamisest ja storytellingust muutuste juhtimise kontekstis avalikus sektoris (4h)"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Hea juht on storytreller ja arvamusliider. Õppeaine hindamiseks kasutatakse esseed ühel vabalt valitud ühiskondlikul väljakutseteemal, eesmärgiga see meedias publitseerida. Selliselt arendatakse strateegilise juhtimise tudengite võimekust ühiskondlikke probleeme näha, neile uuenduslikke lahenduskäike välja pakkuda ning oma mõttekäike kaasahaaravalt ning massidele arusaadaval viisil esitleda.\n\n\"Innovatsioon avalikus sektoris ja majanduspoliitika kujundamises\": KODUTÖÖD 2025:\n\n(1) Trendid ja faktid, mis loovad konteksti nii majanduspoliitikale kui ka innovatsioonile avalikus sektoris.\nKodutöö: minge pubisse ja arutage, kuidas Tartu linna ägedamaks, paremaks, tuntumaks jne teha. Igaüks esitleb 1 minuti jooksul järgmise loengu alguises.\n\n(2) Innovatsiooni olemus ja juhtimine era-, avalikus ja vabasektoris.\nKodutöö: essee ühel ühiskondlikul väljakutseteemal (6500 tähemärki).\n\n(3) Innovatsiooni- ja majanduspoliitika kujundamise tehnikatest teoorias ning praktikas.\nKodutöö: retsensioon naabri esseele (sh otsuse ettepanek, kas väärib arvestust või mitte).\n\n(4) Ettevõtlikkusest, eestvedamisest ja storytellingust muutuste juhtimise kontekstis avalikus sektoris.\nKodutöö: viia sisse retsensendi põhjendatud soovitused ja ilumutada oma essee mõnes meediakanalis.\n\nERIAUHIND: sellele, kelle essee esimesena mõne ajalehe või ajakirja pabernumbris arvamusloona ilmub!\n\nEeltoodule lisaks antakse tudengitele loengute puhul erinevat tausta- ja järellugemist, samuti jagatakse asjakohaseid videoklippe/linke erinevatesse teemadesse sisseminemiseks."}}], "grade_preconditions": {"et": "Puuduvad"}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "7e006aea-078b-40d0-a69b-eaacaadc5f52", "type": "MOODLE", "code": "SVMJ.08.004_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "01203e97-271e-a4ed-9b6e-43addb061207", "person_name": "Kadri Ukrainski", "structural_unit": {"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "04d72b5a-4205-25d1-510b-d79824cab423", "person_name": "Ott Pärna", "structural_unit": {"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}}, "registration_info": {"audience": {"et": "strateegilise juhtimise magistriõpe, innovatsiooni mikrokraad"}, "min_students": 10, "max_students": 25}, "parent_uuid": "29c9acf4-33b8-afa0-4c42-5d420f37fe7a", "parent_code": "SVMJ.08.004", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}