{"uuid": "d17694a8-6554-bb4f-0276-3eae21721a92", "code": "SVMJ.04.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Regressions and Hypothesis Testing", "et": "Regressioonid ja hüpoteeside testimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ04", "structural_unit_name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Implementation of regression analysis for studying socio-economic processes and testing research hypotheses. Students should prepare empirical projects and discuss project results.  During the project preparation process students have possibilities to acquire knowledge and skills for collecting socio-economic data, specifying, estimating and analysing regression models, and using proper software  to conduct regression analysis and test research hypotheses.", "et": "Regressioonimudelite kasutamine sotsiaalmajanduslikke protsesse iseloomustavate andmete analüüsimisel ja uurimishüpoteeside testimisel. Õppeaine läbimise käigus tuleb koostada  empiiriline projekt ning diskuteerida probleemiseadeid ja uurimistulemusi. Projekti koostamise käigus omandatakse teadmisi, oskusi ja  kogemusi sobivate probleemiseadete ja uurimishüpoteeside püstitamiseks, vajalike andmete kogumiseks ja  süstematiseerimiseks, regressioonimudelite hindamiseks ja statistiliseks analüüsiks ning regressioonianalüüsi tulemuste sisuliseks tõlgendamiseks ja diskuteerimiseks. Omandatakse ka oskusi ja kogemusi sobiva arvutitarkvara kasutamiseks"}, "objectives": [{"en": "To acquire knowledge and skills of implementing regression analysis and testing research hypotheses for modelling and analysing socio-economic processes.", "et": "Omandada esmased teadmised ja oskused, mis võimaldavad kasutada regressioonanalüüsi meetodeid majandus- ja sotsiaalprotsesse iseloomustavate andmete analüüsimisel,  uurimishüpoteeside formuleerimisel ja testimisel ning analüüsitulemuste sisulisel tõlgendamisel."}], "learning_outcomes": [{"en": "Knowledge and skills for building and estimating regressions models and for testing and research hypotheses and analysing and discussing research results. \nKnowledge and skills to collect and analyse socio-economic data for specifying regression models and testing hypotheses.  \nKnowledge and skills for implementing proper software for conducting regression analysis and testing research hypotheses. \nSkills and experience for implementing regression analysis for conducting and discussing empirical projects.", "et": "Teadmised regressioonimudelite formuleerimiseks, hindamiseks ja regressioonianalüüsi tulemuste sisuliseks tõlgendamiseks ning uurimishüpoteeside testimiseks. \nOskus formuleerida ja diskuteerida uurimishüpoteese, millede testimisel saab kasutada regressioonanalüüsi.\nOskus leida ja kasutada regressioonanalüüsi läbiviimiseks vajalikke andmeid.\nTeadmised ja oskused hinnata ja analüüsida regressioonimudeleid kasutades selleks sobivat tarkvara. \nOskused ja esmased kogemused  regressioonianalüüsi kasutamiseks empiiriliste projektide  tegemisel ning uurimistulemuste diskuteerimisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}