{"uuid": "79c43673-9740-2769-d175-d54e0599a6ea", "code": "sv-2025-autumn-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-15T11:24:45", "title": {"en": "Business Environment in the Baltic Sea Region", "et": "Läänemere regiooni majanduskeskkond"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ05", "name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "25/26 A regular SV Eng", "et": "25/26 S PÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ05", "structural_unit_name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 64, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course gives an overview of the theoretical approach to the economic environment, based on the specificities of the Baltic Sea region countries.\nThe nature of the economic environment is explained by various components, such as the purpose of the enterprise, the economic resources of society (eg natural resources, labor, etc.), fields of activity (eg industry, IT), competitiveness, regulatory environment, foreign trade and investments, infrastructure, anesthetics and others.\n\nThe course explains the structural changes in the economies of different countries in the region and explains the different aspects of economic integration (foreign trade, investment, energy, infrastructure, etc.).\nEconomic policies of different countries (monetary policy, fiscal policy, energy policy, employment policy, social policy, etc.) are also analyzed.\nThe course also deals with regional cooperation within the framework of the EU Baltic Sea Strategy.", "et": "Kursuse annab ülevaate majanduskeskkonna teoreetilisest käsitlusest, lähtudes Läänemere regiooni riikide eripärast. \nMajanduskeskkonna olemust selgitatakse erinevate komponentide lõikes nagu etttevõtte tegevuse eesmärk, ühiskonna majandusressursid (näit. loodusvarad, tööjõud jne), tegevusvaldkonnad (näit. tööstus, IT ),  konkurentsivõime,  regulatiivne keskkond,  väliskaubandus ja -investeeringud, infrastruktuur, enegeetika jm. \n\nKursuse raames selgitatakse regiooni riikide majanduses toimunud struktuurseid muutusi erinevates majandussektorites ning selgitatakse majandusintegratsiooni erinevaid aspekte (väliskaubandus, investeeringud, energiasektor, infrastruktuur jm). \nSamuti analüüsitakse erinevate riikide majanduspoliitikaid (rahapoliitika, fiskaalpoliitika, energiapoliitika, tööhõivepoliitika, sotsiaalpoliitika, jm).\nKursus käsitleb ka regionaalset koostööd Euroopa Liidu Läänemere strateegia raames."}, "objectives": [{"en": "Companies do not operate in a vacuum, but in a framework of certain economic conditions. Such economic conditions (micro- and macroeconomic, social and technological, etc.) form a comprehensive business framework, which we call the economic environment in general.", "et": "Ettevõtted ei tegutse vaakumis, vaid teatud majandustingimuste raamistikus. Sellised majandustingimused (mikro- ja makromajanduslikud, sotsiaalsed ja tehnoloogilised jm) moodustavad tervikliku äritegevuse raamistiku, mida nimetame üldistatult majanduskeskkonnaks. "}, {"en": "The course has two interrelated goals.", "et": "Kursusel on kaks omavahel seotud eesmärki. "}, {"en": "1) give a theoretical overview of the nature of the economic environment and its components in the Baltic Sea region", "et": "1)\tanda teoreetiline ülevaade  majanduskeskkonna olemusest ja   selle komponentidest Läänemere regioonis"}, {"en": "The course provides the basis for understanding the business environment as a whole and highlights its links with different economic disciplines.", "et": "Kursus paneb aluse ettevõtluskeskkonna kui terviku mõistmisele  ja toob esile selle  seosed erinevate majandusdistsipliinidega. "}, {"en": "2) to explain the specifics of the economic environment on the example of the Baltic Sea region.", "et": "2)\tselgitada majanduskeskkonna spetsiifikat Läänemere regiooni näitel. "}, {"en": "The countries of the region (10 countries) are treated as a single economic space. This is due to the practical need to provide students with primary systemic information on the economic environment of different countries in the region. Most of the students who have completed the program are employed in the countries of the region. Many foreign students do not have any systematic information about the specifics of the area and the economic environment. The course also has a direct practical purpose in preparing students to work in the countries of the region.", "et": "Regiooni riike (10 riiki) käsitletakse kui ühtset majandusruumi.  See tuleneb praktilisest vajadusest anda tudengitele esmane süsteemne teave erinevate regiooni riikide  majanduskeskkonnast. Suurem osa programmi läbinuid tudengeid asub tööle regiooni riikides. Paljude välistudengitel puudub eelnevalt igasugune süstematiseeritud teave piirkonna eripära ja  majanduskeskkonna kohta. Kursusel on ka otsene praktiline eesmärk tudengite ettevalmistamisel töötamiseks regiooni riikides."}], "learning_outcomes": [{"en": "Student who passed the subject:\n1) is familiar with the main concepts related to the theoretical approach of the economic environment;\n2) uses statistical data and characterizes and generalises the economic processes of the region on the basis of them;\n3) explain the mechanisms and development of the formation of the Baltic Sea Region as a whole;\n4) is familiar with the structure of the economies of the Baltic Sea region, general development trends and national economic policies;\n5) explains the economic policy choices of the countries in the region (eg fiscal or monetary policy) and associate the corresponding theoretical approach;\n6) analyzes the economic competitiveness of countries and its components.", "et": "Kursuse läbinud tudengid peavad omandama tervikliku arusaama  majanduskeskkonna olemusest ning  oskama välja tuua Läänemere regiooni riikide majanduskeskkonna eripära.  . \n\nAine läbinud üliõpilane:\n1) tunneb majanduskeskkonna teoreetilise käsitlusega seotud peamisi mõisteid;\n2) kasutab statistilisi andmeid ning iseloomustab ja üldistab nende alusel regiooni majandusprotsesse;  \n3) selgitab Läänemere  majandusregiooni kui terviku kujunemise mehhanisme ja arengut;  \n4) tunneb Läänemere regiooni riikide majanduste struktuuri, üldisi arengutrende  ja riikide majanduspoliitikat;\n5) oskab selgitada regiooni riikide majanduspoliitilisi valikuid (näiteks fiskaal- või rahapoliitika) ja seostab vastava teoreetilise  käsitlusega; \n6) oskab analüüsida riikide majanduslikku konkurentsivõimet ja selle komponente;"}], "notes": {}}, "grading": {"independent_work": {"et": "(1) Participation (demonstration) (20%)\n(2) Midterm exam (test) (20%)\n(3) Group project (project) (30%)\n(4) Final exam (test) (30%)"}, "independent_work_assessments": [{"work_type": {"code": "demonstration", "et": "Esitus", "en": "demonstration"}, "description": {"et": "Participation in lectures and seminars (20 points)\nEvaluation Criteria. Participation points are distributed across the scheduled lectures and seminars."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Mid-term exam (20 points) - Short answer questions and essay(s) covering the course readings and lectures. Learning outcomes 1-6 are evaluated.\nEvaluation Criteria. Essay questions are rated as points (0-10); Short written questions total max 5 points. The points are automatically converted into percentages, which also defines the final score on the scale F-A.\n\nEvaluation of essay questions:\n0-4 no systemic response; the text of the answer does not relate to the question; eclectic, misuse of terms\n5 - minimal knowledge of theory and generalization ability; insufficient use of terminology\n6 - elements of analysis and independent interpretation exist; the concept of the topic is generally logical, but links between the topics are not developed;\n7 - analysis and independent interpretation are understandable, but sometimes insecure; the use of concepts is generally logical, with links made between the topics, but incomplete;\n8 - relationships and interpretations are decent; there is certainty in establishing relationships and logical use of concepts, but some weaknesses are observed from the point of view of the whole; consideration of different aspects of the topic are missing\n9 - knowledge of theory and private literature is demonstrated, showing relationships and logical use of concepts; there is a logical and fluent approach to the topic as a whole, but some aspects of the topic are missing \n10 - depth of analysis and level of independent interpretation is prominent, relationships thorough and resourceful, subject-specific, logical, comprehensive, demonstrating in-depth knowledge of lecture material and subject literature"}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "Group project (30 points) - Students prepare group projects investigating an approved topic, applying concepts, frameworks and models covered in the course, as applicable. Each group will deliver a report and presentation. Learning outcomes 1-2 and 5-6 are evaluated."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Final exam (30 points) - In-class essays. Students choose 3 of 4 topics which combine knowledge across multiple topics covered in the course. Learning outcomes 1-6 are evaluated.\nEvaluation Criteria. Essay questions are rated as points (0-10). The points are automatically converted into percentages, which also defines the final score on the scale F-A.\n\nEvaluation of essay questions:\n0-4 no systemic response; the text of the answer does not relate to the question; eclectic, misuse of terms\n5 - minimal knowledge of theory and generalization ability; insufficient use of terminology\n6 - elements of analysis and independent interpretation exist; the concept of the topic is generally logical, but links between the topics are not developed;\n7 - analysis and independent interpretation are understandable, but sometimes insecure; the use of concepts is generally logical, with links made between the topics, but incomplete;\n8 - relationships and interpretations are decent; there is certainty in establishing relationships and logical use of concepts, but some weaknesses are observed from the point of view of the whole; consideration of different aspects of the topic are missing\n9 - knowledge of theory and private literature is demonstrated, showing relationships and logical use of concepts; there is a logical and fluent approach to the topic as a whole, but some aspects of the topic are missing \n10 - depth of analysis and level of independent interpretation is prominent, relationships thorough and resourceful, subject-specific, logical, comprehensive, demonstrating in-depth knowledge of lecture material and subject literature"}}], "grade_preconditions": {}, "grade_evaluation": {"et": "(1) Participation (demonstration) (20%)\n(2) Midterm exam (test) (20%)\n(3) Group project (project) (30%)\n(4) Final exam (test) (30%)"}, "debt_elimination": {"et": "There is no retake of the midterm test.\nExamination can be done in the regular order."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "4", "et": "veebiõpe", "en": "online learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "124e5cd6-9d50-1155-7992-fc340f38c65a", "person_name": "Bradley James Loewen", "structural_unit": {"code": "SVMJ08", "name": {"en": "Chair of Public Economics and Policy", "et": "riigimajanduse ja majanduspoliitika õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"course_week": 3, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 4, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 5, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 6, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 7, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 8, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 9, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 10, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 11, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 12, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 13, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 14, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}, {"course_week": 15, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {}}]}, "registration_info": {"audience": {}}, "parent_uuid": "be08f5af-55ed-672a-d0c7-118fe76b90e4", "parent_code": "SVMJ.05.007", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}