{"uuid": "24730cf0-8bca-c81f-5c42-5b0c226dee64", "code": "SVMJ.05.011", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Cultural Context for Economy and Business", "et": "Kultuurikontekst majanduses ja äris"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ05", "structural_unit_name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ05", "name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course focuses on culture as a pattern of values, attitudes, beliefs and norms that distinguishes one group of people from another. Different approaches to culture (including Hofstede, Inglehart, Schwartz) and the dimensions most commonly used to describe culture will be introduced. The course provides an overview of how to measure culture and what databases are used for this purpose. The impact of culture on various economic and business phenomena (e.g. entrepreneurship, innovation, corruption, but also communication style, expectations, cooperation, success of new solutions) will be introduced on a scientific basis.", "et": "Kursus keskendub kultuurile kui väärtuste, hoiakute, uskumuste ja normide mustrile, mis eristab ühte inimgruppi teisest. Tutvustatakse erinevaid kultuuri käsitlusi (sh Hofstede, Inglehart, Schwartz) ja kultuuri kirjeldamiseks enim kasutatavaid dimensioone. Kursusel saab ülevaate sellest, kuidas kultuuri mõõta ja milliseid andmebaase selleks kasutatakse. Tutvustatakse teaduspõhiselt, milline on kultuuri mõju erinevatele majanduse ja äriga seotud nähtustele (nt ettevõtlikkus, innovatsioon, korruptsioon, aga ka suhtlusstiil, ootused, koostöö, uute lahenduste edukus)."}, "objectives": [{"en": "The course provides an understanding of what culture and cultural differences are and how to take cultural differences into account in economics and business.", "et": "Kursus annab arusaama, milles seisneb kultuur ja kultuurierinevused ning kuidas kultuurierinevusi majanduses ja äritegevuses arvesse võtta."}], "learning_outcomes": [{"en": "Student, who has passed the course", "et": "Kursuse edukalt läbinu:"}, {"en": "* understands the nature of culture and knows various well-known theoretical cultural models;", "et": "* mõistab kultuuri olemust ja tunneb erinevaid tuntumaid teoreetilisi kultuurimudeleid;"}, {"en": "* knows how to measure culture, knows the most popular cultural indicators and databases that provide information about culture;", "et": "* teab, kuidas on võimalik kultuuri mõõta, teab tuntumaid kultuuri näidikuid ja kultuuri kohta infot andvaid andmebaase "}, {"en": "* is aware of cultural diversity and is able to detect it;", "et": "* on teadlik kultuurilisest mitmekesisusest ja oskab seda märgata;"}, {"en": "* is able to take into account cultural differences and analyse the impact of different aspects of culture on the economy and business.", "et": "* on võimeline kultuurierinevusi arvesse võtma ning analüüsima erinevate kultuuri aspektide mõju majandusele ja äritegevusele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}