{"uuid": "618a2ed3-2cb6-20d4-1a7f-0a35c5dbc33e", "code": "SVMJ.00.015", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Internship", "et": "Praktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ", "structural_unit_name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVMJ", "name": {"en": "School of Economics and Business Administration", "et": "majandusteaduskond"}, "email": "majandus@ut.ee", "phone": "+372 737 6310", "webpage_url": "https://majandus.ut.ee", "address": "Narva mnt 18\n51009 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Narva mnt 18", "zip": "51009", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students can practice in different companies and organizations (ministries, agencies, local governments, banks, universities, OÜ, NGOs, etc.), set up their own company, participate in research groups or participate in projects. The student chooses the type of internship according to his / her developmental needs and outcomes of the curriculum. The internship supervisors are the internship coordinator at the university and a supervisor from the company / oraganisation side.\nDuring the internship, the student has to follow the tasks set in Moodle. One of the essential outcomes of the internship is the student's self-analysis, in which he/she identifies what he/she has learned, his/her strengths and weaknesses, and the feedback of the supervisor (organization) to his/her activities.\nhttps://sisu.ut.ee/internship", "et": "Üliõpilane võib praktika sooritada erinevates ettevõtetes ja organisatsioonides (ministeeriumid, ametid, kohalikud omavalitsused, pangad, ülikoolid; OÜ, MTÜ jt.), luua oma ettevõtte, osaleda uurimisgruppide töös või osaleda projektide elluviimisel. Praktika liigi valib üliõpilane vastavalt oma arenguvajadustele ja lähtuvalt õppekava praktika eesmärgist. Praktika juhendajateks on ülikooli poolt praktika koordinaator ja ettevõtte poolne juhendaja.\nPraktika ajal lähtub tudeng ülesannetest Moodlis. Praktika üheks oluliseks väljundiks on üliõpilase eneseanalüüs, mille käigus ta toob välja õpitu, oma tugevused ja nõrkused. Praktikajuhendaja (organisatsioonipoolse) tagasiside tema tegevusele on ka praktika kohustuslik osa.\nhttps://sisu.ut.ee/praktikamajanduses/avaleht"}, "objectives": [{"en": "The aim of the internship is to develop student's ability to solve practical problems related to the curriculum, and to apply skills and knowledge acquired during their studies in work environment.", "et": "Praktika eesmärk on arendada tudengi oskust lahendada õppekava temaatikaga seotud praktilisi probleeme ja rakendada õpingute käigus omandatud teadmisi ja oskusi töökeskkonnas."}], "learning_outcomes": [{"en": "A student who has passed the subject can:", "et": "Aine läbinud üliõpilane oskab:"}, {"en": "*\tset work tasks and plan time;", "et": "*\tpüstitada endale tööülesandeid ja planeerida aega;"}, {"en": "*\tapply acquired knowledge in the working environment;", "et": "*\trakendada õpingute käigus omandatud teadmisi töö valdkonnas"}, {"en": "*\tidentify and analyze problems based on the set of tasks in the working environment;", "et": "* \tmääratleda ja analüüsida probleeme lähtuvalt oma praktika ülesannete püstitusest;"}, {"en": "*\tanalyze internship experiences, evaluate one's own development;", "et": "*\tanalüüsida enda praktika kogemusi ja hinnata enda arengut."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}