{"uuid": "7d0963c6-8e86-c04e-e03e-7f85af2d45fc", "code": "SVMJ.03.024", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-18T11:51:59", "title": {"en": "Society, Economy, and Ethics", "et": "Ühiskond, majandus ja eetika"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ03", "structural_unit_name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVMJ03", "name": {"en": "Chair of Management", "et": "juhtimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "1. The time dimension of the societal and economic development.\n2. Spatial dimensions of the societal and economic development.\n3. Discussion of the company cases in balancing the development of the economy, society and the natural environment.\n4. Ethics and morality. Normative systems. Ethical relativism. Main ethics theories and foundation of ethical decision-making. \n5. Professional ethics, codes of conduct. Leader's ethical choices.", "et": "1. Ühiskonna ja majanduse arengu ajaline telg.\n2. Ühiskonna ja majanduse arengu ruumiline telg.\n3. Ettevõtte kaasuste arutelu majanduse, ühiskonna ja looduskeskkonna arengu tasakaalustamisel.\n4. Eetika ja moraal. Normatiivsed süsteemid. Eetiline relativism. Eetika peamised teooriad ja eetilise otsustamise alused.\n5. Kutse eetika, eetikakoodeksid. Juhi eetilised valikud."}, "objectives": [{"en": "Understand socio-economic environment, explore the factors and (future) trajectories of its development, and the feasibility/necessity to change it.", "et": "Mõista sotsiaal-majanduslikku keskkonda, seda mõjutavaid tegureid ning selle edasist kujunemist ja selle kujundamise/muutmise vajalikkust ja võimalikkust."}], "learning_outcomes": [{"en": "The student having completed the course:", "et": "Kursuse läbinu:"}, {"en": "1. Knows what social, economic and environmental development means and understands their interrelationships.", "et": "1. Teab, milles seisneb ühiskondlik, majanduslik ja keskkondlik areng ning mõistab nende vastastikuseid seoseid;"}, {"en": "2. Understands the most influential and current philosophies regarding the development of society and economy.", "et": "2. Mõistab ühiskonna ja majanduse arengut käsitlevaid mõjukamaid ja aktuaalsemaid filosoofiaid;"}, {"en": "3. Has familiarized himself with practical business cases and analyzed the firms' approach to development issues.", "et": "3. On tutvunud praktiliste ettevõtluskaasustega ja analüüsinud nende lähemist arenguküsimustele;"}, {"en": "4. Understands the moral responsibility of a leader in shaping the economic and business environment, is able to recognize the dilemmas that arise in the leader's work and justify his/her choices.", "et": "4. Mõistab juhi moraalset vastutust ettevõtlus- ja majanduskeskkonna kujundamisel ning oskab juhi töös ette tulevaid dilemmasid ära tunda ja oma moraalseid valikuid põhjendada;"}, {"en": "5. Knows professional code of ethics in his/her field and is able to analyze own actions in light of this.", "et": "5. Tunneb enda valdkonna kutse-eetikakoodekseid ning oskab neile toetudes oma tegevust analüüsida."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}