{"uuid": "0a0d0f02-2f7d-7ef9-3bd8-5cb24ba1ed98", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-20T10:39:51", "title": {"en": "Macroeconomic Environment of Estonian Economy", "et": "Eesti majanduse makroökonoomiline keskkond"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVMJ05", "name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVMJ05", "structural_unit_name": {"en": "Chair of Economic Theory", "et": "majandusteooria õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 24, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course opens with discussion about the theories describing the development of economic thought and the general macroeconomic environment. It follows with the short overview about the current developments of the Estonian economy and alterntives for the future development. Next step is to show how to measure the level of economic development and wealth of a country. Subsequently  the logic of the IS-LM model as a general equilibrium model will be explained. The development trends of the Estonian labor market and migration policy in a globalizing world will be discussed. Afterwards briefly will be discussed the role of small countries in the global economy. The logic of productivity development and the possibilities of measuring productivity are explained. Barriers to productivity are discussed. The strategies of different Estonian companies in changing their place in the global value chain are compared. The role of foreign direct investment in the Estonian economy is shown. The dependence of the Estonian economy on the European Union structural funds will be discussed. After that, the choice of Estonia's future development areas will be discussed using the smart specialization model. Course ends with the joint discussion of homeworks and making recommendations how to promote the economic growth of Estonia.", "et": "Kursuse esimeses pooles käsitletakse majanduslikku mõtte arenguid kirjeldavaid teooriaid ja üldiste makroökonoomilist keskkonda; Eesti majanduse seniseid arenguid ja tulevase arengu valikuid. Seejärel näidatakse, kuidas mõõta riigi majanduslikku arengutaset ja rikkust ning tutvustatakse IS-LM mudeli kui üldise tasakaalumudeli loogikat. Järgnevalt arutletakse Eesti tööturu ja rändepoliitika arengusuundade üle üleilmastuvas maailmas. Seejärel käsitletakse lühidalt väikeriikide rolli maailmamajanduses. Selgitatakse tootlikkuse kujunemise loogikat ja tootlikkuse mõõtmise võimalusi. Arutletakse tootlikkust takistavate tegurite üle. Võrreldakse erinevate Eesti ettevõtete strateegiaid koha muutmisel globaalses väärtusahelas. Näidatakse otseste välisinvesteeringute rolli Eesti majanduses. Arutletakse Eesti majanduse sõltuvuse üle Euroopa Liidu tõukefondidest.Seejärel arutatakse Eesti tulevaste arenguvaldkondade valiku üle kasutades nutika spetsialiseerumise mudelit. Aine lõpus toimub esitatud kodutööde ühine arutelu ja soovituste tegemine Eesti majanduskasvu edendamiseks."}, "objectives": [{"en": "The course provides an opportunity to acquire knowledge about the macroeconomic environment affecting the operations of firms and Estonia's changing role in the global economy, and helps to develop skills for operating in a globalizing economy.", "et": "Kursus annab võimaluse teadmiste omandamiseks ettevõtte tegevust mõjutavast makroökonoomilisest keskkonnast ja Eesti  muutuvast rollist maailmamajanduses ning aitab kujundada oskused tegutsemiseks globaliseeruvas majanduses."}], "learning_outcomes": [{"en": "As a result of the course, the student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1. understands the macroeconomic approach, is familiar with the main theoretical schools of economic thought in this field;", "et": "1. saab aru makroökonoomilisest lähenemisviisist, tunneb põhilisi teoreetilisi majandusliku mõtte koolkondi nimetatud valdkonnas; "}, {"en": "2. has an overview of the most important macroeconomic models in an open economy (incl. understands the logic of the general equilibrium model, the functioning of the money market and the mechanism of inflation);", "et": "2. omab ülevaadet olulisematest makroökonoomika mudelitest avatud majanduses (s.h. mõistab üldise tasakaalumudeli loogikat, rahaturu toimimist ja inflatsiooni tekkemehhanismi);"}, {"en": "3. understands the dependence of the Estonian economy as a small country on the world economy and is able to see the different channels of this dependence (foreign trade, foreign investments, knowledge transfer, migration);", "et": "3.saab aru Eesti kui väikeriigi majanduse sõltuvusest maailmamajandusest ja oskab näha selle sõltuvuse erinevaid kanaleid (väliskaubandus, välisinvesteeringud, teadmussiire, migratsioon);"}, {"en": "4. has an overview of the main problems of the Estonian economy and is able to propose various strategies that contribute to strengthening the international competitiveness of the Estonian economy;", "et": "4. omab ülevaadet Eesti majanduse põhiprobleemidest ja oskab välja pakkuda erinevaid strateegiaid, mis aitavad kaasa Eesti majanduse rahvusvahelise konkurentsivõime tugevdamisele;"}, {"en": "5. focuses on the current problems of the Estonian labor market and migration policy;", "et": "5. orienteerub Eesti tööturu ja rändepoliitika aktuaalsetes probleemides;"}, {"en": "6. is aware of the various possibilities for increasing productivity at the national, industry and company level;", "et": "6. tunneb tootlikkuse tõstmise erinevaid võimalusi riigi, majandusharu ja ettevõtte tasandil;"}, {"en": "7. knows the approach to smart specialization and is able to discuss the smart specialization options of the Estonian economy.", "et": "7. teab nutika spetsialiseerumise käsitlust ja oskab arutleda Eesti majanduse nutika spetsialiseerumise valikute üle."}], "notes": {}}, "grading": {"independent_work": {"et": "Kirjalik kodutöö rühmadena, milles on kaks osalejat. Kodutöö täpsustav juhend koos võimalike teemadega on Moodles.\nKodutöö eesmärk on kirjutada analüüsiv essee, kus viidatud allikatele tuginedes arendatakse oma mõttekäiku etteantud teemal. Töö maht ja vormistamine: töö põhiosa pikkuseks (koos peamiste tabelite ja joonistega) võiks olla 8-10 lk. Vormistamisel on soovitav kasutada järgmisi vormistusreegleid (A4 lehe suurus, ääred 2cm, kiri Times New Roman 12 pt, reavahe 1), lisaks kasutatud kirjanduse loetelu ja tiitelleht. Esitamise tähtaeg:"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Mitteeristav hindamine. Arvestuse saamiseks vajalik saada 12 p 20-st."}}], "grade_preconditions": {"et": "Arvestuse saamiseks tuleb kirjutada kodutöö (essee) etteantud teemal. Esseede teemad ja juhendmaterjal Moodles. Lisaks tuleb retsenseerida üht kaasõppurite tööd. "}, "grade_evaluation": {"et": "Tööd hinnatakse 20 punkti skaalal, hinnatakse nii suulist esitlust (8p), retsensiooni kaastudengite töödele ning aktiivset osalust arutelul (2p) kui kirjalikku tööd (10 p). Arvestuse saamiseks vajalik kokku saada 12 p.  Kirjaliku töö kohta antakse lühike kirjalik tagasiside, suulise esitluse kohta on tagasiside kohe pärast esitlust."}, "debt_elimination": {"et": "Muudetud kodutöö uus esitamine."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "11fd7e07-0f0a-4393-85eb-67e709ac26ec", "type": "MOODLE", "code": "SVMJ.05.010_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Moodle'is", "recommended_materials": "Moodle'is"}, "participants": {"lecturers": [{"person_uuid": "3a4c7429-197d-4d31-46ad-9837674f2639", "person_name": "Urmas Varblane", "structural_unit": {"code": "SVMJ07", "name": {"en": "Chair of International Business and Innovation", "et": "rahvusvahelise ettevõtluse ja innovatsiooni õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "1812e80f-9a4d-d9a2-64e5-11e7c417fda2", "person_name": "Peeter Luikmel", "structural_unit": {"code": "SVMJ04", "name": {"en": "Chair of Economic Modelling", "et": "majanduse modelleerimise õppetool"}, "address": "EST", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVMJ"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "september- jaanuar"}, "entries": [{"course_week": 3, "time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Teema 1. Sissejuhatus majanduse makro-ökonoomilisse keskkonda. Majanudse lühi- ja pika perioodi eripärad. Reaalsed ja nominaalsed suurused. Majandusliku mõtte koolkonnad. P. Luikmel (2 tundi)"}}, {"course_week": 3, "time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "Teema 2. Tööturg ja haridus. Inimkapitali roll Eesti majandusarengus. Tööturu tasakaalu kujundavad mikro- ja makrotegurid. P.  Luikmel (2 tundi)"}}, {"course_week": 3, "time": "2024-09-21", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Teema 3. Eesti majanduse mõõtmine. Kuidas mõõta riigi majanduslikku arengutaset ja rikkust? Kuidas meid mõõdavad  ja mida soovitavad välised hindajad (reitinguagentuurid, Rahvusvaheline Valuutafond, Euroopa Komisjon) P.Luikmel (2 tundi)"}}, {"course_week": 7, "time": "2024-10-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "Teema 4.Eesti majandustsükkel ja seda kujundavad tegurid. Majanduse rahastamine, rahapoliitika ülekandumine, väike avatud majandusega riik rahaliidus). P. Luikmel (2 tundi)"}}, {"course_week": 7, "time": "2024-10-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Teema 5. Kogunõudlus ja kogupakkumine /IS-LM mudel. Eelarvepoliitika mõju tsükliliste kõikumiste stabiliseerimisele. P. Luikmel (2 tundi)"}}, {"course_week": 11, "time": "2024-11-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Teema 6. Väikeriigid maailmamajanduses - võimalused ja piirangud. U,Varblane (2 tundi)"}}, {"course_week": 11, "time": "2024-11-16", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "Teema 7. Juhitav rändepoliitika kui teadmusmahuka Eesti kujundamise vahend. U,Varblane (2 tundi)"}}, {"course_week": 11, "time": "2024-11-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Teema 8. Otsesed välisinvesteeringud Eesti majanduses. U,Varblane (2 tundi)"}}, {"course_week": 14, "time": "2024-12-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Teema 9. Eesti majanduse toetussõltuvus. U.Varblane (2 tundi)"}}, {"course_week": 14, "time": "2024-09-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {}, "description": {"et": "Teema 10. Tootlikkus ja ettevõtte koha muutmine rahvusvahelistes väärtusahelates.  U. Varblane (2 tundi)"}}, {"course_week": 14, "time": "2024-12-08", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 3, "topic": {}, "description": {"et": "Teema 11. Eesti majanduse tulevaste arenguvaldkondade valik - targa spetsialiseerumise mudel. Ettevõtete ja ülikoolide koostöö \n\nU.Varblane (2 tundi)"}}, {"course_week": 20, "time": "2025-01-18", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "SEMINAR Kodutöödes välja toodud ideede esitamine, arutelu Eesti majanduse oluliste arenguküsimuste üle ja nende põhjal soovituste kujundamine. Kokkuvõtted ainest.  P. Luikmel, U. Varblane (6 t)"}}]}, "registration_info": {"audience": {"et": "strateegiline juhtimine 1. aasta"}, "min_students": 10, "max_students": 24}, "parent_uuid": "ffc87fa9-46c9-262c-cbdd-d65358454b69", "parent_code": "SVMJ.05.010", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}