{"uuid": "15e1ba41-258d-87ce-92c5-3bea79b0b13f", "code": "SVNC.00.300", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-21T16:55:20", "title": {"en": "Introduction to Programming", "et": "Sissejuhatus programmeerimisse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SV", "structural_unit_name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "course_share_percent": 100, "coordinating": false}, {"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, {"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Organization of higher education, study forms and teaching methods. Sources of scientific and professional information, their use, introduction of databases. Types of student papers, base of compiling and outlining student papers.", "et": "Kõrgkooliõpingute korraldus, õppevormid ja õppemeetodid. Teadus- ja erialainformatsiooni allikad, nende kasutamine, andmebaaside tutvustus. Üliõpilastööde liigid, üliõpilastööde koostamise ja vormistamise alused."}, "objectives": [{"en": "To give students", "et": "Anda üliõpilastele"}, {"en": "- an overview of different areas of informatics and its applications, and possible directions of specialization and jobs,", "et": "- ülevaade informaatika erinevatest valdkondadest ja rakendustest ning võimalikest spetsialiseerumissuundadest ja nendega seotud ametikohtadest,"}, {"en": "- an overview of different learning styles and skills, time management and learning motivation,", "et": "- ülevaade erinevatest õpistiilidest ja õppimisvõtetest, ajakasutusest, õpimotivatsioonist,"}, {"en": "- experience in creating academic text and public performance in seminar,", "et": "- kogemus akadeemilise teksti vormistamisest ja avalikust esinemisest seminaris,"}, {"en": "- experience of analysing learning time management and goal setteing;", "et": "- kogemus oma õppimisele ajakulu analüüsimisest ja eesmärkide seadmisest,"}, {"en": "- basic skills necessary for learning software engeneering or entrepreneurship.", "et": "- põhilised oskused, mis on vajalikud valitud erialal (ettevõtlus või infotehnoloogia) õppimiseks."}], "learning_outcomes": [{"en": "After passing the course the student", "et": "Kursuse läbinud üliõpilane"}, {"en": "- has obtained an overview of different areas of informatics or entrepreneurship and is familiar with possible directions of specialization and career paths;", "et": "- saab ülevaate informaatika või ettevõtluse erinevatest rakendustest ja uurimissuundadest ning on tutvunud informaatikute või ärijuhtide võimalike karjääriradadega,"}, {"en": "- knows his/her opportunities and peculiarities as a student and is able to rely on them when studying at the university;", "et": "- tunneb oma võimalusi ja eripära õppijana ning oskab ülikoolis õppides nendele toetuda,"}, {"en": "- consciously and expediently plans his/her studies at the university and draws up his/her study plan for the entire study period;", "et": "- planeerib teadlikult ja otstarbekalt oma õppimist ülikoolis ning koostab oma õppeplaani kogu õppeajaks,"}, {"en": "- uses general and specialty-specific learning techniques, chooses the learning method corresponding to his/her goals in the context of the subject, becomes aware of working and non-working learning styles for himself/herself and fellow students based on previous experience;", "et": "- kasutab üldisi ja erialaspetsiifilisi õppimisvõtteid, valib oma eesmärkidele vastava õppimisvõtte õppeaine kontekstis, teadvustab varasema kogemuse põhjal enda ja kaastudengite jaoks töötavaid ja mittetöötavaid õpistiile,"}, {"en": "- is able to find motivation for learning and analyse the use of time;", "et": "- oskab leida motivatsiooni õppimisel ja analüüsida oma ajakasutust,"}, {"en": "- is able to formulate a simple academic text and has experience in presenting it ;", "et": "- oskab vormistada lihtsat akadeemilist teksti ja omab esinemiskogemust,"}, {"en": "- participates in group work;", "et": "- osaleb grupitöös,"}, {"en": "- gets acquainted with the work of a research group of the college or company and analyses his/her learning needs and career opportunities as a specialist in the field of software engineering or entrepreneurship.", "et": "- tutvub kolledži uurimisrühma või ettevõtte tööga ning analüüsib oma õppimisvajadust ja karjäärivõimalusi valdkonna spetsialistina."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}