{"uuid": "407f9a8f-b0bd-9242-3192-027f7ced5283", "code": "SVNC.00.283", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-24T13:49:24", "title": {"en": "History and Society of the Baltic Countries", "et": "Balti riikide ühiskond ja ajalugu"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course studies the history, development, and the current situation of the three Baltic states taking into consideration their geographical location and political situation. The course also analyses the history of the three Baltic states from the 18th century until today. The second half of the course studies the society of the Baltic countries: the demographic situation and democracy development, the freedom of media and the health of the civil society.", "et": "Õppeaine uurib kolme Balti riigi ajalugu, arengut ja hetkeseisu, võttes arvesse  riikide geograafilist asukohta ja poliitilist seisundit. Vaatleme lähemalt kolme riigi ajalugu alates 18.sajandist kuni tänapäevani. Kursuse teine pool käsitleb Balti riikide ühiskonda - demograafist olukorda ja arenguid, demokraatia arengut, meediavabadust ja kodanikuühiskonna tervist."}, "objectives": [{"en": "The aim of the course is to provide students with an overview of the history of the Baltic states (Estonia, Latvia, and Lithuania) as well as to analyze the influence of Russia in the region and its traces in the modern societies of the Baltic states.", "et": "Kursuse eesmärk on anda tudengitele ülevaade Balti riikide (Eesti, Läti ja Leedu) ajaloost ja vaadelda lähemalt Vene riigi mõju regioonis ning selle jälgi tänapäeva Balti riikide ühiskondades."}], "learning_outcomes": [{"en": "Upon completion of the course a student", "et": "Kursuse läbinud tudeng: "}, {"en": "-\tknows the most important events in the history of the three Baltic states from the early 18th century to the 21st century;", "et": "-\t teab kolme Balti riigi ajaloo olulisimaid sündmuseid 18.sajandi algusest 21.sajandini"}, {"en": "-\tanalyses the emergence of the Baltic states in the 20th century;", "et": "-\tanalüüsib Balti riikide omariikluse kujunemist 20.sajandil"}, {"en": "-\tknows the demographic situation and the structure of the societies of the modern Baltic states;", "et": "-\ttunneb tänaste Balti riikide demograafilist seisu ja ühiskonna struktuuri"}, {"en": "-\tknows how democracy works in the Baltic states in the 21st century;", "et": "-\tteab kuidas toimib demokraatia Balti riikides 21.sajandil"}, {"en": "-\tanalyses the trends of the civil society in the Baltic states nowadays;", "et": "-\tAnalüüsib kodanikuühiskonna trende Balti riikides tänapäeval"}, {"en": "-\tunderstands the influences of the Soviet period on the modern Baltic societies.", "et": "-\tmõistab Nõukogude perioodi mõju tänapäeval Balti ühiskondades"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}