{"uuid": "b85b50b2-70a0-650b-b68d-9c06e997016f", "code": "SVNC.00.135", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Learning Environment and Teaching Resources", "et": "Õppekeskkond ja õppevara"}, "credits": 2, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "..", "et": "Kursus on ülesehitud kombineeritud õppe põhiselt. See tähendab osa õppest toimub e-õppena Moodle keskkonnas ja seda toetavad kaks otsekohtumist - üks praktikum ja üks seminar. Kursuse Moodle keskkond on ülesehitatud selliselt, et üliõpilasel on võimalik saada ülevaade traditsioonilise ja nüüdisaegse õppekeskkonna tunnustusest, mis toetavad avatud, koostöist ja enesejuhitud õppimist. Süvitsi pööratakse tähelepanu järgmistele teemadele: avatud õpikeskkond, avatud ruum, mobiilsed ruumilahendused, virtuaalmaailm kui õpikeskkond (sh vajalikud tingimused koostöiseks õppimiseks), koolivälised õppekeskkonnad. Enne e-õppega alustamist, täidavad kõik üliõpilased DigCompEdu põhise digipädevuse enesehindamise testi, mis annab üliõpilastele ülevaate oma digipädevustest ja suunab üliõpilast planeerima digipädevuste järjepidevat arendamist. Kursuse auditoorne töö toimub aine praktikumis ja see on kaheosaline. Esmalt suunatakse üliõpilasi leidma ja hindama etteantud hindamiskriteeriumite alusel leitud erialasest õpivara, lisaks tuleb saadud tulemusi kaasõpilastele tutvustada. Praktikumi teises osas õpitakse kasutama nüüdisaegset õpikäsitust toetava õppevara loomiseks sobivaid võimalusi. Kursuse käigus tuleb üliõpilastel luua üks õppevaraline lahendus, kogu aine lõppeb kokkuvõtva Moodle testiga."}, "objectives": [{"en": "To support students to become teachers who are able to create a safe, inclusive as well as stimulating learning environment by integrating both traditional and modern teaching resources, and materials (including digital technology).", "et": "Õppeaine eesmärk on toetada üliõpilase kujunemist õpetajaks, kes kujundab turvalise ja kõigi õppijate kaasamist toetava igaühele eduelamust pakkuva õppekeskkonna, lõimides seejuures loovalt traditsioonilise ja kaasaegse õppevara ja -vahendid, sh IKT põhised."}], "learning_outcomes": [{"en": "On completion of the course students:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) know the features of the modern learning environment and can describe them.", "et": "1)\tteab nüüdisaegse ja traditsioonilise õppekeskkonna tunnuseid ja oskab neid kirjeldada;"}, {"en": "2) can analyse to which extent the learning environment is open and supports self-management and cooperation;", "et": "2)\toskab analüüsida, mil määral on õppekeskkond avatud, enesejuhtimist ja koostöisust toetav;"}, {"en": "3) are able to find learning resources related to the teaching of their specialty and are able to point out the strengths and weaknesses of the learning materials found;", "et": "3)\toskab leida oma eriala õpetamisega seotud õpivara ja on suuteline välja tooma leitud õpivara tugevaid ning nõrku külgi;"}, {"en": "4) can create modern and suitable learning resources bank based on contemporary learning approach.", "et": "4)\toskab luua oma eriala õppimist ja õpetamist toetava õppevaralise lahenduse, mis on kooskõlas nüüdisaegse õpikäsitusega."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}