{"uuid": "e453cf9b-604d-a0bf-5a40-d349f65ea0a0", "code": "SVNC.00.092", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Accounting and Project-based Accounting", "et": "Majandus- ja projektipõhine arvestus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Basic principles and concepts of accounting. Organization of financial accounting in the company. Basic accounting schemes by type of accounting: current assets, fixed assets, liabilities and equity accounting. Accounting for costs and revenues, sales transactions and profit or loss. Tax accounting. Fiscal year report. Legislation governing project-based accounting and reporting. Basic principles and concepts of project-based accounting. Peculiarities of project-based accounting in the company. Basic accounting schemes by type of accounting. Accounting for expenses, income, sales and profit. Reporting. Funding of projects with European Union grants.", "et": "Majandusarvestust reglementeerivad õigusaktid. Arvestuse põhiprintsiibid ja kontseptsioonid. Majandusarvestuse korraldamine ettevõttes. Arvestuse põhiskeemid arvestusliikide lõikes: käibevara, põhivara, kohustuste ja omakapitali arvestus. Kulude-tulude, müügitehingute ja tulemi arvestus. Maksuarvestus. Majandusaasta aruanne. Projektipõhist arvestust ja aruandlust reglementeerivad õigusaktid. Projektipõhise arvestuse põhiprintsiibid ja kontseptsioonid. Projektipõhise arvestuse korraldamise eripära ettevõttes. Arvestuse põhiskeemid arvestusliikide lõikes. Kulude, tulude, müügitehingute ja tulemi arvestus. Aruandlus. Projektide rahastamine Euroopa Liidu toetustega."}, "objectives": [{"en": "To provide theoretical and practical knowledge of accounting and project-based accounting. Teach basic accounting principles.", "et": "Anda teoreetilised ja praktilised teadmised majandus- ja projektipõhisest arvestusest. Õpetada raamatupidamise põhiprintsiipe."}], "learning_outcomes": [{"en": "After passing the course the student -knows the general basics of financial accounting:", "et": "Kursuse läbinud üliõpilane tunneb majandusarvestuse üldiseid aluseid:"}, {"en": "* undestands accounting as a system, knows and uses accounting principles, concepts and methods;", "et": "* orienteerub majandusarvestuses kui süsteemis, teades ja kasutades arvestuse printsiipe, kontseptsioone ja meetodeid;"}, {"en": "* knows the legal acts regulating the organization of accounting, is able to apply them in different areas of accounting;", "et": "* teab majandusarvestuse korraldamist reglementeerivaid õigusakte, oskab neid rakendada arvestuse erinevates valdkondades;"}, {"en": "* is familiar with the process of collecting, identifying, measuring and evaluating information of economic transactions, is able to account for these operations;", "et": "* orienteerub majandustehingute alase informatsiooni kogumise, identifitseerimise, mõõtmise ja hindamise protsessis, on võimeline neid toiminguid arvestuslikult kajastama;"}, {"en": "* has knowledge of determining the position of assets, liabilities and equity, is able to reflect them by continuously recording documented changes in transactions to assess the company's financial position;", "et": "* omab teadmisi vara, kohustuste ja omakapitali seisu kindlakstegemisest, oskab neid kajastada tehingute dokumenteeritud muutumiste pideva fikseerimise teel hindamaks ettevõtte finantsolukorda;"}, {"en": "* is familiar with the preparation of financial reports and specific reports, is able to prepare, analyse and interpret them for making management decisions;", "et": "* tunneb majandusarvestuse kohta aruandluse koostamisel, finantsaruandeid ja -spetsiifilisi aruandeid, oskab neid koostada, analüüsida ja interpreteerida juhtimisotsuste tegemiseks;"}, {"en": "* knows the legislation regulating accounting, is able to implement it;", "et": "* teab arvestust reglementeerivaid õigusakte, oskab neid rakendada;"}, {"en": "* has knowledge of the accounting of government grants;", "et": "* omab teadmisi sihtfinantseerimise arvestuslikust kajastamisest;"}, {"en": "* knows the eligibility of costs;", "et": "* tunneb kulude abikõlblikkust;"}, {"en": "* can compile project-based accounting and reporting.", "et": "* oskab koostada projektipõhist arvestust ja aruandlust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}