{"uuid": "5cf74a48-1065-a073-cc1e-89251497d957", "code": "SVNC.00.274", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Marketing and Marketing Communication", "et": "Turundus ja turunduskommunikatsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Terms: The basic concepts and concepts of marketing, the marketing environment, and the relationship of marketing to other areas of the company are discussed. An overview of the structure of the marketing information system and the purchasing behavior of the consumer and the organization is given. Selecting and positioning target markets. Stages of the marketing plan; plan and preparation of their activities. Marketing mix: product, pricing, distribution, promotion, processes, people, and physical facilities are examined: characteristics, target, strategy, and usage of digital marketing.\n\nIntegrated marketing communication. Customer behavior. Target groups and their communication. Inward marketing communication. Business relationship management. Customer relationship management. Digital communication channels.", "et": "Turunduse põhimõisted ja kontseptsioonid, turunduskeskkonda ja turunduse seos teiste ettevõtte valdkondadega. Turunduse infosüsteemi struktuurist ja tarbija ning organisatsiooni ostukäitumisest. Sihtturgude valimine ja positsioneerimine. Turunduskava kava etappid ja nende tegevuste koostamine. Turundus kompleks: toode, hind, jaotus, edustus, teenuspakkuja võimekus ja väliste faktorite integratsioon: olemus, eesmärgid, strateegiad, kasutamine. Digitaalne turundus.\n\nIntegreeritud turunduskommunikatsioon. Kliendikäitumine. Sidusgrupid ja suhted nendega. Siseturundus ja selle kommunikatsioon. Ärisuhete juhtimine. Kliendisuhete juhtimine. Digitaalsed kommunikatsioonikanalid."}, "objectives": [{"en": "Students are able to understand basic knowledge and principles of marketing and it's connections with other areas of the company. The aim of the course is to provide knowledge and practical skills about marketing communication and its organization as well.", "et": "Õppija omandab alusteadmised turunduse olemusest, põhimõtetest ja seostest teiste ettevõtte tegevusvaldkondadega.\nSamuti on aine eesmärgiks anda tüliõpilasele teadmisi ja praktilisi oskusi turunduskommunikatsioonist ning selle korraldamisest."}], "learning_outcomes": [{"en": "A student is able to:", "et": "Kursuse läbinud üliõpilane suudab:"}, {"en": "-\tdistinguish the basic concepts of marketing and their role in ensuring the success  of organizations", "et": "-\teristada turunduse põhimõisteid ja nende rolli organisatsioonide edu tagamisel"}, {"en": "-\tcharacterize opportunities for market segmentation and target market formation", "et": "-\tiseloomustada turgude segmenteerimise ja sihtturgude kujundamise võimalusi"}, {"en": "-\tprepare a marketing plan and plan activities for the stages of the marketing plan", "et": "-\tkoostada turundusplaani ja planeerida turunduskava etappide tegevusi"}, {"en": "-\tdesign a comprehensive marketing mix for products and services", "et": "-\tkujundada terviklik turunduskompleks toodele ja teenustele."}, {"en": "-\tunderstand the nature and principles of integrated marketing communication and be able to apply them", "et": "-\tmõistab (integreeritud) turunduskommunikatsiooni olemust ja põhimõtteid ning oskab neid rakendada"}, {"en": "-\tunderstand the main channels of digital marketing communication and has basic skills in their implementation", "et": "-\ttunneb kaasaegseid turunduskommunikatsiooni digilahendusi ning omab baasoskusi nende kasutamiseks"}, {"en": "-\tunderstand the importance and role of public relations in marketing communication", "et": "-\tmõistab ärisuhete olulisust ja rolli turunduskommunikatsioonis "}, {"en": "-\tunderstand the basic principles of customer behavior and be able to take them into account when planning marketing communication.", "et": "-\tmõistab kliendikäitumise põhiprintsiipe ja oskab nendega arvestada turunduskommunikatsiooni planeerimisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}