{"uuid": "4b44051b-5a69-59fd-4dc9-f5b8beb5b5c5", "code": "SVNC.00.293", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-18T10:40:12", "title": {"en": "Conversational Russian Language (level B2)", "et": "Vene keele vestluskursus (tase B2)"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "ru", "et": "vene keel", "en": "Russian"}, "start_level": {"code": "B1", "et": "B1", "en": "B1"}, "end_level": {"code": "B2.1", "et": "B2.1", "en": "B2.1"}}}, "overview": {"description": {"en": "1. RUSSIA ON THE WORLD MAP: Geography. Natural Resources. Climate. Population. Languages. Cities of Russia.\t\n2. TRAVELING IN RUSSIA: Golden Ring of Russia. Capitals and Provinces. Travel Notes about Russia.\t\n3. RUSSIAN AND WORLD SPORT: Popular Sports in Russia. Sports Events in Russia and the World. Famous Russian Athletes. Doping Scandals.\t\n4. EDUCATION SYSTEM IN RUSSIA: Preschool Education. Secondary Education. Vocational Education. Higher Education. Holiday Traditions in Schools and Universities.\t\n5. LABOR MARKET IN RUSSIA: Most Popular Professions. Labor Market. Unemployment. Professional and Personal Qualities of a Modern Employee.\t\n6. DEMOGRAPHIC PROCESSES IN MODERN RUSSIA: Population of Russia. Demographic Situation in Russian Regions: Current Issues. Socio-Demographic Policy of Russia: Ways out of the Crisis. National projects of Russia.\t\n7. THE HEALTH CARE SYSTEM IN RUSSIA. PENSION SYSTEM IN RUSSIA: Health and Healthcare. Pension and Pension System. National Projects.\t\n8. NATIONAL SYMBOLS OF RUSSIA: State Emblem of the Russian Federation. State Flag of the Russian Federation. Day of the National Flag of Russia. Anthem of the Russian Federation\t\n9. STATE SYSTEM OF THE RUSSIAN FEDERATION: President. Legislative Power. Executive Power. Judicial Power.\t\n10. PRESIDENTIAL AND PARLIAMENTARY ELECTIONS: Elections of the President of the Russian Federation. Constitution of the Russian Federation. Parliamentary Elections. Political Parties.\n11. FESTIVE CULTURE OF MODERN RUSSIANS. New Year and Old New Year. Christmas. Maslenitsa. Easter. September 1. Traditional festive dishes of Russian cuisine. Gifts for the holiday and holiday greetings. \n12. SCIENCE AND SCIENTIFIC DISCOVERIES IN RUSSIA AND THE WORLD. Scientific awards and their laureates. Famous Russian scientists. Scientific discoveries in Russia.\n13. RUSSIAN HISTORY IN FACES. Russian Tsars. Russian Tsarinas. Romanov Dynasty.\n14. RUSSIAN ART IN THE 20th CENTURY. Literature. Painting Music. Theater. Cinema.", "et": "1. Venemaa maailmakaardil\n2. Reisimine Venemaal\n3. Vene ja maailma sport\n4. Haridussüsteem Venemaal\n5. Tööturg Venemaal\n6. Demograafilised protsessid\n7. Tervishoiusüsteem Venemaal. Pensionisüsteem Venemaal\n8. Venemaa rahvuslikud sümbolid\n9. Vene Föderatsiooni riigisüsteem\n10. Presidendi ja parlamendi valimised"}, "objectives": [{"en": "To improve students' communicative skills of the Russian language at B2 level in everyday social, social-cultural and professional communication settings.", "et": "Täiendada üliõpilaste suhtlemisoskust B2 tasemele vastavate teemade raames igapäevastes sotsiaalsetes, sotsiaalkultuurilistes ja ametialastes valdkondades."}], "learning_outcomes": [{"en": "On completion the course a student:", "et": "Aine läbimisel üliõpilane:"}, {"en": "1) understands the oral monologue texts of social, sociocultural, and professional nature; understands the purpose, motive of the speaker, explicit and implicit information (subtext);", "et": "1) mõistab kõrva järgi sotsiaalse, kultuurilise ja professionaalse suunitlusega suulisi monolooge; saab aru kõneleja eesmärgist, motiivist, eksplitsiitsest ja kaudsest informatsioonist (alltekstist);"}, {"en": "2) is able to achieve communicative goals in a free conversation on sociocultural and professional topics; in a conversation acts both as the initiator of the dialogue and as an interlocutor; produces monologue statements of different types of speech (narration, description, reasoning);", "et": "2) suudab vabas vestluses saavutada kommunikatiivseid eesmärke sotsiaal-kultuurilistel ja erialastel teemadel; toimib vestluses nii dialoogi algataja kui ka vestluspartnerina; produtseerib erinevat tüüpi kõne monoloogilisi väiteid (jutustus, kirjeldus, arutluskäik);"}, {"en": "3) reads and understands authentic fictional and non-fictional texts, understands the attitude of the author explicitly expressed in the text, expresses his attitude to the read.", "et": "3) loeb ja mõistab kohandamata kirjandus- ja aimetekste, mõistab tekstis selgesõnaliselt väljendatud autori suhtumist, väljendab oma suhtumist loetusse."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}