{"uuid": "19f4be98-e9fb-d5e2-f95b-be16b8f37aaf", "code": "sv-2024-autumn-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-02T14:11:57", "title": {"en": "Classics of Estonian Literature", "et": "Eesti kirjandusklassika ja filmid"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolled"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolled"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 2, "practice": 2, "seminar": 60, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course gives an overview of Estonian literature. The most important sub-topics are Estonian literature during the last twenty-five years, in parallel with exile literature and literature from the first period of independence, in the Estonian SSR.", "et": "Kursus annab ülevaate eesti kirjandusest . Tähtsamate allteemadena käsitletakse eesti kirjandust viimase kahekümne viie aasta jooksul, paralleelselt pagulaskirjandusega ning Eesti NSVs, esimesel iseseisvusperioodil, eesti kirjanduse sünniperioodil."}, "objectives": [{"en": "To provide an overview of Estonian literature, starting from the most popular literary works of modern times and finishing with the literary works of the first period of independence. Become acquainted with screenings of major literary works.", "et": "Anda ülevaade eesti kirjandusest, alates kaasaja populaarsematest kirjandusteostest, jõudes  kirjandusloos esimese iseseisvusperioodi kirjandusteosteni. Tutvuda olulistemate kirjandusteoste ekraniseeringutega."}], "learning_outcomes": [{"en": "Student", "et": "Üliõpilane"}, {"en": "1) knows the main features of Estonian literature;", "et": "1) tunneb eesti kirjanduse peajooni; "}, {"en": "2) is able to  dissert central Estonian writers and works in historical context;", "et": "2) suudab käsitleda kesksemaid eesti kirjanikke ja teoseid ajaloolises kontekstis;"}, {"en": "3) can distinguish the most important literary trends;", "et": "3) oskab eristada tähtsamaid kirjanduslikke suundumusi;"}, {"en": "4) has read the most important fictional texts from the period under review and has viewed their screenings.", "et": "4) on lugenud kõige olulisemaid ilukirjanduslikke tekste vaadeldavast perioodist ning tutvunud nende ekraniseeringutega."}], "notes": {"et": "Osavõtt kolledi üritustest (konverentsi korraldamine või kuulamine; kirjandusklubi kohtumisel kaasalöömine, õppekäikudest osavõtt jne) kompenseerib kohustusliku ülesande.\nÜritusi, millel saab osaleda:\nKirjandusklubi kohtumised-jälgige kolledi kodulehel olevat reklaami.\nTäpsem info on kolledi kodulehel.\n\nHansenist Tammsaareni võistulugemine Ida-Virumaal - esitada peast  5min pikkune katkend Tammsaare teosest/saab osaleda ka kuulajana või korraldajana."}}, "grading": {"independent_work": {"et": "1. Kirjandus- ja filmiõpetuse terminoloogia ja Eesti kirjandusliku filmiklassika kohta Kuldvillaku vms virtuaalse mängu koostamine.\n2. Kirjandusteose ja sellest tehtud filmi süee võrdlus.\n3. Koostada kirjandusklassikal põhineva filmi järgi 3 ülesannet:\na) vaatamiseelne (näiteks ennustamine, oletused tegelaste, tegevuskoha, -aja kohta jne);\nb) vaatamisaegne (kindlal eesmärgil katkendi vaatamine: jälgida mees- või naistegelasi, interjööri, looduskeskkonda või kõnet jne);\nc) vaatamisjärgne ülesanne (kokkuvõte, järeldus, fantaseerida tegelaste edasise käekäigu kohta jne). , \n4. Lugemiseelsete, lugemisaegsete ja lugemisjärgsete ülesannete koostamine eesti kirjandusteoste kohta.\n5. Arvamuse kirjutamine filmiõpetuse õppeprogrammi kohta. Kasutada 3 erinevat allikat (tsitaadid, refereeringud) erinevatelt kirjanduse ja filmi eriala teadlastelt. Viidata allikatele TÜ Narva kolledi kirjalike tööde juhendi järgi.\n6. Eneseanalüüs kursusel õpitu kohta kodutööde ja iseseisvate tööde põhjal (sisu, keel, vormistus)"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "1. Kirjandus- ja filmiõpetuse terminoloogia ja Eesti kirjandusliku filmiklassika kohta Kuldvillaku vms virtuaalse mängu koostamine. \nVabalt valitud virtuaalse keskkonna/programmi kasutamine (näit Kahoot, Learning Apps jt.)\nHinnatakse: praktikas rakendatavust, huvitavust, korrektset vormistust (kujundust, õigekirja), eakohasust. \nJuhis: lugege Moodle'ist läbi nõuded virtuaalsetele ülesannetele, eesmärkide ja õpiväljundite püstitamisele. \nKirjutage välja 10 terminit ja andmeid kirjandusteoste põhjal loodud filmide kohta.\nValige programm.\nVormistage kogutud andmed ülesandeks: Ülesandele lisage juurde: sihtrühm (mis klassile); teema, ülesande eesmärgid (mida on vaja selle kaudu õppida), õpiväljundid (mida selle  lahendamise järel oskab). Lisage juurde hindamisviis (täheline, kujundav, arvestuslik), hindamiskriteeriumid või maatriks."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "2. Kirjandusteose ja sellest tehtud filmi süee võrdlus.\nHinnatakse teoste sisu tundmist, oskust sisu võrrelda; kas sündmuste järjestus, rõhuasetus on samad, kas tegelaste osatähtsus sündmuste protsessis on sama kaaluga, kas tegevuskohad ja-ajad kattuvad. jne. \nJuhis:\nValige klassikaliste eesti kirjandusteoste hulgast sobivad teosed (trükis ja film).\nLugege teos läbi ja vaadake ära teosest tehtud film ehk ekraniseering.\nKoostage süee (sisu) võrdlus (soovitav tabelina)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "3. Ülesanne koosneb 2 osast (A ja B) \nA: koostada kirjandusklassikal põhineva filmi järgi 3 ülesannet:\na) vaatamiseelne (näiteks ennustamine, oletused tegelaste, tegevuskoha, -aja kohta jne);sihtrühmaks tavaõpilane.\nb) vaatamisaegne (kindlal eesmärgil katkendi vaatamine: jälgida mees- või naistegelasi, interjööri, looduskeskkonda või kõnet jne);sihtrühmaks lihtsustatud kava järgi õppija)\nc) vaatamisjärgne ülesanne (kokkuvõte, järeldus, fantaseerida tegelaste edasise käekäigu kohta jne). Igale ülesandele lisada sihtrühm (klass), teema, ül eesmärk, õpiväljund, hindamismeetod/ja/või maatriks. Sihtrühmaks HEV ehk andekas õpilane.\nB: Vastastikhindamine. Otsige kursusekaaslane, kellega vahetate ülesanded ja hindate neid. Kaaslase hinnang lisage oma tööle enne postitamist.\nHinnatakse:  sihtrühmale sobivust, ülesande /motiveerivust, vormistust (korrektsus, õigekeelsus)\nJuhis:\nValige sobiv teos.\nLugege Moodle'ist materjale teksti lihtsustamisest, nõuetest õppematerjalile, eesmärkide ja õpiväljundite püstitamisest.\nKoostage ülesanded sihtrühma ja hindamiskriteeriume arvestades."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "4. Lugemiseelsete (noorem kooliaste), lugemisaegsete (keskmine kooliaste) ja lugemisjärgsete ülesannete (vanem kooliaste) koostamine eesti kirjandusteoste kohta.\nÜlesande jaoks valida luuleteos, mis on ka viisistatud. Lisada eesmärk, õpiväljund, hindamisviis/-kriteeriumid/maatriks.\nHinnatakse: sisu tundmist, ülesannete mitmekülgsust ja originaalsust/huvitavust.\nJuhis: \nOtsida klassikaline luuleteos, mis on viisistatud.\nTöötada Moodle'ist läbi materjalid luuleanalüüsi, kõne- ja kõlakujundite jt kohta.\nKoostada ülesanded"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "5. Arvamuse kirjutamine filmiõpetuse õppeprogrammi kohta. Kasutada 3 erinevat allikat (tsitaadid, refereeringud) erinevatelt kirjanduse ja filmi eriala teadlastelt. Viidata allikatele TÜ Narva Kolledi kirjalike tööde juhendi järgi.\nHinnatakse: sisule vastavust, arvustuse tunnustele vastavust, vormistust (vastavust kirjalike tööde juhendi nõuetele, õigekirja)\nLugege läbi filmiõpetuse programm Moodle'ist, RÕKist (riiklikust õppekavast).\nOtsige artikleid, kus on teadlaste seisukohad gümnaasiumi filmiõppe programmi kohta.\nLugege läbi juhend arvustuse kirjutamise kohta.\nKirjutage arvustus. Pikkus 1-1,5 A4 lk."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "6. Eneseanalüüs kursusel õpitu kohta kodutööde ja iseseisvate tööde põhjal (sisu-analüüsimisoskus, keel, vormistus)\nEneseanalüüs (1 A4 lk) peab lähtuma üldjoontes aine eesmärkidest ja õpiväljunditest. \nSoovitav on koostada seda jooksvalt terve kursuse vältel. \nesitage kursuse alguses endale kursuse läbimiseks eesmärgid ja püüdke neid saavutada.  Selle ülesande üheks eesmärgiks on suurendada enesejuhtimisoskust: seada endale eesmärke, leida vahendeid ja meetodeid ning abilisi nende teostamiseks, planeerida endale sobivalt aega, õppida oma vigadest järeldusi tegema, arengusuundi leidma. Teiseks eesmärgiks on parandada enda tegevuse argmenteeritud analüüsimisoskust: väide-näide-järeldus).\n Eneseanalüüs peab sisaldama:\n1)  kodus ja loengus tehtud tööde(iseseisev töö, kontrolltöö, paaris- või rühmatöö) loetelu ja lühianalüüsi, mis osaoskusi antud töö teis arendas, millist kasulikku või uut infot see andis. (teadustööde, artiklite  lugemine, uudsete võtete meetodite õppimine, õppematerjalidele esitatavate nõute tundmaõppimine jne)  \nKui osalesite kolledi üritustel, märkige, millal ja mida külastasite, andke tagasiside üritusele, lisage, missuguse kodutöö asemel see toimus.\n2) Kui palju ja kellega tegite koostööd, kuidas see laabus. Milliseid koostööoskusi peate endas veel arendama.\n3) Kokkuvõte vastastikhindamise tulemustest, protsessist.\n4) Missugune informatsioon ja sõnavara, ülesanne oli kõige uudsem, kasulikum., kergem, raskem. Põhjendage, miks?\n5) Kuidas arenesid Teie eesti keele ja kultuuri/meedia alased teadmised, missugused olid Teie tüüpvead, tugevused ja milles kõige rohkem ennast  edasi arendama peate.\n6) Soovige midagi positiivset oma kursusekaaslastele, kasutades ka mõnda huvitavat aforismi või tsitaati koos viitega mõnest läbi loetud kirjutisest.\nNäpunäiteid eneseanalüüsi paremaks koostamiseks\nNB! ENESEREFLEKSIOON - ära ainuüksi kirjelda, mida teed, vaid arutle ja analüüsi, mida, miks, kuidas te õppisite, mis selle õppeprotsessi kaudu muutus, tooga iga väite tõendamiseks  konkreetseid näiteid, mis ja kuidas mõjutas Sinu õppimist, õpetamist, edasist tegevust.\nEt Teie keeleline õpe oleks tulemuslik, palun lisada kindlasti refleksiooni ka oma kodutööde keelelise arengu analüüs.\nKirjutage välja parandatud kodutöödest oma vead tabelisse ja rühmitage vastavalt veatüübile \n\tViga / töö algvariant\tParandatud variant\tVeatüüp, reegel / selgitus\n1\tPean õppida\tPean õppima ma-inf: pärast \"pean\" on alati ma-infinitiiv\n\t\t\t\n(kirjavahemärgi viga, sõnade järjekord lauses, kokku- ja lahkukirjutamine, rektsioon, ma- ja da- infinitiiv jne), et teada saada oma tüüpvead.\n\nTabeli alla tehke kokkuvõte, mis olid Teie tugevused, mis tüüpi vigu  esines Teie töödes kõige rohkem"}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "1. Iseseisvate tööde sooritamine.\n2. Kontrolltöö 1 sooritamine eesti kirjanduse kohta.\n3. Kontrolltöö 2 sooritamine eesti filmide kohta.\n4. Osavõtt õppekäigust kirjandus- või filmimuuseumi."}, "grade_evaluation": {"et": "Eksamiajad: vaata tunniplaanist\nEksamitöö: valida 1 variant:\na) Lühifilmi või video koostamine ühe kirjandusklassiku novelli järgi, selle esitlemine (kaitsmine).\nb) Lühiuurimus (teema kokkuleppel õppejõuga)"}, "grade_conditions": {"A": {"et": " silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine;"}, "B": {"et": "väga heal tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused;"}, "C": {"et": "heal tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas avaldub ebakindlus ja ebatäpsus;"}, "D": {"et": " piisaval tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste kasutamine harjumuspärases olukorras, kuid erandlikes olukordades avalduvad puudujäägid ja ebakindlus;"}, "E": {"et": "minimaalselt lubataval tasemel olulisemate õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisidel, kuid erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus;"}, "F": {"et": "õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel. Hinne \"F\" on negatiivne tulemus ning eksam tuleb uuesti sooritada."}, "mi": {"et": "õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel, negatiivne tulemus/pole osalenud tegevustes"}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "2 nädalat pärast vastamist"}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "1e1efa62-ab31-48dd-a4a3-26551748882d", "type": "MOODLE", "code": "SVNC.00.116", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Õppematerjalid on Moodle'is."}, "type": {"code": "reference", "et": "Viide", "en": "Reference"}, "required": false}], "mandatory_materials": "https://www.efis.ee/ (Eesti filmi andmebaas)\nVeidemann, R (2011).101 Eesti kirjandusteost. Tallinn: Varrak\nDavidjants, K (2019). Eesti filmi 100 aastat. Tallinn: Printon\nPriimägi, T (2020). 101 eesti filmi. Tallinn: Varrak\nHeidmets, R (2019). Kuidas telefoniga filmi teha?: Koolibri\nhttps://www.youtube.com/watch?v=QNCyC6Vfd74&feature=youtu.be", "recommended_materials": "http://etv.err.ee; www.kanal2.ee; www.tv3.ee; www.etv.ee/otse; www.etv.ee/arhiiv; uudised.err.ee\nhttp://vikerraadio.err.ee/\nwww.youtube.com\njupiter.err.ee\n\nKask, K (2013). Meedia mõju.Tallinn: AS BIT\nE. Peterson. Video võõrkeeletunnis. Keeleõpetaja metoodikavihik. 2000.\nE. Peterson, D. Joassoone. Video ja TV keeleõppe toetajana. I ja (II) osa. CD. 2008.\nDoug Buehl. Interaktiivõppe strateegiad klassiruumis. 2. väljaanne"}, "participants": {"lecturers": [{"person_uuid": "b22b38f4-f6a4-cb5c-684d-44b2a15ab0ec", "person_name": "Enda Trubok", "structural_unit": {"code": "SVNC03", "name": {"en": "Division of Estonian Language", "et": "eesti keele lektoraat"}, "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVNC", "is_expired": true}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "time": "2024-09-04", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Sissejuhatus ainesse, kodutööde tutvustamine"}, "description": {"et": "Kõigil esimesel loengul kohustuslik kohal olla. Praktilisi harjutusi. Kirjandusklassika mõistest.  "}}, {"course_week": 1, "time": "2024-09-11", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Tuntumad kirjandusteosed ja nende ekraniseeringud"}, "description": {"et": "Käsitletavate kirjandusteoste ja filmide tutvustamine.\nKirjandus- ja filmiterminoloogia  kordamine."}}, {"course_week": 1, "time": "2024-09-18", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Filmi liigid"}, "description": {"et": "\nFilmi liigid: mängufilm, kirjandusteose põhjal valminud film, dokumentaalfilm, telelavastus, laste-ja animafilmid, filmimuusika, Muusikavideod. Video salvestamine intervjuust reissööriga (rollimäng).\n\nKODUS: valige 3 kirjandusklassika teost kodulugemiseks.  Ülesanne: lugeda, teha märkmeid vastamiseks, uued sõnad kanda Moodle'i ühisesse sõnastikku koos tähendusega."}}, {"course_week": 1, "time": "2024-09-25", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Võrdlev analüüs"}, "description": {"et": "Iseseisev töö Moodle'i juhiste ja materjalide põhjal. \nTeema: Kirjandusteoste, mille kohta on ekraniseering, analüüs.\n1. Otsida kirjandusklassika hulgast teos /katkend analüüsimiseks;\n2. määrata 2-3 konkreetset kriteeriumi/teemat, mida analüüsite (tegevuskoht, nais- või meestegelased, pea- või kõrvaltegelased, ajastu, sündmustik jne. \nVõrrelge klassikalist kirjandusteost ja filmi, \nKodutöö: Valida kursuse lõputööks teos, mille kohta teete uurimuse või lühifilmi \"Eesti kirjandusklassika ajaloolises kontekstis.\"\nSelleks otsige materjale teose tegevusaja (ajastu) kohta jne.\nvõi lavastage teose katkend, kirjutage filmistsenaarium ja filmige nutitelefoniga lühifilm."}}, {"course_week": 1, "time": "2024-10-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Kirjandusteose ja filmikeel"}, "description": {"et": "Kirjandusteoste ja filmide keel. Otsida klassikalistest teostest põnevaid sõnu ja väljendeid, mida kasutada lühikõne koostamisel nii kirjalikult kui ka suuliselt ette kandes. Teisi kuulates leida kõne mõte ja esitada esinejale küsimusi."}}, {"course_week": 1, "time": "2024-10-09", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Tekstianalüüs, ülesannete koostamine"}, "description": {"et": "Tekstianalüüs. Võrdluse koostamine. Nõuded ja juhised õppematerjalide koostamiseks."}}, {"course_week": 1, "time": "2024-10-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Metoodilisi võtteid ja meetodeid"}, "description": {"et": "Metoodilised võtted: stoppkaader jätke film põneva koha pealt seisma, laske jutustada või kirjutada, mis sai edasi. Mosaiik: pange filmi(de) põnevamatest sündmustest (tegelastest) kokku mosaiik."}}, {"course_week": 1, "time": "2024-10-23", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Kontrolltöö (kirjandusklassika)"}, "description": {"et": "Kontrolltöö 1 "}}, {"course_week": 1, "time": "2024-10-30", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Filmiõpetus koolis"}, "description": {"et": "Filmiõpetus koolis. Filmikatkenditest inspireeritud essee. Autentne videomaterjal ja selle kasutamine.\nNutitelefoniga filmida huvitavaid stseene (päriselu või lavastatud) kaasõpilasi kaasates. Filmist inspireeritult kirjutada loovtöö/essee."}}, {"course_week": 1, "time": "2024-10-30", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Metoodilised põhivõtted filmi/video vaatamiseks"}, "description": {"et": "Filmi liigid. Metoodilised põhivõtted filmi või video vaatamisel: filmi/videolõigu vaatamine heli ja pildiga, helita pilt,\nÜlesanne:\na) Vaadake ühte katkendit/sündmust nii, et heli ei ole kuulda\nb) Vaadake mõnda katkendit/sündmust nii, et pilti pole näha, aga heli on kuulda (pildita heli),"}}, {"course_week": 1, "time": "2024-11-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Stsenaariumi koostamine"}, "description": {"et": "Filmistsenaariumi koostamine lühijutu või tekstikatkendi järgi."}}, {"course_week": 1, "time": "2024-11-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Välis-Eesti kirjandus. Pagulaskirjanikud"}, "description": {"et": "Eesti pagulaskirjanikke."}}, {"course_week": 1, "time": "2024-11-20", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Lühifilmi  tegemine"}, "description": {"et": "\nTeooria + praktika. Võtke kaasa nutitelefon või kaamera. "}}, {"course_week": 1, "time": "2024-11-27", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Filmiülesannete tutvustus"}, "description": {"et": "Praktilisi nõuandeid ülesannete kohta"}}, {"course_week": 1, "time": "2024-12-04", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 1, "topic": {"et": "Kordamine, tagasiside"}, "description": {"et": "Praktilisi harjutusi, ülesandeid"}}, {"course_week": 1, "time": "2024-12-11", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Kontrolltöö 2 (filmiõpetus)"}, "description": {"et": "Kontrolltöö 2"}}, {"course_week": 1, "time": "2024-12-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Ülesannete vormistamine"}, "description": {"et": "Õppematerjali koostamine. Vormistamine. Eesmärkide ja õpiväljundite püstitamine."}}, {"course_week": 1, "time": "2024-12-25", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Eneseanalüüs, kaaslase töö hindamine"}, "description": {"et": "Analüüsimine."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Filmianalüüs"}, "description": {"et": "Animafilmi vaatamine, analüüs."}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Lõputöö näidistega tutvumine, konsultatsioonid lõputöö koostamiseks"}, "description": {"et": "Näidis-lõputööde  analüüs"}}, {"course_week": 1, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Õppekäik võimaluse korral."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Arvustuse või arvamusloo kirjutamine õppekäigu/teose/filmi kohta."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Lõputöö: uurimus või lühifilm"}, "description": {"et": "Lõputöö koostamine. Konsultatsioonid."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Analüüs"}, "description": {"et": "Filmianalüüs. Interaktiivsed ülesanded."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Kirjandusteoste ja filmide kordamine. Lõputöö koostamine."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "Kodulugemise vastamine."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Kodulugemise vastamine."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "Praktikum õpitu teemal. Interaktiivsed ülesanded."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Eneseanalüüs."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {"et": "Lõputööde esitlemine"}, "description": {"et": "Eksamiks valmistumine. Eksam. Lõputöö kaitsmine."}}]}, "registration_info": {"audience": {"et": "KMK EK 2"}}, "confirmation_process": {"confirmation_uuid": "ecab18c4-853c-ebd4-ee87-4b39ee1f3085", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "a1bd67cd-3bc7-2cec-2088-a12c6f5f898e", "parent_code": "SVNC.00.116", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}