{"uuid": "96873ca5-78d1-0f2c-9acb-b2dd001e6f94", "code": "SVNC.00.136", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Inclusive Education", "et": "Kaasav haridus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The subject course allows acquiring basic knowledge and skills to recognize the special needs of learners and to create the necessary conditions for the implementation of inclusive education.", "et": "Ainekursus võimaldab omandada põhilised teadmised ja oskused õppijate erivajaduste märkamiseks ning vajalike tingimuste loomiseks kaasava hariduse rakendamisel."}, "objectives": [{"en": "To support student`s development as a teacher who has primary readiness to design a safe and inclusive learning environment and teach in inclusive group or classroom.", "et": "Toetada üliõpilase kujunemist õpetajaks, kes omab esmast valmisolekut kujundada turvaline ja kõigi õppijate kaasamist toetav õppekeskkond ning töötada kaasava rühma- või klassi tingimustes."}], "learning_outcomes": [{"en": "A student who has passed the subject: ", "et": "Õppeaine läbinud üliõpilane: "}, {"en": "1) understands the approach of inclusive education and its implementation possibilities; ", "et": "1) mõistab kaasava hariduskorralduse käsitlusviisi ja selle rakendusvõimalusi; "}, {"en": "2) is familiar with the main operating models of networking and knows his/her role in implementing inclusive education; ", "et": "2) tunneb peamiste koostöövõrgustike toimimise mudeleid ja teab oma rolli kaasava hariduse rakendamisel; "}, {"en": "3) knows the most common types of special needs and their main characteristics; is able to notice them in the course of study and to plan initial adaptations in the group or class to support the learner's development;  ", "et": "3) teab enamlevinud erivajaduste liike ja nende peamiseid tunnuseid, oskab neid õppetöö käigus märgata ning kavandada rühmas/klassis esmaseid kohandusi õppija arengu toetamiseks; "}, {"en": "4) knows the principles of designing individual developing or educational programme (IDP or IEP); is able to analyse compiled IDP/IEP and participate in its preparation; ", "et": "4) teab, individuaalse arendus- või õppekava koostamise põhimõtteid; oskab analüüsida koostatud IAK/IÕK ja selle koostamisel osaleda;  "}, {"en": "5) knows the basic principles of socio-emotional competences, the algorithm for compiling a behavioural support plan and the criteria for an effective support plan and is able to analyse compiled plan.", "et": "5) teab sotsioemotsionaalsete pädevuste kujundamise aluspõhimõtteid, tunneb käitumise tugikava koostamise algoritmi ja tõhusa tugikava iseloomustavaid kriteeriume ning oskab nende abil analüüsida koostatud kava."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}