{"uuid": "29abfcf6-d4ff-0022-852b-a8d4158276b7", "code": "SVNC.00.156", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Estonian Writing and Speaking Skills", "et": "Eesti keele suuline ja kirjalik eneseväljendus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false, "language_training": {"language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "start_level": {"code": "B2.2", "et": "B2.2", "en": "B2.2"}, "end_level": {"code": "C1", "et": "C1", "en": "C1"}, "is_in_depth_estonian_training": true}}, "overview": {"description": {"en": "Different peculiarities and types of oral and written self-expression are introduced. The written self-expression focuses primarily on the academic text. The  oral self-expression deals with both individual public speech and public debate (parliamentary debate format). During the course, students learn to draft and structure texts (both oral and written). It also teaches argumentation and counter-argumentation. The course also teaches you how to recognize demagogy and how to deal with it. In addition, recommendations are given on how to make your performance more effective, which is to consider when using the body and paralanguage.", "et": "Tutvustatakse erinevaid suulise ja kirjaliku eneseväljenduse eripärasid ja liike. Kirjalik eneseväljendus keskendub eelkõige teaduslikule tekstile. Suuline eneseväljendus tegeleb nii individuaalse avaliku kõne kui ka avaliku väitlusega (parlamentaarne väitlusformaat). Kursuse käigus õpivad tudengid teksti (nii suulise kui ka kirjaliku) koostamist ja struktureerimist. Samuti õpetatakse argumenteerimist ning vastuargumenteerimist. Kursus õpetab ka demagoogiavõtete äratundmist ning annab soovitusi, kuidas nendega tegeleda. Lisaks antakse soovitusi, kuidas muuta oma esinemine mõjusamaks, mida silmas pidada keha- ja parakeele kasutamisel."}, "objectives": [{"en": "The student has developed written expression skills, in particular, by working with academic texts,  and oral expression skills, including both individual speech and debating skills; the student knows and is able to use the most important language managing sources.", "et": "Üliõpilasel on arendatud kirjaliku väljenduse oskusi, eelkõige töötamist teadusliku tekstiga ja suulise väljenduse oskusi, sh nii individuaalse kõne kui ka väitlusoskust; üliõpilane  teab ja oskab kasutada olulisemaid keelehooldeallikaid."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "The student: \n- analyses academic texts; \n- enables to compile a comprehensively written summary; \n- assesses the quality of the academic text prepared by co-students; \n- enables to express students' thoughts in a correct, clear and appropriate style; \n- explains the basic knowledge necessary for delivering a public speech; \n- develops the skill of making one's own presentation speech;  \n- enables to give arguments to defend one's own opinion in debates; to assess critically own skills of oral and written self-expression.", "et": "Üliõpilane: \n- analüüsib teaduslikku teksti;\n- koostab põhjaliku kirjaliku kokkuvõtte;\n- hindab kaasüliõpilaste koostatud akadeemilise teksti kvaliteeti;\n- väljendab oma mõtteid õigekeelselt, ühemõtteliselt ja sobiva stiiliga; \n- selgitab avaliku kõne koostamiseks vajalikke alusteadmisi;\n- rakendab iseseisva kõne esitamise oskust;\n- argumenteerib põhjendatult oma seisukoha kaitseks elavas debatis;\n- hindab kriitiliselt oma suulise ja kirjaliku väljenduse oskust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}