{"uuid": "0c29bc3f-882a-890b-7315-ad155403146c", "code": "SVNC.00.255", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-08T10:13:57", "title": {"en": "Media Criticism and Awareness in Self-Representation", "et": "Meediakriitika ja teadlikkus eneseesitluses"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Journalism quality, commercialization and criticism of values, influence of Internet journalism and social media and especially of international platforms on journalism.\n-\tcriteria of good journalism, media's responsibility and why trust towards journalism is important in the society;\n-\tcritical reading skills, media- and information literacy in general in different formats;\n-\tself-representation in social media, its aims, rules, possibilities, and dangers.", "et": "Ajakirjanduse kvaliteet, kaubastumise ja väärtuste kriitika, veebiajakirjanduse ja  sotsiaalmeedia ning eriti  rahvusvaheliste platvormide mõju ajakirjandusele.\n- hea ajakirjanduse kriteeriumid, meedia vastutus ja miks on usaldus ajakirjanduse vastu üldse ühiskonnas oluline.\n- kriitiline  lugemisoskus, meedia- ja infokirjaoskus laiemalt erinevates formaatides\n- eneseesitlus sotsiaalmeedias, selle eesmärgid, reeglid, võimalused, ohud."}, "objectives": [{"en": "To develop media competence, to learn about the main issues of media criticism, to create dispositions for one's competent and purposeful representation in media.", "et": "Meediapädevuse  arendamine, meediakriitika põhiprobleemide tundmaõppimine, luua eeldused enese pädevaks ja eesmärgikohaseks esitlemiseks  meedias."}], "learning_outcomes": [{"en": "Upon completion of the subject a student:", "et": "Aine läbinu üliõpilane: "}, {"en": "- can identify the main issues of media criticism;", "et": "- oskab esile tuua meediakriitika peamisi probleemipüstitusi"}, {"en": "- can define the role of media criticism in the modern society;", "et": "- suudab määratleda, mis on meediakriitika roll tänases ühiskonnas"}, {"en": "- understands what is meant by the today's journalism crisis;", "et": " - mõistab, mida mõeldakse, kui räägitakse ajakirjanduse kriisist täna"}, {"en": "- understands the meaning of tabloidization and commercialization of journalistic content and why they are considered problems and dangers to good journalism and to the level of public debate;", "et": "- saab aru, mis on ajakirjandusliku sisu tabloidistumine ja kaubastumine ja miks peetakse seda probleemiks ja ohuks heale ajakirjandusele ning   avaliku debati tasemele "}, {"en": "- can identify criteria of good journalism in free journalism;", "et": "- oskab esile tuua, mis on hea ajakirjanduse kriteerumid vabas ajakirjanduses"}, {"en": "- understands what the responsibility of media is and why it is important for media to be trusted by the society;", "et": "- mõistab, milles seisneb  meedia vastutus ja miks on usaldus ajakirjanduse vastu üldse ühiskonnas oluline"}, {"en": "- can explain why the discussion over media criticism evolves around Internet journalism and social media nowadays and how international platforms affect journalism.", "et": "- oskab seletada, miks hõlmab meediakriitiline diskussioon täna üha rohkem veebiajakirjanduse ja  sotsiaalmeedia ning rahvusvaheliste platvormide mõju ajakirjandusele"}, {"en": "- acquaints themself with The code of ethics for the Estonian press and understands the functions and limitations of the document;", "et": "- tutvub näitena Eesti ajakirjanduse eetikakoodeksiga ja saab aru, mida see reguleerib ja millised on piirangud"}, {"en": "- is aware of the universal standards of western free journalism;", "et": "- tunneb lääneliku vaba ajakirjanduse universaalseid standardeid"}, {"en": "- understands systematic limitations that the media industry sets for free journalism in the democratic society;", "et": "- mõistab meediatööstuse süsteemseid piiranguid  vabale ajakirjandusele demokraatlikus ühiskonnas"}, {"en": "- is well aware of the information disorder topic and knows means of fighting information disorder;", "et": "- orienteerub infokorratuse teemas ja teab sellega võitlemise vahendeid "}, {"en": "- can present themself in compliance with the aim;", "et": "- oskab ennast esitleda  sotsiaalmeedias vastavalt eesmärgile"}, {"en": "- understands aims, possibilities and dangers of social media.", "et": "- mõistab sotsiaalmeedia reegleid, võimalusi ja ohtusid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}