{"uuid": "00b1e46c-5078-b8ab-c643-50fcad708740", "code": "SVNC.00.154", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Speech Development in Early Years", "et": "Kõnearendus koolieelses eas"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Psychological, linguistic and psycholinguistic laws of children's speech development. Development of forms and functions of speech. Dynamics of speech development in early years. Aim and methodology of children's speech development in early years educational institutions. Teaching reading and writing in the kindergarten.", "et": "Lapse kõne arengu psühholoogilised, lingvistilised ja psühholingvistilised seaduspärasused. Kõne vormide ja funktsioonide areng. Koolieelse kõnearenduse dünaamika. Lapse kõne arengu ülesanded ja metoodika koolieelsetes lasteasutustes. Lugemise ja kirjutamise õpetamine lasteaias."}, "objectives": [{"en": "To introduce to the students the rules of children's speech development, the content and methodology of speech development in kindergartens.", "et": "Tutvustada üliõpilastele laste kõne arengu seaduspärasusi, kõne arengu sisu ja metoodikat koolieelsetes lasteasutustes."}], "learning_outcomes": [{"en": "1) has knowledge about the studied field, the patterns of child's speech development, the basic principles of content choice and teaching methodology of speech development; ", "et": "1) omab teadmisi õpetatavast ainevaldkonnast, laste kõne arengu seaduspärasust, kõne arengu sisu valiku põhialustest ja õpetamise põhimõtetest ning metoodikast; "}, {"en": "2) is able to consider the aims of the national and school curriculum and development plan when planning lessons, can compose a syllabus and action plan; ", "et": "2) oskab arvestada õppe kavandamisel riikliku ning õppeasutuse õppekava ja arengukava eesmärke, koostada ainekava või tegevuskava; "}, {"en": "3) can set clear aims and learning outcomes for a lesson and a course, taking into account cross-curricular themes; ", "et": "3) oskab seada õppele, ainekursusele ja tunnile selgeid eesmärke ning määratleda õpitulemused, arvestades läbivaid teemasid; "}, {"en": "4) can use age, ability and aim-appropriate group and individual work techniques and activities; ", "et": "4) oskab kasutada õppe eesmärgile, õppijate eale ja võimetele sobivaid rühmapõhiseid ja individuaalseid õppemeetodeid ja -vorme; "}, {"en": "5) is able to select assessment methods which are relevant to learners' development and anticipated learning outcomes.", "et": "5) oskab valida õppijate arengule ja oodatavatele õpitulemustele vastavaid hindamismeetodeid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}