{"uuid": "4a2f586a-5805-9be7-3158-e21662a0ee55", "code": "SVNC.00.132", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Contemporary Russian Literature and Cinematography in the Studies of Russian as a Foreign Language", "et": "Kaasaegne vene kirjandus ja filmikunst vene keele võõrkeelena õppes"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of trends, genres and types of books in contemporary literature; the history of Russian cinema, the works of well-known Russian directors, the specialty of famous feature films and cartoons, and the reception of Russian films in Russia and abroad. The works of contemporary Russian authors (including children's writers' works) will be discussed and analyzed, and the possibilities of using Russian films in foreign language lessons for foreigners will be examined.", "et": "Kursus annab ülevaate kaasaegse kirjanduse arengutendentsidest, žanritest ja raamatutüüpidest; vene filmikunsti ajaloost, vene tuntud lavastajate loomingust, kuulsate mängufilmide ja multifilmide eripärast ja vene filmide retseptsioonist Venemaal ja välismaal. Käsitletakse ja analüüsitakse tänapäeva vene autorite loomingut (sealhulgas lastekirjanike teoseid) ning vaadeldakse vene filmide kasutamise võimalusi vene keele tundides välismaalastele."}, "objectives": [{"en": "To give an overview of the development trends of contemporary Russian literature (including children's literature), to teach to understand and analyze works, problems, and ideas of contemporary fiction. Introduce the history of Russian cinema through well-known directors, observe branded films and their use in Russian as a foreign language.", "et": "Anda ülevaade kaasaegse vene kirjanduse (sealhulgas lastekirjanduse) arengutendentsidest, õpetada mõistma ja analüüsima kaasaegse ilukirjanduse teoseid, probleeme ja ideid. Tutvustada vene filmikunsti ajalugu tuntud lavastajate kaudu, vaadelda märgilisi filme ja nende kasutamise võimalusi vene keele võõrkeelena tundides."}], "learning_outcomes": [{"en": "After passing the course, the student:", "et": "Kursuse läbinud üliõpilane: "}, {"en": "1) knows authors, works, genres, styles of contemporary Russian literature and children's literature;", "et": "1) teab kaasaegse vene kirjanduse ja lastekirjanduse autoreid, teoseid, žanre, stiile;"}, {"en": "2) knows the tendencies of contemporary literature and their theoretical approaches;", "et": "2) tunneb kaasaegse kirjanduse arengutendentse ja nende teoreetilisi käsitlusi;"}, {"en": "3) can independently analyze a literary work and relate it to a literary context", "et": "3) oskab iseseisvalt analüüsida kirjandusteost ning seostada kirjandusliku kontekstiga"}, {"en": "4) Is familiar with the context of the production of famous classic and contemporary Russian films and the peculiarities of the reception of observers;", "et": "4) tunneb kuulsate klassikaliste ja kaasaegsete vene filmide loomise konteksti ja vaatlejate retseptsiooni eripära;"}, {"en": "5) can analyze texts of feature films and cartoons;", "et": "5) oskab analüüsida mängufilmide ja multifilmide tekste;"}, {"en": "6) sees opportunities to use Russian films to develop foreign language skills and socio-cultural competences of foreigners.", "et": "6) näeb võimalusi kasutada vene filme välismaalaste vene keele osaoskuste ja sotsiaalkultuurilise kompetentside arendamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}