{"uuid": "df36da84-bb2f-9fe6-1db4-47687148a0a4", "code": "SVNC.00.168", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Management and Communication", "et": "Juhtimine ja kommunikatsioon"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Development of management and communication skills for use in youth work.", "et": "Arendatakse juhtimis- ja kommunikatsioonioskuseid kasutamiseks noorsootöös."}, "objectives": [{"en": "The student understands the basic knowledge about the functioning and management of organizations and the basics of communication, based on the specifics of youth work.", "et": "Üliõpilane mõistab alusteadmisi organisatsioonide toimimisest ja juhtimisest ning kommunikatsiooni põhialustest, lähtudes noorsootöö spetsiifikast."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "The student: \n- understands different roles of an individual in an organization; to explain the meaning of the concept of communication, its processes and functions, different models and forms of public communication;\n- understands the role of public communication and the importance of social marketing and the importance of using them in youth work; \n- establishes different relationships between potential groups and the organisation; \n- explains the nature and the core business of the concept of management and quality management, including business operations;\n- understands the most important management theories and their practical applications;\n- understands the competence and management functions required for a modern leader, including various models of communication processes and functions; \n- analyses the organization, its performance against internal and external factors.", "et": "Üliõpilane: \n- mõistab indiviidi erinevaid rolle organisatsioonis;\n- selgitab kommunikatsiooni mõiste tähendust, selle protsesse ja funktsioone, erinevaid mudeleid ning avaliku kommunikatsioone vorme;\n- mõistab avaliku kommunikatsiooni rolli ja sotsiaalse turunduse tähendust ning nende kasutamise tähtsust noorsootöös;\n- seostab erinevaid võimalike gruppide ja organisatsiooni omavahelisi seoseid;\n- selgitab juhtimise ja kvaliteedijuhtimise mõiste olemust ja põhitegevust, sh asjaajamistoimingud;\n- mõistab olulisimaid juhtimisteooriaid ja nende praktilisi rakendusvõimalusi;\n- mõistab kaasaegsele juhile vajalikke kompetentse ja juhtimisfunktsioone, sh kommunikatsiooniprotsesside ja funktsioonide erinevaid mudeleid;\n- analüüsib organisatsiooni, selle toimimise vastavust sise- ja väliskeskkonna teguritele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}