{"uuid": "9b182c32-e659-ca00-7a11-cac8cd19e308", "code": "SVNC.00.208", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-21T11:11:26", "title": {"en": "Functional Aspect of Grammar", "et": "Grammatika funktsionaalne aspekt"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The subject analyzes the functional-semantic fields of the Russian language, the functional peculiarities of the grammatical categories of the language. The course presupposes previous knowledge of formal grammar.", "et": "Aine raames vaadeldakse vene keele funktsionaal-semantilisi väljasid, keele grammatiliste kategooriate funktsionaalseid eripärasid. Kursus eeldab eelnevaid teadmisi formaalsest grammatikast."}, "objectives": [{"en": "To provide an overview of the functional-semantic fields of the Russian language. By offering students practical tasks, to develop their skills to analyze Russian-language grammatical categories, syntactical constructions and other language means in the text from the standpoint of functional-semantic fields.", "et": "Anda ülevaade vene keele funktsionaal-semantilistest väljadest. Praktiliste tööde kaudu kujundada oskus analüüsida tekstis vene keele grammatikakategooriaid, süntaktilisi konstruktsioone ja teisi keelevahendeid funktsionaal-semantiliste väljade seisukohast."}], "learning_outcomes": [{"en": "Upon completion of the subject a student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) knows the basics of functional grammar and critically evaluates different approaches to the functional descriptions of a language;", "et": "1) tunneb funktsionaalse grammatika aluseid ja hindab kriitiliselt erinevaid lähenemisi keele funktsionaalsele kirjeldamisele;"}, {"en": "2) analyzes grammatical forms, the syntactical constructions of speech and other language means from the standpoint of functional-semantic fields;", "et": "2) analüüsib grammatilisi vorme, kõne süntaktilisi konstruktsioone ja teisi keele vahendeid funktsionaal-semantiliste väljade seisukohast;"}, {"en": "3) emphasizes the functional approach when teaching grammar to foreign students.", "et": "3) toob esile välisõpilastele funktsionaalset lähenemist grammatilise materjali esitamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}