{"uuid": "7abf6f25-792c-e375-a4b9-99a721fbf770", "code": "SVNC.00.129", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-01T18:24:39", "title": {"en": "Cultural Component and Learning Environment in Target-language Learning", "et": "Õpikeskkond ja kultuur sihtkeelses õppes"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Methodology of teaching in the target language; different ways for simplifying methods and activating students' knowledge. Lesson planning and analysing. The notion of the learning environment and its types: physical, emotional, and social. The learning environment inside and outside of the classroom, virtual learning environment. Planning the study process based on the possibility of the learning environment. Culturally sensitive teaching.", "et": "Sihtkeelse õppe metoodika, erinevad võtted meetodite lihtsustamiseks ning õpilaste aktiviseerimiseks. Tunni konspekti koostamine ja analüüsimine. Õpikeskkonna mõiste ja selle erinevad tüübid: füüsiline, vaimne, sotsiaalne, klassiväline ja virtuaalne õpikeskkond. Õppetöö kavandamine õpikeskkonna võimalustega arvestades. Kultuuri mõiste ja selle tähtsus haridusprotsessis. Erinevad kultuuri aspektid, võimalused nende lõimimiseks erinevate õpeainetega. Häälestus-, õppimis- kui ka kinnistamisfaasi sisaldava õppeülesande koostamine, kus on kasutatud Eesti kultuuri mõnd objekti."}, "objectives": [{"en": "1) to introduce the methodology of teaching in the target language and to explain how it is different from a lesson in the students' first language;", "et": "1) tutvustada sihtkeelse õppe metoodikat ja selgitada sihtkeelse tunni ülesehituse erinevust tavatunnist;"}, {"en": "2) to teach how to activate students and prepare them for language acquisition in content lessons ", "et": "2) õpetada aktiviseerima õpilasi keele omandamise eesmärgil erinevates ainetundides;"}, {"en": "3) to introduce possibilities for integrating cultural awareness into the study process", "et": "3) tutvustada erinevaid võimalusi, kuidas kultuuri aspekte õppetöösse integreerida;"}, {"en": "4) to introduce different types of the learning environment and their importance in modern teaching.", "et": "4) Tutvustada erinevate õpikeskkonna tüüpe sihtkeelses õppes ja nende tähtsust tänapäeval õppimises."}], "learning_outcomes": [{"en": "On completion of the subject a student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1) knows principles and methods of teaching in a target language", "et": "1) teab sihtkeelse õppe põhimõtteid ja rakendatavaid meetodeid;"}, {"en": "2) can consider peculiarities of a student's language development and the impact of the environment in teaching in the target language", "et": "2) oskab arvestada sihtkeele õppes lapse keelelise arengu eripäraga ja keskkonna mõjuga;"}, {"en": "3) is aware of the notion of the learning environment, its importance in teaching in the target language and knows about the diversity of the learning environment", "et": "3) teadvustab õpikeskkonna mõistet, selle tähtsust õppimises ning on tutvunud õpikeskkonna mitmekesisusega;"}, {"en": "4) has received an overview of the cultural room in the study process and of the integration of the cultural component in planning of the study process.", "et": "4) omab ülevaadet kultuuriruumist haridusprotsessis ning kultuuri komponendi lõimimise võimalustest õppeprotsessi kavandamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}