{"uuid": "74dda062-c3b1-91fd-905f-cdfd85ba6af2", "code": "SVNC.00.106", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Academic Writing", "et": "Akadeemilise kirjutamise alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 3, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will provide an overview of the structure and composition of various educational research texts; be trained to search for specialized literature; define, structure material; properly refer; use professional terms correctly.", "et": "Kursusel antakse ülevaade erinevate haridusalaste teadustekstide struktuurist ja kompositsioonist; õpetatakse otsima erialakirjandust; defineerima, materjali struktureerima; nõuetekohaselt  viitama; kasutama korrektselt erialaseid termineid."}, "objectives": [{"en": "The overall goal is to develop the basic academic writing skills needed in field-specific studies to prepare students to write professional research papers.", "et": "Üldeesmärk on valdkonnaspetsiifilistes õpingutes vajaminevate akadeemilise kirjutamise põhioskuste  kujundamine, valmistamaks üliõpilasi ette kirjutama erialateemalisi teadustekste."}], "learning_outcomes": [{"en": "Upon completion of the subject, the student follows the recognized practice of academic writing in the academic field and is able to express himself or herself clearly in academic writing in their professional field. He/she has acquired academic writing conventions and norms and is able to use to to write educational research texts; can choose information from databases of his / her specialty; write a proper introduction and summary; use correct referencing and is able to write / complete a Bachelor's thesis, following the Narva College of the University of Tartu guidelines for written tasks .", "et": "Õppeaine läbinud üliõpilane järgib sotsiaalvaldkonnas tunnustatud akadeemilise kirjutamise tavasid ning oskab väljendada end mõistetavalt erialases teaduskeeles. Ta on omandanud haridusalaste teadustekstide koostamise sisulised ja kompositsioonilised normid; oskab valida infot oma eriala andmebaasidest; kirjutada nõuetekohast sissejuhatust ja resümeed; kasutada korrektset viitamist ning on võimeline kirjutama/ vormistama bakalaureusetööd, lähtudes Tartu Ülikooli Narva kolledži kirjalike tööde juhendist."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}