{"uuid": "c6c8071a-a6a4-dfa2-a874-563dffda70f9", "code": "sv-2025-spring-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-10T11:58:05", "title": {"en": "Teacher's Identity and Teacher Agency", "et": "Õpetaja identiteet ja tegevusvõimekus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolled"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S block mode SV", "et": "25/26 K SÕ SV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolled"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 16, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course introduces the learning professional's approach and the model of teacher agency which are implemented for the analysis of the student's life experience and knowledge base accumulated during studies and also for the establishment of a vision for teaching at an individual as well as a group level. Cultural, structural and material factors affecting the teacher's work, including regulations, are introduced. Evidence-based methods are used to enhance cooperation with different parties. The possibilities of an exploratory approach to support the professional development of a teacher are analysed. The process of compiling documents guiding the development of the field of education and the possibilities of contributing to it will be examined.", "et": "Ainekursusel tutvutakse õppiva professionaali käsitluse ja õpetaja tegevusvõimekuse mudeliga ning rakendatakse neid üliõpilase elukogemuse ja õpingute raames omandatud pagasi analüüsil ning õpetamise visiooni loomisel indiviidi ja õpetajate rühma tasandil. Tutvutakse õpetaja tööd mõjutavate kultuuriliste, struktuuriliste ja materiaalsete teguritega, sh õpetaja tööd mõjutavate regulatsioonidega. Kasutatakse tõenduspõhiseid meetodeid erinevate osapooltega koostöö tõhustamiseks. Analüüsitakse uurimusliku lähenemise võimalusi õpetaja professionaalse arengu toetamiseks. Tutvutakse haridusvaldkonna arengut suunavate dokumentide koostamisprotsessi ja sellesse panustamise võimalustega."}, "objectives": [{"en": "To support the development of both personal and collective teacher agency and taking an active role in both the teachers' community and wider society.", "et": "Toetada õpetaja isikliku ja kollektiivse tegevusvõimekuse kujunemist ning aktiivse rolli võtmist nii õpetajate kogukonnas kui ka laiemalt ühiskonnas."}], "learning_outcomes": [{"en": "On completion of the course the student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1.\tUnderstands how teacher agency and professionalism develops;", "et": "1)\tMõistab, kuidas kujuneb õpetaja tegevusvõimekus ja professionaalsus."}, {"en": "2.\tAppreciates how his/her own life experience, practical knowledge and values and attitudes allow him/her to work as a teacher.;", "et": "2)\tHindab, kuidas tema enda elulugu, praktilised teadmised ning väärtused ja hoiakud võimaldavad tal töötada õpetajana."}, {"en": "3.\tCreates his/her own vision of teaching that connects personal and professional long-term goals;", "et": "3)\tLoob oma õpetamise visiooni, mis seob personaalsed ja professionaalsed pikaajalised eesmärgid."}, {"en": "4.\tUnderstands how cultural, structural and material factors at different levels affect teachers' work;", "et": "4)\tMõistab, kuidas kultuurilised, struktuurilised ja materiaalsed tegurid erinevatel tasanditel mõjutavad õpetaja tööd."}, {"en": "5.\tCan apply evidence-based teacher collaboration and exploratory approach methods to shape the professional knowledge and vision shared by teachers;", "et": "5)\tOskab rakendada tõenduspõhiseid õpetajate koostöö ja uurimusliku lähenemise meetodeid õpetajate jagatud erialase teadmuse ja visiooni kujundamiseks."}, {"en": "6.\tCan apply evidence-based methods for collaborating with learners' families and communities;", "et": "6)\tOskab rakendada tõenduspõhiseid meetodeid koostööks õppijate perede ja kogukonnaga."}, {"en": "7.\tUnderstands how documents are drawn up and how to contribute to the development of education, including through industry associations and expert groups.", "et": "7)\tMõistab, kuidas koostatakse haridusvaldkonna arengut suunavaid dokumente ja kuidas selles panustada, sh valdkonna ühenduste ja ekspertgruppide kaudu"}], "notes": {}}, "grading": {"independent_work": {"et": "1. Iseseisev töö: koostada oma lugu (esitlus, pildiseeria, kuni 10-minutiline video, tekst), mis katab kaks teemat:\na) Kes ma olen inimesena, mida ootab minult õpetaja roll ja kuidas need kokku sobivad?\nb) Milline on minu õpetamise visioon ja professionaalse arengu kava.\n2. Rühmatöö: meie rühma identiteet ja visioon.\n3. Rühmatöö: õpetajate koostöö tegemise viiside analüüs kolme näite põhjal. Õppijate perede ja kogukonnaga koostööks tegevuskava koostamine (probleem, eesmärgid, tegevused, hindamine).\n4. Rühmatöö: erinevad võimalused haridusvaldkonna arengu suunamisel ja analüüs, mil viisil saaks lähitulevikus oma haridusasutuse või laiema erialakogukonna tasemel panustada.\n5. Iseseisev töö: oma identiteedi ja visiooni analüüs ning professionaalse arengu kava koostamine lähtudes kursusel õpitust ja arvestades riiklikke haridusprioriteete. Eksam/arvestus.\nTäpsemad juhised on kättesaadavad Moodle' kursusel."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Minu kui õpetaja roll ja visioon (oma lugu). Lugu sisaldab teemasid:\n- Kes ma olen inimesena, mida ootab minult õpetaja roll ja kuidas need seostuvad.\n- Milline on minu pedagoogiline visioon ja mida ma teen igapäevaselt, et liikuda oma visiooni suunas."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Meie rühma identiteet ja visioon. Rühmatöö sisaldab teemasid:\n- Milline on meie rühma pedagoogiline visioon ja miks on see meie jaoks oluline.\n- Mida me teeme/saame teha igapäevaselt, et liikuda oma visiooni suunas"}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Õpetajate koostöö analüüs. Rühmatöö sisaldab vajalikke analüüsiaspekte vastavalt juhendile (Moodle's)."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Õpetajad ühiskonnas. Haridusvaldkonna arengu suunamise võimalused. Rühmatöö sisaldab analüüsiaspekte:\n- Kitsaskoha või probleemi lühikirjeldus.\n- Soovitud olukorra kirjeldus.\n- Tegevused soovitud olukorra saavutamiseks, konkreetsed näited planeeritud tegevuste kohta.\n- Hindamine (mille põhjal võiksite hinnata kavandatud tegevuste tõhusust).\n- Refleksioon (kuidas seostub teie argumenteeritud kava rühmaliikmete poolt loetud artiklites ja vaadatud videotes väljatooduga)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Oma identiteedi, visiooni ja professionaalse arengu kava uuendamine ja täiendamine lähtudes kursusel omandatust ja arvestades riiklikke haridusprioriteete. Töö sisaldab järgmisi teemasid:\n- Millised on minu eesmärgid õpetajana?\n- Kuidas ma nende eesmärkideni jõuan? Mida saan selle jaoks teha?\n- Millised on minu pädevused ja oskused võrreldes kutsestandardis väljatooduga? Mis on minu tugevused ja parendusvaldkonnad?\n- Kuidas saan ja tahan edaspidi (rohkem) kaasa rääkida hariduselu suunamisel ja korraldamisel?"}}], "grade_preconditions": {"et": "Osalemine kõikides rühmatöödes ja kõikide arvestuslike tööde esitamine."}, "grade_evaluation": {"et": "Aine läbimiseks tuleb osaleda kõikides rühmatöödes ja esitada kõik arvestuslikud tööd, mis peavad vastama juhendis väljatoodud nõuetele (st on arvestatud)."}, "grade_conditions": {"arvestatud": {"et": "Kõigi ainekursuse ülesannete sooritamine lävendid ülevataval tasemel"}, "mittearvestatud": {"et": "Kui vähemalt üks ainekursuse ülesannetest ei ole sooritatud lävendid ületaval tasemel"}, "mitteilmunud": {"et": "Kui üliõpilane ei ole osalenud loengutes ega esitanud ühtegi kohustuslikku ülesannet.\n"}}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi kahe nädala jooksul, kuid hiljemalt viiendal tööpäeval enne vastava õppeaine kordushindamist, ning enne semestri arvestuslikku lõppu. Kordushindamise tulemused sisestatakse hiljemalt järgmise semestri algusele eelneval päeval."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "800bd300-7377-887a-7cf1-0ebc6e9d8d6e", "person_name": "Katrin Helendi", "structural_unit": {"code": "SVNC02", "name": {"en": "Division of Psychology and Pedagogy", "et": "psühholoogia ja pedagoogika lektoraat"}, "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVNC", "is_expired": true}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"KELA 2A": {"code": "1", "et": "Lektor", "en": "lecturer"}, "KELA 2B": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "4323eae5-d3bf-bba1-62f9-0433496d1dd1", "code": "KELA 2B", "max_size": 40}, {"uuid": "b604a71f-d033-c5ce-671c-673ce815f9af", "code": "KELA 2A", "max_size": 40}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatav seminar - aine eesmärgid, õpiväljundid ja korraldus, ülesannete läbiarutamine.\nIdentiteet, selle olemus ja muutumine. Identiteedi kujunemine ja muutumine, teoreetilised lähtekohad. \nÕpetaja identiteet ja visioon (mina ise). Õpetaja roll rühmas, lasteaias, ühiskonnas. Õpetaja identiteeti mõjutavad tegurid. "}, "study_group_codes": ["KELA 2B", "KELA 2A"]}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Õpetaja isiksus ja isikuomadused. Väärtused. Eneseregulatsioon. Juhtimisstiilid ja -võtted. Õpetaja juhina ja eestvedajana. Õpetaja füüsiline, vaimne ja emotsionaalne tervis. \nÕpetaja kutse-nõuded tööks õpetajana: tööülesanded, tööd reguleerivad õigusaktid, kompetentsid, kutse-eetika. Grupiidentiteet. "}, "study_group_codes": ["KELA 2B", "KELA 2A"]}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Õpetajad ühiskonnas. Õpetajate kogukond. Kollektiivne tõhusus. Õpetajate koostöö kolleegidega, lastevanematega, kogukonnaga.    Toimetulek ühiskonna/juhtkonna/lapsevanemate/kolleegide ootustega. "}, "study_group_codes": ["KELA 2B", "KELA 2A"]}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Õpetaja töö analüüs. Õppiva professionaali ja õpetaja tegevusvõimekuse mudelid. "}, "study_group_codes": ["KELA 2B", "KELA 2A"]}]}, "registration_info": {"audience": {}, "max_students": 80}, "parent_uuid": "f18ec329-a318-6d2c-d6a3-8b9a169122a6", "parent_code": "SVNC.00.186", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}