{"uuid": "78e67a44-a439-c298-2143-9cc80507e70a", "code": "SVNC.00.200", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Russian Morphology and Syntax", "et": "Vene keele morfoloogia ja süntaks"}, "credits": 10, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The first part of the subject provides an overview of the morphological system of the Russian language: it analyses Russian-language parts of speech, word formation, grammatical categories, functioning of parts of speech. The course deals with debatable (unsolved) issues of the modern morphology (the typology of parts of speech, the number of cases, the transition of parts of speech, etc.)  and with the changes happening in the modern morphological system. During the practical lessons students learn to define forms and means of expression of their grammatical meaning, to perform the morphological analysis word forms, to analyze the changes happening in the morphological system of the modern Russian language (the analyticity growth), to correct the morphological mistakes occurring in the speech of foreign students, and to explain the reasons for their occurrence.  \nThe second part of the subject provides an overview of the syntactical system of the course: it analyzes the types and means of syntactical connections in a word combination, in a simple and compound sentence as well as looks at the types of sentences in the Russian language. The course also analyses debatable issues of the modern science of syntax (the issue of the borders of the \"word combination\" notion, the issue of the simple and compound sentence classification, etc.) and the changes happening in the modern syntactical system. Within the frames of this part of the course students learn to identify and choose word combinations from a text, to perform the multi-aspect analysis of word combinations, simple and compound sentences, to analyze the changes happening in the syntactical system of the modern Russian language, to correct the syntactical mistakes occurring in the speech of foreign students, and to explain the reasons for their occurrence.", "et": "Esimeses aine osas antakse ülevaade vene keele morfoloogilisest süsteemist: vaadeldakse vene keele sõnaliike, vormimoodustust, grammatilisi kategooriaid, sõnaliigi funktsioneerimist. Käsitletakse vaieldavaid (lahendamata) küsimusi tänapäeva morfoloogias  (sõnaliikide tüpoloogia, käänete arv, sõnaliikide üleminek jt) ning kaasaegses morfoloogilises süsteemis toimuvaid muutusi. Praktiliste tundide käigus üliõpilased õpivad määrama üksikute vormide ja nende väljendusvahendite grammatilisi tähendusi, tegema sõnavormide morfoloogilist analüüsi, analüüsima tänapäevase vene keele morfoloogilises süsteemis toimuvaid muutusi (analüütilisuse kasv), parandama välisüliõpilaste kõnes esinevaid morfoloogilisi vigu, selgitama nende esinemise põhjuseid. \nTeine aine osa annab ülevaade vene keele süntaktilisest süsteemist: vaadeldab süntaktiliste seoste tüüpe ja vahendeid sõnaühendis, liht- ja liitlauses, vene keele lause tüüpe. Vaadeldakse tänapäevase süntaktikateaduse vaidlusküsimusi (küsimus \"sõnaühendi\" mõiste piiridest, liht- ja liitlausete klassifitseerimisest jne) ja kaasaegses süntaktilises süsteemis toimuvaid muutusi. Selle kursuse osa raames üliõpilased õpivad tuvastama, valima sõnaühendeid tekstist, tegema sõnaühendi mitmemõõtmelist süntaktilist ning liht- ja  liitlausete analüüsi, analüüsima kaasaegse vene keele süntaktilises süsteemis toimuvaid muutusi, parandama süntaksivigu välisõppurite kõnes, selgitama vigade esinemise põhjuseid."}, "objectives": [{"en": "To provide a theoretical overview of the Russian language grammar: parts of speech, grammatical categories and functioning of a part of speech in the Russian language, the transition from one part of speech to another, a syntagma, a simple and compound sentence, etc. To deal with debatable (unsolved) issues of the modern grammar; to develop students' understanding about the changes happening in the morphological and syntactical system of the modern Russian language. By doing practical tasks to develop students' skills to perform the morphological analysis of a word form and the syntactical analysis of a syntagma or a simple or a compound sentence. To develop students' skills to notice the changes happening in the morphological and syntactical system of the modern Russian language and to analyze these changes.", "et": "Anda teoreetiline ülevaade vene keele grammatikast: sõnaliikidest, grammatilistest kategooriatest ja sõnaliigi funktsioneerimisest vene keeles, üleminekust ühelt sõnaliigilt teisele, sõnaühendist, liht- ja liitlausest  jne; käsitleda tänapäevases grammatikas vaieldavaid (lahendamata) küsimusi; kujundada üliõpilastel ettekujutus vene keele tänapäevases morfoloogilises ja süntaktilises süsteemis toimuvatest muutustest. Praktiliste tööde kaudu kujundatakse oskus teha sõnavormi morfoloogilist, sõnaühendi, liht- ja liitlause süntaktilist analüüsi, märgata vene keele tänapäevases morfoloogilises ja  süntaktilises  süsteemis muutusi ning analüüsida neid."}], "learning_outcomes": [{"en": "Upon completion of the subject a student:\n1) knows the morphological and syntactical system and critically evaluates different opinions regarding debatable grammar issues (the typology of the parts of speech, the number of cases, the transition of the parts of speech, the issue of the borderline of the \"syntagma\" notion, the classification of simple and compound sentences, etc.);\n2) can perform the morphological analysis of word forms, in the analysis notices the transition from one part of speech to another;                                                                      \n3) performs the multi-aspect analysis of syntagmas, simple and compound sentences;\n4) understands the changes happening in the morphological and syntactical system of the modern Russian language, notices these changes in the oral and written Russian language and analyzes them; \n5) prevents and corrects morphological and syntactical mistakes in the speech of foreign students, understands the reasons for occurrence of the mistakes.", "et": "Aine läbinud üliõpilane: \n1) tunneb  morfoloogilist ja  süntaktilist süsteemi ja hindab kriitiliselt erinevaid arvamusi grammatika vaidlusküsimuste suhtes (sõnaliikide tüpoloogia,  käänete arv, sõnaliikide üleminek, küsimus \"sõnaühendi\" mõiste piiride kohta, liht- ja liitlausete klassifitseerimise kohta jt);\n2) oskab teha sõnavormide morfoloogilist analüüsi, analüüsis märkab üleminekut ühelt sõnaliigilt teisele;                                                                        3) teeb sõnaühendite, liht- ja liitlause mitmeaspektilist analüüsi;\n4) mõistab tänapäevase vene keele morfoloogilises ja süntaktilises süsteemis toimuvaid muutusi, märkab neid muutusi suulises ja kirjalikus vene keeles ja analüüsib neid; \n5) ennetab ja parandab morfoloogilisi ja süntaktilisi  vigu välisõpilaste kõnes, mõistab vigade tekkimise põhjuseid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}