{"uuid": "efb5ddaf-3f54-8e01-f7cd-6ca4a8af4d83", "code": "SVNC.00.295", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-07-18T15:52:48", "title": {"en": "Practicum on Text Analysis and Writing (Level B2)", "et": "Tekstide analüüsi ja kirjutamise praktikum (tase B2)"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "language_training": {"language": {"code": "ru", "et": "vene keel", "en": "Russian"}, "start_level": {"code": "B1.2", "et": "B1.2", "en": "B1.2"}, "end_level": {"code": "B2", "et": "B2", "en": "B2"}}}, "overview": {"description": {"en": "1. OFFICIAL BUSINESS STYLE.\nGenre varieties of official business style.\nOral business communication: the structure of a business conversation, tactics of politeness, compliments, self-presentation. \"Constructor\" of a business conversation.\nWritten business communication: compositional, lexical and grammatical features of the official business style. Business letter: types of addressees, types of letters (business letter, advertising letter). Business letter constructor.\nWork with texts of official business style (contract, application, CV).\t\n2. SCIENTIFIC STYLE.\nGenre varieties of written and oral scientific speech.\nLexical, word-formative, and grammatical features of the scientific style of speech.\nWork with texts of scientific style (scientific article, review). Semantic analysis of the paragraph. Drawing up a plan for the text. Thesis and note-taking. Composition and heading of the scientific text. Analysis of lexical, word-formative, and grammatical features of texts.\nWriting annotations and reviews.\t\n3. COLLOQUIAL SPEECH.\nOral and written forms of colloquial speech.\nPhonetic, lexical, word-formative, and grammatical features of colloquial speech.\nWork with texts of colloquial speech (transcription of oral speech recordings, communication on the Internet and messenger, household note). Analysis of the \"signs\" of colloquial speech in modern journalism and fiction.\t\n4. ARTISTIC STYLE OF SPEECH / LANGUAGE OF ART LITERATURE.\nGenre varieties of texts of artistic style.\nMeans of expressiveness in texts of artistic style.\nWorking with texts of artistic style (story, poem, novel).", "et": "1. Ametlik äristiil\n2. Teaduslik stiil\n3. Igapäevane suhtlusstiil\n4. Ilukirjanduslik stiil"}, "objectives": [{"en": "To provide students with idea of the stylistic diversity of the Russian literary language and to develop their skill to analyse texts of various official business, scientific, literary, and informal genres based on their stylistic features.", "et": "Kujundada üliõpilastes arusaama kaasaegse vene kirjakeele stiililise mitmekesisuse kohta ning arendada oskust analüüsida eri žanrite ametlikke äri-, teadus-, kunsti- ja kõnekeelseid tekste nende stiilikujundavate tunnuste poolest."}], "learning_outcomes": [{"en": "On completion of the course a student:", "et": "Aine läbimisel üliõpilane:"}, {"en": "1) knows about the genre and style stratification of the modern Russian literary language;", "et": "1) omab ettekujutust kaasaegse vene kirjakeele žanri- ja stiilikihistumisest;"}, {"en": "2) knows the style-forming features of official business, scientific, colloquial and artistic styles of speech, understands the patterns of their construction and the language means used in them;", "et": "2) tunneb ametliku asjaajamise, teadusliku, kõne- ja kunstilise kõne stiili kujundavaid tunnuseid, mõistab nende ülesehituse mustreid ja neis kasutatavaid keelevahendeid;"}, {"en": "3) can determine the genre and style of the text by its stylistic features;", "et": "3) oskab stiilitunnuste järgi määrata teksti žanri ja laadi;"}, {"en": "4) can independently create texts of individual genres of scientific and official business styles in accordance with their style norms.", "et": "4) oskab vastavalt teatud žanrite stiilinormidele iseseisvalt luua teaduslike ja ametlike äristiilide tekste."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}