{"uuid": "a219a8d8-e3af-8156-31df-bee4f1a2a597", "code": "SVNC.00.265", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Information Retrieval and Methods of Business Research", "et": "Teabeotsingud ja äriuuringute metoodikad"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The learner acquires basic knowledge, vocabulary and practical skills for planning and conducting a study, collecting and analysing data (incl. final paper), formatting a final thesis correctly and properly. Upon completion of the course, the student knows the requirements for scientific research, on its preparation and conducting as well as various research methods.\nUpon completion of the course, the student is able to work with databases, plan and perform a study, collect and analyze data, interpret, present the results both in writing and orally.", "et": "Õppija omandab põhiteadmised, sõnavara ning praktilised oskused uurimistöö (sh lõputöö) sisuliseks planeerimiseks, läbiviimiseks, andmete kogumiseks ja analüüsimiseks ning selle korrektselt ning nõuetekohaselt vormistamiseks. Kursuse läbimisel õppija teab teaduslikele uurimistöödele esitatavaid nõudeid uuringu ettevalmistamise ja teostamise kohta, samuti erinevaid uurimismeetodeid.\nKursuse läbimisel õppija oskab töötada andmekogudega, planeerida ja teostada uuringu läbiviimist ning andmete kogumist ja analüüsimist, tõlgendada, esitada ja esitleda andmeid nii kirjalikult kui ka suuliselt."}, "objectives": [{"en": "The aim of the course is to provide students with the skills of searcing the information and of conducting an academic business study.", "et": "Ainekursuse eesmärk on anda üliõpilasele oskused teabeotsinguteks ning iseseisva uurimistöö tegemiseks ettevõtluse valdkonnas."}, {"en": "Students learn how to work with academic and other data bases, plan and conduct a research and provide its reiliability, applying various research methods of data collection and analyze.", "et": "Õpitakse tegema tööd andmebaaside ja teaduskirjandusega, planeerima ja läbi viima uuringut ning kindlusama selle usaldusväärsust. Omandatakse teadmised andmete kogumise ja analüüsimise meetodite kotha."}], "learning_outcomes": [{"en": "After completing the course, the student knows:", "et": "Kursuse läbinud üliõpilane tunneb:"}, {"en": "* electronic academic and other data sources and databases, principles and methods of working with them", "et": "* teadustööks vajalike andmebaaside liike, elektroonilisi infoallikaid ja nendega töötamise põhimõtteid ja võtteid"}, {"en": "* basics of the philosophy and methodology of social sciences, incl its ethics and personal data protection", "et": "* teadusfilosoofia ja -metodoloogia alustõdesid, sh eetika- ja andmekaits nõudeid"}, {"en": "* methods of planning a social and business study and methods of collecting and analyzing of data necessary for gaining bachelor`s degree.", "et": "* sotsiaalvaldkonna, sh rakendusliku äriuuringu kavandamise ning andmete kogumise ja analüsimise meetodeid bakalaureuse tasandil "}, {"en": "After passing the course the student is able to:", "et": "Kursuse läbinu õppija oskab:"}, {"en": "* work with different databases", "et": "* töötada erinevate andmekogudega"}, {"en": "* understand, evaluate and use the results of the survey conducted by other parties ", "et": "* mõista ja hinnata teiste poolt läbiviidud uuringute tulemusi ning kasutada neid korrektselt"}, {"en": "* make strategic choices for conducting a business research, including raising of a problem, aiming and choosing adequate data collection and analysis methods ", "et": "* kavandada äriuuringut ning teha strateegilisi valikuid selle läbiviimiseks, sh sõnastada probleemi, eesmärki, valida andmete kogumise ja analüüsimise meetodid, kindlustama uuringu representatiivsus ja valiidsus"}, {"en": "* interpret and present data both in writing and orally", "et": "* õlgendada, esitada ja esitleda andmeid nii kirjalikult ja suuliselt"}, {"en": "* use appropriate vocabulary and information sources.", "et": "* kasutada asjakohast sõnavara ja teabeallikaid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}