{"uuid": "4837d024-6e4e-88e6-de9d-ee2a41a577d6", "code": "SVNC.00.142", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Content and Language Integrated Learning and Methodology", "et": "Lõimitud aine- ja keeleõpe ning metoodika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Students will be introduced to the concept of CLIL, its history and its forms. The concept of \"good teaching practice\" will be considered. The features of the learner-supporting environment and the principles of creating this environment are introduced. The peculiarities of a lesson following the principles of CLIL and its planning are analyzed.", "et": "Üliõpilastele tutvustatakse LAK-õppe mõistet, selle ajalugu ja selle vorme. Vaadeldakse \"heade õpetamistavade\" mõistet. Tutvustatakse õppijat toetava keskkonna tunnuseid ja antud keskkonna loomise põhimõtteid. Analüüsitakse LAK-õppe põhimõtteid jälgiva tunni omapära, selle planeerimist."}, "objectives": [{"en": "1) introduce the concept of CLIL, its history, forms of CLIL-learning;", "et": "1) tutvustada LAK-õppe mõistet, selle ajalugu, LAK-õppe vorme;"}, {"en": "2) analyze the concept of \" good teaching practice \";", "et": "2) analüüsida \"heade õpetamistavade\" mõistet;"}, {"en": "3) introduce the features of a supportive learning environment and the principles of its design;", "et": "3) tutvustada toetava õpikeskkonna tunnuseid ja selle kujundamise põhimõtteid;"}, {"en": "4) analyze lesson planning that follows the principles of CLIL.", "et": "4) analüüsida LAK-õppe põhimõtteid jälgivat tunni planeerimist."}], "learning_outcomes": [{"en": "Upon positive completion of the course, the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "1) is aware of the meaning of the concept of CLIL, its specificities and its history;", "et": "1) on teadlik LAK mõiste tähendusest, selle omapärast ja selle ajaloost;"}, {"en": "2) is aware of the meaning of \"good teaching practice\" and its application;", "et": "2) on teadlik \"\"head õpetamistavad\"\" mõiste tähendusest ja selle rakendamisest;"}, {"en": "3) knows the characteristics of a supportive learning environment and the principles of its creation;", "et": "3) tunneb toetava õpikeskkonna tunnuseid ja selle loomise põhimõtteid;"}, {"en": "4) is familiar with the peculiarities of the lesson built on the principles of CLIL methodology and its main features;", "et": "4) tunneb LAK metoodika põhimõtetel ülesehitatud tunni omapära ja selle põhitunnuseid;"}, {"en": "5) knows the principles of lesson planning based on the principles of the CLIL methodology;", "et": "5) tunneb LAK metoodika põhimõtetel ülesehitatud tunni planeerimise põhimõtteid;"}, {"en": "6) can cooperate with other teachers in teaching cross-curricular topics.", "et": "6) oskab teha koostööd teiste õpetajatega läbivate teemade õpetamisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}