{"uuid": "c304e8a2-e5ef-a7a0-42ce-0eae276fd2ce", "code": "SVNC.00.201", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Russian-English Comparative Grammar", "et": "Vene-inglise kontrastiivne grammatika"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The subject includes a systematic comparative description of the English and Russian grammar on the level of word formation, morphology, and syntax. The course provides an overview of the interlanguage differences and universality in the English and Russian languages.", "et": "Aine raames on esitatud inglise ja vene keele grammatika süsteemne kirjeldus sõnamoodustuslikul, morfoloogilisel ja süntaktilisel tasemel võrdlusaspektis; kursus annab ülevaate keeltevahelistest erinevustest ja keeltevahelistest universaalsustest inglise ja vene keeles."}, "objectives": [{"en": "To introduce to students the main typological peculiarities of the Russian and English grammar and to teach students to use theoretical knowledge in the process of teaching Russian as a foreign language, overcoming the interlanguage interference.", "et": "Tutvustada üliõpilastele vene ja inglise keele grammatika põhilisi tüpoloogilisi omapärasusi ning õpetada üliõpilasi kasutama teoreetilisi teadmisi vene keele võõrkeelena õpetamise protsessis, ületades keeltevahelist interferentsi."}], "learning_outcomes": [{"en": "Upon completion of the subject a student:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) knows the main typological differences between the grammar of the Russian and English languages;", "et": "1) teab põhilisi tüpoloogilisi erinevusi vene ja inglise keele grammatika vahel;"}, {"en": "2) compares the structure of the Russian language with the one of the students' English language (mother tongue) and explains functional peculiarities of the Russian language;", "et": "2) võrdleb vene keele struktuuri õpilaste inglise (emakeele) keele omaga ja põhjendab vene keele funktsionaalseid omapärasusi;"}, {"en": "3) solves methodological and linguistic tasks which are connect with the typological analysis of the Russian and English languages;", "et": "3) lahendab metoodilisi ja keelelisi ülesandeid, mis on seotud vene ja inglise keele tüpoloogilise analüüsiga;"}, {"en": "4) foresees difficulties in teaching of the Russian language to English-speaking students.", "et": "4) näeb ette raskusi vene keele õpetamises ingliskeelsele õppijale."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}