{"uuid": "0a020b9b-e360-b447-2c62-3da78e998380", "code": "SVNC.00.275", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-02T11:23:42", "title": {"en": "Business Management and Change Management", "et": "Organisatsiooni ja muutuste juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Terms: management, execution, and support processes. Normative, strategic, operational processes. Management level, actuating variable, control variable. Management cycles. Analysis and synthesis of activities.  Work organization. Organization structure. Decision model.\n\nConcept of development in relation to the change and development of the organization. Innovation. Proceeding from change to development and from counseling to process management. Objectives, principles and organizational models of change management.The system of development regularities, types, and elements of organizations. Seven basic stages of development of an organization. Development strategies of organizations. Group work: implementation of a variety of diagnostic instruments for real-life business situations. Requirements to managers, developers, and consultants.", "et": "Mõisted: juhtimis-, teostamis- ja toetamisprotsessid. Normatiivsed, strateegilised, operatiivsed protsessid.juhtimistase, juhtimistegurid, juhtimisparameeter. Juhtimistsükklid. Tegevuste analüüs ja süntees. Töökorraldus, organisatsiooni struktuur. Otsustamismudel.\n\nEttekujutus arengu mõistest seoses organisatsiooni muutmise ja arendamisega. Innovatsiooni mõiste. Arusaam, mis viib organisatsiooni muutuste juhtimisest - organisatsiooniarenguni ja edasi organisatsiooninõustamisest - protsessinõustamiseni. Muutuste juhtimise eesmärgid, printsiibid ja organisatsioonimudelid. Organisatsioonimudeli olemuselemendid, ettevõtte arengu seaduspärasused ja organisatsioonitüübid.Oorganisatsiooni arengu seitse baasprotsessist ja nende praktiline kirjeldus. Organisatsiooni arengu strateegiaid. Praktiliste juhtumite analüüs gruppides, kus õpitakse kasutama erinevaid diagnostilisi instrumente. Ootused tänapäeva juhtidele, arendustöötajatele ja nõustajatele."}, "objectives": [{"en": "Students acquire the basic knowledge of design, control, and development of organizational activities and structures, and execute and support core activities.\nThe aim of the course is also to create a comprehensive understanding of organizational change management concepts, principles, and models that ensure the company's sustainable development,\nprovide knowledge of organizational changes in the management field of these core processes, which connect the theoretical approach to the modern needs of the practical situation and future trends.", "et": "Õppijad omandavad alusteadmised organisatsiooni tegevuste ja strukutuuride kujundamiseks, ohjeldamiseks ja arendamiseks, ning põhitegevuste teostamiseks ja toetamiseks.\nSamuti on kursuse eesmärgiks luua terviklik arusaam organisatsiooniliste muudatuste juhtimise kontseptsioonist, printsiipidest ja mudelitest, mis tagavad ettevõtte jätkusuutliku arengu. Anda organisatsiooniliste muudatuste juhtimise valdkonnas teadmisi nendest põhiprotsessidest, mis võimaldavad ühendada teoreetilise käsitluse tänapäeva praktilise olukorra vajaduste ja tulevikusuundumustega."}], "learning_outcomes": [{"en": "A student is able to...\n- distinguish basic understandings and concepts of organizational management and their role in ensuring the success of organizations\n- analyze the processes that enable the organization to design structures and activities\n- select processes, tools, and techniques for making management decisions and applying decisions to the internal and external environments\n- design processes to control the activities of an organization\n- has a deeper knowledge of how to manage sustainable changes and innovation\n- knows basic processes that allow managers involved in the change and development processes to conduct changes in the management of the company\n- has tools and techniques for the implementation of changes in more systematic, more conscious, and faster ways.\n-has a deeper understanding of co-workers, groups and organization.", "et": "Aine läbinud üliõpilane oskab:\n- eristada organisatsiooni juhtimise põhilisi arusaamu ja konteptsioone ja tunneb nende rolli organisatsiooni edu tagamisel\n- analüüsida protsesse, mis võimaldavad organisatsiooni struktuuride ja protsesside kujundamist\n- valida protsesse, töövahendeid ja tehnikaid juhtimisotsuste langetamiseks ja nende rakendamiseks sise- ja väliskeskkonna vaates\n- kavandada protsesse organisatsioniliste tegevuste ohjamiseks.\nKursuse läbinud üliõpilane\n- tunneb ettevõtte muutuste juhtimse peamisi teoreetilisi lähenemisi ja seisukohti\n- teab innovatsiooni mõistet ja selle olemust\n- teab, kuidas juhtida muudatusi organisatsiooni jätkusuutlikuks arenguks\n- tunneb põhiprotsesse, mis võimaldavad muutustega tegelevatel juhtidel läbi viia nende orgaanilist juhtimist ettevõttes\n- tunneb juhi töövahendid ja tehnikad, mis võimaldavad muudatuste elluviimist süsteemsemalt, teadlikumalt ja kiiremini juhtida\n- omab teadmisi kaastöötajate, gruppide ja organisatsiooni süsteemsemaks mõistmiseks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}