{"uuid": "c3802bb4-b0b7-d38a-6acf-59aee6e6b6b9", "code": "sv-2024-autumn-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-29T12:40:29", "title": {"en": "Methodology of Teaching Russian as a Foreign Language", "et": "Vene keele kui võõrkeele õpetamise metoodika"}, "credits": 9, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 27, "practice": 0, "seminar": 27, "colloquium": 0, "web_learning": 0, "independent_work": 180, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "ru", "et": "vene keel", "en": "Russian"}], "description": {"en": "The course deals with the basic concepts of teaching Russian as a foreign language: psychological, linguistic and sociolinguistic bases of teaching Russian as a Foreign Language. An overview is given of different aspects of teaching Russian as a foreign language (phonetics, grammar, vocabulary, etc.), teaching of speaking.", "et": "Kursuses vaadeldakse vene keele võõrkeelena õpetamise metoodika põhimõisteid; Vene keele võõrkeelena (VKV) õpetamise psühholoogilisi, lingvistilisi ja sotsiolingvistilisi aluseid. Esitatakse ülevaade vene keele võõrkeelena õpetamise aspektidest (foneetika, grammatika, leksika jne), rääkimise õpetamisest."}, "objectives": [{"en": "To develop professional competence in teaching Russian as a foreign language (RFL). Tasks of the course:", "et": "Kujundada professionaalne kompetentsus vene keele võõrkeelena õpetamise alal. Kursuse ülesanded:"}, {"en": "1) to create a scientific-methodological basis for students;", "et": "1) luua üliõpilastele teaduslik-metoodiline baas;"}, {"en": "2) to develop the professional and methodological skills of future RFL teachers (determining the specific methodological purpose and content of the lesson, evaluating the choice and amount of linguistic material, identifying appropriate methods for semantizing lexis, introducing new grammatical material, pronouncing work, etc.);", "et": "2) kujundada tulevaste VKV õpetajate professionaalsed ja metoodilised oskused (õppetunni konkreetse metoodilise eesmärgi ja sisu määramine, keelelise materjali valiku ja doseerimise hindamine, leksika semantiseerimise otstarbekate meetodite väljaselgitamine, uue grammatilise materjali sisseviimine, töö hääldamisega jm);"}, {"en": "3) to cultivate the habit of working independently with scientific-methodological literature.", "et": "3) kasvatada harjumust iseseisvalt töötada teaduslik-metoodilise kirjandusega."}], "learning_outcomes": [{"en": "Upon completion of the course, the student:\n1) knows the methodology terminology of teaching Russian as a foreign language;\n2) knows the peculiarities of different stages of teaching Russian as a foreign language;\n3) knows the structure and content of the national curriculum as a foreign language for the syllabus;\n4) is familiar with modern textbooks of Russian as a foreign language;\n5) is able to choose the most suitable ones in order to fulfill the learning objectives, justifies his / her choice and is able to make his/her own didactic material;\n6) is able to target lessons and choose the optimal structure according to the goal and content;\n7) is able to select and evaluate linguistic material needed for the lesson and analyze its severity from the perspective of the learners (considering their first language);\n8) knows a variety of methods and techniques that can be used to teach speaking skills and other aspects of language;\n9) is able to choose appropriate methods and justify his / her choices;\n10) Is familiar with school documentation and can execute it (plans, lesson plans, etc.);\n11) knows the methodological basis of language testing (procedure of writing tests, forms of test tasks, criteria of test quality, evaluation of test results, etc.);\n12) knows the principles of organizing the testing process;\n13) is able to prepare tests for intermediate language tests.", "et": "1) valdab vene keele võõrkeelena õpetamise metoodika-alast terminoloogiat;\n2) teab, millised eripärad on vene keele kui võõrkeele õpetamise eri etappidel;\n3) tunneb riikliku õppekava struktuuri ja sisu vene keel võõrkeelena ainekava osas;\n4) orienteerub tänapäevastes vene keele kui võõrkeele õpikutes;\n5) oskab valida neist sobivamaid, selleks et täita õpieesmärke, põhjendab oma valikut ja oskab valmistada didaktilist materjali;\n6) oskab tunde eesmärgistada ja valida eesmärgist ning sisust lähtuvalt optimaalse struktuuri;\n7) oskab valida ja hinnata tunniks vajalikku keelelist materjali ning analüüsida selle raskusastet õppijate vaatevinklist (nende esimest keelt arvesse võttes);\n8) teab mitmekesiseid meetodeid ja võtteid, mida kasutada kõnelemisoskuse ning keele muude aspektide õpetamisel;\n9) oskab valida sobivaid võtteid ning oma valikuid põhjendada;\n10) tunneb koolidokumentatsiooni ja oskab seda täita (plaanid, tunnikavad, jne);\n11) teab keeledidaktilise testimise metodoloogilist baasi (testide koostamise protseduuri, testimise ülesannete vorme, testide kvaliteedi kriteeriume, testide tulemuste hindamist jm);\n12) teab testimisprotsessi korraldamise põhimõtteid;\n13) oskab koostada teste keele osaoskuste vahekontrolliks."}], "notes": {}}, "grading": {"independent_work": {"et": "CHAST 1 (Olga Burdakova)\n1. Podgotovka pedagogicheskogo portfolio.\n2. Svoevremennoye vypolneniye zadanii v Moodle.\nCHAST 2 (Liudmila Nikolaeva)\n1. Podgotovka metodicheskogo portfolio (4 prakticheskih raboty). \n2. Svoevremennoye vypolneniye zadanii."}, "independent_work_assessments": [{"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A - töö on täpne ja ammendav vastus püstitatud küsimusele, piisavalt informatiivne, kirjutatud oma sõnadega ja illustreeritud näidetega. Puudub tekst, mis ei ole seotud küsimusega. Vastus on korrektne keele kasutuse suhtes.\nB - töö on täpne vastus püstitatud küsimusele, piisavalt informatiivne, kirjutatud oma sõnadega. Ei ole ebavajalikut infot. Võivad tekkida mõned keelelised või vähesed faktilised vead.\nC - töö on täpne vastus püstitatud küsimusele. Mõned vajalikud faktid ei kajastatud (kuni 15%) vastuses. Kirjutaja on iseseisev, kõik tsitaadid on varustatud viidetega.Võivad tekkida mõned keelelised või vähesed faktilised vead.\nD - töö on vastus püstitatud küsimusele, kuid puuduvad paljud vajalikud faktid. Töös on olemas ebavajalik info. Tekstis on palju tsitaate, mõned neist ei ole varustatud viidetega.\nE - töö on tekst, mis kaudselt vastab küsimusele. On mainitud vähemalt 3-4 vajalikut fakti. Tekstis on palju tsitaate, mõned neist ei ole varustatud viidetega. Tekstis on palju keelelisi vigu.\nF - töö tekst ei vasta küsimusele kas info puudumise või vale informatsiooni tõttu või on olemas plagiaat. Äärmiselt palju keelevigu, mõned neist segavad adekvaatset fakte arusaamist."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {}}], "grade_preconditions": {"et": "Eksamile pääsemise tingimused:\n1) osavõtt õppetööst (75%);\n2) iseseisvate tööde täitmine (õpuku analüüs; metoodiline mapp).\nPuudumine praktikumidelt on võimalik ainult mõjuvatel põhjustel (haigus ,õppejõule tuleb esitada arstitõendit)"}, "grade_evaluation": {"et": "Teadmiste ja oskuste lõplik kontroll toimub eksamil. Kirjalik eksam koosneb kahest teoreetilisest küsimusest ja praktilisest ülesandest."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine on võimalik lisatööde ja referaatide vormis (eelmine kokkulepe õppejõuga ja tähtaegade täpsustamine on kohustuslikud)."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=7954", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "dabfad6f-45fd-4ec1-d10a-78cf499641d2", "person_name": "Olga Burdakova", "structural_unit": {"code": "SVNC14", "name": {"en": "Department of Foreign Languages", "et": "võõrkeelte osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVNC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "0a0218cf-ab7c-5e89-c12d-388da396c380", "person_name": "Liudmila Nikolaeva", "structural_unit": {"code": "SVNC14", "name": {"en": "Department of Foreign Languages", "et": "võõrkeelte osakond"}, "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVNC"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2-14"}, "entries": [{"course_week": 2, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "I. VVEDENIE V METODIKU PREPODAVANIYA RKI "}, "description": {"et": "1. Ponyatiya \"bilingvizm\" i \"rodnoj yazyk\".\n2.1. Metodika prepodavaniya RKI kak nauka: predmet metodiki obucheniya RKI, celi, zadachi.\n2.2 Metodika prepodavaniya RKI i drugie nauki: : metodika i didaktika, metodika i psihologiya (psihologiya obucheniya, psiholingvistika, psihologiya obshcheniya, obshchaya psihologiya, etnopsihologiya), metodika i lingvistika."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "3. Ponyatie «sistema obucheniya» i ee soderzhanie. \n3.1 Kommunikativno-deyatel'nostnyj podhod k obucheniyu. Celi i zadachi obucheniya. \n3.2. Principy obucheniya: didakticheskie, lingvisticheskie, metodicheskie, psihologicheskie. \n3.3. Metody obucheniya: obshchedidakticheskie i chastnometodicheskie. Soznatel'nye (perevodnye) metody obucheniya inostrannomu yazyku. Pryamye (besperevodnye) metody obucheniya inostrannomu yazyku. Kombinirovannye i intensivnye metody obucheniya inostrannomu yazyku.\n3.4. Kompleksnost' i aspektnost' v obuchenii."}}, {"course_week": 2, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "II. OBUCHENIE ASPEKTAM YAZYKA. \n1. OBUCHENIE LEKSIKE. "}, "description": {"et": "1.1. Prezentaciya novoj leksiki. Dozirovka novyh slov. Metodika pred\"yavleniya novogo slova. 10 priyomov semantizacii novogo slova.\n1.2. Organizaciya usvoeniya novoj leksiki. Slovarnaya tetrad'. Leksicheskaya karta."}}, {"course_week": 2, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "1.3. Predkommunikativnye leksicheskie uprazhneniya (primery). Kommunikativnye leksicheskie uprazhneniya (primery).\n1.3. Organizaciya povtoreniya i kontrol' za kachestvom usvoeniya novoj leksiki."}}, {"course_week": 2, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "1.4. Internacionalizmy na urokah RKI (uroven' A0).\n1.5. Leksicheskie prilozhenija v srede LearningApps.\n1.6. Mobilnye prilozheniya dlya raboty nad leksikoi."}}, {"course_week": 2, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "2. OBUCHENIE FONETIKE."}, "description": {"et": "2.1. Organizaciya zanyatij. Vvodnyj foneticheskij kurs. Foneticheskaya zaryadka. Korrektirovochnyj kurs fonetiki.\n2.2. Postanovka glasnyh zvukov: postanovka glasnyh v cepochke; proiznesenie glasnyh v oppozicii, slitnoe proiznesenie glasnyh."}}, {"course_week": 6, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {}, "description": {"et": "2.3. Sposoby raboty nad proiznosheniem soglasnyh. Imitacionnyj sposob. Artikulyacionnyj sposob. Sopostavitel'nyj sposob (tablicy dlya zapominaniya artikulyacii; fiksirovannaya artikulyaciya; associativnye priemy). Trenirovochnye uprazhneniya: sistema foneticheskih igr I.S. Milovanovoj.\n2.4. Ritmika i udarenie slova (harakteristika russkogo slovesnogo udareniya; udarnyj i bezudarnyj slogi; ispol'zovanie ritmicheskih struktur i skhem v obuchenii redukcii bezudarnyh zvukov)."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "3. OBUCHENIE GRAMMATIKE."}, "description": {"et": "3.1. Rol' grammatiki v kurse RKI. Aktivnaya grammatika: otbor uchebnogo materiala.\n3.2. Vidy ob\"yasneniya grammaticheskogo materiala. Induktivnoe ob\"yasnenie. Deduktivnoe ob\"yasnenie. Leksicheskij vvod.\nVidy grammaticheskih uprazhnenij. \n3.3. Vidy grammaticheskih uprazhnenij."}}, {"course_week": 14, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "4. LINGVOSTRANOVEDCHESKIJ ASPEKT V OBUCHENII RKI"}, "description": {"et": "4.1. Ponyatie \"lingvostranovedenie\".\n4.2. Nacional'nye markery kul'tury. Antroponimy kak nacional'nye markery kul'tury. Semanticheskaya specifika russkih lichnyh imen. Slovoobrazovatel'naya specifika lichnyh imen. Obrashchenie po otchestvu. Kul'turologicheskij fon antroponima. Zoonimy i fitonimy kak nacional'nye markery kul'tury."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "III. RECHEVAYA DEYATEL'NOST' V SISTEME OBUCHENIYA RKI"}, "description": {"et": "1. Ponyatie \"rechevaya deyatel'nost'\". Produktivnaya i receptivnaya rechevaya deyatel'nost'. Osnovnye i proizvodnye vidy rechevoj deyatel'nosti. Strukturnaya organizaciya rechevoj deyatel'nosti. Psihofiziologicheskie mekhanizmy rechevoj deyatel'nosti. Formy rechevoj deyatel'nosti (ustnaya i pis'mennaya rech')."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "2. OBUCHENIE AUDIROVANIYU."}, "description": {"et": "2.1. Audirovanie kak vid rechevoj deyatel'nosti. Rol' i mesto audirovaniya v real'noj kommunikacii i v uchebnom processe. Mekhanizmy audirovaniya (dogadka, smyslovaya orientaciya, ekvivalentnye zameny). Trudnosti audirovaniya (odnokratnost' pred\"yavleniya, sub\"ektivnaya harakteristika rechi govoryashchih). \n2.2. Uprazhneniya dlya obucheniya audirovaniyu. Organizaciya i prezentaciya audioteksta. Ispol'zovanie audiovizual'nyh, vizual'nyh i auditivnyh sredstv obucheniya audirovaniyu. Kontrol' ponimaniya rechevyh soobshchenij."}}, {"course_week": 14, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "3. OBUCHENIE GOVORENIYU KAK KOMPONENTU USTNOGO RECHEVOGO OBSHCHENIYA. "}, "description": {"et": "3.1. Psihologicheskie mekhanizmy govoreniya kak vida rechevoj deyatel'nosti. Tema i situaciya v obuchenii govoreniyu, nepodgotovlennaya i podgotovlennaya rech'. Harakteristika dialoga i monologa.\n3.2. Obuchenie dialogu kak forme obshcheniya. Obuchenie monologu kak forme obshcheniya. Sistema uprazhnenij dlya formirovaniya rechevyh navykov i vzaimosvyazannyh s nimi rechevyh umenij. Ispol'zovanie sredstv naglyadnosti pri obuchenii govoreniyu. Kriterii i sposoby kontrolya umenij govoreniya."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "4. CHTENIE KAK VID RECHEVOJ DEYATEL'NOSTI. "}, "description": {"et": "4.1. Psihologicheskie mekhanizmy chteniya. Rol' chteniya v formirovanii kommunikativnyh umenij. \n4.2. Obuchenie tekhnike chteniya. Chtenie kak sredstvo obucheniya aspektam yazyka, rechi i vidam rechevoj deyatel'nosti. Chtenie kak ob\"ekt obucheniya izvlecheniyu informacii iz teksta i ee smyslovoj pererabotke.\nOtbor tekstov dlya chteniya, trebovaniya k ih adaptacii. Klassifikaciya vidov uchebnogo chteniya. Vidy chteniya v zavisimosti ot celevoj ustanovki (prosmotrovoe, oznakomitel'noe, izuchayushchee). Kontrol' navykov i umenij kazhdogo vida chteniya."}}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "5. PIS'MO KAK VID RECHEVOJ DEYATEL'NOSTI. "}, "description": {"et": "5.1. Mekhanizmy pis'ma kak vida rechevoj deyatel'nosti. \n5.2. Obuchenie tekhnike pis'ma. Obuchenie pis'mennoj rechi. Kontrol', formy ocenki rechevyh navykov kommunikativno-tvorcheskih umenij pis'mennoj rechi. Obuchenie konspektirovaniyu. Obuchenie referirovaniyu i annotirovaniyu."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "IV. PLANIROVANIE uchebnogo processa."}, "description": {"et": "IV. PLANIROVANIE uchebnogo processa: kalendarnye, tematicheskie, pourochnye plany.Urok po russkomu yazyku: struktura uroka, postroenie uroka, tipy urokov. Sostavlenie plana-konspekta. Samostoyatel'naya rabota po russkomu yazyku. Organizaciya samostoyatel'noj auditornoj i vneauditornoj raboty."}}, {"course_week": 14, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "V. KONTROL' v processe obucheniya russkomu yazyku. "}, "description": {"et": "Formy kontrolya.\nTestirovanie kak forma kontrolya. Test v uchebnom processe. Standartizovannye i nestandartizovannye testy. Struktura testa. Tipologiya testov po harakteru vyborochnyh otvetov (al'ternativnye testy, testy mnozhestvennogo vybora, testy perekrestnogo vybora, testy so svobodno konstruiruemym otvetom). Organizaciya testirovaniya."}}]}, "registration_info": {"audience": {}}, "confirmation_process": {"confirmation_uuid": "e77d679d-9fa1-70f4-06b8-6cc716da2ac9", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "75472724-f2f9-eedf-352c-f6b162e9f706", "parent_code": "SVNC.00.147", "parent_credits": 9, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}