{"uuid": "9a043832-bc63-869f-9199-fe85ab220e96", "code": "SVNC.00.153", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Educational Research Basics and Methods", "et": "Kasvatusteadusliku uurimistöö alused ja meetodid"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Principles of compiling research in the field of Educational Science. Requirements of scientific research. Ethical requirements of scientific research. Principles and possibilities of planning scientific research. Choosing the topic and its relevance to preschool education. Possibilities of searching information, sources and databases related to preschool education. Work with theoretical materials. Defining a research problem. Data collection and an analysis in qualitative and quantitative research design. Presentation of research results. Requirements of compilation and formalisation of the research.", "et": "Kasvatusteadusliku uuringu olemus ja eripära. Uurimisteema hindamise alused: aktuaalsus, uudsus, originaalsus. Uurimistöö planeerimine, vaimsed, ajalised ja materiaalsed ressursid. Töö kirjandusega. Kvantitatiivsed ja kvalitatiivsed uurimismeetodid. Uurimisparadigmade vahelised erinevused. Andmete kogumine, valimi moodustamise põhimõtted, instrumentaariumide koostamine. Andmetöötlusmeetodid. Uurimistulemuste sõnaline, numbriline ja graafiline esitamine. Uurija isiksus ja  eetika probleemid.\nIseseisev töö: kohustusliku kirjanduse läbi töötamine; materjali kogumine erinevate kasvatusteaduslikus uurimistöös kasutatavate uurimismeetodite kohta; töö andmebaaside ja internetiallikatega."}, "objectives": [{"en": "A broad orientation in the principles of scientific research, planning and developing primary skills of performing the research.", "et": "Luua eeldused:\nEsmase valmiduse kujunemiseks teadustöö tegemiseks;\nTeadustöö põhimõistetes orienteerumiseks vajalike teadmiste omandamiseks;\nTeoreetiliste teadmiste omandamiseks, mis seonduvad uurimistöö kavandamise ja läbiviimise erinevate etappidega."}], "learning_outcomes": [{"en": "As a result of passing the subject, the student:", "et": "Aine läbimise tulemusena üliõpilane:"}, {"en": "Is able to analyze the reality of education in Estonia and to find out the topics of pre-school education that need to be researched;", "et": "Suudab analüüsida kasvatustegelikkust Eestis ja välja selgitada uurimistvajavad  alushariduse valdkonna teemad;"}, {"en": "Is familiar with the basic concepts of scientific research and knows the methodology of scientific research;", "et": "Orienteerub teadusliku uurimistöö põhimõistetes ja tunneb kasvatusteadusliku uurimistöö metodoloogiat;"}, {"en": "Is able to plan empirical research required for undergraduate work.", "et": "Oskab kavandada bakalaureusetööks vajalikku empiirilist uurimistööd."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}