{"uuid": "025d5319-249d-ac68-286b-20d17ff5594e", "code": "SVNC.00.093", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-08T15:51:11", "title": {"en": "Principles of Economics", "et": "Majandusteooria"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "International economy. Cyclical nature of economy. Money and banking. Economic growth. Basic concepts of macroeconomics, economic functions of a country, gross domestic product, consumption, saving and investment, monetary policy, unemployment, inflation, balance of payments.", "et": "Rahvusvaheline majandus.  Majanduse tsüklilisus. Raha ja pangandus. Majanduskasv. Makroökonoomika põhimõisted, riigi majanduslikud funktsioonid, rahvamajanduse koguprodukt, tarbimine, säästmine ja investeerimine, rahapoliitika, töötus, inflatsioon, maksebilanss."}, "objectives": [{"en": "The aim of the course is", "et": "Kursuse eesmärkideks on:"}, {"en": "* to develop economic thinking and literacy by learning about the basic principles of economic theory from the individual to the national level perspective;", "et": "*majandusliku mõtlemise ja kirjaoskuse arendamine, õppides tundma peamisi majandusteoreetilisi printsiipe üksikisikust kuni riikliku tasandini;"}, {"en": "* to provide basic knowledge of macroeconomics;", "et": "*anda põhiteadmised makroökonoomikas;"}, {"en": "*to examine the methods used to solve economic problems.", "et": "*õppida meetodeid, mida majandusprobleemide lahendamiseks kasutatakse."}], "learning_outcomes": [{"en": "After completing the course the student:", "et": "Kursuse läbinud üliõpilane:"}, {"en": "* knows the main theoretical concepts and theories of micro- and macroeconomics;", "et": "* teab peamisi majandusteoreetilisi mõisteid ja teooriaid mikro- ja makroökonoomikast;"}, {"en": "* is able to recognise the economic processes that affect his / her daily life and thus make more informed decisions;", "et": "* oskab ära tunda tema igapäevaelu mõjutavaid majandusprotsesse ning võtta seeläbi vastu kaalutletumaid otsuseid;"}, {"en": "* knows the main indicators used to describe the economic situation and their dynamics as well as independently  find statistics;", "et": "* tunneb peamisi majandusolukorra kirjeldamiseks kasutatavaid indikaatoreid ning nende dünaamikat, samuti oskab statistikat iseseisvalt leida;"}, {"en": "* understands the economic news covered in the media, is able to think critically and discuss the statements made in them;", "et": "* mõistab paremini meedias kajastatavaid majandusuudiseid, oskab nendes esitatud väidete üle kriitiliselt mõelda ning diskuteerida;"}, {"en": "* understands the factors important for the short- and long-term course of the economy;", "et": "* mõistab majanduse lühiajalise ning pikaajalise käekäigu seisukohalt olulisi tegureid;"}, {"en": "* has received a quantitative overview of the main indicators of the Estonian economy (and in comparison with other countries);", "et": "* on saanud kvantitatiivse ülevaate Eesti majanduse põhinäitajatest (sealhulgas võrdluses teiste riikidega);"}, {"en": "* has a systematic overview of the most important regularities and economic mechanisms of the macroeconomic economy;", "et": "* omab süsteemset ülevaadet makrotasandi majanduse toimimise tähtsamatest seaduspärasustest ja majandusmehhanismidest;"}, {"en": "* knows the basic concepts of macroeconomics and is able to analyse general economic phenomena and their relationships;", "et": "* tunneb makroökonoomika põhimõisteid ja oskab analüüsida üldisi majandusnähtusi ning nendevahelisi seoseid;"}, {"en": "* is able to think economically and use simple models to display the behavior of economic participants;", "et": "* oskab majanduslikult mõelda ja kasutada majanduses osalejate käitumise kuvamiseks lihtsamaid mudeleid;"}, {"en": "* is able to evaluate and find different solutions to current economic problems and is able to participate in teamwork;", "et": "* oskab hinnata ja leida erinevaid lahendusi aktuaalsetele majandusprobleemidele ja on võimeline osalema meeskonnatöös;"}, {"en": "* masters the general principles of independent collection and use of economic information;", "et": "* valdab majandusalase info iseseisvalt kogumise ja kasutamise üldiseid põhimõtteid;"}, {"en": "* is able to critically analyse economic information published in the press;", "et": "* on suuteline kriitiliselt analüüsima pressis avaldatavat majandusalast informatsiooni;"}, {"en": "* is able to apply the acquired knowledge and skills in civil society and continue studies.", "et": "* on suuteline omandatud teadmisi ja oskusi rakendama kodanikuühiskonnas ning õpinguid jätkama."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}