{"uuid": "25433b52-234e-32fa-b186-2b4fde7524bc", "code": "SVNC.00.281", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-08T16:21:53", "title": {"en": "The Russian Minority in Estonia", "et": "Vene vähemus Eestis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The main themes to be discussed are: (1) introduction to the course and the historical development of the Russian-speaking minority in Estonia, (2) the socio-economic situation: labour market situation, equality and equal treatment, (3) political situation: political and civic participation, citizenship and trust in institutions, (4) cultural situation: culture, identity and interpersonal contact, including segregation, (5) education and language: the dual educational system, transition to the Estonian language of instruction at schools, de facto bilingualism, (6) ethnopolitical regime: the political instruments and policies of integration.", "et": "Peamised teemad aruteluks: (1) sissejuhatus kursusse ja venekeelse vähemuse ajalooline väljakujunemine Eestis, (2) sotsiaalmajanduslik olukord: tööturu olukord, võrdsus ja võrdne kohtlemine, (3) poliitiline olukord: poliitiline ja ühiskondlik osalus, kodakondsus ja usaldus institutsioonide vastu, (4) kultuuriaspektid: kultuur, identiteet ja eri rahvusest inimeste vahelised kontaktid, eesti keelele üleminek koolis, de facto kakskeelsus, (6) etnopoliitiline režiim: poliitilised instrumendid ja integratsioonipoliitika."}, "objectives": [{"en": "This course aims to provide a deeper understanding of the Russian-speaking population in Estonia: how this ethnic minority group in Estonia emerged, what is their current legal, political and socio-economic status, what are the prevailing attitudes among this group, and how these have changed over time. This course discusses the challenges related to the identity building of the Russian-speaking population in Estonia vis-à-vis the majority population (ethnic Estonians), the actions by the government of Estonia when approaching this population as a policy target group, and looks into what kind of policy measures it uses to promote integration, education, language learning etc. We will also look into whether and how this group has fared throughout different \"crises\" - the Bronze Soldier case in 2007, the global economic crisis, the war in Ukraine (including Crimea in 2014), and COVID-19.", "et": "Kursuse eesmärk on anda sügavam mõistmine Eestis elavatest vene keelt kõnelevatest elanikest: kuidas see etniline vähemusgrupp Eestisse tekkis; mis on nende praegune seaduslik, poliitiline ja sotsiaalmajanduslik status; mis hoiakud selles grupis valitsevad/prevaleerivad; kuidas need hoiakud on läbi aegade muutunud. Kursus käsitleb venekeelse elanikkonna identiteedi konstrueerimisega seotud väljakutseid Eesti kontekstis (vs enamusgrupp), Eesti valitsuse poliitilisi tegevusi/otsuseid, mis on suunatud just sellele sihtrühmale ja vaatleb, milliseid poliitilisi meetmeid on kasutatud integratsiooni, hariduse ja eesti keele õppe edendamiseks. Samuti vaadeldakse, kuidas see grupp (eestivenelased) on tulnud toime erinevate \"kriisidega\" - pronkssõduri teisaldamine 2007. aastal, globaalne majanduskriis, sõda Ukrainas (k.a. Krimmi annekteerimine 2014. aastal) ja koroonapandeemia."}], "learning_outcomes": [{"en": "Upon completion of the subject a student:", "et": "Kursuse läbinud tudeng: "}, {"en": "-\tknows the history of emergence of the Russian minority in Estonia;", "et": "-\tteab Eestis elava venekeelse vähemuse tekkimise ajalugu "}, {"en": "-\tknows about the social-economic, political, and cultural situation of the Russian minority in Estonia;", "et": "-\ttunneb venekeelse vähemuse sotsiaalmajanduslikku, poliitilist ja kultuurilist olukorda Eestis"}, {"en": "-\tcan point out the challenges, problems, and success stories of the Russian minority;", "et": "-\toskab välja tuua venekeelse vähemuse ees seisvad väljakutsed, probleemsed kohad ja kordaminekud"}, {"en": "-\tunderstands the integration policy of Estonia.", "et": "-\tmõistab Eestis valitsevat integratsioonipoliitikat"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}