{"uuid": "51ec918e-5ebd-7849-b36b-78e821a2f3e2", "code": "SVNC.00.061", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Graduation Thesis Seminar", "et": "Lõputöö seminar"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Design of research related to graduation paper. Defining of a research subject, justification of its selection, pointing out the existing problems. Formulation of the theoretical bases for the research, defining the objective, methods, sample, organisation, methods for the analysis of the results, etc. Time schedule, stages, interim reports and intermediate tasks of the research work. Finding research materials, conduction of the research, and analysis and interpretation of the results. Presentation and defence of the intermediate and final results of the research.", "et": "Lõputöötööga seonduva uuringu kavandamine. Uurimisteema leidmine, selle valiku põhjendamine, eksisteerivate probleemide esiletoomine. Uuringu teoreetiliste aluste formuleerimine, eesmärgi püstitus, meetodid, valim, korraldus, tulemuste analüüsimeetodid jms. Uurimistöö ajakava, etapid, vahearuanded ja -ülesanded. Uurimismaterjali leidmine, uuringut läbiviimine ja tulemuste analüüs ning interpreteerimine. Uurimistöö vahetulemuste ja lõpptulemuse esitamine ja kaitsmine."}, "objectives": [{"en": "...", "et": "Õpetusega taotletakse, et õppija süvendab teadmisi ja oskusi iseseisva uurimistöö ettevalmistamiseks ning teostamiseks. Õppija arendab teoreetilise ja empiirilise materjali leidmise, kasutamise ja analüüsi oskusi, uurimismetoodika valiku ja valimi moodustamise ning uuringu koostamise, läbiviimise ja uuringutulemuste analüüsi oskusi."}], "learning_outcomes": [{"en": "...", "et": "Kursuse läbimisel õppija teab:\n*\tkuidas kavandada uuringut, leida materjali, uuringut läbi viia ning tulemusi analüüsida ja interpreteerida\nKursuse läbimisel õppija oskab:\n*\tleida oma lõputööga seonduv uurimisteema ning põhjendada selle valikut\n*\tformuleerida uuringu teoreetilised alused ja taust, eesmärgid, meetodid, valim, korraldus, tulemuste analüüsimeetodid jms\n*\tplaneerida uurimistööd\n*\tviia läbi uurimistööd ning analüüsida ja vormistada uurimistulemusi\n*\tesitada ja kaitsta oma uurimistöö tulemusi"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}