{"uuid": "9f115380-1da5-b3f0-2cdd-d4ac35f0c41b", "code": "SVNC.00.187", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Communication and Feedback in an Educational Organisation", "et": "Suhtlemine ja tagasiside haridusorganisatsioonis"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Teacher's communication model. Communication skills and communication techniques: communication levels; psychological contact; active listening; argumentation, imposition. Group processes and group development phases. Recommended courses of action in the different developmental stages of the classroom. Ways to create a caring, bullying-free and collaborative social environment in class. A development conversation. Feedback and counselling. The impact of culture on communication and behaviour.", "et": "Põhimõisted. Õpetaja suhtlemismudel. Suhtlemisoskused ja suhtlemistehnikad: suhtlemistasandid; psühholoogiline kontakt; aktiivne kuulamine; argumenteerimine, kehtestamine. Grupiprotsessid ja grupi arengufaasid. Õpetaja soovitavad toimimisviisid klassi arengufaasides Hooliva, kiusamisvaba ja koostöise suhtluskeskkonna loomise võimalused klassis. Arenguvestlus. Tagasiside ja nõustamine. Kultuuri mõju suhtlemisele ja käitumisele."}, "objectives": [{"en": "The course provides basic knowledge of the use of communication skills and group processes in a pedagogical context.", "et": "Kursus annab baasteadmised suhtlemisoskuste kasutamisest ja grupiprotsessidest  pedagoogilises kontekstis."}], "learning_outcomes": [{"en": "On successful completion of the course, the student: ", "et": "Aine läbinud üliõpilane:"}, {"en": "1)\tknows the essential principles of communication and knows how to use them in pedagogical work;", "et": "1)\ttunneb suhtlemisega seonduvaid olulisi põhimõtteid ja teab kuidas neid kasutada pedagoogilises töös;"}, {"en": "2)\tknows the components of the teacher's communication model and can name the behaviours through which the learner-centred attitude is expressed;", "et": "2)\ttunneb õpetaja suhtlemismudeli koostisosi ja nimetab käitumisviise mille kaudu avaldub õppijakeskne hoiak;"}, {"en": "3)\tknows communication skills and communication techniques: distinguishes different levels of communication and knows their possible impact on the communication partner, describes techniques for gaining psychological contact with an individual and a group, describes active listening techniques and how to use them, describes argumentation as fact-based reasoning techniques, describes the techniques of imposition and the ways in which they are used;", "et": "3)\ttunneb suhtlemisoskusi ja suhtlemistehnikaid: eristab erinevaid suhtlemistasandeid ja teab nende võimalikku mõju suhtlemispartnerile, kirjeldab psühholoogilise kontakti saamise võtteid indiviidiga ja grupiga, kirjeldab aktiivse kuulamise tehnikaid ja nende kasutamise viise, kirjeldab argumenteerimise kui faktipõhise põhjendamise võtteid, kirjeldab kehtestamistehnikaid ja nende kasutamise viise;"}, {"en": "4)\tdescribes ways of planning and giving efficient feedback;", "et": "4)\tkirjeldab kuidas planeerida ja anda efektiivset tagasisidet;"}, {"en": "5)\tdistinguishes between inefficient and effective ways of dealing with a learner's problems in order to achieve a caring, secure and bullying-free learning environment;", "et": "5)\teristab ebatõhusad ja tõhusad suhtlemisviise õppija probleemidega tegelemisel, et saavutada hooliv, turvaline ja kiusamisvaba õpikeskkond;"}, {"en": "6)\tknows the identifiable patterns of group processes and describes the developmental phases of the class;", "et": "6)\ttunneb grupiprotsesside seaduspärasusi ja kirjeldab klassi arengufaase;"}, {"en": "7)\tcan identify the recommended courses of action at different stages of class / group development;", "et": "7)\tnimetab õpetaja soovitavaid toimimisviise erinevates klassi/grupi arengufaasides;"}, {"en": "8)\tis familiar with the principles of conducting an individual progress review used to support the learner's development and mentions some scenarios for conducting said individual progress review;", "et": "8)\ttunneb õppija arengu toetamiseks kasutatava arenguvestluse läbiviimise printsiipe ja nimetab mõningaid stsenaariume arenguvestluse läbiviimiseks;"}, {"en": "9)\tmentions the basic principles of pedagogical counselling;", "et": "9)\tnimetab pedagoogilise nõustamise põhiprintsiipe;"}, {"en": "10)\texplains the impact of culture on communication and ways to take cultural differences into account in the classroom;", "et": "10)\tselgitab kultuuri mõju suhtlemisele ja kultuurierinevustega arvestamise võimalusi klassiruumis;"}, {"en": "11)\tanalyses his/her own communication skills in a pedagogical context.", "et": "11)\tanalüüsib oma suhtlemist pedagoogilises kontekstis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}