{"uuid": "6e0a31e1-cc43-fa10-cb42-b85feae1cd43", "code": "SVNC.00.145", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Teacher's Professional Development Seminar", "et": "Õpetaja professionaalse arengu seminar"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course is based on students' development needs and wishes. As a result of the joint discussion, a topic is selected as a development project, and then the chosen problem is solved. Students carry out field analysis, plan activities and implement a joint project that has resulted in real change and conscious learning.\nThe development seminar also deals with mapping, analyzing and supporting the development of students' personal learning needs. If necessary, guest lecturers, study visits and field trips are included.", "et": "Kursusel lähtutakse tudengite arengu vajadustest ja soovidest. Ühise arutelu tulemusena valitakse arenguprojektiks teema, misjärel asutakse valitud probleemi lahendama. Tudengid viivad läbi valdkonna analüüsi, planeerivad tegevusi ja viivad ellu ühisprojekti, mille tagajärjel on toimunud reaalne muutus ja teadvustatud õppimine.\nArenguseminar tegeleb ka tudengite isiklikke õpivajaduste kaardistamise, analüüsi ja arengu toetamisega. Vajadusel kaasatakse külalislektoreid, tehakse õppevisiite ja väljasõite."}, "objectives": [{"en": "The aim of the course is to support students in acquiring the knowledge and skills necessary to complete the master's program and to become a teacher. In addition, the course aims to provide a supportive learning environment that helps to map students' personal learning needs, analyze learning experiences and carry out a joint research project.", "et": "Kursuse eesmärgiks on toetada tudengeid omandamaks teadmisi ja oskusi, mis on vajalikud magistriprogrammi läbimiseks ning õpetajakutse omandamiseks. Lisaks sellele on kursuse eesmärgiks tagada toetav õpikeskkond, mis aitab kaardistada üliõpilaste isiklikke õpivajadusi, analüüsida õppimiskogemust ja viia ellu ühine uurimisprojekt."}], "learning_outcomes": [{"en": "A student who has successfully completed a Teacher Professional Development Seminar:", "et": "Õpetaja professionaalse arengu seminari edukalt läbinud üliõpilane:"}, {"en": "- Plans his / her own learning process;", "et": "- Kavandab enda õppimisprotsessi;"}, {"en": "- Reflects on personal learning experience;", "et": "- Reflekteerib isikliku õppimiskogemuse üle;"}, {"en": "- Communicates with coursemates to achieve common goals and participate effectively in group work;", "et": "- Suhtleb rühmakaaslastega saavutamaks ühiseid eesmärke ja osalemaks efektiivselt grupitöös;"}, {"en": "- Has planned, implemented and analyzed a joint project with coursemates.", "et": "- On koos rühmakaaslastega planeerinud, ellu viinud ja analüüsinud ühisprojekti."}, {"en": "- Understands the characteristics of the teaching profession and the requirements and expectations of the teaching profession;", "et": "- Mõistab õpetajakutse eripärasid ning õpetajakutsele esitatavaid nõudeid ja ootusi;"}, {"en": "- Reflects, analyzes and reflects on their professional competence;", "et": "- Mõtestab, analüüsib ja reflekteerib oma erialast pädevust; "}, {"en": "- Identifies needs for self-development and plans activities to meet its development goals, based on the principles of lifelong learning and continuous professional development.", "et": "- Määratleb enesearendusvajadusi ja kavandab tegevusi oma arengueesmärkide saavutamiseks, lähtudes elukestva õppe ja pideva kutsealase arengu põhimõtetest."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}