{"uuid": "a637a6cd-73bf-f44f-b90c-7a76deccf52f", "code": "SVNC.00.225", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Master's thesis is a research work on the topic of education science or subject didactics which provides a solution to a chosen problem and complies with requirements to scientific written work. It can be an educational research of either an applied or empirical direction. The research of the applied content uses the scientifically justified methodology to describe and analyze a practical educational issue. The research of the empirical content presents a plan for a more effective organization of the professional sphere, implementation of new methods, study materials, etc. In the process of writing of the research paper, a student deepens their knowledge of the speciality, demonstrate acquired educational competences and skills. The student presents his/her thesis at the public defence.", "et": "Magistritöö on haridusteemaline või ainedidaktiline uurimuslik töö, mis annab lahenduse valitud probleemile ning vastab teadustöö nõuetele kirjalikus vormis. See võib olla nii rakendusliku kui arendusliku suunaga haridusteemaline uurimus. Rakendusliku sisuga uurimus kirjeldab ja analüüsib teaduslikult põhjendatud metoodika alusel praktiseerimisega seotud haridusprobleemi. Arendusliku sisuga uurimus esitab kava kutseala efektiivsemaks korraldamiseks, uute meetodite, õppematerjalide jne rakendamiseks. Üliõpilane süvendab uurimuse kirjutamise käigus iseseisvalt oma erialaseid teadmisi, näitab omandatud haridusalaseid pädevusi ja oskusi. Üliõpilane esitleb oma tööd avalikul kaitsmisel."}, "objectives": [{"en": "To prepare a student for independent research activity, to provide him/her with a possibility to demonstrate and implement skills: to be aware of the modern research literature and methodology, to conduct a research, to use different means of data handling and analysis, to compose and write a research work (research works on the topics of education science or methodology that are topical for the practice of teaching Russian as a foreign language).", "et": "Valmistada üliõpilane ette iseseisvaks teadustegevuseks, anda võimalus demonstreerida ja rakendada oskuseid: orienteeruda tänapäevases teaduskirjanduses ja metodoloogias, viia läbi uuring, kasutada erinevaid andmetöötluse ja analüüsimise  vahendeid, koostada ja kirjutada teadustöö (vene keele kui võõrkeele õpetamise praktikaks aktuaalsed metoodilised või haridusteemalised teadustööd)."}], "learning_outcomes": [{"en": "Upon completion of the module a student: ", "et": "Aine läbinud üliõpilane:  "}, {"en": "1) evaluates the topicality of the research problem and can choose the research topic, formulate the research aims, tasks and hypothesis;", "et": "1) hindab uurimisprobleemi aktuaalsust ja oskab valida teadusteemat, sõnastada uurimiseesmärke, -ülesandeid ja hüpoteesi;"}, {"en": "2) plans a research on the topic of subject didactics or education science; ", "et": "2) kavandab ainedidaktilist või haridusteemalist uurimust;"}, {"en": "3) conducts a research in compliance with ethical requirements; ", "et": "3) viib läbi uuringu kooskõlas eetika nõuetega;"}, {"en": "4) searches for, systematizes, and analyzes relevant research literature as well as synthesizes and generalizes the theoretical viewpoints and research results presented in the literature; ", "et": "4) otsib, valib, süstematiseerib, analüüsib teemakohast teaduskirjandust ning sünteesib ja üldistab selles esitatud teoreetilisi seisukohti ning uurimistulemusi;"}, {"en": "5) collects data and analyzes their quality; ", "et": "5) kogub ja hangib andmeid, analüüsib nende kvaliteeti; "}, {"en": "6) chooses the method for the data analysis, analyzes the research data and interprets the received results; ", "et": "6) valib andmeanalüüsi meetodi, analüüsib uurimisandmeid ning tõlgendab saadud tulemusi;"}, {"en": "7) composes a written report and makes an oral presentation of the research results in compliance with the academic requirements.", "et": "7) koostab kirjalikult ja esitab suuliselt teadustöö tulemusi vastavalt akadeemilistele nõuetele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}