{"uuid": "21dca19e-f8ce-214a-119c-23ecc90bb113", "code": "SVNC.00.137", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Research Methods in Education", "et": "Uurimismeetodid haridusteadustes"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course allows acquiring basic knowledge and skills to design and carry out educational research.", "et": "Ainekursus võimaldab omandada põhilised teadmised ja oskused haridusteadusliku uurimistöö kavandamiseks ning läbiviimiseks."}, "objectives": [{"en": "The aim of the course is to support students' in developing their research knowledge and skills and form their understanding about the nature and implementation of educational research.", "et": "Õppeaine eesmärk on toetada üliõpilasi uurivaks õpetajaks kujunemisel ning kujundada arusaama haridusteadusliku uurimistöö olemusest ja läbiviimisest."}], "learning_outcomes": [{"en": "A student who has passed the course: \n1) knows, why the research of learning and teaching is important in teachers's work and also values the dissemination of pedagogical knowledge \n2) is familiar with the nature of educational research (including research ethics), philosophical standpoints and research process \n3) knows the most common research designs, strategies, data collection and data analysis methods in researching learning and teaching; and is able to make  informed choices in designing and carrying out educational research \n4) is familiar with the quality criteria for research and based on this is able to critically analyse and evaluate the research   \n5) is able, if necessary, to supervise the designing of and carrying out students' work", "et": "Aine läbinud üliõpilane:\n1)\tteab, miks on õppimise ja õpetamise uurimine ning pedagoogilise teadmuse levitamine õpetajatöös oluline;\n2)\tanalüüsib ja hindab haridusteadusliku uurimistöö olemust (sh uurimistöö eetikaga seonduvat), teoreetilisi lähtekohti ja uurimistöö protsessi;\n3)\tanalüüsib ja hindab õppimise ja õpetamise uurimisel kasutatavaid enamlevinud uuringudisaine, -strateegiaid, andmekogumise- ja -analüüsi meetodeid ja oskab neid rakendada haridusteaduslike uuringute kavandamisel ja läbiviimisel;\n4)\trakendab erinevaid digitaalseid andmeanalüüsiprogramme;\n5)\tanalüüsib ja hindab uurimistöid lähtuvalt uuringutele esitatavatest kvaliteedikriteeriumitest;\n6)\toskab planeerida ning ellu viia tegevusuuringut."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}