{"uuid": "5afc34b8-ae59-d4d7-4890-15ccb19266a1", "code": "SVNC.00.104", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Studies", "et": "Sissejuhatus õpingutesse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The topics covered during the course are:\n- Learning;\n- Digital competences;\n- Learning skills: learning styles and strategies, learning planning, time management, self-management, preparation for exams and assessment;\n- Written and oral self-expression skills: types of academic text, writing, presenting, writing assignments, referencing;\n- Information searches, sources and technologies: recognizing and identifying information needs, information retrieval processes, strategies and tactics. Databases, information request formulation, search techniques, identifying, locating and selecting appropriate sources of information", "et": "Kursuse käigus käsitletavad teemad on järgmised: \n- Õppimine;\n- Digipädevused; \n- Õpioskused: õpistiilid ja -strateegiad, õppimise planeerimine, ajajuhtimine, enesejuhtimine, eksamiteks ja arvestusteks valmistumine; \n- Kirjalik- ja suuline eneseväljendusoskus: akadeemilise teksti liigid, konspekteerimine, esinemine ja ettekannete tegemine, üliõpilastööde vormistamine, viitamine; \n- Infootsingud, -allikad ja -tehnoloogiad: infovajaduse äratundmine ja kindlaksmääramine, infootsingu protsess, strateegiad ja taktikad. Andmebaasid, infopäringu sõnastamine, otsingutehnikad, sobilike infoallikate määratlemine, leidmine ja valik."}, "objectives": [{"en": "Develop readiness for higher education and create opportunities for collaborative and independent learning through academic writing, information retrieval and digital competence development.", "et": "Kujundada valmisolek kõrgkoolis õppimiseks ja luua võimalused koostööks ja iseseisvaks õppimiseks läbi akadeemilise kirjutamise, infootsingu ja digipädevuste kujundamise."}], "learning_outcomes": [{"en": "After passing the course:", "et": "Kursuse läbinud üliõpilane: "}, {"en": "- Has an overview of cognitive processes important in the context of learning and teaching and is able to notice and apply them;", "et": "- omab ülevaadet õppimise ja õpetamise kontekstis olulistest tunnetusprotsessidest ning oskab neid märgata ja rakendada;"}, {"en": "- knows how to develop learning skills and applies them;", "et": "- teab õpioskuste arendamise põhimõtteid ning rakendab neid; "}, {"en": "- creates correctly formalized academic text using appropriate information sources;", "et": "- loob korrektselt vormistatud akadeemilist tekste kasutades sobilikke infoallikaid; "}, {"en": "- can use critical thinking, reading, writing methods and strategies, analyze the content of arguments and present his or her views both orally and in writing;", "et": "- oskab kasutada kriitilise mõtlemise, lugemise, kirjutamise meetodeid ja strateegiaid, analüüsida argumentide sisulist külge ning esitada oma seisukohti nii suuliselt kui ka kirjalikult; "}, {"en": "- is able to plan his / her studies, analyze himself / herself and his / her possibilities and make his / her choices based on them;", "et": "- oskab enese õpinguid planeerida, end ja oma võimalusi analüüsida ning nendest lähtuvalt oma valikuid teha; "}, {"en": "- knows the learning environments used in teaching and is able to use technologies that support learning activities.", "et": "- teab õppetöös kasutatavaid õpikeskkondi ja oskab kasutada õppetegevust toetavaid tehnoloogiaid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}