{"uuid": "78f9a457-0144-3ec2-00c6-9548bd461723", "code": "SVNC.00.117", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methodology of Teaching Estonian as the Second Language", "et": "Eesti keele kui teise keele õpetamise metoodika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an overview of the methodology of teaching Estonian as a second language. Topics covered include learning and teaching styles and methods, lesson and syllabus development, grammar, vocabulary and Estonian skills development, assessment and feedback, etc.", "et": "Kursus annab ülevaate eesti keele kui teise keele õpetamise metoodikast. Käsitletakse teemasid: õppimise ja õpetamise stiilid ja meetodid, tunnikava ja ainekava koostamine, keele grammatika, sõnavara ja eesti keele osaoskuste arendamine, hindamine ja tagasiside, jne."}, "objectives": [{"en": "1) to introduce the basic knowledge of the methodology of teaching Estonian as a second language", "et": "1) tutvustada eesti keele kui teise keele õpetamise metoodika põhiteadmisi "}, {"en": "2) to provide students with an overview of the curriculum, the syllabus and the preparation of the teacher's work plan, the planning and targeting of lessons and the testing, assessment and feedback of teaching Estonian as a second language.", "et": "2) anda üliõpilastele ülevaade õppekavast, ainekavast ning õpetaja töökava koostamisest, tundide planeerimisest ja eesmärgistamisest ning teadmiste kontrollimisest, hindamisest ja tagasiside andmisest eesti keele kui teise keele õpetamisel."}], "learning_outcomes": [{"en": "Upon competing the course, the student:", "et": "Kursuse lõpuks üliõpilane"}, {"en": "1) Is aware of bilingual education programs in use in Estonia.", "et": "1) On teadlik Eestis kasutatavatest kakskeelse hariduse programmidest."}, {"en": "2) Will be able to analyze learning materials developed for learning Estonian as a second language.", "et": "2) Oskab analüüsida eesti keele kui teise keele õppeks koostatud õpivara."}, {"en": "3) Is able to prepare assignments for the development of basic skills and language skills for learning Estonian as a second language / foreign language.", "et": "3) Oskab koostada osaoskusi ja keeleteadmisi arendavaid ülesandeid eesti keele kui teise keele/võõrkeele õppeks."}, {"en": "4) Is able to analyze and produce text-based study materials in the Estonian language class.", "et": "4) Oskab analüüsida ja koostada tekstipõhiseid õppematerjale eesti keele tundi."}, {"en": "5) Can plan lesson and assessment based on study material", "et": "5) Oskab õppematerjalist lähtuvalt kavandada õppetundi ja hindamist"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}