{"uuid": "d371e6e6-f443-68fa-9b39-b65df3aefb8f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-29T14:39:58", "title": {"en": "Cross-cultural Communication and Multicultural Education", "et": "Kultuuridevaheline suhtlemine ja mitmekultuuriline haridus"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 10, "practice": 0, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course provides an overview of the history and theoretical approaches to cross-cultural communication, multicultural society and its development in Estonia; development of the ideas of multicultural education and the corresponding problems in today's Estonia and the rest of the world. The course introduces models of education for national minorities as well as various adaptation programmes applied in organisation of multicultural education. Students become acquainted mostly with the strategies that ensure their preparation for working in a multicultural environment.", "et": "Ülevaade kultuuridevahelise suhtluse ajaloost ja teoreetilistest käsitlustest, mitmekultuurilisest ühiskonnast ja selle arengust Eestis. Ülevaade multikultuurilise hariduse ideede arengust ja tänasest problemaatikast Eestis ja muus maailmas. Käsitletakse vähemusrahvuste hariduse mudeleid ning erinevaid adaptatsiooniprogramme mitmekeelse hariduse korraldamisel. Tutvustatakse peamisi strateegiaid, mis tagavad valmisoleku töötamaks multikultuurilises keskkonnas."}, "objectives": [{"en": "The goals of the course are to develop students' cross-cultural communication knowledge and competence and understanding of multiculturalism in the world; to provide an overview of the development of ideas of multicultural education and the current issues in Estonia and abroad.", "et": "Kursuse eesmärgid on arendada üliõpilastel teadmisi ja pädevust kultuuridevahelise suhtlemise valdkonnas, aidata üliõpilastel aru saada multikultuursusest maailmast, anda ülevaade multikultuurilise hariduse ideede arengust ja tänasest problemaatikast Eestis ja mujal maailmas."}], "learning_outcomes": [{"en": "The student:", "et": "Üliõpilane"}, {"en": "1) has theoretical knowledge in the field of cross-intercultural communication;", "et": "1) omab teoreetilisi teadmisi kultuuridevahelise suhtlemise valdkonnast; "}, {"en": "2) is aware of the influence that culture has on communication and behaviour and perceives oneself as competent in intercultural communication; ", "et": "2) teadvustab kultuuri mõju suhtlemisele ja käitumisele ning tajub ennast kultuuridevahelise suhtlejana;"}, {"en": "3) can notice manifestations of ethnocentrism in their personal behaviour, way of thinking and evaluations;", "et": "3) oskab märgata etnotsentrismi ilminguid oma käitumises, mõtteviisis ja hinnangutes;"}, {"en": "4) can use theoretical material on intercultural communication to analyse particular situations; ", "et": "4) oskab kasutada kultuuridevahelise suhtluse teoreetilist materjali konkreetsete situatsioonide analüüsimisel;"}, {"en": "5) can analyse the problems of the multicultural society of in Estonia;", "et": "5) analüüsib multikultuurilise ühiskonna probleeme Eestis;"}, {"en": "6) knows about different education system reforms in Europe and Estonia;", "et": "6) teab haridussüsteemi reformide kogemusest Euroopas, sh ka Eestis;"}, {"en": "7) can evaluate and develop interculturality in educational processes;", "et": "7) võib korraldada ja hinnata haridusprotsesside interkultuurilisust;"}, {"en": "8) can choose teaching forms and techniques depending on a particular linguistic and cultural context;", "et": "8) oskab valida hariduse mudeleid ja õppevõtteid sõltuvalt konkreetsest keelelisest ja kultuurilisest situatsioonist;"}, {"en": "9) can describe the role of the teacher in managing bilingual education and developing tolerance;", "et": "9) oskab määratleda õpetaja kohta bilingvaalse hariduse juhtimisel ja tolerantsuse kasvatamisel;"}, {"en": "10) is aware of the peculiarities of a multicultural learning environment in educational work and considers them.", "et": "10) teab mitmekultuurilise õppekeskkonna iseärasusi kasvatustöös ja oskab nendega arvestada."}], "notes": {}}, "grading": {"independent_work": {"et": "Iseseisev töö \"Kultuuridevahelise suhtlemise\" Jelena Nõmme osas:\n\nIndividuaalne kodutöö (oma välisreisi ja kultuuridevahelise suhtluse kogemuse kirjeldamine ja analüüs essee vormis). Tähtaeg: 15.04.2024, elektroonilisel kujul Moodle keskkonnas.\n\nIseseisvad tööd L. Tuulingu osas:\n\n1.\tKoguda materjali erinevate usundite kohta erinevatest infoallikatest (interneti allikad, raamatud, teatmeteosed). Teksti ei pea vormistama referaadina. Kogutud materjalis peavad olema ära märgitud allikad, kust informatsioon pärineb. Lae kogutud materjal moodlesse KELA1 A Tähtaeg 01.04.2024 KELA1 B Tähtaeg 15.04.2024 5p\n2.\tKoguda materjali erinevate programmide kohta, mida kasutatakse Eesti lasteaedades ja koolides väärtuskasvatuse eesmärgil  laste sotsiaalsete oskuste (sh tolerantsus) arengu toetamiseks ja kiusamiskäitumise vähendamiseks. Välja peab olema toodud kust on programm alguse saanud (päritolu riik, põhimõtete väljatöötajad). Kirjeldatud peab olema metoodika või programmi eesmärgid, põhimõtted, tegevused ja rakendamise praktika (näiteid Eesti haridusasutustest).  Lae kogutud materjal moodlesse KELA1 A Tähtaeg 10.04.2024 KELA1 B Tähtaeg 13.04.2024 5p\n3.\tLugeda läbi: Tuuling, L. 2017. Mitmekultuuriline kasvatus alushariduses. Rmt. Õppe- ja kasvatustegevus lasteaias. Koost. Nugin, k., Õun,T. Tartu, AS Atlex. LK. 95 - 109. Tähtaeg 01.05.2024\n4.\tLapse integratsiooni toetava kasvu- ja õpikeskkonna kirjeldus mitmekultuurilises lastekollektiivis. Kirjelduses tuleb silmas pidada õpikeskkonna kolm põhivaldkonda: ruumikeskkond, õppevara ja inimkeskkond. Lae kirjeldus moodlesse 12.06.2024 15p"}, "independent_work_assessments": [{"work_type": {"code": "essay", "et": "Essee", "en": "essay"}, "description": {"et": "Tehtud individuaalne kodutöö saab 10 palli, kui selles\n1). on kirjeldatud oma kogemus kultuuridevahelisest suhtlemisest,\n2). on pööratud tähelepanu kultuuridevahelistele erinevustele ja olemasolevatele stereotüüpidele teise kultuuri kohta,\n3). on tehtud oma kogemuse analüüs kultuuridevahelise suhtlemise teooriate seisukohast (soovitav on kasutada G. Hofstede, E. Halli, M. Bennetti teooriaid),\n4). on tehtud korrektsed viited kasutatud allikatele (töös on võimalik kasutada ainult usaldusväärseid allikaid kultuuridevahelise kommunikatsiooni teooriate kohta)."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltest kontrollib teoreetilisi teadmisi \"Kultuuridevahelise suhtlemise\" osast (20 palli). Tähtaeg: 13.04.2024"}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A - töö on täpne ja ammendav vastus püstitatud küsimusele, piisavalt informatiivne, kirjutatud oma sõnadega ja illustreeritud näidetega. Puudub tekst, mis ei ole seotud küsimusega. Vastus on korrektne keele kasutuse suhtes.\nB - töö on täpne vastus püstitatud küsimusele, piisavalt informatiivne, kirjutatud oma sõnadega. Ei ole ebavajalikut infot. Võivad tekkida mõned keelelised või vähesed faktilised vead.\nC - töö on täpne vastus püstitatud küsimusele. Mõned vajalikud faktid ei kajastatud (kuni 15%) vastuses. Kirjutaja on iseseisev, kõik tsitaadid on varustatud viidetega.Võivad tekkida mõned keelelised või vähesed faktilised vead.\nD - töö on vastus püstitatud küsimusele, kuid puuduvad paljud vajalikud faktid. Töös on olemas ebavajalik info. Tekstis on palju tsitaate, mõned neist ei ole varustatud viidetega.\nE - töö on tekst, mis kaudselt vastab küsimusele. On mainitud vähemalt 3-4 vajalikut fakti. Tekstis on palju tsitaate, mõned neist ei ole varustatud viidetega. Tekstis on palju keelelisi vigu.\nF - töö tekst ei vasta küsimusele kas info puudumise või vale informatsiooni tõttu või on olemas plagiaat. Äärmiselt palju keelevigu, mõned neist segavad adekvaatset fakte arusaamist."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Lehte Tuulingu osa ainest hinnatakse aine käigud valminud  ja üliõpilase poolt refereeritud individuaalsetest, paaris- ja rühmatöödest koostatud õpimapi alusel."}}], "grade_preconditions": {"et": "Kontrolltesti kultuuridevahelise suhtlemise osast sooritamine (min 51%) ja Iseseisvate tööde täitmine on kohustuslik ja lõpphindamisele pääsemise tingimus."}, "grade_evaluation": {"et": "Kursuse 1. osa (\"Kultuuridevaheline suhtlemine\") läbimine moodustab 50% lõpphindest:\n\n1) osavõtt praktikumidest ja seminaridest annab 10% lõpphindest (igast seminarist või praktikumist osavõtt annab 2%),\n2) individuaalse kodutöö täitmine annab maksimaalselt 10% (sõltub töö kvaliteedist),\n3) kontrolltöö (teoreetiliste teadmiste kontrolltest) sooritamine annab 20%,\n4) eksami töö annab 10% (kirjalik eksam koosneb ühest praktilisest ülesandest).\n\nKursuse 2. osa: Hinne kujuneb iseseivate ja rühmatööde hinnete põhjal.\n\n1. Rühmatöö - Kultuurilised erinevused. KELA1 A Tähtaeg 22.03.2024 KELA1 B Tähtaeg 13.04.2024 15p\n2. Iseseisev töö + rühmatöö - Enamlevinud usundid. KELA1 A Tähtaeg 10.04.2024 KELA1 B Tähtaeg 13.04.2024 20p\n3. Iseseisev töö + rühmatöö - Programmid, mida kasutatakse Eesti lasteaedades ja koolides väärtuskasvatuse eesmärgil - laste sotsiaalsete oskuste (sh tolerantsus) arengu toetamiseks ja kiusamiskäitumise vähendamiseks. KELA1 A Tähtaeg 25.04.2024 KELA1 B Tähtaeg 11.05.2024 20p\n3. Mõistekaart - Mitmekultuuriline haridus slaidiesitluse, MOOC-i kursuse ja artikli põhjal. 04.05.2023 15p\n4. Lapse integratsiooni toetava kasvu- ja õpikeskkonna kirjeldus mitmekultuurilises lastekollektiivis. Kirjelduses tuleb silmas pidada õpikeskkonna kolm põhivaldkonda: ruumikeskkond, õppevara ja inimkeskkond. Lae kirjeldus moodlesse 31.05.2024  15p\n5. Tegevuskava teisest kultuuriruumist pärit lapse saabumisel lastekollektiivi toetamaks tema integratsiooniprotsessi. KELA1 A Tähtaeg 15.04.2024 KELA1 B Tähtaeg 11.06.2024 15p"}, "debt_elimination": {"et": "Kõik võlgnevused peavad olema likvideeritud enne eksamit, ehk enne eksamisessiooni algust. Eksamisessiooni ajal õppejõud ei anna ja ei võta vastu lisaülesanded, kodutööd jm."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Nõmm, Jelena 2006. Kultuuridevahelise kommunikatsiooni teooria ja praktika: Kursuse \"Kultuuridevaheline suhtlemine\" õppematerjal (kahes osas). Narva: Tartu Ülikooli Narva Kolledž.\nBerry, John W. 2008. Integratsiooni psühholoogilisest ja kultuurilisest vaatenurgast. Integratsiooni kontseptuaalsed alused ja parimad praktikad. Tallinn: Integratsiooni Sihtasutus. 21-30. https://www.integratsioon.ee/sites/default/files/159_180.pdf (viimati vaadatud 10.02.2023).\nMultikultuurse hariduse juhend. Euroopa Noored. http://noored.ee/opimaterjalid/kasiraamatud/multikultuurse-hariduse-juhend/ (viimati vaadatud 10.02.2023).\nTrasberg, Karmen (toim.) 2002. Haridus mitmekultuurilises perspektiivis. Tartu:\nMul'tikul'turnoe obrazovanie: kljuchevye voprosy sovremennosti i poisk reshenij / Sost. L. Vasil'chenko. Tartu, 2004.\nProtasova E. Ju., Rodina N. M. Mnogojazychie v detskom vozraste. SPb., 2007.", "recommended_materials": "Asante, Molefi Kete & Gudykunst, William B. (ed.) 2000. Handbook of international and intercultural communication. Newbury Park: Sage.\nBennett, Milton J. (ed.) 1998. Basic concepts of intercultural communication: selected readings. Yarmouth: Intercultural Press.\nHofstede, Geert & Hofstede, Gert Jan 2005. Cultures and organizations: software of the mind. New York: McGraw-Hill.\nGudykunst, William B. (ed.) 2003. Cross-cultural and intercultural communication. Thousand Oaks: SAGE.\nLewis, Richard Donald 1999, 2003. Kultuuridevahelised erinevused. Kuidas edukalt ületada kultuuribarjääri. Tallinn: TEA Kirjastus.\nNorris, Pippa & Inglehart, Ronald 2009. Cosmopolitan communications: cultural diversity in a globalized world. Cambridge: Cambridge University Press.\nNoorsootöötaja kultuuridevahelises kommunikatsioonis: Parema üksteisemõistmise saavutamine eri kultuuride esindajate suhtluses. Tartu: Mitte-eestlaste Integratsiooni Sihtasutus. 2005.\nPajupuu, Hille 2000. Kuidas kohaneda võõras kultuuris? Tallinn: TEA Kirjastus.\nRannut, Ülle 2004. Uuusimmigrandid meie ühiskonnas ja haridussüsteemis. Astu sisse! Käsiraamat. Tallinn: Ilo Print.\nTrompenaars, Fons & Hampden-Turner, Charles 2012. Riding the waves of culture: understanding diversity in global business. New York: McGraw-Hill.\nTrompenaars, Fons & Woolliams, Peter 2005. Äri ja erinevad kultuurid. Tartu: Fontese Kirjastus.\nValk, Aune (koost.) 2001. Eesti ja eestlased võrdlevas perspektiivis. Kultuuridevahelisi uurimisi 20. sajandi lõpust. Tartu: Tartu Ülikooli Kirjastus.\nLebedeva N. M. Vvedenie v etnicheskuju i kross-kul'turnuju psihologiju: Ucheb. posobie. M., 1999.\nLur'e S. V. Istoricheskaja etnologija: Ucheb. posobie. M., 1997.\nSadohin A. P. Mezhkul'turnaja kommunikacija: Ucheb. posobie. M., 2004.\nSimonova L. M., Strovskij L. E. Kross-kul'turnye vzaimodejstvija v mezhdunarodnom predprinimatel'stve: Ucheb. posobie dlja vuzov. M., 2003.\nStefanenko T. G. Etnopsihologija: Ucheb. dlja vuzov. M., 2004.\nAsser, H. 2003. Varajane ja täielik keeleimmersioon Eesti muukeelse hariduse mudelina. Doktoritöö. Tartu: Tartu Ülikooli kirjastus.\nBanks, J. 1994. An Introduction to Multicultural Education. Boston: Allyn and Bacon.\nBaker, C. 1996. Foundation of bilingual education and bilingualism. Clevedon: Multilingual Matters Ltd, Bath Press.\nBennett, C. 1995. Comprehensive Multicultural Education: Theory and Practice. Boston: Allyn and Bacon.\nEesti ja eestlased võrdlevas perspektiivis. Kultuuridevahelisi uurimisi 20. sajandi lõpust. Tartu, 2002.\nFennes, H., Hapgood, K. 1997. Intercultural learning in the classroom. London: Cassel.\nHeidmets, M. 1997. Mitte-eesti noorte integratsioon Eesti ühiskonda - arengurajad.\nHeidmets, M., Lauristin, M. 1998. Sissejuhatus - mitmekultuurilise Eesti valikud, mitmekultuuriline Eesti. Tartu.\nKallas, Kristina (koost.) 2003. Multikultuursus, integratsioon ja keeleõpe Eestis. Arutelusid ja visioone. Tallinn: Mitte-eestlaste Integratsiooni Sihtasutus, Tallinn: Ilo Print.\nKooli pidaja valikud ja vastused eesti muukeelse kooli arendamisel aastatel 2003-2010: Seminarnõupidamise materjale. Tartu, 2003.\nLynch, J. 1983. The Multicultural Curriculum. London: BAE.\nLäänemets, U. 2002. Multikultuursus ja muukeelse kooli üleminek kakskeelsele õppekavale. Tallinn: Jaan Tõnissoni Instituut.\nMitmekultuuriline kool Eestis: seminariettekannete kogumik. Narva, 2003.\nMitmekultuuriline ühiskond: probleeme ja lahendusi. Tallinn, 1996.\nMultikultuuriline Eesti: väljakutse haridusele. Tartu, 1998.\nNoorsootöötaja kultuuridevahelises kommunikatsioonis: Parema üksteisemõistmise saavutamine eri kultuuride esindajate suhtluses. Tartu, 2005.\nRannut, Ü. 2003. Muukeelsete õpilaste integreerimine Eesti koolis: õpik kõrgkoolile ning muukeelsete  õpilastega töötavale aine- ja klassiõpetajale. Tallinn: Tallinna Pedagoogikaülikooli kirjastus.\nRannut, Ü. 2004. Uusimmigrandid meie ühiskonnas ja haridussüsteemis. Astu sisse! Käsiraamat. Tallinn."}, "participants": {"lecturers": [{"person_uuid": "fff9086b-e0d1-dfa8-dd92-fe5fca81e0b5", "person_name": "Jelena Nõmm", "structural_unit": {"code": "SVNC04", "name": {"en": "Division of Russian Language", "et": "vene keele lektoraat"}, "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVNC", "is_expired": true}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"KELA 1B": {"code": "1", "et": "Lektor", "en": "lecturer"}, "KELA 1A": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "9f9d6eb0-3f13-7de6-43e3-86efd044f919", "person_name": "Lehte Tuuling", "structural_unit": {"code": "SVNC02", "name": {"en": "Division of Psychology and Pedagogy", "et": "psühholoogia ja pedagoogika lektoraat"}, "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVNC", "is_expired": true}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"KELA 1B": {"code": "1", "et": "Lektor", "en": "lecturer"}, "KELA 1A": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "7ed44b77-0497-40f9-636b-55aab875488f", "code": "KELA 1B", "max_size": 45}, {"uuid": "ccb7bfbe-230d-d44c-2e8a-772aa7ba1de6", "code": "KELA 1A", "max_size": 45}]}, "schedule": {"weeks": {}, "entries": [{"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Jelena Nõmm: Sissejuhatus ainekursusesse. 1 t"}, "description": {"et": "Kursuse ülesehitus, õppeaine eesmärgid ja õpiväljundid, seos elu ja pedagoogilise tegevusega. Kodutöö kirjeldus ja soovitused ettevalmistamiseks, nõuded üliõpilastele. "}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Jelena Nõmm: Kultuuridevaheline suhtlemine ja mitmekultuuriline ühiskond. 1 t"}, "description": {"et": "Jelena Nõmm: Mis on kultuur, kultuuri olemus ja roll ühiskonnas. Kultuur ja maailma kultuuride mitmekesisus. Kuidas toimub kultuuriõppimine (inkulturatsioon ja sotsialiseerumine). Etnotsentrism ja kultuuriline relativism. "}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "time": "2024-03-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Jelena Nõmm: Sissejuhatus ainekursusesse. 1 t"}, "description": {"et": "Kursuse ülesehitus, õppeaine eesmärgid ja õpiväljundid, seos elu ja pedagoogilise tegevusega. Kodutöö kirjeldus ja soovitused ettevalmistamiseks, nõuded üliõpilastele. "}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "time": "2024-03-15", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 2, "topic": {"et": "Jelena Nõmm: Kultuuridevaheline suhtlemine ja mitmekultuuriline ühiskond. 1 t"}, "description": {"et": "Mis on kultuur, kultuuri olemus ja roll ühiskonnas. Kultuur ja maailma kultuuride mitmekesisus. Kuidas toimub kultuuriõppimine (inkulturatsioon ja sotsialiseerumine). Etnotsentrism ja kultuuriline relativism. "}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 3, "topic": {"et": "Jelena Nõmm: Kultuuriline ja etniline identiteet. 2 t"}, "description": {"et": "Etnilise identiteedi areng. Mitmekultuurilise ühiskonna ja kultuuridevahelise suhtlemise mõju etnilise identiteedi arengule. Etnilise identiteedi mudelid."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 4, "topic": {"et": "Jelena Nõmm: Kultuur ja kommunikatsioon. 4 t"}, "description": {"et": "Kommunikatiivse tegevuse struktuur. Kultuuridevahelise kommunikatsiooni omapära. Kultuuridevaheline kommunikatsioon kui suhtlemine. Kultuuridevahelise kommunikatsiooni teooriad (E. Hall, G. Hofstede)."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 5, "topic": {"et": "Jelena Nõmm: Kohanemine võõras kultuuris. 2 t"}, "description": {"et": "Akulturatsioon: vormid ja tulemused. Kultuurišokk: põhjused ja tegurid. Kultuurišoki tunnused ja selle ületamise viisid. Reaktsioon teisele kultuurile."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 6, "topic": {"et": "Jelena Nõmm: Kultuuridevahelise kommunikatsiooni liigid. 2 t"}, "description": {"et": " Sõnaline, mittesõnaline ja paraverbaalne suhtlus. Vestlusstiilid."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 7, "topic": {"et": "Jelena Nõmm: Mõistmise probleem kultuuridevahelises sutlemises. 2 t"}, "description": {"et": "Tajumise protsess ja selle põhilised determinandid. Kultuur ja tajumine. Inimestevaheline atraktiivsus kultuuridevahelises suhtlemises. Atributsioon (käitumise tõlgendamine) ja selle roll kultuuridevahelises kommunikatsioonis."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 8, "topic": {"et": "Jelena Nõmm: Stereotüübid ja eelarvamused kultuuridevahelises kommunikatsioonis. 2 t"}, "description": {"et": "Stereotüübi mõiste ja sisu. Stereotüüpide tekkimine ja nende funktsioonid. Stereotüüpide tähtsus kultuuridevahelises kommunikatsioonis. Eelarvamused ja nende tekkimise mehhanism. Eelarvamuste korrigeerimine ja muutmine."}}, {"course_week": 1, "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 9, "topic": {"et": "Jelena Nõmm: Kultuuridevahelised konfliktid. 2 t"}, "description": {"et": "Kultuuridevaheliste konfliktide omapära, nende tekkimise põhjused ja reguleerimise viisid. Multikultuurilise hariduse roll kultuuridevaheliste ja rahvusvaheliste konfliktide vältimisel."}}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 10, "topic": {"et": "Jelena Nõmm: Perekonna kultuur. 2 t"}, "description": {}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 10, "topic": {"et": "Jelena Nõmm: Perekonna kultuur. 2 t"}, "description": {}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 11, "topic": {"et": "Jelena Nõmm: Kultuuridevaheliste erinevuste psühholoogia. 2 t"}, "description": {"et": "\"Võõra\" ja \"oma\" tajumine teiste kultuuride esindajate kontaktides."}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 11, "topic": {"et": "Jelena Nõmm: Kultuuridevaheliste erinevuste psühholoogia. 2 t"}, "description": {"et": "\"Võõra\" ja \"oma\" tajumine teiste kultuuride esindajate kontaktides."}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 12, "topic": {"et": "Jelena Nõmm: Akulturatsioon Eesti ühiskonnas. 2 t"}, "description": {}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 12, "topic": {"et": "Jelena Nõmm: Akulturatsioon Eesti ühiskonnas. 2 t"}, "description": {}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 13, "topic": {"et": "Jelena Nõmm: Stereotüübid ja eelarvamused kultuuridevahelises kommunikatsioonis. 2 t"}, "description": {}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 13, "topic": {"et": "Jelena Nõmm: Stereotüübid ja eelarvamused kultuuridevahelises kommunikatsioonis. 2 t"}, "description": {}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 14, "topic": {"et": "Jelena Nõmm: Kultuuridevahelised konfliktid. 2 t"}, "description": {}, "study_group_codes": ["KELA 1B"]}, {"course_week": 1, "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 14, "topic": {"et": "Jelena Nõmm: Kultuuridevahelised konfliktid. 2 t"}, "description": {}, "study_group_codes": ["KELA 1A"]}, {"course_week": 1, "time": "2024-03-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 A Lehte Tuuling 4t Rahvaste kultuurilised ja etnilised erinevused, nende tundma õppimine"}}, {"course_week": 1, "time": "2024-04-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 A  Tuuling 4t Levinumad usundid ja nende eripäradega arvestamine õppe- ja kasvatustegevuses."}}, {"course_week": 1, "time": "2024-04-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 A  Tuuling 4t Väärtuskasvatus mitmekultuurilises õppekeskkonnas"}}, {"course_week": 1, "time": "2024-04-20", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 A  Tuuling Mitmekultuuriline haridus. Tutvuge teemakohaste materjalidega slaidiesitluses ja läbi MOOC-i kursuse. Kursuse leiad aadressil https://sisu.ut.ee/multilingual/avaleht \nTee läbi üks nädal MOOC-i kurusel Week 4: Early Childhood Multilingualism. Loe läbi  kõik  osa tekstid, vaata üle videod ja vasta küsimustele.\nLugege läbi artikkel Kallas, K. & Küün, E. (2019). Diskussioon kakskeelsest haridusest: teadusuuringud ja Eesti mudel. Riigikogu Toimetised, 40\nOtseviide artiklile: https://rito.riigikogu.ee/nr-40/diskussioon-kakskeelsest-haridusest-teadusuuringud-ja-eesti-mudel/"}}, {"course_week": 1, "time": "2024-05-04", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 A  Tuuling 4t Lapse lõimumist toetava keskkonna loomine mitmekeelses õppekeskkonnas"}}, {"course_week": 1, "time": "2024-04-07", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 B Lehte Tuuling 4t Rahvaste kultuurilised ja etnilised erinevused, nende tundma õppimine"}}, {"course_week": 1, "time": "2024-04-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 B  Tuuling 4t Levinumad usundid ja nende eripäradega arvestamine õppe- ja kasvatustegevuses."}}, {"course_week": 1, "time": "2024-05-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 B  Tuuling 4t Väärtuskasvatus mitmekultuurilises õppekeskkonnas"}}, {"course_week": 1, "time": "2024-05-05", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 B  Tuuling Mitmekultuuriline haridus. Tutvuge teemakohaste materjalidega slaidiesitluses ja läbi MOOC-i kursuse. Kursuse leiad aadressil https://sisu.ut.ee/multilingual/avaleht \nTee läbi üks nädal MOOC-i kurusel Week 4: Early Childhood Multilingualism. Loe läbi  kõik  osa tekstid, vaata üle videod ja vasta küsimustele.\nLugege läbi artikkel Kallas, K. & Küün, E. (2019). Diskussioon kakskeelsest haridusest: teadusuuringud ja Eesti mudel. Riigikogu Toimetised, 40\nOtseviide artiklile: https://rito.riigikogu.ee/nr-40/diskussioon-kakskeelsest-haridusest-teadusuuringud-ja-eesti-mudel/"}}, {"course_week": 1, "time": "2024-05-31", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "KELA 1 B  Tuuling 4t  Lapse lõimumist toetava keskkonna loomine mitmekeelses õppekeskkonnas"}}]}, "registration_info": {"audience": {"et": "KELA 1 SÕ"}, "min_students": 16, "max_students": 90}, "parent_uuid": "3fe28938-e7da-63a5-62fe-b20aad4c1c64", "parent_code": "SVNC.00.048", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}