{"uuid": "1c0950d0-fb68-55af-5e5c-f97431dd32ac", "code": "SVNC.00.173", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Creativity and Innovation, Social Entrepreneurship", "et": "Loome- ja innovatsioonivõimekus, sotsiaalne ettevõtlus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Development of skills essential for creativity and initiative  power, and introduction of  the fundamentals of social entrepreneurship.", "et": "Käsitletakse sotsiaalse innovatsiooni ja sotsiaalse ettevõtlusega seonduvaid põhimõisteid ja protsesse, selgitades ja uurides nende olemust. Tutvutakse sotsiaalse innovatsiooni ja ettevõtluse näidetega Eestis ja välisriikides. Käsitletakse loome- ja innovatsioonitegevusteks ja sotsiaalseks ettevõtluseks vajalikke teadmisi, oskusi ja hoiakuid ning rakendatakse neid loovalt ühe noorte ja/või noortevaldkonna võtmeprobleemi lahendusidee välja töötamisel. Kursuse lõpus analüüsivad üliõpilased oma praktilise töö käigus omandatud õpikogemusi."}, "objectives": [{"en": "The student evaluates systematic support and development of youth creativity and initiative in the youth field and has basic knowledge of the fundamentals of social entrepreneurship.", "et": "Tutvustada sotsiaalse innovatsiooni ja sotsiaalse ettevõtluse põhialuseid ja näiteid ning aidata üliõpilastel arendada oma pädevusi ja võimekust sotsiaalseks ettevõtluseks ning loome- ja innovatsioonialgatusteks noortevaldkonnas."}], "learning_outcomes": [{"en": "The student: \n- understands approaches to developing young people's creativity and innovation;\n- understands the use of creative activities as a method for working with young people; \n- values the attitudes needed for creative and innovation activities and their support for their development; \n- plans activities to develop the creative and innovative capacity of young people; t\n- understands the approaches of design thinking and co-creation; \n- analyses the use of design thinking and collaborative approaches in work; \n- explains the nature and content of social entrepreneurship; \n- plans the activities of a social enterprise.", "et": "Üliõpilane: \n- mõistab sotsiaalse innovatsiooni ja sotsiaalse ettevõtluse põhimõisteid ning võrdleb Eesti lähenemisi teiste riikidega; \n- arendab sotsiaalseks innovatsiooniks ja ettevõtluseks vajalikke pädevusi;\n- rakendab probleemi defineerimise, ideeloome, arendamise ja hindamise meetodeid; \n- seostab teoreetilisi teadmisi sotsiaalsest innovatsioonist ja sotsiaalsest ettevõtlusest praktikaga ning loob noortevaldkonna võtmeprobleemidele vajalikke lahendusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}