{"uuid": "75472724-f2f9-eedf-352c-f6b162e9f706", "code": "SVNC.00.147", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methodology of Teaching Russian as a Foreign Language", "et": "Vene keele kui võõrkeele õpetamise metoodika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course deals with the basic concepts of teaching Russian as a foreign language: psychological, linguistic and sociolinguistic bases of teaching Russian as a Foreign Language. An overview is given of different aspects of teaching Russian as a foreign language (phonetics, grammar, vocabulary, etc.), teaching of speaking.", "et": "Kursuses vaadeldakse vene keele võõrkeelena õpetamise metoodika põhimõisteid; Vene keele võõrkeelena (VKV) õpetamise psühholoogilisi, lingvistilisi ja sotsiolingvistilisi aluseid. Esitatakse ülevaade vene keele võõrkeelena õpetamise aspektidest (foneetika, grammatika, leksika jne), rääkimise õpetamisest."}, "objectives": [{"en": "To develop professional competence in teaching Russian as a foreign language (RFL). Tasks of the course:", "et": "Kujundada professionaalne kompetentsus vene keele võõrkeelena õpetamise alal. Kursuse ülesanded:"}, {"en": "1) to create a scientific-methodological basis for students;", "et": "1) luua üliõpilastele teaduslik-metoodiline baas;"}, {"en": "2) to develop the professional and methodological skills of future RFL teachers (determining the specific methodological purpose and content of the lesson, evaluating the choice and amount of linguistic material, identifying appropriate methods for semantizing lexis, introducing new grammatical material, pronouncing work, etc.);", "et": "2) kujundada tulevaste VKV õpetajate professionaalsed ja metoodilised oskused (õppetunni konkreetse metoodilise eesmärgi ja sisu määramine, keelelise materjali valiku ja doseerimise hindamine, leksika semantiseerimise otstarbekate meetodite väljaselgitamine, uue grammatilise materjali sisseviimine, töö hääldamisega jm);"}, {"en": "3) to cultivate the habit of working independently with scientific-methodological literature.", "et": "3) kasvatada harjumust iseseisvalt töötada teaduslik-metoodilise kirjandusega."}], "learning_outcomes": [{"en": "Upon completion of the course, the student:\n1) knows the methodology terminology of teaching Russian as a foreign language;\n2) knows the peculiarities of different stages of teaching Russian as a foreign language;\n3) knows the structure and content of the national curriculum as a foreign language for the syllabus;\n4) is familiar with modern textbooks of Russian as a foreign language;\n5) is able to choose the most suitable ones in order to fulfill the learning objectives, justifies his / her choice and is able to make his/her own didactic material;\n6) is able to target lessons and choose the optimal structure according to the goal and content;\n7) is able to select and evaluate linguistic material needed for the lesson and analyze its severity from the perspective of the learners (considering their first language);\n8) knows a variety of methods and techniques that can be used to teach speaking skills and other aspects of language;\n9) is able to choose appropriate methods and justify his / her choices;\n10) Is familiar with school documentation and can execute it (plans, lesson plans, etc.);\n11) knows the methodological basis of language testing (procedure of writing tests, forms of test tasks, criteria of test quality, evaluation of test results, etc.);\n12) knows the principles of organizing the testing process;\n13) is able to prepare tests for intermediate language tests.", "et": "1) valdab vene keele võõrkeelena õpetamise metoodika-alast terminoloogiat;\n2) teab, millised eripärad on vene keele kui võõrkeele õpetamise eri etappidel;\n3) tunneb riikliku õppekava struktuuri ja sisu vene keel võõrkeelena ainekava osas;\n4) orienteerub tänapäevastes vene keele kui võõrkeele õpikutes;\n5) oskab valida neist sobivamaid, selleks et täita õpieesmärke, põhjendab oma valikut ja oskab valmistada didaktilist materjali;\n6) oskab tunde eesmärgistada ja valida eesmärgist ning sisust lähtuvalt optimaalse struktuuri;\n7) oskab valida ja hinnata tunniks vajalikku keelelist materjali ning analüüsida selle raskusastet õppijate vaatevinklist (nende esimest keelt arvesse võttes);\n8) teab mitmekesiseid meetodeid ja võtteid, mida kasutada kõnelemisoskuse ning keele muude aspektide õpetamisel;\n9) oskab valida sobivaid võtteid ning oma valikuid põhjendada;\n10) tunneb koolidokumentatsiooni ja oskab seda täita (plaanid, tunnikavad, jne);\n11) teab keeledidaktilise testimise metodoloogilist baasi (testide koostamise protseduuri, testimise ülesannete vorme, testide kvaliteedi kriteeriume, testide tulemuste hindamist jm);\n12) teab testimisprotsessi korraldamise põhimõtteid;\n13) oskab koostada teste keele osaoskuste vahekontrolliks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}