{"uuid": "e9400495-0c78-d97b-a0dd-6a17eedaf524", "code": "SVNC.00.215", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-08-21T11:10:56", "title": {"en": "Training in Russian Language Teaching", "et": "Vene keele õpetamise praktika"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The teaching practice supports a student's professional development, creating possibilities for establishing permanent connections between the university studies of the speciality and the subject didactics and the teaching activity in an educational institution. With the help of continuous reflection, the subject creates students the possibility to analyze and thus adequately assess their knowledge, skills and attitudes as well as their needs for self-development on the topics of speciality and professional competences and subject didactics. During the teaching practice students learn to compose the working plan and to plan their teaching (different methods and forms), to exchange subject-related knowledge by using study aids. Students learn to support learners' development and analyze their experiences.", "et": "Praktika toetab üliõpilase professionaalset arengut, luues võimalusi seostada valdkonna- ja ainedidaktikaga seotud ülikooliõpingud pidevalt õpetaja tegevusega õppeasutuses. Ainekursus loob läbi pideva refleksiooni võimaluse analüüsida ja seeläbi adekvaatselt hinnata oma teadmisi, oskusi ja hoiakuid ning vajadusi enese arendamiseks valdkonna- ja erialaspetsiifiliste kompetentside ja didaktika teemal. Praktika käigus õpitakse koostama töökava ja planeerima õpet (erinevad meetodid ja vormid), vahendama ainealaseid teadmisi, kasutades õppevahendeid. Õpitakse toetama õpilase arengut ja analüüsima kogetut."}, "objectives": [{"en": "To develop and consolidate the competences which are necessary for the teacher's work and to create possibilities for connecting the theoretical knowledge necessary for a teacher with the practical teacher's work.", "et": "Kujundada ja kinnistada õpetaja tööks vajalikke kompetentse ning luua võimalused õpetajale vajalike teoreetiliste teadmiste seostamiseks praktilise õpetajatööga."}], "learning_outcomes": [{"en": "Upon completion of the module a student: ", "et": "Praktika läbinud üliõpilane:  "}, {"en": "1) effectively applies the knowledge, skills, and attitudes which he/she acquired in different core competences and didactical subjects during the pedagogical practice; ", "et": "1) rakendab õpetamise praktikas tulemuslikult erinevates eriala- ja didaktikaainetes omandatud teadmisi, oskusi ja hoiakuid; "}, {"en": "2) plans his/her teaching in a systematic, research-based, and creative way, taking into consideration each learner's peculiarity (including the age, language and cultural background, the level of the Russian language proficiency);", "et": "2) kavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, arvestades iga õppija eripära (sh vanus, keele- ja kultuuritaust, vene keele valdamise tase);"}, {"en": "3) plans the study process which supports development of teamwork skills;", "et": "3) kavandab õppeprotsessi, mis toetab meeskonnatöö oskuse arendamist;"}, {"en": "4) plans, conducts, reflects on and evaluates his/her activities in the area of teaching and education taking into consideration the requirements of the modern didactics and methodology.", "et": "4) kavandab, viib läbi, reflekteerib ning hindab oma õppe- ja kasvatustööalaseid tegevusi, pidades silmas kaasaegse didaktika ja metoodika nõudeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}