{"uuid": "444b8b1c-26b5-d35e-692f-5b5e4d045e3a", "code": "SVNC.00.123", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History and Variants of the English Language", "et": "Inglise keele ajalugu ja variandid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course examines the historical development and change of English, Old, Middle and New English texts are read and analyzed;an overview of the main variants of English in the world, the spread and the future of English is given.", "et": "Kursuses vaadeldakse inglise keele ajaloolist arengut ja muutumist, loetakse ja analüüsitakse vana-, kesk- ja uusinglise tekste; antakse ülevaade inglise keele põhivariantidest maailmas, inglise keele levikust ja tulevikust"}, "objectives": [{"en": "To introduce the main features of the development of English at different stages of history and the variants of English used in the world and their features.", "et": "Tutvustada inglise keele arengu põhijooni erinevates ajaloo etappides ja maailmas kasutatavaid inglise keele variante ja nende iseärasusi."}], "learning_outcomes": [{"en": "1) knows the basic stages of development of the English language and the language changes that have taken place in them;", "et": "1) teab põhilisi inglise keele arenguetappe ja nendes toimunud keelemuutusi;"}, {"en": "2) can name and explain the reasons for the development of the English language and its connection with historical events;", "et": "2) oskab nimetada ja seletada inglise keele arengu põhjusi ja seost ajalooliste sündmustega;"}, {"en": "3) knows and is able to name linguistic features and forms from different stages of development (Old, Middle and New English);", "et": "3) teab ja oskab nimetada keelelisi erijooni ja vorme erinevatest arenguetappidest (vana-, kesk- ja uus inglise periood);"}, {"en": "4) can distinguish and read texts from different stages of development (Old, Middle and New English).", "et": "4) oskab eristada ja lugeda tekste erinevatest arenguetappidest (vana-, kesk- ja uus inglise periood)."}, {"en": "5) be aware of the English language variants used in the world and their peculiarities;", "et": "5) on teadlik maailmas kasutatavatest inglise keele variantidest ja nende iseärasustest;"}, {"en": "6) can distinguish between different English language variants", "et": "6) oskab eristada erinevaid inglise keele variante"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}