{"uuid": "54b2d15d-75de-0619-e25e-65d88e67364a", "code": "SVNC.00.207", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Russian Literature in the Studies of Russian as a Foreign Language", "et": "Vene kirjandus vene keele võõrkeelena õpetamise protsessis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVNC", "structural_unit_name": {"en": "Narva College", "et": "Narva kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVNC", "name": {"en": "Narva College", "et": "Narva kolledž"}, "email": "college@narva.ut.ee", "phone": "+372 740 1900", "webpage_url": "https://narva.ut.ee", "address": "Raekoja plats 2\n20307 Narva linn, \nIda-Virumaa \nEST", "city": "Narva linn", "street": "Raekoja plats 2", "zip": "20307", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Aines vaadeldakse ilukirjandusteoste keelt kui rahva materiaalse ja vaimse elu rahvuslike vormide kandjat. Analüüsitakse XIX-XX saj vene kirjanduse tähtsamaid teoseid. Kursus annab ülevaate ilukirjanduslike tekstide valimise kriteeriumidest ja tänapäevastest metoodilistest lähenemistest tekstiga töötamiseks.", "et": "Aines vaadeldakse ilukirjandusteoste keelt kui rahva materiaalse ja vaimse elu rahvuslike vormide kandjat. Analüüsitakse XIX-XX saj vene kirjanduse tähtsamaid teoseid. Kursus annab ülevaate ilukirjanduslike tekstide valimise kriteeriumidest ja tänapäevastest metoodilistest lähenemistest tekstiga töötamiseks."}, "objectives": [{"en": "To provide insight into development of the Russian fiction language; ", "et": "Anda ettekujutus vene ilukirjandusliku keele arengust;"}, {"en": "to teach students to understand works of fiction of the previous epoch and the reality and ideas expressed in the language; ", "et": "õpetada mõistma möödunud epohhi ilukirjandusteoseid ja keeles väljendunud reaalsust ja ideid;"}, {"en": "to teach students the methodology of fiction text analysis of different genres; ", "et": "õpetada erinevas žanris ilukirjandusliku teksti analüüsi metoodikat;"}, {"en": "to provide students with necessary methodological knowledge, to introduce the criteria of choosing and adapting of texts as well as the system of exercises for working with a text in teaching Russian as a foreign language;  ", "et": "anda vajalikke metoodikaalaseid teadmisi, tutvustada tekstide valimise ja kohandamise kriteeriume, tekstiga töötamise harjutuste süsteemi vene keele võõrkeelena õpetamises; "}, {"en": "to develop students' skill to choose fiction texts and work with them aiming at the development of bilingual students' speaking and reading competence.", "et": "kujundada oskust valida ilukirjanduslikke tekste ning töötada nendega kakskeelsete õppijate kõne ja lugejapädevuse arengu eesmärgil."}], "learning_outcomes": [{"en": "Upon completion of the subject a teacher:", "et": "Aine läbinud üliõpilane:"}, {"en": "1) knows the history of the Russian literature;", "et": "1) teab vene kirjanduse ajalugu;"}, {"en": "2) analyzes the vocabulary and language of works of fiction from the point of view of enrichment and development of the speech for foreign and bilingual students;", "et": "2) analüüsib ilukirjanduslike teoste sõnavara ja keelt võõrkeelsete õpilaste ja kakskeelsete õpilaste kõne rikastamise ja arengu võimaluste vaatenurgast;"}, {"en": "3) chooses and adapts texts for teaching Russian as a foreign language, chooses such texts from among those belonging to quality literature which can be used to explain the Russian culture to bilingual learners;", "et": "3) valib ja kohandab tekste vene keele võõrkeelena õpetamiseks, valib väärtkirjanduse hulka kuuluvaid tekste  kakskeelsetele õppijatele vene kultuuri selgitamiseks;"}, {"en": "4) knows modern approaches to working with text and develops complex tasks for a reading lesson for foreign and bilingual learners.", "et": "4) tunneb tänapäevaseid metoodilisi  lähenemisi tekstiga töötamiseks ja loob kompleksülesandeid lugemistunniks kursusel muukeelsetele ja kakskeelsetele õppuritele."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}