{"uuid": "c6ddb8e4-1d51-717e-a33e-ef538ab47900", "code": "SVOI.00.003", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Methodology of Law", "et": "Õigusteaduse metodoloogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVOI", "structural_unit_name": {"en": "School of Law", "et": "õigusteaduskond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVOI", "name": {"en": "School of Law", "et": "õigusteaduskond"}, "email": "oi@ut.ee", "phone": "+372 737 5390", "webpage_url": "https://oigus.ut.ee", "address": "Näituse 20 - 324\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 20 - 324", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "In this lecture course, the main trends in the methodology of legal research, their historical context and current problems are discussed in depth. In the seminars, doctoral students' research projects are discussed.", "et": "Õppeaines käsitletakse süvendatult õigusteadusliku uurimise metodoloogia ja juriidilise meetodiõpetuse põhilisi suundumusi, nende ajaloolist konteksti ja aktuaalseid probleeme. Seminarides toimub doktorantide uurimisprojektide diskuteerimine."}, "objectives": [{"en": "Gaining experience in presentation, opposition, moderation and discussion; developing the methodological knowledge and skills needed to design and compile a scientific article or chapter of a monograph with legal content.", "et": "Ettekande-, oponeerimis-, modereerimis- ja diskussioonikogemuse omandamine; õigusteadusliku sisuga teadusartikli või monograafia osa kavandamiseks ja koostamiseks vajalike metodoloogiliste teadmiste ning oskuste arendamine."}], "learning_outcomes": [{"en": "After completing the course, the doctoral student: knows the different directions of the methodology of legal research, as well as their historical context; is aware of the possibilities of different methodological approaches; is able to critically evaluate and apply methods suitable for legal research; is able to critically evaluate the application of legal methods.", "et": "Kursuse läbinud doktorant: tunneb õigusteadusliku uurimise metodoloogia ja juriidilise meetodiõpetuse erinevaid suundi, samuti nende ajaloolist konteksti; teadvustab erinevate metodoloogiliste lähenemisviiside võimalusi; oskab kriitiliselt hinnata ja rakendada õigusteaduslikuks teadustööks sobivaid meetodeid; oskab kriitiliselt hinnata õiguslike ja õigusteaduslike meetodite rakendamist."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}