{"uuid": "07f1d7b6-6b92-bc71-e274-a0202358927c", "code": "SVPC.00.057", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T11:36:30", "title": {"en": "Academic Estonian and Basics of Research", "et": "Akadeemiline eesti keel ja teadustöö alused"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides practical skills for planning and presenting academic research, improves the learners' skills of using academic literature and databases, improves the learners' knowledge of orthography, and oral and written presentation skills.", "et": "Õppeaine raames antakse praktilised oskused uurimistöö planeerimiseks ja esitlemiseks, kinnistatakse teaduskirjanduse ja andmebaaside kasutamise oskusi, süvendatakse teadmisi eesti õigekeelsusest ning arendatakse suulist ja kirjalikku väljendusoskust."}, "objectives": [{"en": "The course expands the knowledge about Estonian ortography, oral and written skills of presentation, and the skills of writing different types of texts. The learner will acquire basic knowledge, terminology and practical skills to plan research and write it according to requirements. The learners explore the principles of the philosophy of science, research methods and work with academic literature and databases.", "et": "Kursusel kinnistatakse ja süvendatakse teadmisi eesti õigekeelsusest, arendatakse suulist ja kirjalikku väljendusoskust, süvendatakse oskusi tarbetekstide ja teadusliku kirjutamise osas. Õpetusega taotletakse, et õppija omandab põhiteadmised, -sõnavara ning praktilised oskused uurimistöö sisuliseks planeerimiseks ja selle korrektseks ning nõuetekohaseks vormistamiseks. Õpitakse tundma erinevaid teadusfilosoofia algtõdesid, teadustööks vajalikke uurimismeetodeid ning tööd teaduskirjanduse ja andmebaasidega."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) compile texts proceeding from the process-based principles of writing, use proper references and citations;", "et": "1) järgib tekste luues protsessikeskse tekstiloome põhimõtteid, refereerib ja tsiteerib nõuetekohaselt ning kasutab tarbetekste luues või parandades keelehooldeallikaid;"}, {"en": "2) assess their use of language critically and correct it, if necessary;", "et": "2) hindab kriitiliselt oma keelekasutust ja vajadusel korrigeerib seda;"}, {"en": "3) compile academic texts and follow the principles of public speaking;", "et": "3) koostab akadeemiliselt korrektset teksti ja järgib avaliku esinemise põhimõtteid;"}, {"en": "4) be aware of the principles of the philosophy and ethics of research;", "et": "4) teab teadusfilosoofia ja teaduseetika algtõdesid;"}, {"en": "5) know research methods, the methods of data collection, and data analysis;", "et": "5) teab uurimistöös kasutatavate uurimismeetodite rakendamisvõimalusi;"}, {"en": "6) compile a research plan and present their research findings according to the requirements.", "et": "6) planeerib uurimistööd ja vormistab ning esitleb seda nõuetekohaselt."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}