{"uuid": "c6e000d4-6fab-96ec-29b6-ed4f65bd8932", "code": "SVPC.00.077", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-24T11:26:44", "title": {"en": "Practical Social Media Marketing on Facebook, Instagram, and Google", "et": "Praktiline sotsiaalmeedia turundus Facebookis, Instagramis ja Google'is"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course covers how to set up advertisements in various social media environments (Facebook, Instagram, Google). Students will learn how to create a comprehensive social media campaign, what a call-to-action is, and how Facebook Pixel helps in targeting warm audiences with advertisements.", "et": "Õppeaines vaadeldakse, kuidas seadistada erinevates sotsiaalmeedia keskkondades (Facebook, Instagram, Google) reklaame. Õppeaines saadakse teada, kuidas luua terviklikku sotsiaalmeedia kampaaniat, mis on call-to-action ja kuidas aitab Facebook Pixel teha sihtrühmale suunatud reklaame."}, "objectives": [{"en": "The aim of the course is to provide practical knowledge for creating advertisements on social media channels (Facebook, Instagram, Google). Additionally, learners will gain knowledge on creating organic content in these channels, including the type and format of the content.", "et": "Õppeaine eesmärk on anda praktilised teadmised sotsiaalmeediakanalites (Facebook, Instagram, Google) reklaamide tegemiseks. Lisaks omandab õppija teadmised, millist tüüpi ja millises formaadis sisu nendes kanalites luua."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands how to set up advertisements on Facebook, Instagram and Google;", "et": "1) teab, kuidas käib reklaamide seadistamine Facebookis, Instagramis ja Google'is;"}, {"en": "2) comprehend the possibilities of implementing different platforms in their company's social media marketing; ", "et": "2) mõistab erinevate keskkondade rakendamise võimalusi enda ettevõtte sotisaalmeedia turunduses;"}, {"en": "3) grasp the principles of social media marketing and apply them in their work;", "et": "3) mõistab sotsiaalmeedia turunduse põhimõtteid ning rakendab neid oma töös;"}, {"en": "4) utilises social media platforms as marketing tools, organise various campaigns, and create quality content on appropriate channels.", "et": "4) rakendab sotsiaalmeedia platvorme turundusvahenditena, korraldavad erinevaid kampaaniaid ja loob kvaliteetset sisu sobivas kanalis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}