{"uuid": "c70b3a07-aea6-70e6-bbe2-1e5691c699a1", "code": "SVPC.00.052", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T14:19:06", "title": {"en": "Basics of Digital Competences", "et": "Digipädevuste alused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The principles of digital literacy and basic knowledge of digital competences according to the DigiComp framework. Introduction of various digital tools for information management, communication, content creation, safety and problem solving. Overview of digitalisation and software used for business management and other processes in organizations and companies.", "et": "Kaasaegse ühiskonna digitaalse kirjaoskuse põhialused ja digipädevuste põhimõtted vastavalt viiele alagrupile rahvusvahelisest raamistikust DigComp. Erinevate digitaalsete töövahendite tutvustamine infohalduse, kommunikatsiooni, sisuloome, turvalisuse ja probleemilahenduste jaoks. Organisatsioonide juhtimises ja põhiprotsessides kasutatavate digilahenduste ülevaade."}, "objectives": [{"en": "To acquire digital competences on basic user level according to DigComp framework. To get an overview of the digitalization processes of an organzisation and the activities of a digital manager.", "et": "Omandada baastasemel digipädevused vastavalt rahvusvahelisele raamistikule DigComp ning saada ülevaade organisatsiooni digitaliseerumise protsessidest ja digijuhi tegevustest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the content of 21 digital competences and the need for self-improvement;", "et": "1) teab 21 digipädevuse (5 grupi, DigComp) sisu, mõistab enda digipädevuste õpivajadusi, otsib enda oskustele vajalikke õppematerjale või abi ning planeerib edasist õpet digipädevuste valdkonnas;"}, {"en": "2) is able to find and use reliable information and save it in different file formats (music, image, video, web page);", "et": "2) oskab leida ja valida usaldusväärset infot ning seda (erinevates formaatides - pilt, muusika, video, tekst, veebilehed) kasutada ja salvestada - info haldamine;"}, {"en": "3) is able to use different digital tools to communicate, cooperate and share information;", "et": "3) oskab infot jagada, suhelda järgides netiketti,  teha koostööd, olla aktiivne/kaasatud ühiskonnaelu tegevustes ja juhib enda digitaalset identiteeti - suhtlemine digikeskkondades;"}, {"en": "4) is able to create digital content in various formats and knows the principles of intellectual property;", "et": "4) oskab luua erinevates formaatides lihtsamat sisu, teab intellektuaalse omandi põhimõtteid - sisuloome vahendid;"}, {"en": "5) is aware of digital identity and protecting private information, knows the ways to save energy and is aware of effects of using technology to one's personal health;", "et": "5) teab isikuandmete, seadmete, tervise ja keskkonna kaitsmise põhimõtteid - infoturvalisus laiemalt;"}, {"en": "6) is able to find support and assistance in the case of different technical problems, uses digital tools to solve problems;", "et": "6) otsib tehnilistele probleemidele lahendusi kasutades selleks probleemilahenduse tehnikaid või tehnoloogiat - probleemilahendus;"}, {"en": "7) understands the principles of AI training;", "et": "7) mõistab tehisintellekti treenimise põhimõtteid;"}, {"en": "8) can choose AI powered suitable software for his/her needs.", "et": "8) oskab valida sobiva tehisintellekti abil töötava tarkvara."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}