{"uuid": "34e37abc-2981-7e63-820d-24326e66b178", "code": "SVPC.01.045", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T14:42:57", "title": {"en": "Marketing and Sales Management", "et": "Turunduse- ja müügijuhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Marketing. Marketing management. Specifics of product marketing and service marketing. Creating and developing a service culture based on a customer-centric mindset. Well-known methods for controlling, measuring and evaluating the quality of services. \nProduct and service and their price in marketing. Promotional and public relations marketing. Marketing strategies. Sales process and its organization. Sales techniques at different sales stages, sales negotiations. \nSales. Sales management. Customer relations. Sales strategies and sales planning.", "et": "Turundus. Turunduse juhtimine. Toote turunduse ja teenuste turunduse eripära. Kliendikesksele mõttelaadile tugineva teeninduskultuuri loomine ja arendamine. Teenuste kvaliteedi kontrollimise, mõõtmise ja hindamise tuntumad meetodid. \nToode ja teenus ning nende hind turunduses. Edustustegevus ja suhteturundus. Turundusstarteegiad. Müügiprotsess ja selle organiseerimine. Müügitehnikad erinevatel müügietappidel, müügi läbirääkimised. \nMüük. Müügi juhtimine. Kliendisuhted. Müügistrateegiad ja müügi planeerimine."}, "objectives": [{"en": "The aim of the course is to understand the basic principles and nature of marketing and sales management in order to understand their interrelationships and role in organizational sustainability.", "et": "Õppeaine eesmärk on mõista turunduse ja müügi juhtimise põhiprintsiipe ja olemust mõistmaks nende omavahelisi seoseid ja rolli organisatsiooni jätkusuutlikkusele."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija: "}, {"en": "1) know the nature of the basic concepts of marketing and sales management and their interrelation;", "et": "1) teab turunduse ja müügi juhtimise põhimõistete olemust ning omavahelist seost;"}, {"en": "2) know the basic concepts of service development and marketing;", "et": "2) teab teenuste arenduse ja turunduse põhikontseptsioone;"}, {"en": "3) know the connections of marketing and sales management with other areas of a company's activities;", "et": "3) teab turunduse ja müügijuhtimise seoseid teiste ettevõtte tegevusvaldkondadega;"}, {"en": "4) know the nature of the sales process and the main sales techniques;", "et": "4) teab müügiprotsessi olemust ja põhilisi müügitehnikaid;"}, {"en": "5) be able to plan and analyze a company's marketing processes;", "et": "5) oskab planeerida ettevõtte turunduse protsesse ja neid analüüsida;"}, {"en": "6) be able to highlight the role of marketing in the successful operation and development of a company;", "et": "6) oskab esile tuua turunduse rolli ettevõtte edukas tegevuses ja arengus;"}, {"en": "7) be able to implement various representation activities;", "et": "7) oskab rakendada erinevaid edustustegevusi; "}, {"en": "8) be able to organize a company's sales activities.", "et": "8) oskab korraldada ettevõtte müügitegevust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}