{"uuid": "49a008ae-1d38-2ec2-80c8-2cb80732ac6d", "code": "SVPC.03.004", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T12:08:32", "title": {"en": "Methods of Client-Work", "et": "Klienditöö meetodid"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "5f7417d9-a596-c0f7-f503-3f61aad38ce3", "code": "SVPC.03.001", "title": {"en": "Introduction to Social Work", "et": "Sissejuhatus sotsiaaltöösse"}, "credits": 5, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-09T17:28:39"}]}, "overview": {"description": {"en": "The course is designed to develop conceptual understanding of client-work methods in social work and basic skills in direct client work in social work. \nSubjects treated: \n1. Frame of reference and basic concepts of working with clients and systems (bio-psychosocial approach, systems theory and systems in social work according to Pincus and Minahani, coping and its preconditions according to Wiman, model of change according to Prochaska and DiClemente). \n2. Process and basic principles of client work. \n3. Levels and methods of intervention in social work. \n4. Risk assessment and risk management in social work. \n5. Burn-out syndrome and methods of its prevention.", "et": "Inimeste ja süsteemidega töötamiseks vajalikud baasteadmised sotsiaaltöös ja rehabilitatsioonis. Praktilised harjutused järgmistes valdkondades: kontakti loomine kliendiga, lähteinfo kogumine kliendi ja tema keskkonna kohta, kliendi hindamine, kliendi probleemide analüüs, muutuse ettevalmistamine ning kliendi toetamine muutuse protsessis, eneserefleksioon.\nKäsitletakse järgmisi teemasid:\n1. Klienditöö taustsüsteem ja põhimõisted (süsteemiteooria ja süsteemid sotsiaaltöös Pincus ja Minahani alusel, biopsühhosotsiaalne lähenemine, toimetulek ja selle eeltingimused, muutuse olemus ja etapid Prochaska ja DiClemente alusel). \n2. Klienditöö protsess ja põhiprintsiibid. \n3. Sekkumise tasemed ja viisid sotsiaaltöös.\n4. Andmete kogumine. Probleemianalüüsi teostamine. Töökokkuleppe sõlmimine. Eesmärgistamine. Töö vastupanuga. Kliendi tugevuste esiletoomine. Riskihindamine ja juhtimine sotsiaaltöös ja rehabilitatsioonis. \n5. Läbipõlemissündroom ja selle ennetamise viisid."}, "objectives": [{"en": "The course is designed to develop conceptual understanding in social work process using ecological and problem-solving models as approaches for analysis. Course enables to put into practice core skills in following areas: assessment, contracting and goal setting, supporting change process, self-reflection.", "et": "Kursuse eesmärk on kujundada inimeste ja süsteemidega töötamiseks vajalikud baasteadmised sotsiaaltöös ja rehabilitatsioonis ning anda võimalus praktilise kogemuse omandamiseks järgmistes valdkondades: kontakti loomine kliendiga, lähteinfo kogumine kliendi ja tema keskkonna kohta, kliendi hindamine, kliendi probleemide analüüs, muutuse ettevalmistamine ning kliendi toetamine muutuse protsessis, eneserefleksioon."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands the essential elements of theoretical framework from which client work strategies are developed;", "et": "1) rakendab klienditöö aluseks olevaid teoreetilisi kontseptsioone ja põhimõisteid;"}, {"en": "2) knows the different levels of intervention and the main forms of intervention in social work;", "et": "2) hindab erinevaid sekkumise tasemeid ning peamisi sekkumisviise sotsiaaltöös ja rehabilitatsioonis; "}, {"en": "3) is conscious of the fundamental roles of social worker working with clients on different levels;", "et": "3) rakendab sotsiaaltöötaja põhirolle klienditöö erinevatel tasemetel;"}, {"en": "4) is familiar with client work process and the main techniques used at the different stages of the process;", "et": "4) analüüsib klienditöö protsessi mõjutavaid tegureid erinevatel klienditöö tasanditel; "}, {"en": "5) is able to transfer theoretical knowledge into practical activities, incl identify and analyze the factors affecting the process of working with clients at various levels, carry out an assessment of the client and his or her environment, support the client during the process of change;", "et": "5) rakendab kliendi toetamist muutuse ettevalmistamise ja läbiviimise protsessis;"}, {"en": "6) knows the signs of burnout and ways of burn-out prevention;", "et": "6) analüüsib läbipõlemise tundemärke ja selle ennetamise viise;"}, {"en": "7) is able to implement the process of self-reflection in the professional setting.", "et": "7) reflekteerib ennast klienditöö protsessis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}