{"uuid": "4c17f9ea-7373-3f08-505f-30b3daeeee9d", "code": "SVPC.02.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T16:22:59", "title": {"en": "The Basis of Tourism Industry", "et": "Turismimajanduse alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC02", "structural_unit_name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Terminology of tourism, hotel and catering sectors, development and relations with other economic sectors. Types and components of tourism. Estonian and international tourism organizations. Estonian toursim law. Estonian accommodation market and the types of accommodation. Types of catering establishments. Structure and organization of catering and accommodation. Classification of travellers and tourists. Purpose of travel, motives, needs and expectations. Tourism products and services (travel, transport, accommodation, catering, sightseeing). Demand and supply of tourism services. Impact factors and trends in tourism sector.", "et": "Turismi-, hotelli- ning toitlustusvaldkonna mõisted, areng ning seosed teiste majandusharudega. Turismivormid, -liigid ja komponendid. Eesti ja rahvusvahelised turismiorganisatsioonid ja nende tegevusvaldkonnad. Eesti turismiseadus. Eesti majutusturg ja majutusettevõtete liigid. Toitlustusettevõtted ja nende liigid. Majutus- ja toitlustusettevõtte ülesehitus ja töökorraldus. Reisijate ja turistide liigitamine. Külastuseesmärgid, külastajate motiivid, vajadused ja ootused. Turismitooted ning -teenused (reisi-, transpordi-, majutus-, toitlustusteenused, huviväärsused). Turismiteenuste nõudlus ja pakkumine. Turismimajanduse mõjutegurid ning suundumused."}, "objectives": [{"en": "The course gives an overview of the tourism industry, catering and accommodation sector and their relations with different economic sectors. The students will learn to analyze the indicators, current situation, trends and impact factors.", "et": "Õppeaine läbimisel õppija omandab tervikliku ülevaate turismimajanduse, toitlustus- ja majutussektorist ning nende seostest erinevate majandusharudega ja oskab analüüsida valdkonna tegevusnäitajaid, hetkeolukorda, suundumusi ning mõjutegureid."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) is aware of the main terminology, components and types of tourism, catering and accommodation, and documents and legal acts regulating these economic sectors;", "et": "1) teab valdkonnapõhiseid mõisteid, turismi-, toitlustus- ja hotellimajanduse komponente, liike ning neid majandusharusid reguleerivaid dokumente ja õigusakte;"}, {"en": "2) describes the travel motives, expectations and needs of different target groups;", "et": "2) kirjeldab erinevate sihtrühmade reisimotiive, ootusi ja vajadusi;"}, {"en": "3) has an overview of the most important tourism organizations in Estonia and in the world;", "et": "3) omab ülevaadet olulisematest Eesti ja maailma turismiorganisatsioonidest ning nende tegevustest;"}, {"en": "4) understands the factors impacting tourism industry and its relations with other economic sectors;", "et": "4) mõistab turismimajandust mõjutavaid tegureid ja valdkonna seoseid teiste majandusharudega;"}, {"en": "5) is aware of catering and accommodation services and their development options;", "et": "5) tunneb majutus- ja toitlustusettevõtete teenuseid ja leiab arendamisvõimalusi;"}, {"en": "6) presents the research results verbally and in written form and interprets data.", "et": "6) esitab nii kirjalikult kui suuliselt valdkonna uurimistööde tulemusi ja tõlgendab kogutud andmeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}