{"uuid": "8c80f452-8c0b-1128-0a92-cd45a6b59cdd", "code": "SVPC.03.020", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T15:12:05", "title": {"en": "Counselling Skills", "et": "Nõustamisoskused"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course gives an overview of the basics of counselling, opportunities to apply counselling in social work and rehabilitation, practical acquisition of basic techniques for primary counselling.\nTopics: \nProcess and basic principles of counselling. Personality and professional skills of the counsellor. Professional ethics of a counsellor. Factors influencing counselling process. Basic counselling theories (basic concepts, key concepts, basic techniques). Basic counselling techniques applied in social work (active listening).", "et": "Kursus keskendub ülevaate andmisele nõustamise põhimõtetest, nõustamise protsessi üheksast etapist, personaalsest taastumisest ja inimese toimevõimekuse arengust ning nõustamiseks vajalikest suhtlemisoskustest ning nõustamise rakendamise võimalustest sotsiaaltöös ja rehabilitatsioonis.\nKäsitletavad teemablokid: \nNõustamise põhimõtted ja nõustamise protsessi üheksa etappi. Nõustamise erisus sotsiaaltöös ja rehabilitatsioonis. Nõuded ja ootused nõustajale. Nõustamist mõjutavad tegurid. Nõustamise baasteooriad (põhimõisted, võtmekontseptsioonid, baastehnikad)."}, "objectives": [{"en": "The course is designed to develop a conceptual understanding of using counselling in social work and rehabilitation and shape core counselling skills.", "et": "Kursuse eesmärk on omandada teadmised nõustamise põhimõtetest, etappidest, toimevõimekuse arengust ja omandada esmased oskused nõustamisprotsessi läbiviimiseks sotsiaaltöö ning sotsiaalse rehabilitatsiooni klienditöös."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands basic principles of counselling;", "et": "1) teab nõustamise põhimõtteid;"}, {"en": "2) knows counselling application areas;", "et": "2) teab nõustamise rakendusvaldkondi;"}, {"en": "3) is familiar with the process of counselling;", "et": "3) teab nõustamisprotsessi etappe;"}, {"en": "4) is aware of the limits of counselling intervention (incl ethical aspects);", "et": "4) on teadlik nõustamise kui sekkumismeetodi piirangutest (sh eetilistest aspektidest);"}, {"en": "5) is aware of client-centered approach in counselling;", "et": "5) teadvustab kliendikeskse töö põhiprintsiipe (kliendi enesemääramisõiguse tunnustamine, kliendist lähtumine protsessi kõikides etappides jne);"}, {"en": "6) is familiar with common counselling theories;", "et": "6) teab ja eristab peamisi nõustamisteooriatel põhinevaid lähenemisi;"}, {"en": "7) is able to identify and analyze the factors affecting the process of counselling;", "et": "7) oskab määratleda ning analüüsida nõustamisprotsessi mõjutavaid tegureid;"}, {"en": "8) has active listening skills;", "et": "8) tunneb aktiivse kuulamise oskuseid;"}, {"en": "9) is able to support client activity at different stages of the counselling process;", "et": "9) teab, kuidas toetada kliendi aktiivsust nõustamise üheksas etapis;"}, {"en": "10) understands the importance of the process of self-reflection in the professional setting;", "et": "10) mõistab eneserefleksiooni olulisust nõustamise töös;"}, {"en": "11) knows modern professional vocabulary in English and Estonian.", "et": "11) tunneb kaasaegset erialast sõnavara eesti ja inglise keeles."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}