{"uuid": "005a406e-45c0-6671-432d-723d0b0540bf", "code": "SVPC.03.047", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T13:29:32", "title": {"en": "Child and Trauma", "et": "Laps ja trauma"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "\"Child and Trauma\" is a short multidisciplinary course which provides an overview of various aspects of a child's vulnerability, including developmental trauma, the effects of trauma on children, assessments and interventions, studying the literature and evidence-based interventions, including Trust-Based Relational Intervention (TBRI). TBRI is an attachment-based trauma-aware intervention designed to meet the complex needs of vulnerable children through the principles of contact, empowerment and correction.", "et": "\"Laps ja trauma\" on multidistsiplinaarne lühikursus, mis annab ülevaate erinevatest lapse haavatavuse aspektidest, sealhulgas arengutraumadest, trauma mõjudest lastele, hindamistest ja sekkumistest, uurides kirjandust ja tõenduspõhiseid sekkumisi, sealhulgas usalduslikel suhetel rajanevat sekkumist TBRI (Trust-Based Relational Intervention). TBRI on kiindumuspõhine traumateadlik sekkumine, mis on kujundatud haavatavate laste keeruliste vajaduste täitmiseks kontakti loomise, jõustamise ja korrigeerimise põhimõtete kaudu."}, "objectives": [{"en": "Create preconditions for noticing and understanding the vulnerability of the child and providing appropriate assistance.", "et": "Luua eeldused lapse haavatavuse märkamiseks ja mõistmiseks ning asjakohase abi osutamiseks."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) can identify traumatic experiences and their effects on the child's brain and general development;", "et": "1) oskab tuvastada traumeerivaid kogemusi ja teab nende mõju lapse ajule ja üldisele arengule;"}, {"en": "2) understands and is able to analyze the prevalence, etiology and risk factors of childhood trauma;", "et": "2) mõistab ja oskab analüüsida lapsepõlvetraumade levimust, etioloogiat ja riskitegureid;"}, {"en": "3) can identify and implement best practices and interventions;", "et": "3) oskab leida ja rakendada parimaid praktikaid ja sekkumist;"}, {"en": "4) understands systems based on development needs when selecting support measures;", "et": "4) saab aru toetusmeetmete valikutel arenguvajadustest lähtuvatest süsteemidest;"}, {"en": "5) understands and is able to apply the principles and strategies of TBRI (Trust-Based Relational Intervention);", "et": "5) saab aru ja oskab rakendada TBRI (Usalduslikel suhetel rajaneva sekkumise) põhimõtteid ja strateegiaid;"}, {"en": "6) can apply the course material in an environment with vulnerable childre, child in crisis or with experience of trauma.", "et": "6) oskab rakendada kursuse materjali keskkonnas, kus on kriisiolukorras, traumakogemusega ja haavatavad lapsed."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}