{"uuid": "7ce34dbb-8de5-15c4-db0e-f952ae700316", "code": "SVPC.03.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T10:48:46", "title": {"en": "Quality Management of Social Services", "et": "Sotsiaalteenuste kvaliteedijuhtimine"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The principles of quality management  of an organization   that provides or arranges social services, and the quality of management; manager's responsibilities when assuring the quality of social services. Process management and description of processes. Standards of services, management policy, quality control and supervision in the organizations providing social services.", "et": "Sotsiaalteenuseid osutava või korraldava organisatsiooni kvaliteedijuhtimise põhimõtted ja juhtimise kvaliteet; juhi ülesanded sotsiaalteenuste kvaliteedi tagamisel. Protsessijuhtimine ja protsesside kirjeldus. Sotsiaalteenuseid osutavate asutuste teenuste standardid, juhtimispoliitika, kvaliteedi kontroll ja järelevalve."}, "objectives": [{"en": "The course aims to expand the learners' knowledge about the principles of quality management and explain their applications in social services.", "et": "Süvendada õppijate teadmisi kvaliteedijuhtimise põhimõtetest ja selgitada nende rakendusvõimalusi sotsiaalteenuste osutamisel. "}, {"en": "The course handles the principles of quality management and the best methods of measuring and assessing service quality. Attention is paid to noticing customer-orientation and the need of including target groups, process-centred and systematic approach to quality, and the need for decision-making based on facts and constant improvement. The overview of quality management tools is given.", "et": "Õppeaines käsitletakse  kvaliteedijuhtimise põhimõtteid ja tuntumaid teenuste kvaliteedi mõõtmise ja hindamise meetodeid. Õpetatakse märkama kliendikesksust ja sihtgruppide kaasamise vajalikkust, protsessikeskset ja süsteemset lähenemisviisi kvaliteedile, pideva parendamise ja faktidele põhineva otsustusviisi vajadust. Antakse ülevaade  kvaliteedijuhtimise töövahenditest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the basics of quality management and mechanisms of quality assurance of social services;", "et": "1) teab kvaliteedijuhtimise aluseid ja sotsiaalteenuste kvaliteedi tagamise mehhanisme;"}, {"en": "2) describes the processes related to the provision of social services;", "et": "2) kirjeldab sotsiaalteenuste osutamisega seotud protsesse;"}, {"en": "3) orients oneself in legislation regulating the quality of social services;", "et": "3) orienteerub sotsiaalteenuste kvaliteeti reguleerivates õigusaktides;"}, {"en": "4) navigates in the legal acts that regulate the quality of social services;", "et": "4) orienteerub sotsiaalteenuste kvaliteedi valdkonna terminoloogias;"}, {"en": "5) implements the principles of quality management when planning social services.", "et": "5) rakendab kvaliteedijuhtimise põhimõtteid sotsiaalteenuste planeerimisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}