{"uuid": "5a6ba911-625c-b7cf-fb66-e5e91f0777c8", "code": "sv-2024-autumn-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-02T09:03:44", "title": {"en": "Fundamentals of Resource Management", "et": "Ressursimajanduse alused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}, {"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 12, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "IN TERMS OF NATURAL SCIENCES: what is a natural resource, how to estimate its quantity/value, in what way and volume is the climate and natural environment changing, what are the interactions between environmental factors as possible consequences for resource management?\n\nIN TERMS OF SOCIAL SCIENCES: what are ecosystem services, which societal, socio-economic and cultural changes are brought about by resource management in different societal contexts and business models?\nLEGISLATION AND GOVERNANCE: basic principles for the management of natural resources and corresponding legislation, what does the European Green Deal and climate policy mean for resource management, how does the related legislation work and how will policies be implemented?\n\nIN TERMS OF TECHNOLOGIES AND INNOVATION: how to reduce the human footprint on nature? What are the mitigation measures for reducing greenhouse gas emissions and prevent resource loss? What are the possibilities offered by innovation and how to follow the new economic model of climate neutrality (low-carbon emission)?\n\nIN TERMS OF ADAPTING TO CHANGE: how (risk) society, community, people and companies can increase adaptability in a changing environment (climate, resource, management, etc.)?", "et": "LOODUSTEADUSLIKULT: mis on loodusressurss, kuidas selle suurust/väärtust hinnata, mil viisil ja mahus on kliima ja looduskeskkond laiemalt muutumas, millised on keskkonnategurite vastasmõjud võimalike tagajärgedena ressursimajandusele? \n\nSOTSIAALTEADUSLIKULT: mis on ökosüsteemi teenused, milliseid ühiskondlikke, sotsiaal-majanduslikke ja kultuurilisi muutusi ressursside majandamine erinevates ühiskondlikes kontekstides ja ärimudelites esile kutsub? \n\nSEADUSANDLUS JA VALITSEMINE: loodusressursside majandamise aluspõhimõtted ja sellel baseeruv seadusandlus, mida tähendab ressursimajandusele Euroopa roheline kokkulepe ja kliimapoliitika, kuidas käib seonduv seadusloome ning kuidas viiakse poliitikat ellu?\n\nTEHNOLOOGIAD JA INNOVATSIOON: kuidas vähendada inimese jalajälge loodusele? Millised on leevendamismeetmed kasvuhoonegaaside heite vähendamiseks ja ressursikahju vältimiseks? Mida uut pakub innovatsioon ja kuidas minna kaasa uue kliimaneutraalsuse (madalsüsinikuheitelise) majandusmudeliga? \n\nMUUTUSTEGA KOHANEMINE: kuidas (riski)ühiskond, kogukond, inimene ja ettevõte suudab tõsta kohanemisvõimet muutuvas ümbruskonnas (kliima, ressurss, haldus jm)?"}, "objectives": [{"en": "The course aims at providing a multidisciplinary overview of the management of natural resources with regard to climate change, the environmental tolerance threshold, human socio-economic and cultural needs as well as policy trends and the legislative framework.", "et": "Anda multidistsiplinaarne ülevaade loodusressursside majandamisest pidades silmas kliimamuutusi, keskkonna taluvusläve, inimese sotsiaalmajanduslikke ja kultuurilisi vajadusi ning poliitika suundumusi ja seadusandluse raamistikku."}, {"en": "The purpose of the course is to give examples of new technologies and person-centred solutions within resource management, including resource constraints and conflicting interests.", "et": "Tuua näiteid ressursimajandusega seonduvatest uutest tehnoloogiatest ja inimkesksetest lahendustest arvestades muuhulgas ressursside piiratust ja vastanduvaid huvisid."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the environment and society of Estonia, local cases and resource management, and the implementation and development of climate policy;", "et": "1) teab Eesti keskkonda ja ühiskonda, siinseid juhtumeid ja ressursside majandamist ning kliimapoliitika elluviimist ja arendamist;"}, {"en": "2) has a scientifically critical look at the topic of resource management and be able to comparatively discuss on  the interrelations of cause-effect, problem-solution, resource-supply-deficit, mitigation-adaptation, natural-artificial environment and other;", "et": "3) orienteerub ressursimajanduse teemas teaduskriitiliselt ja oskab võrdlevalt arutleda seosepaaride põhjus-tagajärg, probleem-lahendus, ressursivaru-defitsiit, leevendamine-kohanemine, looduslik-tehiskeskkond jms üle;"}, {"en": "3) understands the management of natural resources both globally and in Estonia and at the local level, and contemplate the use of resources considering the new climate neutrality objectives;", "et": "3) mõistab loodusressursside majandamist nii globaalselt kui Eestis ning kohalikul tasandil ja juurdleb ressursikasutuse üle uutes kliimaneutraalsuse eesmärkides;"}, {"en": "4) is able to discuss the possibilities of implementing integrated solutions within complex systems with the purpose of ensuring long-term sustainability.", "et": "4) suudab arutleda komplekssetes süsteemides terviklike lahenduste elluviimise võimalusi eesmärgiga tagada pikaajaline kestlikkus."}], "notes": {}}, "grading": {"independent_work": {"et": "RESSURSIMAJANDUSE LOENGUD JA SEMINARID\nKontaktõppes osalemine kohustuslik\nRESSURSIMAJANDUSE MINIPROJEKT (lõputöö)\nÜliõpilane käsitleb iseseisvalt ühte aktuaalset ressursikasutuse probleemi, mis sisaldab probleemipüstitust, teoreetilist tausta ja seadusandlikku raamistikku, konkreetset probleemikäsitlust ja -arengut ning arutelu ja kokkuvõtet lahendustest (tegelikud, võimalikud) lahendusi. Teemavalikut ja probleemikäsitlust arutada õppejõu-juhendajaga (mida ja kuidas uurida, millele keskenduda, olulised asjaolud jm).\nTeema: Teemavalik on vaba. Soovitav on valida probleemjuhtum oma erialatööst, endale huvipakkuvast kompleksjuhtumist või süveneda hiljuti kogetud huvipakkuvasse ressursikasutuse küsimusse. Teema peab olema laiendatav ja üldistatav aktuaalse ühiskonnaprobleemina mõne loodusvara või loodushüve jätkusuutlikust kasutusest. \nMetoodika: Töö koostatakse 4 lk kirjalikult, esitatakse hiljemalt 2 päeva enne seminari ning kantakse lühidalt ette (u 5 min), millele järgneb arutelu (teemad grupeeritakse, et käsitleda ühes arutelublokis mitmeid näiteid. Töö võib sisaldada paari joonist või kaarti."}, "grade_preconditions": {"et": "Kontaktõppes füüsiline osalemine ja tähtaegselt esitatud tunnitööd ning mikroprojekt"}, "grade_evaluation": {"et": "Hindamiskriteeriumite punktid liidetakse kokku ja kursusehinne kujuneb täheliselt (A-F) järgnevalt:"}, "grade_conditions": {"A": {"et": " 91-100% kogutulemusest. Silmapaistev ja eriti laiapõhjaline õpiväljundite saavutamise tase, mida iseloomustab väga head taset ületav teadmiste ja oskuste vaba ning loov kasutamine. Tunnitööd täiuslikud, aktiivne ja sisukas osalus kontaktõppes."}, "B": {"et": "81-90% kogutulemusest. Väga heal tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste eesmärgipärane ja loov kasutamine. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas võivad ilmneda mittesisulised ja mittepõhimõttelised eksimused. Tunnitööd väga head, aktiivne ja sisukas osalus kontaktõppes."}, "C": {"et": "71-80% kogutulemusest. Heal tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste eesmärgipärane kasutamine. Spetsiifilisemate ja detailsemate teadmiste ja oskuste osas avaldub ebakindlus ja ebatäpsus. Puudujäägid tunnitöödes."}, "D": {"et": "61-70% kogutulemusest. Piisaval tasemel õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste kasutamine harjumuspärases olukorras, kuid erandlikes olukordades avalduvad puudujäägid ja ebakindlus. Tunnitööd kasinad."}, "E": {"et": " 51-69% kogutulemusest. Minimaalselt lubataval tasemel olulisemate õpiväljundite saavutamine, mida iseloomustab teadmiste ja oskuste kasutamine tüüpolukordades piiratud viisidel, kuid erandlikes olukordades avalduvad märgatavad puudujäägid ning ebakindlus. Tunnitööd nõrgad. "}, "F": {"et": "0-50% kogutulemusest. Õppija on omandanud teadmised ja oskused miinimumtasemest madalamal tasemel. Hinne \"F\" on negatiivne tulemus ning eksam tuleb uuesti sooritada."}, "mi": {"et": "Üliõpilane pole ilmunud loengute-seminaridele.  "}}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "1d23e135-ba67-60e6-1304-a7cfa46c56bb", "person_name": "Mare Mätas", "structural_unit": {"code": "SVPC08", "name": {"en": "Research and Development Office", "et": "teadus- ja arendusosakond"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "2a33ad50-8021-61c8-8bae-7aca0fecefe5", "person_name": "Antti Roose", "structural_unit": {"code": "SVPC08", "name": {"en": "Research and Development Office", "et": "teadus- ja arendusosakond"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "d272c743-40c3-73a1-f1e7-3f935accd6ec", "person_name": "Henn Ojaveer", "structural_unit": {"code": "SVPC08", "name": {"en": "Research and Development Office", "et": "teadus- ja arendusosakond"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "aad797ae-eb66-c116-d5c8-42c472b959de", "person_name": "Mait Kriipsalu", "structural_unit": {"code": "SVPC08", "name": {"en": "Research and Development Office", "et": "teadus- ja arendusosakond"}, "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-22"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "KLIIMANEUTRAALSUS/MADALSÜSINIKUMAJANDUS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "BIO-/RINGMAJANDUS"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "SINIMAJANDUS"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "f9af439e-61f7-3c25-e102-ab5079a82321", "parent_code": "SVPC.00.066", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}