{"uuid": "3d17ac5f-fbe7-ceb6-17c9-e4ebd2e4d2b1", "code": "SVPC.01.044", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-17T14:27:38", "title": {"en": "Branding", "et": "Bränd ja selle kujundamine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The nature of a brand and related terms. Relationships between brand management and marketing and design. Values and brand architecture. Brand levels: organization, product group, product or service. Specifics, process and necessity of creating personal brands.", "et": "Brändi olemus ja seonduvad terminid. Brändijuhtimise seosed turunduse ja disainiga. Väärtused ja brändiarhitektuur. Brändi tasandid: organisatsioon, tootegrupp, toode/teenus. Persoonibrändide loomise spetsiifika, protsess ning vajalikkus."}, "objectives": [{"en": "The aim of the course is to provide knowledge about the connections between brand management and the discipline of marketing and design management, and to develop the ability to analyze and create brands at both the organizational and individual level.", "et": "Õppeaine eesmärk on anda teadmised brändijuhtimise seostest turunduse ning disainijuhtimise distsipliiniga ning arendada oskust analüüsida ning luua brände nii organisatsiooni kui ka indiviidi tasandil."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the nature of brand and brand management and the connection with marketing and strategic management of an organization; ", "et": "1) teab brändi ja brändijuhtimise olemust ning seost turunduse ning organisatsiooni strateegilise juhtimisega;"}, {"en": "2) understands the importance of user focus in the context of brand management; ", "et": "2) mõistab kasutajakesksuse olulisust brändijuhtimise kontekstis;"}, {"en": "3) is able to analyze the structure of brands and messages sent to different customer groups;", "et": "3) oskab analüüsida brändide ülesehitust ning erinevatele kliendirühmadele edastatavaid sõnumeid;"}, {"en": "4) is able to compile initial tasks for writing marketing texts or compile corresponding texts based on the target group; ", "et": "4) oskab sihtrühmast lähtuvalt koostada lähteülesande turundustekstide kirjutamiseks või koostada ise vastavat teksti;"}, {"en": "5) is able to analyze the visual identity of a brand and make related suggestions; ", "et": "5) oskab analüüsida brändi visuaalset identiteeti ning teha sellest lähtuvaid ettepanekuid; "}, {"en": "6) knows the nature of a personal brand and understand its necessity; ", "et": "6) teab persoonibrändi olemust ja mõistab selle vajalikkust;"}, {"en": "7) is able to develop their personal brand and consciously manage it.", "et": "7) oskab arendada oma persoonibrändi ja seda teadlikult juhtida."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}