{"uuid": "aaac123f-6ae4-b3f5-67de-a9c309a8331a", "code": "SVPC.00.039", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-10T15:20:26", "title": {"en": "Change Management", "et": "Muudatuste juhtimine"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Organizational anthropology. Mapping cultural patterns. Social practices. Ethnographic thinking. Challenges in studying one's own culture. Professional communities. Resistance to change. Communication networks. Argument as a tool. Leading meetings and moderating discussions. Co-creation.", "et": "Organisatsiooniantropoloogia. Antropoloogiline vaade muudatuste juhtimisele. Kultuurimustrite kaardistamine.\nSotsiaalsed praktikad. Etnograafiline mõtlemine. Enda kultuuri uurimise ja \"studying up\" väljakutsed. \nProfessionaalsed kogukonnad. Vastuseis muudatustele. Muudatuste eesmärgid ja antro teadmiste pagasist tulenevad näpunäited. Otsustamise ja veenmise teooria. \nMuudatuste kommunikatsioon. Kommunikatsioonivõrgustikud. Argument kui tööriist. Koosolekute ja arutelude juhtimine. Koosloome."}, "objectives": [{"en": "The aim of the course is to discuss human-centered approach to change management in organizations and to give students some tools to practice this approach.", "et": "Aine eesmärk on anda õppijatele teadmisi ja oskuseid rakendamaks inimkeskset lähenemist muudatuste juhtimisele organisatsioonis."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows what is organizational anthropology, organizational culture and understand how this knowledge can be useful for anyone inducing change at organizations;", "et": "1) teab, mida kujutab endast organisatsiooniantropoloogia, mis on ja kuidas kujuneb organisatsioonikultuur ning kuidas need teadmised saavad talle kui organisatsioonisiseste muudatuste juhtijale kasulikud olla;"}, {"en": "2) knows how to analyze cultural and social aspects impacting change processes; ", "et": "2) oskab märkab ja analüüsib kultuurilisi ja sotsiaalseid aspekte, mis mõjutavad muudatuste juhtimise protsesse;"}, {"en": "3) is able to use some basic anthropological methods as tools for change manager;", "et": "3) oskab baastasemel kasutada ning teenuse tellijana küsida antropoloogilisi meetodeid, millest on kasu organisatsiooni toimimisest ülevaate saamiseks; "}, {"en": "4) analyze reasons for resistance to change, have tools to deal with resistance;", "et": "4) teab, mis võivad olla muudatustele vastupanu avaldamise põhjused, ta oskab need põhjused oma organisatsioonis tuvastada ja tal on tööriistad nende põhjustega tegelemiseks;"}, {"en": "5) knows how to design communications related to change; ", "et": "5) oskab kujundada muudatuste elu viimist soodustavat kommunikatsiooni;"}, {"en": "6) has skills for co-creation and argumented leadership.", "et": "6) on omandanud praktilisi oskuseid koosloome ning argumenteeritud juhtimise rakendamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}