{"uuid": "f5165e64-fa5b-4aa6-a764-edd6670917de", "code": "SVPC.00.025", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-21T15:29:45", "title": {"en": "Practice", "et": "Praktika"}, "credits": 8, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 3, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Work in institutions or enterprises by raising and solving different economic problems. The practice ends with defending a paper. For defending, the student submits a report containing an economic issue raised and solved during the practice.", "et": "Analüütiline ja sünteesiv grupipõhine töö asutuses või ettevõttes majandusprobleemide püstitamisel ja lahendamisel. Praktika lõpeb iga semestri lõpus grupipõhise praktika protsessi ja sisulisi tulemusi kajastava esitlusega. Esitlus peab sisaldama, sh slaididena: praktika käigus püstitatud ja käsitletud majandusprobleem, selle lahendamise protsess ja meetodid, peamised sisulised tulemused vastavalt praktika semestri fookusele. Praktika toimub grupipõhiselt - ülikooli, tudengite ja praktikaorganisatsiooni vahel sõlmitakse vastav leping enne praktika algust. Praktika hinde eelduseks on praktikabaasipoolse juhendaja kirjalik hinnang tudengite tööle/aruandele, mis tuleb edastada aine vastutavale õppejõule (ülikoolipoolsele juhendajale).\nPraktika toimub osadena läbi 3 semestri ja lõimib kokku erinevad ettevõtluse alateemad (ettevõtluskeskkond, äriidee leidmine ja arendamine, meeskonna komplekteerimine ja eestvedamine, kliendikäitumine ja turundus, hinnakujundus ja finantsjuhtimine jne) moodustades terviku ehk kogu õppekava \"selgroo\" - alates probleemist/võimalusest ja äriidee leidmisest kuni teenuse lansseerimiseni (ehk äriidee elluviimiseni):\n1. osa fookus - ettevõtluskeskkond ja tegevusharu, trendianalüüs ja äriidee, disainiaudit;\n2. osa fookus - olemasoleva teenuse baasil parendatud teenusekontseptsiooni loomine (sh selle testimine sihtrühmadel);\n3. osa fookus - uue teenusekontseptsiooni väljatöötamine (sh selle testimine sihtrühmadel).\nIga eelnev praktika moodustab sisendi järgmisele ning tervikuna käiakse läbi 3 semestriga kogu ettevõtluse protsess praktiliste tegevustena - metoodilise alusena lähtutakse disainmõtlemisest ja teenusedisaini topeltteemandi mudelist. Lisaks peavad tudengid demonstreerima teenusearenduse seostamise oskust kõigi teiste funktsionaalsete valdkondadega organisatsioonis (finantsjuhtimine, personalijuhtimine, turundus jt)."}, "objectives": [{"en": "The objective of the practice is to provide students with the possibility to integrate theoretical knowledge gained in master programme into real situations and problem solving processes of an enterprise or institution and thereby develop practical skills.", "et": "Praktika eesmärgiks on rakendada magistriõpingute käigus omandatud teoreetilisi teadmisi ettevõtlusest, disainist ja teenuste juhtimisest avaliku- ja erasektori organisatsioonides. Läbi kolme semestri antakse tudengile terviklik disainmõtlemise ja teenusedisaini metoodika  rakendusoskus organisatsiooni loomise ja arendamise kontekstis ehk ettevõtluse tervikprotsessis. Praktika käigus omandab õppur arusaama iseendast disaineri rollis, õpib analüüsima ning jälgima teadlikult enda pädevuste arengut disainerina (sh arendusmeeskonnaliikmena) ning kujundab nägemuse oma karjäärialasest tulevikust disainivaldkonnas juhi ja/või ettevõtjana (era- või avalikus sektoris)."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1)  understand difference and similarities of designers' and entrepreneurs' roles;", "et": "1) mõistab ettevõtja rolli olemust ja selle sarnasust/erinevust teenusedisaineri rolliga;"}, {"en": "2) is acquainted with different possibilities of applying theoretical knowledge into practice;", "et": "2) on ettevõtliku hoiakuga ja oskab äriideid ja probleemidele lahendusi genereerida;"}, {"en": "3) can study respective problems and apply appropriate methods, including career planning;", "et": "3) oskab analüüsida enda erialaste pädevuste rakendamisvõimalusi organisatsioonis ning planeerida karjääri disainerina;"}, {"en": "4) sees opportunities and challenges in economic environment and complies design brief based on them;", "et": "4) oskab näha võimalusi ja lahendamist vajavaid probleeme ettevõtluskeskkonnas ja koostada nende põhjal disainiprojektile lähteülesande;"}, {"en": "5) can analyse business plan based on design audit and environmental analysis;", "et": "5) oskab analüüsida organisatsiooni äriideed ja äri-või tegevusmudeli adekvaatsust ja arendamisvajadust lähtuvalt organisatsiooni keskkonna analüüsist ning enda koostatud disainiauditist;"}, {"en": "6) can conduct user research;", "et": "6) oskab teostada kasutajauuringut;"}, {"en": "7) can lead or work as member of a creative team.", "et": "7) oskab jagada rolle, mõjutada grupiprotsesse ja töötada loovmeeskonnas."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}