{"uuid": "6f9c4a01-fb51-c054-dba1-343315324601", "code": "SVPC.02.055", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-27T11:40:00", "title": {"en": "Wellness Economy and Entrepreneurship", "et": "Heaolumajandus ja ettevõtlus"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVPC02", "structural_unit_name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Industry/economy/business taxonomy. Definition and context of innovation. Innovation trends. Smart of Everything. Health Industry. Wellness Economy and Elements. Wellness Economy Components. Relationship Between Service Design and Innovation. Contemporary Issues in the Wellness Economy. Description of Areas of Innovation in Wellness and  Application of Innovative Thinking in the Wellness and Spa Sector. Entrepreneurship and Wellpreneurship. Idea Generation and Reality Check. Start-ups and Incubation. Success Factor and Failure.", "et": "Tööstuse/majanduse/äri taksonoomia. Innovatsiooni mõiste ja kontekst. Innovatsiooni trendid. Smart of Everything. Tervisemajandus. Heaolumajandus. Tööstuse komponendid. Teenuse disain ja innovatsioon. Tänapäevased lahendused loomemajanduses. Loovmajanduse kontseptsioonid. Loovmõtlemise printsiipide rakendamine heaolu- ja spaavaldkonnas. Ettevõtlus ja \"wellpreneurship\". Ideede genereerimine. Start-upid ja inkubatsioon."}, "objectives": [{"en": "The general objective is to provide students with the understanding of how the wellness economy works and how wellness entrepreneurship can be initiated and nurtured. It is expected that the innovative approaches and tools lead to a more competitive wellness economy.", "et": "Aine eesmärgiks on anda õppijatele teadmine, kuidas toimib heaolumajandus ja kuidas algatada ning arendada heaoluettevõtlust. Innovaatiline lähenemine ja uuenduslike vahendite kasutamine loob võimalused edukamaks ja konkurentsivõimelisemaks heaolumajanduseks."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the definition and processes of innovation, knows the differences between innovation, invention and creativity;", "et": "1) teab innovatsiooni mõistet ja selle protsesse ja erisusi;"}, {"en": "2) applies techniques and methods of innovation in various areas of the wellness economy, with special focus on spas;", "et": "2) tunneb vahendeid ja võimalusi edukaks ettevõtluseks heaolumajanduses;"}, {"en": "3) experiments which skills, tools and insights they need to be able to improve their wellness entrepreneurship capabilities and competitiveness;", "et": "3) oskab kasutada innovatsiooni tehnikaid ja meetodeid heaolumajanduses;"}, {"en": "4)  is able to apply the innovative thinking and entrepreneurial approach in practice and adapt to an actual location/site/project.", "et": "4) oskab rakendada innovaatilist ja loovat mõtlemist projektitöös."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}