{"uuid": "937b233e-df57-82c3-6e5d-62eca03b6e95", "code": "SVPC.01.043", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T14:36:55", "title": {"en": "Circular Design and Green Economy", "et": "Ringdisain ja rohemajandus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Circular economy. Green economy. Circular design. The role and importance of the environment in design and society.", "et": "Ringmajandus. Rohemajandus. Ringdisain. Keskkonna roll ja olulisus disainis ja ühiskonnas."}, "objectives": [{"en": "The aim of the course is to develop the students' business skills and make them ponder about the sustainable use of natural resources to meet the renewed demands of consumers and markets for the provision of environmentally friendly, natural, healthy products and services that create maximum value for different parties.", "et": "Õppeaine eesmärk on arendada õppija vajalikke ärioskusi ning panna ta mõtlema loodusressursside jätkusuutlikule kasutamisele, et täita tarbijate ja turgude uuenenud nõudmisi keskkonnasäästlike, looduslike, tervislike ja erinevatele osapooltele maksimaalset väärtust loovate toodete ning teenuste pakkumise võimalustele."}], "learning_outcomes": [{"en": "After completing the course the student will: ", "et": "Õppeaine läbinud õppija: "}, {"en": "1) understand the concepts and essence of circular design, green consumer society and sustainable consumption, consumer needs and the resulting business opportunities;", "et": "1) mõistab ringdisaini ning rohelise tarbimisühiskonna ja jätkusuutliku tarbimise mõisteid ja olemust, tarbija vajadusi ning sellest tulenevaid ärivõimalusi;"}, {"en": "2) understand the concept and importance of supply chain management;", "et": "2) mõistab tarneahela juhtimise kontseptsiooni ja olulisust;"}, {"en": "3) be able to take into account the principles of circular design and green economy when developing new services (or products);", "et": "3) oskab uute teenuste (või toodete) arendamisel arvestada ringdisaini ja rohemajanduse põhimõtetega;"}, {"en": "4) understand the difference between local and international business, target market definitions, segmentation and cost-benefit analysis.", "et": "4) mõistab kohaliku ja rahvusvahelise äritegevuse erinevusi, sihtturgude mõisteid, segmenteerimist ja tasuvusanalüüsi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}