{"uuid": "91f50608-05f2-1809-ef58-d3ca2c478af1", "code": "SVPC.00.061", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T16:03:52", "title": {"en": "Service Economy", "et": "Teenusmajandus"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Service society and service economy. Service-minded mindset, values, culture and quality. Customer grouping, expectations, needs. Internal customer. Customers with special and distinctive needs. Roles, competences and personality traits of a service representative. Customer service and service language.  Prevention and resolution of error situations. The content and principles of the service performance of the customer-oriented organization. Value-based service instructions. Design and execution of the service process.", "et": "Teenindusühiskond ja teenusmajandus. Teenindusmõttelaad, -väärtused, -kultuur ja -kvaliteet. Klientide rühmitamine, ootused, vajadused ja soovid. Sisekliendi teenindamine. Eri- ja eristavate vajadustega kliendid. Klienditeenindaja rollid, pädevused ja isiksuseomadused. Klienditeenindaja suhtlusvahendid ja teeninduskeel.  Veaolukordade ennetamine ja lahendamine. Kliendikeskse organisatsiooni teeninduskorralduse sisu ja põhimõtted. Väärtuspõhised teenindusjuhised. Teenindusprotsessi kavandamine ja teostus."}, "objectives": [{"en": "Students acquire knowledge about service economy, service philosophy, values, culture, quality and organisation of customer-driven service processes. The student develops and implements his service-minded mindset, readiness and skills in the analysis, planning and performing service processes.", "et": "Õppija omandab teadmised teenusmajanduse toimimisest, teenindusmõttelaadist, -väärtustest, -kultuurist, -kvaliteedist ning kliendikesksete teenindusprotsesside korraldusest. Õppija arendab oma teenindusmõttelaadi, -hoiakuid, -valmidust ja -oskusi ning rakendab neid teenindusprotsesside analüüsimisel, kavandamisel ja teostamisel."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands the meaning and content of service economy, service-minded mindset, values, culture and quality, and the importance of ensuring the success of the organisation;", "et": "1) mõistab teenusmajanduse, teenindusmõttelaadi, -väärtuste,  -kultuuri, kvaliteedi ja sisekliendi teeninduse tähendust ning tähtsust organisatsiooni edukuse tagamisel;"}, {"en": "2) communicates with internal and external clients of the organization based on the principles of the service-minded mindset and using the appropriate service language; ", "et": "2) suhtleb organisatsiooni sise-  ja välisklientidega, tuginedes teenindusmõttelaadi põhimõtetele ja kasutades sobivat teeninduskeelt;"}, {"en": "3) analyzes the organization's service-minded philosophy and culture, different aspects of service quality, service interaction, and service language usage, and resolving error situations;", "et": "3) analüüsib organisatsiooni teenindusmõttelaadi ja -kultuuri, teenuse kvaliteedi eri tahke, teenindussuhtlust,  teeninduskeele kasutust ja veaolukordade lahendamist; "}, {"en": "4) plans a customer-centered service process;", "et": "4) kavandab  kliendikeskse teenuse protsessi;"}, {"en": "5) participates in customer-oriented service provision as a team member.", "et": "5) osaleb kliendikeskse teenuse pakkumisel meeskonnaliikmena."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}