{"uuid": "435ef27b-6035-8f0c-8a2f-568fedb30d4b", "code": "SVPC.03.051", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T11:46:23", "title": {"en": "Protection of the Rights of the Needy", "et": "Abivajaja õiguste kaitse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "77987e97-b1e6-735d-8fea-910578600caa", "code": "SVPC.03.050", "title": {"en": "Basics of Law", "et": "Õiguse alused"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-14T11:40:29"}]}, "overview": {"description": {"en": "The principles of the Estonian judicial system and the general bases of the court administration. Establishment of guardianship and grounds for court procedures (minor, adult,) guardian, the extent of guardianship, functions of local government in establishing guardianship. General organisation of the state victim support, content and bases of provision of victim support service. Content and grounds for the application of the National Family Mediation Service.", "et": "Eesti kohtusüsteemi põhimõtted ja kohtukorralduse üldised alused. Eestkoste seadmine  ja kohtumenetluse alused (alaealisele, täiskasvanule,) eestkostja isik, eestkoste ulatus, kohaliku omavalitsuse ülesanded eestkoste seadmisel. Riikliku ohvriabi üldine korraldus, ohvriabi teenuse sisu ja osutamise alused. Riikliku perelepitusteenuse sisu  ja kohaldamise alused."}, "objectives": [{"en": "The course aims to provide the student with general knowledge of the basics of court administration, which would allow them to assist clients in the preparation of documents necessary for the protection of their rights (court and other institutions).", "et": "Eesmärk on anda õppijale üldised teadmised kohtukorralduse alustest, mis võimaldaksid vajadusel anda mõne kohtuasja õigeks lahendamiseks vajalikku tõendusteavet, samuti võimaldaksid abistada kliente nende õiguste kaitseks vajalike dokumentide vormistamisel (kohus ja teised institutsioonid)."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the principles and values of the Estonian judicial system and the general foundations of the judicial organisation;", "et": "1) teab ja tunneb Eesti kohtusüsteemi põhimõtteid ja väärtusi ning kohtukorralduse üldiseid aluseid;"}, {"en": "2) knows general principles of guardianship, grounds for establishing guardianship and court procedures, functions of local government in establishing guardianship;", "et": "2) teab ja tunneb eestkoste üldiseid põhimõtteid, eestkoste seadmise ja kohtumenetluse aluseid, kohaliku omavalitsuse ülesandeid eestkoste seadmisel;"}, {"en": "3) knows general bases for the organisation of state victim support and assistance provided in terms of the Victim Support Act;", "et": "3) teab ja tunneb riikliku ohvriabi korraldamise üldiseid aluseid ja osutatavat abi ohvriabi seaduse mõistes;"}, {"en": "4) knows the objectives of the National Family Mediation Service and the bases for the organisation of conciliation procedures.", "et": "4) teab ja tunneb riikliku perelepitusteenuse eesmärke ja lepitusmenetluse korraldamise aluseid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}