{"uuid": "f4deb1e6-8a89-ac92-59e4-c0d3a62a48bf", "code": "sv-2024-spring-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-12-03T11:30:20", "title": {"en": "Social Work in Health Care", "et": "Sotsiaaltöö tervishoius"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Contemporary healthcare social work theoretical methods and intervention methods. Social work in various areas of healthcare such as primary care, active care, rehabilitation, nursing care, palliative care, and health centers. The basic principles of assessing the client's needs in healthcare social work, assessment methods, and assessment tools used in work with children, adults, the elderly, or terminally ill people, respectively. Different principles of healthcare social work and the most supported theoretical approaches in this field are laid out. Healthcare system management system in Estonia, organization of work of multi/interdisciplinary teams, and the social worker's role in providing healthcare services. Professional networking in the interdisciplinary team in the area of healthcare.", "et": "Kaasaegsed tervishoiu sotsiaaltöö teoreetilised suunad ja sekkumismeetodid. Sotsiaaltöö erinevates tervishoiu valdkondades nagu esmatasandi meditsiin, aktiivravi, taastusravi, hooldusravi, palliatiivne ravi ja tervisekeskused. Tervishoiu sotsiaaltöös kasutatavad kliendi vajaduste hindamispõhimõtted, hindamismeetodid ning hindamisvahendid, mis on kasutatavad vastavalt töös laste, täiskasvanute, eakatega või terminaalselt haigetega. Erinevad tervishoiu sotsiaaltöö põhimõtted ja enim toetust leidnud teoreetilised lähenemised selles töövaldkonnas. Tervishoiu korraldus Eestis, multi/interdistsiplinaarsete meeskondade töökorraldus, sotsiaaltöötaja roll tervishoiu teenuste osutamisel. Võrgustikutöö interdistsiplinaarses meeskonnas tervishoiusfääris."}, "objectives": [{"en": "The aim of the course is to give the participants an overview of the intervention methods of social work in modern health care, the theoretical approaches underlying the practical work; develop the skills of the course students to assess the psychosocial, socio-economic and sociocultural needs of the client in the field of health care and in the interdisciplinary team.", "et": "Loengukursuse eesmärk on anda osalejatele ülevaade kaasaaegse tervishoiu sotsiaaltöö interventsioonimeetoditest, praktilise töö aluseks olevatest teoreetilistest käsitlustest; arendada kursuslaste oskusi kliendi psühhosotsiaalsete, sotsiaalmajanduslike ja sotsiokultuuriliste vajaduste hindamiseks tervishoiu valdkonnas ning interdistsiplinaarses meeskonnas."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) is familiar with the theoretical concepts of social work, the specifics of practical work, and the ethical aspects in the various fields of health and mental health care;", "et": "1) teab sotsiaaltöö teoreetilisi käsitlusi, praktilise töö eripärasid ning eetilisi aspekte tervishoiu ja vaimse tervishoiu erinevates valdkondades;"}, {"en": "2) knows the possibilities of cooperation with medical specialists and specialists in the related fields of medicine and is able to apply them; ", "et": "2) teab koostöö võimalusi meditsiinispetsialistide ja meditsiini siduserialade spetsialistidega ning oskab neid rakendada; "}, {"en": "3) has the skills to work with children, young people, adults, and families in various healthcare fields such as primary care, active care, rehabilitation, nursing care, and mental health care; ", "et": "3) omab oskusi töötada laste, noorte, täiskasvanute ja peredega erinevates tervishoiu valdkondades nagu esmatasandi tervishoid, aktiivravi, taastusravi, hooldusravi ning vaimne tervishoid; "}, {"en": "4) knows the ways of assessing the client's psychosocial needs and the possibilities of intervention in the field of healthcare social work.", "et": "4) teab kliendi psühhosotsiaalsete vajaduste hindamise viise ja interventsioonivõimalusi tervishoiu sotsiaaltöö valdkonnas."}], "notes": {"et": "Sihtrühm SRSÕ2"}}, "grading": {"independent_work": {"et": "1. Kodutöö nr 1 (individuaalne): Eetiliste põhimõtete tõlgendamise essee. 3-4 lk teemakäsitlust (kuni 30 p).\n2. Kodutöö nr 2 (individuaalne): Vajaduste või väärtuste põhine infomaterjali koostamine patsiendile. Moodlesse üles laetud enda loodud infomaterjal (mitteeristav hindamine).\n3. Kodutöö nr 3 (individuaalne): Hindamisvahendite kasutamise kogemuse eneseanalüüs. Maksimaalselt 2 lk (kuni 10 p).\n4. Kodutöö nr 4 (grupitöö): Sotsiaaltöötaja rolli kirjeldamine ühe sihtrühma või tervishoiu valdkonna raames. Ettekanne rühmana veebis (kuni 30 p).\n5. Teadmiste kontrolli eksam sisaldab 10-12 küsimust, eksami kestvus 60 min. Testi saab sooritada Moodles endale sobival ajal kahe nädala jooksul määratud eksamiajast. Testi avatud küsimused on seotud loengutes käsitletud teemadega ja iseseisvalt loetud õppematerjalidega (kuni 30 p)."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Kodutööde (nr 1, 2, 3, 4) juures hinnatakse teadmisi õppeaine põhimõistetest, tervishoiu psühhosotsiaalsest käsitlusest, tervise ja heaolu temaatika rakendamisest sotsiaaltöös, oskust iseseisvalt infot koguda ning seda kodutöös loovalt tõlgendada, kirjaliku ja suulist väljendusoskust, kohustusliku kirjanduse tundmist ning kirjalike töödele esitatavate nõuetest kinnipidamist; kirjalike tööde vormistuse korrektsus ja nõuetele vastavus, viidete asjakohasus ja ulatus, analüütilisus, seoste loomine, tõlgendamise tase; teemakäsitluse loogilisus ja terviklikkus.\nE - vormistus üldjoontes nõuetekohane ja korrektne, viidete toomine minimaalne ja ebakindel, analüüsi ja iseseisva tõlgendamise elemendid olemas, teemakäsitus üldjoontes loogiline, ent seosed lünklikud, väljendusoskus puudulik, kohustusliku materjali tundmine puudulik, 51-60%; \nD - vormistus nõuetekohane ja üldjoontes korrektne, viited minimaalsed, aga asjakohased, analüüs ja iseseisev tõlgendamine arusaadav, ent kohati ebakindel, teemakäsitus üldjoontes loogiline ja seostatud, väljendusoskus kesine, kohustusliku materjali tundmine minimaalne, 61-70%; \nC - vormistus nõuetekohane ja korrektne, viited asjakohased ja piisavad, analüütilised seosed  ja tõlgendused korralikud, kindlus seoste loomisel, teemakäsitus loogiline, ent terviku seisukohalt täheldatavad mõned nõrgad kohad, väljendusoskus hea, kohustusliku materjali tundmine piisav, 71-80%; \nB - vormistus eeskujulik, viidete valik, maht ja seostamine tekstiga väga hea, seoste ja viidete põhjalik analüüs, tõlgendamine julge ja seostele tuginev, teemakäsitus tervikuna loogiline ja ladus, väljendusoskus väga hea, kohustusliku materjali tundmine tuntav, 81-90%;\nA -  vormistus eeskujulik, viidete valik, maht ja seostamine tekstiga loominguline, analüüsi sügavus ja iseseisva tõlgendamise tase silmapaistev, seosed põhjalikud ja leidlikud, teemakäsitus uudne, loogiline, tekst tervikuna silmapaistev saavutus, väljendusoskus suurepärane, kohustusliku materjali tundmine suurepärane. 91-100%."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "A - Silmapaistev ja eriti põhjalik aine nii teoreetilise kui ka rakendusliku sisu tundmine, vaba ja loov õpitulemuste rakendamise oskus, ulatuslik iseseisev töö, mitmekülgne erialakirjanduse tundmine. Aine mahust on omandatud 91-100 protsenti.\nB - õppeaine teoreetilise ja rakendusliku sisu väga hea tundmine õppeprogrammi ja õpikute mahus, väga hea õpitulemuste rakendamise oskus. Eksamil on ilmnenud mittesisulised ja mittepõhimõttelised eksimused. Aine mahust on omandatud 81-90 protsenti.\nC - Õppeaine teoreetilise ja rakendusliku sisu hea tundmine, hea õpitulemuste rakendamise oskus. Aine sügavamates ja detailsemates osades avaldub mõningane ebakindlus ja eksamivastuste ebatäpsus. Aine mahust on omandatud 71-80 protsenti.\nD - Õppeaine olulisemate teoreetiliste ja rakenduslike printsiipide, faktide ja meetodite tundmine ning nende rakendamise oskus tüüpolukordades, kuid eksamivastustes avalduvad märgatavad puudujäägid ning ebakindlus. Rahuldavat hinnet tuleb lugeda küllaldaseks õppeprotsessi normaalse jätkamise seisukohalt. Aine mahust on omandatud 61-70 protsenti.\nE - Üliõpilane on omandanud miinimumteadmiste taseme, kuid nende teadmiste rakendamisel esineb tõsiseid puudujääke, mis osutuvad takistuseks antud ainele põhinevate järgnevate õppeainete omandamisel. Aine mahust on omandatud 51-60 protsenti.\nF - Üliõpilasel puudub teadmiste miinimumtase. Aine mahust on omandatud 0-50 protsenti."}}], "grade_preconditions": {"et": "Enne eksamit iseseisvate tööde õigeaegne esitamine, grupitöö esitlemine viimasel loengul. Puuduste kõrvaldamine kokkuleppel õppejõuga enne viimast loengut. "}, "grade_evaluation": {"et": "Õppeaine lõpphinne kujuneb kõikide nõutud kodutööde ja eksamitöö summana:\n1) kodutöö nr 1 (individuaalne) - 30%;\n2) kodutöö nr 2 (individuaalne) - mitteeristav hindamine;\n3) kodutöö nr 3 (individuaalne) - 10%;\n4) kodutöö nr 4 (grupitöö) - 30%;\n5) kirjalik lõpphindamine - 30%."}, "grade_conditions": {"A": {"et": "91–100%"}, "B": {"et": "81–90%;"}, "C": {"et": "71–80%;"}, "D": {"et": "61-70%"}, "E": {"et": "51-60%"}, "F": {"et": "0-50%"}, "mi": {"et": "õppeaine tegevustest osa ei võtnud ning eksamitöö on sooritamata"}}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "9525d52f-47e3-4d28-b3b1-917990245eaa", "type": "MOODLE", "code": "SVPC.03.007_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Sotsiaalministeerium. (2021). Rahvastiku tervise arengukava 2020-2030 (lk 30-38). https://www.sm.ee/sites/default/files/content-editors/Tervishoid/rta_05.05.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Eesti arstieetika koodeks . (2009). Eesti Arst, 88(1), 7475. https://ojs.utlib.ee/index.php/EA/article/view/10634"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Maailma Arstide Liit. (2007). Arstieetika käsiraamat (lk 20-61). https://www.arstideliit.ee/wp-content/uploads/2011/10/arstieetika_raamat.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Reim, A. (2023). Esmatasandi tervishoiu arengukava sotsiaalsüsteemi vaatest. Sotsiaaltöö, (4). https://www.tai.ee/et/sotsiaaltoo/esmatasandi-tervishoiu-arengukava-sotsiaalsusteemi-vaatest"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Erm, R. (2023). Mis juhtuks, kui meditsiini- ja sotsiaalvaldkonna terminoloogias tehtaks koostööd? Sotsiaaltöö, (4), 35-39. https://www.tai.ee/et/sotsiaaltoo/mis-juhtuks-kui-meditsiini-ja-sotsiaalvaldkonna-terminoloogias-tehtaks-koostood"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}, {"name": {"et": "Eestis koostatud ravijuhendite baas: https://www.ravijuhend.ee/tervishoiuvarav/juhendid"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Rahvusvaheline Õdede Nõukogu. (2021). Rahvusvahelise Õdede Nõukogu eetikakoodeks õdedele – täiendatud 2011  https://www.ttk.ee/public/Eestikeelne_oe_eetikakoodeks.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Arstivanne. https://www.arstideliit.ee/wp-content/uploads/2011/10/arstivanne.pdf"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "a9a63e5b-7b80-200d-2885-5d10aeb458d9", "person_name": "Anna-Liisa Delgado", "structural_unit": {"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-44"}, "entries": [{"course_week": 26, "time": "2025-03-01", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Aine läbimise tingimused. Sissejuhatus tervishoiu sotsiaaltöösse. Meditsiini ja sotsiaaltöö integratsioon Eestis. Eetilised põhimõtted tervishoius."}}, {"course_week": 30, "time": "2025-03-29", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Tervishoiu meeskondadega töötamine. Tervishoiu valdkondades heaoluga seotud psühhosotsiaalsed tegurid. Erinevate sihtrühmade vajadused terviseseisundist lähtuvalt."}}, {"course_week": 34, "time": "2025-04-25", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Hindamisvahendite kasutamine patsientidega. Sekkumiste planeerimine ja rakendamine erinevates tervishoiu valdkondades. Ressursside planeerimine. "}}, {"course_week": 38, "time": "2025-05-23", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "„Sotsiaaltöötaja kasutegurid meditsiinis“ ettekanded veebis"}}]}, "registration_info": {"audience": {}, "min_students": 15}, "parent_uuid": "76e10afc-b23b-84f9-1c6a-ebc09c04408f", "parent_code": "SVPC.03.007", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}