{"uuid": "bc32dac8-4a07-6211-0481-00270756353f", "code": "SVPC.01.025", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T15:19:48", "title": {"en": "Business Environment and Innovation", "et": "Ettevõtluskeskkond ja innovatsioon"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "External environment of a business and its formation. Key factors influencing entrepreneurship and their relevance on an example of a specific organization.  Principles of entrepreneurship policy in Estonia and the EU. Business support system in Estonia. The essence of innovation and its role in the society and business activity.", "et": "Ettevõtet ümbritsev keskkond ning selle kujunemine. Ettevõtlust mõjutavad tegurid ning nende olulisus konkreetse organisatsiooni näitel. Ettevõtluspoliitika põhimõtteid nii Eestis kui ka Euroopa Liidus. Ettevõtluse tugisüsteem Eestis. Innovatsiooni olemus ning roll ühiskonnas ja ettevõtluses."}, "objectives": [{"en": "The course aims to provide the knowledge about business environment (incl. external environment of business and its formation), and the key factors that influence the operation of a business, the relationship between economic policy and development of businesses, entrepreneurial behaviour, innovation and its role in business activity and society.", "et": "Anda teadmiseid ettevõtluskeskkonnast ja ettevõtlust mõjutavatest põhiteguritest, majanduspoliitika ja ettevõtluse arengu seosest, ettevõtlikust käitumisest, innovatsioonist ning selle rollist ettevõtluses ja ühiskonnas."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) analyses micro- and macroeconomic factors of the business environment in the context of a specific organization;", "et": "1) analüüsib ettevõtluskeskkonna mikro- ja makromajanduslikke tegureid konkreetse organisatsiooni kontekstis;"}, {"en": "2) knows the principles of entrepreneurship policy in Estonia and the EU;", "et": "2) tunneb ettevõtluspoliitika põhimõtteid nii Eestis kui ka Euroopa Liidus;"}, {"en": "3) understands the Estonian national business support system and is able to adapt it to specific needs of an organization;", "et": "3) orienteerub Eesti riiklikus ettevõtluse tugisüsteemis ning kohandab seda konkreetse organisatsiooni vajadustega;"}, {"en": "4) understands the role of innovative entrepreneurship in the society and the role of innovation in  business processes;", "et": "4) mõistab innovaatilise ettevõtluse rolli ühiskonnas ja innovatsiooni rolli ettevõtlusprotsessides;"}, {"en": "5) understands the role of creativity in entrepreneurship, including innovation and can analyse the business issues creatively and systemically.", "et": "5) mõistab loovuse rolli ettevõtluses, sh innovatsioonis ning oskab ettevõtluses esinevaid probleeme analüüsida loovalt ja süsteemselt."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}