{"uuid": "c320bec0-f6a3-7b44-b1be-0bc942b2538a", "code": "SVPC.00.056", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T15:41:17", "title": {"en": "Basics of Law and Public Administration", "et": "Õiguse ja avaliku halduse alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course deals with the historical development of law, its place in the social system and within the regulations of social relations, the basic concepts of the legal culture of continental Europe, the system of law and its realization. The course gives an overview of the basic concepts of labor law and civil service.\nParliament. The Government of the Republic. The President of the Republic. Authorities of the executive power. Judicial system. Local government. Chancellor of Justice.  Basic concepts of public administration. Sources and basic concepts of administrative law. Principles of administrative management.\nA short historical overview of the formation of the European Union and Estonia's accession to the EU. The main decision-making processes in the EU and Estonia's participation in these. The principles of the creation and spending of the budget of the European Union. The main policies and their impact on EU developments, including the impact on Estonia.", "et": "Loengukursuse raames käsitletakse õiguse ajaloolist arengut, tema kohta sotsiaalses süsteemis ja ühiskondlike suhete regulatsioonis, mandri-euroopalikule õiguskultuurile omaseid põhimõisteid, õiguse süsteemi ja realiseerumist. Antakse ülevaade tööõiguse ja avaliku teenistuse põhimõistetest.\nRiigikogu. Vabariigi Valitsus. Vabariigi President. Täidesaatva riigivõimu asutused. Kohtute süsteem. Kohalik omavalitsus. Riigikontroll. Õiguskantsler. Avaliku halduse põhimõisted. Haldusõiguse allikad ja põhimõisted. Halduskorralduse põhimõtted.\nAntakse ülevaade Euroopa Liidu kujunemisest ning Eesti seotusest EL-ga. Kirjeldatakse peamisi otsustusprotsesse ning selgitatakse Eesti osalemist neis. Tutvustatakse Euroopa Liidu eelarve kujunemise ja kulutamise põhimõtteid. Antakse ülevaade peamistest poliitikatest ning nende mõjust Ühendusele, sh Eestile."}, "objectives": [{"en": "1. The aim of the course is to provide an understanding of the position and meaning of law and public administration within the regulations of social relations, and the ability to understand the system and basic terms of law and public administration. ", "et": "1. Õpetusega taotletakse, et üliõpilane omandaks arusaamise õiguse ja avaliku halduse kohast ja tähendusest ühiskondlike suhete regulatsioonis ning võime orienteeruda õiguse ja avaliku halduse süsteemis ja põhimõistetes."}, {"en": "2. After completing the course the student will be able to implement the knowledge of the main processes and policies of the European Union and combine these with the knowledge acquired in other courses.", "et": "2. Üliõpilane oskab rakendada omandatud teadmisi Euroopa Liidu peamistest toimimisprotsessidest ja poliitikatest ning kombineerida neid teistes õppeainetes omandatuga."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands, analyses and uses the basic concepts of law and public administration, competences and organization of constitutional institutions;", "et": "1) mõistab, orienteerub, analüüsib ja kasutab peamisi õiguse ja avaliku halduse põhimõisteid ning põhiseaduslike institutsioonide pädevusi ja töökorraldust;"}, {"en": "2) understands, analyses and uses the correct terminology of administrative management;", "et": "2) mõistab, orienteerub, analüüsib ja kasutab korrektset halduskorralduse sõnavara;"}, {"en": "3) understands, analyses and uses legal knowledge appropriate to case resolution;", "et": "3) mõistab, orienteerub, analüüsib ja kasutab juhtumilahendusele sobivaid õigusteadmisi;"}, {"en": "4) understands, analyses and uses European Union policies and operating processes, and Estonia's role in these.", "et": "4) mõistab, orienteerub, analüüsib ja kasutab Euroopa Liidu poliitikaid ja otsustusprotsesse ning Eesti rolli selles."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}