{"uuid": "cea00e61-036c-8681-174d-0632e872fac2", "code": "SVPC.01.065", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T15:38:06", "title": {"en": "Marketing and Communication in Social Media", "et": "Turundus ja kommunikatsioon sotsiaalmeedias"}, "credits": 10, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Marketing environment. Market and competition analysis. Social media platforms and their peculiarities. Marketing and communication in social media. Positioning. Brand management and brand categories. Customer relationship management. Social networks. Social media campaigns and influencer engagement. Types of Social Media Content. Communication planning and scheduling in social media. Hardware and software for creating, storing and communicating social media content. Basic principles of video editing. Evaluating the effectiveness of marketing communications.", "et": "Turunduskeskkond. Turu- ja konkurentsianalüüs. Sotsiaalmeediaplatvormid ja nende eripärad. Turundus ja kommunikatsioon sotsiaalmeedias. Positsioneerimine. Brändi juhtimine ja brändide kategooriad. Kliendisuhete juhtimine. Suhtevõrgustikud. Sotsiaalmeediakampaaniad ja mõjuisikute kaasamine. Sotsiaalmeedia sisu tüübid. Kommunikatsiooni planeerimine ja ajastamine sotsiaalmeedias. Riist- ja tarkvara sotsiaalmeedia sisu loomiseks, salvestamiseks ja kommunikeerimiseks. Videomontaaži peamised põhimõtted. Turunduskommunikatsiooni tõhususe hindamine."}, "objectives": [{"en": "To provide knowledge and skills in the creation of marketing and communication strategies for products/services in the context of personal brand-based entrepreneurship mainly in social media channels.", "et": "Anda teadmised ja oskused toodete/teenuste turundus- ja kommunikatsioonistrateegiate loomisest persoonibrändipõhise ettevõtluse kontekstis peamiselt sotsiaalmeediakanalites."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) can analyze the competitive environment, knows different competitive strategies and possible sources of competitive advantage;", "et": "1) oskab analüüsida konkurentsikeskkonda, teab erinevaid konkurentsistrateegiaid ning võimalikke konkurentsieelise allikaid;"}, {"en": "2) knows how to position and communicate a brand, including a personal brand;", "et": "2) oskab positsioneerida ja kommunikeerida brändi, sh isikubrändi;"}, {"en": "3) knows the nature and role of relationship networks and customer relationship management in sales strategy in social media channels;", "et": "3) teab suhtevõrgustike ja kliendisuhete juhtimise olemust ja rolli müügistrateegias sotsiaalmeediakanalites;"}, {"en": "4) can prepare a marketing plan based on a personal brand (company);", "et": "4) oskab koostada isikubrändipõhise (ettevõtte) turundusplaani;"}, {"en": "5) can evaluate the effectiveness of social media marketing;", "et": "5) oskab hinnata sotsiaalmeediaturunduse tõhusust;"}, {"en": "6) knows how to plan and create suitable content for social media channels;", "et": "6) oskab planeerida ja luua sotsiaalmeediakanalitesse sobivat sisu;"}, {"en": "7) knows the most important principles of video editing and related hardware and software solutions.", "et": "7) teab videomontaaži olulisemaid põhimõtteid ja seonduvaid riist- ja tarkvaralisi lahendusi."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}