{"uuid": "bc106567-5526-8d56-e0d7-a1b4ef5884bb", "code": "SVPC.01.021", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-14T09:31:17", "title": {"en": "Project Management Methods and Project Personnel", "et": "Projektijuhtimise meetodid ja projektipersonal"}, "credits": 12, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "8c79eedc-5ea6-efda-3d33-e5630d741e96", "code": "SVPC.01.027", "title": {"en": "Process and Project Management", "et": "Protsessi- ja projektijuhtimine"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-14T14:15:37"}]}, "overview": {"description": {"en": "Main topics: Project need and aims; risks and opportunities. Quality. Project scope and deliverables, phases, schedule, resources, costs, funding. Project procurement and contracts, changes, control and accountancy, initiation and closure. Project information, documentation and communication management, ICT tools and usage, incl. MS Office and MS Project. Project personnel; competences of project manager and distinctive features of human resource management in projects; using leverage; change management, conflict settlement and negotiations in projects; project team management; advantages of team work in projects; building a project team and motivation, development phases of a team, team roles; control and development of a project team, and performance assessment; new forms and trends of work; development of organisational structure and transition from ordinary to virtual work. Realization of one simple project.", "et": "Aines käsitletavad põhiteemad: Projekti vajadus ja eesmärgid; riskid ja võimalused. Kvaliteet. Projekti ulatus ja väljundid, faasid, ajakava, ressursid, kulud, rahastamine. Projektide hanked ja lepingud, muutused, kontroll ja aruandlus ning käivitamine ja lõpetamine. Projekti informatsiooni, dokumentatsiooni ja kommunikatsiooni korraldamine, IKT vahendid ja nende kasutamine, sh MS Office ja MS Project kasutamine. Projektipersonal; projektijuhi pädevused ja personalijuhtimise eripärad projektide puhul; mõjujõu kasutamine; muutuste juhtimine, konfliktide lahendamine ja läbirääkimised projektide puhul; projektimeeskonna juhtimine; meeskonnatöö eelised projektides; projektimeeskonna loomine ja motiveerimine, meeskonna arenguetapid; rollid grupis; projektimeeskonna edenemise jälgimine, arendamine ja tulemuslikkuse hindamine; uued töö tegemise vormid ja trendid; organisatsioonistruktuuri arendamine ja üleminek tavatöölt virtuaaltööle. Ühe lihtsama projekti reaalne läbiviimine."}, "objectives": [{"en": "The aim of the course is to provide the knowledge of key methods and techniques of project management, and the ability of implementing them with the help of specific software. The learners understand project personnel management theories at an average level (i.e. interpret and compare concepts and facts, and make connections), and can use various personnel management techniques.", "et": "Õpetusega taotletakse, et kursuse läbides valdab tudeng projektijuhtimise põhimeetodeid ja tehnikaid, oskab neid rakendada spetsiaalse tarkvara toel, valdab projektipersonali juhtimise teooriat kesktasemel (st mõistete ja faktide tõlgendamine ja võrdlemine, seoste loomine) ning oskab kasutada mitmekesiseid personalijuhtimise töövõtteid."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the key processes, methods, phases, artefacts and techniques of project management;", "et": "1) teab projektijuhtimise põhiprotsesse, meetodeid, etappe, artefakte ja tehnikaid;"}, {"en": "2) is able to plan scope, time and resources for project;", "et": "2) oskab plaanida projekti ulatust, ajakava ja ressursse;"}, {"en": "3) knows how plan communication, risk, quality, reporting etc in projects;", "et": "3) tunneb projekti kommunikatsiooni, riski, kvaliteedi, aruandluse jms nõudeid;"}, {"en": "4) applies his/her knowledge and skills in the planning and execution of a non-complex project using, among other things, special project management software;", "et": "4) rakendab neid teadmisi ja oskusi mittekompleksse projekti kavandamisel ja teostamisel kasutades selleks mh projektijuhtimise spetsiaalset tarkvara;"}, {"en": "5) has knowledge of the competences of the Estonian project management professional standard, analyzes himself and plans self-development;", "et": "5) omab teadmisi Eesti projektijuhtimise kutsestandardi kompetentsidest (pädevusmudelist), analüüsib ennast ning kavandab enesearengut;"}, {"en": "6) takes into account the development stages of the project staff and the specifics of managing virtual teams and potential sources of stress and conflict in projects;", "et": "6) arvestab projektipersonali arenguetappidega ning virtuaalsete meeskondade juhtimise eripäradega ning potentsiaalsete stressi ning konflikti allikatega projektides;"}, {"en": "7) can analyze and develop organizational structure to meet the needs of project and/or virtual work;", "et": "7) analüüsib organisatsioonistruktuuri ja arendab selle vastavaks projekti- ja/või virtuaaltöö vajadustele;"}, {"en": "8) can recruit and choose members for a project team to make it work efficiently.", "et": "8) kujundab projektimeeskonna töökultuuri, tagamaks selle töö tulemuslikkust."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}