{"uuid": "9db65696-0383-6f36-a190-dcd8e68c6faf", "code": "SVPC.01.060", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Design Thinking", "et": "Disainmõtlemise alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Introduction to design; the nature and methods of the design process, principles of design thinking; team building, initial task specification, drawing up a timetable and a work plan; customer journey, environmental analysis, target group research; mapping interest groups, persona development; affinity chart; synthesising information, analysing the lifestyle of a persona; segmentation; the nature of prototyping and versions of prototypes. Creative methods; testing and modifying prototypes; business model, service plan, preparation of an organisation for introducing a prototype to the masses.", "et": "Sissejuhatus disaini; disainiprotsessi olemus ja meetodid, disainmõtlemise põhimõtted; meeskondade moodustamine, lähteülesende konkretiseerimine, ajakava ja tööplaani koostamine; klienditeekond, keskkonna analüüs, sihtrühmauuringud; huvigruppide kaart, persoona koostamine; afiinsusdiagramm; info sünteesimine, persoona elustiili analüüs; segmenteerimine; protoüüpimise olemus ja prototüüpide versioonid. Loovmeetodid; prototüüpide testimine ja muutmine; ärimudel, teenindusplaan, organisatsiooni ettevalmistamine prototüübi pakkumiseks massidele (finantsid, personal, turundus, protsessid jne.); ärimudeli/tegevusmudeli analüüs."}, "objectives": [{"en": "To give an overview of the development of design and its impact on the development of society and entrepreneurship. To develop skills and use design thinking and management techniques in organizational development and to design a prototype of a product or service. During the course, student teams will solve specific practical tasks from organizations outside of the university.", "et": "Anda ülevaade disaini arengust ning mõjust ühiskonna ning ettevõtluse arengule. Arendada oskusi, kasutada disainmõtlemise ja -juhtimise võtteid organisatsiooni arendamisel ning disainida praktiliselt toote- või teenuse prototüüp. Aine raames rakendavad tudengid disainiprotsessi kohta omandatud teadmisi, lahendades konkreetseid ülikooli välistelt organisatsioonidelt tulnud praktilisi ülesandeid või valides ise disainiprojekti lähteülesandeks väljakutse. Praktiliste ülesannete lahendamine toimub nii ülikoolis kui ülikoolivälistes organisatsioonides."}], "learning_outcomes": [{"en": "After completing the course the student will:\n1) knows design thinking terminology;\n2) implements design thinking principles in leading design projects;\n3) knows links between design and business model and strategic management;\n4) analyses organsiational value proposition from user perspective and develops perona profile;\n5) knows (service)design process and creates service design project plan and design brief according it;\n6) chooses between different (service) desin methods and uses typical ones in design process;\n7) creates based on design brief design solution.", "et": "Õppeaine läbinud õppija:"}, {"et": "* teab disainivaldkonna termineid\n* oskab disainiprojekti juhtimisel kasutada disainmõtlemise põhimõtteid (kaasamine, teenuse terviklikkus jmt)\n* teab disaini seoseid organisatsiooni tegevusmudeli ning strateegilise juhtimisega\n* oskab analüüsida organisatsiooni väärtuspakkumist kliendi seisukohast ning koostada tüüpkliendi profiili (persoonat)\n* teab (teenuse)disaini protsessi etappe ning oskab planeerida teenusearendusprojekti ajakava ning koostada lähteülesannet\n* oskab valida erinevate (teenuse)disaini meetodite vahel ning kasutada tüüpilisemaid (teenuste)disaini meetodeid/tööriistu disainiprotsessis\n* töötab välja lähteülesande põhjal disainilahenduse"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}