{"uuid": "a0052292-db2d-abff-8085-baae11211cbf", "code": "sv-2024-spring-openuniv-p2", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-24T16:58:07", "title": {"en": "Personal and Professional Development", "et": "Isiklik ja professionaalne areng"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "2", "et": "2. osa", "en": "part 2"}, "part_credits": 3, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "label": {"en": "24/25 S block mode part 2 3 CP SV", "et": "24/25 K SÕ 2. osa 3 EAP SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 2, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "1. Coaching vs. mentoring. The nature and different types of coaching. Principles and focuses of coaching leadership. The actions of the coaching leader. Inividual coaching.\n2. Discussing independent homework. My successes and my learning curves. \n3. The GROW model - the model most used in coaching. Asking effective questions and listening actively. GROW model practice.\n4. Group coaching experiment, reports and homework discussion. Recalling the GROW model. \n5. Group coaching process and methods. The impact of GC on my development and skills; how can I use coaching techniques in my daily work?\n", "et": "1. Karjääri olemus, komponendid ja müüdid ning selle sidumine professionaalse arenguga. Coaching vs mentorlus. Coachingu olemus ja erinevad tüübid. Coachiva juhtimise põhimõtted ja fookused. Coachiva juhi tegevused. Individuaalne coaching.\n2. Karjäärialane kodutöö koostöös grupikaaslasega ja nende arutamine (vt moodle). Minu õnnestumised ja õpikohad. \n3. GROW mudel - coachingu põhimõtted ja mudelid. Tõhusate küsimuste küsimine ja aktiivne kuulamine. GROW mudeli kasutamise harjutamine.\n4. Grupicoachingi eksperiment ja kodutöö koostöös grupikaaslasega (üksinda pole lubatud seda teha; vt moodle). GC tulemuste reflekteering (sh GROW mudel). \n5. Grupicoachingu protsess ja meetodid. GC mõju minu arengule ja oskustele; kuidas kasutada coachingu võtteid igapäevatöös?"}, "objectives": [{"en": "Helping students learn to understand and make sense of their personal and professional development as members of the learning community in the context of university studies.", "et": "Aidata tudengil õppida mõistma ja mõtestama enda isiklikku ja professionaalset arengut õpikogukonna liikmena ülikooliõpingute kontekstis."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "Understand the nature, components and myths of careers and relate them to their professional development and career", "et": "Mõistab karjääri olemust, komponente ja müüte ning seostada neid oma professsionaalse arengu ja karjääriga"}, {"en": "Knows the principles and methods of coaching leadership and the possibilities of their implementation", "et": "Tunneb coachiva eestvedamise põhimõtteid ja meetodeid ning nende rakendamise võimalusi"}, {"en": "Can use the GROW model in employee development and conversation management", "et": "Oskab kasutada GROW mudelit töötajate arendamisel ja vestluse juhtimisel"}, {"en": "Knows the process and main techniques of co-vision and group coaching methodology", "et": "Tunneb kovisiooni ja grupicoachingu metoodika protsessi ning peamisi tehnikaid"}, {"en": "Can manage a group coaching session", "et": "Oskab juhtida grupicoachingu sessiooni"}, {"en": "Can analyze and reflect on personal and other professional development and careers", "et": "Oskab analüüsida ja reflekteerida isiklikku ja teiste professionaalset arengut ja karjääri"}], "notes": {"et": "Sihtrühm TDJ1"}}, "grading": {"independent_work": {"et": "Esitada kaks kodutööd koostöös grupikaaslasega. Esimene kodutöö koostage koostöös grupikaaslasega (valige endale tiimikaaslane) ja laadige see õppeaine moodlesse teemal: Isikliku professionaalse karjääri komponendid ja müüdid (vt nõuded moodlest). \nTeine kodutöö koostage koostöös grupikaaslasega grupicoachingu (GC) eksperimendi tulemuste põhjal (GC seminaris omandatud metoodika põhjal; nõuded vt moodlest). GC seminariks tuleb koostada koostöös tiimikaaslasega tööjuhtum (TJ) oma või tiimikaaslase organisatsioonis õppeainega seonduval teemal (ca pool lk; teemat pole vaja õppejõuga kooskõlastada). Järgneva nädala-paari jooksul tuleb läbi viia GC eksperiment koos tiimikaaslasega oma või tiimikaaslase organisatsioonis ning koostada ühine kodutöö (üksinda pole lubatud eksperimenti ja kodutööd teha). Kodutöö teoreetiline osa (2 lk) peab olema koostatud vähemalt kuue GC (sh kolme GC 2024. ja 2025. a. avaldatud) teadusallika põhjal ning olema analüüsiv ja sünteesiv + praktiline osa (3 lk) esitage GC eksperimendi aruandena + lisad (näidisfailide põhjal). Täpsem juhend vt moodles (sh näidiskodutöö)."}, "grade_preconditions": {"et": "Esitada kaks kodutööd koostöös grupikaaslasega. Esimene kodutöö koostage koostöös grupikaaslasega teemal: Isikliku professionaalse karjääri komponendid ja müüdid (vt nõuded moodlest). Teine kodutöö koostage koostöös grupikaaslasega grupicoachingu (GC) eksperimendi tulemuste põhja (nõuded vt moodlest). Puudumise korral tuleb koostada täiendav kodutöö (täpsemalt vt moodlest). GC seminarist osavõtt kohustuslik.\nAine on võimalik sooritada jooskvalt kui kõik ülesanded ja kodutööd on nõuetekohaselt täidetud. Neile, kes pole nõuetekohaselt oma kodutöid esitanud ja vähemalt kahes seminaris osalenud (sh kohustuslikus GC seminaris), toimub suuline arvestus kokkuleppel õppejõuga. Kordamisküsimusteks on loenguslaidid."}, "grade_evaluation": {"et": "Arvestuse eelduseks on kodutööde esitamine ja õppetööl osalemine."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "4b872d40-5d04-4acc-b818-215ebdf7ae69", "type": "MOODLE", "code": "SVPC.01.019_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "KOHUSTUSLIKUD ÕPPEMATERJALID. Soovituslikud õppematerjalid on moodles.\n\nTürk, K. 2025. Slaidid ja õppematerjal."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": " Saue, K., Türk, K. 2024. GC metoodika."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Türk, K., Saue, K. 2021. Töötajate arendamine ja grupikootsing: Selle võimalused ja tulemuslikkus. Akadeemia, 3."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Kulno Türk. Video 2019. Tagasisidestamine ja arendamine."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": " Daniel Pink. Video. Motiveerimine."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}, {"name": {"et": "Õppimine-areng (6 pt). PARE 2020."}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": false}]}, "participants": {"lecturers": [{"person_uuid": "4a66c600-c2de-e0f4-46db-cd6da486f0e2", "person_name": "Kulno Türk", "structural_unit": {"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-44"}, "entries": [{"course_week": 24, "time": "2025-02-16", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Töötajate ootused, arendamine ja karjäär."}, "description": {"et": "Töötajate ootused, arendamine ja karjäär. Karjääri komponendid ja müüdid. Agiilne tagasisidestamine. Õppiv organisatsioon ja isiklik areng. Aja juhtimine töökohal. Väljavõtted GLS videotest.\nSeminariks palun:\n1. Tutvuge ja mõelge läbi K. Türk (2025) vastavad slaidid.\n2. Tutvuge: Õppimine-areng (6 pt). PARE 2020.\n3. Vaadake K. Türk videot. Tagasisidestamine ja arendamine.\n4. Koostage 3 leheküljeline kodutöö koostöös grupikaaslasega (valige endale tiimikaaslane) ja laadige see õppeaine moodlesse teemal: Isikliku professionaalse karjääri komponendid ja müüdid. Karjääri alases kodutöös keskenduge erinevate käsitluste analüüsile ning siduge see oma kogemustega. Allikad viidake (autor, aasta) korrektselt. AI kasutamine on lubatud, aga seda tuleb samuti viidata (vt AI kasutamise ja viitamise juhend). "}}, {"course_week": 32, "time": "2025-04-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "Grupicoachingu metoodika omandamine"}, "description": {"et": "Grupicoachingu (GC) metoodika omandamise seminar, osavõtt kohustuslik (kahes rühmas; rühmad koostatakse esimeses seminaris).\nKoostage seminariks koostöös tiimikaaslasega üks pooleleheküljeline tööjuhtum (TJ) õppeainega seonduval teemal oma või tiimikaaslase organisatsioonis (teemat pole vaja õppejõuga kooskõlastada; üksinda pole lubatud seda teha). Esitage TJ moodles hiljemalt 24 tundi enne seminari (TJ kohta antakse kirjalik tagasiside). TJ peab olema seotud tiimiliikme tööga ning olema tema  (juhtumi omaniku; JO) mõjuväljas. TJ valikul sõnastage esmalt selle eesmärk, siis näete, kas see TJ on lahendatav 90-120 minutiga teie organisatsiooni töögrupis. Kui võtate väga laia TJ, siis pole seda võimalik ühe GC käigus lahendada. TJ-ks ei sobi tiimisisene konflikt. Seminaris valime ühe TJ, mida hakkame arutama GC metoodikaga. Pärast seminari on võimalik oma TJ ümber disainida.\nSeminarile järrel (soovitavalt nädala/kahe jooksul) tuleb läbi viia TJ arutelu (eksperiment) oma või tiimikaaslase organisatsioonis GC metoodikaga ja koostada selle põhjal ühine kodutöö (üksinda pole lubatud eksperimenti ja kodutööd teha; vt kodutöö nõuded).\nGC kodutöö tuleb laadida moodlesse või saata õppejõule (kui soovite tagada kodutöö konfidentsiaalsuse) hiljemalt ...\n1. Tutvuge ja mõelge läbi K. Türk (2025) GC slaidid.\n2. Lugege Türk, K., Saue, K. 2021. Töötajate arendamine ja grupikootsing: Selle võimalused ja tulemuslikkus. Akadeemia.\n3. Tutvuge Saue-Türk. 2024. GC metoodika.\n4. Valmistage ette kuni pooleleheküljeline tööjuhtum (TJ) õppeainega seonduval teemal oma või tiimikaaslase organisatsioonis (TJ ei pea õppejõuga kooskõlastama)"}}, {"course_week": 36, "time": "2025-05-09", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"et": "GC reflektsioon, tagasisidestamine ja osalev juhtimine/eestvedamine"}, "description": {"et": "GG reflektsioon (kodutööd esitlemisele ei tule, neile antakse kirjalik tagasiside).\nOsalev juhtimine, koostöö ja arendamine. Pink ja Holmström videote arutamine. Eesti parimate juhtide eestvedamispraktika.\nSeminariks:\n1. Koostage koostöös tiimikaaslasega GC eksperimendi põhjal kodutöö (vt nõuded moodlest) ning esitage see hiljemalt 48 tundi enne seminari moodles või õppejõule meili teel (kui soovite tagada selle konfldentsiaalsuse).\n2. Lugege ja mõelge läbi K. Türk (2025) slaidid.\n3. Vaadake Daniel Pink ja Bengt Holmström videoid (ja/või slaide) ning tehke enesetunnetustestid."}}]}, "registration_info": {"audience": {}, "min_students": 15, "max_students": 18}, "confirmation_process": {"confirmation_uuid": "c130af51-e534-d7f9-2379-68b00f116311", "state_code": "COMPLETED", "is_paused": false}, "parent_uuid": "14c47013-3f4b-97a5-487b-2cac4f4fb2b1", "parent_code": "SVPC.01.019", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}