{"uuid": "c17a3f2e-23f0-36da-8beb-d6d3eeff7d66", "code": "SVPC.00.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T13:14:29", "title": {"en": "Social Work in a Multicultural Community", "et": "Sotsiaaltöö mitmekultuurilises kogukonnas"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Globalisation and it`s influence to social work. Cultural diversity and the challange to social work. Definition of multiculture and the development of this approach. Social justice. Main principles of multicultural social work. Defining cultural competence in social work practice. The attitudes and beliefs that are supporting working in multicultural context. The ethics. Culturally appropriate knowledge and skills required for effective social work with multicultured community. Estonian and European Union legislation of migration, refugees; integration programmes in EU.", "et": "Globaliseerumine ja selle mõju sotsiaaltööle. Kultuuriline mitmekesisus kui väljakutse sotsiaaltööle. Mitmekultuurilisuse definitsioon ja selle ideoloogia areng. Sotsiaalse õigluse mõiste globaalses maailmas. Multikultuurilise sotsiaaltöö põhimõtted. Kultuuriline kompetentsus kui professionaalsuse tunnus. Kultuuriliselt mitmekesise kogukonnaga töötamist soodustavad uskumused ja hoiakud. Eetika. Praktiline töö mitmekultuurse grupiga, kogukonnaga, selleks vajalikud teadmised, oskused. Üksikisiku vajadused uues kultuuriruumis, riskirühmade diskrimineerimine rassi, rahvuse, usu ja seksuaalse sättumuse alusel. Eesti ja Euroopa migratsiooni- ja sotsiaalpoliitika ning riiklikud integratsiooniprogrammid. Ametkondade ja riikide vaheline koostöö pagulaste, varjupaigataotlejate, vähemusrahvuste jt vähemuste ja riskirühmade abistamiseks."}, "objectives": [{"en": "The main aim is to give knowledge and skills to do social work in multicultural society and community.", "et": "Anda osalejatele teadmisi ja oskusi kultuuriliselt mitmekesise kogukonnaga töötamiseks."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) has obtained a general understanding of globalization and its impact on people's lives;", "et": "1) mõistab globaliseerumise mõju inimeste igapäevaelule ning riskirühmade toimetulekule;"}, {"en": "2) has obtained a general understanding of culture and social work;", "et": "2) mõistab kultuuri mõju sotsiaaltööle;"}, {"en": "3) knows what multiculturalism means in communities and groups;", "et": "3) teab, mida tähendab mitmekultuurses kogukondades ja gruppides;"}, {"en": "4) understands social justice and its use in research of inequality;", "et": "4) teab, mis on sotsiaalne õiglus, selle erinevaid käsitlusi poliitikas ja rakendamist ebavõrdsuse uurimisel;"}, {"en": "5) understands ethics;", "et": "5) mõistab eetikaga seotud väljakutseid;"}, {"en": "6) understands Estonian and European Union migration policies, integration programmes and strategies;", "et": "6) orienteerub Eesti ja EL migratsioonipoliitikas, integratsiooniprogrammides ja -strateegiates;"}, {"en": "7) has the ability to analyse the challenges and solutions in multicultural communities;", "et": "7) oskab analüüsida mitmekultuurse kogukonna peamisi väljakutseid ja lahendusi;"}, {"en": "8) is able to analyse discriminations and propose solutions;", "et": "8) oskab analüüsida diskrimineerimisega seotud probleeme ja võimalikke lahendusi;"}, {"en": "9) has the ability to use main methods to work in multicultural communities;", "et": "9) oskab kasutada peamisi meetodeid mitmekultuurse grupi, kogukonna ja üksikisikutega töötamiseks;"}, {"en": "10) is able to find solutions in situations where are involved citizens from different countries.", "et": "10) leiab lahendusi seadusandluses lahendamaks sotsiaalseid probleeme situatsioonides, kus on tegemist erineva kultuurilise taustaga osapooltega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}