{"uuid": "010dcd0c-5220-b048-7ed8-a5a33468d6d1", "code": "sv-2024-autumn-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-31T21:09:34", "title": {"en": "Counselling Skills", "et": "Nõustamisoskused"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course gives an overview of the basics of counselling, opportunities to apply counselling in social work and rehabilitation, practical acquisition of basic techniques for primary counselling.\nTopics: \nProcess and basic principles of counselling. Personality and professional skills of the counsellor. Professional ethics of a counsellor. Factors influencing counselling process. Basic counselling theories (basic concepts, key concepts, basic techniques). Basic counselling techniques applied in social work (active listening).", "et": "Kursus keskendub ülevaate andmisele nõustamise põhimõtetest, nõustamise protsessi üheksast etapist, personaalsest taastumisest ja inimese toimevõimekuse arengust ning nõustamiseks vajalikest suhtlemisoskustest ning nõustamise rakendamise võimalustest sotsiaaltöös ja rehabilitatsioonis.\nKäsitletavad teemablokid: \nNõustamise põhimõtted ja nõustamise protsessi üheksa etappi. Nõustamise erisus sotsiaaltöös ja rehabilitatsioonis. Nõuded ja ootused nõustajale. Nõustamist mõjutavad tegurid. Nõustamise baasteooriad (põhimõisted, võtmekontseptsioonid, baastehnikad)."}, "objectives": [{"en": "The course is designed to develop a conceptual understanding of using counselling in social work and rehabilitation and shape core counselling skills.", "et": "Kursuse eesmärk on omandada teadmised nõustamise põhimõtetest, etappidest, toimevõimekuse arengust ja omandada esmased oskused nõustamisprotsessi läbiviimiseks sotsiaaltöö ning sotsiaalse rehabilitatsiooni klienditöös."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands basic principles of counselling;", "et": "1) teab nõustamise põhimõtteid;"}, {"en": "2) knows counselling application areas;", "et": "2) teab nõustamise rakendusvaldkondi;"}, {"en": "3) is familiar with the process of counselling;", "et": "3) teab nõustamisprotsessi etappe;"}, {"en": "4) is aware of the limits of counselling intervention (incl ethical aspects);", "et": "4) on teadlik nõustamise kui sekkumismeetodi piirangutest (sh eetilistest aspektidest);"}, {"en": "5) is aware of client-centered approach in counselling;", "et": "5) teadvustab kliendikeskse töö põhiprintsiipe (kliendi enesemääramisõiguse tunnustamine, kliendist lähtumine protsessi kõikides etappides jne);"}, {"en": "6) is familiar with common counselling theories;", "et": "6) teab ja eristab peamisi nõustamisteooriatel põhinevaid lähenemisi;"}, {"en": "7) is able to identify and analyze the factors affecting the process of counselling;", "et": "7) oskab määratleda ning analüüsida nõustamisprotsessi mõjutavaid tegureid;"}, {"en": "8) has active listening skills;", "et": "8) tunneb aktiivse kuulamise oskuseid;"}, {"en": "9) is able to support client activity at different stages of the counselling process;", "et": "9) teab, kuidas toetada kliendi aktiivsust nõustamise üheksas etapis;"}, {"en": "10) understands the importance of the process of self-reflection in the professional setting;", "et": "10) mõistab eneserefleksiooni olulisust nõustamise töös;"}, {"en": "11) knows modern professional vocabulary in English and Estonian.", "et": "11) tunneb kaasaegset erialast sõnavara eesti ja inglise keeles."}], "notes": {"et": "Sihtrühm SRSÕ3"}}, "grading": {"independent_work": {}, "independent_work_assessments": [{"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "1. Teoreetilised teadmised\nE - Teoreetilised teadmised on omandatud minimaalsel tasemel ja üliõpilane suudab rääkida nõustamise teemadel, orienteerub ainekursusel läbitud teemades.\nD - Teoreetilised teadmised on omandatud piisaval tasemel ja üliõpilane suudab selgitada teoreetiliste lähenemiste erinevaid aspekte. \nC - Teoreetilised teadmised on omandatud heal tasemel ja üliõpilane räägib vabalt teoreetiliste lähenemiste erinevatest aspektidest, kuid kohati on ebatäpsusi või on teatud aspektid ununenud.\nB - Teoreetilised teadmised on omandatud väga heal tasemel ja üliõpilane räägib vabalt teoreetiliste lähenemiste erinevatest aspektidest.\nA - Teoreetilised teadmised on omandatud suurepärasel tasemel ja üliõpilane räägib vabalt teoreetiliste lähenemiste erinevatest aspektidest ning teab uuemaid lähenemisi,  suudab analüüsida lähenemiste erinevusi ja sarnasusi.\n\n2. Baasoskused (psühholoogilise kontakti loomine ja hoidmine, aktiivse kuulamise oskused, nõustamise etappide tegevuste ja aktiivse kuulamise oskuste kohane ja sobiv koos rakendamine)\nE - Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks hädavajalikul määral ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise lihtsamate oskuste kasutamist.\nD - Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks piisaval määral ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste kasutamist.\nC - Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks heal tasemel ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste head kasutamist.\nB - Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks väga heal tasemel ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste väga head kasutamist.\nA - Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks suurepärasel tasemel. Oskuste kasutamisel on üliõpilane paindlik, loov ja näitab kiiret reageerimisvõimet. Eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste suurepärast kasutamist.\n\n3. Küsimustele vastamise tase (eksamil)\nE - Üliõpilane suudab eksamil anda enamusele küsimustest mingi vastuse. \nD - Üliõpilane suudab eksamil sisuliselt vastata enamikule esitatud küsimustele, kuid sisuline arutlus on vähene. \nC - Üliõpilane suudab eksamil sisuliselt vastata kõigile esitatud küsimustele. \nB - Üliõpilane annab eksamil kõigile esitatud küsimustele sisukad vastused ning orienteerub hästi antud teemavaldkonnas. \nA - Üliõpilane annab eksamil esitatud küsimustele põhjalikud ja sisukad vastused ning orienteerub suurepäraselt teemavaldkonnas."}}], "grade_preconditions": {"et": "Osalemine loengutes 75% ulatuses."}, "grade_evaluation": {"et": "Hindamisel arvestatakse suulise eksami tulemust. Tulemuse arvestamise aluseks on hindamiskriteeriumid."}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "6c55b6b7-1fbf-4df7-ac90-f4a502761195", "type": "MOODLE", "code": "SVPC.03.020_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "99a50819-dc35-872a-5e00-d3dcf8d33004", "person_name": "Dagmar Narusson", "structural_unit": {"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true}], "assistants": ["260653cd-7a7d-5412-9d6a-4e45fed76ec3"]}, "schedule": {"weeks": {"et": "1-23"}, "entries": [{"time": "2024-09-18", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Nõustamise protsess"}, "description": {"et": "Nõustamise põhimõtted.  Nõustamise 9 etapi ülevaade. Nõustamise 1 etapi eesmärk ja tegevused. Esimese õpipäeviku ülesande tutvustamine. Kohalolu põhimõtete rakendamine. "}}, {"time": "2024-09-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Nõustamise protsessi neli esimest etappi"}, "description": {"et": "Nõustamise eetika. Peamised nõustamisteooriad. Inimesega toimuvad protsessid: haavatavus. Personaalne taastumine. Toimevõimekus ja selle arendamine. Nõustamise nelja esimese etapi õppimise protsess. Nõustamise 2.-4. etapi eesmärk ja tegevused. Teise õpipäeviku ülesande tutvustus."}}, {"time": "2024-11-14", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Nõustamise protsessi viies ja kuues etapp"}, "description": {"et": "Empaatia olemus. Avatud Dialoogi põhimõtted. Kuulamisvastuste kasutamise harjutamine. Nõustamise 5.-7. etapi eesmärk ja tegevused. Nõustamisprotsessi oskuste harjutamine ja analüüs. "}}, {"time": "2024-11-17", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {"et": "Nõustamise 8.-9. etapi eesmärk ja tegevused"}, "description": {"et": "Nõustamisoskuste harjutamine.\nEksamiks valmistumise arutelu."}}, {"time": "2024-12-11", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {"et": "Suuline vastamine (eksamihinde saamiseks kohustuslik osa)"}, "description": {"et": "Eksamile saamiseks tuleb osaleda 75% loengutest. Osalemine tähendab kaasa töötamist, loengutes küsimustele vastamist, õppeprotsessi juurde kuuluvate harjutuste tegemist."}}]}, "registration_info": {"audience": {}}, "parent_uuid": "8c80f452-8c0b-1128-0a92-cd45a6b59cdd", "parent_code": "SVPC.03.020", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}