{"uuid": "8c3bb422-9037-c882-fc1f-9d5a04446213", "code": "sv-2024-spring-openuniv", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-15T09:16:14", "title": {"en": "Wellness and Health Tourism", "et": "Heaolu ja terviseturism"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S block mode SV", "et": "24/25 K SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolled"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 6, "practice": 12, "seminar": 6, "independent_work": 0, "individual_work": 80, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The concept of wellbeing (welfare, wellbeing, wellness). Society, country and economy of welfare. International models for measuring and evaluating welfare and quality of life. Approaches to health. Concept of holistic wellness. Dimensions and energy of wellness. Measuring and evaluating personal wellbeing. Wellness business, products and services. \nApproaches to health tourism, development and future trends. Framework and forms of health tourism: medical, spa, and wellness. The expectations, needs and wishes of health tourists. Institutions, products, services and destinations of health tourism. Planning and preparation of the activity plan for health tourism destination.", "et": "Heaolu mõiste (welfare, wellbeing, wellness). Heaoluühiskond, -riik ja -majandus. Heaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid. Tervisekäsitlused. Tervikliku heaolu kontseptsioon. (the holistic wellness concept). Heaoludimensioonid ja -energia. Isikliku heaolu mõõtmine ja hindamine. Heaoluettevõtlus, -tooted ja -teenused. Terviseturismi käsitlused, areng ja tulevikusuundumused. Terviseturismi raamistik ja alavormid: Ravi-, spaa- ja heaoluturism. Terviseturistide rühmitamine, ootused, vajadused ja soovid. Terviseturismiasutused, -tooted, -teenused ja sihtkohad. Terviseturismi sihtkoha arendustegevuste planeerimine ja tegevuskava koostamine."}, "objectives": [{"en": "1. The student acquires understanding and basic knowledge of the society and economy of welfare, knows the principles of the concept of holistic wellness and is able to follow them in promoting personal wellbeing and entrepreneurship. ", "et": "1. Õppija omandab arusaama ja põhiteadmised heaoluühiskonnast ja -majandusest, tunneb tervikliku heaolukontseptsiooni põhimõtteid ja oskab neid järgida isikliku heaolu ja ettevõtluse edendamisel. "}, {"en": "2. The student recognises the forms, products and services of health tourism, understands the expectations, needs and wishes of health tourists and is able to use the principles of the concept of holistic wellness for the development of health tourism products, services and destinations.", "et": "2. Õppija tunneb terviseturismi vorme, -tooteid ja -teenuseid, mõistab terviseturistide ootusi, vajadusi ja soove ning oskab kasutada tervikliku heaolukontseptsiooni põhimõtteid terviseturismitoodete, -teenuste ja -sihtkohtade arendamisel."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands the development factors and expressions of the society and economy of welfare;", "et": "1) mõistab heaoluühiskonna ja -majanduse arengumõjureid ja avaldusvorme;"}, {"en": "2) is aware of the concepts of health and well-being (welfare, wellbeing, wellness);", "et": "2) teab tervise ja heaolu mõiste käsitlusi (welfare, wellbeing, wellness);"}, {"en": "3) is aware of the principles of the concept of holistic wellness;", "et": "3) tunneb tervikliku heaolukontseptsiooni (holistic wellness concept) põhimõtteid;"}, {"en": "4) is able to critically analyse personal lifestyles, the determinants of wellbeing and opportunities for improvement;", "et": "4) oskab kriitiliselt analüüsida isiklikku elustiili, heaolu mõjutegureid ja parendusvõimalusi;"}, {"en": "5) is able to characterize and analyze products and services of wellness;", "et": "5) oskab iseloomustada ning analüüsida heaolutooteid ja -teenuseid;"}, {"en": "6) understands and analyzes specific aspects of health tourism business, i.e. health tourism products, services, establishments and destinations;", "et": "6) tunneb terviseturismi raamistikku ja alavorme;"}, {"en": "7) is able to group health tourists and describe their expectations, needs and wishes;", "et": "7) oskab rühmitada terviseturiste ja kirjeldada nende ootusi, vajadusi, soove;"}, {"en": "8) uses the principles of the concept of holistic wellness for the development of health tourism products, services and destinations.", "et": "8) oskab kasutada tervikliku heaolukontseptsiooni põhimõtteid terviseturismitoodete, -teenuste ja -sihtkohtade arendamisel."}], "notes": {"et": "Sihtrühm THSÕ1"}}, "grading": {"independent_work": {"et": "1.\tÕppematerjalide läbitöötamine.\n2.\tSeminaritööde (S1, S2, S3, S4) ettevalmistamine.\n3.\tP1 esitluse ettevalmistamine (rühmatöö).\n4. Aineprojekti  (P3) ettevalmistamine.\nSeminaride, praktilise õppe ja ainetöö juhendid on Moodle-s õppematerjalide kaustas eraldi failidena."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "S1. Seminar 1.  \nHeaoluühiskond ja selle areng. \nEristav hindamine, kuni 10 punkti.\nJUH S1\nSeminari ülesanded: \n1. Individuaalne kodulugemine Mark, T. (2012). Heaoluühiskond ja selle areng Eestis. TÜ, bakalaureusetöö ja kirjalike vastuste leidmine küsimustele.\n2. Seminaril osalemine ja diskussioonist osavõtt. \n\nS1. Seminari ülesannete täitmise eest võib saada kuni 10 punkti. Puudumine kahandab seminari tulemust –5 punkti. \nHindamisel arvestatakse järgmisi tegureid:\na) individuaalse kirjaliku kodutöö sisu ja tähtaegne esitamine;\nb) osavõtt ja aktiivsus seminaris.\n\n9–10 punkti:\n1)\tindividuaalne kirjalik kodutöö on sisukas, kõikidele küsimustele on leitud vastused;\n2) töö on esitatud tähtajaks;\n3) õppija võttis seminarist aktiivselt osa.\n\n7–8 punkti:\n1)\tindividuaalne kirjalik kodutöö mõningatele küsimustele vastused puuduvad või on pealiskaudsed; \n2) töö on esitatud tähtajaks;\n3) õppija võttis seminarist aktiivselt osa.\n\n5–6 punkti:\n1) individuaalne kirjalik kodutöö on pealiskaudne, mõningatele küsimustele vastused puuduvad; \n2) töö on esitatud tähtajast hiljem, kuid enne seminari toimumise kuupäeva;\n3) õppija võttis osa seminarist.\n\n1-4 punkti:\n1) individuaalne kirjalik kodutöö on enne seminari toimumist esitamata või töö ei vasta juhendi nõuetele.\n2) õppija ei võtnud seminarist osa.\n\n0 punkti: seminaris ei osalenud ja töö on esitamata."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "JUH S2. \nHeaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid.\nEristav hindamine, kuni 10 punkti (JUH S2).\nSeminari ülesanded:\n1. Rühmatöö „Heaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid“. \n2. Diskussioonist osavõtt ja rühmatööde esitlus seminaris. \n\nS2. Seminari ülesannete täitmise eest võib saada kuni 10 punkti. Puudumine kahandab seminari tulemust –5 punkti. \nHindamisel arvestatakse järgmisi tegureid:\na) rühmatöö  „Heaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid“ ettevalmistamine ja esitlus;\nb) osavõtt ja aktiivsus seminaris.\n\n9–10 punkti:\n1)\tõppija osales rühmatöö ettevalmistamisel, rühmatöö vastab valitud teemale, on sisukas, analüüsiv ja toob esile Eesti tugevused ja nõrkused heaoluühiskonnana;\n2) töö on esitatud tähtajaks;\n3) õppija võttis osa seminarist ja rühmatöö esitlusest.\n\n7–8 punkti:\n1)\tõppija osales rühmatöö ettevalmistamisel, rühmatöö vastab valitud teemale, teema esitlus ja analüüs jääb kohati pealiskaudseks, samuti Eesti tugevuste ja nõrkuste esile toomine heaoluühiskonnana;\n2) töö on esitatud tähtajaks;\n3) õppija võttis osa seminarist ja rühmatöö esitlusest.\n\n5–6 punkti: \n1)\tõppija osales rühmatöö ettevalmistamisel, rühmatöö, selle esitlus ja analüüsiv osa jäävad pealiskaudseks, samuti Eesti tugevuste ja nõrkuste esile toomine heaoluühiskonnana;\n2) õppija võttis osa seminarist ja rühmatöö esitlusest osa osaliselt;\n3) töö on esitatud tähtajaks.\n\n1-4 punkti:\n1) õppija ei osalenud rühmatöö ettevalmistamisel ja esitlusel;\n2) töö esitati tähtajast hiljem või ei vasta juhendi nõuetele;\n3) õppija ei võtnud seminarist osa.\n\n0 punkti: seminaris ei osalenud ja töö on esitamata."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "S3. Seminar 3. Isikliku heaolu mõõtmine, hindamine ja parendusvõimalused.\nEristav hindamine, kuni 10 punkti.\nJUH 2, JUH S2a (küsimustik), JUH S2b (Ain Käpp).\n\nSeminari ülesanded:\n1. Tervise, tervikliku heaolu, isikliku heaolu ja heaolutoodete ja -teenuste teoreetiliste käsitluste tundmaõppimine ja küsimustele vastamine seminaris, tuginedes loengumaterjalidele ja vähemalt kolmele kodulugemise allikale.\n2. Isikliku heaolu hindamine etteantud küsimustiku alusel\nS3. Seminari ülesannete täitmise eest võib saada kuni 10 punkti. Puudumine seminarist kahandab tulemust –5 punkti.  \nHindamisel arvestatakse järgmisi tegureid:\na) seminari diskussioonis osalemine: vastamine tervise ja heaolukontseptsiooni, isikliku heaolu ja heaolutoodete- ja teenuste teoreetiliste käsitlustega seonduvatele küsimustele ning oma arvamuste esitamine, kodulugemisel kasutatud allikate tutvustamine;\nb) individuaalse kirjaliku kodutöö „ Isikliku heaolu mõõtmine, hindamine ja parendusvõimalused“ sisukus ja tähtaegne esitamine;\nc) osavõtt ja aktiivsus seminaris.\n\n9–10 punkti:\n1) õppija oskab vastata tervise ja heaolukontseptsiooni, isikliku heaolu ja heaolutoodete- ja teenuste teoreetiliste käsitlustega seonduvatele küsimustele ning diskuteerida, õppija annab ülevaate kodulugemisel kasutatud allikatest;\n2) individuaalne kirjalik kodutöö on sisukas, eneseanalüüs on põhjalik ja ettepanekud enda tervise ja heaolu parendamiseks konkreetsed, õppija osaleb aktiivselt diskussioonis; \n3) töö on esitatud tähtajaks;\n4) õppija võttis aktiivselt seminarist osa.\n\n7–8 punkti:\n1) õppija oskab vastata tervise ja heaolukontseptsiooni, isikliku heaolu ja heaolutoodete- ja teenuste teoreetiliste käsitlustega seonduvatele küsimustele, mõningad vastused jäävad pealiskaudseks, õppija annab ülevaate kodulugemisel kasutatud allikatest;\n2) individuaalne kirjalik kodutöö jääb mõningates aspektides pealiskaudseks, eneseanalüüs ja ettepanekud enda tervise ja heaolu parendamiseks on liialt üldsõnalised, osalemine diskussioonis pigem passiivne;\n3) töö on esitatud tähtajaks;\n4 ) õppija võttis seminarist aktiivselt osa.\n\n5–6 punkti:\n1)\tõppija oskab vastata mõningatele tervise ja heaolukontseptsiooni, isikliku heaolu ja heaolutoodete- ja teenuste teoreetiliste käsitlustega seonduvatele küsimustele, mitmed vastused jäävad pealiskaudseks, õppija ülevaade kodulugemisel kasutatud allikatest jääb pealiskaudseks ja üldsõnaliseks;\n2) individuaalne kirjalik kodutöö jääb mõningates aspektides pealiskaudseks, eneseanalüüs ja ettepanekud enda tervise ja heaolu parendamiseks on liialt üldsõnalised, osalemine diskussioonis passiivne; \n3) töö on esitatud enne seminari toimumise aega;\n4) õppija võttis seminarist osa.\n\n1-4 punkti:\n1)\tõppija ei oska vastata tervise ja heaolukontseptsiooni, isikliku heaolu ja heaolutoodete- ja teenuste teoreetiliste käsitlustega seonduvatele küsimustele ning anda ülevaadet kodulugemisel kasutatud allikatest;\n2) individuaalne kirjalik kodutöö on enne seminari toimumist esitamata või ei vasta juhendi nõuetele;\n3) õppija ei võtnud seminarist osa.\n\n0 punkti: seminaris ei osalenud ja töö on esitamata."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "S4. Seminar 4.\nTerviseturismi raamistik ja alavormid.\nEristav hindamine, kuni 15 punkti. JUH S4\n\nSeminari ülesanded:\n1. Terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovide tundmaõppimine, tuginedes loengumaterjalidele ja vähemalt kolmele kodulugemise allikale. Kirjaliku kodutöö esitamine Moodle-sse 13.05. kell 20.00.\n2. 17.05. Seminarist osavõtt ja aktiivsus.\nS4. Seminari ülesannete täitmise eest võib saada kuni 15 punkti. Puudumine kahandab seminari tulemust –5 punkti \nHindamisel arvestatakse järgmisi tegureid:\na) osavõtt seminari ettevalmistavast õppekäigust;\nb) individuaalse kodutöö sisukus ja täheajaline esitamine;\nc) seminari diskussioonis osalemine: vastamine terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning oma arvamuste esitamine terviseturismi hetkeolukorrast ja tulevikust, kodulugemisel kasutatud allikate tutvustamine.\n\n14–15 punkti:\n1)\tindividuaalne kodutöö on põhjalik ja sisukas;\n2) töö on tähtajaks esitatud;\n3) õppija oskab vastata terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning diskuteerida;\n4) õppija annab ülevaate kodulugemisel kasutatud allikatest;\n5) õppija osaleb aktiivselt seminari diskussioonides: vastab terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning avaldab oma arvamust terviseturismi hetkeolukorrast ja tulevikust; \n6) õppija osaleb seminari ettevalmistaval õppekäigul.\n\n12–13 punkti:\n1) individuaalne kodutöö on asjakohane, mõningad vastused on pealiskaudsed;\n2) töö on tähtajaks esitatud;\n3) õppija oskab vastata terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning diskuteerida;\n4) õppija annab ülevaate kodulugemisel kasutatud allikatest;\n5) õppija osaleb seminari diskussioonides: vastab terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning avaldab oma arvamust terviseturismi hetkeolukorrast ja tulevikust;  \n6) õppija osaleb seminari ettevalmistaval õppekäigul.\n\n8–11 punkti:\n1)\tindividuaalne kodutöö on kaunis pealiskaudne ja napp;\n2) töö on tähtajaks esitatud;\n3) õppija oskab osaliselt vastata terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning diskuteerida;\n4) õppija annab ülevaate kodulugemisel kasutatud allikatest;\n5) õppija osaleb  seminari diskussioonides: vastab terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning on oma arvamuste avaldamisel terviseturismi hetkeolukorrast ja tulevikust passiivne;\n6) õppija osaleb seminari ettevalmistaval õppekäigul.\n\n1-7 punkti:\n1)\tindividuaalne kodutöö on tähtajaks esitamata;\n2) töö ei vasta juhendi nõuetele;\n3) õppija ei oska vastata terviseturismi raamistiku, alavormide, terviseturistide ootuste, vajaduste ja soovidega seonduvatele küsimustele ning diskuteerida;\n4) õppija ei anna ülevaadet kodulugemisel kasutatud allikatest;\n5) õppija puudub seminarist;\n6) õppija puudub seminari ettevalmistaval õppekäigul.\n\n0 punkti: õppekäigul ja seminaris ei osalenud,  töö on esitamata."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "P1. Praktiline õpe 1. \nTervikliku heaolukontseptsiooni põhimõtete kasutamine organisatsioonis.\nEristav hindamine, kuni 15 punkti.\nJUH P3.\nP1. Praktilise ülesande täitmise eest võib saada kuni 15 punkti. Puudumine kahandab seminari tulemust (–5 punkti 19.03. ja – 5 punkti 14.04.).\nPraktiline õpe P1 toimub kahe päeval: 17.04. õppereis ja 7.05. õppereisi arulelu, rühmatöö tunnis.\nHindamisel arvestatakse järgmisi tegureid:\na)\t19.03. osavõtt praktilisest õppest; \nb) 14.04. osavõtt praktilisest õppest, rühmatööst, selle esitlusest ja arutelust.\n\n8-10 punkti:\n1)\tõppija on enne õppekäiku tutvunud organisatsiooni kodulehega ja oskab vastata seonduvatele küsimustele;\n2) õppija osaleb õppekäigul, on aktiivne, esitab asjakohaseid küsimusi;\n3) õppija osaleb rühmatöö „Tervikliku heaolukontseptsiooni põhimõtete kasutamine organisatsioonis“ ettevalmistamisel ja esitlusel.\n\n6-7 punkti:\n1)\t õppija on enne õppekäiku mingil määral tutvunud organisatsiooni kodulehega, kuid ei oska vastata kõigile seonduvatele küsimustele;\n2) õppija osaleb õppekäigul, on passiivne küsimuste esitamisel;\n3) õppija osaleb rühmatöö „Tervikliku heaolukontseptsiooni põhimõtete kasutamine organisatsioonis“ ettevalmistamisel ja esitlusel.\n\n5 punkti:\n1)\tõppija ei ole enne õppekäiku tutvunud organisatsiooni kodulehega ja ei oska vastata kõigile seonduvatele küsimustele.\n2) õppija osaleb õppekäigul, on passiivne küsimuste esitamisel.\n3) õppija ei osale/osaleb osaliselt  rühmatöö „Tervikliku heaolukontseptsiooni põhimõtete kasutamine organisatsioonis“ ettevalmistamisel ja esitlusel.\n\t\n1-4 punkti:\n1) õppija ei osale praktilises õppes;\n2) õppija ei osale rühmatöö ettevalmistamisel ja esitlemisel;\n3) esitab kokku lepitud ajaks individuaalse töö.\n\n0 punkti: ei osalenud ja ei esitanud tähtajaks individuaalset tööd."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "P2. Praktiline õpe 2. Heaolutänava disainimine.\nEristuv hindamine, kuni 10 punkti.\nJUH P2\nP2 Praktilise ülesande täitmise eest võib saada kuni 10 punkti. Puudumisel praktilise õppe tulemus 0 (st punkte ei saa ja praktilist õpet korrata ei saa).\nRühmatöö toimub auditooriumis.\n\nPraktilise õppe „Tere tulemast heaolutänavale!“ ülesanded:\n1.\tEttevalmistustöö iseseisvalt ja rühmaga veebruarikuust kuni maikuuni: Rüütli tänavaga tuttavamaks saamine.\n2.\tRühmatöö ettevalmistamine ja esitlus tunnis.\n\n9-10 punkti:\n1)\tõppija osaleb rühmatöö ettevalmistamisel ja esitlemisel;\n2) rühmatöö vastab juhendile, on sisukas, põhjendatud ja kuulajatele huvipakkuv;\n3) õppija oskab vastata teemaga seonduvatele küsimustele.\n\n7-8 punkti:\n1) õppija osaleb rühmatöö ettevalmistamisel ja esitlemisel;\n2) rühmatöö vastab juhendile, aga oleks saanud olla sisukam, põhjendatum ja kuulajatele huvipakkuvam;\n3) õppijas oskab vastata teemaga seonduvatele küsimustele.\n\n5-6 punkti:\n1)\tõppija osaleb rühmatöö ettevalmistamisel ja esitlemisel;\n2) rühmatöö vastab üldjoontes juhendile, aga on kaunis pealiskaudne;\n3) õppijas oskab vastata teemaga seonduvatele küsimustele.\n\n1-4 punkti:\n1)\tõppija ei osale /osaleb osaliselt rühmatöös;\n2) rühmatöö on napp ja pealiskaudne;\n3) õppija ei oska vastata kõikidele teemaga seonduvatele küsimustele.\n\n0 punkti: praktilisest õppest puudumisel jäävad punktid saamata."}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "P3. Aineprojekt. P3. Rühmatöö: Terviseriik Eesti. Kuidas arendada Eestit terviseturismi sihtkohana?\nEristav hindamine, kuni 30 punkti.\nJUH P3\nP3. Praktilise ülesande, aineprojekti täitmise eest võib saada kuni 30 punkti.  \nHindamisel arvestatakse järgmisi tegureid:\na)\tosalemine aineprojekti ettevalmistamisel;\nb) aineprojekti vastavus töö juhendile (teoreetilise osa, hetkeolukorra analüüs, sh tuginemine nii sekundaarse kui ka primaarse uuringu (rühma poolt läbi viidud uuringu) tulemustele, ettepanekute esitamine Eesti kui terviseturismisihtkoha arendamiseks;\nc)\t aineprojekti vormistuse vastavus Pärnu kolledi üliõpilastööde juhendile;\nd) aineprojekti tähtaegne esitamine;\ne) osalemine aine projekti kaitsmisel.\n\n25–30 punkti:\n1)\taineprojekt on sisukas, vastab kõiges töö juhendi nõuetele;\n2) aineprojekt on vormistatud vastavalt Pärnu kolledi üliõpilastööde juhendile;\n3) aineprojekt esitati juhendis olevaks tähtajas;\n4) õppija osales aktiivselt aineprojekti ettevalmistamisel;\n5) õppija osales aktiivselt aineprojekti kaitsmisel;\n6) õppija oskas vastata kõigile aineprojektiga seonduvatele küsimustele.\n\n20–24 punkti:\n1)\taineprojekt on sisukas, vastab üldiselt töö juhendi nõuetele;\n2) aineprojekt on vormistatud vastavalt Pärnu kolledi üliõpilastööde juhendile;\n3) aineprojekt esitati vähemalt 24 tundi enne kaitsmise kuupäeva ja kellaaega;\n4) õppija osales aineprojekti ettevalmistamisel;\n5) õppija osales aineprojekti kaitsmisel;\n5) õppija oskas vastata aineprojektiga seonduvatele küsimustele.\n\n15–19 punkti:\n1)\taineprojekt vastab üldiselt töö juhendi nõuetele, on napp ja pealiskaudne;\n2) aineprojekt on üldjoontes vormistatud vastavalt Pärnu kolledi üliõpilastööde juhendile, vormistamisel on mõningaid vigu;\n3) aineprojekt esitati vähemalt 24 tundi enne kaitsmise kuupäeva ja kellaaega;\n4) õppija osales aineprojekti ettevalmistamisel;\n5) õppija osales aineprojekti kaitsmisel;\n6) õppija ei osanud vastata kõigile aineprojektiga seonduvatele küsimustele.\n\n1-14 punkti: aineprojekt ei vasta juhendi nõuetele, seda tuleb oluliselt täiendada ning tulla korduskaitsmisele.\n\n0 punkti: aineprojekt on esitamata."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "Õppeaine lõpeb eristuva hindamisega.\nHinnatakse üliõpilase soorituse aspekte ja vajalike kriteeriumide täitmise määra.\nÕppeaine lõpphinne kujuneb:\n1) seminaride tulemuste: S1 kuni 10 punkti, S2 kuni 10 punkti, S3 kuni 10 punkt, S4 kui 15 punkti (kokku kuni 45 punkti);\n2) praktilise õppe tulemuste: P1 kuni 15 punkti, P2 kuni 10 punkti (kokku kuni 25 punkti);\n3) aineprojekti (P3) tulemuse (kuni 30 punkti) põhjal.\nSeminaridest ja praktilisest õppest puudumine kahandab aine lõpptulemust (vt juhendid), neid korrata ei saa.\nTööde juhendid, tähtajad ja hindamiskriteeriumid on saadaval aine Moodle-s."}, "grade_evaluation": {"et": "Õppeaine lõpphinne kujuneb seminaride, praktilise õppe ja aineprojekti tulemuste (punktide) põhjal. Aine lõpptulemuse saamiseks on vajalik kõikide kodutööde esitamine Moodle'se."}, "grade_conditions": {"A": {"et": "91-100 p"}, "B": {"et": "81-90 p"}, "C": {"et": "71-80 p"}, "D": {"et": "61-70 p"}, "E": {"et": "51-60 p"}, "F": {"et": "0-50 p"}}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "f8b5689e-98de-408b-b10d-ae503bc69869", "type": "MOODLE", "code": "SVPC.02.019_SO", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "materials": [{"name": {"et": "Õppematerjalid lisatakse Moodle'sse"}, "type": {"code": "material", "et": "Õppematerjal", "en": "Study material"}, "required": true}]}, "participants": {"lecturers": [{"person_uuid": "d571e4c6-2f3f-ac54-e33e-1c5de2b4b444", "person_name": "Heli Tooman", "structural_unit": {"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25-44"}, "entries": [{"course_week": 25, "time": "2025-02-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Heaolu mõiste. Heaoluühiskond, heaoluriik, heaolumajandus."}, "description": {"et": "20.02.2025\n13.30–18.30\nLoeng. Heaolu mõiste (welfare, well-being, wellness). Isiklik ja sotsiaalne heaolu. Heaoluühiskond, -riik ja -majandus. Vabaajakäsitlused. Tervisekäsitlused. Heaolufilosoofia (wellness philosophy) ajalooline taust ja põhimõtted. Heaoludimensioonid. Heaoluenergia. \nKogemuste jagamine – tööheaolust minu organisatsioonis. Virgutused tööajal.\nLoeng. Heaoluettevõtlus. Heaoluasutused, -kaubad, -teenused ja -kohad.\n\nS2 teema valimine"}}, {"course_week": 29, "time": "2025-03-19", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {"et": "Õppereis"}, "description": {"et": "P1. Praktiline õpe 1. Õppereis (vt JUH P1). Tervikliku heaolukontseptsiooni põhimõtete kasutamine organisatsioonis.\n"}}, {"course_week": 29, "time": "2025-04-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"et": "Heaoluühiskond ja selle areng"}, "description": {"et": "14.04.2025\n9.30-12.45\nP1.(järg) Praktiline õpe 1. Tervikliku heaolukontseptsiooni põhimõtete kasutamine organisatsioonis. Õppereisi analüüs, rühmatööde esitlus.(Vt JUH P1)\nS1. Seminar 1. Heaoluühiskond ja selle areng (vt. JUH S1)\n"}}, {"course_week": 33, "time": "2025-04-14", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "Heaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid"}, "description": {"et": "14.04.2025\n9.30-12.45\nS2. Seminar 2. Heaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid  (vt JUH S2)."}}, {"course_week": 33, "time": "2025-04-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "17.04. 2025\n9.30–12.45\nS3. Seminar 3. Isikliku heaolu mõõtmine ja hindamine. Isikliku heaolu parendusvõimalused (vt JUH S3/a ja JUH S3/b).\nS4. Seminar 4. Terviseturismi raamistik ja alavormid. Terviseturismitooted ja teenused. Terviseturismiasutused. \n(vt JUH S4).\nP2. Praktiline õpe 2. Heaolutänava disainimine (vt JUH P2).\nNB! Soovi korral pärast seda aineprojektiga (P3) seonduv konsultatsioon!\n"}}, {"course_week": 41, "time": "2025-06-14", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 6, "topic": {"et": "Aineprojekti kaitsmine"}, "description": {"et": "14.06.2025\n11.15-15.00\nP3. Praktiline õpe 3. \nAineprojekti kaitsmine (vt JUH P3) \nNB! Kaitsmisele registreerimisel pidage silmas, et rühm tuleb kaitsmisele ühel ja samal ajal.\nProjekt laadige Moodle’sse hiljemalt 12.06.2025, esitlus 13.06. kell 20.00.\n"}}]}, "registration_info": {"audience": {}, "min_students": 15}, "parent_uuid": "e04a60c7-2ce4-9e5e-745a-92a9917fdd99", "parent_code": "SVPC.02.019", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}