{"uuid": "20545006-9a5c-5b2d-e6c2-166a4d3ebae2", "code": "SVPC.01.063", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-15T13:13:31", "title": {"en": "Personal Consulting Techniques", "et": "Isikunõustamise tehnikad"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Prerequisites and characteristics of adult learner development. Educator's code of ethics. Personal counseling techniques: counseling, training, consulting, (business) mentoring, coaching, supervision, supervision. Customer work process and its planning. Customer target group analysis and customer work goals. Possibilities of combining methods of client work. Evaluating the effectiveness of client work and interpreting feedback.", "et": "Täiskasvanud õppija arengu eeldused ja eripärad. Koolitaja eetikakoodeks. Isikunõustamise tehnikad: nõustamine, koolitamine, konsulteerimine, (äri)mentorlus, coaching, supervisioon, kovisioon. Klienditöö protsess ja selle planeerimine. Kliendisihtrühma analüüs ja klienditöö eesmärgid. Klienditöö meetodite kombineerimise võimalused. Klienditöö tõhususe hindamine ja tagasiside tõlgendamine."}, "objectives": [{"en": "To give an overview of the main development, training and counseling techniques used in adult education and the principles of working with them.", "et": "Anda ülevaade peamistest täiskasvanuhariduses kasutusel olevatest arendus-, koolitus- ja nõustamistehnikatest ja nendega töötamise põhimõtetest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine  läbinud õppija:"}, {"en": "1) knows the prerequisites and characteristics of the adult learner's development;", "et": "1) teab täiskasvanud õppija arengu eelduseid ja eripärasid;"}, {"en": "2) knows and bases his work on the adult educator's code of ethics;", "et": "2) teab ja lähtub oma töös täiskasvanute koolitaja eetikakoodeksist;"}, {"en": "3) can analyze his own and the client's development needs;", "et": "3) oskab analüüsida enda ja kliendi arenguvajadusi;"}, {"en": "4) chooses the appropriate development methodology according to the client's development goal;", "et": "4) valib vastavalt kliendi arengueesmärgile sobiva arendusmetoodika;"}, {"en": "5) knows the principles and main techniques and areas of use of training, advice, consulting, (business) mentoring and coaching;", "et": "5) teab koolitamise, nõustamise, konsulteerimise, (äri)mentorluse ja coachingu põhimõtteid ja peamisi tehnikaid ning kasutusvaldkondi;"}, {"en": "6) plans and conducts client work sessions according to the selected development methodology or their combination;", "et": "6) planeerib ja viib läbi klienditöö sessioone vastavalt valitud arendusmetoodikale või nende kombinatsioonidele;"}, {"en": "7) is able to collect feedback on customer work and analyze and evaluate it.", "et": "7) oskab koguda klienditöö tagasisidet ning seda analüüsida, hinnata."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}