{"uuid": "e9c7d83d-9bc7-0990-cfcc-496d7bfd866e", "code": "SVPC.03.009", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T13:11:15", "title": {"en": "Management of Social and Work-based Rehabilitation", "et": "Sotsiaalse ja tööalase rehabilitatsiooni korraldus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "dad51640-1974-aee3-7679-196ddf327cac", "code": "SVPC.03.018", "title": {"en": "Legal Bases of Social Protection", "et": "Sotsiaalkaitse õiguslikud alused"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T10:39:16"}]}, "overview": {"description": {"en": "The course consists of 4 modules:\n1. The foundations and organisation of social and occupational rehabilitation.\n1.1. The main objectives and development of rehabilitation \n1.2. Developments in the field of rehabilitation and social processes that affect the development.\n1.3. Legal bases of the rehabilitation service in Estonia (social and occupational rehabilitation, objectives, target groups, service referral).\n1.4. The legal bases and process of occupational rehabilitation (assessment of capacity for work, objectives of occupational rehabilitation, target group, service referral, establishment of an action plan and evaluation of results).\n\n2. The process of social rehabilitation.\n2.1. The legal bases and process of social rehabilitation\nAt the Estonian National Social Insurance Board, provision of services on the basis of the case manager's action plan, assessment of the need for social rehabilitation at the service provider level.\n2.2. Targeting social rehabilitation, service provision, process coordination, crossing barriers.\n2.3. Preparation of a rehabilitation plan for children.\n\n3. The process of occupational rehabilitation.\n3.1. Supported employment methodology (definition, key characteristics).\n3.1.1. Stages of supported employement (professional profile building, evaluation and counselling tools).\n3.2. Principles for career counselling.\n3.3. Different services of employment.\n\n4. Rehabilitation programmes, aids and principles of the quality of social  services.\n4.1.1. The bases of rehabilitation programmes, target groups and objectives.\n4.1.2. Preparation, evaluation and planning of the programme, intervention, evaluation of results, completion of the programme, long-term feedback planning.\n4.1.3. The process of approving the programmes at the Social Insurance Board.\n4.2. Regulation of aids.", "et": "Aine koosneb 4 moodulist:\n1. Sotsiaalse ja tööalase rehabilitatsiooni alused ja korraldus. \n1.1. Rehabilitatsiooni peamised eesmärgid ning rehabilitatsiooni kujunemine.\n1.2. Rehabilitatsioonivaldkonna arengud ja arengut mõjutanud ühiskondlikud protsessid. \n1.3. Rehabilitatsiooniteenuse õiguslikud alused Eestis (sotsiaalne ja tööalane rehabilitatsioon, eesmärgid, sihtgrupid, teenusele suunamine).\n1.4. Tööalase rehabilitatsiooni õiguslikud alused ja protsess (töövõime hindamine, tööalase rehabilitatsiooni eesmärgid, sihtgrupp, teenusele suunamine, tegevuskava koostamine ja tulemuste hindamine.\n\n2. Sotsiaalse rehabilitatsiooni protsess.\n2.1. Sotsiaalse rehabilitatsiooni õiguslikud alused ja protsess\nRehabilitatsioonivajaduse hindamine. Sotsiaalkindlustusametis,  sotsiaalse rehabilitatsiooni vajaduse hindamine teenuse osutaja tasandil.\n2.2. Sotsiaalse rehabilitatsiooni eesmärgistamine, teenuste osutamine, protsessi koordineerimine, barjääride ületamine. \n2.3. Lastele rehabilitatsiooniplaani koostamine.  \n\n3. Tööalase rehabilitatsiooni protsess.\n3.1. Toetatud tööle rakendamise metoodika (definitsioon, põhitunnused).\n3.1.1. Toetatud töölerakendumise etapid (kutseprofiili koostamine, hindamis- ja nõustamisvahendid.)\n3.2. Karjäärinõustamise põhimõtted.\n3.3. Erinevad töötamise teenused.\n\n4. Rehabilitatsiooniprogrammid, abivahendid ja sotsiaalse rehabilitatsiooniteenuse  kvaliteedi põhimõtted.\n4.1.1. Rehabilitatsiooni programmi üldalused, programmi sihtrühm ja eesmärgid.\n4.1.2. Programmi ettevalmistamine, hindamine ja planeerimine, sekkumine, tulemuste hindamine, programmi lõpetamine, pikaajalise tagasiside planeerimine.\n4.1.3. Programmide kinnitamise protsess Sotsiaalkindlustusametis.\n4.2. Abivahendite regulatsioon."}, "objectives": [{"en": "1. Develop students' knowledge of the different approaches to rehabilitation, its main principles and international framework documents affecting the rehabilitation sector.", "et": "1. Arendada üliõpilaste teadmiseid rehabilitatsiooni erinevatest käsitlusest, peamistest põhimõtetest ning rahvusvahelistest rehabilitatsioonivaldkonda mõjutavatest raamdokumentidest."}, {"en": "2. Learn the legal bases and organisation of the provision of social and occupational rehabilitation services.", "et": "2. Õppida tundma sotsiaalse- ja tööalase rehabilitatsiooni teenuse osutamise õiguslikke aluseid ja korraldust."}, {"en": "3. Develop students' practical skills for providing social and occupational rehabilitation services and for coordinating the rehabilitation process.", "et": "3. Arendada üliõpilaste praktilisi oskuseid sotsiaalse- ja tööalase rehabilitatsiooni teenuse osutamiseks ja rehabilitatsiooniprotsessi koordineerimiseks."}, {"en": "4. Develop students' knowledge of the development and provision of rehabilitation programmes and of the use of a supported job application methodology in occupational rehabilitation.", "et": "4. Arendada üliõpilaste teadmiseid rehabilitatsiooniprogrammide väljatöötamisest ja osutamisest ning toetatud töölerakendamise metoodika kasutamisest tööalases rehabilitatsioonis."}, {"en": "5. Raise awareness of issues related to the development of the quality of social services, the assessment of the need for aids and the main principles for assessing the need for aids.", "et": "5. Tõsta teadlikkust sotsiaalteenuste kvaliteedi arendamisega seotud küsimustest, abivahendi vajaduse hindamisest ning peamistest põhimõtetest abivahendite vajaduse hindamisel."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the history of the development of rehabilitation and different approaches;", "et": "1) teab rehabilitatsiooni arengulugu ja erinevaid käsitlusi;"}, {"en": "2) knows the bases for organising the work of rehabilitation institutions in Estonia;", "et": "2) teab rehabilitatsiooniasutuste töö korraldamise aluseid Eestis;"}, {"en": "3) knows the target groups of social and occupational rehabilitation, and the bases for the organisation of the service;", "et": "3) teab sotsiaalse  ja tööalase rehabilitatsiooni sihtgruppe ja teenuse korralduse aluseid;"}, {"en": "4) can apply the methodology for the implementation of supported work;", "et": "4) oskab rakendada toetatud tööle rakendamise metoodikat;"}, {"en": "5) knows the bases for providing rehabilitation programmes;", "et": "5) teab rehabilitatsiooniprogrammide osutamise aluseid;"}, {"en": "6) is familiar with the aid application process;", "et": "6) on kursis abivahendi taotlemise protsessiga;"}, {"en": "7) knows the quality principles of rehabilitation services.", "et": "7) teab rehabilitatsiooniteenuse kvaliteedi põhimõtteid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}