{"uuid": "0162d85b-27cc-47b0-9cce-cb0c706fb84b", "code": "SVPC.02.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T17:32:22", "title": {"en": "Green Entrepreneurship", "et": "Roheettevõtlus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC02", "structural_unit_name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Managing green microbusinesses. Understanding green consumers. Building a green brand. Sustainable quality management. Green product development and service design. Managing supply chains in green microbusinesses. Communication in a customer journey. Export and international markets.", "et": "Roheline mikroettevõte ja selle juhtimine. Roheline tarbija ning tema ootused. Rohelise brändi loomine. Jätkusuutlik kvaliteedijuhtimine. Roheliste toodete/teenuste arendus ja disain. Tarneahela juhtimine rohelises mikroettevõttes. Klienditeekond ja kommunikatsioon. Eksport ja rahvusvaheline turg."}, "objectives": [{"en": "The aim of the course is to develop the student's necessary business skills and make them think more thoroughly about the sustainable use of natural resources to meet the demands of consumers for environmentally friendly, natural, healthy products and services that offer maximum value to different parties.", "et": "Aine eesmärk on arendada õppija vajalikke ärioskusi ning panna ta mõtlema loodusressursside jätkusuutlikule kasutamisele, et täita tarbijate ja turgude uuenenud nõudmisi keskkonnasäästlike, looduslike, tervislike ja erinevatele osapooltele maksimaalset väärtust loovate toodete ning teenuste pakkumise võimalustele."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) has an understanding of the need for sustainable management and sees green business opportunities;", "et": "1) mõistab kestliku arengu vajadust ja eesmärke ning rohelise ettevõtlusega seonduvaid ärivõimalusi;"}, {"en": "2) describes the concept of a green consumer and ideas related to green branding;", "et": "2) kirjeldab rohelist klienti ja rohelise brändimise keskeseid ideid;"}, {"en": "3) knows the basics of quality management as well as the most common quality and/or environmental certifications;", "et": "3) teab kvaliteedijuhtimise üldpõhimõtteid ja tuntumaid keskkonna kvaliteediga seonduvaid sertifikaate ning märgiseid;"}, {"en": "4) is able to describe green products, processes, supply chain management and logistics;", "et": "4) iseloomustab rohelisi tooteid, protsesse, tarneahelat ja logistikat;"}, {"en": "5) knows design thinking and service design principles and different tools;", "et": "5) tunneb disainmõtlemise ja teenusedisaini põhimõtteid ning erinevaid töövahendeid;"}, {"en": "6) describes green communication opportunities in different stages of a customer journey;", "et": "6) kirjeldab rohelise turunduskommunikatsiooni võimalusi klienditeekonna erinevatel etappidel;"}, {"en": "7) understands the difference between local and international businesses, meaning of target markets and segmentation;", "et": "7) mõistab segmentimise, sihtturu ja sihtrühma tähendust ning kohalikule ja rahvusvahelise turule suunatud äritegevuse eripära;"}, {"en": "8) analyzes the compliance of processes with the principles of green entrepreneurship and makes suggestions for improvement.", "et": "8) analüüsib protsesside vastavust rohelise ettevõtluse põhimõtetele ning esitab parendusettepanekuid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}