{"uuid": "5588e7f1-842e-4486-aab0-7e3882b1e93e", "code": "SVPC.01.008", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-21T14:45:49", "title": {"en": "Research Methodology", "et": "Teadustöö metodoloogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "This course introduces the fundamentals of research process and teaches to differentiate between qualitative and quantitative research approach. Course gives an overview of the main data gathering and analysis methods in social sciences. Specifically, the course will introduce the principles of conducting interviews, questionnaires, observations and document analysis, together with the data analysis.", "et": "Kursuse raames antakse ülevaade teadusuuringu läbiviimise protsessist ning õpitakse eristama kvalitatiivset ja kvantitatiivset uurimislähenemist.  Tutvustatakse põhilisi sotsiaalteadustes kasutatavaid uurimis- ja analüüsimeetodeid.  Käsitletakse intervjuude, küsitluste, vaatluste, ja dokumendianalüüsi läbiviimise põhimõtteid, samuti kogutud andmete analüüsivõimalusi."}, "objectives": [{"en": "This course enables to develop an understanding of research methodology, but also to  gain knowledge of different qualitative and quantitative research and analysis methods used in social sciences, and  specifically, at student's own field of study.", "et": "Võimaldada üliõpilastel omandada teadmised sotsiaalteaduste ja täpsemalt oma eriala valdkonnas enim kasutatavatest metodoloogiatest, samuti kvalitatiivsetest ja kvantitatiivsetest uurimis- ja analüüsimeetoditest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) has knowledges on how to draft a literature review;", "et": "1) omab teadmisi kirjanduse kasutamise kohta teadustöös;"}, {"en": "2) has basic knowledge of different data gathering and analysing methods, together with research methodologies; ", "et": "2) omab baasteadmisi andmete kogumise ja analüüsimise meetoditest ning metodoloogiatest;"}, {"en": "3) has skills to apply some data gathering methods (interviews, observations, document analysis);", "et": "3) oskab rakendada enamlevinud andmete kogumise meetodeid (intervjuu, vaatlus, tekstianalüüs);"}, {"en": "4) has skills to carry out basic data analysis and to interpret and generalise the results of data analysis and to present the research results;", "et": "4) oskab rakendada lihtsamat andmeanalüüsi, analüüsitulemusi tõlgendada ja uurimistulemusi esitada;"}, {"en": "5) has skills to find necessary instructions for (scientific) research.", "et": "5) suudab vajadusel leida teadustöö tegemiseks vajalikke juhendeid/materjale."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}