{"uuid": "5dd221af-0ec3-55e2-3436-0031cf7ad303", "code": "SVPC.01.042", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-21T14:09:34", "title": {"en": "Teamwork in Design", "et": "Meeskonnatöö disainis"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Teamwork. Leadership. Management. Leadership styles. Motivation. Cooperation. Performance evaluation. Team relations.", "et": "Meeskonnatöö. Eestvedamine. Juhtimine. Juhtimisstiilid. Motiveerimine. Koostöö. Tulemuslikkuse hindamine. Suhted meeskonnas."}, "objectives": [{"en": "The aim of the course is to provide knowledge about the basic principles and management of the work of design teams to organize more effective teamwork in design projects. In addition, create opportunities to learn the basics of teamwork to enable students to understand and address important issues related to teamwork in organizations.", "et": "Õppeaine eesmärk on anda teadmisi disainimeeskondade töö toimimise põhiprintsiipidest ja juhtimisest korraldamaks tulemuslikumat meeskonnatööd disainiprojektides. Lisaks luua võimalused meeskonnatöö põhialuste tundma õppimiseks, võimaldamaks õppijatel mõista ja lahendada olulisi organisatsiooni meeskonnatöö alaseid küsimusi."}], "learning_outcomes": [{"en": "After completing the course the student will: ", "et": "Õppeaine läbinud õppija: "}, {"en": "1) understand the nature and role of management in directing the activities of an organization;", "et": "1) mõistab juhtimise olemust ja rolli organisatsiooni tegevuse suunamisel;"}, {"en": "2) know and distinguish between the sub-activities of management, i.e. the main functions (planning, organization, control, leadership, communication and decision-making) based on management as a whole;", "et": "2) teab ning eristab juhtimise osategevusi ehk põhifunktsioone (planeerimine, organiseerimine, kontrollimine, eestvedamine, kommunikatsioon ja otsustamine) juhtimisest kui tervikust lähtuvalt;"}, {"en": "3) be able to take into account the individual differences of people in occupational activities;", "et": "3) oskab töises tegevuses arvesse võtta inimeste individuaalseid erinevusi;"}, {"en": "4) know the principles of teamwork processes and analysis; ", "et": "4) tunneb meeskonnatöö toimimise ja analüüsimise põhimõtteid; "}, {"en": "5) be able to participate effectively in teamwork on the position of both leader and team member;", "et": "5) on võimeline tõhusalt osalema meeskonnatöös nii liidri kui meeskonnaliikme positsioonilt."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}