{"uuid": "a66e5ed8-8ed4-a37a-b5ca-e692bc91a5a4", "code": "SVPC.02.022", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T17:13:44", "title": {"en": "Internship in Service Organization", "et": "Praktika teenindusorganisatsioonis"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC02", "structural_unit_name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false, "prerequisites": [{"required": true, "uuid": "f7d685bc-7e92-071e-cd5b-8b71c6c2511f", "code": "P2PC.00.643", "title": {"en": "Introduction to Studies in Higher Education", "et": "Sissejuhatus kõrgkooliõpingutesse"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-22T13:46:48"}]}, "overview": {"description": {"en": "Service organization. Customer groups, products and services at the internship organization. Organizational structure. Servicing internal and external customers, including service values, principles and policies that apply in the organization, service instructions, solving of problem situations, servicing customers with special and distinct needs, surprising the customer, collecting and analysing feedback from customers. Customer journey stages. Resources needed for work processes. Principles of safety and environmental sustainability in the working environment. Ways to improve and develop internal and external customer service. Tasks within the internship organization. Intern's self-analysis. Correct use of service and tourism vocabulary. Finding and using relevant sources of information. Preparation of the internship report. Presentation and defence of the internship experience.", "et": "Teenindusorganisatsioon. Praktikakoha kliendirühmad, tooted ja teenused. Organisatsiooni struktuur. Sisemise ja välimise kliendi teenindamine sh organisatsioonis kehtivad teenindusväärtused ja -põhimõtted, teenindusjuhised, probleemolukordade lahendamine, eri- ja eristuva vajadusega klientide teenindamine, kliendi üllatamine, kliendilt tagasiside kogumine ja analüüsimine. Klienditeekonna etapid. Tööprotsessideks vajalikud ressursid. Töökeskkonna ohutuse ja keskkonnahoidlikkuse põhimõtted. Sise- ja välisklienditeeninduse parendamise ja arendamise võimalused. Tööülesanded praktikaorganisatsioonis. Praktikandi eneseanalüüs. Teenindus- ja turismisõnavara korrektne kasutamine. Asjakohaste teabeallikate leidmine ja kasutamine. Praktikaaruande koostamine. Praktikakogemuse esitlemine ja kaitsmine."}, "objectives": [{"en": "The aim of the internship is to deepen students' service mentality and knowledge related to customer service. Students acquire the basics of the work environment of a service organization and acquire practical skills necessary for working in a service organization.", "et": "Õpetusega taotletakse, et õppija süvendab ja kinnistab klienditeenindusalaseid teadmisi ja oskusi ning õpib tundma teenindusorganisatsiooni toimimise põhimõtteid praktilises töökeskkonnas."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) analyses the basic principles and service processes in their internship organization based on service-oriented mindset and theoretical approaches of organizations;", "et": "1) analüüsib praktikakoha toimimise põhimõtteid ja teenindusprotsesse rakendades teenindusmõttelaadi ja organisatsiooni teoreetilisi käsitlusi;"}, {"en": "2) describes the main customer groups, products and services of their internship organisation and evaluate their suitability for customers' needs and demands;", "et": "2) kirjeldab praktikakoha kliendirühmi, tooteid ja teenuseid ning hindab nende sobivust klientide vajadustele ja nõudmistele;"}, {"en": "3) evaluates the service culture in their internship organization based on theoretical approaches and service requirements/standards of the internship organisation;", "et": "3) hindab praktikakoha teeninduskultuuri tuginedes teoreetilistele käsitlustele ja praktikakoha teenindusnõuetele ja -standarditele;"}, {"en": "4) applies their theoretical knowledge while performing daily work tasks at the internship organization according to their job description, service standards and other documents that regulate their work;", "et": "4) rakendab omandatud teadmisi tööülesannete täitmisel lähtudes praktikakoha ametijuhendist, teenindusjuhistest ja teistest praktikakohas tööd reguleerivatest dokumentidest;"}, {"en": "5) analyses their work, service and teamwork skills", "et": "5) analüüsib iseenda töö-, teenindus- ja meeskonnatöö pädevusi;"}, {"en": "6) uses correct service and tourism vocabulary and relevant academic sources while working in the internship organization and writing the internship report.", "et": "6) kasutab praktikakohas ja praktikaaruande koostamisel korrektset teenindus- ja turismisõnavara ning asjakohaseid teabeallikaid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}