{"uuid": "1addfbad-7a5f-f1a2-48f9-9ef1b146f771", "code": "SVPC.00.075", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Resource Management Project", "et": "Ressursimajanduse teemaprojekt"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Group formation, topic selection, scoping and hypothesis formulation.\nElaborating data and methodology.\nElaborating background research and screening policies.\nConducting case studies, discussions of intermediate seminars.\nStakeholder analysis and multiple-interest discussions.\nEvaluation and processing the decision-making (model case).\nRisk assessment, scenario and alternatives.\nDrafting and editing the results and peer-review.\nPresentation of results and feedback.", "et": "Rühmade moodustamine, teema valik, ulatuse määratlus ja hüpoteesipüstitus.\nAndmete ja metoodika väljatöötamine.\nTaustauuringute ja seonduvate poliitikate ülevaade.\nJuhtumanalüüside läbiviimine, vaheseminaride arutelud.\nSidusrühmade seisukohtade kogumine, analüüs ja arutelud. \nOtsustusprotsessi hindamine ja läbimine.\nRiskihindamine ja täiendavate asjaolude arvestamine.\nTulemuste vormistamine ja peer-review.\nTulemuste esitlemine ja tagasisidestamine."}, "objectives": [{"en": "The students elaborate the comprehensive thematic project on current policies and practices in climate economy, bioeconomy or blue economy (selected). The applied project addresses the key social and technical issues influencing regional strategies and local greenfield/marine development in the context of the transition toward sustainable and lower carbon economy. It evolves a range of theoretical, analytical and critical perspectives on siting, land use, resource limitations and environmental management. An understanding will be developed through cross-disciplinary approach, teamwork, field work and guest speaker seminars and case work.", "et": "Kursusel koostatakse rühmatööna kolmeses spetsialiseerumises kliimamajanduse, biomajanduse või sinimajanduse projekt aktuaalsetel ressursikasutuse ja  -konflikti teemadel. Projektiuuringus käsitletakse mitmeid ruumilisi, maa- ja ressursikasutuse, sotsiaalmajanduslikke ja tehnoloogilisi teemasid ja asjaolusid, mis puudutab piirkondlike arengukavade ja kohaliku arendusprojektide elluviimist ühiskonna ja majanduse üleminekutes kestlikule arengurajale. Teemaprojekt arendab  analüütilisi ja praktilisi oskusi erinevates vaatenurkades ning ainekäsitluses erialaüleselt, tehakse külastusi, välitöid ja osaletakse külalisseminaridel."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) set up the concept, hypothesis, data and methodology and deploy high quality study project management;", "et": "1) oskab koostada projektiuuringule kontseptsiooni, hüpoteesid, andmed ja metoodika ning rakendada läbivalt kvaliteetset projektijuhtimist;"}, {"en": "2) integrate multiple policies related to resource use, management and deployment, carry out stakeholder and SWOT analyses;", "et": "2) oskab seostada loodusressursside kasutusega erinevaid valdkonnapoliitikaid, viia läbi sidusrühmade ja SWOT-analüüsi;"}, {"en": "3) apply environmental appraisal and analytical methods,  assess the costs and benefits and balance pros and cons, construct optimisation etc models and scenarios;", "et": "3) oskab rakendada keskkonnahindamise ja teisi analüüsimeetodeid, tasakaalustada pluss- ja miinus-asjaolusid, koostada optimeerimis jne analüüsimudeleid ning lahendusstsenaariume;"}, {"en": "4) understand the procedure for formal permits and processing;", "et": "4) valdab haldusprotsesse, ametlike lubade andmise korda ja asjaajamist;"}, {"en": "5) interpret the effects of legal and economic instruments and local circumstances on project:", "et": "5) oskab tõlgendada õiguslikke ja majanduslikke asjaolusid teemaprojekti kohalike olude suhtes;"}, {"en": "6) gain experience in using drafting, infographics and presenting techniques (written and oral).", "et": "6) oskab dokumenteerida, väljendada tulemusi aruandes ja teistes esitlusvormides kirjalikult (vormingud, infograafika) ja suuliselt (ettekanded), täpselt ja tõhusalt väljendada projekti tulemusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}