{"uuid": "cb646e46-bbb8-75c7-f660-d46a32ebd101", "code": "SVPC.03.056", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-08T10:39:38", "title": {"en": "Social and Health Policy", "et": "Sotsiaal- ja tervishoiupoliitika"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC03", "structural_unit_name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC03", "name": {"en": "Department of Social Work Administration", "et": "sotsiaaltöö korralduse osakond"}, "phone": "+372 445 0523", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Social security, social welfare, social risk, social planning.\nWelfare state, welfare society, civil society.\nJustice, equality, efficiency.\nConservatism/corporatism, liberalism, social democracy, rationalism.\nSocial policy (protection) regime, main sectoral policy regimes (labour market policies, etc.) in the EU.\nHealth care organisation, legislation.", "et": "Sotsiaalkindlustus, sotsiaalhoolekanne, sotsiaalne risk, sotsiaalne planeerimine.\nHeaoluriik, heaoluühiskond, kodanikuühiskond.\nÕiglus, võrdsus, efektiivsus.\nKonservatism/korporatism, liberalism, sotsiaaldemokraatia, ratsionalism.\nSotsiaalpoliitika (-kaitse) režiim, peamised sektorpoliitika režiimid (tööturupoliitika jms) EL-s.\nTervishoiu korraldus, seadusandlus."}, "objectives": [{"en": "1. Systematically exploring at concepts like \"good Estonian society\", \"social problem\", and \"strategic\" and \"critical\" areas of intervention in the context of public administration.", "et": "1. Käsitleda süsteemis selliseid mõisteid nagu \"hea Eesti ühiskond\", \"sotsiaalne probleem\", \"strateegiline\" ja \"kriitiline\" sekkumisvaldkond avaliku halduse kontekstis."}, {"en": "2. Giving an overview of social policy as a theory of sociological, politological, population science, economics and governance (public administration) concepts forming a theoretical framework for social policy.", "et": "2. Anda ülevaade sotsiaalpoliitikast kui teooriast sotsioloogilisest, politoloogilistest, rahvastikuteaduse, majandusteaduse ja juhtimise (avaliku halduse) kontseptsioonidest, mis moodustavad sotsiaalpoliitika teoreetilise raamistiku."}, {"en": "3. Creating an idea of social policy as a practical area of activity in which the different subjects of society support and/or shape the well-being of groups (and, through the latter, individuals) with the help of social actions.", "et": "3. Luua ettekujutus sotsiaalpoliitikast kui praktilisest tegevusvaldkonnast, milles ühiskonna erinevad subjektid toetavad ja/või kujundavad sotsiaalsete aktsioonide abiga gruppide (ja viimaste kaudu indiviidide) heaolu."}, {"en": "4. With specific national examples, providing an overview of the possibilities of different policy regimes, cost-effective financial transfer mechanisms, comprehensive social and health care management systems, and community service models that avoid learned helplessness.", "et": "4. Konkreetsete rahvuslike näidete abil omada ülevaadet erinevatest poliitikarežiimide võimalustest, kulutõhusatest rahaliste siirete mehhanismidest, terviklikest sotsiaal- ja tervishoiuteenuste korraldamise süsteemidest, õpitud abitust vältivatest kogukondlikest teenusmudelitest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) identify social policy (SP) in the overall structure of human activities, know key concepts and development indicators of modern social policy;", "et": "1) piiritleb sotsiaalpoliitika (SP) üldises inimtegevuse struktuuris, tunneb põhimõisteid ja tänapäevase sotsiaalpoliitika arengutähiseid;"}, {"en": "2) associate a nation with advancements and organisation of the policies of general social and political development (population, housing, employment, health, pension, education, income support, welfare, etc.) and today's issues;", "et": "2) seostab rahvuse üldise ühiskondliku ja majandusliku arengu valdkondlike (rahvastiku-, eluaseme-, tööhõive-, tervishoiu-, pensioni-,  haridus-, sissetulekute toetamise, hoolekande jms) poliitikate arengutega, korraldusega ja tänaste probleemidega;"}, {"en": "3) distinguish between social policy regimes in general and sectoral terms, their structure logic, strengths and weaknesses and their impact on social work and health care organisation, the logic of service organisation and payment of benefits, and the ability of customers to influence the above;", "et": "3) eristab sotsiaalpoliitika režiime üldiselt ja valdkondlikult, nende ülesehituse loogikat, tugevusi ja nõrkusi ning mõju sotsiaaltöö ja tervishoiu korraldusele, teenuste korraldamise ja toetuste maksmise loogikale ning klientide võimalustele eelnevat mõjutada;"}, {"en": "4) have an overview of health care organisation, different models of organisation and know the legislation and regulations governing the sector in Estonia.", "et": "4) omab ülevaadet tervishoiu korraldusest, erinevatest korralduse mudelitest ning tunneb valdkonda reguleerivat seadusandlust ja regulatsioone Eestis."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}