{"uuid": "3d2491e6-2a98-db45-f283-f36e40cccc3b", "code": "SVPC.00.037", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-08T10:19:40", "title": {"en": "Brand Management", "et": "Brändijuhtimine"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The nature of the brand and related terms. Relationships between brand management and marketing and design. Values and brand architecture. Brand levels: organization, product group, product/service.The specifics and necessity of creating personal brands. Telling stories as part of brand. management.", "et": "Brändi olemus ja seonduvad terminid. Brändijuhtimise seosed turunduse ja disainiga. Väärtused ja brändiarhitektuur. Brändi tasandid: organisatsioon, tootegrupp, toode/teenus. Isikubrändide loomise spetsiifika ning vajalikkus. Lugude rääkimine brändijuhtimise osana."}, "objectives": [{"en": "The course aims to provide the knowledge about the connections between brand management, and marketing and design management, and to develop the ability to analyse and create brands.", "et": "Anda teadmised brändijuhtimise seostest turunduse ning disainijuhtimise distsipliiniga ning arendada oskust analüüsida ning luua brände."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) understands the nature of the brand and its connection with design and marketing;", "et": "1) teab brändi ja brändijuhtimise olemust ning seost turunduse ning organisatsiooni strateegilise juhtimisega;"}, {"en": "2) knows the specifics of brand creation and brand management and the process at the level of organization, product/service, person;", "et": "2) mõistab kasutajakesksuse olulisust brändijuhtimise ;kontekstis"}, {"en": "3) can analyse brand strategy and create a brand management plan;", "et": "3) oskab analüüsida brändide ülesehitust ning sõnumeid mida need edastavad erinevatele sihtrühmadele;"}, {"en": "4) is able to compose an advertising text in accordance with the brand architecture;", "et": "4) oskab sihtrühmast lähtuvalt koostada lähteülesande turundustekstide kirjutamiseks või koostada ise vastava teksti;"}, {"en": "5) analyzes the brand's visual identity and makes proposals based on it.", "et": "5) oskab analüüsida brändi visuaalset identiteeti ning teha sellest lähtuvaid ettepanekuid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}