{"uuid": "b5348748-ed5b-0f83-2f53-0448767b1b99", "code": "SVPC.00.060", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-23T15:36:08", "title": {"en": "Communication Skills and Self-Expression", "et": "Suhtlemisoskused ja eneseväljendus"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Communication process. Beliefs and self-esteem. Verbal and non-verbal means of communication. Communication barriers. Communication skills: establishing contact, verbal self-expression, assertiveness, listening skills, relieving the stress situation and conflict mediation. Main competences of teamwork. Public speaking, speech as part of the communication culture. The role of voice, speech, facial expressions and body language when making presentations. Consistent breathing and effective presentations.", "et": "Suhtlemisprotsess. Uskumused ja enesehinnang. Verbaalsed ja mitteverbaalsed suhtlemisvahendid. Kommunikatsioonibarjäärid. Suhtlemisoskused: kontakti loomine, verbaalne eneseväljendamine, enesekehtestamine, kuulamine, pingeolukorra leevendamine ja konflikti vahendamine. Meeskonnatöö põhikompetentsid. Avalik esinemine ja kõne kui osa suhtlemiskultuurist. Hääle, kõne, näoilme ja kehakeele osa esinemisel. Terviklik hingamine ja esinemine. Esitlused."}, "objectives": [{"en": "The course gives an overview of the communication process and its management, how to analyse one's behaviour in communication and presentations, and develops the skills needed for communication and presentations individually and when working in groups.", "et": "Aine käigus omandab õppija ülevaate suhtlemisprotsessist ja selle juhtimisest, analüüsib oma käitumist suhtlemises ja esinemises ning arendab suhtlemiseks ja esinemiseks vajalikke oskusi nii individuaalselt kui rühmas töötades."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) demonstrates the main communication competences in a practical communication process;", "et": "1) demonstreerib praktilises suhtlemisprotsessis peamisi suhtlemiskompetentse;"}, {"en": "2) applies the rules and methods of compiling a speech;", "et": "2) rakendab kõne ülesehitamise reegleid ja meetodeid;"}, {"en": "3) analyses different communication situations and formulates feedforward;", "et": "3) analüüsib erinevaid suhtlemissituatsioone ja sõnastab edasiside;"}, {"en": "4) reflects his presentation techniques, controls and models these consciously.", "et": "4) reflekteerib oma esinemistehnikat, kontrollib ja kujundab seda teadlikult."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}