{"uuid": "f8eada03-981e-10bf-0b8e-b5b6b4e36bd6", "code": "SVPC.00.059", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-14T11:33:14", "title": {"en": "Sociology and Cultural Diversity", "et": "Sotsioloogia ja kultuuriline mitmekesisus"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC", "structural_unit_name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC", "name": {"en": "Pärnu College", "et": "Pärnu kolledž"}, "email": "info@pc.ut.ee", "phone": "+372 445 0520", "webpage_url": "https://pc.ut.ee", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The system of sociological knowledge. Genesis and nature of society, analysis of society. Institutional arrangement of society. Variety of cultural approaches and impact of cultures on social processes. Emic cooperation, emic conflicts at macro and micro level. Social interaction. Social differentiation and stratification. Deviancy and social rules. Social changes in multicultural environments. Functionalistic theories, conflict theory, interaction theories. Culture and society.", "et": "Sotsioloogilise teadmise süsteem. Ühiskonna teke ja olemus, ühiskonna analüüs. Ühiskonna institutsionaalne korraldus. Erinevad kultuurikäsitlused ning kultuuride mõju sotsiaalsetes protsessides. Kultuuridevaheline koostöö, kultuuridevahelised konfliktid nii makro- kui mikrotasandil. Sotsiaalne interaktsioon. Sotsiaalne diferentseerumine ja stratifikatsioon. Hälbivus ja sotsiaalsete reeglite teke. Sotsiaalsed muutused ja liikumised mitmekultuurilises keskkonnas. Funktsionalistlikud teooriad, konfliktiteooria, interaktsiooniteooriad. Kultuur ja ühiskond."}, "objectives": [{"en": "The course provides knowledge about sociology and its research objects, the sociological perspective and the ways of using it when studying and interpreting the society. The student will explore different types of societies, the nature of culture and components that distinguish cultures, social institutions, their evolution and impact on human behaviour through history and different cultures and societies. The student will gain knowledge and skills necessary for analysing human behaviour and related impact factors. The course provides skills for understanding today's multicultural society, how different cultural backgrounds impact social processes at the macro and micro level, and how and why cultural conflicts occur and how to solve them.", "et": "Aine õpetamisega taotletakse, et õppija omandab teadmised sotsioloogia olemusest ja uurimisobjektidest, mõistab mis on sotsioloogiline vaatekoht ning oskab kasutada saadud teadmisi ühiskonna uurimisel ja tõlgendamisel. Kursuse jooksul õpib üliõpilane tundma erinevaid ühiskonnatüüpe, kultuuri olemust ja kultuure eristavaid komponente, sotsiaalseid institutsioone, nende arengut ning mõju inimkäitumisele läbi ajaloo ja erinevate kultuuride ning ühiskondade. Kursuse jooksul omandab üliõpilane vajalikud teadmised ja oskused analüüsimaks inimkäitumise põhjuseid ja neid mõjutavaid tegureid. Kursuse oluliseks osaks on kultuurilise mitmekesisuse mõistmine, kuidas erinevad kultuurilised taustad mõjutavad ühiskondlikke protsesse nii makro- kui mikrotasandil, kuidas ja mis põhjustel ilmnevad kultuurikonfliktid ning kuidas neid lahendada."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) has obtained a general understanding of the society and sociology's place in it;", "et": "1) mõistab sotsioloogilise vaatekoha olemust ning oskab vaadelda sotsiaalseid protsesse nii makro- kui mikrotasandil;"}, {"en": "2) is able to view human behaviour and society from a cultural perspective;", "et": "2) analüüsib ühiskonda, selle tüüpe ning struktuurset ülesehitust (sotsiaalseid fakte ja institutsioone);"}, {"en": "3) understands the role of culture in social processes and social problems;", "et": "3) mõistab ja analüüsib kultuuri olemust, kultuuridevahelisi erinevusi ning selle mõju ühiskondlikele protsessidele, sh sotsiaalsete probleemide teket ja olemust erinevates kultuurikeskkondades;"}, {"en": "4) interprets and analyzes the causes and consequences of social problems and phenomena, including the role of culture in the creation and resolution of problems;", "et": "4) mõtestab lahti ja analüüsib sotsiaalsete probleemide ja nähtuste põhjuseid ja tagajärgi, sh kultuuri rolli probleemide tekkel ja lahendamisel;"}, {"en": "5) applies sociological knowledge to solve problems and challenges in society.", "et": "5) rakendab sotsioloogilisi teadmisi ühiskonnas esinevate probleemide ja väljakutsete lahendamiseks."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}