{"uuid": "8c79eedc-5ea6-efda-3d33-e5630d741e96", "code": "SVPC.01.027", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-14T14:15:37", "title": {"en": "Process and Project Management", "et": "Protsessi- ja projektijuhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The essence of process-based management, relations with general management; basic concepts / notions. Identification, modelling and analysis of process, including risks. Process life cycles, methods and concepts of process re-engineering. Business / customer requirements and defining of process objectives and indicators. Key terms, concepts and schools of thought in project management. Individual and organizational competences in project management, possible applications in process management. Project management processes, methods and standards. Traditional, agile and hybrid project management. Maturity models in management of projects and processes, their relations. Environments and life cycles of projects and programmes, relations to business plans. Principles of programme management. Design and management of project portfolios, project organisations, P(P)MOs. Enterprise architecture. Process change as a project, project planning.", "et": "Protsessipõhise juhtimise olemus ja seosed üldjuhtimisega; ajalugu ja trendid. Põhimõisted ja -kontseptsioonid. Protsesside tuvastamine, modelleerimine ja analüüs, riskide tuvastamine. Protsesside elutsüklid, protsessiparenduse kontseptsioonid, meetodid. Äri- ja kliendinõuded, protsessieesmärkide ja -näitajate määratlemine. Protsesside ümberkujundamine ja ümberkujundatud protsesside rakendamine. Projektijuhtimise põhikontseptsioonid ja -mõisted ning koolkonnad. Individuaalsed ja organisatsioonilised kompetentsid projektijuhtimises, nende võimalikud rakendused protsessijuhtimises.    \nProjektijuhtimise protsessid ja meetodid ning rahvusvahelised standardid. Traditsiooniline, agiilne ja hübriidne projektijuhtimine. Küpsusmudelid projektijuhtimises ja protsessijuhtimises, nende seosed. Projektide ja programmide keskkonnad ja elutsüklid, seos äriplaaniga. Programmi-juhtimise põhimõtted. Projektiportfellide ja projektiorganisatsioonide kujundamine ning juhtimine. Projekti- ja protsessipõhise juhtimise rakendamine ja arendamine, P(P)MO-d. Organisatsiooni arhitektuur. Protsessimuudatus kui projekt, lähteülesande ja tegevuskava koostamine)."}, "objectives": [{"en": "The learner will acquire basic knowledge in management of processes, projects, programmes and project portfolios; understand the essence of process- and project-based approach and possibilities for application in organizations.", "et": "Õppija omandab põhiteadmised protsesside, projektide, programmide ja projektiportfellide juhtimisest; mõistab protsessi- ja projektipõhise lähenemise olemust ning rakendusvõimalusi organisatsioonides."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) knows the general concepts of the management of (business) processes, and projects, programmes and project portfolios, and their applications, including in smaller organizations;", "et": "1) teab (äri)protsesside ning projektide, programmide ja projektiportfellide juhtimise põhikontseptsioone ja nende rakendusvõimalusi, sh eripära väiksemates organisatsioonides;"}, {"en": "2) knows the common methodologies, standards, competence and maturity models used in process- and project-based management;", "et": "2) teab levinuimaid protsessi- ja projektipõhise juhtimise metoodikaid ning standardeid ning pädevus- ja küpsusmudeleid;"}, {"en": "3) can identify, map and model non-complex business processes;", "et": "3) oskab identifitseerida, kaardistada ja modelleerida lihtsamaid äriprotsesse;"}, {"en": "4) can analyse business processes, identify needs and possibilities for improvement and (re)design;", "et": "4) oskab analüüsida äriprotsesse, tuvastada parendusvajadusi ja -võimalusi ning kavandada äriprotsesside (ümber)kujundamist;"}, {"en": "5) can identify and design non-complex projects (programmes);", "et": "5) oskab määratleda ja esialgselt kavandada lihtsamaid projekte (programme);"}, {"en": "6) can use the current professional vocabulary of process and project management.", "et": "6) oskab kasutada kaasaegset protsessi- ja projektijuhtimise erialast sõnavara eesti ja inglise keeles."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}