{"uuid": "8055e848-997a-ea85-e425-578edfefab3e", "code": "SVPC.01.058", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Strategic Management and Business Models", "et": "Strateegiline juhtimine ja ärimudelid"}, "credits": 5, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Development of strategic thought in historical perspective. The emphasis is on strategic analysis, its various methods (SWOT analysis, portfolio analysis, competition analysis, etc.) and the possibilities of their use and related problems in personal brand-based business. The most common modern management theories, concepts and business models are also covered. During the course, attention is paid to the practical issues of strategic management and brand management and industry-specific trends.", "et": "Strateegilise mõtte areng ajaloolises perspektiivis. Rõhuasetus on strateegilisel analüüsil, selle erinevatel meetoditel (SWOT-analüüs, portfoolio analüüs, konkurentsi analüüs jne.) ning nende kasutamise võimalustel ja sellega seotud probleemidel persoonibrändipõhises ettevõtluses. Käsitletakse ka kaasaja levinumaid juhtimisteooriaid, kontseptsioone ja ärimudeleid. Kursuse käigus pööratakse tähelepanu strateegilise juhtimise ja brändijuhtimise praktilistele küsimustele ja tegevusalapõhistele trendidele."}, "objectives": [{"en": "The aim of the subject is to improve and develop knowledge and skills of the basic concepts and methods of strategic management of personal brand-based business.", "et": "Aine eesmärgiks on täiustada ja arendada teadmisi ja oskusi persoonibrändipõhise ettevõtluse strateegilise juhtimise põhikontseptsioonidest ja meetoditest."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "1) uses the basic concepts of strategic management and understands the theoretical and practical issues of the company's strategic management;", "et": "1) kasutab strateegilise juhtimise põhikontseptsioone ja mõistab ettevõtte strateegilise juhtimise teoreetilisi ja praktilisi küsimusi;"}, {"en": "2) understands the specifics of business based on a personal brand and knows how to create business models based on it;", "et": "2) mõistab persoonibrändipõhise ettevõtluse spetsiifikat ja oskab luua sellest lähtuvaid ärimudeleid;"}, {"en": "3) analyzes the strategic management of the organization (company) and creates a new strategy based on it;", "et": "3) analüüsib organisatsiooni (ettevõtte) strateegilist juhtimist ja loob sellest lähtuva uue strateegia;"}, {"en": "4) carries out a strategic analysis of the company and its environment in order to critically assess the risks of the business model and the suitability of competitive strategies;", "et": "4) viib läbi ettevõtte ja selle keskkonna strateegilise analüüsi hindamaks kriitiliselt ärimudeli riske ning konkurentsistrateegiate sobivust;"}, {"en": "5) knows personal brand-based business trends and can use them in service development.", "et": "5) teab persoonibrändipõhise ettevõtluse trende ja oskab neid teenusearenduses ära kasutada."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}