{"uuid": "b25fe54f-ea35-f401-77d3-a11d248408c5", "code": "SVPC.02.031", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-22T18:02:24", "title": {"en": "Development and Management of Tourism Destination", "et": "Turismisihtkoha arendamine ja juhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC02", "structural_unit_name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The ecosystem of tourism. Components of tourism. Types of tourism destinations. Planning tourism development. Process of planning. Sustainable tourism and sustainable development. Stakeholders, their roles and tasks when planning tourism and developing a destination. Impact of tourism (economic, socio-cultural, environmental). Carrying capacity. Managing the impact. Influencing factors (trends incl) of developing destination and tourism. Tourism policy and its applications. Assessment of the situation of destination, resources and possibilities. Planning development and compiling the development plan. Assessing successfulness of activities considering trends.", "et": "Turismi ökosüsteem. Turismikomponendid. Eritüüpi turismisihtkohad. Turismi arengu planeerimine. Planeerimise protsess. Kestlik turism ja kestlik arendamine. Huvirühmad (truismiasjalised) ja nende roll ning ülesanded turismi planeerimisel ja sihtkoha arendamisel. Turismi mõju (majanduslik, sotsiaal-kultuuriline, keskkondlik). Taluvusvõime. Mõju haldamine. Sihtkoha ja turismi arendamise mõjutegurid (sh trendid). Turismipoliitika ja selle rakendamise võimalused. Sihtkoha olukorra, ressursside ja võimaluste hindamine. Arendustegevuste planeerimine ja tegevuskava koostamine. Tegevuste tulemuslikkuse hindamine tuleviku trende arvestades."}, "objectives": [{"en": "The learner understands the principles of sustainable development of tourism and destination, is aware of the influencing factors and the roles of stakeholders, and gains knowledge to plan development.", "et": "Õppija mõistab turismi ja sihtkoha kestliku arendamise põhimõtteid, teab mõjutegureid ja huvirühmade rolle ning omab teadmisi arendustegevuste planeerimiseks."}], "learning_outcomes": [{"en": "Upon the completion of the course the student: ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) is aware of the principles of sustainable development and management of tourism and different types of destination, and process and is able to explain their application;", "et": "1) teab turismi ja erinevat tüüpi turismisihtkohtade kestliku arendamise ja juhtimise põhimõtteid ning protsessi ja oskab selgitada nende rakendamist;"}, {"en": "2) analyzes the resources of tourism at the destination, the impact of tourism and the destination carrying capacity;", "et": "2) analüüsib sihtkoha turismi ressursse, turismi mõju ning sihtkoha taluvusvõimet;"}, {"en": "3) understands the roles of stakeholders and is able to assess their activities when developing tourism and destination;", "et": "3) mõistab turismiasjaliste (huvirühmade) rolle ning oskab hinnata nende tegevusi turismi ja -sihtkoha arendamisel;"}, {"en": "4) has an overview of trends and factors influencing the development;", "et": "4) omab ülevaate trendidest ja arendamist mõjutavatest teguritest;"}, {"en": "5) compiles the plan of tourism development for the destination and assesses its applicability considering the current trends.", "et": "5) koostab sihtkoha turismi arendamise plaani ning hindab selle rakendatavust võttes arvesse suundumusi."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}