{"uuid": "14c47013-3f4b-97a5-487b-2cac4f4fb2b1", "code": "SVPC.01.019", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Personal and Professional Development", "et": "Isiklik ja professionaalne areng"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC01", "structural_unit_name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPC01", "name": {"en": "Department of Entrepreneurship", "et": "ettevõtlusosakond"}, "phone": "+372 445 0532", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Part 1:\n1. Skills of the self-leading learner. Learning motivation. Development theories: development, competences, learning methods - relationships and drivers. The nature and necessity of reflection in the learning process. The role and responsibility of the student and lecturer in the learning process. Learning strategies and memory.\n2. Nature of the career and scenarios for career movement. Terms: manager, supervisor, coach, mentor, teacher, consultant, supervisor. Self-analysis and the necessary competencies for leaders. Group development steps, processes, and conflicts. Collaborative skills and communication within the team.\nPart 2:\n1. Coaching vs. mentoring. The nature and different types of coaching. Principles and focuses of coaching leadership. The actions of the coaching leader. Light Touch Coaching - everyday coaching. Practising everyday coaching models.\n2. Discussing independent homework. My successes and my learning curves. The GROW model - the model most used in coaching. Asking effective questions and listening actively. GROW model practice using the Coaching Lab method. Use of scales and metaphors.\n3. Discussing independent homework. Recalling the GROW model - Coaching Lab. Mind-mapping - mapping ideas. My personal plan - how and in what situations can I use coaching methods and techniques in my daily work?\n4. Group coaching process and methods.\n5. Personal development and career.\n6. Work performance management.", "et": "1. osa:\n1. Ennastjuhtiva õppija oskused. Õpimotivatsioon. Arenguteooriad: areng, pädevused, õppemeetodid - seosed ja mõjurid. Refleksiooni olemus ja vajalikkus õppeprotsessis. Üliõpilase ja õppejõu roll ja vastutus õppeprotsessis. Õppimisstrateegiad ja mälu.\n2. Karjääri olemus ja karjäärialase liikumise stsenaariumid. Terminid: juht, juhendaja, coach, mentor, treener, õpetaja, konsultant, superviisor. Eneseanalüüs ja juhile vajalikud pädevused. Grupi arenguastmed, -protsessid ja konfliktid. Koostööoskused ja kommunikatsioon meeskonnas.\n2. osa:\n1. Coaching vs mentorlus. Coachingu olemus ja erinevad tüübid. Coachiva juhtimise põhimõtted ja fookused. Coachiva juhi tegevused. Light Touch Coaching - Igapäevacoaching. Igapäevacoachingu mudelite harjutamine.\n2. Iseseisvate kodutööde arutamine. Minu õnnestumised ja õpikohad. GROW mudel - coachingus enimkasutaud mudel. Tõhusate küsimuste küsimine ja aktiivne kuulamine. GROW mudeli harjutamine Coaching Lab meetodil. Skaalade ja metafooride kasutamine.\n3. Iseseisvate kodutööde arutamine. GROW mudeli kordamine - Coaching Lab. Mind Mapping - ideede kaardistamine. Minu isiklik plaan - kuidas ja mis situatsioonides saan coachingu meetodeid ja võtteid kasutada oma igapäevatöös?\n4. Grupicoachingu protsess ja meetodid.\n5. Isiklik areng ja karjäär.\n6. Töösoorituse juhtimise temaatika."}, "objectives": [{"en": "Helping students learn to understand and make sense of their personal and professional development as members of the learning community in the context of university studies.", "et": "Aidata tudengil õppida mõistma ja mõtestama enda isiklikku ja professionaalset arengut õpikogukonna liikmena ülikooliõpingute kontekstis."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud õppija:"}, {"en": "Part 1:", "et": "1. osa:"}, {"en": "1) knows the main factors influencing learning motivation and can analyse themselves as a student;", "et": "1) teab peamisi õpimotivatsiooni mõjutavaid tegureid ning oskab analüüsida iseennast õppurina;"}, {"en": "2) can plan, evaluate and reflect on their learning activities, including in the context of career planning and development;", "et": "2) oskab planeerida, hinnata ja reflekteerida oma õpitegevust, sh karjääri planeerimise ja arengu kontekstis;"}, {"en": "3) can reflect on their experience of cooperation and self-development in the context of university studies based on different roles;", "et": "3) oskab reflekteerida oma koostöökogemust ja enesearengut ülikooli õpingute kontekstis lähtuvalt erinevatest rollidest;"}, {"en": "4) can draw up a development plan for themselves based on career goals and document their development.", "et": "4) oskab koostada iseendale arenguplaani lähtuvalt karjäärialastest eesmärkidest ning dokumenteerida oma arengut."}, {"en": "Part 2:", "et": "2. osa:"}, {"en": "1) understands the nature and different types of coaching;", "et": "1) mõistab coachingu olemust ning erinevaid tüüpe;"}, {"en": "2) knows the principles and focuses of coaching leadership;", "et": "2) teab coachiva juhtimise põhimõtteid ja fookusi;"}, {"en": "3) has become familiar with the methods used in coaching (scales, metaphors, mind-mapping);", "et": "3) on tutvunud coachingus kasutatavate meetoditega (skaalad, metafoorid, mind-mapping);"}, {"en": "4) can use the GROW model to lead conversations;", "et": "4) oskab kasutada GROW mudelit vestluse juhtimiseks;"}, {"en": "5) knows and can use a few everyday coaching models;", "et": "5) tunneb ja oskab kasutada paari igapäevacoachingu mudelit;"}, {"en": "6) knows the process and basic techniques of the group coaching methodology;", "et": "6) teab grupicoachingu metoodika protsessi ning peamisi tehnikaid;"}, {"en": "7) can manage a group coaching session;", "et": "7) oskab juhtida grupicoachingu sessiooni;"}, {"en": "8) can analyse and reflect on personal performance and that of others and the career development potential.", "et": "8) oskab analüüsida ja reflekteerida isiklikku ja teiste töösooritust ning karjäärialast arengupotentsiaali."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}