{"uuid": "176c41b9-76f3-4247-a7bd-988fb78842a7", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-24T11:42:14", "title": {"en": "Event Management", "et": "Sündmuskorraldus"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPC02", "structural_unit_name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "applied", "et": "rakenduskõrgharidusõpe", "en": "professional higher education studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "Events and event management. The types of events. The importance of event tourism in the development of a destination. Trends in event management. Factors impacting events. Socio-cultural, environmental and economic impact of event tourism. People related to event management - organizers, visitors, supporters etc. Conference tourism. Components of an event product. The planning process of an event. Risks and risk management. Budget and pricing in event management. Assessment of an event. Compiling event bidding. Event accomplishment. Analysis of activities and successfulness of the event. Terminology of event management in Estonian and English.", "et": "Sündmused ja sündmusturism. Sündmuste liigid. Sündmusturismi tähtsus sihtkoha arengus. Trendid sündmuskorralduses. Sündmusi mõjutavad tegurid. Sündmusturismi sotsiaal-kultuuriline, keskkondlik ja majanduslik mõju. Sündmuskorraldusega seotud asjalised, sh korraldajad, külastajad, toetajad jne. sündmuskorralduses. Konverentsiturism. Sündmustoote komponendid. Sündmuse planeerimisprotsess. Riskid ja riskijuhtimine. Eelarve ja hinnakujundus sündmuste korraldamisel. Sündmuse hindamine. Sündmuspakkumise koostamine. Sündmuse elluviimine. Tegevuste ja sündmuse tulemuslikkuse analüüs. Sündmuskorralduse sõnavara eesti ja inglise keeles."}, "objectives": [{"en": "The learner is aware of the impact of event tourism principles and of event planning, prepares an event offer that meets the client's expectations, and participates in event organization.", "et": "Õppija teab sündmusturismi mõju ja sündmuste planeerimise põhimõtteid, koostab kliendi ootustele vastava sündmuspakkumist ning osaleb sündmuse korraldamisel."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:  ", "et": "Õppeaine läbinud õppija:"}, {"en": "1) is aware of the principles of event management, the process of organizing, stakeholders, activities and influencing factors;", "et": "1) teab sündmuskorralduse põhimõtteid, korraldusprotsessi, huvirühmasid, tegevusi ja mõjutegureid;"}, {"en": "2) analyzes the impact of events on a destination;", "et": "2) analüüsib sündmuste mõju sihtkohale;"}, {"en": "3) plans and compiles the event bidding according to the client's expectations (budget incl);", "et": "3) planeerib ning koostab kliendi ootustele vastava sündmuspakkumist (sh eelarvet);"}, {"en": "4) gains the practical experience of event bidding participating in event management.", "et": "4) omandab praktilist sündmuskorralduse kogemust osaledes sündmuse korraldamisel."}], "notes": {"et": "Sihtrühm TH2, THSÕ2"}}, "grading": {"independent_work": {"et": "1. Sündmusturu ja sündmuste mõju analüüs (tähtaeg 20.09., individuaalne töö, eristav hindamine, kuni 15 punkti, lävend 1 punkti).\n2a. Sündmuse (TUFF) korraldamise esialgne plaan (tähtaeg 20.10., rühmatöö, mitteeristav hindamine, 10 punkti).\t\nvõi\n2b. Suursündmusel vabatahtlikuna abistamine - sündmuse valimine ja tutvustus, kokkulepe tegemine (tähtaeg 16.10, individuaalne töö, mitteeristav hindamine, 10 punkti).\n3. Veebipõhine kontrolltöö (tähtaeg 3.11., individuaalne töö, eristav hindamine, kuni 20 punkti, min lävend 10 punkti).\n4a. Sündmuse lõplik (täiendatud) korraldusplaan (tähtaeg 10.11., rühmatöö, eristav hindamine, kuni 30 punkti, lävend 15 punkti).\nvõi\n4b. Sündmuse analüüs (tähtaeg 24.11., individuaalne töö, eristav hindamine, kuni 30 punkti, lävend 15 punkti).\n5. Sündmuse elluviimine (5a töö tähtaeg on 23.11., 5b töö tähtaeg 8.12., mitteeristav hindamine, 10 punkti).\n6. Sündmuse ja meeskonnatöö analüüs (tähtaeg 20.12. või 10 päeva peale sündmust, individuaalne töö, eristav hindamine, 15 punkti, lävend 6 punkti)"}, "independent_work_assessments": [{"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Eristav hindamine, 15 punkti: hinnatakse, mil määral on esitatud töös käsitletud ette antud teemad, sh nende sisukus, põhjendatus, analüütilisus, seosed ning ilmestavad näited. Tulemus kujuneb igale teemale antud punktide summast järgneva hindamismudeli alusel: 3 punkti = vastus on sisuline ja asjakohane; 2 punkti = vastus on osaline; 1 punkt = vastus on suuresti puudulik; 0 punkti = vastus on vale või puudub. Minimaalselt on võimalik töö eest saada 1 punkt. Töö tähtajast hilisema esitamise korral võetakse lõpptulemusest maha 4 punkti."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "2a - Sündmuse korralduse esialgne plaan (mitteeristav, 10 punkti): Töö on arvestatud, kui selles on esitatud asjakohane ja piisav info vastavalt sisujuhendis esitatud teemadele, mis võimaldavad mõista plaani, tegevusi, rühmaliikmete tegevus, oodatavat tulemust ning hinnata plaani vastavust ülesande lähteandmetele, seoseid, tehtud valikuid jne. Töö tähtajast hilisema esitamise korral vähendatakse lõppsummat 2 punkti võrra.\n\n2b - Valitud sündmuse ja tegevuste ülevaade (mitteeristav, 10 punkti): Töö on arvestatud, kui selles on esitatud asjakohane ja piisav info vastavalt sisujuhendis esitatud teemadele, mis võimaldavad mõista plaani ja tegevusi ning saada infot sündmusest, kokkulepetest jne. Seejuures on vastatud kõikidel küsimustele ja kokkulepped on fikseeritud. Töö tähtajast hilisema esitamise korral vähendatakse lõppsummat 2 punkti võrra."}}, {"work_type": {"code": "test", "et": "Kontrolltöö", "en": "test"}, "description": {"et": "Kontrolltöö (eristav hindamine, kuni 20 punkti). Kontrolltöö tulemus kujuneb vastavalt saadud punktisummale. Maksimaalselt on võimalik kontrolltöö eest saada 20 punkti. Kontrolltöö on positiivselt sooritatud, kui testi tulemus on vähemalt 10 punkti ehk 50% testi maksimaalsest tulemusest. Valed vastused annavad miinuspunkte – mõne küsimuse puhul on miinuspunktid samad, mis positiivse vastuse osakaal, mõne küsimuse puhul on see väiksem (nt - 10% või 20%). Kui tulemus jääb alla 10 puntki, peab töö uuesti sooritama. Täpsemad järeltöö sooritamise tingimused ja vormi lepitakse kokku õppejõuga."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "4a - Sündmuse korralduse lõplik plaan (eristav hindamine, kuni 30 punkti): hinnatakse sündmuspakkumise terviklikust, vastavust ülesande lähteandmetele, teemade käsitluse põhjalikkust ja analüütilisist, seoste loomist, lahenduste asjakohasust ning praktilisust. Seejuures toimub hindamine järgnevate teemade ja punktisummade alusel: üldtutvustus, programm (sh toitlustus, kui seda pakutakse), kõnelejad kuni 5 punkti; korraldusplaan kuni 8 punkti; eelarve kuni 3 punkti; sündmuse kestlikkuse ja ligipääsetavuse tagamise tegevused kuni 3 punkti; riskide analüüs ja vältimise tegevused kuni 4 punkti; sündmuse hindamisplaan kuni 3 punkti; sündmuse turundusplaan kuni 4 punkti. Töö on positiivselt sooritatud, kui see vastab vähemalt 15 punktile ning ükski tegur hindamiskriteeriumis ei ole hinnatud 0 punktiga. Juhul, kui töö ei vasta miinimumnõudele, peab töö uuesti tegema või kui mõne sisukriteeriumi tulemus on 0 punkti, tuleb vastav osa aruandest täiendada ja uuesti esitada. Töö tähtajast hilisema esitamise korral võetakse lõpptulemusest maha 4 punkti.\n\n4b - Valitud sündmuse analüüs (eristav hindamine, kuni 30 punkti): töö hindamisel analüüsitakse, mil määral on esitatud töös käsitletud ette antud teemad, sh nende sisukus, põhjendatus, analüütilisus, seosed, piisavus ning ilmestavad näited. Tulemus kujuneb igale teemale antud punktide summast järgneva hindamismudeli alusel: 2 punkti = vastus on piisav ja asjakohane; 1 punkt = vastus on osaline; 0 punkti =vastus on puudulik või ei ole asjakohane ning seda iga sisukriteeriumi osas. Töö on positiivselt sooritatud, kui see vastab vähemalt 15 punktile ning ükski tegur hindamiskriteeriumis ei ole hinnatud 0 punktiga. Juhul, kui töö ei vasta miinimumnõudele, peab töö uuesti tegema või kui mõne sisukriteeriumi tulemus on 0 punkti, tuleb vastav osa aruandest täiendada ja uuesti esitada. Töö tähtajast hilisema esitamise korral võetakse lõpptulemusest maha 4 punkti."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Sündmuse korraldamine (mitteeristav hindamine, 10 punkti): Tegemist on mitteeristava hindamisega ehk kui sündmus on korraldatud ette antud ajaks ja tõestusmaterjalid (pildid ja/või video) on esitatud, siis on tulemuseks 10 punkti. Kui sündmus ei ole 8.12. seisuga korraldatud, siis tulemuseks selle osa eest on 0 punkti ja õppeaine jääb sooritamata."}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "Sündmuse ja tegevuste analüüs (eristav hindamine, kuni 15 punkti): töö hindamisel analüüsitakse, mil määral on esitatud töös käsitletud ette antud teemad, sh nende sisukus, põhjendatus, analüütilisus, seosed, piisavus ning ilmestavad näited. Tulemus kujuneb igale teemale antud punktide summast järgneva hindamismudeli alusel: 2 punkti = teema kajastus on asjakohane, piisav ja põhjendatud; 1 punkt = teema kajastatud ja põhjendatus on osaline; 0 punkti = teema ei ole kajastatud või ei ole kajastus asjakohane. Minimaalselt on võimalik töö eest saada 5 punkti. Vähem punkte saanud töö tuleb täiendada ja uuesti esitada. Töö tähtajast hilisema esitamise korral võetakse lõpptulemusest maha 3 punkti."}}], "min_points_from_tests": 51, "grade_preconditions": {"et": "1. Eeldusaineid õppeainel ei ole ning õppijad ei vaja ka erioskusi. Kasuks tuleb oskus töötada Excel-failiga.\n2. Sooritatud on kõik kohustuslikud iseseisvad tööd vähemalt etteantud minimaalse mahu ulatuses. \n3. Kõik iseseisvad tööd on sooritatud õigeaegselt.\n4. Kirjalikud tööd vastavad sisu- ja vormistusjuhendile."}, "grade_evaluation": {"et": "Iseseisvate tööde tulemuse alusel. Eraldi eksamit ei ole. Hindamisele pääsemiseks peavad olema kõik tööd tehtud."}, "grade_conditions": {"A": {"et": "91-100 p"}, "B": {"et": "81-90 p"}, "C": {"et": "71-80 p"}, "D": {"et": "61-70 p"}, "E": {"et": "51-60 p"}, "F": {"et": "0-50 p"}}, "debt_elimination": {"et": "Võlgnevuste likvideerimine toimub kokkuleppel õppejõuga vastavalt TÜ õppekorralduseeskirjale, kuid mitte hiljem kui 2 nädala jooksul peale töö esitamise tähtaega. Kuna mitmed tööd on üksteisega seotud, siis tähtajast hiljem esitatud tööd võivad mõjutada järgnevate tööde tulemuslikkust. Kokkulepitud tähtajast hiljem esitatud töödele põhjaliku tagasisidet ei anta, esitatakse vaid tulemuse punktisumma. Tööde hilisema esitamise korral ei ole võimalik lõpphindamisele pääseda."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {"et": "Hindamistulemused sisestatakse õppeinfosüsteemi peale lõpphindamist kahe nädala jooksul."}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "2f8f4481-a6c4-4570-944c-345fc81dea7a", "type": "MOODLE", "code": "SVPC.02.026_SO", "base_url": "undefined", "linked_to_groups": ["d24b9989-122a-be61-490e-b2e53847db68", "dca2bf60-8409-222a-7fea-b2084004e0c5"], "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "95026b62-f21f-98a8-e8a7-f6f65a920e31", "person_name": "Tatjana Koor", "structural_unit": {"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": true, "is_teaching": true, "study_group_roles": {"THSÕ2": {"code": "1", "et": "Lektor", "en": "lecturer"}, "TH2": {"code": "1", "et": "Lektor", "en": "lecturer"}}}, {"person_uuid": "302abdf5-7bb6-efa7-3fa6-6d2a8067f4e2", "person_name": "Kadri Karu", "structural_unit": {"code": "SVPC02", "name": {"en": "Department of Tourism Studies", "et": "turismiosakond"}, "phone": "+372 445 0524", "address": "Ringi 35\n80012 Pärnu linn, \nPärnu linn, Pärnumaa \nEST", "city": "Pärnu linn", "street": "Ringi 35", "zip": "80012", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "SVPC"}, "is_responsible": false, "is_teaching": true, "study_group_roles": {"THSÕ2": {"code": "1", "et": "Lektor", "en": "lecturer"}, "TH2": {"code": "1", "et": "Lektor", "en": "lecturer"}}}], "study_groups": [{"uuid": "dca2bf60-8409-222a-7fea-b2084004e0c5", "code": "TH2", "max_size": 15}, {"uuid": "d24b9989-122a-be61-490e-b2e53847db68", "code": "THSÕ2", "max_size": 30}]}, "schedule": {"weeks": {"et": "1-23"}}, "registration_info": {"audience": {}, "min_students": 15, "max_students": 45}, "parent_uuid": "b214ba0c-3d4b-0ec3-761c-f79d2ec60e28", "parent_code": "SVPC.02.026", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}