{"uuid": "001fd89e-e8d3-5944-ccbc-60d5443f7a69", "code": "SVPH.00.066", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-22T11:06:12", "title": {"en": "Multiculturalism, Learning and Work Mobility in the Context of Career Development", "et": "Mitmekultuurilisus, õpi- ja tööränne karjääri kujundamise kontekstis"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides students' knowledge and skills needed to support people on international learning and job mobility, and on multiculturalism, including working with clients with different cultural backgrounds. Participants learn how to provide support on the topic of international learning and job mobility and how to empower people at the international level.\n\nThe course consists of four equal modules:\n1.\tMulticulturalism and international mobility (26 academic hours), including 2 seminars (6 h)\n2.\tCareer guidance and learning mobility (26 academic hours), including 1 seminars (4 h)\n3.\tCareer guidance and work mobility (26 academic hours), including 1 seminars (4 h)\n4.\tIntercultural competence and career guidance for clients from different cultural backgrounds (26 academic hours), including 1 seminar (6 h)", "et": "Kursus annab õppijatele teadmisi inimeste toetamisest õpi- ja töörände teemadel ning  mitmekultuurilisusest, sh tööst erineva kultuuritaustaga kliendiga. Kursusel õpitakse kuidas pakkuda tuge rahvusvahelise õpi- ja töörände teemal ning kuidas võimestada inimesi rahvusvahelisel tasandil.\n\nKursus koosneb neljast võrdsest moodulist:\n1.\tMitmekultuurilisus ja rahvusvaheline ränne (26 ak/h), sh  2 seminari (6 ak/h)\n2.\tKarjäärinõustamine ja õpiränne (26 ak/h), sh 1 seminar (4 ak/h) \n3.\tKarjäärinõustamine ja tööränne (26 ak/h) sh 1 seminar (4 ak/h) \n4.\tKultuuridevaheline kompetents ja erineva kultuuritaustaga inimeste nõustamine (26 ak/h), sh 1 seminar (6 ak/h)"}, "objectives": [{"en": "Based on modern theories and research, the course provides an opportunity to expand understanding related to international learning and work mobility, and multiculturalism more broadly, and to gain knowledge for working with people who want to go to study or work abroad and who have come to Estonia from abroad and need further career guidance.", "et": "Kaasaegsetele teooriatele ja uuringutele tuginev kursus annab võimaluse mõtestada inimeste õpirännet, töörändega seotud küsimusi ja mitmekultuurilisust laiemalt ning saada teadmisi tööks inimestega, kes soovivad minna õppima või töötama välismaale ning kes on tulnud Eestisse välismaalt ja soovivad karjäärialast nõustamist."}], "learning_outcomes": [{"en": "The graduate will:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- know the key terminology and basic concepts of International learning and job mobility;", "et": "- teab õpi- ja töörände põhimõisteid ja olemust;"}, {"en": "- understand the value of learning and job mobility and its potential for career development;", "et": "- mõistab õpi- ja töörände tähtsust ning selle potentsiaali karjääri kujundamisel;"}, {"en": "- be aware of the various opportunities and information resources for international mobility;", "et": "- teab erinevaid rahvusvahelise rände võimalusi ja allikaid;"}, {"en": "- be able to support individuals in matters related to mobility, including motivating, preparing, supporting throughout the mobility and return;", "et": "- oskab toetada indiviide õpi- ja töörändega seotud küsimustes, sh motiveerida, ette valmistada, toetada kogu protsessi jooksul;"}, {"en": "- be aware of multiculturalism, the peculiarities of different cultures and the diversity of values, and is able to advise clients with different cultural backgrounds on issues related to learning and work in Estonia.", "et": "- mõistab, mis on mitmekultuurilisus, saab aru erinevate kultuuride eripäradest ja väärtuste mitmekesisusest ning oskab erineva kultuuri taustaga kliente nõustada Eestis õppimisega ja töötamisega seotud küsimustes."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}