{"uuid": "6097f9d6-13df-d7b9-ecb8-53a46bac54a6", "code": "SVPH.00.064", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Ethical Issues in Psychology", "et": "Eetika probleemid psühholoogias"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course gives an overview of ethical principles and codes of ethics for psychologists. The participants bring with them several analyses of their attitudes and beliefs about professional and ethical issues that form the study material for the course. The course will provide case vignettes and participant practicing of making use of seven steps in ethical decision making process", "et": "Kursus annab ülevaate psühholoogide eetilistest printsiipidest ja kutse-eetika koodeksitest. Kursusel tuleb esitada mitmeid isesesivaid töid, mis moodustavad olulise osa õppematerjalist. Seetõttu leiab kursuse lõplik planeerimine aset koos selle tulevaste osalejatega. Kõik teemad töötatakse läbi kaasuste analüüsi ning praktiliste harjutuste toel. Osalejad õpivad rakendama  eetiliste dilemmade lahendamise mudelit."}, "objectives": [{"en": "To give knowledge on ethical principles and regulations for psychologists (in science and practice) and  on ethical decision-making process to solve main ethical dilemmas and problems in professional work of psychologists.", "et": "Anda teadmised psühholoogide (nii teadlaste kui praktikute) töö  eetilistest printsiipidest ja regulatsioonidest. Anda oskused lahendada peamisi  kutsetöös esinevaid eetilisi dilemmasid ja probleeme."}], "learning_outcomes": [{"en": "Knowledge of ethical principles and code of conduct for psychologists working in practice and science.  Skills in ethical decision-making to solve ethical dilemmas in professional work of psychologists. Skills in identification of underlying values and value conflicts. Ability to distinguish ethical approach and action from unethical behaviour in professional psychology.", "et": "Teab praktiliste ja teaduspsühholoogide eetilisi printsiipe ja käitumisjuhiseid.  \nOskab märgata, analüüsida ja lahendada peamisi  kutsetöös esinevaid eetilisi dilemmasid.\n Oskab sedastada väärtusi ja väärtuskonflikte.\nEristab eetilist mõtteviisi ja tegutsemist psühholoogi kutsetöös ebaeetilistest hoiakutest ja käitumisest."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}