{"uuid": "eb1816f2-b709-5236-4a58-8ba8cdf61389", "code": "sv-2024-spring-fulltime-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-21T10:53:21", "title": {"en": "Children's Remembering and Learning in Informal Contexts", "et": "Laste mälu ja õppimine igapäevasündmuste kontekstis"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV Eng", "et": "24/25 K PÕ SV Eng"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 6, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": false, "uuid": "cee3f72f-a167-b626-2abf-efb200d567fc", "code": "SOPH.00.283", "title": {"en": "Developmental Psychology", "et": "Arengupsühholoogia"}, "credits": 3, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}, {"required": false, "uuid": "a9958d76-2be9-cc7a-e593-478d362e3487", "code": "SHPH.00.038", "title": {"en": "Basic Functions of the Mind", "et": "Psüühika põhifunktsioonid"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-09T14:29:45"}, {"required": false, "uuid": "9e49469e-acb1-f4e8-edf7-ae27c307bc7e", "code": "SHPH.00.039", "title": {"en": "Cognitive Psychology", "et": "Kognitiivne psühholoogia"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "This course focuses on children's learning during experiences in informal contexts (visits to museums, specific one-time events, discussions at home). We look at studies focusing on interactions with children during and after these events to see how adults help children make sense of the events and consolidate the memory for learning new information and skills. The course could be of general interest to a wide variety of learners, as it discusses the general mechanisms that support children's remembering and learning in their everyday experience. It is also useful for anyone planning to work with children as it focuses on how children's remembering and learning can be enhanced in informal settings and what other aspects (e.g., level of expertise, gender of the child etc.) could affect the experience of children, and, therefore, have an effect on prospective learning and remembering.", "et": "Kursus keskendub laste õppimisele, mis toimub mitteformaalses kontekstis (muuseumikülastused, ühekordsed sündmused, arutelud kodus jms.). Kursuse käigus tutvutakse uurimustega, mis keskenduvad vestlustele lastega selliste sündmuste ajal ja pärast sündmuste toimumist. Need uurimused näitavad, kuidas täiskasvanud aitavad lastel sündmusi mõista ja mäletada ning nii omandada uusi teadmisi ja oskuseid. Kursus võib huvi pakkuda erineva taustaga tudengitele, sest keskendub üldistele mehhanismidele, mis igapäevasündmuste ajal laste mäletamist ja õppimist toetavad. Kursus on kasulik kõikidele, kes plaanivad lastega töötada, sest puudutab ka küsimusi, kuidas õppimist ja mäletamist mitteformaalses keskkonnas soodustada ja millised teised asjaolud (nt. olemasolevad teadmised, lapse sugu jne.) laste kogemust ning seeläbi ka õppimist ja mäletamist võivad mõjutada."}, "objectives": [{"en": "The course focuses on the importance of informal learning in children's development. It aims to show how and why different aspects of everyday experiences and individual factors of families affect children's learning and remembering in such contexts.", "et": "Antud kursus keskendub laste igapäevastele kogemustele mitteformaalsetes õpikeskkondades ning nende olulisusele laste arengus. Kursuse eesmärk on näidata, kuidas ja miks mõjutavad igapäevaste kogemuste erinevad aspektid ja laste ning perekondade individuaalsed erinevused laste õppimist ja mäletamist sellistes kontekstides."}], "learning_outcomes": [{"en": "The students will:", "et": "Kursuse läbinud tudengid:"}, {"en": "1) Know how learning in informal setting relates to memory development and theories of learning/development;", "et": "1) Teavad, kuidas on õppimine mitteformaalses kontekstis seotud mälu arengu ja õppimis-/arenguteooriatega;"}, {"en": "2) Know which contexts are referred to and what are the common methods used when informal learning is talked about and studied;", "et": "2) Teavad, millised on mitteformaalsed õpikeskkonnad ja milliseid meetodeid seal uurimuste läbiviimiseks kasutatakse;"}, {"en": "3) Be familiar with the general mechanisms and individual factors that affect what is learned and remembered by children in informal contexts.", "et": "3) Tunnevad üldiseid mehhanisme ja individuaalseid faktoreid, mis mõjutavad laste õppimist ja mäletamist mitteformaalses kontekstis."}], "notes": {}}, "grading": {"independent_work": {"et": "Students are required to read one article (from the selection provided by the instructor) before the lecture and write a reaction paper to the article three times throughout the course. One time during the course the students are asked to write a reaction paper based on their own experience. All in all, students are expected to write 3 reaction papers to articles, and one personal reaction paper (4 papers in total).\nEach reaction paper to an article is 1 page in length with no title page, and it should include four components:\n- An idea/conclusion/implication of the article that you agree with;\n- An idea/conclusion/implication of the article you do not (fully) agree with;\n- Questions that arise for the reader, but remain unanswered by the article (could include more general questions, discussion questions, e.g., about the applicability in other contexts, or questions arising from personal experience);\n- Thougths on the usefulness of the knowledge that the article presents.\nEach component should refer back to a particular section in the article and explain *why* the reader is of a particular opinion or position.\nThe reaction paper based on personal experience is also 1 page in length with no title page and should relate the personal experience about visiting an informal context (museum, zoo, etc.) to the ideas presented during the course. The reaction paper should cover an explanation of and evaluation of (1) the learning opportunities present in the context, (2) their personal learning experience, and (3) factors that affected their learning experience.\nExtra credit can be earned by students by writing a follow-up to their own reaction paper answering the questions they raised after the lecture, but before the final exam.\nIn additions, each prerecorded lecture is followed by a small engagement/comprehension task in the moodle the student has to finish. These tasks combined provide 8 points in total towards the final grade."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Throughout the course the student has to write four reaction papers. The maximum number of points that can be received for each reaction paper is 12 (maximum 48 points in total).\n6 - 8 points: the paper is either only descriptive of the article, or, on the contrary, is not connected or is only loosely connected to the article (no explanation or examples given for the statements made etc.)\n8 - 9 points: the paper is in general in compliance with the requirements, but lacking some required aspects (e.g., strengths or weaknesses of the study described in the article not pointed out or pointed out, but not explained; questions raised by the article not provided etc.) \n10-12 points: the paper covers all the required aspects with only minimal oversights.\nExtra points can be earned throughout the class by writing a response to one's own reaction paper after the lecture, but before the exam."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Throughout the on-line course students are expected to do small engagement and comprehension tasks after each prerecorded lecture.These tasks give a maximum of 8 points."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "In order to pass the exam the student has to receive more than 50% of the points possible (e.g., 23 of 44 points)."}}], "grade_preconditions": {"et": "At least three out of four reaction papers submitted."}, "grade_evaluation": {"et": "The four reaction papers make up 48% of the grade (12% each paper); the comprehension/engagement tasks 8%, and the exam accounts for 44% of the final grade. \nThe final grade is the combination of all points received throughout the course; students with 50 points or less do not pass the course (F). Points above 50 are mapped to final grades as follows:\n51-60 E\n61-70 D\n71-80 C\n81-90 B\n91-100 A"}, "debt_elimination": {"et": "Overdue reaction papers are NOT accepted. If the student has missed the deadline for the paper, they can make up one reaction paper at the end of the course before the exam. The topic of that paper is to be specified with the instructor."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "15c44768-c869-442e-8fbc-edae22f4e60f", "type": "MOODLE", "code": "SVPH.00.010_Eng", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "e133b41f-5ad2-f2dc-1f9b-948bff140b23", "person_name": "Pirko Tõugu", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}], "assistants": ["eea04589-1011-6286-3c86-8f80e0a4b89b"]}, "schedule": {"weeks": {"et": "25,27,29,31,35,37"}, "entries": [{"course_week": 25, "time": "2025-02-19", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Introduction to the course. "}, "description": {"et": "Time 1. At the first meeting we will go over the requirements and design of the course activities in order to understand what you have to do throughout the course and how do you get the final grade. \nLearning activities for the topic of Time 1 are online! The topic of Time 1 is general overview of memory and memory development in childhood. Theories of learning applied to informal learning settings."}}, {"course_week": 27, "time": "2025-03-05", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 2, "topic": {"et": "Autobiographical memory and reminiscing"}, "description": {"et": "Time 2. This session is online! (See moodle for details!) The topic of this session is autobiographical memory and reminiscing in childhood.\n(reaction paper based on an article read is due before the lecture)"}}, {"course_week": 29, "time": "2025-03-19", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 3, "topic": {"et": "Interaction and play at home"}, "description": {"et": "Time 3. This session is online! (See moodle for details!) The topic of this session is interactions and play at home: acquiring language and learning about the world. \n(reaction paper on an article read is due before the lecture)"}}, {"course_week": 31, "time": "2025-04-02", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "Informal learning contexts"}, "description": {"et": "Time 4. The seminar will take place in person!\nInformal learning contexts as environments for learning:methods, locations, research questions, challenges.\n(reaction paper based on a personal experience is due before the seminar)"}}, {"course_week": 35, "time": "2025-04-30", "work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic_number": 5, "topic": {"et": "Learning in informal learning contexts"}, "description": {"et": "Time 5. This session is online! (See moodle for details!) The topic of this session is learning in informal learning contexts (museums, zoos, aquariums etc.).\n(reaction paper based on an article read is due before the lecture)"}}, {"course_week": 37, "time": "2025-05-14", "work_type": {"code": "test", "et": "kontrolltöö", "en": "test"}, "topic_number": 1, "topic": {"et": "Test (via moodle)"}, "description": {"et": "Time 6. Test. (Online.)"}}]}, "registration_info": {"audience": {}, "max_students": 42}, "parent_uuid": "b0f8eca1-6377-6ef1-18a8-31aee5c08b8b", "parent_code": "SVPH.00.010", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}