{"uuid": "7b63c155-a3ea-16b9-e867-53ecd7bf6e15", "code": "SVPH.00.046", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "History of Psychology", "et": "Psühholoogia ajalugu"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Systematic review of the two large periods in the history of psychology: (1) Before psychology was recognized as an independent field of knowledge, and (2) History of psychology proper which divides into two periods: philosophical psychology of Locke, Berkeley, Leibnitz and Kant, and emergence of experimental (or scientific)  psychology with the works of Wundt and Ebbinghaus.", "et": "Kursus annab süstemaatilise ülevaate psühholoogia ajaloost, mida vaadeldakse kahe suur perioodina: (1) Eelajalugu: loodusrahvaste hingekäsitlus, psüühika käsitlused vanaaja kõrgkultuurides, lääne tsivilisatsiooni tekkimine (\"Kreeka ime\"), psühholoogia antiikmaailmas (Platon ja Aristoteles), psühholoogia keskajal (Augustinus ja Aquino Thomas), uusaja filosoofia (Descartes); (2) Pärisajalugu: filosoofiline psühholoogia (Locke, Berkeley, Leibnitz, Kant jt.), eksperimentaalpsühholoogia künnisel (Fechner, Helmholtz jt.), psühholoogia kui iseseisva teaduse tekkimine (Wundt, Ebbinghaus), koolkondade ajastu (strukturalism, gestaltism, biheiviorism jne.),  psühholoogia tänapäev (alates 50-ndate aastate lõpust). Vaadeldakse psühholoogia eri avaldusvorme: Lääne tsivilisatsiooni nähtusena, psühholoogia kui teadus ja kui ühiskonna nähtus."}, "objectives": [{"en": "Knowledge and critical evaluation of psychological fact, explanations and theories in their historical context.", "et": "Õpetab tundma ja kriitiliselt hindama psühholoogiliste faktide, seletuste ja teooriate päritolu ja nende ajaloolist tausta."}], "learning_outcomes": [{"en": "knowing historical facts; understanding historical and social context; critical thinking concerning psychological facts and theories; better ability to explain psychology for wider audiences.", "et": "psühholoogia ajaloo faktide tundmine; kultuurilise ja sotsiaalse tausta mõistmine; kriitiline suhtumine psühholoogia faktidesse ja teooriatesse; parem oskus seletada psühholoogia tõdesid laiemale publikule;"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}