{"uuid": "f61e9141-5171-b4b2-8de4-ebc4e17d044e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-02-19T22:24:32", "title": {"en": "Individual Psychological Resources and Their Development (Psychological Counsellor)", "et": "Inimese psühholoogilised ressursid ja nende arendamine (psühholoog-nõustaja)"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 4, "seminar": 16, "independent_work": 54, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The course \"Human Psychological Resources and Their Development\" introduces psychology master's students to psychological resources and opportunities for their enhancement. Focusing on the concepts of positive psychology and psychological capital, the course explores self-regulation, competence, optimism, social connectedness, and hopefulness as essential foundations of mental well-being. It includes practical methods for strengthening self-esteem, inner dialogue, mindfulness, resilience, and self-regulation.\nStudents will acquire skills to apply playfulness, empathy, and meaning-making in both personal development and counseling practice. Through experiential learning, participants will learn to identify and utilize psychological resources to enhance coping and mental well-being, providing clients with evidence-based and effective solutions.", "et": "Kursus „Inimese psühholoogilised ressursid ja nende arendamine” tutvustab magistriõppe psühholoogiatudengitele psühholoogilisi ressursse ja nende arendamise võimalusi. Keskendudes positiivse psühholoogia ja psühholoogilise kapitali kontseptsioonidele, uuritakse enesekontrolli, kompetentsust, optimismi, sotsiaalsust ja lootusrikkust kui vaimse heaolu olulisi alustalasid. Kursus hõlmab praktilisi meetodeid enesehinnangu, sisekõne, teadveloleku, resilientsuse ja eneseregulatsiooni tugevdamiseks.\nTudengid omandavad oskusi, kuidas rakendada muuhulgas mängulisust, empaatiat ja tähenduse loomist nii isiklikus arengus kui ka nõustamispraktikas. Läbi kogemusliku õppimise õpitakse ära tundma ja kasutama psühholoogilisi ressursse toimetulekuks ja vaimse heaolu edendamiseks, pakkudes klientidele teaduspõhiseid ja tõhusaid lahendusi."}, "objectives": [{"en": "The course introduces human psychological resources, their development opportunities, and practical methods that psychology master's students can apply in both personal growth and counseling practice. The course supports students in utilizing a resource-based approach to enhance mental well-being and resilience for themselves and their clients.", "et": "Kursus tutvustab inimese psühholoogilisi ressursse, nende arendamise võimalusi ning praktilisi meetodeid, mida magistriõppe psühholoogiatudengid saavad rakendada nii isiklikus arengus kui ka nõustamispraktikas. Kursus toetab tudengite oskust kasutada ressursipõhist lähenemist nii enda kui klientide vaimse heaolu ja toimetuleku edendamiseks."}], "learning_outcomes": [{"en": "* Knows exercises that though constant practice enable the development of efficient self-regulation, and is able to carry out these exercises independently.", "et": "* Tunneb harjutusi, mis pikaajalisel praktiseerimisel tagavad tõhusa eneseregulatsiooni, on võimeline neid iseseisvalt läbi viima ja ka teisele õpetama."}, {"en": "* Is able to describe human psychological resources and their significance.", "et": "* Oskab kirjeldada inimese psühholoogiliste ressursse ja nende tähtsust."}, {"en": "* Knows evidence-based methods for assessing and developing psychological resources.", "et": "* Tunneb tõenduspõhiseid meetodeid psühholoogiliste ressursside hindamiseks ja arendamiseks."}, {"en": "* Is able to apply various exercises and techniques in practice to address clients' issues and support personal development.", "et": "* Oskab rakendada praktikas erinevaid harjutusi ja nippe klientide probleemide leevendamiseks ja ka isiklikuks arenguks."}, {"en": "* Is able to analyze ethical and practical aspects related to the development of resources in counseling.", "et": "* Oskab analüüsida eetilisi ja praktilisi aspekte, mis on seotud ressursside arendamisega nõustamises."}, {"en": "* Develops awareness of their own resources and their application in a professional role.", "et": "* Kujundab teadlikkust enda ressurssidest ja nende kasutamisest professionaalses rollis"}], "notes": {"et": "Kursusel osalemine eeldab isikliku vastutuse võtmist oma piiride ja heaolu eest; iseenda ja kaastudengite heatahtlikku ja lugupidavat kohtlemist; ning valmisolekut kursusekaaslaste ees sõna võtma ning harjutusi läbi viima ja ka tesiste harjutuste ajal katseisikuks olema."}}, "grading": {"independent_work": {"et": "1. Harjutused ja enesejälgimise töölehed läbivad kogu kursust ja antakse iga kord vastavas seminaris. Nende põhjal tegutseb üliõpilane kohtumiste vahepeal (soovitavalt peab privaatset päevikut), kogemusi reflekteeritakse vahepeal väikegrupi kohtumistel, mille kokkuvõtted esitatakse Moodlesse (mille alusel toimub kursuse lõpus hindamine). Seega - kogemusi reflekteeritakse nii kohapeal ja väikegruppides.\n2. Praktiline töö - harjutuse juhendamine väikegrupiga. Valida või töötada välja koostöös kursuse alguses loodavates väikegruppides üks harjutus, tööleht, soojendusharjutus, meditatsioon või rollimäng, mille läbimine võiks aidata psühholoog-nõustajal iseenda psühholoogilisi ressursse arendada. Juhendada selle harjutuse läbimist ja refleksiooni oma kaasõppuritel ja saada nendelt pärast tagasisidet. Ettevalmistuse osaks on ka harjutuse eesmärgi ja juhendi sõnastamine ja seostamine teooriaga, ka teooriale, toimemehhanismi või tõhusust näitavatele teadusuuringutele viitamine."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Jooksev kodutöö seisneb koduses harjutamises ja enesejälgimise päeviku täitmises kursuse vältel. See on privaatne, kuid nii seminarides kui grupikohtumisel jagatakse kogemusi, mille alusel hinnatakse enesereflektsiooni, arutlus- ja psühholoogile vajalike omaduste demonstreerimist aruteludes. (Vt psühholoogide kutsetes kirjeldatud omadusi.) Täpsem juhis Moodles."}}, {"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "Õpipäevikut täidetakse grupina: jooksvat kodutööd ja auditoorsetes kohtumistes kogetut reflekteeritakse väikestes gruppides auditoorse töö vahel ning grupikohtumise kokkuvõte esitatakse Moodlesse. Hinnatakse reflektsiooni- ja analüüsioskust ning sidumist kursuse teemadega. Täpsem juhis Moodles."}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Iseseisev töö paarides või individuaalselt: teaduskirjandusega toetatud praktiline harjutus nn pööratud klassiruumi võtmes (40%).\nTudengid valivad väikese grupina ühe ressursside teema, teevad ülevaate teaduskirjandusest (min 10 tõenduspõhist allikat) ning seovad praktilise töölehe või harjutusega (võib ka ise välja mõelda), mida saab kasutada klientide nõustamisel. Kirjalik töö riputatakse kursuse ühiskausta kursusekaaslastega jagamiseks. Tööd koos praktilise töövahendiga esitletakse auditooriumis soovitavalt koos harjutamisega, rõhk praktilisel väljundil. Kindlasti peab olema selgelt välja toodud, mis on harjutuse/töölehe/nipi eesmärk koos täpse juhendiga ning selgitatud, kuidas teaduskirjandus seda toetab, samuti tuleb kirja panna pärast harjutust esitatavad reflektsiooniküsimused. Punktid moodustuvad kaastudengite tagasiside põhjal. Täpsem juhis Moodles."}}], "grade_preconditions": {"et": "Tehtud on praktiline ülesanne (kriteeriumitele vastav kirjalik töö on riputatud Moodlesse ja see on ka koos praktilise harjutusega ette kantud); osaletud on grupikohtumiste aruteludel ja grupikohtumiste kokkuvõtted on esitatud vastavasse Moodle pessa; osaletud on aktiivselt 75% auditoorses töös."}, "grade_evaluation": {"et": "Osalemine (kohalkäimine), läbiv harjutamine + arvamuse avaldamine 30%\nGrupikohtumiste aruteludel osalemine, mida peegeldavad grupina esitatud kirjalikud reflektsioonid 30%\nPraktiline ülesanne koos kirjaliku ja praktilise osaga, st kaastudengitele ette kantud ja harjutatud 40%"}, "debt_elimination": {"et": "Võlgnevused likvideeritakse semestri jooksul."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "920cfc1f-fa66-448e-9a74-0ffddc9e79e5", "type": "MOODLE", "code": "SVPH.00.089", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "b2ed8c8e-61b1-e549-7242-e6ab1e284c1e", "person_name": "Kariina Laas", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "25, 27, 29, 31, 33, 37"}, "entries": [{"course_week": 25, "time": "2025-02-20", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus ainesse. Ülevaade teooriatest, mis käsitlevad psühholoogilisi ressursse ja hakkamasaamist. Positiivne psühholoogia kliinilises praktikas. Enesehinnang; sisekõne ja teadlikkus; väärtused; resilientsus: stressimudelid, kohanemisvõime, paindlikkus, visadus, eesmärgipärane tegutsemine."}}, {"course_week": 25, "time": "2025-02-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Psühholoogiliste ressursside tundmise ja arendamise olulisus praktiseeriva psühholoogi töös: nii enda kui kliendi perspektiiv."}}, {"course_week": 27, "time": "2025-03-06", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "KONTROLL: autonoomsus ja kompetentsus, tajutud kontroll, eneseregulatsioon, meisterlikkus, enesetõhusus."}}, {"course_week": 27, "time": "2025-03-06", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {"et": "KONTROLL: autonoomsus ja kompetentsus, tajutud kontroll, eneseregulatsioon, meisterlikkus, enesetõhusus."}, "description": {}}, {"course_week": 29, "time": "2025-03-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "OPTIMISM: positiivne hoiak, positiivsed emotsioonid ja posit emotsiooniringete ärakasutamine (mängulisus, uudishimu, rõõm, huumor, nauding, nn kulgemine, …)."}}, {"course_week": 29, "time": "2025-03-20", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {}, "description": {"et": "OPTIMISM: positiivne hoiak, positiivsed emotsioonid ja posit emotsiooniringete ärakasutamine (mängulisus, uudishimu, rõõm, huumor, nauding, nn kulgemine, …)."}}, {"course_week": 31, "time": "2025-04-03", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "SOTSIAALSUS: sotsiaalne tugi, lähedus ja hoolitsemine, heatahtlikkus, suhtlemisoskused, empaatia, Theory of Mind, kriitilise sisekõne ning sotsiaalsete emotsioonide häbi ja süü leevendamine."}}, {"course_week": 31, "time": "2025-04-03", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {"et": "SOTSIAALSUS: sotsiaalne tugi, lähedus ja hoolitsemine, heatahtlikkus, suhtlemisoskused, empaatia, Theory of Mind, kriitilise sisekõne ning sotsiaalsete emotsioonide häbi ja süü leevendamine."}, "description": {}}, {"course_week": 33, "time": "2025-04-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "LOOTUSRIKKUS: elu mõtte ja eesmärgi tajumine, tähenduse otsimine, spirituaalsus, eksistentsiaalsed ressursid, tegutsemine hoolimata tagasilöökidest."}}, {"course_week": 33, "time": "2025-04-17", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 5, "topic": {}, "description": {"et": "LOOTUSRIKKUS: elu mõtte ja eesmärgi tajumine, tähenduse otsimine, spirituaalsus, eksistentsiaalsed ressursid, tegutsemine hoolimata tagasilöökidest."}}, {"course_week": 37, "time": "2025-05-15", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "Huvipakkuvad ressursiteemad."}}, {"course_week": 37, "time": "2025-05-15", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 6, "topic": {}, "description": {"et": "Huvipakkuvad ressursiteemad ja kursuse kokkuvõte."}}]}, "registration_info": {"audience": {}, "min_students": 10, "max_students": 37}, "parent_uuid": "aa114f1d-ebb3-a7d4-03bc-4b2d2755a69b", "parent_code": "SVPH.00.089", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}