{"uuid": "9fb3815f-0c86-1356-2953-ec0b9815dfc9", "code": "SVPH.00.078", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Academic Self-Management", "et": "Akadeemiline enesejuhtimine"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Study regulations and academic conventions of the university are introduced. An overview is given about effective learning and means of supporting mental health. Academic reading, writing, and presenting are practiced.", "et": "Loengute, seminaride, kirjalike ülesannete ja ettekande pidamise võimaluste kaudu toetatakse õpiväljundite omandamist. Tutvustatakse õppekorraldust, akadeemilisi tavasid. Antakse ülevaade efektiivsest õppimisest ja vaimse tervise toetamisest ning luuakse eneserefleksiooni võimalused. Tutvustatakse suulise ja kirjaliku teadusliku eneseväljenduse eripära. Harjutatakse akadeemilise teksti lugemist ja kirjutamist ning suulise ettekande koostamist ja esitamist."}, "objectives": [{"en": "To give students the basic skills needed in studying in the university.", "et": "Anda osalejatele põhioskused ülikoolis õppimiseks."}], "learning_outcomes": [{"en": "Student composes a realistic study plan. ", "et": "Üliõpilane kavandab oma õpinguid ülikoolis arvestades õppekava ja õppekorraldust."}, {"en": "Student knows and is able to put into practice the main psychological principles of learning. ", "et": "Üliõpilane teab õppimise peamisi psühholoogilisi mehhanisme ja oskab neid õppides rakendada."}, {"en": "Students knows how to take care of mental health and where to seek help if needed.", "et": "Üliõpilane teab, kuidas oma vaimset tervist toetada ja kust vajadusel abi otsida."}, {"en": "Student knows the basic principles of scientific communication and is able to use bibliographic data bases. ", "et": "Üliõpilane on kursis psühholoogia teaduskommunikatsiooni aluspõhimõtetega ja oskab algtasemel kasutada bibliograafilisi andmebaase."}, {"en": "Student is able to communicate scientific material both in writing and in oral presentations.", "et": "Üliõpilane oskab väljendada end nii kirjalikult kui ka suuliselt psühholoogiaalase teaduskommunikatsiooni kontekstis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}