{"uuid": "ad4bdee4-6558-a7c1-7498-3e9b7ab2d835", "code": "SVPH.00.073", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sport and Performance Psychology", "et": "Spordi- ja soorituspsühholoogia"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Kursus annab ülevaate peamistest inimese tunnetust ja käitumist suunavatest ja reguleerivatest teguritest spordi ja muude oskuste meisterlikule sooritamisele orienteeritud valdkondade kontekstis. Käsitletakse tunnetuspsühholoogia peamisi valdkondi (tähelepanu, mälu, õppimine, mõtlemine), emotsioonide ja motivatsiooni seoseid, inimese arengut ja individuaalseid erinevusi, grupiprotsesse ja juhendamist ning eestvedamist, psühholoogiliste oskuste treenimise aluseid, liikumisega seotud tervisekäitumist ja sooritust takistavaid tegureid. Teemade käsitlemisel lähtutakse liigutusoskuste omandamise ja reguleerimise seisukohalt olulistest probleemidest.\n \tThis course provides an overview of the main factors that regulate human cognitive and behavioral processes in sport and other fields oriented to mastering performance skills. Main issues of cognitive psychology (attention, memory, learning, thinking), associations between emotions and motivation, human development and individual differences, group processes, instruction, and leadership, bases of psychological skills training, exercise-related health behavior, and factors inhibiting performance are focused on. Aspects relevant for understanding the acquiring and regulating motor skills are accentuated.", "et": "Kursus annab ülevaate peamistest inimese tunnetust ja käitumist suunavatest ja reguleerivatest teguritest spordi ja muude oskuste meisterlikule sooritamisele orienteeritud valdkondade kontekstis. Käsitletakse tunnetuspsühholoogia peamisi valdkondi (tähelepanu, mälu, õppimine, mõtlemine), emotsioonide ja motivatsiooni seoseid, inimese arengut ja individuaalseid erinevusi, grupiprotsesse ja juhendamist ning eestvedamist, psühholoogiliste oskuste treenimise aluseid, liikumisega seotud tervisekäitumist ja sooritust takistavaid tegureid. Teemade käsitlemisel lähtutakse liigutusoskuste omandamise ja reguleerimise seisukohalt olulistest probleemidest."}, "objectives": [{"en": "After the course, students will be able to identify psychological and social processes related to mastering and performing athletic and other speciality skills, and to integrate those processes in the context of development, leadership, well-being, and health.", "et": "Kursuse läbimisel oskab õppija selgitada nii spordialade kui muude erialaste oskuste meisterliku omandamise ja sooritamisega seotud psühholoogilisi ja sotsiaalseid protsesse ning seostab neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis."}], "learning_outcomes": [{"en": "Students will be able to", "et": "Kursuse lõpetamisel õppija:"}, {"en": "1.\tdescribe a wide range of topics covered by sport and performance psychology", "et": "1.\tkirjeldab spordi- ja soorituspsühholoogia teemade ulatust ja sisu"}, {"en": "2.\tdemonstrate a basic understanding of research methods and design in sport and performance psychology", "et": "2.\tdemonstreerib baasteadmisi spordi- ja sooritusspsühholoogia uurimismeetodite alal"}, {"en": "3.\tanalyses biological, developmental, motivational, social, and environmental factors affecting the development of skills and expertise. ", "et": "3.\tanalüüsib oskuste õppimist ja ekspertsuse arengut mõjutavaid bioloogilisi, arengulisi, motivatsioonilisi, sotsiaalseid ja keskkondlikke tegureid"}, {"en": "4.\texplain psychological processes affecting performance and describes their interrelations in the context of performance", "et": "4.\tselgitab oskuste sooritamist mõjutavaid psühholoogilisi protsesse ja kirjeldab nende omavahelisi seoseid soorituse kontekstis"}, {"en": "5.\tunderstand the modes of action of factors inhibiting the development of performance skills and hindering skill mastering, and relate prospects to reducing the risk factors", "et": "5.\tmõistab sooritusoskuste arengut pidurdavate ja realiseerimist takistavate tegurite toimemehhanisme ja kirjeldab nende avaldumise riski vähendamise võimalusi"}, {"en": "6.\tdemonstrate understanding of how physical activity influences mental health and well-being", "et": "6.\tselgitab kehalise aktiivsuse mõju vaimsele tervisele ja heaolule"}, {"en": "7.\tdesign plans for habit development", "et": "7.\toskab luua harjumuse kujundamise plaani"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}