{"uuid": "ffdb1c4d-d54d-0d1b-da4c-2fe55060c5bc", "code": "SVPH.00.058", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Applications in Psychophysiology", "et": "Sissejuhatus psühhofüsioloogia rakendustesse"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true, "prerequisites": [{"required": true, "uuid": "a9958d76-2be9-cc7a-e593-478d362e3487", "code": "SHPH.00.038", "title": {"en": "Basic Functions of the Mind", "et": "Psüühika põhifunktsioonid"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-09T14:29:45"}]}, "overview": {"description": {"en": "The course gives a broad introduction to many psychophysiological signals and a first-hand experience with measuring them (including EEG, EKG, EMG and eye-movements). Participants will create simpler programs and experiments that can be combined with these recordings. An open-source program, PsychoPy, is used to build the experiments and OpenBCI, open-source hardware, is used to record most of the signals in the class. For eye-tracking, a consumer device (Tobii Eye Tracker 5) produced by the well-known eye-tracking company (Tobii Technology) will be used. A successful participant will have a broad understanding of the basic principles of applying these psychophysiological measures and know how to find reliable sources to successfully lead related projects and further their knowledge of the subject.", "et": "Kursus annab mitmete psühhofüsioloogiliste mõõdikute (sh EEG, EKG, EMG ja silmaliigutuste) praktilise mõõtmiskogemuse ja sissejuhatavad teadmised nende mõõdikute tööpõhimõtetest. Kursusel osalejad loovad füsioloogiliste signaalide mõõtmistega kombineeritavaid programme ja eksperimente. Eksperimentide loomiseks kasutatakse PsychoPy vabavaralist tarkvara ja füsioloogiliste signaalide (va silmaliigutused) mõõtmiseks spetsiaalselt selle kursuse tarbeks soetatud ja avatuse põhimõttel loodud OpenBCI mõõteseadmeid. Silmaliigutuste mõõtmiseks kasutatakse tuntud silmaandurite tootja (Tobii) poolt laiemale tarbijale suunatud andureid (Tobii Eye Tracker 5). Kursusel osaleja saab baasteadmised nende vahendite rakendamise põhimõtetest ja oskab leida usaldusväärset infot tulevaste ideede teostamiseks ning omandatud oskuste laiendamiseks."}, "objectives": [{"en": "This course gives a broad introduction to various psychophysiological signals and a first-hand experience with their measurement (including the brain's electrical activity, heart rate, muscle activity, and eye movements). Students will create simpler programs and experiments that can be paired with the recordings.", "et": "Kursus annab mitmete psühhofüsioloogiliste mõõdikute (sh aju elektrilise aktiivsuse, südame-, lihasaktiivsuse ja silmaliigutuste) praktilise mõõtmiskogemuse ja sissejuhatavad teadmised nende mõõdikute tööpõhimõtetest. Kursusel luuakse lihtsamaid füsioloogiliste signaalide mõõtmistega kombineeritavaid programme ja eksperimente."}], "learning_outcomes": [{"en": "Upon successful completion of the course, students should:", "et": "Kursuse edukas lõpetaja:"}, {"en": "o\tHave a basic understanding of psychophysiological recording and will know how to seek trusted sources to further their understanding in the future", "et": "o\tOmab alusteadmisi põhiliste psühhofüsioloogiliste signaalide mõõtmise põhimõtetest ning oskab leida usaldusväärseid allikaid saadud teadmiste süvendamiseks tulevikus"}, {"en": "o\tHave a first-hand experience with recording various psychophysiological signals (including EEG, EMG, EKG and eye-tracking)", "et": "o\tOmab mitmete psühhofüsioloogiliste signaalide (sh EEG, EMG, EKG ja silmaliigutused) mõõtmise praktilist kogemust"}, {"en": "o\tBe able to describe the most common applications of these signals - both in and out of the lab", "et": "o\tNimetab kursusel kasutatud füsioloogiliste mõõdikute põhilisi rakendusi nii laboris kui laborist väljaspool"}, {"en": "o\tHave an intuition about the interpretation of these signals and will have the first-hand experience with the factors contributing to the signal quality", "et": "o\tHoomab kursusel kasutatud signaalide tõlgendamise konteksti ja testib praktikas nende signaalide kvaliteeti mõjutavaid tegureid"}, {"en": "o\tHave a basic understanding of PsychoPy's functions and have built psychological experiments in PsychoPy. They will also have experience in seeking resources that provide help and guidance in the process", "et": "o\tTunneb peamisi PsychoPy funktsioone ja loob iseseisvalt psühholoogiliste katsete juhtfaile ning hangib infot selle käigus tekkinud probleemide lahendamiseks"}, {"en": "o\tKnow how to evaluate and consider most essential hardware limitations regarding experiment building and are familiar with the basic terminology used to describe it", "et": "o\tÕpib hindama ja rakendab katse ülesseadmise seisukohalt kriitilisemaid katseseadmete riistvaralisi piiranguid ning valdab sellega seonduvat põhilist terminoloogiat "}, {"en": "o\tBe familiar with the most common brain-computer interfaces based on the measurements covered in the course and will discuss the current applicability of these devices", "et": "o\tOn tutvunud kursusel kasutatud signaalidel põhinevate aju-arvuti liidestega ja arutleb nende vahendite rakendatavuse hetkeseisu üle"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}