{"uuid": "5d8c22ae-19f2-34ec-cb51-332602788ff1", "code": "SVPH.00.082", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-25T13:24:06", "title": {"en": "International Project in Health Promotion", "et": "Rahvusvaheline terviseedenduse projekt"}, "credits": 1, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "once", "et": "üks kord", "en": "only once"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides an opportunity to understand the importance of healthy, seasonal, local, and sustainable food choices and to promote these values based on scientific evidence. The course also offers a chance to participate in an intercultural collaborative project and to develop skills in teamwork and effective presentation techniques.", "et": "Kursus pakub võimalust õppida mõistma tervislike, hooajaliste, kohalike ja jätkusuutlike toiduvalikute tähtsust ning neid väärtusi tõenduspõhiselt edendama. Kursus annab ka võimaluse osaleda kultuuridevahelises ühisprojektis ning arendada meeskonnatöö ja tõhusate esitluste tegemise oskusi"}, "objectives": [{"en": "The objective of this course is to acquire the skills and knowledge necessary to plan and implement nutrition-related health promotion interventions. During the course, dietetics students from Leuven University of Applied Sciences and students from the University of Tartu will work together to promote healthy and sustainable dietary choices to larger target groups through a variety of activities.", "et": "Kursuse eesmärk on omandada oskusi ja teadmisi toitumisalase tervisedenduse sekkumiste planeerimiseks ja läbiviimiseks. Kursusel õpivad TÜ üliõpilased koos Leuveni Rakenduskõrgkooli dietoloogia üliõpilastega läbi erinevate tegevuste tervislike ja jätkusuutlike toiduvalikute edendamist laiematele sihtrühmadele."}], "learning_outcomes": [{"en": "Upon completing the course, the participant:", "et": "Kursuse läbinu: "}, {"en": "1.\tDescribes and explains the importance of healthy, seasonal, local, and sustainable food.", "et": "1.\tKirjeldab ja selgitab tervisliku, hooajalise, kohaliku ja kestliku toidu olulisust."}, {"en": "2.\tExplains and illustrates science based strategies for supporting healthy and sustainable food choices.", "et": "2.\tSelgitab ja illustreerib tervislike ja jätkusuutlike toiduvalikute toetamise teaduspõhiseid strateegiaid."}, {"en": "3.\tHas integrated knowledge and skills from different cultures into the course's group work.", "et": "3.\tOn integreerinud kursuse rühmatöösse erinevatest kultuuridest pärit teadmisi ja oskusi."}, {"en": "4.\tHas created visual materials (photo reportages, videos, etc.) and presentations reflecting nutrition-related health promotion.", "et": "4.\tOn loonud visuaalseid materjale (foto reportaaže, videosid jne) ning esitlusi, mis peegeldavad toitumisalast tervisedendust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}