{"uuid": "3e723681-03cf-5d17-83b0-f75e7c88f729", "code": "SVPH.00.051", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 24, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 4, "occurrence_frequency": {"code": "semester", "et": "igal semestril", "en": "every semester"}, "assessment_scale": {"code": "defence", "et": "Kaitsmine", "en": "defence"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Master's thesis is an extensive explorative paper that is required for covering the master's programme in psychology. The rest of the curriculum has to be covered to gain the permission to defend the thesis.\n\nNB! Students don't need to register for the subject in the Study Information System. The theses are submitted in Moodle and the students are registered in SIS according to the results.", "et": "Magistritöö on suurem uurimusliku sisuga töö, mis tuleb sooritada psühholoogia magistriprogrammi läbimiseks. Magistritöö kaitsmisele pääsemiseks peab olema läbitud kogu ülejäänud õppekava.\n\nNB! ÕISis ei tule magistritöö ainetele ise registreeruda. Tööde esitamine toimub Moodle keskkonnas ja õppijad registreeritakse õigetele ainetele vastavalt tulemustele."}, "objectives": [{"en": "To give the skills and knowledge of independent research necessary for a psychologist to practice professionally. To acquire knowledge of scientific presentation and communication necessary for determination and valid solution of psychological problems.", "et": "Anda iseseisva uurimistöö ja analüüsi oskused, mis on eelduseks tööks psühholoogina, kas praktiku või uurijana. Omandada piisavad teadusliku eneseväljenduse oskused, mis on tarvilikud psühholoogiliste probleemide püstitamiseks ja nende tõenduspõhiseks lahendamiseks."}], "learning_outcomes": [{"en": "* Ability of self-expression in written form, ability to argumentatively present the problems of psychology and to prove their validity. ", "et": "* Kirjaliku väljendusoskuse omandamine ja oskus argumenteeritult esitada psühholoogiaga seotud probleeme ja tõestada nende paikapidavust."}, {"en": "* Correct scientific expression skills according to the principles of APA (American Psychological Association) Publication Manual.", "et": "* Omandada korrektne teadusliku eneseväljenduse üldine stiil, mis vastab APA (American Psychological Association) publitseerimismanuaalis esitatud nõuetele."}, {"en": "* Ability to solve specific problems important for psychology and present a well-proofed solution in written form.", "et": "* Oskus lahendada konkreetset psühholoogia jaoks olulist probleemi ja selle lahenduse argumenteeritud esitlemine kirjalikus vormis."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}