{"uuid": "9ff91485-d927-9e67-e503-43a5bb4292fa", "code": "sv-2024-autumn-fulltime", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-10-14T11:26:11", "title": {"en": "Sport and Performance Psychology", "et": "Spordi- ja soorituspsühholoogia"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}, {"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 4, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Kursus annab ülevaate peamistest inimese tunnetust ja käitumist suunavatest ja reguleerivatest teguritest spordi ja muude oskuste meisterlikule sooritamisele orienteeritud valdkondade kontekstis. Käsitletakse tunnetuspsühholoogia peamisi valdkondi (tähelepanu, mälu, õppimine, mõtlemine), emotsioonide ja motivatsiooni seoseid, inimese arengut ja individuaalseid erinevusi, grupiprotsesse ja juhendamist ning eestvedamist, psühholoogiliste oskuste treenimise aluseid, liikumisega seotud tervisekäitumist ja sooritust takistavaid tegureid. Teemade käsitlemisel lähtutakse liigutusoskuste omandamise ja reguleerimise seisukohalt olulistest probleemidest.\n \tThis course provides an overview of the main factors that regulate human cognitive and behavioral processes in sport and other fields oriented to mastering performance skills. Main issues of cognitive psychology (attention, memory, learning, thinking), associations between emotions and motivation, human development and individual differences, group processes, instruction, and leadership, bases of psychological skills training, exercise-related health behavior, and factors inhibiting performance are focused on. Aspects relevant for understanding the acquiring and regulating motor skills are accentuated.", "et": "Kursus annab ülevaate peamistest inimese tunnetust ja käitumist suunavatest ja reguleerivatest teguritest spordi ja muude oskuste meisterlikule sooritamisele orienteeritud valdkondade kontekstis. Käsitletakse tunnetuspsühholoogia peamisi valdkondi (tähelepanu, mälu, õppimine, mõtlemine), emotsioonide ja motivatsiooni seoseid, inimese arengut ja individuaalseid erinevusi, grupiprotsesse ja juhendamist ning eestvedamist, psühholoogiliste oskuste treenimise aluseid, liikumisega seotud tervisekäitumist ja sooritust takistavaid tegureid. Teemade käsitlemisel lähtutakse liigutusoskuste omandamise ja reguleerimise seisukohalt olulistest probleemidest."}, "objectives": [{"en": "After the course, students will be able to identify psychological and social processes related to mastering and performing athletic and other speciality skills, and to integrate those processes in the context of development, leadership, well-being, and health.", "et": "Kursuse läbimisel oskab õppija selgitada nii spordialade kui muude erialaste oskuste meisterliku omandamise ja sooritamisega seotud psühholoogilisi ja sotsiaalseid protsesse ning seostab neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis."}], "learning_outcomes": [{"en": "Students will be able to", "et": "Kursuse lõpetamisel õppija:"}, {"en": "1.\tdescribe a wide range of topics covered by sport and performance psychology", "et": "1.\tkirjeldab spordi- ja soorituspsühholoogia teemade ulatust ja sisu"}, {"en": "2.\tdemonstrate a basic understanding of research methods and design in sport and performance psychology", "et": "2.\tdemonstreerib baasteadmisi spordi- ja sooritusspsühholoogia uurimismeetodite alal"}, {"en": "3.\tanalyses biological, developmental, motivational, social, and environmental factors affecting the development of skills and expertise. ", "et": "3.\tanalüüsib oskuste õppimist ja ekspertsuse arengut mõjutavaid bioloogilisi, arengulisi, motivatsioonilisi, sotsiaalseid ja keskkondlikke tegureid"}, {"en": "4.\texplain psychological processes affecting performance and describes their interrelations in the context of performance", "et": "4.\tselgitab oskuste sooritamist mõjutavaid psühholoogilisi protsesse ja kirjeldab nende omavahelisi seoseid soorituse kontekstis"}, {"en": "5.\tunderstand the modes of action of factors inhibiting the development of performance skills and hindering skill mastering, and relate prospects to reducing the risk factors", "et": "5.\tmõistab sooritusoskuste arengut pidurdavate ja realiseerimist takistavate tegurite toimemehhanisme ja kirjeldab nende avaldumise riski vähendamise võimalusi"}, {"en": "6.\tdemonstrate understanding of how physical activity influences mental health and well-being", "et": "6.\tselgitab kehalise aktiivsuse mõju vaimsele tervisele ja heaolule"}, {"en": "7.\tdesign plans for habit development", "et": "7.\toskab luua harjumuse kujundamise plaani"}], "notes": {}}, "grading": {"independent_work": {"et": "1. Individuaalse valmisoleku testid (IVT; 150 punkti, 18,5% koondhindest).\nNädalatel 1-15 sooritab õppija iga teema kohta vahetesti. Testi eesmärk on aidata õppijal jooksvalt teadmisi omandada, praktikumiks ja eksamiks valmistuda. Igas testis on 10 küsimust. Kokku tuleb sooritada 15 testi vähemalt 50% tulemusele (5 õiget vastust 10-st). IVT lävendi ületamine on rühmaülesannetes, s.h. praktikumis osalemise eelduseks. Testi saab sooritada üks kord, aega on 10 minutit. \n\n2.a Praktikumi rühmatestid sooritatakse praktikumi ajal ning nende tulemus moodustab kuni 8,6% koondhindest. Rühmatesti täidab üks rühma liige koostöös rühmakaaslastega. Rühmatesti saab teha üks kord, aega on 10 minutit. Igas testis on 10 küsimust, maksimumtulemus annab 5 punkti koondhinde skaalal ehk 14 praktikumi peale kokku kuni 70 punkti.  \n2b. Praktikumi rühmatööde sooritamine moodustab kuni 17,3% koondhindest (kuni 140 punkti). Kokku sooritatakse 14 praktikumi. Iga rühmatöö ülesande esimene versioon tuleb esitada kaks päeva enne praktikumi toimumist. Praktikumis esitletakse ja arutatakse esmaseid vastuseid ning praktikumi lõpuks esitatakse lõplik hinnatav rühmatöö. Iga rühmatööd hinnatakse 10 punkti ulatuses. \n\n3. Harjumuse kujundamise videopäeviku valmistamine ja esitamine moodustab 22,2% koonhindest (180 punkti). Õppija valib ühe kehalise aktiivsusega seotud tegevuse, mida 28 päeva jooksul endale harjumuseks kujundada. Õppija jälgib harjumuse kujunemist, koostab sellest 90-sekundilise videopäeviku ja esitab videopäeviku Moodle keskkonnas. Hinnatakse harjumuse kujundamise nelja põhikriteeriumi rakendamist ja nende esitluse selgust videos. Hindamine toimub üliõpilaste omavahelise hindamisena hindamismaatriksi alusel. Iga õppija hindab viie kaasõppija videopäevikut ja saab seega ka ise viie kaasõppija hinnangute alusel hindepunktid enda videole. Positiivse hinde lävend on 45 punkti."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Individuaalse valmisoleku testid moodustavad 18,5% koondhindest (max 150 punkti). Kokku tuleb sooritada 15 testi 1. - 15. õppenädalal, sooritatakse Moodles, ühes testis 10 valikvastustega küsimust, küsimused põhinevad kirjalikel materjalidel, (video)loengutel ja kursuse põhiõpikul, testi läbimiseks tuleb vastata õigesti vähemalt 50% e 5 küsimust. Testi saab teha üks kord, aega on 10 minutit. Igal küsimusel on ainult üks õige vastus. Test avaneb uue õppemooduli alguses ja sulgub sõltuvalt tunniplaanist reeglina praktikumi toimumise nädalale eelneva pühapäeva õhtul. "}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Iga praktikumi alguses sooritatakse rühmatest, kokku 14 rühmatesti. Rühmatestid moodustavad kokku 8,6% koondhindest, iga testi eest on võimalik saada kuni 5 punkti. "}}, {"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Rühmatööna sooritatavad praktikumiülesanded moodustavad 17,3% koondhindest (max 140 punkti). Praktikumiülesannete  sooritamine aitab kinnistada eelmisel nädalal õpitut. Iga praktikumitöö eest saab rühm kuni 10 punkti ülesande sisulise lahenduse eest õppejõult. Iga praktikumi eduka läbimise kriteerium on vähemalt 6 punkti. Praktikumis osalemine on kohustuslik. \nKursuse lõpus hinnatakse rühmakaaslaste panust praktikumiülesannete lahendamisse ja koostööd vastastikhindamise vormis. Vastastikhindamise tulemus moodustab 8,6% lõpphindest (kuni 70 punkti)."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Harjumuse kujundamise videopäeviku valmistamine ja esitamine moodustab 22,2% koondhindest (180 punkti). Õppija valib ühe kehalise aktiivsusega seotud tegevuse, mida 40 päeva jooksul endale harjumuseks kujundada. Õppija jälgib harjumuse kujunemist, koostab sellest 90-sekundilise videopäeviku ja esitab videopäeviku Moodle keskkonnas. Hindamine toimub üliõpilaste omavahelise hindamisena hindamismaatriksi alusel. Positiivse hinde lävend on 45 punkti."}}, {"work_type": {"code": "written", "et": "Kirjalik lõpphindamine", "en": "final written assessment"}, "description": {"et": "Kirjalik lõpphindamine koosneb valikvastustega küsimustest, mis moodustavad 24,7% koondhindest (40 küsimust, kokku kuni 200 punkti), igale küsimusele on 4-5 valikvastust, millest ainult üks on täiesti õige. Eksami sooritamise lävendiks on 140 punkti (70% vastustest). "}}], "grade_preconditions": {"et": "Kirjalikule lõpphindamisele pääsemise eelduseks on üksikute hinde osade arvetuses:\n1. Kõikides praktikumides osalemine ja vähemalt 84 punkti praktikumi ülesannetest.  \n2. Kõikide IVT-de sooritamine vähemalt 50% punktide ulatuses. Kirjalikule lõpphindamisele pääseb õppija, kes on saanud testidest vähemalt 75 punkti.\n3. Videopäeviku ülesande sooritamise vähemalt 45 punkti ulatuses. \n\nMinimaalne punktide kogusumma lõpphindamisele pääsemiseks on 210 punkti ehk 44 punkti vähem kui hinde E lävend.\n\nTerve semestri peale on õppijal võimalik kasutada kuni kolme puudumise või hilinemise päeva. See tähendab, et kokku võib juhtuda kuni kolmel korral, et mõni töö jääb õigeaegselt esitamata või praktikum tegemata. Neid puudumisi on võimalik semestri lõpus jaanuaris 2025 järelvastamisel uuesti teha. See tingimus kehtib nii praktikumiülesandest puudumise, IVT kui harjumuse videopäeviku esitamise kohta. Rühmateste järgi sooritada ei saa, praktikumist puudumise korral läheb õppijal rühmatesti tulemuseks kirja 0."}, "grade_evaluation": {"et": "Koondhindest: individuaalse valmisoleku testid (18,5%), rühmatestide sooritamine (8,6%), praktikumiülesannete sooritamine (17,3%), vastastikhindamine (8,6%), harjumuse videopäevik (22,2%), kirjalik lõpphindamine (24.7%)\nKokku on kursuse vältel võimalik koguda 810 punkti ja kogutud punktisumma avaldub hindena järgnevalt:\nA (93% ja üle selle; 753-810 p) - tunneb suurepäraselt spordi ja liikumisalase tervisekäitumisega seotud psühholoogilisi ja sotsiaalseid protsesse ning seostab neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis.\nB (85-92%; 688-752p) - tunneb väga hästi  spordi ja liikumisalase tervisekäitumisega seotud psühholoogilisi ja sotsiaalseid protsesse ning seostab neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis.\nC (80-84%; 648-687 p) - on head teadmised  spordi ja liikumisalase tervisekäitumisega seotud psühholoogilistest ja sotsiaalsetest protsessidest ning oskab neid protsesse üldjoontes omavahel arengu, eestvedamise, heaolu ja tervise kontekstis seostada.\nD (75-79%; 607-647 p) - teadmised  spordi ja liikumisalase tervisekäitumisega seotud psühholoogilistest ja sotsiaalsetest protsessidest on rahuldavad ning oskused neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis seostada on fragmentaarsed.\nE (65-74%; 526-606 p) - teadmised   spordi ja liikumisalase tervisekäitumisega seotud psühholoogilistest ja sotsiaalsetest protsessidest on kasinad ning oskused neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis seostada on väga tagasihoidlikud.\nF (alla 65%; 0-525 p) - teadmised  spordi ja liikumisalase tervisekäitumisega seotud psühholoogilistest ja sotsiaalsetest protsessidest on puudulikud ning oskused neid protsesse omavahel arengu, eestvedamise, heaolu ja tervise kontekstis seostada on praktiliseks kasutamiseks ebapiisavad."}, "grade_conditions": {"A": {"et": "Kõikide ülesannete sooritamine vähemalt 93% ulatuses koondhinde punktidest."}, "B": {"et": "Kõikide ülesannete sooritamine vähemalt 85% ulatuses koondhinde punktidest."}, "C": {"et": "Kõikide ülesannete sooritamine vähemalt 80% ulatuses koondhinde punktidest."}, "D": {"et": "Kõikide ülesannete sooritamine vähemalt 75% ulatuses koondhinde punktidest."}, "E": {"et": "Kõikide ülesannete sooritamine vähemalt 65% ulatuses koondhinde punktidest."}, "F": {"et": "Kõikide ülesannete sooritamine vähem kui 65% ulatuses koondhinde punktidest."}, "mi": {"et": "Mõne iseseisva või rühmatöö esitamata jätmine ja /või kirjalikule lõpphindamisele mitteilmumine."}}, "debt_elimination": {"et": "Kursuse raames väljaspool ettekirjutusi võlgnevusi likvideerida pole võimalik. \n\nIndividuaalsete kokkulepete sõlmimine võimalik KUNI 27. septembrini 2024."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "9eafa0b8-72fb-4f21-86e9-b6bf6b0fe693", "type": "MOODLE", "code": "SVPH.00.073", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "0346ae68-b1df-50e8-a11a-ca3f0a51737f", "person_name": "Aave Hannus", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "46239440-c4ae-e4cc-26c4-70c61959c0c5", "person_name": "Signe Reppo", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "7c5b6955-1168-c567-7a7e-6db037d999ca", "person_name": "Dagmar Rahula", "structural_unit": {"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}], "assistants": ["eea04589-1011-6286-3c86-8f80e0a4b89b"]}, "schedule": {"weeks": {"et": "1-16"}, "entries": [{"course_week": 2, "time": "2024-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "Sissejuhatus ainesse. Spordi- ja soorituspsühholoogia (SSP) valdkond, ajalugu, tänapäev ja meetodid"}, "description": {}}, {"course_week": 4, "time": "2024-09-27", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "Praktikum 1.  Psühholoogia uurimismeetodite rakendamine SSP-s"}, "description": {}}, {"course_week": 4, "time": "2024-09-27", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {"et": "Praktikum 2. Tähelepanu spordi ja soorituse kontekstis"}, "description": {}}, {"course_week": 6, "time": "2024-10-12", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {"et": "Praktikum 3. Sooritusega seotud ärevus ja selle reguleerimine. "}, "description": {}}, {"course_week": 6, "time": "2024-10-12", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {"et": "Praktikum 4. Motivatsioon spordi ja soorituse kontekstis."}, "description": {}}, {"course_week": 9, "time": "2024-11-01", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 5, "topic": {"et": "Praktikum 5. Õppimine ja sisemine motivatsioon spordi ja soorituse kontekstis"}, "description": {}}, {"course_week": 9, "time": "2024-11-01", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 6, "topic": {"et": "Praktikum 6. Harjumuse kujundamise aluspõhimõtted. "}, "description": {}}, {"course_week": 10, "time": "2024-11-08", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 7, "topic": {"et": "Praktikum 7. Liikumismotivatsioon. "}, "description": {}}, {"course_week": 10, "time": "2024-11-08", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 8, "topic": {"et": "Praktikum 8. Noorsportlaste lapsevanemate kaasamine positiivse noortespordi kujundamisse"}, "description": {}}, {"course_week": 12, "time": "2024-11-23", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 9, "topic": {"et": "Praktikum 9. Võistlemine ja koostöö spordi ja soorituse kontekstis"}, "description": {}}, {"course_week": 12, "time": "2024-11-23", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 10, "topic": {"et": "Praktikum 10. Grupidünaamika, sidusus ja eestvedamine"}, "description": {}}, {"course_week": 14, "time": "2024-12-07", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 11, "topic": {"et": "Praktikum 11. Meisterlikkusele suunatud motivatsioonilise keskkonna kujundamine"}, "description": {}}, {"course_week": 14, "time": "2024-12-07", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 12, "topic": {"et": "Praktikum 12. Soorituse profileerimine"}, "description": {}}, {"course_week": 15, "time": "2024-12-13", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 13, "topic": {"et": "Praktikum 13. Läbipõlemine ja vigastused spordis ja sooritusvaldkondades"}, "description": {}}, {"course_week": 15, "time": "2024-12-13", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 14, "topic": {"et": "Praktikum 14. Spordi ja sooritusvaldkondade pahupool"}, "description": {}}]}, "registration_info": {"audience": {}}, "parent_uuid": "ad4bdee4-6558-a7c1-7498-3e9b7ab2d835", "parent_code": "SVPH.00.073", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}