{"uuid": "be0e4884-c6ea-5e73-c1c8-6ee2bee1feaf", "code": "SVPH.00.028", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Human Sexual Behaviour", "et": "Inimese seksuaalkäitumine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVPH", "structural_unit_name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVPH", "name": {"en": "Institute of Psychology", "et": "psühholoogia instituut"}, "email": "psyhholoogia@ut.ee", "phone": "+372 737 5902", "webpage_url": "https://psuhholoogia.ut.ee", "address": "Näituse 2\n50409 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Näituse 2", "zip": "50409", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This is a course covering the biological, psychological, and sociological aspects of human sexuality. Sexuality is an integral part of life; knowledge and understanding of one's sexuality are essential in order to make decisions regarding physiological and social aspects of one's sexual life.", "et": "See kursus pakub integratiivse lähenemise seksuaalkäitumisse. Põhiliselt tegeldakse psühhosotsiaalse lähenemisega, kuid ei saada läbi ka bioloogilise, sotsioloogilise ja antropoloogilise aspektita. Põhilised teemad hõlmavad seksuaalsuse teoreetilisi külgi, psühholoogilise sooga seonduvaid küsimusi, parafiiliaid ja seksteraapiaid, erootikat ja pornograafiat jpm."}, "objectives": [{"en": "Human sexual behaviour aims to provide a clear and concise introduction to the meanings and myths attached to a key critical term.", "et": "Loengukursus püüab anda selget ja sisutihedat ülevaadet inimkäitumise nii olulise aspekti nagu seksuaalkäitumisega seotud olulisematele aspektidele ja müütidele."}], "learning_outcomes": [{"en": "Upon completion of this course, students should be able to:", "et": "Kursuse läbides on üliõpilane võimeline:"}, {"en": "Be aware of the variety of beliefs people hold about sexual issues and how these beliefs affect people's behaviors and their reactions to the behaviors of others.", "et": "Teadlik olema erinevatest uskumustest, mida inimesed seksuaalküsimustes hoiavad ja kuidas need uskumused mõjutavad inimeste käitumist ja nende reaktsiooni teiste käitumisele."}, {"en": "Apply critical thinking skills to information presented on human sexuality, by: identifying appropriate information sources, critically evaluating scientific literature on human sexuality, critically evaluating information from the popular media for biological accuracy, biases, prejudices, assumptions and judgments and understanding the essential role of the scientific method in human sexuality ", "et": "Rakendama kriitilise mõtlemise oskust inimese seksuaalkäitumise kohta esitatud informatsiooni kohta ehk tuvastama kohase informatsiooni allikaid, hindama kriitiliselt teadustöödes esitatud informatsiooni, informatsiooni mida meedia pakub selle kallakute, eelarvamuste, oletuste ja hinnangute suhtes ja mõistma teaduslike uurimismeetodite väärtuslikkust seksuaalkäitumise uurimisel."}, {"en": "Evaluate psychological and social aspects of human sexuality as well as value the biological foundations of human sexuality.", "et": "Väärtustama seksuaalsuse psühholoogilisi ja sotsiaalseid aspekte, samavõrd kui ka selle bioloogilisi aluseid. "}, {"en": "Assess ethical issues relating to human sexuality.", "et": "Hindama inimese seksuaalkäitumise eetilisi aspekte."}, {"en": "Be aware of and sensitive to the continuum of sexual behavior and biological variation ", "et": "Saama teadlikuks ja olla tundlik seksuaalkäitumise variatiivsusest"}, {"en": "Gain an appreciation for the major issues and legal aspects of human sexual behavior.", "et": "Osata hinnata seksuaalkäitumise peamisi vaidlusküsimusi ja nende õiguslikke aspekte"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}