{"uuid": "b17f6754-62e6-bef4-2050-137454301999", "code": "SVUH.00.134", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Information Architecture", "et": "Infoarhitektuur"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides students with knowledge and understanding of information architecture as a developing field and introduces the basic approaches and principles in organizing information.", "et": "Kursus annab üliõpilastele teadmised ja arusaama infoarhitektuurist kui arenevast valdkonnast ning tutvustab põhilähenemisi ja -printsiipe informatsiooni organiseerimisel."}, "objectives": [{"en": "The aim of the course is to give an overview of different approaches and concepts of information architecture and understandings in organizing information. Through reading texts and participating in discussions, students learn about the history, principles, theories and various practical approaches of information architecture.", "et": "Kursuse eesmärgiks on anda ülevaade infoarhitektuuri erinevatest käsitlustest ja kontseptsioonidest ning arusaamadest informatsiooni organiseerimisel. Tekstide lugemise ja diskussioonides osalemise kaudu õpivad tudengid tundma infoarhitektuuri ajalugu, printsiipe, teooriaid ning erinevaid praktilisi lähenemisviise."}], "learning_outcomes": [{"en": "After completing the course, students are able:", "et": "Läbinud kursuse, tudengid oskavad:"}, {"en": "- to formulate and analyze the principles of information architecture in different information environments;", "et": "- sõnastada ja analüüsida infoarhitektuuri printsiipe erinevates infokeskkondades;"}, {"en": "- understand and critically analyze information organization systems (taxonomy, etc.);", "et": "- mõista ning kriitiliselt analüüsida info organiseerimise süsteeme (taksonoomiat, jne);"}, {"en": "- apply the principles of information architecture in real information environments;", "et": "- rakendada infoarhitektuuri printsiipe tegelikes infokeskkondades;"}, {"en": "- to discuss what is included in the concept of information architecture and other basic concepts in the field;", "et": "- arutleda infoarhitektuuri mõistes sisalduva ning teiste valdkonna põhimõistete üle;"}, {"en": "- create and describe and make recommendations for the application of information architecture principles, especially when organizing web information.", "et": "- luua ja kirjeldada ning teha soovitusi infoarhitektuuri printsiipide rakendamiseks, eriti veebiinfo organiseerimisel."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}