{"uuid": "b85e7833-7a08-bafe-261c-ef340fed5f32", "code": "SVUH.00.260", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Exam", "et": "Magistrieksam"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The Master’s Exam has two parts: one in the Spring Semester (preparatory phase), one in Autumn\nSemester (defence of the project). During\nthe course the student works on their master’s project that aims to analyse the resilience of their\nsociety, which indicates the student has acquired the study outcomes of the curriculum.", "et": "Magistrieksam toimub kahes osas, eeltöö ja ülesandepüstitus tehakse kevadsemestril, analüüs ja tulemuste esitlus sügissemestri lõpus. Magistrieksami ülesannete raames analüüsib iga üliõpilane oma koduühiskonna toimepidevust põhjendatult valitud analüüsimudeli järgi."}, "objectives": [{"en": "The aim of the master's exam is to indicate that the student has acquired the study outcomes of the curriculum. During", "et": "Magistrieksami eesmärgiks on näidata õppekava õpiväljundite omandamist."}, {"en": "the course, the theoretical and practical competences learned are applied to the analysis of the resilience of their society.", "et": "Magistrieksami käigus rakendatakse õpitud teoreetilisi ja praktilisi pädevusi ühe ühiskonna toimepidevuse analüüsil."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "- analyses the factors impacting the vulnerabilities and resilience in his/her home country; ", "et": "- analüüsib tegureid, mis mõjutavad haavatavusi ja ühiskonna toimepidevust ühe ühiskonna näitel;"}, {"en": "- evaluates the geopolitical context impacting the vulnerabilities and disinformation and to analyse\nthe role of policy-planning in societal resilience;", "et": "- hindab geopoliitilise konteksti ja poliitikakujundamise mõjusid ühiskonna toimepidevusele;"}, {"en": "- knows the main instruments of dissemination of disinformation and plans proper institutional and\nstructural reactions to diminish the risks;", "et": "- analüüsib desinformatsiooni levitamise peamisi riske ühe ühiskonna näitel ning kavandab sellele vastamiseks sobivad institutsionaalsed ja strukturaalsed lahendused;"}, {"en": "- analyses the role of media in informational resilience and dissemination of disinformation;", "et": "- analüüsib meedia rolli infovastupidavuse kujunemisel; "}, {"en": "- follows high ethical principles in using the interventions into societal resilience;\n", "et": "- lähtub infokorratusse sekkumiste kavandamisel eetikast, loomata sekkumistega uusi haavatavusi;"}, {"en": "- analyses the juridical and technological context of cyber security, assesses the risks and reacts\nproperly in his field of activity.", "et": "- analüüsib infokorratuse kujunemise juriidilist ja tehnoloogilist konteksti ja oskab hinnata nendega kaasnevaid riske."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}