{"uuid": "1ec0efe8-30f9-d0a8-0539-62c0957f6e07", "code": "SVUH.00.257", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Resilience Analysis and Practice", "et": "Toimepidevuse analüüs ja praktika"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "This data-driven course gives the students the instruments needed to analyse the resilience on the societal level as well as comparatively, in different societies and contexts. The course shows the main factors in building a resilient society on the macro and meso levels. Course participants work with the data deriving from their own societies, use different comparative data sources from global think-tanks and data providers, and use data mining to get raw data from their own institutions and public bodies. Participants develop their critical data literacy and learn to use reliable data sources. During the course the main global data sources and indexes are used to compare the resilience of \nsocieties. ", "et": "Tegemist on andmepõhise kursusega, mis annab üliõpilasele vahendid analüüsida ühiskondlikku toimepidevust konkreetses ühiskonnas ja erinevates ühiskondades võrdlevalt. Kursus annab süsteemse ülevaate peamistest ühiskondlikku toimepidevust kujundavatest teguritest. Kursusel osalejad töötavad võrdlevate ühiskondade arengut hindavate mõõdikutega ning koguvad täiendavaid andmeid oma ühiskonna kohta. Kursus õpetab kriitiliselt hindama olemasolevaid andmeid ja andmelünkasid. "}, "objectives": [{"en": "This data-driven course gives the students the instruments needed to analyse the resilience on the societal level as well as comparatively, in different societies and contexts.", "et": "Kursuse eesmärk on anda üliõpilastele töövahendid, et analüüsida ühiskondlikku toimepidevust konkreetses ühiskonnas ja võrdlevalt."}], "learning_outcomes": [{"en": "After passing the course student", "et": "Õppeaine läbinud õppija:"}, {"en": "- knows how to use the main analytical models to evaluate societal resilience of different societies, and analyses the main factors that impact the resilience of his/her country of origin; ", "et": "- teab, kuidas mõõdetakse ühiskondlikku toimepidevust sotsioloogiliselt ja oskab erinevaid analüütilisi mudeleid kasutada konkreetse ühiskonna analüüsil ja võrdlevalt; "}, {"en": "- has developed their critical data literacy; ", "et": "- arendab kriitilist andmekirjaoskust, tutvudes ühiskondade arengut hindavate mõõdikutega, hinnates nende kvaliteeti ja andmelünkasid;  "}, {"en": "- knows how to get overviews of available data for the analysis of societal resilience, acknowledges the data gaps and can collect or lead collecting of additional data needed for the analysis; ", "et": "- oskab koguda või hinnata täiendavate andmete kogumise vajadust;  "}, {"en": "- follows the research ethics necessary to implement successful resilience analysis. ", "et": "- järgib sotsiaalteaduslikku andmekogumise ja töötlemise eetikat ja head tava. "}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}