{"uuid": "96a5e926-6bb1-1832-5d56-3e7423bf0582", "code": "SVUH.00.212", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Rhetoric", "et": "Retoorika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "We are rhetorical beings, living in a rhetorical world. Rhetoric is more than the art of persuasion, or a magical dust of words that can be sprinkled on a text to mislead someone. Rhetoric is inherent in the foundation of human society. This course will look at rhetoric from a contemporary perspective and in a synthesis of different approaches. In particular, we will do this by analysing, writing and delivering speeches. At the same time, everything we learn is transferable to all media and contexts, and all the topics covered are practically applicable in even if the student who has completed the course never writes and/or delivers another speech in their life.", "et": "Me oleme retoorilised olendid, kes elavad retoorilises maailmas. Retoorika on midagi rohkemat kui veenmise kunst või sõnatolm, mida kellegi eksitamiseks tekstile puistada saab. Retoorika on inimühiskonna lahutamatu alus. Kursus käsitleb retoorikat kaasaegses võtmes ning erinevate käsitluste sünteesis. Eelkõige teeme seda kõnede näitel, kõnesid analüüsides, kirjutades ja esitades. Samas on õpitu ülekantav kõikidesse meediumitesse ja kontekstidesse ning kõik käsitletavad teemad on eluliselt rakendatavad ka siis, kui kursuse läbinud tudeng elus rohkem ühtegi kõnet ei pea."}, "objectives": [{"en": "The aim of the course is to build a foundation of clear, bold and stylish self-expression on which to build in one's studies. As well as understanding the nature of communication and rhetoric, the aim is to understand oneself in order to see more clearly one's strengths on which one can rely on in the futuure.", "et": "Kursuse eesmärk on luua vundament selgeks, julgeks ja isikupäraseks eneseväljenduseks, millele edasiste õpingute käigus toetuda. Kommunikatsiooni ja retoorika olemuse mõistmise kõrval on eesmärgiks ka iseenda mõistmine, et näha selgemalt oma tugevusi, millele tulevikus toetud."}], "learning_outcomes": [{"en": "A student who has completed the course:", "et": "Kursuse läbinud tudeng:"}, {"en": "- Understands the nature of rhetoric and communication and the rhetorical nature of themselves and the world;", "et": "- mõistab retoorika ja kommunikatsiooni olemust ning enda ja maailma retoorilisust;"}, {"en": "- Is able to analyse themselves, the audience and the context, to bridge the empathic gap;", "et": "- oskab analüüsida ennast, publikut ja konteksti ning ületada empaatilist lõhet;"}, {"en": "- Understands the structures of a text, including rhetorical devices, and is able to identify them when analysing a speech;", "et": "- mõistab teksti struktuure, sh retoorikavõtteid, ning oskab neid kõnet analüüsides tuvastada;"}, {"en": "- Can consciously use the structures of a text to create an emotional and intellectual journey in their speeches;", "et": "- oskab teksti struktuure oma kõnes emotsionaalse ja intellektuaalse teekonna loomiseks teadlikult kasutada;"}, {"en": "- Can produce and deliver a high quality visualised presentation;", "et": "- oskab koostada ja esitada kvaliteetselt visualiseeritud presentatsiooni;"}, {"en": "- Can overcome anxiety and discomfort when speaking in front of a camera and an audience.", "et": "- suudab ületada kaamera ja publiku ees esinemisega seotud ärevust ja ebamugavust."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}