{"uuid": "cda225b5-3e09-cdd1-422f-6aa633da1d30", "code": "SVUH.00.095", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Master's Thesis", "et": "Magistritöö"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "defence", "et": "Kaitsmisega lõppev aine", "en": "Course with defence at the end"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "A master's thesis is an independent study with an academic or applied problem statement. The topic of the master's thesis may be related to theoretical, theoretical-applied or applied issues in the field. The research of a master's thesis means a clearly defined problem-solving, analytical treatment of literature and data sources using social science methods (with a certain selection of them) and presentation of results inherent in a scientific text (justification, controllability).\n\nDepending on the chosen topic and problem statement, the master's thesis can be theoretical, methodological, empirical or applied. Theoretical work can focus on comparing different theoretical approaches in the field; methodological work to analyze the application possibilities and limitations of specific sectoral methods for solving specific empirical or application problems; empirical work to map the situation in a specific field and the aim of the applied work is to focus on solving the social problem in society or real information and knowledge management problem of the organization.\n\nThe master's thesis consists of:\n- an introduction setting out the purpose of the open work, the rationale for the topic, the theoretical or applied background and the sources and methods used;\n- the substantive analytical approach to the topic, which is divided into chapters and subchapters on the basis of substantive criteria;\n- a summary summarizing the results and conclusions of the research;\n- a list of sources and literature used;\n- a summary in a foreign language\n\nThe optimal volume of the content of the work is 40-50 pages.", "et": "Magistritöö on iseseisev akadeemilise või rakendusliku probleemipüstitusega uurimus. Magistritöö temaatika võib olla seotud valdkonna teoreetiliste, teoreetilis-rakenduslike või rakenduslike küsimustega. Magistritöö uurimuslikkus tähendab selgelt määratletud probleemipüstitust, kirjandus- ja andmeallikate analüütilist käsitlust sotsiaalteaduslike meetoditega (mingi kindla valikuga neist) ning tulemuste esitamist teaduslikule tekstile omaselt (põhjendatus, kontrollitavus).\n\nSõltuvalt valitud teemast ja probleemipüstitusest võib magistritöö olla teoreetilise, metodoloogilise, empiirilise või rakendusliku suunitlusega. Teoreetilise suunitlusega töö võib keskenduda erinevate valdkonda puudutavate teoreetiliste käsitluse võrdlusele; metodoloogiline töö analüüsida spetsiifiliste valdkondlike meetodite rakendusvõimalusi ja piiranguid konkreetsete empiiriliste või rakenduslike probleemide lahendamiseks; empiiriline töö kaardistada ja analüüsida olukorda konkreetses eriala puudutavas valdkonnas ning rakendusliku töö eesmärgiks on keskenduda ühiskonnas laiema sotsiaalse või organisatsioonis reaalse info- ja teadmusjuhtimise probleemi lahendamisele.\n\nMagistritöö koosneb:\n-        sissejuhatusest, milles on avatud töö eesmärk, teema põhjendus, teoreetiline või rakenduslik taust ning kasutatavad allikad ja meetodid;\n-        teema sisulisest analüütilisest käsitlusest, mis on sisuliste kriteeriumidele alusel liigendatud peatükkideks ja alapeatükkideks;\n-        kokkuvõttest, kus on lühidalt esitatud uurimistöö tulemused ja järeldused;\n-        kasutatud allikate ja kirjanduse loetelust;\n-        võõrkeelsest resümeest\n\nTöö sisulise osa optimaalne maht on 40-50 lk."}, "objectives": [{"en": "The aim of the master's thesis in Social and Information Process Analysis is to give the student the opportunity to demonstrate the knowledge gained during the studies and the ability to apply it in analyzing and solving topical problems related to the specialty. With the help of a master's thesis, the existence and depth of knowledge and skills acquired within the master's study program, the ability to use them in an integrated way, the ability to use information sources, analytical skills and written expression skills are assessed.", "et": "Ühiskonna ja infoprotsesside analüüsi magistritöö eesmärgiks on anda üliõpilasele võimalus demonstreerida õpingute käigus kogutud teadmisi ning nende rakendamise oskust aktuaalsete erialaga seonduvate probleemide analüüsimisel ja lahendamisel. Magistritöö abil hinnatakse nii magistriõppekava raames omandatud teadmiste ja oskuste olemasolu ning sügavust, nende integreeritud kasutamise oskust, infoallikate kasutamise oskust, analüüsivõimet ning kirjalikku väljendusoskust."}], "learning_outcomes": [{"en": "The defense of the master's thesis shows the graduate's academic and professional competence:", "et": "Magistritöö kaitsmine näitab lõpetaja akadeemilist ja erialast kompetentsi: "}, {"en": "- he/she has systematic knowledge in the field, he/she knows the theoretical framework of the field;", "et": "- tal on süsteemsed teadmised valdkonnas, ta tunneb valdkonda puudutavat teoreetilist raamistikku;"}, {"en": "- he/she is able to analyze possible emerging societal problems, has acquired knowledge of the functioning of a society based on information systems;", "et": "- ta on suuteline analüüsima võimalikke tekkivaid ühiskondlikke probleemkohti, on omandanud teadmised infosüsteemidele toetuva ühiskonna toimimisest;"}, {"en": "- is able to innovatively organize the work of organizations, create new functional applications and have contributed to research in the field with a master's thesis.", "et": "- oskab innovaatiliselt korraldada organisatsioonide tööd, luua uusi toimivaid rakendusi ning on magistritööga panustanud valdkonna uuringutesse."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}