{"uuid": "af80fa14-265c-4cb8-5289-94db1389a65e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-25T11:10:26", "title": {"en": "Project Management Internship", "et": "Projektipraktika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 0, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 120}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "The internship requires that the student become thoroughly informed about the activities of an institution or organisation that offers professional opportunities for a sociologist or a social science analyst. The student has to devise and carry out a problem-based project with the aim of solving a complete task in said organisation. The project can be done either in a team of students or alone.\n\nThe Project Management Internship presupposes that the internship activities make up an integrated whole (the project) and follow a problem-based approach, namely that\n- a problem which needs solving is defined along with a goal that is to be reached; \n- main questions are phrased that need answering in order to solve the problem;\n- specific tasks and methods to be used are identified along with what additional knowledge and skills need to be acquired; \n- the output of the project is defined (what the result of the project should entail in terms of subject matter and how it should be presented).\n\nThe project should include an analytical part, i.e. the project cannot be based on technical tasks alone, but should entail producing an analytical output (e.g., a report based on data analysis that includes not only reporting tables and graphs but also interpreting them) or at least a methodological contribution (e.g., if the goal of the project is cleaning a database and preparing data for analysis, the intern should also get to work out the methods for it (e.g., logical tests) and carry out explorative analysis.", "et": "Õppeaine eeldab üliõpilase põhjalikumat tutvumist mingi asutuse või organisatsiooni tööga, kus leidub sotsioloogile või sotsiaalvaldkonna analüütikule sobivat erialast tegevust, ning projekti kavandamist ja läbiviimist, mille sisuks on mingi sealse tervikliku ülesande lahendamine probleemipõhiselt rühmas või iseseisvalt.\n\nProjektipraktika eeldab, et praktikategevused moodustavad ühtse terviku (projekti), millele lähenetakse probleemipõhiselt - defineeritakse probleem, mis vajab lahendamist ja eesmärk, kuhu tahetakse jõuda; sõnastatakse põhiküsimused, mis vajavad probleemi lahendamiseks vastamist; pannakse paika lahenduskäigu etapid ja meetodid ning identifitseeritakse, milliseid lisateadmisi /-oskusi probleemi lahendamiseks vajatakse; pannakse paika, milline peaks olema projekti väljund (nii sisuliselt kui vormiliselt). \n\nProjekt peaks sisaldama analüütilist komponenti, st projekti sisu ei saa olla ainult tehniline töö, vaid peaks sisaldama ka analüütilise väljundi tootmist (nt andmeanalüüsil põhinev raport, mis sisaldaks peale analüüsitulemuste numbrilist esitlust ka mingit sisulist kokkuvõtet) või vähemalt metodoloogilist panust (nt kui projekti eesmärk on andmebaasi korrastamine ja andmete analüüsitavale kujule viimine, siis peaks praktikant saama ka kavandada korrastamise meetodeid (nt loogilisi teste) ja teostada otsingulist (eksploratiivset) analüüsi).\n\nPraktika ei eelda tingimata regulaarset kohalolekut, samas on vaja praktikandil saada praktikabaasi tegevusest ülevaade ja mõista, kuidas praktikabaasi igapäevane töö on korraldatud. Projektipraktika osaks võivad ja peaksidki olema ka sellised tegevused nagu osalemine koosolekutel, nõupidamistel, organisatsiooni struktuuri ja tööga kohapeal tutvumine. Projektipraktika probleemipõhine lähenemine ei välista ka teiste tööde tegemist praktikabaasis, kuid projektiga seotu peaks moodustama enamuse praktikategevuste mahust."}, "objectives": [{"en": "Acquaint oneself with BA level professional work in a particular subfield", "et": "Tutvuda bakalaureusetasemele vastava erialase tööga ühes kindlas valdkonnas"}, {"en": "Develop the skills to apply knowledge gained in studies into practice and analytical and reflection skills", "et": "Arendada analüütilisi, eelnevalt õpitu praktilise rakendamise ja oma tegevuse refleksioonioskusi"}, {"en": "Improve employment opportunities in the labour market after graduation", "et": "Avardada lõpetamisjärgseid võimalusi tööjõuturul"}, {"en": "Devise and complete a problem-based project in an internship organisation. The project must belong to the working area of a sociologist or a social science analyst, and can be carried out either in a team of students or alone", "et": "Kavandada ja realiseerida praktikaorganisatsioonis probleemipõhiselt rühmas või iseseisvalt sotsioloogi / sotsiaalteaduste valdkonna analüütiku tegevusalasse kuuluv projekt"}], "learning_outcomes": [{"en": "The student:\n- obtains practical work experience in realising a project directly related to the work of a sociologist or a social science analyst;\n- understands the goals of the task as a whole and can reflect on his/her engagement in the practice activities and link this with past studies;\n- is informed about the activities of his/her training centre (institution or organization) and the tasks of a sociologist / social science analyst employed there", "et": "Üliõpilane omandab reaalse töökogemuse mingi sotsioloogi või sotsiaalteaduste valdkonna analüütiku tegevusega seotud tervikliku ülesande probleemipõhisel lahendamisel (meeskonnatöö vormis)\nÜliõpilane saab aru ülesande kui terviku eesmärkidest, oskab reflekteerida oma tegevust ülesande raames ja siduda seda oma varasemate õpingutega\nÜliõpilane tunneb praktikabaasi (asutuse või organisatsiooni/ selle allüksuse/ uurimisprojekti) tegevust ja sotsioloogi / sotsiaalvaldkonna analüütiku tegevusega seotud vajadusi selles asutuses/ allüksuses/ uurimisprojektis"}], "notes": {}}, "grading": {"independent_work": {}, "grade_preconditions": {"et": "* Praktikaplaan (vajalik praktika eesmärgistatud läbimiseks, võimalike probleemide vältimiseks; esitada enne praktikaülesannete täitmise algust või alguses)\n* Konkreetsed praktikategevused ehk projekti elluviimine umbes kolme täistöönädala ulatuses (120 tundi)\n* (Praktikapäevik - ei ole kohustuslik, aga on kasulik)\n* Seminarides osalemine või seminari väljundi täitmine\n* Praktikaaruanne\n* Praktikaaruande kaitsmine\n* Praktikabaasipoolse juhendaja hinnang (vorm Moodle-s)"}, "grade_evaluation": {}, "debt_elimination": {}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "8e3bb478-392c-ce34-7dfa-8d76101ecf14", "person_name": "Indrek Soidla", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24, 29, 34, 39"}, "entries": [{"time": "2025-02-13", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Sissejuhatav kokkusaamine. Praktika korralduse tutvustamine. Praktika eesmärgi ja endale püstitavate ülesannete seadmine"}}, {"time": "2025-03-20", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Praktikaplaanide arutelu, tagasiside; eelmisel semestril praktika läbinud tudengite praktikaaruannete kaitsmine"}}, {"time": "2025-04-24", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Senise praktikakogemuse ja -tegevuste arutelu, probleemid, tagasiside, võimalused praktikategevuste edasiseks tõhustamiseks"}}, {"time": "2025-05-29", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Aruannete kaitsmine"}}]}, "registration_info": {"audience": {"et": "sotsioloogia ja infoteaduste eriala üliõpilased"}, "min_students": 5}, "parent_uuid": "2fabd109-ecf7-d39f-a767-bab59bfadc65", "parent_code": "SVUH.00.061", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}