{"uuid": "460c3f7b-bbd6-1656-3758-d2ee83c5f082", "code": "SVUH.00.178", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Social Digital Competences", "et": "Sotsiaalsed digipädevused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "On this course we will focus on the different nuances that, combined, make up the human experience on digital platforms - the creation and reception of information, self-presentation and identity, smart devices and well-being, etc. Furthermore, we try to look beyond the micro-level of things (the personal), discussing the rapid transformations that the organisations and societies have gone through and still are going through.", "et": "Siin kursusel tegeleme digikeskkondades edukalt hakkama saamise nö \"inimlike\" aspektidega - info vastuvõtu ja loomise, oma identiteedi ja maine kujundamise ning haldamisega veebiplatvormidel, nutiseadmete ja vaimse heaolu ning paljude muude seonduvate teemadega. Lisaks püüame näha mikrotasandist (inimene) kaugemale, mõtestades organisatsioonides, institutsioonides ja ühiskondades toimuvaid muutuseid, mille taga võib olulise tegurina näha info- ja kommunikatsioonivahendite tormilist arengut."}, "objectives": [{"en": "The main aim of the course is to give a theoretical+practical overview of the social aspects of digital literacies. Various disciplines will meet and mix on this course and the student will get a roadmap of how to proceed in case of deeper interest sparked.", "et": "Kursuse eesmärk on anda oma õpingute alguses olevatele tudengitele ülevaade digipädevustest, mis on tihedamalt seotud sotsiaalsete oskuste ja teadmistega. Kursusel kohtuvad erinevad akadeemilised (sotsiaalteaduslikud) distsipliinid ning õppija saab esmase ülevaate ja edasised õppimissoovitused erinevate erialade ning valdkondade fookusteemadest ja käsitlusviisidest digipädevuste suures raamistuses."}], "learning_outcomes": [{"en": "After completing the course the student:", "et": "Pärast selle kursuse läbimist tudeng: "}, {"en": "- knows and recognizes the main skills and knowledge that are the components of digital literacies", "et": "- teab erinevaid oskuseid ja teadmisi, mida loetakse digipädevuste suure üldteema alla"}, {"en": "- can find and use existing tools and resources that advance one's digital literacies", "et": "- oskab leida ja kasutab olemasolevaid tööriistu ja õppevahendeid, mille abil on võimalik oma digipädevusi tõsta"}, {"en": "- recognizes different academic disciplines (of social sciences)", "et": "- tunneb ära erinevaid sotsiaalteaduslikke erialasid/distsipliine"}, {"en": "- searches and finds trustworthy scientific sources of information", "et": "- otsib ja leiab usaldusväärseid akadeemilisi teaduspõhiseid allikaid"}, {"en": "- trains and develops specific sub-skills of professional digital content creation", "et": "- harjutab digiplatvormidel toimuvat professionaalset sisuloomet"}, {"en": "- uses the correct terminology of this field ", "et": "- kasutab valdkonnas kasutusel olevaid erialaseid mõisteid (nt infokorratus, disinformatsioon, andmestumine, narratiiv jne)"}, {"en": "- reflects on their study experience and the role of ICTs in their life", "et": "- reflekteerib oma õpikogemust ning nutiseadmete ja digiplatvormide rolli ja funktsioone oma elus. "}, {"en": "- works with other students in groups, in order to achieve a shared goal", "et": "- töötab koos kaastudengitega ühise eesmärgi nimel, esitleb oma tööd teistele"}, {"en": "- uses the main study platforms of UT", "et": "- kasutab õppetöös peamisi Tartu Ülikoolis kasutusel olevaid õppeplatvorme"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}