{"uuid": "d9f3ad1f-b95b-37c5-325e-b0b41630af2b", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-13T11:30:53", "title": {"en": "Data Protection", "et": "Andmekaitse"}, "credits": 4, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 S block mode SV", "et": "25/26 K SÕ SV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 14, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course consists of independent work, one smaller practical assignment and one analytical assignment. In addition, smaller practical exercises take place in thematic seminars that help to confirm what they have learned. The share of independent work is high. In one semester the students need to begin from a level where they know almost nothing and reach a level where they can independently discuss on issues related data protection and justify their views. To achieve this, it is required to read a lot about the subject. Mandatory reading material includes chapters of the textbook on higher education, chapters of the European Union Handbook on Data Protection Law, guidelines of the Data Protection Inspectorate, guidelines of the European Data Protection Council and academic articles. \nThe practical assignment is either individual or done in a group (depending on the number of participants). The task is to assess whether a service based on the processing of personal data, which the student himself or herself is often exposed to, complies with the general principles of data protection.\nThe analytical assignment is a case analysis done as a group work. It is divided into two parts: the initial plan of analysis and the final analysis. The case analysis requires the students to associates all their knowledge acquired during the course with the real-life situations of their choice, to highlight problems related to data protection and to offer solutions.", "et": "Õppetöö koosneb iseseisvast õppest, ühest väiksema mahulisest praktilisest ülesandest ja ühest mahukamast probleemi analüüsi ülesandest. Lisaks toimub teemaseminarides väiksemaid praktilisi ülesandeid, mis õpitut kinnistavad.\nIseseisva õppe osakaal on suur. Kuna ühe semestri jooksul tuleb jõuda tasemest, kus üliõpilane mitte midagi ei tea, tasemeni, kus üliõpilane oskab iseseisvalt andmekaitse teemalistel aruteludel kaasa mõelda ja oma seisukohti põhjendada. Selleks tuleb õppeaines palju lugeda. Kohustuslik lugemismaterjal hõlmab kõrgkooliõpiku peatükke, Euroopa Liidu andmekaitseõiguse käsiraamatu peatükke Andmekaitse Inspektsiooni juhiseid, Euroopa Andmekaitse Nõukogu juhiseid ning akadeemilisi artikleid.\nPraktiline ülesanne on individuaalne või rühmas (sõltub osalejate arvust). Ülesande sisuks on hinnata mõne isikuandmete töötlemisel põhineva teenuse, millega üliõpilane ise sageli kokku puutub, kooskõla andmekaitse üldpõhimõtetega. \nMahukam analüütiline ülesanne on rühmatööna tehtav juhtumi analüüs, mis koosneb analüüsi kavast ja lõppanalüüsist. Juhtumi analüüsi käigus seostab üliõpilane kõik õppeaine jooksul omandatud teadmised enda valitud päriselulise näidisolukorraga, tuues välja andmekaitse alaseid probleeme ja pakkudes lahendusi."}, "objectives": [{"en": "The aim of the course is to introduce the legal, ethical, and societal aspects related to the protection of personal data. The course intends to be practical: the aim is to give the student the necessary knowledge and skills to successfully cope with the processing of personal data both in their personal private life and professional activities. In addition, the course helps to link data protection knowledge and skills to general societal and technological challenges. Completing the subject gives the students an overview of the field of data protection, which in turn helps to understand the dangers related to the processing of personal data, to know their rights and to acknowledge the personal data related rights of others in their own work. The course is intended for students who know very little about data protection.", "et": "Õppeaine eesmärk on tutvustada isikuandmete kaitsega seotud õiguslikke, eetilisi ja ühiskondlikke aspekte. Õppeaine on praktilise kallakuga: eesmärk on anda üliõpilasele minimaalsed vajalikud teadmised ja oskused selleks, et nii oma isiklikus eraelus kui ka tööalases tegevuses isikuandmete töötlemisega edukalt toime tulla. Lisaks aitab õppeaine seostada andmekaitse alaseid teadmisi ja oskusi üldiste ühiskondlike ja tehnoloogiliste väljakutsetega. \nÕppeaine läbimine annab üliõpilasele ülevaate andmekaitse valdkonnast vajalikul tasemel, et üliõpilane oleks teadlik isikuandmete töötlemisega seotud ohtudest, tunneks enda õiguseid ja oskaks arvestada teiste õigustega enda töös. Õppeaine on mõeldud üliõpilastele, kes andmekaitsest ei tea midagi või teavad väga vähe."}], "learning_outcomes": [{"en": "Students who have completed the subject: ", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1.\tknow the basic concepts of data protection and know how to use them in the data protection related discussions; ", "et": "1.\tteab andmekaitse põhimõisteid ja oskab neid vastavateemalises diskussioonis kasutada;"}, {"en": "2.\tknow the principles of data protection and are able to link them to real-life situations; ", "et": "2.\tteab andmekaitse põhimõtteid ja oskab neid päriseluliste olukordadega seostada;"}, {"en": "3.\tknow in general how the use of personal data is regulated in Estonia and the European Union; ", "et": "3.\tteab üldjoontes, kuidas on isikuandmete kasutamine Eestis ja Euroopa Liidus reguleeritud;"}, {"en": "4.\tknow their rights to personal data and know how to use those rights; ", "et": "4.\tteab enda õiguseid oma isikuandmete suhtes ja oskab neid kasutada;"}, {"en": "5.\tknow the most important legislation and guidelines and are able to independently find answers to simpler questions concerning data protection; ", "et": "5.\ttunneb olulisemaid õigusakte ja juhendeid ning oskab iseseisvalt leida vastuseid lihtsamatele andmekaitset puudutavatele küsimustele;"}, {"en": "6.\tnotice privacy and data protection problems in their own lives and society; ", "et": "6.\toskab märgata privaatsuse ja andmekaitse alaseid probleeme enda elus ja ühiskonnas;"}, {"en": "7.\tcan independently form opinions on public issues related to the protection of personal data and are able to ground them in an argumentative manner.", "et": "7.\toskab iseseisvalt kujundada hinnanguid ühiskondlikel isikuandmete kaitset puudutavatel teemadel ja oskab neid argumenteeritult põhjendada."}], "notes": {}}, "grading": {"independent_work": {"et": "1. Iseseisvad testid loetud materjali põhjal: kokku viis testi, mida saab teha Moodle'i keskkonnas. Lugemismaterjalid ja täpsemad juhised on Moodle's. Hinde saamiseks tuleb sooritada kõik testid üle lävendi. Teste saab sooritada mitu korda.\n2. Oma küsimuse või probleemi sõnastamine: lühiülesanne Moodle's, mis tuleb sooritada enne teist loengut. \n3. Juhtumiülesande teema sõnastamine: ülesande sooritamine Moodle's. Teema valimist käsitleme loengutes, kus tuuakse näiteid ja antakse soovitusi hea teema valimiseks. Esitamine toimub ja täpsem juhend on Moodle's.\n4. Juhtumi analüüs: õppeaine keskne ja kõige mahukam töö. Täpsemad juhised on Moodle's.\n5. Kaastudengi analüüsi retsensioon: iga õppija peab lugema ja tagasisidestama ühe kaastudengi juhtumi analüüsi. Retsensiooni esitatakse kirjalikult enne lõpuseminari ning kantakse ette lõpuseminaril.\n6. Oma juhtumi analüüs kaitsmine: lõpuseminaris tuleb igal tudengil ette kanda lühike tutvustus oma juhtumianalüüsi kohta ning vastata tekkinud küsimustele. Lõpuseminaril saab iga töö tagasisidet kaastudengilt kui ka õppejõududelt."}, "grade_preconditions": {"et": "Hindamine on mitteeristav. Lõpphindamisele pääsemise tingimuseks on kõigi nõutud iseseisvate tööde esitamine tähtajaks või õppejõuga kokkulepitult pärast tähtaega."}, "grade_evaluation": {}, "debt_elimination": {"et": "Kokkuleppel õppejõuda on võimalik iga hinnatav tegevus uuesti sooritad või esitada uue tähtajaga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "d543234f-6a57-7956-b536-01cfacb3ee3d", "person_name": "Marten Juurik", "structural_unit": {"code": "HVFI05", "name": {"en": "Centre for Ethics", "et": "Tartu Ülikooli eetikakeskus"}, "phone": "+372 737 5427", "webpage_url": "https://eetikakeskus.ut.ee", "address": "Jakobi 2, III korrus, ruumid 327, 329-333\n51005 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Jakobi 2, III korrus, ruumid 327, 329-333", "zip": "51005", "level": 3, "academic": false, "supports_continuous_learning": false, "parent_code": "HVFI"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "e7bd0f3f-68fd-8fe4-20c6-11252f9b4bef", "person_name": "Kristjan Kikerpill", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus.\nTeema ja õppeaine tutvustus, töökorraldus"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Andmekaitse regulatsiooni ülevaade, peamised mõisted ja definitsioonid, probleeme tekitavad määratlused, andmekaitse põhimõtted. Esitatud küsimuste ja probleemide arutelu."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Andmekaitse rikkumise kaasused ja näited Eestist ning mujalt Euroopast. Soovitused oma juhtumi valikuks."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Vastutava töötleja ülesanded. IRAC meetodi tutvustus. Soovitused juhtumi analüüsiks."}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Andmekaitse eriteemad, andmekaitse piirid, külgnevad õigusvaldkonnad (avalik teave, intellektuaalomand), uued teaberegulatsiooni suunad, andmekaitse põhiõiguste raamistikus."}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Kodutöö esitamine ja kaitsmine\nA rühm"}}, {"work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Kodutöö esitamine ja kaitsmine\nB rühm"}}]}, "registration_info": {"audience": {"et": "Ühiskonnateaduste instituudi magistriprogrammide üliõpilased"}, "min_students": 15, "max_students": 50}, "parent_uuid": "25c95ae9-d41d-488a-100d-77938aaddb3c", "parent_code": "SVUH.00.193", "parent_credits": 4, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}