{"uuid": "38e93c7f-0590-fed2-8b45-f7e41ba536cc", "code": "SVUH.00.115", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Information Visualization in Social Sciences", "et": "Info visualiseerimine sotsiaalteadustes"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "1. How we exchange information and what kind of information exchange is simplified by the use of graphical elements. General rules for the use of graphical elements.\n2. Simple diagrams and their use: mind-map, argument-map, cladogram, tree.\n3. How to present the static of an object by diagrams.\n4. How to present the dynamic of an object by diagrams.\n5. An object, parameters, data cleaning and visualization.\n6. Data analysis and presentation via diagrams.\n7. Data analysis and presentation via diagrams.", "et": "1. Kuidas me infot vahetame ja millise infovahetusel on abi graafilistest elementidest.\nGraafiliste elementide kasutamise üldised reeglid.\n2. Lihtsamad diagrammid ja nende kasutamine: mind-map, argument-map, cladogram, puu-struktuur.\n3. Diagrammid objekti staatika visualiseerimiseks.\n4. Diagrammid objekti dünaamika visualiseerimiseks.\n5. Objekt, parameetrid, parameetri skaala. Andmete puhastamine ja tabeli baasil info visualiseerimine.\n6. Kvantitatiivse andmeanalüüsi tulemuste visualiseerimine.\n7. Kvantitatiivse andmeanalüüsi tulemuste visualiseerimine."}, "objectives": [{"en": "The objective of this course is to introduce different principles for information architecture and visualization. The focus is on the maps and diagrams used in different fields, which have proved to serve in practice as efficient tools for highlighting and analyzing essential facts and relations. The use of such tools simplifies daily human interaction where complex, more technical information has to be exchanged.", "et": "Kursuse eesmärk on tutvustada erinevaid võimalusi informatsiooni süstematiseerimiseks ja visuaalseks esitamiseks. Põhirõhk on erinevates valdkondades kasutatavatel kaartidel ja diagrammidel, mis on ennast praktikas tõestanud kui head töövahendid faktide ja seoste väljatoomisel ning analüüsimisel. Selliste kaartide ja diagrammide kasutus lihtsustab kokkuvõttes tehnilisemat laadi infovahetust inimeste vahel."}], "learning_outcomes": [{"en": "Upon the successful completion of this course, students should be able to:", "et": "Kursuse edukalt läbinud üliõpilane:"}, {"en": "1. demonstrate the knowledge of the techniques for information visualization and methods for information analysis; ", "et": "1.\ttunneb tehnikaid erinevat tüüpi info visuaalseks esitamiseks ja analüüsiks; "}, {"en": "2. select (graphical) tools and methods for information architecture, analysis and presentation with the aim of the information exchange;", "et": "2.\toskab valida lähtuvalt infovahetuse eesmärgist sobivad (graafilised) vahendid info süstematiseerimiseks, analüüsiks ja esitamiseks; "}, {"en": "3. use the tools and relevant methods studied during the course and apply them in practice.", "et": "3.\toskab rakendada loengus käsitletud vahendeid ja nendega seotud meetodeid praktikas."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}