{"uuid": "777c6771-e1d5-4b1f-57de-38a420af134c", "code": "SVUH.00.060", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Information Law, Privacy and Data Protection", "et": "Infoõigus, privaatsus ja andmekaitse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course provides students with basic knowledge about the main concepts of information law and ethics, including privacy protection and data protection principles, as these affect the everyday practices of organisations and individuals. The course comprises lectures and seminars, and concludes with a written group work task the topic for which is agreed during the course.", "et": "Aine annab tudengitele alusteadmised infoõigust  ja -eetikat puudutavatest olulisematest kontseptsioonidest, sh privaatsuse kaitsest, ning andmekaitset puudutavatest olulisematest põhimõtetest infotöötaja igapäevatöös. Kursus koosneb loengutest ja seminaridest ning päädib aine jooksul kokku lepitud rühmatöö koostamisega."}, "objectives": [{"en": "The objective of the course is to provide an overview of current topics of information law and introduce certain dilemmas related to information law that can arise in the work of organisations and in people's everyday lives. The course also provides an overview of current principles of data protection, freedom of expression and its limits, public information and information ethics.", "et": "Aine eesmärgiks on anda ülevaade infoõiguse aktuaalsetest teemadest ning tutvustada võimalikke infoõigusega seonduvaid dilemmasid, mis tekivad organisatsiooni töös ja inimeste igapäevelus. Kursus annab ka ülevaate andmekaitse põhimõtetest, väljendusvabadusest ja selle piiridest, avalikust teabest ning infoeetika põhiküsimustest."}], "learning_outcomes": [{"en": ".Upon the completion of the course, the student:", "et": "Aine läbimisel tudeng:"}, {"en": "*\tknows main theories of information law and ethics;", "et": "*\tteab infoõiguse  ja - eetikaga seonduvaid olulisemaid kontseptsioone;"}, {"en": "*\tis able to recognise and express the dilemmas concerning the information processing and is prepared to analyse daily practices in information processing from the point of view of values and principles;", "et": "*\toskab märgata ja sõnastada andmete töötlemisega seotud moraalseid dilemmasid ning analüüsida informatsiooni töötlemisega seotud praktikaid ning norme;"}, {"en": "*\thas an overview of the principles of data protection, freedom of expression and public information.", "et": "*      oskab välja tuua ning analüüsida olulisemaid andmekaitse, väljendusvabaduse ja avaliku teabega seotud põhimõtteid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}