{"uuid": "83a7fb9d-94c0-671a-2875-13980857de0f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-12T14:11:45", "title": {"en": "Social Digital Competences", "et": "Sotsiaalsed digipädevused"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 A regular SV", "et": "25/26 S PÕ SV"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 17, "practice": 0, "seminar": 17, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "On this course we will focus on the different nuances that, combined, make up the human experience on digital platforms - the creation and reception of information, self-presentation and identity, smart devices and well-being, etc. Furthermore, we try to look beyond the micro-level of things (the personal), discussing the rapid transformations that the organisations and societies have gone through and still are going through.", "et": "Siin kursusel tegeleme digikeskkondades edukalt hakkama saamise nö \"inimlike\" aspektidega - info vastuvõtu ja loomise, oma identiteedi ja maine kujundamise ning haldamisega veebiplatvormidel, nutiseadmete ja vaimse heaolu ning paljude muude seonduvate teemadega. Lisaks püüame näha mikrotasandist (inimene) kaugemale, mõtestades organisatsioonides, institutsioonides ja ühiskondades toimuvaid muutuseid, mille taga võib olulise tegurina näha info- ja kommunikatsioonivahendite tormilist arengut."}, "objectives": [{"en": "The main aim of the course is to give a theoretical+practical overview of the social aspects of digital literacies. Various disciplines will meet and mix on this course and the student will get a roadmap of how to proceed in case of deeper interest sparked.", "et": "Kursuse eesmärk on anda oma õpingute alguses olevatele tudengitele ülevaade digipädevustest, mis on tihedamalt seotud sotsiaalsete oskuste ja teadmistega. Kursusel kohtuvad erinevad akadeemilised (sotsiaalteaduslikud) distsipliinid ning õppija saab esmase ülevaate ja edasised õppimissoovitused erinevate erialade ning valdkondade fookusteemadest ja käsitlusviisidest digipädevuste suures raamistuses."}], "learning_outcomes": [{"en": "After completing the course the student:", "et": "Pärast selle kursuse läbimist tudeng: "}, {"en": "- knows and recognizes the main skills and knowledge that are the components of digital literacies", "et": "- teab erinevaid oskuseid ja teadmisi, mida loetakse digipädevuste suure üldteema alla"}, {"en": "- can find and use existing tools and resources that advance one's digital literacies", "et": "- oskab leida ja kasutab olemasolevaid tööriistu ja õppevahendeid, mille abil on võimalik oma digipädevusi tõsta"}, {"en": "- recognizes different academic disciplines (of social sciences)", "et": "- tunneb ära erinevaid sotsiaalteaduslikke erialasid/distsipliine"}, {"en": "- searches and finds trustworthy scientific sources of information", "et": "- otsib ja leiab usaldusväärseid akadeemilisi teaduspõhiseid allikaid"}, {"en": "- trains and develops specific sub-skills of professional digital content creation", "et": "- harjutab digiplatvormidel toimuvat professionaalset sisuloomet"}, {"en": "- uses the correct terminology of this field ", "et": "- kasutab valdkonnas kasutusel olevaid erialaseid mõisteid (nt infokorratus, disinformatsioon, andmestumine, narratiiv jne)"}, {"en": "- reflects on their study experience and the role of ICTs in their life", "et": "- reflekteerib oma õpikogemust ning nutiseadmete ja digiplatvormide rolli ja funktsioone oma elus. "}, {"en": "- works with other students in groups, in order to achieve a shared goal", "et": "- töötab koos kaastudengitega ühise eesmärgi nimel, esitleb oma tööd teistele"}, {"en": "- uses the main study platforms of UT", "et": "- kasutab õppetöös peamisi Tartu Ülikoolis kasutusel olevaid õppeplatvorme"}], "notes": {}}, "grading": {"independent_work": {"et": "1. Iseseisev töö pärast kohtumist: leia veebist üks eesti- või inglisekeelne tööriist/test/hindamismudel, mille abil on võimalik iseenda digipädevusi hinnata ja/või mõõta. 7p\n\n2. Minu professionaalsed eeskujud erinevatel digiplatvormidel ja erinevates formaatides. Mida nad hästi teevad? Kuidas nad teevad? Kas need strateegiad võiks töötada ka minu puhul? 5p\n\n3. Iseseisev töö mitme nädala vältel (täpsem tööjuhend kursuse alguses Moodle'is): Oma andmepäringute tegemine. 40p\n\n4. Tee viis päeva kestev sotsiaalmeediapaus. Pea selle eksperimendi vältel päevikut, kuhu märgid jooksvalt (ja lubades soovi korral endale vaba keelekasutust ja informaalset kommunikatsiooni) oma kogemuse kohta käiva üles. 20p\n\n5. Eneserefleksioon. 6p\n\n6. Lõpuesitlus. 10p."}, "independent_work_assessments": [{"work_type": {"code": "practical", "et": "Praktiline ülesanne", "en": "practical assignment"}, "description": {"et": "Osalus seminarides 16x2p"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "13.09: Iseseisev töö pärast kohtumist: leia veebist üks eesti- või ingliskeelne tööriist/test/hindamismudel/…, mille abil on võimalik iseenda digipädevusi hinnata ja/või mõõta. Postita selle link kursuse Moodle’isse vastava kodutöö esitamise kohta, lisades ka väikese kirjelduse selle kohta, kuidas sul isiklikult selle tööriista/testi/mudeliga töötades läks. Kirjelda palun (soovituslikud küsimused, millele mõelda), kuidas jõudsid selle mõõdiku/testini - kes on selle testi loomise taga (otsi lisainfot), nt kas tegemist on teadusasutuse, kommertsettevõtte, valitsuse juures tegutseva \"kehaga\" vms? Kas on näha ka autorite/loojate nimed? Millega nad tegelevad, kes nad on? Mida see tööriist/test/mõõdik mõõdab? Kas enesekohased hinnangud või testib mingite konkreetsete teadmiste olemasolu? Kas on meelelahutuslikke elemente, milliseid? Kes on sihtrühmaks? Kuidas sellest aru said? Milliseid DigCompi osasid ära tunned (vt slaide avakohtumiselt)? Kuidas sul läks? Mis töötas/mis mitte? Millised teadmised sul on olemas, mida peaks edasi arendama? Kas soovitaksid seda testi nt õpetajatele/noorsootöötajatele/kogukonnaarendajatele/eakatetööga tegelejatele/...? 7p"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "23.10: Minu professionaalsed eeskujud erinevatel digiplatvormidel ja erinevates formaatides. Mida nad hästi teevad? Kuidas nad teevad? Kas need strateegiad võiks töötada ka minu puhul? Püüa leida inimesi, kes ei ole nö \"tavainfluencerid\" - st inimesed, kes loovad üsna laiale publikule sobivat \"geneerilist\" sisu selleks, et tähelepanumajanduse oludes raha teenida. Pigem otsi oma valdkonnaga tugevalt seotud professionaale, kes oma nö \"tavatöö\" kõrvalt teevad ka väga head digikommunikatsiooni nt sotsiaalmeedias. Loomulikult on siin variatsioone mitmeid - paljud inimesed teevadki oma tööd veebis (nt https://theprofessorisin.com, kes tegutseb paljudel platvormidel ja see ongi tema töö), aga on ka inimesi, kes teevad oma tavapärast tööd ja siis sinna juurde väga tugevat sotsiaalmeediakommunikatsiooni (nt https://www.instagram.com/opetajajoana/, https://www.sekspositiiv.ee/, https://wishcrys.com/about-me/). On OK, kui sa veel neid inimesi ei tea. Otsi ja leia nad! Ja siis analüüsi süvitsi. Selle töö pikkus peaks olema min 3 lk, kasuta ka kuvatõmmiseid, et näidata, milline on üldine esteetiline kuvand, milline on populaarne sisu, suhtlus auditooriumiga jne.  5p"}}, {"work_type": {"code": "report", "et": "Aruanne", "en": "report"}, "description": {"et": "22.11: Iseseisev töö september-oktoober (tähtaeg 22. november): Oma andmepäringute tegemine ja mõtestamine. Euroopa Liidu kodanikena on meil Euroopa isikuandmete kaitse üldmäärusest (GDPR) tulenevalt õigus teada, missuguseid andmeid meie kohta kogutakse ning kuidas neid kasutatakse. Selle õiguse realiseerimiseks tuleb pöörduda iga huvipakkuva organisatsiooni poole eraldi ning oma soovi selgelt väljendada; üksikutel juhtudel on andmete kättesaamine tehtud automaatseks. \n\nTööjuhend:\n\n1. Kirjelda paari lausega, mida sinu jaoks hõlmab mõiste “isikuandmed” - mis need on, kuidas need tekivad, kus need asuvad, mis nendega tehakse, missugused andmed on sinu jaoks isiklikumad ja missugused on vähem isiklikud jmt.\n2. Vali 5 või rohkem eraõiguslikku organisatsiooni, kes sulle teadaolevalt sinu kohta mingeid andmeid hoidma peaks. Nende hulgas võiks olla nii kohalikke kui rahvusvahelisi organisatsioone, nii suuremaid kui väiksemaid. 1-2 võivad olla [(sotsiaal)meedia]platvormid, mis võimaldavad andmete automaatset allalaadimist. Mõtle läbi ja pane ette kirja, missuguseid andmeid eeldad iga konkreetse päringuga saavat.\n3. Leia iga organisatsiooniga suhtluseks sobiv kanal ning ole korrektne ja viisakas! Ole valmis dialoogiks, ent sellekski, et mõni päring jääb vastuseta. Kui saad vastuse, mis ei vasta sinu ootustele (nt leiad, et andmeid peaks olema rohkem), selgita vastaspoolele oma seisukohta ning palu edasisi täpsustusi. \n4. Tee kogu tööst lühike kirjalik kokkuvõte, mis hõlmab: (1) sinu arusaama isikuandmetest (tööjuhendi esimene punkt); (2) andmepäringute protsessi, toimunud interaktsioone; (3) võrdlust andmepäringutest oodatud ja saadud tulemuse vahel (palun hoidu enda jaoks tundlike andmete jagamisest!); (4) refleksiooni, mida kogutud andmete põhjal enda kohta teada said; (5) mõtteid, et mis on täna meie isikuandmetega toimuvas hästi, mis pahasti ja mis saaks olla paremini või halvemini.\n\nVormista töö iseseisva sisu-ühikuna, mis ei vaja täiendavaid selgitusi (st et kujutletav lugeja, kes ei tea, miks ja mida sa tegid, saab selle kõik ühekorraga teada). 40p"}}, {"work_type": {"code": "diary", "et": "Õpipäevik", "en": "reflective learning diary"}, "description": {"et": "04.12: Tee viis päeva kestev sotsiaalmeediapaus. Loomulikult võib oma nutiseadmeid kasutada hädavajalikeks toiminguteks, kuid selleks, et eksperimendist päriselt kasu oleks - tee päriselt paus. Loobu TikTokist, Instagramist; Facebookist; Tinderist, YouTube’ist, isegi blogidest, äkki suudad pausitada isegi Spotifyst, Netflixist ja uudistest? Pea selle eksperimendi vältel päevikut, kuhu märgid jooksvalt (ja lubades soovi korral endale vaba keelekasutust ja informaalset kommunikatsiooni) oma kogemuse kohta käiva üles. Näiteks võid kirjutada iga päeva kohta (aga ära võta seda küsimuste nimekirja kohustusliku struktuurina): üldise kirjelduse, kuidas läks, millised on su tavapärased rutiinid ja rituaalid, milliseid muutuseid märkasid, milliseid ümberkorraldusi pidid tegema? Mis tuli lihtsalt, mis tuli raskelt? Milliseid funktsioone sotsiaalmeedia sinu jaoks täidab? Kas ja kuidas asendasid selle funktsiooni? Mis olid positiivsed ja negatiivsed aspektid? Mis tegi rõõmu, mis kurvastas, millised emotsioonid ja millal tekkisid? Mida sa võitsid, mida kaotasid? Kas sa arvad, et oled tüüpiline oma kogemuses ja tundmustes? Eriline mingil moel? Millest sa puudust tundsid?\nKuidas see eksperiment mõjutas su eraelu? tööelu? haridust? meelelahutust? jne jne. Päevikule on ligipääs vaid õppejõududel. 20p"}}, {"work_type": {"code": "project", "et": "Projekt", "en": "project"}, "description": {"et": "08.01: Rühmatöö (rühmas 3-4 inimest) - õpetajate, noorsootöötajate ja lapsevanemate koolitustel kurdetakse sageli, et ei saa üldse aru, mida ja kuidas lasped ja noored veebis räägivad. Me pakume siia lahenduse! Koostame ühiselt laste ja noorte netikeele sõnastiku (mis kehtib just selles ajas ja selle piirkonna laste seas). Selle töö raames on teil vaja teha eeltööd, lugedes akadeemilisi ja popteaduslikke allikaid, intervjueerida lapsi ja noori ning kujundada etteantud mudeli järgi lühike selgitav õppematerjal, mida saab kasutada Balti Infohäirete Sekkekeskuse kodulehel. \nlugege 5-7 akadeemilisest allikast, mis iseloomustab tänaste laste ja noorte netikeelt? miks see üldse erineb tavaslängist? millist mõju avaldab keele arengule? miks lapsed ja noored on nii agarad keeleuuendajad? mis on kohalik, mis globaalne? jne\nintervjueerige igaüks 1-2 last või noort (leppige kokku spetsiifilisem vanusevahemik), küsides neilt, milliseid sõnu tänased lapsed ja noored kasutavad? milliseid emojisid ja millises tähenduses? täpsem intervjuukava koostöiselt!\nkoostage nn sõnastik - mis tähendused mis sõnu/emojisid/audioklippe kasutatakse. Otsige lisa popkultuuri-alastest kirjutistest. 10p"}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "19.01: Eneserefleksioon - mida ja kuidas ma õppisin. 6p"}}], "min_points_from_tests": 90, "grade_preconditions": {"et": "Tudeng on osalenud vähemalt 75% seminaridest, esitatud on kõik kodutööd. Hilinenud tööde puhul vähendatakse max punkte ning tagasisidet ei pruugi saada."}, "grade_evaluation": {}, "debt_elimination": {"et": "Kokkuleppel vastutava õppejõuga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "Lisanduvad jooksvalt kursuse Moodle'i keskkonda.", "recommended_materials": "Lisanduvad jooksvalt kursuse Moodle'i keskkonda."}, "participants": {"lecturers": [{"person_uuid": "4c86ced5-a033-d169-8ec1-bc5bf536241b", "person_name": "Tanel Mällo", "structural_unit": {"code": "LTGI", "name": {"en": "Institute of Genomics", "et": "genoomika instituut"}, "email": "info.genoomika@ut.ee", "phone": "+372 737 5029", "webpage_url": "https://genoomika.ut.ee", "address": "Riia 23b/2\n51010 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Riia 23b/2", "zip": "51010", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "LT"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "4727a360-7eb5-ae0a-27db-dc74bd8b8d11", "person_name": "Diana Poudel", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "52eabaa0-9237-2356-a42d-97ba50479763", "person_name": "Maria Murumaa-Mengel", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "d5a08ab0-c74f-7af2-0f73-96aba0d70074", "person_name": "Lee Raudsepp", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "bda5c4b5-507f-41f6-bf50-4c4e9376f77b", "person_name": "Inger Klesment", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-19"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus. Kursuse ülevaade ja elumaailmate kaardistus - peamised probleemid, mis sotsiaalsete digipädevuste raamistuses tudengite jaoks aktuaalsed on. European Digital Competence Framework ehk DigComp ja erinevad tulevikutöö raportid/ennustused: milliseid oskuseid rõhutatakse? Mis on digipädevused ja kuidas neid õpetatakse? Kuidas õppida end digipädevaks? MMM ja IK"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar. Aktiivse õppimise viisid. Sotsiaalmeedialinnaku loomine, TikToki maja, Digikäkid ja muud sekkumispõhised projektid. IK ja MMM"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "NB! KOHTUME LINNAS, VABADUSSILLA ALL! Õpetamise ja õppimise baastõed. IK ja MMM"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Info otsimine ja kriitiline hindamine tavakodaniku ja üliõpilasena. IK"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar: infokorratus ning oskused ja teadmised, mis seonduvad akadeemilise info otsimisega. MMM"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Infokorratus ja infosõda. Ebapiisavatest kriitilise infotarbimise pädevustest tulenevad probleemid inimese/ ühiskonna vaates. Poudel"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Isiku maine digikommunikatsioonis, professionaalne enesepresentatsioon ja oma digijälgede haldamine. MMM"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Digipädevused, mis seonduvad iseenda ja teiste õiguste ja kohustustega veebis. Kikerpill"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Kuidas mõjutab kõikjalviibiv IKT meie toimimist üksikisikute ja ühiskondadena? Kuhupoole liigume? Mällo"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "IKT ja ühiskond: seminar. Mällo"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Enesekontroll ja enesejuhtimine digikommunikatsioonist küllastunud igapäevaelus. IK"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Seminar: tasakaal ja vaimne tervis. MMM ja IK"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Osalus ja sekkumine digipädevuste baasoskuste ja teadmiste seas. Platvormid ja huvipooled. MMM"}}, {"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "ISESEISEV TÖÖ - KÜSIMUSED SUSANILE + ENESEREFLEKSIOON"}}, {"work_type": {"code": "e-learning", "et": "e-õpe", "en": "e-learning"}, "topic": {}, "description": {"et": "ZOOMIS! Külaline Susan Laura Luitsalu. Kuidas luua mõjusat sisu? (Audiovisuaalse) sisu loomise põhimõtted professionaalses kommunikatsioonis. Külaline ja MMM"}}, {"work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic": {}, "description": {"et": "Ettekandeseminar. Tagasivaade kursusele. MMM ja IK"}}]}, "registration_info": {"audience": {"et": "valik- või vabaainena kõigi valdkondade üliõpilastele"}, "min_students": 15, "max_students": 80}, "parent_uuid": "460c3f7b-bbd6-1656-3758-d2ee83c5f082", "parent_code": "SVUH.00.178", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}