{"uuid": "2f39f6c3-a951-f9f0-4d54-ef36bf6ff506", "code": "SVUH.00.177", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Social Change Programme: Interventions to Social Systems", "et": "Sotsiaalse muutuse programmi loomine: süsteemsed sekkumised"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Creating a strategic action plan to meet the development challenges of the chosen field of social life. The process of creating a strategy based on theoretical approaches to socio-technical transfers. Analysis of future development trends, future creation method. Setting Development Goals (SMART) and defining indicators. Methods of collecting input from expert interviews and other experts. Methods of stakeholder involvement.", "et": "Strateegilise tegevuskava loomine valitud ühiskonnaelu valdkonna arenguväljakutsetele vastamiseks. Strateegia loomise protsess, lähtudes sotsiotehniliste siirete teoreetilistest käsitlustest. Tuleviku arengusuundumuste analüüs, tulevikuloome meetod. Arengueesmärkide püstitamine (SMART) ja mõõdikute määratlemine. Eksperdiintervjuu jt ekspertidelt sisendi kogumise viisid. Huvipoolte kaasamise meetodid."}, "objectives": [{"en": "To develop skills to analyze and plan for social systemic change by using transition theoretical framework and to create a strategic action plan that meets the development challenges of society.", "et": "Arendada oskusi analüüsida ja planeerida süsteemset muutust lähtuvalt siirdeteooriate raamistikust ning luua strateegiline tegevuskava, mis vastab ühiskonna arenguväljakutsetele."}], "learning_outcomes": [{"en": "*\tKnowledge of the basic concepts of the theory of multilevel perspective (MLP) on socio-technical transition and intervention. Ability to apply these concepts for the analysis of a specific area of social life", "et": "*\tMitmetasandilise perspektiivi (MLP) ja sekkumispunktide käsitluse kui sotsiotehnilise siirde põhimõistete tundmine  ja oskus neid konkreetse ühiskonnaelu valdkonna analüüsil rakendada"}, {"en": "*\tAbility to find innovative solutions in certain area of social life and implement them in a change program", "et": "*\tOskus leida valdkonnas uuenduslikke lahendusi ning neid muutuse programmi rakendada"}, {"en": "*\tAbility to diagnose the radical/incremental change potential considering megatrens and the maturity of local innovations", "et": "*\tOskus diagnoosida valdkonna valmidust suuremateks/väikemateks  muutusteks, arvestades tuleviku arengusuundumisi ja innovatsioonide küpsust"}, {"en": "*\tAbility to define a systemic intervention point as a goal of a strategic action plan", "et": "*\tOskus määratleda süsteemsed sekkumispunkid strateegilise tegevuskava sihina"}, {"en": "*\tAbility to select appropriate foresight methods for a development strategy", "et": "*\tOskus valida tulevikuloome meetodeid arengustrateegia visandamiseks"}, {"en": "*\tAbility to identify and interview experts for the creation of a strategic action plan", "et": "*\tOskus leida ja intervjueerida eksperte strateegilise tegevuskava loomise protsessis"}, {"en": "*\tAbility to identify stakeholders and choose stakeholder engagement methods", "et": "*\tOskus määratleda huvirühmasid ja meetodeid nende kaasamiseks"}, {"en": "*\tAbility to formulate development goals according to the SMART methodology and to select / create performance indicators", "et": "*\tOskus sõnastada eesmärke vastavalt SMART metoodikale ning valida/luua tulemusmõõdikuid"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}