{"uuid": "7cf5d408-2513-650f-1b01-6a8679481bed", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-10T13:49:41", "title": {"en": "The Risk and Prevention of Exclusion from the Community", "et": "Kogukonnast väljalangemise riskid ja ennetamine"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A block mode SV", "et": "24/25 S SÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The subject is interactive, which means that each meeting consists of a short theoretical introduction, followed by a discussion in groups, and interesting real life cases; cases are analyzed and/or solved where necessary. Learners may themselves offer cases of their own practice, which will be analyzed together. The existing international and Estonian legal provisions, policy analysis and existing research results must be used in the solving of cases. This allows students to combine their practical experiences, theoretical knowledge and expand their professional competence. Within the framework of the subject, a variety of measures are planned to allow students to test different roles, such as how to be a neglected child, no one listens to, a young offender who is demonized, a practitioner who has insufficient professional knowledge and overburdened with bureaucratic tasks, etc.", "et": "Aine on interaktiivne, mis tähendab, et iga kohtumine koosneb lühikesest teoreetilisest sissejuhatusest, millele järgneb arutelu rühmades, vajadusel lahendatakse huvipakkuvaid elulisi juhtumeid. Õppijad võivad ise pakkuda juhtumid nende endi praktikast, mida lahendatakse üheskoos. Juhtumite lahendamisel tuleb kasutada olemasolevaid rahvusvahelisi ja Eesti teemakohased seadusandluse sätteid, poliitikaanalüüse ning olemasolevaid uuringutulemusi. See võimaldab õppijatel ühendada nende praktilisi kogemusi, teoreetilisi teadmisi ning avardada professionaalset kompetentsi. Aine raames on planeeriud kasutada erinevaid mängulisi meetmeid, mis võimaldavad õppijatel katsetada erinevaid rolle, nt seda, kuidas olla hüljatud laps, keda keegi ei kuula, alaelaine õigurikkuja, keda demoniseeritakse, ebapiisava teadmisega praktik, kes on ülekoormatud bürokraatlike ülesannetega jms."}, "objectives": [{"en": "The course gives an overview of social processes and situations that pose risks for members, groups of a particular community to become marginalized and to be excluded from the community or society. When thinking about these processes, we focus on the theoretical knowledge of the sociology of deviant behavior (explanation theories). Social policy analyses, such as the impact analysis of recent reforms in Estonia, including the reform of the child protection system and substitute care (2016) on the special treatment of juvenile offenders (2018). ", "et": "Kursus annab ülevaate sotsiaalsetest protsessidest ja olukordadest, mis tekitavad riske teatud kogukonna liikmetele, rühmadele marginaliseeruda ning kogukonnast või ühiskonnast välja langeda. Nende protsesside mõtestamisel keskendume hälbekäitumise sotsioloogia teoreetilisele teadmisele (seletusteooriad). Ohtude ja riskide mõistmiseks ja ennetamise aluseks on sotsiaalpoliitilised analüüsid, nt Eestis hiljuti läbiviidavate reformide mõju analüüs, sh lastekaitsesüsteemi ja asendushoolduse reform (2016) alaealiste õigusrikkujate erikohtlemise reform (2018). "}, {"en": "At the same time, we plan to focus on the perspective of the subject, i.e. analyze the reactions caused by insufficient integration and exclusion of the person/group, and to evaluate various interventions that support marginalization and withdrawal from the community, and to compare positive interventions such as restorative justice, narrative therapy and solution-centred short therapy that help stop marginalization and strengthen the development of a coherent society.", "et": "Samas on kavas aine raames keskenduda subjekti perspektiivile ehk analüüsida neid reaktsioone, mida ebapiisav lõimumine ja tõrjumine inimesel/grupil esile kutsub ning hinnata erinevaid sekkumisviise, mis marginaliseerumist ja kogukonnast välja langemist pigem toetavad ning võrdluseks tuua positiivseid ja kaasavaid sekkumisviise, nt taastav õigus, narratiivi teraapia ja lahenduskeskse lühiteraapia, mis aitavad marginaliseerumist peatada ning tugevdavad sidusa ühiskonna arengut."}], "learning_outcomes": [{"en": "As part of this course, the students will study the marginalization process via theories of explanation concerning individuals/groups/communities in social relations with their environments. The focus is on the interaction of individual peculiarities and relationships in human/group/community choices. This is an inevitable knowledge to understand and prevent social risks. On one hand, a good practitioner must know that no person is born as a criminal, but develops into one relating with other people and institutions in their growth environment. Therefore, an analysis of environmental risks is necessary for prevention and intervention in order to avoid focusing on the accusation of an individual.", "et": "Kursuse raames tutvuvad magistrandid marginaliseerimisprotsessi seletavate teooriatega, mis käsitlevad indiviidi/gruppe/kogukondi sotsiaalsetes suhetes nende keskkondadega. Keskendutakse individuaalsete iseärasuste ja suhete koosmõjule inimese/grupi/kogukonna valikutes. See on vältimatu teadmine selleks, et mõista sotsiaalseid riske ja neid ennetada. Ühelt poolt peab hea praktik teadma, et ükski inimene ei sünni kurjategijana, selleks ta areneb suheldes oma kasvukeskkonnas olevate teiste inimeste ja institutsioonidega. Sellepärast on keskkonna riskide analüüs ennetamiseks ja sekkumiseks vajalik, et vältida üksikindiviidi süüdistamisele keskendumist."}, {"en": "At the end of the course, the student ", "et": "Kursuse lõpuks üliõpilane "}, {"en": "- knows the basic theories that explain disturbing behavior and marginalization; ", "et": "-\ttunneb põhilisi hälbivat käitumist ja marginaliseerimist seletavaid teooriaid;"}, {"en": "- knows the general social risks that may lead to the marginalization of people, groups and communities; ", "et": "-\ttunneb üldisi sotsiaalseid riske, mis võivad tekitada inimeste, rühmade ja kogukondade marginaliseerumist;"}, {"en": "- is able to analyze and evaluate these risks, sees the complete and complex picture; ", "et": "-\toskab analüüsida ja hinnata neid riske, näeb tervikpildi;"}, {"en": "- knows the modern science-based intervention and prevention methods; ", "et": "-\ttunneb kaasaja teaduspõhiseid sekkumis- ja ennetamisviise;"}, {"en": "- takes social risks and prevention professionally and responsibly; ", "et": "-\tsuhtub sotsiaalsetesse riskidesse ning ennetusse professionaalselt ja vastutustundega;"}, {"en": "- is able to avoid accusations of a single person/group/community, knowing that accusation only increases the risk of marginalization; ", "et": "-\toskab vältida üksikinimese/grupi/kogukonna süüdistamist, teades, et süüdistamine vaid süvendab marginaliseerumise riske;"}, {"en": "- is ethical in their professional activities.", "et": "-\ton oma professionaalses tegevuses eetiline."}], "notes": {"et": "Ainekavas võivad toimuda muudatused ettenägemata põhjustel. Nendest informeeritakse õppijaid esimesel võimalusel."}}, "grading": {"independent_work": {"et": "Iga magistrant valib või koostab ühe juhtumi vastavalt tema töö- või huvitegevusele. Juhtum võib olla päriselust ja peab olema veel lahendamata. Juhtumi kirjelduse pikkus maks. 1 lk teksti, kus on selgelt välja toodud probleem, mis ootab lahendamist. Juhtumi koostamisel tuleb järgida eetika põhimõtteid, s.t vältida juhtumiga seotud inimeste või kogukondade äratundmist. Sellised andmed nagu juhtumi koht, isikute pärisnimed peavad olema asendatud varjunimedega, inimeste vanus, haruldased iseärasused, perekonna üksikasjad jms peavad olema varjatud.\nIga magistrant loeb käsitlevate teemade kohta õppejõu poolt pakutud kirjandust; otsib ise või kasutab õppejõu poolt pakutud allikaid.\nIga magistrant osaleb aktiivselt juhtumite lahendamises auditoorse/veebi töö käigus ja esitab kirjaliku refleksiooni õpitu kohta. Täpsemalt vt Moodle ülesannete juures."}, "grade_preconditions": {"et": "Hindamisele pääseb õppija, kes täitis ülesandeid, st esitanud individuaalsed tööd vähemalt 51% ulatuses."}, "grade_evaluation": {"et": "Lõplik tulemus kujuneb esitatud tööde ja aktiivse osalemise baasil."}, "debt_elimination": {"et": "Võlgnevuse likvideerimine toimub individuaalsel kokkuleppel õppejõuga."}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "60be03bd-4d31-467e-b6e0-861301e1eee9", "type": "MOODLE", "code": "SVUH.00.167_SO", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Abels, P.& Abels, S. (2001). Understanding Narrative Therapy. A Guidbook for the Social Worker. New York: Springer.\nTrotter, C. (2015). Working with Involuntary Clients. A Guide to Practice. London and New York, Routldge.\nTrotter, C. and Ward, T. (2013). Involuntary Clients, Pro-Social Modelling and Ethics. Ethics and Social Welfare, 7(1): 74-90. https://doi.org/10.1080/17496535.2012.666753\nTurney, D. (2012). A relationship-based approach to engaging involuntary clients: the contribution of recognition theory. Child & Family Social Work, 17: 149-159. doi:10.1111/j.1365-2206.2012.00830.x\nAktuaalsed artiklid ajakirjast Sotsiaaltöö ja Justiitsministeeriumi materialid.", "recommended_materials": "Kottler, J.A. (2015). Stories We've Heard, Stories We've Told. Life-changing narratives in therapy and everyday life. Oxford: Oxford University Press.\nWhite, M. and Epstein, D. (1990). Narrative means to Therapeutic Ends. New York, London: W.W. Norton & Company.\nNimekiri täieneb jooksvalt."}, "participants": {"lecturers": [{"person_uuid": "a6377532-4846-9391-c43d-a0490d7b3033", "person_name": "Judit Strömpl", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "4, 6, 10, 14, 20"}, "entries": [{"course_week": 1, "time": "2024-09-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Sissejuhatus, tutvumine üksteise ja ainega, valikute ja ühiste kokkulepete tegemine ehk aine edaspidine kavandamine.\nPõhilised tõrjumise ja marginaliseerimise teoreetilised käsitlused. Probleemse käitumise individuaalsed ja sotsiaalsed mõjurid. Karistuse mõju"}}, {"course_week": 1, "time": "2024-10-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Kes on sundklient? Kuidas aidata inimest, kes \"abi vastuvõtmist ei soovi\"? \nTrauma mõju inimese käitumisele. (külaline: kogemusnõustaja Immanuel Volkonski)"}}, {"course_week": 1, "time": "2024-11-08", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Traditsioonilised ja alternatiivsed sekkumisviisid.\nJuhtumite esmane tutvustamine.\nNarratiiviteraapia kasutatavus sekkumisel ja riskide ennetamine."}}, {"course_week": 1, "time": "2024-12-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Narratiiviteraapia tehnikate omandamine (toimub juhtumite alusel).\n"}}, {"course_week": 1, "time": "2025-01-17", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {}, "description": {"et": "Taastava õiguse võimalused tõrjumise ja marginaliseerumise ennetamisel ning konfliktide lahendamisel (külaline Anna Markina)\nKursuse lõpetamine"}}]}, "registration_info": {"audience": {"et": "Kogukonna arendamise ja sotsiaalse heaolu magistritudengid. Infoühiskond ja sotsiaalne heaolu õppekava 3.aasta bakalaureusetudengid"}, "max_students": 25}, "parent_uuid": "3652c7d2-4b53-8f19-2f8a-3ef0b5f738c6", "parent_code": "SVUH.00.167", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}