{"uuid": "76d65a02-0ffc-4420-ac1d-db1b000726fa", "code": "SVUH.00.217", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Academic Self-Management", "et": "Akadeemiline enesejuhtimine"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "With many interactive lectures, different group-work and pedagogical techniques  help students to acquire necessary skills to cope with studies in the university. Within the course framework an overview is given of different study styles, reading and writing academic text, referencing, information searching skills, web-based learning, group-work and problem based learning skills. Students are also guided in self-analysis, coping with stress and problematic situations and academic practices are introduced.", "et": "Paljude interaktiivsete loengute, erinevate rühmatöö ja õppemetoodiliste tehnikatega täidetud kohtumistel aidatakse tudengitel omandada vajalikud oskused, millega ülikoolis õppides kokku puutuda tuleb. Kursuse raames antakse ülevaade õppimisstiilidest ja nendega hakkama saamisest, akadeemilise teksti lugemise ja kirjutamise oskustest, viitamisest, infootsinguoskustest, veebiõppe eripäradest ning rühmatöö ja probleemõppe olemusest. Samuti aidatakse tudengitel tegeleda eneseanalüüsiga, stressi ja problemaatiliste olukordadega toimetulekuga ning tutvustatakse akadeemilisi tavasid."}, "objectives": [{"en": "With many interactive lectures, different group-work and pedagogical techniques help students to aquire necessary skills to cope with studies in the university and orienting oneself in the academic sphere. The course is designed to help networking among professional networks, fellow students and further career options.", "et": "Kursuse eesmärk on loeng-seminaride ja iseseisvate individuaalsete ning rühmatööna valmivate ülesannete kaudu anda põhilised oskused, mis on vajalikud ülikoolis õppimiseks ja akadeemilises sfääris orienteerumiseks. Kursus võimaldab luua tihedaid sidemeid oma kursuse- ja instituudikaaslaste vahel, kasvatada erialakogukondi ning planeerida oma professionaalset arengut."}], "learning_outcomes": [{"en": "The student has knowledge about one's own advantages and peculiarities as a learner and can rely on this knowledge while studying at the university.", "et": "Üliõpilane analüüsib oma tugevusi ja piiranguid õppijana ning toetub neile õppimisprotsessis."}, {"en": "The student plans in a practical and conscious way one's studies at the university.", "et": "Üliõpilane planeerib teadlikult ja otstarbekalt oma õppimist ülikoolis."}, {"en": "The student knows how to use scientific literature, how to find and refer to the materials in a correct manner.", "et": "Üliõpilane oskab kasutada teaduskirjandust, leida ja korrektselt viidata ja allikmaterjalidele."}, {"en": "The student has knowledge about ways of working with different texts and uses them in order to support one's studies. ", "et": "Üliõpilane tunneb erinevaid tekstiga töötamise viise ja kasutab neid oma õppimise toetamiseks."}, {"en": "The student has knowledge about different forms of writing tasks in use at the institute. ", "et": "Üliõpilane tunneb erinevaid ühiskonnateaduste instituudis kasutusel olevaid kirjalike töö vorme."}, {"en": "The student participates in group works ", "et": "Üliõpilane osaleb grupitöödes."}, {"en": "The student knows the advantages of distant learning and participates in online lectures.", "et": "Üliõpilane tunneb e-õppe võimalusi ja osaleb veebiloengutes."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}