{"uuid": "175edbba-4381-8451-ac15-e55de324adaa", "code": "SVUH.00.051", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Sociology and Information Studies Observation Practice", "et": "Sotsioloogia ja infoteaduste vaatluspraktika"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 2, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": ".", "et": "Õppeaine eeldab üliõpilase põhjalikumat tutvumist mingi asutuse või organisatsiooni tööga, kus leidub sotsioloogile sobivat erialast tegevust ning mingi iseseisva ülesande täitmist vähemalt \"sotsioloogi abi\" tasandil (nt andmekogumine, andmebaasi korrastamine, sekundaarsete allikate põhjal mingist teemast ülevaate koostamine jne).\n\nVäga positiivne on, kui ülesanne sisaldab ka laiemaid analüütilisi aspekte, kuid vaatluspraktika puhul see otseselt nõutav pole. Küll aga tuleb aru saada, mis on teostatava tegevuse sisuliseks väljundiks (nt mille jaoks andmed kogutakse: mingi arengukava koostamiseks, detailplaneeringu tegemiseks, tellitud rakendusuuringu jaoks vms) ja seda väljundit ka praktikaaruandes iseloomustada.\n\nPraktikal on 2 juhendajat/koordinaatorit: üks instituudist ja teine praktikabaasist. Praktikabaasi poolne koordinaator ei pea tingimata olema sotsioloog (või siis mõne sotsiaalteaduste eriala lõpetanu), küll aga peab ta olema pädev püstitama tööülesannet ja hindama ülesande täitmist (nö \"tellija\" roll).\n\nPraktika eeldab küll praktikabaasi tegevusest ülevaate saamist, kuid ei eelda tingimata regulaarset kohalolekut (sageli pole see ka tehniliselt võimalik, kuna eriti väiksemates praktikabaasides võib küllalt palju tööd toimuda kaugtöö põhimõttel). Küll aga tuleks võimalusel osaleda kõigis ühistegevust nõudvates üritustes (koosolekud, arutelud, seminarid, presentatsioonid)."}, "objectives": [{"en": "Get acquainted with the work of a sociologist / social science analyst", "et": "- Tutvuda sotsioloogi / sotsiaalvaldkonna analüütiku erialase tööga"}, {"en": "Develop analytical and reflective skills", "et": "- Arendada analüütilisi ja refleksioonioskusi"}, {"en": "Choose appropriate fields of activity for professional work and for further studies", "et": "- Valida sobivaid tegevussuundi erialaseks tööks ja edasisteks õpinguteks"}, {"en": "Widen employment opportunities in the labour market after graduation", "et": "- Avardada lõpetamisjärgseid võimalusi tööjõuturul"}, {"en": "Complete under supervision a small-scale analytical or technical task of a sociologist / social science analyst", "et": "- Realiseerida juhendamise all ise mingit väiksemamahulist analüütilist või korralduslikku tööülesannet, mis võiks kuuluda sotsioloogi / sotsiaalvaldkonna analüütiku töövaldkonda"}], "learning_outcomes": [{"en": "The student:\n- obtains practical work experience directly related to the work of a sociologist or a social science analyst;\n- understands the goals of the task as a whole and can reflect on his/her engagement in the practice activities and link this with past studies;\n- is informed about the activities of his/her training centre (institution or organization) and the tasks of a sociologist / social science analyst employed there", "et": "- Üliõpilane omandab reaalse töökogemuse mingi sotsioloogi või sotsiaalvaldkonna analüütiku tegevusega seotud ülesande/ ülesannete realiseerimisel\n- Üliõpilane saab aru ülesande kui terviku eesmärkidest, oskab reflekteerida oma tegevust ülesande raames ja siduda seda oma varasemate õpingutega\n- Üliõpilane tunneb praktikabaasi (asutuse või organisatsiooni/ selle allüksuse/ uurimisprojekti) tegevust ja sotsioloogi/ sotsiaalvaldkonna analüütiku tegevusega seotud vajadusi selles asutuses/ allüksuses/ uurimisprojektis"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}