{"uuid": "ca295856-d62d-3719-19ed-c778583db7b1", "code": "SVUH.00.191", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-10T14:17:57", "title": {"en": "Information Resilience", "et": "Infovastupidavus"}, "credits": 4, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "other_year", "et": "üle õppeaasta", "en": "every other academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course introduces contemporary influencing and manipulation trends in digital environments. The participants learn intervention practices used to cope with information disorders to increase information resilience in society and community. This is a practical course that uses interactive student-centred learning methods.", "et": "Kursusel tutvustatakse kaasaegseid suundumusi mõjutustegevustest digikeskkondades, infohäiretega toimetuleku ja ühiskondliku vastupidavuse suurendamise praktikaid. Kursus on praktilise suunitlusega ja õppijast lähtuva interaktiivse õppemetoodikaga."}, "objectives": [{"en": "Information disorders and manipulations are increasingly frequent in professional communication work and in the individual's everyday information consumption. The course provides evidence-based intervention practices for preventing the dissemination of disinformation in public communication. The course offers various practical guidelines and social media analysis on the organisational and individual levels.", "et": "Infohäired ja mõjutustegevus avalikus inforuumis on üha sagedasem probleem nii professionaalses kommunikatsioonitöös kui ka indiviidi igapäevases infotarbimises. Infovastupidavuse kursus pakub teaduspõhiseid sekkumispraktikaid desinformatsiooni leviku piiramiseks avalikus kommunikatsioonis, sotsiaalmeedia tegevuste analüüsi ja praktilisi juhtnööre ning tegevuspraktikaid organisatsiooni ja indiviidi tasandi infovastupidavuse suurendamiseks."}], "learning_outcomes": [{"en": "Upon completing the course, the student:\n*\tKnows the communicative principles and narratives of how information disorders are disseminated on individual and organisational levels,\n*\tIn the unexpected critical information situation is able to plan and execute communication drawing from the communicative needs of the community,\n*\tUnderstands the social and psychical tensions that arise in infodemic situations and is able to use communicative practices to alleviate the tensions in the organisation and community.", "et": "Kursuse läbinud õppija:\nTeab levinumaid indiviidi ja organisatsiooni tasandi valeinfo levitamise ning infokorratuste kommunikatiivseid põhimõtteid ja narratiive\nOskab infosõja ja kriisisituatsioonides planeerida ja ellu viia kogukondade ja organisatsioonide  infovajadusest lähtuvat kommunikatsiooni\nMõistab infohäirete tingimustes kujunevaid vaimseid ja sotsiaalseid pingeid ning oskab kasutada kommunikatiivseid vahendeid nende leevendamiseks organisatsioonis ja kogukonnas\nOtsib ja leiab usaldusväärseid akadeemilisi teaduspõhiseid allikaid\nMõistab ja kasutab valdkonnas kasutusel olevaid erialaseid mõisteid (nt infokorratus, desinformatsioon, andmestumine, narratiiv jne)"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}