{"uuid": "a022eb56-94b4-2941-fde7-f13e02e33b6f", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-09-25T12:12:15", "title": {"en": "Rhetoric", "et": "Retoorika"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "We are rhetorical beings, living in a rhetorical world. Rhetoric is more than the art of persuasion, or a magical dust of words that can be sprinkled on a text to mislead someone. Rhetoric is inherent in the foundation of human society. This course will look at rhetoric from a contemporary perspective and in a synthesis of different approaches. In particular, we will do this by analysing, writing and delivering speeches. At the same time, everything we learn is transferable to all media and contexts, and all the topics covered are practically applicable in even if the student who has completed the course never writes and/or delivers another speech in their life.", "et": "Me oleme retoorilised olendid, kes elavad retoorilises maailmas. Retoorika on midagi rohkemat kui veenmise kunst või sõnatolm, mida kellegi eksitamiseks tekstile puistada saab. Retoorika on inimühiskonna lahutamatu alus. Kursus käsitleb retoorikat kaasaegses võtmes ning erinevate käsitluste sünteesis. Eelkõige teeme seda kõnede näitel, kõnesid analüüsides, kirjutades ja esitades. Samas on õpitu ülekantav kõikidesse meediumitesse ja kontekstidesse ning kõik käsitletavad teemad on eluliselt rakendatavad ka siis, kui kursuse läbinud tudeng elus rohkem ühtegi kõnet ei pea."}, "objectives": [{"en": "The aim of the course is to build a foundation of clear, bold and stylish self-expression on which to build in one's studies. As well as understanding the nature of communication and rhetoric, the aim is to understand oneself in order to see more clearly one's strengths on which one can rely on in the futuure.", "et": "Kursuse eesmärk on luua vundament selgeks, julgeks ja isikupäraseks eneseväljenduseks, millele edasiste õpingute käigus toetuda. Kommunikatsiooni ja retoorika olemuse mõistmise kõrval on eesmärgiks ka iseenda mõistmine, et näha selgemalt oma tugevusi, millele tulevikus toetud."}], "learning_outcomes": [{"en": "A student who has completed the course:", "et": "Kursuse läbinud tudeng:"}, {"en": "- Understands the nature of rhetoric and communication and the rhetorical nature of themselves and the world;", "et": "- mõistab retoorika ja kommunikatsiooni olemust ning enda ja maailma retoorilisust;"}, {"en": "- Analyses themselves, the audience and the context and is able to bridge the empathic gap;", "et": "- analüüsib ennast, publikut ja konteksti ning oskab ületada empaatilist lõhet;"}, {"en": "- Understands the structures of a text, including rhetorical devices, and is able to identify them when analysing a speech;", "et": "- mõistab teksti struktuure, sh retoorikavõtteid, ning oskab neid kõnet analüüsides tuvastada;"}, {"en": "- Can consciously use the structures of a text to create an emotional and intellectual journey in their speeches;", "et": "- oskab teksti struktuure oma kõnes emotsionaalse ja intellektuaalse teekonna loomiseks teadlikult kasutada;"}, {"en": "- Can produce and deliver a high quality visualised presentation;", "et": "- oskab koostada ja esitada kvaliteetselt visualiseeritud presentatsiooni;"}, {"en": "- Can overcome anxiety and discomfort when speaking in front of a camera and an audience.", "et": "- suudab ületada kaamera ja publiku ees esinemisega seotud ärevust ja ebamugavust."}], "notes": {}}, "grading": {"independent_work": {"et": "Kolm lühiülesannet 3x8p\nKõneanalüüs 20p\nKõne lindistus stuudios, kaaslaste kõnede tagasiside ning refleksioon 20p\nLõpuesitlus 20p\nKodulugemised 8x2p (koos loengus arutlemisega)"}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "Lühiülesannete (8p) lävend on 5p, st ülesande arvestatuks lugemiseks tuleb koguda vähemalt 5p. Alla 5p jääv töö on mittearvestatud ning tuleb vastavalt juhisele ja tagasisidele täiendada ja parandada, et puuduvad punktid välja teenida.\n\nSuurte kodutööde (20p) lävend on 15p, st ülesande arvestatuks lugemiseks tuleb koguda vähemalt 15p. Alla 15p jääv töö on mittearvestatud ning tuleb vastavalt juhisele ja tagasisidele täiendada ja parandada, et puuduvad punktid välja teenida.\n\nLäbiv hindamiskriteerium on töö vastavus ülesande juhisele selles tähenduses, et ükski nõutud osa ei ole põhjendamatult puudu. Iga ülesande spetsiifiline juhis kirjeldab seda, millised osad peavad töös olemas olema. Lisaks hindan läbivalt tööde põhjalikkust, mis väljendub eelkõige selles, et ilmselgelt pealiskaudne töö on mittearvestatud ning kuulub täiendamisele. Samas on võimalik teenida lisapunkte erilise põhjalikkuse, julgete katsetuste ja loovuse eest, kuniks töö demonstreerib seda, et autor on asjast aru saanud. Lisapunktid võivad aidata kompenseerida väiksemaid libastumisi teistes ülesannetes.\n\nLoovtööde hindamine on paratamatult subjektiivsem. Nende puhul hindan eelkõige tervikut ning pean silmas seda, kas autor demonstreerib oluliste õpitud põhimõtete mõistmist, isegi kui ta valib mõnda põhimõtet efekti saavutamiseks teadlikult rikkuda. Oluline on see, et esitatav tervik töötaks ning ei väljendaks pealiskaudsust või hoolimatust oma publiku suhtes. Julge loovuse kaal on nende ülesannete puhul kõrgem.\n\nPõhjendamatult hilinenud tööd kaotavad iga hilinenud nädalaga 10% punktidest (alates tähtajale järgnevast päevast). See tähendab, et üle kolme nädala hilinenud töö ei saa teenida 75% nõutud punktidest. Kui tead, et tööd ei ole võimalik õigeaegselt esitada, siis võta kohe minuga ühendust ning otsime lahenduse.\n\nÜlesannete täpsemad juhised ja hindamiskriteeriumid on toodud Moodles."}}, {"work_type": {"code": "home_reading", "et": "Kodulugemine", "en": "home reading"}, "description": {"et": "Kaheksal korral jääb kodus mõni tekst lugeda või video vaadata. Need tuleb Moodles loetuks-vaadatuks märkida. Iga sellise materjali kohta esitan teile Moodles mõned küsimused. Loengus annan igal korral paarile inimesele sõna ning palun vastata mõnele esitatud küsimusele. Võimetus arutleda ühegi küsimuse üle pakututest tähendab selle kodulugemise eest 0p. Puudumise korral tuleb punktide teenimiseks esitada kirjalikud vastused kõikidele küsimustele. Kui puudumise põhjused olid tervislikud, siis võib paluda vastuste esitamiseks ajapikendust."}}, {"work_type": {"code": "oral", "et": "Suuline lõpphindamine", "en": "final oral assessment"}, "description": {"et": "Jaanuaris toimuvad lõpuesitlused, kus tuleb demonstreerida õpitu valdamist publiku ees kõneledes ning Powerpointi presenteerides. Selle puhul hindan eelkõige tervikut ning pean silmas seda, kas autor demonstreerib oluliste õpitud põhimõtete mõistmist, isegi kui ta valib mõnda põhimõtet efekti saavutamiseks teadlikult rikkuda. Oluline on see, et esitatav tervik töötaks ning ei väljendaks pealiskaudsust või hoolimatust oma publiku suhtes. Julge loovuse kaal on selle ülesande puhul kõrgem.\n\nEbaõnnestumise korral palun täiendada esitluse faili ning selle kommentaaridesse lühidalt mõned reflekteerivad mõtted kirjutada. Kordusesitlusi jaanuaris üldiselt ei korraldata. Korduskatse on reeglina kirjalik, äärmisel juhul võib suurema hulga põhjusega puudujate tekkimisel korraldada korduskatse Zoomis.\n"}}], "grade_preconditions": {"et": "Kõik tööd peavad olemas esitatud. Iga suur kodutöö peab koguma vähemalt 15 punkti, lühiülesanded 5 punkti. Puudulikke töid tuleb vastavalt tagasisidele täiendada, et punktid välja teenida."}, "grade_evaluation": {"et": "Lõpphinne moodustub kõikide punktide summas. Kui oled semestri alguses mõnest tööst punkte kaotanud, aga soovid pretendeerida kõrgemale hindele, siis võid paluda individuaalset lisatööd, et oma lõplikku hinnet ühe astme võrra tõsta."}, "grade_conditions": {"A": {"et": "96 punkti või rohkem"}, "B": {"et": "91-95 punkti"}, "C": {"et": "86-90 punkti"}, "D": {"et": "81-85 punkti"}, "E": {"et": "76-80 punkti"}, "F": {"et": "75 punkti või vähem"}}, "debt_elimination": {"et": "Kõiki lävendi alla jäänud kodutöid on võimalik parandada. Probleemide korral teeme individuaalsed kokkulepped võlgnevuste kõrvaldamiseks."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "f8aa2a85-8ea1-4e5e-81bc-87a8c861dcf8", "type": "MOODLE", "code": "SVUH.00.212", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}]}, "participants": {"lecturers": [{"person_uuid": "fc08fdb5-257e-b03e-6e09-dd2227221963", "person_name": "Kalle Valge", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "4a6a4b6f-4ea0-94ed-e139-7818f6f52db8", "person_name": "Kaspar Kruup", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-16"}}, "registration_info": {"audience": {"et": "Ajakirjanduse ja kommunikatsiooni bakalaureuseõppe 1. aasta üliõpilased"}, "max_students": 42}, "parent_uuid": "96a5e926-6bb1-1832-5d56-3e7423bf0582", "parent_code": "SVUH.00.212", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}