{"uuid": "5e68678e-5b73-2c81-d8e6-428b0ba8fded", "code": "SVUH.00.062", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Information Systems", "et": "Infosüsteemid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Course will give basic knowledge about information systems, concepts related to information systems, will introduce general operational logic of information systems, how systems affect the organization and the system development life cycle. Also, students will learn state information system information architecture, why it is important and what are the possibilities.", "et": "Aine annab ülevaate infosüsteemidega seonduvatest olulistest mõistetest, infosüsteemide toimimisloogikast, nende mõjust organisatsiooni töödele ning arendusest, aga ka algteadmised ka riigi infosüsteemide infoarhitektuurist, nende olulisusest ning võimalustest."}, "objectives": [{"en": "The aim of the course is to give an overview of the role of information systems in a modern organization. The course will introduce the types, development, and management of information systems and will give overview of the state information system information architecture.", "et": "Kursuse eesmärk on anda ülevaade infosüsteemide rollist kaasaegses organisatsioonis. Tutvustatakse infosüsteemide tüüpe, arendust ja haldust ning antakse ülevaade riigi infosüsteemide infoarhitektuurist."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "- knows and is able to use basic concepts related to information systems and databases and knows how they relate (also open data, big data);", "et": "- tunneb ja oskab kasutada infosüsteemide ja andmebaasidega seotud põhimõisteid, teab, mil moel need omavahel suhestuvad (sh avaandmed, suurandmed);"}, {"en": "- knows about information systems role in modern organization;", "et": "- teab infosüsteemide rolli kaasaegses organisatsioonis;"}, {"en": "- is able to name basic problems related to information systems privacy issuses and ethics;", "et": "- oskab nimetada põhilisi probleeme seoses infosüsteemide eetilisuse ja privaatsusküsimustega;"}, {"en": "- knows about information system types which help to support organizations main processes and knows their general operational logic;", "et": "- teab organisatsiooni põhiprotsesse toetavate infosüsteemide põhilisi tüüpe ja nende üldist toimimisloogikat (sh mäluasutuste infosüsteeme);"}, {"en": "- knows about information system types which help to support organizations support processes and knows their general operational logic;", "et": "- teab organisatsiooni tugiprotsesse toetavate infosüsteemide põhilisi tüüpe ja nende üldist toimimisloogikat (sh dokumendihaldussüsteeme);"}, {"en": "- knows what is organizations IT infrastructure, knows how to describe its functioning and management;", "et": "- teab, mis on riigi infosüsteemide infoarhitektuur ning miks see on oluline;"}, {"en": "- knows about information systems development process, how it affects the organization, and what to consider while implementing information systems;", "et": "- teab kuidas on üles ehitatud infosüsteemide arendus, kuidas see mõjutab organisatsiooni tööd ning millele tähelepanu pöörata süsteemi juurutamise puhul;"}, {"en": "- knows what is state information system information architecture and why it is important;", "et": "- teab, mis on organisatsiooni IT infrastruktuur, oskab kirjeldada selle toimimist ja haldust;"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}