{"uuid": "60379343-08b7-72ef-dafd-611ef5860b6e", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-01-21T12:20:35", "title": {"en": "Practical Journalism I", "et": "Praktiline ajakirjandus I"}, "credits": 12, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 A regular SV", "et": "24/25 S PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": false, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 18, "practice": 40, "seminar": 52, "colloquium": 0, "web_learning": 0, "independent_work": 202, "individual_work": 0, "internship": 0}, "prerequisites": [{"required": true, "uuid": "dec8c897-d4f5-41c1-c72a-57db39ccaebd", "code": "SVUH.00.213", "title": {"en": "Foundations of Journalism", "et": "Ajakirjanduse alused"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "ad7580dd-eccf-dad3-d574-b53bf1e17602", "code": "SOZU.01.017", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "News Sociology", "et": "Uudise sotsioloogia"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "5ccbdd80-aa8b-a36c-d477-2767788435b4", "code": "SOZU.01.193", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-04-24T14:33:53", "title": {"en": "Basics of News Writing", "et": "Uudise alused"}, "credits": 5, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": true, "uuid": "845b60fa-24d9-6710-4d98-825bda8e2a2c", "code": "SOZU.01.181", "title": {"en": "Interviewing Techniques", "et": "Kuulamistreening ja intervjueerimine"}, "credits": 3, "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "695fc6fa-0eed-4583-46a4-ca0b587742e8", "code": "SHZU.01.015", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-04-02T11:36:38", "title": {"en": "Interviewing Techniques", "et": "Kuulamistreening ja intervjueerimine"}, "credits": 5, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "096a8f08-b55f-c7d8-69c7-314972d054bd", "code": "SVUH.00.215", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Interviewing Techniques", "et": "Kuulamistreening ja intervjueerimine"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": true, "uuid": "fbb02676-c61e-038a-d522-b8a7def938bc", "code": "SVUH.00.108", "title": {"en": "Introduction to Audio Media (Minor Field)", "et": "Sissejuhatus audiomeediasse kõrvalerialale"}, "credits": 2, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-25T13:01:56", "alternatives": [{"uuid": "2fb05859-b791-05c8-4837-76e19b658112", "code": "SVUH.00.139", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Audio Media", "et": "Sissejuhatus audiomeediasse"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "2079d871-fdb0-dfe9-7849-9a800ed9344c", "code": "SVUH.00.225", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Audiovisual Media", "et": "Sissejuhatus audiovisuaalsesse meediasse"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "9cfc5c41-78f3-198a-68f6-4ef64f70903f", "code": "SVUH.00.101", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Audio Media", "et": "Sissejuhatus audiomeediasse"}, "credits": 4, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": true, "uuid": "8319f376-0a6e-80e9-d2a5-05cb0ab10346", "code": "SVUH.00.109", "title": {"en": "Public Audiovisual Media (minor field)", "et": "Audiovisuaalne meedia avalikus ruumis kõrvalerialale"}, "credits": 2, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "alternatives": [{"uuid": "2079d871-fdb0-dfe9-7849-9a800ed9344c", "code": "SVUH.00.225", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Audiovisual Media", "et": "Sissejuhatus audiovisuaalsesse meediasse"}, "credits": 6, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "ef2e1ded-9620-ba85-40a5-a2afb54500bd", "code": "SVUH.00.102", "state": {"code": "closed", "et": "Suletud", "en": "closed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Public Audiovisual Media", "et": "Audiovisuaalne meedia avalikus ruumis"}, "credits": 4, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, {"uuid": "3a4c2141-bd83-cedf-e012-fb2b4b584460", "code": "SVUH.00.140", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Public Audiovisual Media", "et": "Audiovisuaalne meedia avalikus ruumis"}, "credits": 3, "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}]}, {"required": false, "uuid": "45f26e3c-ce25-ae48-5bc6-6a8365d99b0e", "code": "FLEE.02.019", "title": {"en": "Estonian Language and Stylistics", "et": "Eesti keel ja stilistika"}, "credits": 6, "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36"}], "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course is divided into four parts across two sections (Practical Journalism I and II):\nThe first part focuses on news in written media, the second on news in audio media, the third on news in audiovisual media, and the fourth on digital media. Conceptually, each part corresponds to 6 ECTS credits.\n\n1. News in written media:\nStudents work one full day per week as a real newsroom, identifying newsworthy events, performing reporting tasks, and writing a completed news story by the evening of the same day.\n\n2. News in audio media:\nIntroduces the key concepts and principles of creating audio news. Through practical exercises, students acquire and reinforce skills in producing text-based news, recorded news material, and editing.\n\n3. News in audiovisual media:\nA twice-weekly course focusing on identifying newsworthy events and transforming them into audiovisual news pieces.\n\n4. News in digital media:\nModern journalism and digital media. Developments and transitions from print to digital media. Trends in digital media. Communication processes and chains in media organizations. Target audiences, trends, use of diverse sources, and coverage of different media types and events. Lessons from reporting on exceptional events and crises, and their application in everyday work.\n\n5. Use of technical tools:\nThis aspect is integrated throughout the course. It involves learning and applying production and post-production techniques and equipment to complete specific course assignments and build future professional competency.\nDescription of each cycle in detail is being provided in a particular course programme.\nThe outcomes rely on the norms and standards of Estonian Public Broadcasting.", "et": "Kursus toimub neljas osas, aga kahes jaotuses (praktiline ajakirjandus I ja II):\nesimene osa keskendub uudisele kirjutavas meediumis, teine osa uudisele audiomeediumis, kolmas uudisele audiovisuaalses meediumis ja neljas digimeedias. Mõtteliselt on iga osa 6 EAP vääriline.\n1) uudis kirjutavas meediumis: tudengid töötavad nädalas ühe täispäeva kui reaalne toimetus, otsides kajastamisväärseid sündmusi, tehes reporteritööd ning kirjutades sama päeva õhtuks valmis uudise.\n2) uudis audiomeediumis: tutvustatakse audiouudise tegemise põhimõisteid ja aluseid. Praktiliste tööde abil omandatakse ja kinnistatakse oskusi tekstuudise ja salvestatud uudismaterjali tegemiseks, samuti toimetamisoskusi.\n3) uudis audiovisuaalses meediumis: igal nädalal kahel õppepäeval toimuv kursus keskendub uudisväärtusliku sündmuse leidmisele ja selle vormistamisele audiovisuaalseks uudiseks.\n4) uudis digimeedias: kaasaegne ajakirjandus ja digimeedia. Digimeedia arengud ja üleminekud trükimeedialt digile. Trendid digimeedias. Kommunikatsiooniprotsessid ja -ahelad meediaorganisatsioonis. Sihtrühmad, trendid. Eri allikate kasutamine. erinevate meedialiikide ja sündmuste kajastamine. Erakorraliste sündmuste ja kriiside kajastuste õppetunnid ja nende ära kasutamine igapäevatöös.\n5) tehniliste vahendite kasutamine; toimub lõimituna terve kursuse jooksul. Produktsiooni ja postproduktsiooni võtete ja kasutatavate seadmete tundma- ja kasutamaõppimine konkreetsete õppeülesannete täitmiseks ning edaspidiseks rakkepädevuseks.\nErinevate osade täpsem kirjeldus on esitatud vastava osa aineprogrammis.\nErinevate osade täpsem kirjeldus on esitatud vastava osa aineprogrammis.\nTeostuslikud nõuded, terminoloogia jm on vastavuses ERRi vastavate normide ja praktikatega."}, "objectives": [{"en": "The aim of the course is to provide students with practical knowledge of reporting of news for newspapers and radio. Provides practical skills for future professional labour.", "et": "Anda tudengitele praktilised oskused reporteritööks professionaalses kirjutavas ja audiomeediumis. Kursusel õpetatakse, kuidas valmistada ette, koostada ja esitada avaldamiskõlblikku uudist."}], "learning_outcomes": [{"en": "Student who successfully finishes the course:", "et": "Kursuse edukalt läbinud tudeng:"}, {"en": "- knows how to find newsworthy material, knows how to frame it and set focus according to news values; ", "et": "- oskab leida, raamistada ja fookustada uudist;"}, {"en": "- comprehends the importance of groundwork and is skilled in working with different kind of sources;", "et": "- mõistab taustainformatsiooni kogumise olulisust ning oskab töötada erinevate allikatega;"}, {"en": "- is skilled in evaluating sources and manages different interviewing techniques;", "et": "- oskab hinnata ja valida allikaid ning mõistab kasutada erinevaid intervjueerimisvõtteid;"}, {"en": "- has the knowledge of time planning and working under deadline pressure;", "et": "- oskab planeerida aega, mõistab tähtaegade olulisust ajakirjanduses ning oskab ajasurve all töötada;"}, {"en": "- knows how to compose a news story according to hard news conventions, knows how to check the facts and edit the material linguistically.", "et": "- oskab vormistada ja klassikalise kõva uudise konventsioonidele vastavat uudist ning seda faktiliselt ja keeleliselt toimetada."}, {"en": "-is knowledgeable about the technical etc norms and standards of Estonian Public Broadcasting.", "et": "- on teadlik sisule esitatavale tehnilistele jm nõuetega vastavuses ERRi standarditega ja heade tavadega."}], "notes": {}}, "grading": {"independent_work": {"et": "Kirjalik meedium:\nIgaks õppepäevaks tuleb koostada uudisloo plaan (kuni 3p). \nJuhendi annavad õppejõud esimeses loengus. \nInfo õppepäeva kohta saadavad õppejõud kursusel osalevatele tudengitele e-kirjaga enne õppepäeva.\n\nAudiomeedium:\nIgaks seminariks (neljapäevad) tuleb tudengil täita eelülesanne (kuni 3 p). \nIgaks õppepäevaks (reeded) tuleb tudengil koostada vastava ülesande (tänavaküsitlus, reportaa, 2x uudislugu, saade, täistunniuudised) plaan ja seda hommikusel koosolekul kaitsta (kuni 3 p).\nIga õppepäeva jooksul on tudengil vaja täita ülesanne (tänavaküsitlus kuni 10p koos plaani punktidega, reportaa, uudislood ja saade kuni 20p, täistunniuudised kuni 10p koos plaani punktidega).\n1.-3. õppepäeva järgselt tuleb tudengil kuulata ja tagasisidestada kaaslaste esitatud ülesandeid (tänavaküsitlus, reportaa, uudislugu) (kokku kuni 15 (3x5) p). \n4.-5. õppepäeva (saatepäevade) järgselt tuleb tudengil kuulata nii enda kui kaaslaste saateid ja täistunniuudiseid, hinnata üksteise kaasalöömist tiimitöös, tagasisidestada kaaslaste tehtut ja reflekteerida enda õppimiskohti (kokku kuni 10 p).\nTäpsemad juhised annab õppejõud esimeses loengus. \nInfo õppepäevade ja konkreetse nädala plaanide kohta saadab õppejõud kursusel osalevatele tudengitele e-kirjaga iga ühise nädala alguses.\n\nPS! AI, tehistaibu kasutamine ei ole keelatud, ent (!) kui seda kasutatakse, paluvad õppejõud olla läbipaistav: milleks ja mis mahus AId kasutasid. See disclaimer peab olema esitatud, kui oled mingis loomefaasis AId kasutanud."}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Kirjutava meediumi osa hindamiskriteeriumid \n\nUudisloo plaan: Õppejõud hindavad kirjalike uudisloo plaanide kvaliteeti kolme punkti süsteemis ning alates teisest õppepäevast ehk kolmandast kohtumisest lahutatakse kirjaliku plaani eest kaotatud punktid lõpptöö punktisummast. Plaan peab väljendama tehtud eeltööd ja näitama, et artikkel on võimalik valmis kirjutada õppepäeva jooksul.\n\nUudislugu: Õppejõud hindavad kõiki kaheksat uudislugu eraldi, jagades nende eest punkte vahemikus 0-20 (äärmisel juhul võib punktisumma olla alla nulli). Iga töö saab uudise vorminõuete järgimise eest punkte vahemikus 0-10 (vorm) ning uudisväärtusliku idee ja reporteritöö eest samuti punkte vahemikus 0-10 (sisu). Täpsemad juhised annavad õppejõud loengutes ja seminaridel.\n\nÕppejõud võivad anda lisapunkte aktiivse osalemise ja uudisloo avaldamise eest ajakirjandusväljaandes."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Audiomeediumi osa hindamiskriteeriumid\n\nEelülesanne: Õppejõud hindab Moodle'is esitatud eelülesande (temaatilise materjali lugemine/kuulamine) täitmist kolme punkti süsteemis. Ülesande vastus peab väljendama seda, et tudeng on materjali enne ülesande sooritamist läbi töötanud ja mõistab selle sisu. Viie eelülesande eest on võimalik koguda maksimaalselt 15 punkti (5x3 p).\n\nÜlesande (tänavaküsitlus, reportaa, uudislugu, saade, täistunniuudised) plaan: Õppejõud hindab plaani kvaliteeti kolme punkti süsteemis. Plaan peab väljendama tehtud eeltööd ja näitama, et ülesanne valmib õppepäeva jooksul. NB! Plaani eest kaotatud punktid lahutatakse ülesande punktisummast. \n\nTänavaküsitlus: Õppejõud jagab tööle punkte vahemikus 0-10. Iga töö saab ülesande vorminõuete (pikkus, tehniline kvaliteet, tähtaeg) järgimise eest punkte vahemikus 0-5 (vorm) ning uudisväärtusliku idee (toimiv küsimus) ja reporteritöö (vastajate ja vastuste varieeruvus) eest samuti punkte vahemikus 0-5 (sisu).\n\nReportaa ja uudislugu: Õppejõud hindab mõlemat ülesannet eraldi, jagades punkte vahemikus 0-20. Iga töö saab ülesande vorminõuete (tehniline kvaliteet, arusaadav kõne, tähtaeg ja pikkus) järgimise eest punkte vahemikus 0-10 (vorm) ning uudisväärtusliku idee ja reporteritöö (fookus, asjakohased allikad, kuulajasõbralik tekst) eest samuti punkte vahemikus 0-10 (sisu). \n\nKaks saatepäeva: Mõlemal saatepäeval on tudengid jagatud kahte rühma. Üks rühm on uudistetoimetuse ja teine rühm vastutab saadete eest, teisel nädalal rollid vahetuvad. \n1. Töö uudistetoimetuses hõlmab ühe värske uudisloo valmistamist (vt hindamiskriteeriume eelmise punkti juures) ja lühiuudiste toimetamist ning otse-eetris ettekandmist. \nUudisloo eest jagab õppejõud punkte vahemikus 0-20 (vaata kriteeriume eelmise punkti juures!). \nLühiuudiste toimetamise ja otse-eetris ettekandmise eest jagavad külaliskuulajad punkte vahemikus 0-10. Iga töö saab ülesande vorminõuete (tehniline kvaliteet, arusaadav kõne) järgimise eest punkte vahemikus 0-5 (vorm) ning toimetamise (teemad on värsked ja asjakohased, toimetatud kuulajasõbralikuks) eest samuti punkte vahemikus 0-5 (sisu). \n2. Saated valmistavad tudengid ette ja viivad läbi paaristööna. \nSaadete eest jagavad külaliskuulajad punkte vahemikus 0-20. Iga töö saab ülesande vorminõuete (tehniline kvaliteet, arusaadav kõne, struktuur) järgimise eest punkte vahemikus 0-10 (vorm) ning saate idee ja läbi viimise eest (fookus, asjakohased allikad, kuulajasõbralik lahendus) eest samuti punkte vahemikus 0-10 (sisu). \n\nKuulamis- ja tagasisidestamisülesanded: 1.-3. õppepäeva järgselt tuleb tudengil kuulata ja tagasisidestada kaaslaste esitatud ülesandeid (tänavaküsitlus, reportaa, uudislugu). \nÕppejõud hindab esimest ülesannet ühe punkti, kahte teist kahe punkti süsteemis. Ülesande vastus peab väljendama seda, et tudeng on nõutud ajaks kaaslaste töid analüütiliselt kuulanud ja tagasisidestanud vastavalt esitatud küsimusele.\n4.-5. õppepäeva (saatepäevade) järgselt tuleb tudengil kuulata nii enda kui kaaslaste saateid ja täistunniuudiseid, hinnata üksteise kaasalöömist tiimitöös, tagasisidestada kaaslaste tehtut ja reflekteerida enda õppimiskohti.\nÕppejõud jagab ülesande eest punkte vahemikus 0-10. Iga töö saab kaaslaste tööde kuulamise ja tagasisidestamise eest 0-5 punkti ja enda töö refleksiooni eest 0-5 punkti. \nTiimitöö eest jagavad tudengd üksteisele punkte vahemikus 0-10 vastavalt sellele, kuivõrd kaaslased osalesid saatepäeva õnnestumises.\n\nKokku on audiomeediumi osa eest võimalik saada maksimaalselt 150 punkti.\n\nÕppejõud võivad anda lisapunkte aktiivse osalemise ja uudisloo avaldamise eest ERRi raadiouudistes."}}], "grade_preconditions": {"et": "Kirjalik meedium:\nHommikustel koosolekutel on kohustulik osaleda. Igaks korraks tuleb hommikuseks tähtajaks esitada uudisloo plaan, hiljem valmis uudistekst. Sellel kursusel on väga oluline pidada kinni tähtaegadest.\n\nKursusel tuleb esitada kaheksa uudist ja osaleda seminarides. Uudislugusid ega nende plaane ei saa esitada õppejõududele väljaspool õppetöö aega.\n\nAudiomeedium:\nKõigil kohtumistel on kohustuslik osaleda. Tööd tuleb esitada ettenähtud ja nõutud ajal. Tööd peavad vastama kursuse hindamisnõuetele. Täpsemad juhised saavad tudengid õppejõult enne ülesande püstitust ja selle sooritamisele siirdumist."}, "grade_evaluation": {"et": "Kirjalik meedium:\nEksam puudub. Hinne kujuneb kaheksal õppepäeval kirjutatud ja esitatud uudisloo punktisummadest. Õppejõud võivad anda lisapunkte aktiivse osalemise, hea uudise teema leidmise ja/või ajakirjandusväljaandes avaldamise eest.\n\nAudiomeedium:\nEksam puudub. Hinne kujuneb kursuse jooksul tehtud tööde tulemuste põhjal. Esitatud peavad olema kõik tööd.\n\nKuidas kujuneb terve osa hinne?\nTudeng saab eraldi osahinde kirjutava meediumi ja audiomeediumi eest. Koondhinne kujuneb nende kahe meediumi punktisumma pealt. Mõlemas punktisummast võetakse koefitsent ja seejärel kalkuleeritakse punktisumma kokku ning asetatakse skaalale (ainest läbi saamiseks on vaja vähemalt 50% punktidest!). \n\nPositiivse lõpphinde saamiseks peavad mõlemad osahinded olema positiivsed (st osahinne F ei võimalda kursust sooritada positiivsele hindele)."}, "grade_conditions": {"A": {"et": ">90%"}, "B": {"et": "80-89%"}, "C": {"et": "70-79%"}, "D": {"et": "60-69%"}, "E": {"et": "=>50-59%"}, "F": {"et": "<50"}, "mi": {"et": "kahel korral kohalkäimine."}}, "debt_elimination": {"et": "Kirjalik meedium:\nVõlgnevusi saab likvideerida kursuse jooksul kahe lisaõppepäeva ajal. Õppejõudusid tuleb puudumisest teavitada enne hommikust koosolekut. Muid võimalusi võlgnevuste likvideerimiseks sama semestri jooksul ei ole.\n\nAudiomeedium:\nVõlgnevusi on võimalik likveerida kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "dc0b0626-9f47-4ae9-a6bd-0d4507de0851", "type": "MOODLE", "code": "SVUH.00.110", "base_url": "undefined", "is_auto_update": false, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Kirjalik meedium:\nKeeble, R. (1998). The Newspapers Handbook. Psychology Press.\nKovach, B., & Rosenstiel, T. (2014). The elements of journalism: What newspeople should know and the public should expect (Revised and updated third edition). Three Rivers Press.\nShaw, D. L., McCombs, M. E., Keir, G., & Keir, G. (1997). Advanced reporting: Discovering patterns in news events (2nd ed). Waveland Press.\n\nAudiomeedium:\nRaadiouudiste kuulamine!\nKrulwich, R. Consider Your Ears. https://www.wnycstudios.org/podcasts/radiolab/consider-your-ears\nWen, T. Inside the Podcast Brain: Why Do Audio Stories Captivate? https://www.theatlantic.com/entertainment/archive/2015/04/podcast-brain-why-do-audio-stories-captivate/389925/\nFarmann, E. & Kramhoft, P. (1997) Raadioajakirjandus\nMacAdam, A. The journey from print to radio storytelling: A guide for navigating a new landscape https://training.npr.org/2017/12/06/the-journey-from-print-to-radio-storytelling-a-guide-for-navigating-a-new-landscape/\nMacAdam, A. Beyond the 5 W's: What should you ask before starting a story https://training.npr.org/2016/12/13/beyond-the-5ws-what-should-you-ask-before-starting-a-story/", "recommended_materials": "Loit, U. Raadiouudis : seminar \"Raadiouudise võrdlev analüüs\" 24. septembril 1997 Eesti Meediakeskuses\nLoit, U. Raadiouudis. seminar \"Raadiouudise võrdlev analüüs\" 15. aprillil 1999\nThe Power of Digital Audio Storytelling: From Podcasts to Voice Assistants - tasuta veebikursus, mille autor/juht on Tamar Charney - https://journalismcourses.org/course/the-power-of-digital-audio-storytelling-from-podcasts-to-voice-assistants_self/\nSikk, R. (2008) Kümme juhtumit, mis vapustasid reporterit, ehk, Kuidas kirjutada head reportaai\nNPR Training materjalid: https://training.npr.org/author/ali/"}, "participants": {"lecturers": [{"person_uuid": "2931cbbe-86e1-fa13-feda-c82700ecb43a", "person_name": "Priit Pullerits", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "676ef79e-1a57-7f6a-3143-53589a87e87b", "person_name": "Alar Suija", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "bee68cbd-0a15-f648-04b1-cc14b4ab9b08", "person_name": "Marii Kangur", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "a03e98f4-52d5-d530-daf7-72f85d4df12c", "person_name": "Signe Ivask", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "1-12,14-16, 18-20"}, "entries": [{"course_week": 1, "time": "2024-09-06", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {"et": "I osa: kuidas toimib meie toimetus?"}, "description": {"et": "Esimesel kohtumisel saavad tudengid ühiselt kätt proovida uudise leidmisel, vormistamisel, pealkirjastamisel ja kaitsmisel. \nSelgitamisele tuleb, mis ainega on tegu, miks on ta niivõrd legendaarne ja miks on ta oma ülesehituselt just selline, nagu ta on. \nJuttu tuleb kursuse nõuetest (sh uudiseplaan) ja hinde kujunemisest."}}, {"course_week": 2, "time": "2024-09-13", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {"et": "II osa: esimese uudise loome "}, "description": {"et": "Iga kursuse nädala alguses saabub tudengile e-kiri selle kohta, mis teemal tuleb sel nädalal teemat otsima asuda. Kirjades täpsustame omakorda sedagi, kas piirkond on Tartu ja Tartumaa või terve Eesti või suisa - miks ka mitte - terve maailm."}}, {"course_week": 3, "time": "2024-09-20", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {"et": "II osa: teise uudise loome"}, "description": {}}, {"course_week": 4, "time": "2024-09-27", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {"et": "II osa: kolmanda uudise loome"}, "description": {}}, {"course_week": 5, "time": "2024-10-04", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 5, "topic": {"et": "II osa: neljanda uudise loome"}, "description": {}}, {"course_week": 6, "time": "2024-10-11", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 6, "topic": {"et": "II osa: viienda uudise loome"}, "description": {}}, {"course_week": 7, "time": "2024-10-18", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 7, "topic": {"et": "II osa: kuuenda uudise loome"}, "description": {}}, {"course_week": 8, "time": "2024-10-25", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 8, "topic": {"et": "II osa: seitsmenda uudise loome"}, "description": {}}, {"course_week": 9, "time": "2024-11-01", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 9, "topic": {"et": "II osa: kaheksanda uudise loome"}, "description": {}}, {"course_week": 10, "time": "2024-11-08", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 10, "topic": {"et": "III osa: kokkuvõte, järeletegemise võimalus 1"}, "description": {}}, {"course_week": 11, "time": "2024-11-15", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 11, "topic": {"et": "III osa: järeletegemise võimalus 2"}, "description": {}}, {"course_week": 12, "time": "2024-11-21", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 1, "topic": {"et": "Audiomeediumi eripäradega tutvumine. 14:15-16:45"}, "description": {}}, {"course_week": 12, "time": "2024-11-22", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 1, "topic": {"et": "I õppepäev: Salvestusmaki ja montaaiprogrammiga tutvumine.\nTänavaküsitlus. \nSissejuhatus reportaaidesse. 9:15-18"}, "description": {}}, {"course_week": 13, "time": "2024-11-28", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {"et": "Mis teeb reportaaist reportaai? 14:15-16:45"}, "description": {}}, {"course_week": 13, "time": "2024-11-29", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 2, "topic": {"et": "II õppepäev: reportaa. 9:15-18"}, "description": {}}, {"course_week": 14, "time": "2024-12-05", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {"et": "Uudised raadios - eetriteksti spetsiifikast. 14:15-16:45"}, "description": {}}, {"course_week": 14, "time": "2024-12-06", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 3, "topic": {"et": "III õppepäev: raadio uudislugu. 9:15-18"}, "description": {}}, {"course_week": 15, "time": "2024-12-12", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {"et": "Stuudiotehnikaga tutvumine. Mis on oluline saadet juhtides ja muusikavalikul? 14:15-16:45"}, "description": {}}, {"course_week": 15, "time": "2024-12-13", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 4, "topic": {"et": "IV õppepäev: I saatepäev 9:15-18"}, "description": {}}, {"course_week": 16, "time": "2024-12-19", "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {"et": "Stuudiotehnikaga tutvumine, esimese saatepäeva õppetunnid. 14:15-16:45"}, "description": {}}, {"course_week": 16, "time": "2024-12-20", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic_number": 5, "topic": {"et": "V õppepäev: II saatepäev 9:15-18"}, "description": {}}]}, "registration_info": {"audience": {"et": "Ajakirjanduse ja kommunikatsiooni bakalaureuseõppe 2. aasta üliõpilased; kõrvaleriala ajakirjandus ja kommunikatsioon"}, "min_students": 12, "max_students": 28}, "parent_uuid": "8d1e0a26-c93e-82a7-a524-6e7bb6812f59", "parent_code": "SVUH.00.110", "parent_credits": 12, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}