{"uuid": "7aaf80c8-0ae5-2f19-86c7-9f7d35f149f5", "code": "SVUH.00.059", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Data Literacy", "et": "Andmepädevus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The main questions that will be handled throughout the course are what kind of data are fit for which research goals and strategies, where data come from and where data quality goes, and how we can assess data quality and thereby create preconditions for a well-grounded data analysis and credible results.", "et": "Kursuse läbivad sõlmküsimused on millised andmed sobivad milliste uurimiseesmärkide ja -strateegiate jaoks, kust tulevad andmed ja kuhu kaob andmekvaliteet ning kuidas andmete kvaliteeti ja eripärasid kontrollida ja sellest lähtuvalt luua eeldused andmete adekvaatseks analüüsiks."}, "objectives": [{"en": "The goal of the course is to give the participant ", "et": "Ainekursuse eesmärk on anda osalejale "}, {"en": "(1) an overview of different types of data, data collection methods and data sources (with an emphasis on survey data), ", "et": "(1) ülevaade erinevat liiki andmetest, andmekogumismeetoditest ja andmeallikatest, keskendudes eelkõige küsitlusuuringutega kogutavatele andmetele, "}, {"en": "(2) knowledge necessary to plan an adequate research strategy based on the research task and data at hand / data to be collected, and ", "et": "(2) teadmisi uurimisstrateegia adekvaatseks kavandamiseks uurimisülesandest ja kogutavate/kasutatavate andmete iseloomust lähtudes ja "}, {"en": "(3) practical skills and knowledge to prepare an empirical dataset for statistical analysis (to control, edit, transform data and to evaluate data quality).", "et": "(3) praktilisi oskusi ja teadmisi empiirilise andmestiku statistiliseks analüüsiks ettevalmistamiseks (kontrollimiseks ja toimetamiseks, andmeteisendusteks, andmete kvaliteedi hindamiseks)."}], "learning_outcomes": [{"en": "The student", "et": "Kursuse läbinud üliõpilane"}, {"en": "- is familiar with various types of data and differences between them,", "et": "- teab erinevaid andmeliike ja orienteerub nende erinevustes, "}, {"en": "- has an overview of the possibilities and methods of quantitative data collection,", "et": "- omab ülevaadet kvantitatiivsete andmete kogumise võimalustest ja meetoditest,"}, {"en": "- can assess what kind of questions data allow to answer,", "et": "- oskab hinnata, millistele küsimustele võimaldavad andmed vastata,"}, {"en": "- can assess data quality based on key indicators of data quality (e.g. margin of error, presence and scope of missing data and outliers, etc),", "et": "- oskab hinnata andmete kvaliteeti põhiliste andmekvaliteedi näitajate alusel (nt veapiir, andmelünkade, erindite esinemine ja ulatus),"}, {"en": "- can prepare survey data for analysis and carry out basic exploratory analysis,", "et": "- oskab küsitlusandmestikku analüüsiks ette valmistada ja viia läbi esmast avastuslikku analüüsi,"}, {"en": "- has acquainted oneself with the central questions of data protection and ethics.", "et": "- on tutvunud põhiliste andmekaitse ja -eetika küsimustega."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}