{"uuid": "501fe4b2-bfb5-0456-c6c5-0aebf73f445e", "code": "SVUH.00.160", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-05-21T14:50:18", "title": {"en": "Master's Exam", "et": "Magistrieksam"}, "credits": 15, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 3, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The master's exam consists of three parts: \nthe first part (5 ECTS) in the first Semester, the second part (5 ECTS) in the second Semester, and the third part (5 ECTS) in the third Semester. \nEvery part is designed as a sub-exam. The sub-exams include written assessments and developmental seminars to support professional self-analysis and to integrate the study process with the professional experiences of a student. \nThe focal points of sub-exams are: \nPart 1: Goal-setting for your studies and your professional development: learning skills for university studies and mastering the methods of reflection, case analysis and devlopment partnership; self-analysis using the CliftonStrengths method.\nPart 2: Management communication and application of what has been learnt to in-depth analysis and resolution of different case studies.\nPart 3: Practical change project; practical application of what has been learnt in the workplace to bring about a change that improves leadership and/or communication.", "et": "Magistrieksam koosneb osaeksamitest: \n1. osa (5 EAP) 1.semestril; \n2. osa (5 EAP) 2. semestril;\n3. osa (5 EAP) 3. semestril. \nOsaeksamid sisaldavad probleemi- ja kogemusanalüüsi seminare ja kirjalikke ülesandeid. Osaeksamite kaudu mõtestatakse, sünteesitakse ja lõimitakse õppekava teistes ainetes omandatavaid pädevusi ning seostatakse õppija töökogemusega. \n\nOsaeksamite fookused: \n1. osa: Õpingute ja oma professionaalse arengu eesmärgistamine: õpioskused ülikoolis ning refleksiooni, juhtumianalüüsi ja arengupartnerluse meetodite omandamine; eneseanalüütiline töö CliftonStrengths meetodil.\n2. osa: Juhtimiskommunikatsioon ning õpitu rakendamine erinevate juhtumite süvaanalüüsiks ja lahendamiseks.\n3. osa: Praktiline muutuse projekt; õpitu praktiline rakendamine oma töökohal, viimaks läbi mingi juhtimist ja/või kommunikatsiooni parandava muutuse."}, "objectives": [{"en": "The objective of the master's exam is to offer the students the possibility to demonstrate their acquired study outcomes of the curriculum.", "et": "Magistrieksami käigus tõendab üliõpilane oma erialase ettevalmistuse küpsust ning oskust omandatud teadmisi rakendada."}], "learning_outcomes": [{"en": "The study outcomes are: The ability to use acquired competences on an analytically high level, to professionally reflect his/her activities, to demonstrate the preparedness for practicing, and to implement the principles of ethical communication in his/her professional work.", "et": "Õppeaine läbinud üliõpilane rakendab erialaseid pädevusi analüütiliselt kõrgel tasemel, reflekteerib professionaalselt oma tegevust, tõendab oma ettevalmistust praktiseerimiseks ning rakendab eetilise kommunikatsiooni põhimõtteid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}