{"uuid": "d5f74a6e-0d9b-2373-4f67-39445968a3f3", "code": "SVUH.00.073", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-10T15:38:40", "title": {"en": "Records and Office Management", "et": "Teabehalduse korraldus"}, "credits": 9, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "Understanding of theory and practice of document and records management in cretion and implementation of systems. Methods and techniques on functions and processes analysis, creation of process schemes. Compiling principle instruments necessary for creating, implementing and use of records management system i.e classification scheme. Functional requirements of document / records management system is covered. Use of metadata in the systems. Project management in development and implementation of document and records management system.", "et": "Tutvutakse dokumendihalduse teoreetiliste probleemide ja praktiliste lahendustega asutuse või organisatsiooni dokumendi- ja dokumendihaldussüsteemi loomisel. Käsitletakse funktsioonide ja protsesside analüüsi meetodeid ning tehnikaid, koostatakse protsessiskeeme. Analüüsitakse dokumendihaldussüsteemide funktsionaalsusnõudeid. Käsitletakse metaandmete kasutamise temaatikat dokumentidel ning dokumendihaldussüsteemis. Käsitletakse dokumendihaldustarkvara kasutuselevõtuga seotud projektijuhtimist."}, "objectives": [{"en": "To give in-depth knowledge on the document and records management. To get practical skills for creation of basic documents for record system and development and implementation of records management system.", "et": "Kujundada süvendatud teadmised dokumendihalduse korraldamisest organisatsioonis. Omandada praktilised kogemused organisatsiooni dokumendihalduse alusdokumentide ja dokumendisüsteemi loomiseks ning dokumendihaldussüsteemi kasutamiseks."}], "learning_outcomes": [{"en": "Upon the completion of the course the student:", "et": "Õppeaine läbinud üliõpilane:"}, {"en": "1) can create organization's records system;", "et": "1) töötab välja organisatsiooni dokumendisüsteemi;"}, {"en": "2) knows how to integrate records management system with other organization's information systems;", "et": "2) oskab dokumendisüsteemi seostada asutuse või organisatsiooni teiste infosüsteemidega;"}, {"en": "3) analysis organization's functions and activities (processes) from the documentation point of view; can choose propriate analysis methods;", "et": "3) analüüsib asutuse tegevust ja toiminguid dokumenteerimise seisukohast, tunneb vastavaid analüüsimeetodeid ja oskab neid valida;"}, {"en": "4) compile principal instruments form records management i.e. business classification scheme;", "et": "4) oskab koostada dokumendihalduse alusdokumente, seahulgas dokumentide liigitusskeemi;"}, {"en": "5) knows how to integrate records management processes with organization's core and supporting proccesses;", "et": "5) oskab dokumendihaldusprotsesse siduda asutuse või organisatsiooni tugi- ja põhitegevusprotsessidega;"}, {"en": "6) knows functionalities of the document and records management systems and their implementation;", "et": "6) tunneb elektroonilise dokumendihaldussüsteemi funktsionaalsusi ja nende rakendamist dokumendihalduse korraldamisel;"}, {"en": "7) can choose metadata.", "et": "7) oskab valida metaandmeid."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}