{"uuid": "972d1f47-1114-6827-a785-458cb33a24db", "code": "SVUH.00.196", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Community Development", "et": "Kogukonna arendamise alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course provides an overview of theoretical approaches in community work and community development as well as contemporary practices in community development. The course addresses the concept of community (including online communities), its' characteristics and different structures, and teaches practical methods for developing balanced community cooperation. The processes that have influenced community formation will be placed in the context of the coeffects of the economic, cultural, social and natural environment and this knowledge will be used to identify and implement potential development opportunities. As a practical exercise, promising examples of community work and community development in Estonia and abroad will be analyzed, in order to understand the specific factors of the vulnerability and social resilience in different communities, and to learn to differentiate between success factors as well as apply context-specific development in other communities. All this is placed in the socio-cultural context of Estonia and associated with traditional knowledge.", "et": "Kursus annab ülevaate teoreetilistest lähenemistest kogukonnatöös ja kogukonna arendamises ning kogukonna arendamise nüüdisaegsest praktikast. Kursusel käsitletakse kogukonna mõistet (sh ka online kogukondi), tunnuseid ja erinevaid struktuure, õpetatakse praktilisi meetodeid kogukonna tasakaalustatud koostöö arendamiseks. Kogukondade kujunemiste mõjutanud protsessid asetatakse majandusliku, kultuurilise, sotsiaalse ja looduskeskkona koosmõjust tulenevasse konteksti ning kasutatakse neid teadmisi potentsiaalsete arendamisvõimaluste leidmiseks ja elluviimiseks. Praktilise ülesandena analüüsitakse lootustandvaid kogukonnatöö ja kogukonna arendamise näiteid Eestis ja välismaal, sh erinevate kogukondade spetsiifilist haavatavust ja sotsiaalset säilenõtkust kujundavate tegurite mõistmist, õpitakse eristama edutegureid ning kontekstispetsiifiliselt edasiarendavalt rakendama teistes kogukondades. Kõik see asetatakse Eesti konteksti spetsiifilistele sotsio-kultuurilisse raamistikku ja seostatakse pärimusteadmusega."}, "objectives": [{"en": "The aim of this course is to provide knowledge of contemporary theories and methods of community service and development; of the processes that have influenced the formation of communities in Estonia, as well as the skills to use this knowledge to develop social resilience within communities.", "et": "Kursuse eesmärk on anda teadmised nüüdisaegsetest kogukonnatöö ja kogukonna arendamise teooriatest ja meetoditest, kogukondade kujunemist mõjutanud protsessidest Eestis ning oskused kasutada neid teadmisi kogukondade sotsiaalse säilenõtkuse kujundamiseks."}], "learning_outcomes": [{"en": "After completing the course the student will:", "et": "Aine läbinud üliõpilane:"}, {"en": "- know the theoretical approaches to community development and contemporary implementation schemes;", "et": "- tunneb kogukonna arendamise teoreetilisi käsitlusi ja nüüdisaegseid rakendamise põhimõtteid;"}, {"en": "- shape and balance processes for the fairer and more sustainable functioning of the community as a whole;", "et": "- kujundab ja tasakaalustab protsesse kogukonna õiglasemaks ja kestlikuks toimimiseks;"}, {"en": "- analyze various contemporary successful community work and community development practices, recognize and utilize success factors and implement them in an advancing context-specific way;", "et": "- analüüsib erinevaid kaasaegseid edukaid kogukonnatöö ja kogukonna arendamise praktikaid, oskab edutegurid ära tunda ja neid edasiarendavalt kontekstispetsiifiliselt rakendada;"}, {"en": "- recognize and understand the manifestations and limitations of vulnerability, segregation and polarization within the community and develop processes for resilient development;", "et": "- märkab ja mõistab haavatavuse, segregatsiooni ja polariseerumise ilminguid ja piiranguid kogukonnas ning kujundab säilenõtkuse arendamise protsesse;"}, {"en": "- apply sustainability principles to the development of the community.", "et": "- rakendab kestlikkuse põhimõtteid kogukonna arendamisel."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}