{"uuid": "82610c70-4ed1-f3cc-663a-8b73ee536ea6", "code": "SVUH.00.204", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Basics of Quantitative Methods", "et": "Kvantitatiivsete meetodite aluskursus"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "inglise keeles\tThe course is designed for master level students who lack systematic knowledge of the basics of quantitative data analysis or the relevant practical skills or who wish to brush up on or systematise such knowledge or skills. The course also gives introductory knowledge and skills for using R, however, the main focus of the course is on learning the analysis methods (for a more thorough handling of R, see SVUH.00.149 Statistical Software R for the Social Sciences).", "et": "Kursus on mõeldud neile, kel puuduvad varasemad süstemaatilised teadmised kvantitatiivse andmeanalüüsi põhialustest või andmeanalüüsioskused või soovivad neid teadmisi ja oskusi meelde tuletada või süstematiseerida. Kursus annab ka sissejuhatavad teadmised ja oskused analüüsiprogrammi R kasutamiseks, kuid põhirõhk on antud kursuses analüüsimeetodite õppimisel (R-i põhjalikumaks õppimiseks on aine SVUH.00.149 Statistikatarkvara R rakendus sotsiaalteadustes). Seega, kes õpib õppekaval Ühiskonna ja infoprotsesside analüüs ning ei oma varasemat kokkupuudet kvantitatiivsete meetodite ega R-ga, võiksid võtta nii käesolevat ainet kui SVUH.00.149; kes on õppinud kvantitatiivseid meetodeid käesoleva kursuse teemade raames, aga puudub kokkupuude R-ga, neil oleks vaja pigem võtta ainet SVUH.00.149."}, "objectives": [{"en": "The objective of the course is to give an overview of main quantitative data analysis methods at the beginner's level that can be applied to measure and understand various processes in the society and organizations.", "et": "Kursuse eesmärk on anda ülevaade põhilistest kvantitatiivsetest andmeanalüüsimeetoditest, mida saab rakendada ühiskonnas ja organisatsioonis toimuvate protsesside mõõtmiseks ja kaardistamiseks."}], "learning_outcomes": [{"en": "After passing the course the student:", "et": "Kursuse läbinud tudeng:"}, {"en": "- knows the beginner's level analysis methods for quantitative data, and is able to apply them to solve practical exercises;", "et": "- tunneb algtaseme kvantitatiivseid andmeanalüüsimeetodeid, oskab neid rakendada praktiliste ülesannete lahendamiseks;"}, {"en": "- knows the basics of inferential data analysis and is able to put them into practice and interpret the results adequately;", "et": "- tunneb järeldava andmeanalüüsi põhialuseid ja oskab neid analüüsis rakendada, sh analüüsitulemusi adekvaatselt tõlgendada;"}, {"en": "- is familiar with the principles of R and can use R for solving simpler tasks.", "et": "- on tuttav analüüsiprogrammi R tööpõhimõtetega ja oskab R-i kasutada lihtsamate ülesannete lahendamiseks."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}