{"uuid": "667b1da6-0cc8-8d73-8e8f-8b3330fbde22", "code": "SVUH.00.120", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Advanced Professional Skills", "et": "Erialaoskuste jätkukursus"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "practice", "et": "Praktika", "en": "Working practice"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The aim of this course is to further develop the professional skills and knowledge needed on the field of journalism and communication. Intensive training takes place in cooperation with various organisations (journalism, media and communication) where students will carry out different tasks, as in \"real\" work life. The students will have support for individual professional growth that is founded on the skills and knowledge acquired from the courses Practical Joournalism I and II/ Practical communication work I and II. Students should be prepared to work outside the usual university learning environment.", "et": "Kursuse eesmärgiks on ajakirjanduse ja kommunikatsiooni erialaoskuste ja -teadmiste intensiivne edasi arendamine, mis toimub tihedas koostöös erialaorganisatsioonidega. Kursuse käigus sooritavad tudengid erinevates ajakirjanduse, meedia ja kommunikatsiooniga tegelevates organisatsioonides individuaalsele arengule keskendudes tööülesandeid, milles rakendatakse ja arendatakse edasi praktiliste erialaainete (Praktiline ajakirjandus I ja II, Praktiline kommunikatsioonitöö I ja II) raames omandatud oskuseid ja teadmisi. Tudeng peab kursusel osaledes olema valmis töötama väljaspool harjumuspärast õppekeskkonda."}, "objectives": [{"en": "The aim of this course is to further develop the professional skills and knowledge needed on the field of journalism and communication. Intensive training takes place in cooperation with various organisations (journalism, media and communication) where students will carry out different tasks, as in \"real\" work life. The students will have support for individual professional growth that is founded on the skills and knowledge acquired from the courses Practical Journalism I and II/ Practical communication work I and II. Students should be prepared to work outside the usual university learning environment.", "et": "Kursuse eesmärgiks on ajakirjanduse ja kommunikatsiooni erialaoskuste ja -teadmiste intensiivne edasi arendamine, mis toimub tihedas koostöös erialaorganisatsioonidega. Kursuse käigus sooritavad tudengid erinevates ajakirjanduse, meedia ja kommunikatsiooniga tegelevates organisatsioonides individuaalsele arengule keskendudes tööülesandeid, milles rakendatakse ja arendatakse edasi praktiliste erialaainete (Praktiline ajakirjandus I ja II, Praktiline kommunikatsioonitöö I ja II) raames omandatud oskuseid ja teadmisi. Tudeng peab kursusel osaledes olema valmis töötama väljaspool harjumuspärast õppekeskkonda, eelnevatel aastatel on tudengid loonud podcaste, kirjutanud popteaduslikke artikleid, õpetanud põhikoolis, korraldanud meediapädevuste nädala üritusi, teinud mentoritega koos tööd EPLis ja Pärnu Loovlinnakus, ning vedanud käima projekti Solaride."}], "learning_outcomes": [{"en": "The student will:", "et": "Tudeng:"}, {"en": "- develops individual professional skills and knowledge", "et": "- arendab iseseisvalt edasi erialaseid teadmiseid ja oskusi"}, {"en": "- uses these skills and knowledge in practical work situations", "et": "- rakendab erialaseid teadmisi ja oskusi praktilises töös"}, {"en": "- analyses their own practices, strenghts and weaknesses", "et": "- analüüsib iseenda tegevust, tugevusi ja nõrkusi"}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}