{"uuid": "2079d871-fdb0-dfe9-7849-9a800ed9344c", "code": "SVUH.00.225", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Introduction to Audiovisual Media", "et": "Sissejuhatus audiovisuaalsesse meediasse"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course focuses on modern developments in auditory media. Following issues will be discussed: Characteristics of auditory mass media and divergence from other types of media; Social role, notation, and codes of radio; Functions of radio programmes, coverage types, ownership issues, public commitments; Programme types, formats, journalistic genres; Inter alia, the modern digital forms of audio media shall be discussed. In the audiovisual part of the course following issues will be discussed: Concepts of global village and cultural imperialism, television as a complex of private interests or a medium that promotes democracy; Crisis of public television in Europe and attempts made to determine a new role of public broadcasting in the audiovisual environment of 21st century; Television programme as an indicator of channel identity. Theory of programming (the concept of the pressure of audience on the television industry); Current trends in television genres and formats (news, documentary, talkshow, gameshow, television drama, soap); Contemporary trends in audio-visual media. The latest changes in the technology and content of television.", "et": "Kursuse audiotekstidele keskenduval osal saab õppija ülevaate raadio kujunemisloost ning raadio rollist ühiskonnas; analüüsime erinevaid auditiivsete tekstide žanre, vorme ja formaate ning proovime neid koos ajakirjanike ja meediajuhtidega mõtestada. Kursuse praktilisemas osas saavad tudengid muu hulgas proovida tekstide toimetamist audiotekstideks ja nende salvestamist. Kursus käsitleb nüüdseid suundumusi audiovisuaalses meedias. Käsitlust leiab ringhääling kui majanduslikke erahuvisid teeniv ettevõtlusharu ja kui demokraatiat soodustav tegur, analüüsitakse kriise ja katseid määratleda avalikõigusliku ringhäälingu rolli nüüdses audiovisuaalses keskkonnas. Teleprogrammi vaadeldakse kui kanali identiteedi kandjat ning tutvustatakse programmi koostamise põhimõtted, analüüsitakse auditooriumi mõju teletööstusele, tehnoloogilisi muutusi televisioonis, digitaalset ja interaktiivset televisiooni.Kursus käsitleb televisiooni arengut võrdlevalt USA, Suurbritannia ja Eesti näitel, käsitleb televisiooni žanrilisest aspektist ning televisiooni esteetikat võrdluses teiste meediumidega (film, raadio, teater). Kursus tutvustab mõisteid žanr ja formaat ning annab ülevaate televisiooni põhižanridest (uudis, reportaaž, teledokumentaal, vestlus, teledraama)."}, "objectives": [{"en": "The course provides an overview of radio as the major auditory medium and television and film as the major audiovisual media, describing their dynamics and role in the general media landscape, aiming to enable the student to cognizance and utilize the potentiality and means of expression of audiovisual genres in public communication.", "et": "Kursuse eesmärk on anda alusteadmised sisu loomiseks helipõhisele ja audiovisuaalsele meediale. Kursus annab alusteadmised raadioga seonduvatel teemadel makro-, meso- ja mikrotasemel. Kursus annab ülevaate filmi ja televisiooni kui kesksete audiovisuaalsete meediumide arengust ning rollist üldisel meediaväljal, eesmärgiga teada ja osata kasutada audiovisuaalsete meedialiikide võimalusi ja väljendusvahendeid avalikus kommunikatsioonis."}], "learning_outcomes": [{"en": "The students can use relevant theoretical interpretations in media analyses; they will be able to realize the potentiality of audio media in public communication; they will be able to analyse the changes in the audiovisual media, developments in radio and television journalism and to understand the connections of these changes with societal developments. Precursory course for Practical Journalism (SVUH.00.110; SVUH.00.111).", "et": "Kursuse läbinud tudeng:\n* omab ülevaadet helipõhise ja audiovisuaalse meedia eripäradest ja võimalustest;\n* oskab märgata audiovisuaalse meedia makro-, meso ja mikrotasandi olulisi nüansse;\n* oskab kriitiliselt analüüsida helilise ja audiovisuaalse meedia sisu;\n* mõistab, kuidas kasutada kursusel omandatud teadmisi, et luua sisu helipõhisele ja audiovisuaalsele meediale;\n* on teadlik oma tugevustest ja nõrkustest eetritekstide loomisel;\n* tunneb audiovisuaalse meedia võimalusi avalikus kommunikatsioonis, teleajakirjanduse arenguetappe ja põhivorme ning nende seoseid ühiskonna arenguga. \nEeldusaine praktilise ajakirjanduse kursusele (SVUH.00.110 Praktiline ajakirjandus I; SVUH.00.111 Praktiline ajakirjandus II)."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}