{"uuid": "341fde23-8539-c2f9-c2ea-d83dd47d100e", "code": "sv-2025-autumn-openuniv-en", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2025-03-05T17:01:33", "title": {"en": "Contemporary Media Society and New Publics", "et": "Tänane meediaühiskond ja uued avalikkused"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "openuniv", "et": "sessioonõpe", "en": "block mode study"}, "language": {"code": "en", "et": "inglise keel", "en": "English"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "25/26 A block mode SV Eng", "et": "25/26 S SÕ SV Eng"}}, "general": {"year": {"code": "2025", "et": "2025/2026", "en": "2025/2026"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}, {"code": "en", "et": "inglise keel", "en": "English"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 14, "practice": 0, "seminar": 18, "independent_work": 124, "individual_work": 0, "internship": 0}, "is_enlight_course": true}, "overview": {"study_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "Topics covered by the course:\n- Mapping of the  processes characteristic to the current media society (mediatization, platformization, datafication);\n- Theories of public sphere;\n- Different types of online publics, fragmentation of publics,\n- Datafication and dataveillance, dataism\n- AI: risks and opportunities ", "et": "Käsitletavad teemad: \n- Tänapäevase meediaühiskonna kaardistus (mediatiseerumine, platvormiseerumine, andmestumine); \n- Avaliku sfääri ja avalikkuse teooriad;\n- Erinevad online avalikkuste tüübid, avalikkuste fragmenteerumine;\n- Andmestumine, andmejälgimine, andmeusk\n- AI võimalused ja ohud"}, "objectives": [{"en": "The aim of this course is to discuss the processes characteristic to the current society saturated by media and technology (mediatisation, digitalisation, rise of networks and globalisation) and the accompanying rise of new publics. Additionally, the concept of public sphere and its change in the context of the development of technology will be discussed, focusing on the phenomena specific to the networked and fragmented publics, like online-activism, change of perceived privacy norms, etc", "et": "Kursuse eesmärgiks on arutleda tänapäevast meediast ja tehnoloogiast küllastunud ühiskonda iseloomustavate protsesside - mediatiseerumine, digitaliseerimine, võrgustumine, globaliseerumine -  ja nendega kaasnevate uute avalikkuste tekke üle. Kursus käsitleb avalikkuse mõistet ja selle muutumist tehnoloogia arengu käigus. Kursuse käigus analüüsitakse võrgustunud ning killustunud avalikkustes alguse saanud nähtusi, nagu online-aktivism, tajutavate privaatsusnormide muutumine jne."}], "learning_outcomes": [{"en": "The student who has passed this course will:", "et": "Kursuse läbinud üliõpilane suudab: "}, {"en": "1) be familiar with the concepts and theories characterising the current media society;", "et": "1) orienteeruda tänapäevast meediaühiskonda iseloomustavates mõistetes; "}, {"en": "2) able to recognise the and theoretically conceptualise one's own action in communicative situations;", "et": "2) oma kommunikatsioonitegevuses ära tunda ja teoreetiliselt mõtestada oma igapäevaseid kommunikatsioonisituatsioone; "}, {"en": "3) be able to compare different theoretical approaches to public sphere and publics and to point out their differences;", "et": "3) võrrelda erinevaid teoreetilisi avaliku sfääri ja avalikkuste käsitlusi ning osundada nende omavahelistele erinevustele; "}, {"en": "4) be able to criticise/review different networked publics in contemporary society;", "et": "4) arvustada erinevaid kaasaegses ühiskonnas tekkinud võrgustunud avalikkusi; "}, {"en": "5) be able to evaluate the statements about privacy and public spheres proposed in public;", "et": "5) hinnata avalikus diskursuses esitatud väiteid privaatsuse ja avalike sfääride teemadel; "}, {"en": "6) be able to analyse the relationships between privacy, digital technologies and public spheres.", "et": "6) analüüsida privaatsuse, digitaalsete tehnoloogiate ning avalikkuste omavahelisi suhteid."}], "notes": {}}, "grading": {"independent_work": {"et": "REFLECTION PAPERS for each class (6x5 points) Length: around 1,5 page. Should contain: 3 main ideas from the texts (what  did you find most relevant); 3 questions based on the readings; 2 practical examples from your own life/Estonia/the world that you can associate with the texts. To be submitted by Thursday (before class) by 10 AM. Max 5 points for each reflection. Chat GPT or similar AI tools are not allowed!\n\nINDIVIDUAL ASSIGNMENT: An analytical essay will need to bring and bind together a presently used theoretical concept with your own future imaginaries/visions of how the specific phenomenon (related to the concept) have developed by the year 2035. Length 1500-2000 words. More detailed description of the assignment in Moodle. To be submitted 2. December. Max 25 points for the assignment. Chat GPT or similar AI tools cannot be used!\n\nGROUP ASSIGNMENT: analysis of some new digital phenomenon (written analysis and oral presentation, groups of 3-4 people). Max 20 pages. Deadline: 13. January 2025 for the written work, and 18. January 2025 oral in-class presentations. Empirical mapping and an analysis of one phenomenon that is connected to the present day technological developments (some platform/app/user group/). See Moodle for more instructions. Max points: 30 for the assignment. \n\nIn-class assignments: made in class each time: 8x2p. In-class assignments cannot be completed any other way ie. you cannot gain those points if you miss the class."}, "independent_work_assessments": [{"work_type": {"code": "colloquium", "et": "Kollokvium", "en": "colloquium"}, "description": {"et": "Active in-class participation 8x2p (points will be awarded upon your written contribution to the Moodle forum each class). If you are unable to attend the class, you are also unable to gain these 2 points in any other way. "}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "All together 6 reaction papers will be compiled (one for each class) based on compulsory readings. Two academic peer reviewed journal articles (provided in Moodle) need to be read through for each class. Based on these readings a reaction paper (around 1 page) is compiled. The reaction paper should include three most important/interesting/new ideas you gained from the texts and three questions questions that emerged from reading the articles; and 2 practical examples from real life connected to the texts.  6x5p\n\nTo be submitted on each Thursday before the class by 10 AM."}}, {"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Group assignment: new digital phenomenon (written analysis and oral presentation, groups of 3-4 people). Max 20 pages. \nDeadline:  written analysis by 13.01.2025, oral presentations on 18.01.2025.  \nAll together: 30 points\nEmpirical mapping and an analysis of one new digital/technological phenomenon (platform/app/user group, etc.). \nThe analysis should consist of a brief theoretical framework + an empirical field work mapping the phenomenon/environment/user types/content, etc.\nSo, basically, you conduct a small empirical study, follow the typical structure of academic texts (introduction, theory, method, results, discussion and conclusions):\n*\tIntroduction: why is it attention-worthy, what is your aim, how have you structured your paper, etc.\n*\tTheory: how do you theoretically and empirically frame your study (previous studies, theoretical concepts and models used)\n*\tMethod and participants/sample. Make us understand this phenomenon better, give an insight, overview, member's viewpoint, personal reflections, major themes (depends on the RQs and methods, obviously). You can conduct interviews, focus-groups, use observation or ethnographical approach, do a survey, analyse visual discourses, do a media-texts-centered quantitative/qualitative analysis, whatever you see fit. In this chapter give an overview of what, who and how you studied. Remember, we are talking about small-scale study, do not overthink it. \n*\tResults. Well...present your main results. Use quotes, illustrating materials, but be aware of ethical considerations of such data presentation.\n*\tDiscussion and conclusions - bring together your theoretical framework and results, how does it fit, what is the meaning of it, what does this all mean on micro/meso/macro levels? What did you discover/explore? What is worthy of future research? etc.\n\nAnd then - present your work   Here, you can definitely deviate from the \"proper academic presentation\" format, do what feels fun and interesting to you."}}, {"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "INDIVIDUAL ASSIGNMENT: An analytical essay will need to bring and bind together a presently used theoretical concept with your own future imaginaries/visions of how the specific phenomenon (related to the concept) have developed by the year 2035\nChoose one of the concepts talked about in class; make use of academic literature and try to imagine what will happen related to this phenomenon by the year 2035\nEXAMPLES of POTENTIAL CONCEPTS TO BE USED:  „Platform“; „Dataveillance“; „Dataism“;  „Surveillance society“/„Mediatized society“/„Datafied society“ „Platform society“ „Fake news“; „information disorder“; hybrid warfare“; refracted publics; counterpublics;  AI; social media logic, etc. \nPositively evaluated think piece meets the following criteria:\n1500-2000 words\nBased on at least 8 academic peer-reviewed sources\nThe concepts and ideas from academic literature are cited correctly\nThe text brings and binds together theoretical literature with future imaginaries/visions of how the specific phenomenon will evolve by 2035\nSufficient evidence from academic literature and from the current everyday world will be used to showcase how the phenomenon can develop during the next decade\nThe author's train of thought is comprehensible, central ideas are elaborated on sufficiently and the author has considered the audience in their writing.\n\nIt is not allowed to use ChatGPT or any similar generative AI tools for compiling or editing this work!"}}], "grade_preconditions": {"et": "The student needs to complete at least 5 reaction papers, 5 in-class assignments and provide group assignment and individual assignment"}, "grade_evaluation": {"et": "The student who has collected most points for all the assignments (class participation, reaction papers, individual essay, group-assignment) will set the standard for the whole course. From the max number of points received a grade will be deducted for every participant."}, "debt_elimination": {"et": "Points for in-class participation cannot be collected in any other way, ie. if you are unable to attend the class, you will loose out 2 points. \nIf the student is unable to submit their assignments in time, they will loose 2 points for every week their submission is late in case of reaction papers; and 5 points for individual essay. Thus in time submission is strongly advised.  \nThe student needs to complete at least 5 reaction papers, do 5 in-class assignments and hand in group assignment and individual assignment so as to receive a grade for the course."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "https://moodle.ut.ee/course/view.php?id=7576", "is_moodle_connected": false}, "participants": {"lecturers": [{"person_uuid": "0e85dfac-d29c-c2c5-a7ae-b6901c913010", "person_name": "Külliki Seppel", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "ea838f91-5c27-f306-5029-c3594db509df", "person_name": "Andra Siibak", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "52eabaa0-9237-2356-a42d-97ba50479763", "person_name": "Maria Murumaa-Mengel", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}, {"person_uuid": "d5a08ab0-c74f-7af2-0f73-96aba0d70074", "person_name": "Lee Raudsepp", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2,4,6,8,10,12,14,20"}, "entries": [{"course_week": 2, "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic_number": 1, "topic": {}, "description": {"et": "Introduction to the contemporary media society. Mediatization, deep mediatization and media logic   (by Andra Siibak)."}}, {"course_week": 4, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 2, "topic": {}, "description": {"et": "Classical theories of the public sphere (Külliki Seppel)"}}, {"course_week": 6, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 3, "topic": {}, "description": {"et": "Platformisation and deplatformisation. Social media logic  (led by Andra Siibak)"}}, {"course_week": 8, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 4, "topic": {}, "description": {"et": "Fragmentation of the public sphere: Networked, refracted and intimate publics. Led by Maria Murumaa-Mengel"}}, {"course_week": 10, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 5, "topic": {}, "description": {"et": "Fragmentation of the public sphere: calculated publics, affective publics, hashtag publics. Meeting led by Andra Siibak"}}, {"course_week": 12, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 6, "topic": {}, "description": {"et": "Datafication, dataism and dataveillance. Data bias, data discrimination. Meeting led by Andra Siibak"}}, {"course_week": 14, "work_type": {"code": "seminar", "et": "seminar", "en": "seminar"}, "topic_number": 7, "topic": {}, "description": {"et": "AI gold rush: opportunities and risks (Andra Siibak)"}}, {"course_week": 20, "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic_number": 8, "topic": {}, "description": {"et": "Group presentations  (on site meeting with Andra Siibak, Külliki Seppel, Maria Murumaa-Mengel, Lee Raudsepp)"}}]}, "registration_info": {"audience": {}}, "parent_uuid": "94e21002-fa2f-dc36-f529-c7c8057bd8a1", "parent_code": "SVUH.00.025", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}