{"uuid": "b07b1ddb-da02-9d7a-0082-016ac179d9d5", "code": "SVUH.00.077", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Society and Culture", "et": "Ühiskond ja kultuur"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course gives overview about main theories of society, explains the structure and functioning of society and culture, and discusses interrelations between individual, society and culture. In seminars the specific features of Estonian society and culture are thoroughly examined.", "et": "Aine raames antakse ülevaade peamistest ühiskonna toimimist selgitavatest teooriatest, selgitatakse ühiskonna struktuuri ning indiviidi, ühiskonna ja kultuuri koos- ja vastasmõjusid. Seminarides arutletakse Eesti ühiskonna  ja kultuuri eripärade ja kujunemise üle."}, "objectives": [{"en": "The aim of the course is to provide overview about the main social processes and functioning of the society as in general, as well as in the context of Estonian society.", "et": "Aine eesmärgiks on anda esmane ülevaade ühiskonna ja selle protsesside toimimise  loogikast nii üldisemas teoreetilises plaanis kui ka Eesti ühiskonna kontekstist lähtuvalt."}], "learning_outcomes": [{"en": "On completion of the course, students:", "et": "Õppeaine edukalt läbinud üliõpilane:"}, {"en": "- know main concepts and theoretical approaches concerning culture and society:", "et": "- tunneb olulisemaid ühiskonna käsitlemise mõisteid ja teoreetilisi lähenemisi;"}, {"en": "-\t- understands the nature and structure of the society and its connections with the development of an individual and culture;", "et": "- mõistab ühiskonna olemust, selle struktuuri ning seoseid kultuuri ja indiviidi kujunemisega;"}, {"en": "- have overview about societal institutions and respective interrelations; ", "et": "- saab ülevaate ühiskonna erinevatest institutsioonidest ning nende omavahelistest seostest;"}, {"en": "- are able to notice and understand specific features of Estonian society and to elate them with the historic, social, economic, political and cultural development;", "et": "- oskab mõtestada eesti ühiskonna eripära ning seostada seda ajaloolise, sotsiaalse, majandusliku, poliitilise ja kultuurilise arenguga;"}, {"en": "- have systematic overview about cultural developments in Estonia and can orientate in inner structure of Estonian cultural development.", "et": "- omab ülevaadet eesti kultuuriloo suundumustest ning orienteerub eesti kultuuriloo sisemises struktuuris."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}