{"uuid": "399fb132-36c8-b4cc-d156-1a2e38044b88", "code": "SVUH.00.284", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-07-18T15:54:41", "title": {"en": "Information Management and Information Audit in an Organization", "et": "Infojuhtimine ja infoaudit organisatsioonis"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course focuses on modern organization information management and information audit principles. During the course, students are given a comprehensive overview of the importance of information management in the organizational context and are prepared to effectively manage information while ensuring its security, accessibility, and compliance with legal requirements and organizational goals.\n\nStudents will also prepare an information audit for a freely chosen organization, which is in line with the organization's information policy and sector regulations.", "et": "Õppeaine keskendub kaasaegse organisatsiooni infojuhtimisele ja infoauditi põhimõtetele. Õppeaine käigus antakse üliõpilastele põhjalik ülevaade infojuhtimise olulisusest organisatsiooni kontekstis ning valmistatakse neid ette infot tõhusalt juhtima, arvestades samal ajal info turvalisuse, kättesaadavuse ja vastavuse tagamisega õiguslikele nõuetele ja organisatsiooni eesmärkidele.\nÕppijad koostavad ühele vabalt valitud organisatsioonile infoauditi, mis on kooskõlas organisatsiooni infopoliitika ning valdkonna regulatsioonidega."}, "objectives": [{"en": "Provide an overview of modern organization information management and information audit, prepare students to understand and effectively manage organization information, ensuring its security, accessibility, compliance with legal requirements, and alignment with organizational goals.", "et": "Anda ülevaade kaasaegse organisatsiooni infojuhtimisest ja infoauditist, valmistada üliõpilasi ette organisatsiooni infot mõistma ja tõhusalt  juhtima, tagades samal ajal selle turvalisuse, kättesaadavuse ja vastavuse õiguslikele nõuetele ning organisatsiooni eesmärkidele."}], "learning_outcomes": [{"en": "Upon completing the course, the student will:\n\nbe able to provide an overview of the fundamentals of information management and understand its impact on organizations;\nunderstand the role of information technology in information management and know which IT tools support information management and information audit;\nknow how to collect, assess, organize, and preserve organizational data, ensuring their security and effective use;\nbe able to choose and use methods to evaluate the efficiency of information management, risk management, and compliance based on applicable regulations;\nbe able to assess risks related to information management (including data breaches, access authorization risks, technological risks) and their impact on the organization;\nknow the principles of conducting an information audit.", "et": "Õppeaine läbimise järel üliõpilane:\n \n* oskab anda ülevaate infojuhtimise alustest ja mõistab infojuhtimise mõju organisatsioonidele;\n* mõistab infotehnoloogia rolli infojuhtimises ning teab, millised infotehnoloogilised vahendid infojuhtimist ja infoauditit toetavad;\n* teab, kuidas koguda, hinnata, korraldada ja säilitada organisatsiooni andmeid, tagades nende turvalisuse ja tõhusa kasutamise;\n* oskab valida ja kasutada meetodeid infohalduse tõhususe, riskijuhtimise ja vastavuse hindamiseks lähtuvalt kehtivatest regulatsioonidest\n* oskab hinnata infohaldusega seotud riske (sh andmelekked, volitama ligipääsu riskid, tehnoloogilised riskid) ning nende mõju organisatsioonile;\n* teab infoauditi läbiviimise põhimõtteid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}