{"uuid": "b6807a1f-4fbc-af0a-16c5-735ec3e0db2e", "code": "SVUH.00.017", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Conversations on Information Management", "et": "Infokorralduse-teemalised vestlused"}, "credits": 3, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will be held in English only (students can ask advice from each other in case of random words when needed), during the course the students are familiarized with English texts from their field, watch video clips and discuss the topics related to information management.", "et": "Kursus toimub läbinisti ingliskeelsena (vajaduse korral on võimalik üksikute sõnade puhul üksteiselt nõu küsida), kursuse vältel toimub erialaste ingliskeelsete tekstidega tutvumine, klippide vaatamine ja eeskätt erialaste teemade üle arutlemine."}, "objectives": [{"en": "The aim of the course is to improve the information management related English language skills of the students from the information management curriculum. To do so, the relevant readings and recordings from this field will be worked through, and the conversations about the relevant issues will be held.", "et": "Õppeaine eesmärkideks on parendada infokorralduse õppekava üliõpilaste erialase inglise keele oskust asjakohaste erialaste tekstide ja videomaterjalide läbitöötamise ning vestluse arendamise kaudu."}], "learning_outcomes": [{"en": "Upon completion of the course the student:", "et": "Õppeaine läbimise järel üliõpilane:"}, {"en": "1. is able to have a short presenation in English language on a topic of her own choice;", "et": "1. oskab ainekursuse lõpus läbi viia lühikese ingliskeelse erialase ettekande enda valitud teemal;"}, {"en": "2. understands popular scientific conversations in English-speaking media (on the basis of relevant video clips);", "et": "2. saab aru populaarteaduslikest vestlustest ingliskeelses meedias (videoklippide põhjal);"}, {"en": "3. is able to seek information about relevant International events from the field of information management (conferences, seminars, webinars, etc);", "et": "3. oskab leida infot erialaste võõrkeelsete sündmuste (konverents, seminar, webinar jt) kohta;"}, {"en": "4. has participated at least in one English-language field-related event (conference, seminar etc);", "et": "4. on külastanud vähemalt üht erialaga seotud võõrkeelset sündmust (konverents, seminar jne),"}, {"en": "5. is able to pay attention to contemporary field-related issues;", "et": "5. oskab pöörata tähelepanu kaasaegsetele erialastele probleemidele,"}, {"en": "6. has obtained skills to academically reflect upon the event;", "et": "6. on omandanud oskused sündmuse akadeemiliseks reflekteerimiseks,"}, {"en": "7. is more fluent on reading easier texts in English, related to her field, and gives others a short overview of the texts.", "et": "7. oskab lihtsamaid erialases inglise keeles kirjutatud tekste kiiresti lugeda ja teistele ülevaadet anda."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}