{"uuid": "14c21473-73fc-a9be-1fea-388fd6ce70b9", "code": "SVUH.00.219", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-04-02T12:06:20", "title": {"en": "Basics of Academic Research", "et": "Uurimistöö alused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": false, "is_continuous_learning_course": false}, "overview": {"description": {"en": "The course will give the basic knowledge about general principles and requirements of academic research and teaches to formulate research ideas, problems, hypotheses and tasks.", "et": "Kursus tutvustab teadustöö tegemise üldpõhimõtteid ning seminari-ja bakalaureusetööde koostamise reegleid ja nõudeid. Antakse ülevaade sellest, kuidas valida endale uurimisteemat ning otsida teoreetilisi materjale. Samuti käsitletakse seda, kuidas formuleerida uuringuideid, -eesmärke, -probleeme ja tööhüpoteese ning valida enda uurimiseesmärkide saavutamiseks sobivaimaid uurimismeetodeid. Korratakse üle viitamisreeglid ning keskendutakse seminari-ja bakalaureusetööde sisuliste ja vormiliste ülesehitusnõuete tundmaõppimisele."}, "objectives": [{"en": "The course aims at giving the basic knowledge about academic research and to develop skills of academic writing.", "et": "Anda vajalikud baasteadmised iseseisva uurimistöö planeerimiseks, koostamiseks ja vormistamiseks."}], "learning_outcomes": [{"en": "Students will:\n- choose and focus their research interests and topics\n- be able to formulate research purposes, research questions and hypotheses independently\n- know about different sources and selection of data, analysis techniques used in academic research\n- be familiar with the general style and language of research\n- know the main rules for referencing others' work and composing a reference list\n- be able to conduct and write a seminar paper, explain and defend choices made.", "et": "- Üliõpilane valib ja piiritleb edukalt uurimistöö teema\n- Üliõpilane suudab iseseisvalt formuleerida töö eesmärki, uurimisküsimusi ja hüpoteese\n- Üliõpilane on teadlik erinevatest andmekogumisviisidest ja analüüsivõtetest, mida rakendatakse teadusliku uurimistöö puhul\n- Üliõpilane tunneb teadustekstide keelelisi ja stiililisi iseärasusi\n- Üliõpilane viitab (refereerib, tsiteerib, viitab sekundaarselt) korrektselt ning vormistab nõuetele vastavalt kasutatud kirjanduse loetelu.\n- Üliõpilane oskab koostada ja vormistada uurimuslikku seminari-või bakalaureusetööd ning suudab otstarbekalt, loogiliselt ja selgelt põhjendada tehtud valikuid."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}