{"uuid": "c0fd8206-fb1a-4117-493e-a3a4c6baef48", "code": "SVUH.00.192", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Interaction and Collaboration Skills", "et": "Suhtlemis- ja koostööoskused"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": true, "is_continuous_learning_course": false}, "overview": {"description": {"en": "Social and Teamwork Skills course will give an overview of the social and communication skills in social field, e.g. in the workplace.", "et": "Suhtlemis- ja koostööoskuste kursusel saab osaleja ülevaate suhtlemisoskuste komponentidest ja nende kasutamise dünaamikast, sh suhtluspartneri(tega) kontakti loomise, hoidmise ja lõpetamise oskustest, koostöösuhte arendamise oskustest, selge eneseväljenduse ja aktiivse kuulamise oskustest, mõjutamise ja veenmise oskustest, kultuuri-, rahvuse-, institutsiooni  ja muu konteksti mõjudest suhtlusele, erinevatest konflikti markeritest, hoiakutest konfliktide suhtes, suhtlemist mõjutavatest kaitsemehhanismidest, emotsioonide, aga ka uskumuste ja väärtuste tähtsusest suhtlussituatsioonides."}, "objectives": [{"en": "Course aims to provide the knowledge about the principles of forming and maintaining relationships, developing collaboration and communicating in challenging situations and conflict situations. In the video-training participants develop skills of active listening and conflict management.", "et": "Suhtlemis- ja koostööoskuste aine eesmärk on anda ülevaade koostöö kujundamise etappidest ja tegevustest, inimeste vahelise suhtluse ja suhete loomise ning avaliku esinemise põhimõtetest. Ainekursuse raames arendavad osalejad oskust avalikult esineda, oma tööd esitleda ning samuti arendavad osalejad selge eneseväljenduse, aktiivse kuulamise, pingelises suhtlussituatsioonis käitumise ja konfliktilahendamise oskuseid videotagasisidega suhtlemistreeningu käigus."}], "learning_outcomes": [{"en": "The students develop an understanding of basic interpersonal communication skills, analyse their own communication and cooperation skills during the communication skills training and they  demonstrate improvement in communication skills including listening and responding, managing difference, managing conflict and having ethical communication", "et": "Kursuse läbinud üliõpilane: \n- teab suhtlemise baasoskuseid ja on videotagasisidega suhtlemistreeningu käigus analüüsinud oma suhtlemisoskuseid, on harjutanud kontakti, selge eneseväljenduse, aktiivse kuulamise alaoskuseid ja konfliktilahendamise oskuseid; \n- teab koostöö kujundamise etappe ja on harjutanud koostööoskuseid; \n-  teab avaliku esinemise põhimõtteid ja avalikkusega suhtlemise põhimõtteid, on koostanud iseseisvalt kõne ja eneseesitluse ning on harjutanud avalikku esinemist."}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}