{"uuid": "7a12de84-70e6-19a4-884e-584bba3e22de", "code": "SVUH.00.153", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Media in the Era of Disinformation", "et": "Meedia infokorratuse ajastul"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "pass", "et": "Eristamata (arv, m.arv, mi)", "en": "non-differentiated (pass, fail, not present)"}, "is_vota_course": false, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will develop students in accessing information, analyzing it, creating one's own message, reflecting one's consumption and being socially responsible. There will be a special emphasis on the work and skills of contemporary journalism but \"MEDI\" is relevant for most professions who have to constantly update their digital/media and information literacy competences. The course will be led by scholars and lectures from the fields of journalism, media studies and communication, but will alsol engage empirical examples, scholars and practitioners from different fields (e.g. law, linguistics, semiotics) in order to provide nuanced overview of the field, current problems and possible solutions.", "et": "Kursusel arendatavate aspektide hulka kuuluvad info hankimine ja analüüsimine, täpsete ja asjakohaste sõnumite loomine, oma meedia tarbimise harjumuste teadvustamine ja sotsiaalne vastutus. Ehkki rõhk on suurem kaasaegse ajakirjanduse tööviisidel ja oskustel, on kogu info asjakohane ja kasulik ka teiste erialade professionaalidele, kellel vaja olla meedia- ja infotarbimisoskustega kaasajas. Kursust juhivad eksperdid ajakirjanduse, meediauuringute ja kommunikatsiooni erialadelt, kuid kaasatakse ka praktilisemaid näiteid ning eksperte teistelt erialadelt - juura, keeleteadused, semiootika. See tagab osalejatele põhjaliku ülevaate teemast, selle hetkeprobleemidest ning võimalikest lahendustest."}, "objectives": [{"en": "In order to act as responsible, safe and engaged citizens in the networked publics, individuals need to build digital resilience, data agency and consistently develop their media and digital literacy skills. This course is dedicated to developing students' digital and media agency so as to be able to make use of the various affordances of the digital mediatized life as well as to mitigate potential risks technology saturated societies uphold. The course has a special emphasis on the work and skills of contemporary journalism but is relevant for most professions who have to constantly update their digital/media and information literacy competences - accessing information, analyzing it, creating one's own message, reflecting one's consumption and being socially responsible. The course will be led by scholars and lectures from the fields of journalism, media studies and communication, but will also engage empirical examples, scholars and practitioners from different fields (e.g. law, linguistics, semiotics) in order to provide nuanced overview of the field, current problems and possible solutions.", "et": "Selleks, et käituda võrguplatvormidel vastutustundlike, turvalisust silmas pidavate ja kaasatud kodanikuna, peab iga inimene arendama enda digitaalset vastupidavust, teadlikkust ja meediapädevusi. Aine on pühendatud üliõpilaste digitaalse- ja meediateadlikkuse arendamisele nii ajakirjanike kui meediatarbijatena, et see aitaks efektiivselt ära kasutada kõiki kaasaegse digitaalse elu võimalusi, mõistes samas nende võimaluste mõju reaalsele elule ning potentsiaali nii mõjutada kui olla mõjutatavad. Lühidalt, kursuse eesmärk on pakkuda tudengitele nii teoreetilisi teadmisi kui praktilisi kogemusi oma meedia- ja infotarbimisharjumuste analüüsimisel, taustainfot nende tarbitavast, kuidas see võib olla mõjutatud infohäiretest ning reaalses elus kasutatavaid juhiseid muutmaks neid harjumusi nii iseendas kui ka teistes."}], "learning_outcomes": [{"en": "After completing the course, the student: ", "et": "Õppeaine edukal läbimisel üliõpilane:"}, {"en": "Is familiar with more common theories and everyday concepts of information society and knows how to recognize and analyze (the dominant signs of) information disorders,", "et": "·   \tOn tuttav infoühiskonna levinumate teooriate ja kontseptsioonidega ning oskab ära tunda ja analüüsida infohäirete tavapärasemaid tunnuseid"}, {"en": "has an overview the work processes, roles and professional demands of journalists in contemporary media systems,", "et": "·   \tOmab ülevaadet ajakirjanike tööprotsessidest, rollidest ja ametialastest nõudmistest tänapäevastes meediasüsteemides"}, {"en": "understands the potential effects of information disorder - on micro, meso and macro levels,", "et": "·   \tMõistab infohäirete võimalikke tagajärgi mikro-, meso- ja makrotasandil"}, {"en": "Is  familiar with the vocabulary on related topics, is able to discuss and critically analyse some of the contemporary issues of the information society and mediatization processes,", "et": "·   \tOn tuttav kaasatud teemade sõnavaraga, suudab arutada ja kriitiliselt analüüsida levinumaid kaasaegse infoühiskonna ja mediatiseerumise probleeme"}, {"en": "has the skills to independently seek additional information related to the information society concepts,", "et": "·   \tSuudab iseseisvalt otsida ning leida lisainfot infoühiskonna kontseptsioonide kohta"}, {"en": "uses at least three different methods from \"data journalism\", understands their uses in different contexts,", "et": "·   \tOskab kasutada vähemalt kolme erinevat \"infoajakirjanduse\" meetodit, saab aru nende kasutusviisidest erinevates kontekstides"}, {"en": "can use various e-learning opportunities and is reflexive about the experience, has used e-learning platforms for cooperation and group-work,", "et": "·   \tKasutab kompetentselt mitmeid e-õppe võimalusi, on kasutanud e-õppe platvorme koos- ja rühmatöödeks."}, {"en": "is able to analyse and (to a certain extent) create media content that have journalistic value,", "et": "·   \tSuudab analüüsida ja (teatud määral) luua ajakirjanduslikku väärtust omavat meediasisu"}, {"en": "can find, develop and use study materials for various stakeholders and target groups within the framework of media/information/digital literacies.", "et": "·   \tOskab leida, arendada ja kasutada meedia-/info-/digiteadlikkuse teemalisi õppematerjale mitmetele sihtrühmadele"}]}, "_actions": {"is_editable": false, "is_version_creatable": false, "is_deletable": false}}