{"uuid": "ba19d935-3b68-dc52-a64f-aff1b8d0e882", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-11-06T15:25:13", "title": {"en": "Counselling and Group Work Skills", "et": "Nõustamise ja grupitöö oskused"}, "credits": 3, "credit_type": "ECTS", "target": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "semester": {"code": "spring", "et": "kevad", "en": "spring"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "SV", "name": {"en": "Faculty of Social Sciences", "et": "sotsiaalteaduste valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "label": {"en": "24/25 S regular SV", "et": "24/25 K PÕ SV"}}, "general": {"year": {"code": "2024", "et": "2024/2025", "en": "2024/2025"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": false, "study_levels": [{"code": "bachelor", "et": "bakalaureuseõpe", "en": "bachelor's studies"}], "hours": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "other_languages": [{"code": "en", "et": "inglise keel", "en": "English"}], "description": {"en": "The course will be in Estonian, literature is  in English. \nMain subjects are:\nProcess and basic principles of counselling. Personality and professional skills of the counsellor. Professional ethics of a counsellor. Factors influencing counselling process. Basic counselling theories (basic concepts, key concepts, basic techniques). Basic counselling techniques applied in social work (active listening).\nCharacteristic aspects of groups. Impact of group size on its efficiency. Open/closed group. Duration of group work. Group work procedures. Planning of group activities. Rules and norms in a group. Skills of a group leader. Case studies of group leadership. Communication within a group.", "et": "Loengukursus toimub interaktiivõppe vormis. Õppetöös kasutatakse grupiharjutusi, ühisarutelusid, teoorialoenguid, iseseisvat tööd kirjandusega. Loengukursuse formaat eeldab aktiivset osalemist loengutes, kuna oskuste omandamine on võimalik üksnes läbi praktiliste tegevuste.\nKursuse eesmärk on esiteks, omandada teadmised nõustamise põhimõtetest, etappidest, toimevõimekuse arengust ja omandada esmased oskused nõustamisprotsessi läbiviimiseks sotsiaalvaldkonnas klienditöös; teiseks omandada teadmised grupi kujunemise dünaamikast, grupijuhi ja grupiliikmete tegevusest grupis, eestvedamise aspektidest, grupikohtumiste planeerimisest ja samuti esmased oskused grupi eestvedamisest."}, "objectives": [{"en": "The course gives an overview of the basics of counselling, opportunities to apply counselling in social field, practical acquisition of basic techniques for primary counselling.\nTopics: Process and basic principles of counselling. Personality and professional skills of the counsellor. Professional ethics of a counsellor. Factors influencing counselling process. Basic counselling theories (basic concepts, key concepts, basic techniques). Basic counselling techniques applied in social work (active listening).\nStages in group development Pllanning and implementing a new group.\nLeadership skills. Group work in a social service setting.", "et": "Kursuse eesmärk on esiteks, omandada teadmised nõustamise põhimõtetest, etappidest, toimevõimekuse arengust ja omandada esmased oskused nõustamisprotsessi läbiviimiseks sotsiaalvaldkonnas klienditöös; teiseks omandada teadmised grupi kujunemise dünaamikast, grupijuhi ja grupiliikmete tegevusest grupis, eestvedamise aspektidest, grupikohtumiste planeerimisest ja samuti esmased oskused grupi eestvedamisest. \n\nLoengukursus toimub interaktiivõppe vormis. Õppetöös kasutatakse grupiharjutusi, ühisarutelusid, teoorialoenguid, iseseisvat tööd kirjandusega. Nõustamise ja grupitöö oskuste loengukursuse formaat eeldab aktiivset osalemist loengutes, kuna oskuste omandamine on võimalik üksnes läbi praktiliste tegevuste."}], "learning_outcomes": [{"en": "Alter completing the course, students:\n1. understands basic principles of counselling;\n2. knows counselling application areas;\n3. is familiar with the process of counselling and the basic tasks of counsellor in social work and rehabilitation;\n4. is aware of the limits of counselling intervention (incl ethical aspects);\n5. is able to identify and analyze the factors affecting the process of counselling;\n6. has active listening skills;\n7. is able to support client activity at different stages of the counselling process and understands the importance of the process of self-reflection in the professional setting;\n8. has understanding of the stages of group development and the related group character, members' behavior and tasks and worker tasks and skills that are specific to each stage;\n9. knows issues associated with group structure (e.g. group size, length of sessions, duration of group, meeting place, open or closed to new members, resources, supplies);\n10.  appropriately enhances group content (what will go on during sessions) as well as the use of activities, supplies and other resources;\n11. has knowledge of the function of the group facilitator.", "et": "Kursuse edukal läbimisel õppija\n1. teab nõustamise põhimõtteid;\n2. teab nõustamise rakendusvaldkondi;\n3. teab nõustamisprotsessi etappe;\n4. on teadlik nõustamise kui sekkumismeetodi piirangutest (sh eetilistest aspektidest);\n5. oskab määratleda ning analüüsida nõustamisprotsessi mõjutavaid tegureid;\n6. kasutab aktiivse kuulamise oskuseid;\n7. teab, kuidas toetada kliendi aktiivsust nõustamise üheksas etapis;\n8. mõistab eneserefleksiooni olulisust nõustamise töös;\n9..on omandanud teadmised grupi dünaamikast ja erinevate etappide eripäradest, grupi tunnustest igal etapil, liikmete käitumise eripäradest, juhi funktsioonidest;\n10. teab grupi läbiviimisega seotud aspekte (grupi suurus, grupikohtumiste kestus/vältus, grupisessioonide arv, grupi läbiviimise asukoht, avatud või suletud grupi eripärad, grupikohtumiste planeerimiseks ja läbiviimiseks vajalikud ressursid) ning oskab planeerida grupisessioonide kestust;\n11. teab, kuidas planeerida ja läbi viia eesmärgi saavutamiseks sobivad ja grupile kohased tegevused ning kasutada selleks erinevaid ressursse;\n12. tunneb grupijuhi funktsioone."}], "notes": {"et": "Õppeprotsessis osalemist toetavad konsultatsioonid toimuvad loengu eel või järel või kokkuleppel õppejõuga."}}, "grading": {"independent_work": {"et": "moodles"}, "independent_work_assessments": [{"work_type": {"code": "combined", "et": "Suuline ja kirjalik (kombineeritud) lõpphindamine", "en": "final oral and written (combined) assessment"}, "description": {"et": "Nõustamise protsessi ülesannete tegemine moodles.\nNõustamise õpipäeviku koostamine moodles.\nGrupi eestvedamise tegevuse sooritamine vastavalt kursuse raames tehtud kokkuleppele.\n_\nE - eksamitöö kirjaliku osa vormistus on üldjoontes nõuetekohane ja korrektne; 1. Teoreetilised teadmised on omandatud minimaalsel tasemel ja üliõpilane suudab rääkida nõustamise teemadel, orienteerub ainekursusel läbitud teemades.\n2. Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks hädavajalikul määral ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise lihtsamate oskuste kasutamist.\n3. Üliõpilane suudab eksamil anda enamusele küsimustest mingi vastuse. \n\nD- eksamitöö kirjaliku osa vormistus on nõuetekohane ja üldjoontes korrektne; 1. Teoreetilised teadmised on omandatud piisaval tasemel ja üliõpilane suudab selgitada teoreetiliste lähenemiste erinevaid aspekte. \n2. Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks piisaval määral ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste kasutamist.\n3. Üliõpilane suudab eksamil sisuliselt vastata enamikule esitatud küsimustele, kuid sisuline arutlus on vähene. \n\nC- eksamitöö kirjaliku osa vormistus on nõuetekohane ja korrektne; 1. Teoreetilised teadmised on omandatud heal tasemel ja üliõpilane räägib vabalt teoreetiliste lähenemiste erinevatest aspektidest, kuid kohati on ebatäpsusi või on teatud aspektid ununenud.\n2. Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks heal tasemel ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste head kasutamist.\n3. Üliõpilane suudab eksamil sisuliselt vastata kõigile esitatud küsi- mustele.\n\nB- eksamitöö kirjaliku osa vormistus on eeskujulik; 1. Teoreetilised teadmised on omandatud väga heal tasemel ja üliõpilane räägib vabalt teoreetiliste lähenemiste erinevatest aspektidest.\n2. Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks väga heal tasemel ja eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste väga head kasutamist.\n3. Üliõpilane annab eksamil kõigile esitatud küsimustele sisukad vastused ning orienteerub hästi antud teemavaldkonnas. \n \n\nA- eksamitöö kirjaliku osa vormistus on eeskujulik; 1. Teoreetilised teadmised on omandatud suurepärasel tasemel ja üliõpilane räägib vabalt teoreetiliste lähenemiste erinevatest aspektidest ning teab uusimaid lähenemisi,  suudab analüüsida lähenemiste erinevusi ja sarnasusi.\n2. Nõustamise baasoskused on omandatud kliendikohtumiste läbiviimiseks suurepärasel tasemel. Oskuste kasutamisel on üliõpilane paindlik, loov ja näitab kiiret reageerimisvõimet. Eksamil suudab üliõpilane demonstreerida aktiivse kuulamise oskuste suurepärast kasutamist.\n3. Üliõpilane annab eksamil esitatud küsimustele põhjalikud ja sisukad vastused ning orienteerub suurepäraselt teemavaldkonnas."}}], "grade_preconditions": {"et": "moodles"}, "grade_evaluation": {}, "debt_elimination": {"et": "Kokkuleppel õppejõuga."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": true, "learning_environments": [{"uuid": "150f6962-fefe-4c45-bce9-0eb1db748b4d", "type": "MOODLE", "code": "SVUH.00.180", "base_url": "undefined", "is_auto_update": true, "is_default": true, "is_auto_grading": false}], "mandatory_materials": "Narusson, Dagmar (2021). Lootuse hoidjale. Suhtlus- ja nõustamisoskused sotsiaal- ja kogukonnatöös: inimese toimevõimekuse arengu toetamine. Tartu Ülikool kirjastus.\nDspace'i link: https://dspace.ut.ee/handle/10062/71495 (TÜ üliõpilastele tasuta allalaetav)\n\nNarusson, Dagmar (2022). Avatud Dialoog. Avatud Dialoogil põhinev sotsiaalse rehabilitatsiooni teenus 0-15aastastele. Tartu: Tartu Ülikooli Kirjastus.\nLink: https://www.tyk.ee/sotsioloogia/00000013432\n(tasuta allalaetav)\n\nEgan, Gerard (2013/2014). The Skilled Helper: A Problem-Management and Opportunity- Development Approach to Helping. 10th edition. Pacific Grove, CA: Brooks/Cole. 464 pages.\n(kättesaadav moodles; kohustuslikud peatükid: 6-13)\n\nCrawford, Karin; Price, Marie; Price, Bob (2015). Group work practice for social workers. SAGE, Los Angeles, 180 p\n\nLindsay, Trevor; Orton, Sue (2015). Group work practice in social work. SAGE, London, 156 p\n\nZastrow, Charles (2015). Social Work with Groups: A Comprehensive Worktexts. 9th Revised edition. Stamford: Cengage Learning, c2015, 654 p\n\nZastrow, Charles (2012). Social Work with Groups: A Comprehensive ... Brooks/Cole Empowerment Series, 532 p", "recommended_materials": "Crawford, Karin; Price, Marie; Price, Bob (2015). Group work practice for social workers. SAGE, Los Angeles, 180 p\n\nLindsay, Trevor; Orton, Sue (2015). Group work practice in social work. SAGE, London, 156 p\n\nZastrow, Charles (2014). Social Work with Groups: A Comprehensive Worktexts 9th Revised edition. Brooks/Cole Empowerment Series 672 p\n\nZastrow, Charles (2012). Social Work with Groups: A Comprehensive ... Brooks/Cole Empowerment Series, 532 p\n\nMoss, Bernard (2015). Communication Skills in Health and Social Care. 222 p"}, "participants": {"lecturers": [{"person_uuid": "99a50819-dc35-872a-5e00-d3dcf8d33004", "person_name": "Dagmar Narusson", "structural_unit": {"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}, "is_responsible": true, "is_teaching": true}]}, "schedule": {"weeks": {"et": "24-38"}, "entries": [{"work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Ülevaade loengukursuse korraldusest, eesmärkidest, töömeetoditest, käsitletavatest teemadest, kohustuslikust kirjandusest, eksamist ja hindamispõhimõtetest\nLOENGUTE TEEMAD ON MOODLES\n_"}}]}, "registration_info": {"audience": {"et": "sotsiaaltöö ja sotsiaalpoliitika eriala õppivad üliõpilased"}, "min_students": 20, "max_students": 28}, "parent_uuid": "b8a03adf-e030-4988-82c6-380692ec5fce", "parent_code": "SVUH.00.180", "parent_credits": 3, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}