{"uuid": "438d02d5-a1d6-1e65-28b3-b860e80fa1c7", "code": "SVUH.00.163", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-02-05T11:04:36", "title": {"en": "Social Research Methods", "et": "Ühiskonna uurimise meetodid"}, "credits": 6, "general": {"input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "SVUH", "structural_unit_name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}, "structural_units": [{"code": "SVUH", "name": {"en": "Institute of Social Studies", "et": "ühiskonnateaduste instituut"}, "email": "yhiskonnateadused@ut.ee", "phone": "+372 737 5188", "webpage_url": "https://yti.ut.ee", "address": "Lossi 36\n51003 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Lossi 36", "zip": "51003", "level": 2, "academic": true, "supports_continuous_learning": true, "parent_code": "SV"}]}, "additional_info": {"duration_in_semesters": 1, "occurrence_frequency": {"code": "year", "et": "igal õppeaastal", "en": "every academic year"}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "is_vota_course": true, "is_continuous_learning_course": true}, "overview": {"description": {"en": "The course will give basic knowledge about the methodological issues in social sciences, general principles and requirements of social research, and the main stages of social research. The course will give basic skills to use social research methods for collecting data. The focus is on the most typical data collection methods in social sciences and their practical application.", "et": "Kursus tutvustab sotsiaalteaduste metodoloogia põhialuseid, empiiriliste sotsiaalteaduslike uuringute tegemise aluspõhimõtteid ning uurimistöö põhietappe. Kursuse käigus omandatakse baasoskused andmete kogumiseks erinevaid meetodeid rakendades. Kursus keskendub sotsiaalteadustes enim kasutatavatele andmekogumise meetoditele ning nende praktilisele rakendamisele."}, "objectives": [{"en": "The course aims at ", "et": "Ainekursuse eesmärk on "}, {"en": "(1) giving the basic knowledge about the general methodology of social sciences, planning and conducting social research, different types of data, data collection methods and the process of data collection in social sciences; ", "et": "(1) anda osalejatele baasteadmised sotsiaalteaduste metodoloogiast, sotsiaalteadusliku uurimuse planeerimisest ja läbiviimisest, erinevat liiki andmetest, andmekogumise peamistest meetoditest ja andmekogumise protsessist sotsiaalteadustes;"}, {"en": "(2) developing the elementary skills for conducting a small-scale social study, collecting empirical data, and reporting the results, and ", "et": "(2) anda esmased oskused empiiriliste andmete kogumiseks väikesemahulise sotsiaaluuringu raames ning uuringutulemuste vormistamiseks ning "}, {"en": "(3) practising the skills necessary for conducting social research (incl. group work and digital skills).", "et": "(3) harjutada uurimistöö läbiviimiseks vajalikke praktilisi oskusi (sh grupitöö- ja digioskusi)."}], "learning_outcomes": [{"en": "After successfully completing the course, a student", "et": "Kursuse edukalt läbinud tudeng"}, {"en": "- has the basic knowledge of the main principles in social science methodology;", "et": "- tunneb sotsiaalteaduste metodoloogia põhialuseid;   "}, {"en": "- is able to formulate research purposes, research questions and hypotheses;  ", "et": "- suudab sõnastada uuringu eesmärki, uurimisküsimusi ja hüpoteese;"}, {"en": "- knows different quantitative and qualitative social research methods as well as the main advantages and disadvantages of these methods;", "et": "- teab erinevaid kvantitatiivseid ja kvalitatiivseid andmekogumise meetodeid ning oskab välja tuua nende peamised eelised ja puudused;"}, {"en": "- is able to differentiate whether quantitative or qualitative methods should be used to answer a particular research question;", "et": "- oskab eristada, millistele uurimisküsimustele vastamiseks tuleks eelistada kvantitatiivseid ja millisele kvalitatiivseid andmekogumise meetodeid; "}, {"en": "- is able to explain why they use specific methods to collect data for their research project;", "et": "- oskab põhjendada, miks ta oma uurimistöös andmete kogumiseks üht või teist meetodit kasutab;"}, {"en": "- has an overview of different types of samples;", "et": "- omab ülevaadet erinevat tüüpi valimitest; "}, {"en": "- is able to choose a suitable sample for their study;", "et": "- oskab oma uurimisprobleemist lähtuvalt määratleda valimi; "}, {"en": "- is familiar with the most common problems in the data collection process and with some methods to prevent those problems;", "et": "- teab peamisi probleeme andmete kogumise protsessis ning enamlevinud meetodeid nende ennetamiseks;"}, {"en": "- is aware of the ethical issues related to data collection, processing, and storing; ", "et": "- on teadlik andmete kogumise, töötlemise ja talletamise eetilisest küljest;"}, {"en": "- is able to design and conduct a small-scale empirical study;", "et": "- oskab kavandada ja läbi viia väikesemahulist empiirilist uuringut;"}, {"en": "- has developed social and digital skills necessary for conducting empirical research;  ", "et": "- on arendanud empiirilise uuringu läbiviimiseks vajalikke grupitöö- ja digioskusi;"}, {"en": "- is able to describe and present the methodology of empirical research.", "et": "- oskab kirjeldada ja esitleda empiirilise uuringu metodoloogiat."}]}, "_actions": {"is_version_creatable": false, "is_editable": false, "is_deletable": false}}