{"uuid": "bb236bbb-665d-4fe0-d6d8-6a93e0609aa2", "code": "hv-2018-autumn-fulltime-c6", "state": {"code": "confirmed", "et": "Kinnitatud", "en": "confirmed"}, "last_update": "2024-03-21T14:14:57", "title": {"en": "Sacral Texts and Culture", "et": "Sakraaltekstid ja kultuur"}, "credits": 6, "credit_type": "ECTS", "target": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "semester": {"code": "autumn", "et": "sügis", "en": "autumn"}, "study_type": {"code": "fulltime", "et": "päevaõpe", "en": "regular studies"}, "language": {"code": "et", "et": "eesti keel", "en": "Estonian"}, "part": {"code": "0", "et": "Osadeta", "en": "None"}, "faculty": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "course_main_structural_unit": {"code": "HVUS06", "name": {"en": "Chair of Comparative Religious Studies", "et": "võrdleva usuteaduse õppetool"}, "phone": "+372 737 5965", "address": "Ülikooli 18 - 308\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18 - 308", "zip": "50090", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVUS"}, "label": {"en": "18/19 A regular HV", "et": "18/19 S PÕ HV"}}, "general": {"year": {"code": "2018", "et": "2018/2019", "en": "2018/2019"}, "input_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "structural_unit_shares": [{"structural_unit_code": "HVUS06", "structural_unit_name": {"en": "Chair of Comparative Religious Studies", "et": "võrdleva usuteaduse õppetool"}, "course_share_percent": 100, "coordinating": true}], "type": {"code": "regular", "et": "Tavaline aine", "en": "Regular course"}}, "additional_info": {"is_vota_course": true, "is_continuous_learning_course": true, "study_levels": [{"code": "master", "et": "magistriõpe", "en": "master's studies"}], "hours": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "is_enlight_course": false}, "overview": {"study_languages": [{"code": "et", "et": "eesti keel", "en": "Estonian"}], "description": {"en": "During the course, students will be introduced to the methods of reading, analysing and comparing religious base texts and specifically to the texts to be analysed. A selection of texts will be read, analysed and compared together, by formulating culture related, existential and religious questions, and writing a series of home works and discussing them together.", "et": "Kursuse käigus saavad üliõpilased sissejuhatuse religioosse baaskirjanduse lugemise, analüüsimise ja võrdlemise meetoditesse ning spetsiifiliselt ka analüüsitavatesse tekstidesse. Tekstivalikut loetakse, analüüsitakse ja võrreldakse, sõnastades kultuuriga seotud, eksistentsiaalseid ja religioosseid küsimusi, kirjutades rea iseseisvaid koduseid töid ning arutades neid üheskoos."}, "objectives": [{"en": "To acquire an experience of reading and analysing (the translations of) religious base texts, and to learn to compare them and relate them to the human cultural, existential and religious questions, and to apply simpler hermeneutical and exegetical methods, and relevant literature.", "et": "Saada religioossete baastekstide (tõlgete) lugemise ja analüüsimise kogemus, õppides neid võrdlema ning inimese kui sellise kultuuriga seotud, eksistentsiaalsete ja religioossete küsimustega seostama ning kasutades selleks lihtsamaid hermeneutika ja eksegeesi meetodeid ja vastavat kirjandust."}], "learning_outcomes": [{"en": "The student", "et": "Üliõpilane"}, {"en": "- knows the character of the exegesis of religious base texts and understands their importance;", "et": "- tunneb religioossete baastekstide iseloomu ja mõistab nende tähtsust;"}, {"en": "- knows and applies the principles of literary, form and tradition criticism;", "et": "- tunneb ja kasutab kirjandus-, vormi- ja traditsioonikriitika põhimõtteid;"}, {"en": "- formulates culture related, existential and religious questions;", "et": "- sõnastab kultuuriga seotud, eksistentsiaalseid ja religioosseid küsimusi;"}, {"en": "- following the latter output compares various religious texts;", "et": "- võrdleb eelnevast lähtuvalt erinevaid religioosseid tekste;"}, {"en": "- draws consequences on the context of the authors of religious texts and compares it with our contemporary context;", "et": "- teeb järeldusi religioossete baastekstide kirjutajate konteksti kohta ning võrdleb seda tänapäeva kontekstiga;"}, {"en": "- finds reference and relevant secondary literature, and formulates with their aid conclusions about the formation, contexts and religious intent of the texts.", "et": "- leiab relevantset teatme- ja teaduskirjandust ning sõnastab nende abil järeldusi tekstide tekkeloo, kontekstide ja religioosse sisu kohta."}], "notes": {}}, "grading": {"independent_work": {"et": "(NB! Siin on vaid üldised ülesannete sõnastused, täpseid juhiseid vt ajakava alt. Põhikorpuse ja referentstekstid ning sekundaarkirjandus nimetatakse kursuse alguses.)\n1. Kaanon kui religioosne suurus: millega põhjendatakse põhikorpuse kanoonilisust? Kasutada sekundaarkirjandust ja viidata korrektselt. (Kirjandus nimetatakse kursuse toimumise ajal.)\n2. Hermeneutilised arutlused seoses põhikorpuse tekstidega: võrdlemine ja nende põhjal hermeneutiliste küsimuste sõnastamine. (Kirjandus nimetatakse kursuse toimumise ajal.)\n3. Põhikorpuse teksti hermeneutika: miks on see tekst meile huvitav? Põhjendada.\n4. Põhikorpuse tekst: milliseid järeldusi saab teha valitud teksti konteksti kohta?\n5. Meie kontekst: sõnastada viis Eesti tänapäeva konteksti iseloomustavat aspekti, milliseid küsimusi esitame tekstidele? Põhjendus, sekundaarkirjandus. (Kirjandus nimetatakse kursuse toimumise ajal.)\n6. Põhikorpuse tekst (kirjanduskriitika): ülesehitus ja põhjendus, kihistuste eristamine, sisuliste raskuspunktide sõnastamine.\n7. Põhikorpuse tekst ja referentstekst (vormikriitika): vormi võrdlus, sarnasuste ja erinevuste markeerimine; selle sõnastamine, milline on vormi mõju sisule.\n8. Põhikorpuse tekst ja referentstekst (traditsioonikriitika): millised on mõlemas tekstis esinevad motiivid ning kuidas kirjeldada nende konteksti ja eesmärki?\n9. Põhikorpuse tekst ja referentstekst: kuidas on sarnaste motiivide ja religioossete teeside nihe markeeritav kahe eri usunditest pärit teksti kontekstis?\n10. Põhikorpuse tekst ja meie: valitud põhikorpuse teksti kirjandus-, vormi- ja traditsioonikriitiline analüüs, konteksti kindlaksmääramine ning relevantsus meile meie kontekstis."}, "independent_work_assessments": [{"work_type": {"code": "homework", "et": "Kodutöö", "en": "home work"}, "description": {"et": "NB! Kehtib kõikide kodutööde puhul.\nF - Sisutekst või lahendus ei vasta küsimusele, analüüs puudub ning mõtted on seosetud. Järeldusi ei ole. Teksti üleehituses on vastuolud, mõni tekstiosa puudub. Vormistus puudulik, viitamine olematu.\nE - Sisutekst või lahendus vastavad küsimusele, kuid analüüs on nõrk ning mõtted on kohati seosetud. Järeldusi ei ole põhjendatud. Teksti üleehituses on vastuolud, mõni tekstiosa puudub. Vormistus jätab soovida, kasutatud on erinevaid viitamissüsteeme ja osa viiteid puudub.\nD - Sisutekst või lahendus vastavad küsimusele, kuid analüüs on ebaühtlane ning mõtted on kohati seosetud. Järeldusi on nõrgalt põhjendatud. Teksti üleehituses on vastuolud, mõni tekstiosa puudub. Vormistus on korrektne, kuid kasutatud on erinevaid viitamissüsteeme.\nC - Sisutekst või lahendus vastavad küsimusele, analüüs on esitatud arusaadavalt ja järeldusi on põhjendatud. Teksti ülesehitus on loogiline, kohati on üleminekud hüppelised. Vormistus on korrektne ning kasutab ühtset viitamissüsteemi.\nB - Sisutekst või lahendus vastavad küsimusele, arvestavad algallikat ja/või sekundaarkirjanduse allikat adekvaatselt ning peegeldavad iseseisvat uurimis- ja lugemistööd, analüüs on esitatud selgelt. Tekst on tervik, ülesehitus on loogiline. Vormistus on korrektne ning kasutab ühtset viitamissüsteemi.\nA - Sisutekst või lahendus vastavad küsimusele, arvestavad algallikat ja/või sekundaarkirjanduse allikat adekvaatselt ning peegeldavad iseseisvat uurimis- ja lugemistööd, vastus on analüütiline, loov ja isikupärane, analüüs on esitatud selgelt ja veenvalt. Tekst on liigendatud tervik, ülesehitus on loogiline ja sidus. Vormistus on korrektne ning kasutab ühtset viitamissüsteemi."}}], "grade_preconditions": {"et": "Kodutööde jooksev esitamine."}, "grade_evaluation": {"et": "Lõpliku tulemuse saamiseks arvutatakse kümne kodutöö keskmine, kusjuures tööde 1-9 osakaal hindest on 80% ja 10. töö hinde osakaal 20%."}, "debt_elimination": {"et": "Kodutöid on võimalik tagantjärele esitada kuni kolm nädalat pärast viimast auditoorset tundi."}, "assessment_scale": {"code": "grade", "et": "Eristav (A, B, C, D, E, F, mi)", "en": "differentiated (A, B, C, D, E, F, not present)"}, "results_available_from": {}}, "resources": {"web_based": {"code": "2", "et": "põimõpe", "en": "blended learning"}, "website_url": "http://moodle.ut.ee", "is_moodle_connected": false, "mandatory_materials": "IIOBI RAAMAT\n\n-- U. Nõmmik, Iiobi raamat. Piibel kontekstis 1. Tartu 2013.\n-- U. Nõmmik, \"Iiob ja tema ainumas Jumal, ehk kust see kuri tuleb?\" - Vikerkaar 29 (2014), 72-82.\n-- \"Poeem õiglasest kannatajast: (Ludlul bel nemeqi)\" (tõlkinud Amar Annus, \"Saateks\" Amar Annus, Alan Lenzi) - Akadeemia 4/2011, 631-651.\n-- U. Nõmmik, \"Iiobi raamatu raamjutustus süüria ja vanakreeka versioonides\" - Rohtmets, Priit; Remmel, Atko-Sulhan (toim). Eesti Evangeelne Luterlik Kirik 100. Kirik. Teoloogia. Mälestused Tallinn, Tartu: EELK Usuteaduse Instituut, Tartu Ülikool, 2017, 203-220. \n\nHERMENEUTIKA JA VORM\n\n-- U. Nõmmik, \"Vana Testamendi mõistmise eeldusi\" - Minu Issand ja minu Jumal! Pühendusteos Dr. theol. Toomas Pauli 70. sünnipäevaks. J. Lahe, T. Pädam, koost. EELK UI toimetised 20 (Tallinn, 2009), lk 13-24, vt siit: http://www.academia.edu/1642320/Vana_Testamendi_moistmise_eeldusi\n-- C. Levin, Vana Testament (Tartu, 2013), lk 15-37.\n-- D.F. Ford, Teoloogia. Põgus sissejuhatus (Tartu, 2013), lk 171-223.\n-- U. Nõmmik, \"Vanaheebrea luule poeetika, juhatuseks\" - Methis. Studia humaniora Estonica 13, nr 16, 8-26. https://ojs.utlib.ee/index.php/methis/article/view/12450/7525\n-- U. Nõmmik, \"Piibel ja müüt - tõlge ja tõlgendus\" - Idakiri 2013, 19-33 (vt academia.edu).\n\nMEETODITEST\n-- J. Lahe, U. Nõmmik, \"Lühike sissejuhatus ajaloolis-kriitilisse meetodisse\" - Kirik & Teoloogia, nr 116, 28.2.2014 (vt http://kjt.ee/2014/02/luhike-sissejuhatus-ajaloolis-kriitilisse-meetodisse/).\n-- U. Nõmmik, \"Tants Vana Testamendi algteksti ümber\" - Kirik & Teoloogia, nr 24, 25.5.2012 (vt siit: http://kjt.ee/2012/05/tants-vana-testamendi-algteksti-umber/).\n---", "recommended_materials": "-- U. Nõmmik, R. Tasmuth, Sissejuhatus eksegeetikasse. Meetodiõpik tudengitele ja kiriku töötegijatele, EELK UI toimetised 14, (Tallinn, 2006; sirvimiseks, vt academia.edu).\n-- U. Masing, \"Vana Testamendi evangeelium\" - Meil on lootust (Tartu, 1998), lk 217-230.\n-- U. Masing, \"Deemonlik Jumal\" - Pessimismi põhjendus (Tartu, 1995), lk 9-29.\n-- Uuema evangeelse teoloogia põhitekstid (Tartu, 2013), järgmised tekstid: S. Kierkegaard, \"Kartus ja värin\" (lk 151-164); E. Troeltsch, \"Kristluse absoluutsus ja religioonilugu\" (lk 243-254); R. Otto, \"Püha\" (lk 271-279); R. Bultmann, \"Mis mõtet on kõnelda Jumalast?\" (lk 323-337); R. Bultmann, \"Uus Testament ja mütoloogia\" (lk 389-410).\n-- A. Annus, \"Vana Testament ja muistne Mesopotaamia\" - Idakiri 2011/2012, 7-19.\n-- \"Sissejuhatus Mišnasse ja traktaati \"Sabat\" (Šabbat)\" - Mišnatraktaat \"Sabat\", tlk K. Kasemaa. Piibel kontekstis 2 (Tartu, 2015), 9-46.\n-- Isad. Talmudi 4. osa 9. traktaat. Loomingu Raamatukogu 6/1990.\n-- D. Ben-Amos, Kommunikatsioon ja folkloor. SATOR 9 (Tartu, 2009), palun lugeda järgmistest artiklitest vähemalt kolm: \"'Kontekst' kontekstis\" (lk 27-45), \"Analüütilised kategooriad ja etnilised žanrid\" (lk 89-116), \"Kas folklooris on üldse motiive?\" (lk 206-224), \"Juudi huumori \"müüt\"\" (lk 225-244), \"Žanrieristused haggadas\" (lk 245-278).\n-- M. Oeming, Contemporary Biblical Hermenutics: An Introduction (Aldershot, 2006)."}, "participants": {"lecturers": [{"person_uuid": "e2c8a9f5-6022-fee1-1c6a-d43c442ba744", "person_name": "Urmas Nõmmik", "structural_unit": {"code": "HVUS05", "name": {"en": "Chair of the Old Testament and Semitic Studies", "et": "Vana Testamendi ja semitistika õppetool"}, "address": "Ülikooli 18 - 309\n50090 Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "street": "Ülikooli 18 - 309", "zip": "50090", "level": 3, "academic": true, "supports_continuous_learning": false, "parent_code": "HVUS"}, "is_responsible": true, "is_teaching": true}, {"person_uuid": "9fdfd23c-cfe4-cebd-1428-b41a93f99a86", "person_name": "Diana Tomingas", "structural_unit": {"code": "HV", "name": {"en": "Faculty of Arts and Humanities", "et": "humanitaarteaduste ja kunstide valdkond"}, "address": "Tartu linn, \nTartu linn, Tartumaa \nEST", "city": "Tartu linn", "level": 1, "academic": true, "supports_continuous_learning": true}, "is_responsible": false, "is_teaching": true}]}, "schedule": {"weeks": {"et": "2, 4, 6, 8, 10, 12, 14, 15, 18, 20"}, "entries": [{"time": "2018-09-13", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus 1: sakraaltekstid kui tüvitekstid; kontekstuaalsus, kultuuriga seotud, eksistentsiaalsed ja religioossed küsimused.\nVt   \nLugeda läbi Iiobi raamat U. Nõmmiku tõlkes.\n-- Kodutöö nr 1: sõnastada viis aspekti, mis teie arvates iseloomustavad tänapäeva Eesti kontekstis küsimusi ja ootusi sakraaltekstidele (Piiblile)? Põhjendada lühidalt (max 1 lk) (tähtaeg 23.9.).\n---"}}, {"time": "2018-09-27", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus 2: teksti uurimise meetodid; kirjandusteadus, kirjandus-, vormi- ja traditsioonikriitika; kirjandus, abivahendid; tekstilugemise harjutus.\nVt Eksegeetika õpik (õppematerjalide all).\nVt USUS.06.137/Iiob ja ajalugu.pdf\n-- Kodutöö nr 2: lugeda Ii 1-2 ja 42,7-17 ning markeerida teksti sisulised raskuspunktid (kasutades konkreetsete võtmesõnade abi) ja nende najal sõnastada (hermeneutiliselt), miks peaks see tekst olema meile tänapäeval aktuaalne. Tulemus vormistada ühel lk-l (tähtaeg 7.10.).\n---"}}, {"time": "2018-10-11", "work_type": {"code": "lecture", "et": "loeng", "en": "lecture"}, "topic": {}, "description": {"et": "Sissejuhatus 3: tarkuskirjanduse žanr, vanaheebrea luule vorm, Iiobi raamatu ülesehitus.\n-- Kodutöö nr 3: koostada Ii 22 ülesehituse skeem. Näidet ülesehituse skeemi kohta näeb siin: USUS.06.137/Ii 4-5.retooriline analyys.tabel.doc (tähtaeg 21.10.). \n---"}}, {"time": "2018-10-25", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Lektüür ja analüüs 1: vanaheebrea Iiobi raamat (1).\n-- Kodutöö nr 4: sõnastada Ii 4-5 ja 21 (Nõmmiku tõlkes) põhjal vähemalt kolm hermeneutilist küsimust ja lühidalt põhjendada, miks need. Kaks teksti on antud, et nende võrdlemise abil üldinimlikke küsimusi selgemalt näha. Hermeneutiline peab olema seotud minu või meie kui lugeja(te)ga, kui inimesega, rahvaga, inimkonnaga (tähtaeg 4.11.).\n---"}}, {"time": "2018-11-08", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Iiobi retseptsioon 1: Iiob islamis. Külalisloeng prof Stefan Schreinerilt (Tübingen).\n-- Kodutöö nr 5: lugeda \"ludlul bel nemeqi\" ning sõnastada: 1) vähemalt kaks küsimust, millistele on autor(id) oma teksti kirjutamisega tõenäoliselt vastanud; 2) vähemalt üks asjaolu, mis iseloomustab kirjutajate konteksti, nt jälgida, kellele võiks olla tekst suunatud ja mida tahab tõestada; 3) üks oluline erinevus võrreldes Piibli Iiobi raamatuga (tähtaeg 18.11.).\n---"}}, {"time": "2018-11-22", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Lektüür ja analüüs 2: vanaheebrea Iiobi raamat.\n-- Kodutöö nr 6: Lugeda läbi [tekst selgub varsti]. Selle ja VT Iiobi võrdluse põhjal: 1) märkida ära täpne VT Iiobi lõik (salminumbritega), mida [tekst] parafraseerib, 2) reflekteerida, kas on põhimõttelisi teoloogilisi või tõlgenduslikke muutusi Jumala ja Iiobi suhete kirjelduses, Iiobi vagaduse kirjelduses, saatana kirjelduses. (tähtaeg 02.12.).\n---"}}, {"time": "2018-12-06", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Lektüür ja analüüs 3: Iiob muistses Mesopotaamias. Loeng Andreas Johandilt ja arutelu tekstinäite üle.\n-- Kodutöö nr 7: Kirjeldada kokkuvõtlikult, kuidas [tekst selgub hiljem] kirjeldab saatana rolli Iiobi raamatus (tähtaeg 11.12.).\n---"}}, {"time": "2018-12-13", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Iiobi retseptsioon 2: Iiob judaismis. Loengud Diana Tomingaselt ja Anu Põldsamilt.\n-- Kodutöö nr 8: Koraanis esineb Iiob neli korda (4.163; 6.84; 21.83-84; 38.41-44). Esitada kolm teesi selle kohta, kuidas ja millises ulatuses kajastub Koraanis sisuline (teoloogiline-hermeneutiline) nihe võrreldes Vana Testamendiga (võib viidata ka kreeka Iiobile ja Iiobi Testamendile) (tähtaeg 20.12.).\n---"}}, {"time": "2019-01-03", "work_type": {"code": "practice", "et": "praktikum", "en": "practical session"}, "topic": {}, "description": {"et": "Iiobi retseptsioon 3: Iiob kristluses. Loeng Ergo Naabilt ja arutelu tekstinäite üle.\n-- Kodutöö nr 9: (kursuse lõputöö):\n1) koostada viimase Iiobi kõne (Ii 29-31) elementaarne ülesehituse analüüs (skeem, vihje: hea on jagada kõne esmalt kolme suurde ossa);\n2) määrata kõne kolme suure osa sisulised raskuspunktid (mis eristab osi, mis seob);\n3) lisada enda mulje, kas kõne on tekkeloo poolest ühtne või saaks väita mitut autorit (ja miks);\n4) vastata küsimusele, kas siinne kõne erineb sisuliselt (eriti hermeneutiliselt) oluliselt ülejäänud Iiobi kõnedest või mitte;\n5) esitada oma arvamus, kas siinsel kõnel on tänapäeval hermeneutiline väärtus ehk et kas seda saaks tänapäeval kuidagi millegi seletamisel või mingist elunähtusest rääkimisel kasutada (tähtaeg 13.1.).\n---"}}, {"time": "2019-01-17", "work_type": {"code": "colloquium", "et": "kollokvium", "en": "colloqium"}, "topic": {}, "description": {"et": "Lõpuarutelu: sakraaltekst ja meie.\n---"}}]}, "registration_info": {"audience": {"et": "religiooniuuringud"}}, "parent_uuid": "03a82c5d-0d71-0137-6b49-4311afd20393", "parent_code": "USUS.06.137", "parent_credits": 6, "_actions": {"is_moodle_editable": false, "is_editable": false, "is_deletable": false}}