{"KURSUSE_NIMI": "Sisehaigused koos nakkushaigustega", "KURSUSE_KOOD": "AR00.00.034", "EAP": 7, "KURSUSE_TYYP": "Kompleksaine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 182, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine jooksul omandavad üliõpilased põhilised teadmised sisehaiguste propedeutikast, reumatoloogiast, endokrinoloogiast, gastroenteroloogiast, hematoloogiast, kardioloogiast, nefroloogiast, pulmonoloogiast ja infektsioonhaigustest. \n\nVt.aineregistris aineid ARSK.05.005, ARSK.01.033, ARSK.04.002Objectives/eesmärkid:  Aine jooksul peaksid üliõpilased omandama põhilised teadmised sisehaiguste propedeutikast, reumatoloogiast, endokrinoloogiast, gastroenteroloogiast, hematoloogiast, kardioloogiast, nefroloogiast, pulmonoloogiast ja infektsioonhaigustest. Vt. ained: ARSK.05.005, ARSK.01.033, ARSK.04.002, ARKA.01.044Learning outcomes/õpiväljund:  .Kursuse edukalt läbinud üliõpilased:  1)tunnevad kliinilise meditsiini põhiterminoloogiat 2)oskavad haiget küsitleda haige kaebuste, haiguse anamneesi ning üldanamneesi raames 3)oskavad interpreteerida anamneesist saadud andmeid 4)oskavad hinnata haige üldseisundit ning uurida füüsikaliselt patsiendi kardiovaskulaarsüsteemi ning hingamissüsteemi 5)teavad, kuidas teostada haige üldine füüsikaline läbivaatus ning millised on enamkasutatavate laboratoorsete ja instrumentaalsete uuringute diagnostilised võimalused 6)oskavad kanda ette haige anamneesi ning objektiivse uurimise tulemusi 7) omandavad üliõpilased põhilised teadmised tähtsamate infektsioonhaiguste diagnostika, ravi ja profülaktika põhimõtetest ning elementaarsed oskused infektsioonhaiguste käsitlemiseks. 8)   omandavad kardioloogia põhiteadmised ja ülevaate südamehaiguste diagnostika, ravi ja preventsiooni põhiprintsiipidest ning kardioloogiliste haiguste ja stomatoloogiliste haiguste vahelistest seosetest. 9) omandavad põhilised teadmised reumatoloogiast, endokrinoloogiast, gastroenteroloogiast, hematoloogiast, kardioloogiast, nefroloogiast, pulmonoloogiast."}