{"KURSUSE_NIMI": "Kriitilised seisundid erakorralises meditsiinis", "KURSUSE_KOOD": "ARAI.01.054", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sisehaigused", "Kirurgia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 27, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine põhitähelepanu on pööratud kriitilises seisundis olevale erakorralisele haigele. Osalemise eelduseks on arstiõppe nelja esimese kursuse läbimine. Üliõpilased õpivad antud aines  tundma erakorralise meditsiini organisatsiooni ja patsientide tiraaži põhimõtteid, omandavad eluohtlike sündroomide diagnostika ja ravi alused ning treenitakse taaselustamisvõtteid. Üliõpilane omandab raske trauma ja erakorralise kirurgilise haiglakäsitluse põhimõtted. Iseseisva tööna osalevad üliõpilased intensiivravi osakonna ravitöös ning esitavad arvestusel haigusloo. Omandatud oskuste ja teadmistega on üliõpilane valmis siirduma 6. kursuse praktikale erakorralise meditsiini osakonnas, kus omandatakse edasised oskused ja teadmised antud erialal.Objectives/eesmärkid:  Erakorralise meditsiini akuutseim osa on kriitilises seisundis haige. Õppeaine eesmärk on  kriitilises seisundis haigete äratundmine, diferentsiaaldiagnostika ning esmaste ravivõtete omandamine.  Õpitakse tundma erakorralise meditsiini korraldust, sh haigete  triaaži põhimõtteid, omandatakse eluohtlike sündroomide (šokk, äge hingamispuudulikkus, äge neerupuudulikkus, eluohtlikud südame rütmihäired, sepsis, kooma) diferentsiaaldiagnostika ning esmane käsitlus. Omandatakse erakorralise kirurgilise haige (sh raske trauma) esmase käsitluse põhimõtted.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane  \n-  tunneb ära kriitilises seisundis haige;\n-  oskab kriitilises seisundis haige esmast käsitlust;\n-  orienteerub erakorralise meditsiini korralduses, tunneb erakorralise meditsiini osakonna\n    haigete triaaži põhimõtteid;\n-  teab raske trauma haige esmast käsitlust statsionaaris;\n-  tunneb erakorralise kirurgilise haige käsitluse põhimõtteid;\n-  suudab eristada eluohtlikke südame rütmihäireid ning neid ravida;\n-  oskab täiskasvanute elustamisvõtteid (kaudne südamemassaaž, vabade  \n    hingamisteede tagamine, südame defibrillatsioon, ravimite manustamine);\n-  suudab korrektselt esitada lühikokkuvõtte haigusloost. Additional information from secretary of the clinic, L. Puusepa 8, G1.1.209, phone or from lecturers."}