{"KURSUSE_NIMI": "Anestesioloogia ja erakorraline meditsiin", "KURSUSE_KOOD": "ARAI.01.050", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Üldkirurgia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 7, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab ülevaate anesteesia meetoditest ja põhimõtetest, haige ettevalmistusest anesteesiaks, haige käsitlusest pärast anesteesiat. Erakorralise meditsiini osas pööratakse peamist tähelepanu kriitilises seisundis olevale haigele. Käsitletakse hambaarsti praktikas ettetulevate kriitiliste situatsioonide - hingamisteede sulgus, anafülaktiline šokk, südameseiskus - ravialgoritme. Läbitakse elustamisvõtete praktiline treening, õpitakse tundma eluohtlikke südame rütmihäired ja nende ravipõhimõtteid.Objectives/eesmärkid:  Kursus käsitleb kriitiliste seisundite diagnostikat ja ravi, elustamist kliinilisest surmast, anesteesia põhimõtteid ja patsientide jälgimist operatsioonitoas ning hingamisteede käsitlemise meetodeid.Learning outcomes/õpiväljund:  Sagedasemate eluohtlike seisundite diagnostika ja ravi. Elustamisjuhiste tundmine ja rakendamine. \nAnesteesiameetodite tundmine ja patsiendi jälgimine perioperatiivses perioodis. Hingamisteede käsitlus üldarstile vajalikul tasemel. Loengud toimuvad auditoorselt vastavalt tunniplaanile.\nPraktikumide kestvus on 2 tundi. Praktikumid toimuvad L. Puusepa 8, operatsiooniosakonnas (G-korpus, III korrus) või anestesioloogia ja intensiivravi kliiniku õpperuumides G1.2 203, G1.2 204, G1.1214, G1.404 või Simulatsioonikeskuses. Haiglas liikumiseks on vajalikud vahetusjalatsid, arstikittel. Üleriided jätta peasissekäigu juures olevasse riidehoidu.  Vajalik lisainformatsioon kliiniku sekretärilt L. Puusepa 8, G1.1 209, telefon 7318 405 või õppejõududelt. Palume jälgida Kliinilise meditsiini instituudi ja Tartu Ülikooli Kliinikumi juhiseid."}