{"KURSUSE_NIMI": "Biokeemia", "KURSUSE_KOOD": "ARBK.01.029", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 8, "seminar": 18, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Arstiteaduskonna biokeemia on õppeaine, mille vältel tutvutakse metaboliitide ja teiste inimorganismi biomolekulide klassifikatsiooni ja nomenklatuuriga, omandatakse antud ühendite konfiguratsiooni, konformatsiooni ning stereokeemia põhialused. Kursuse põhitähelepanu on pööratud inimese metabolismis toimuvatele põhireaktsioonidele ning nendes osalevatele heterofunktsionaalsetele ja heterotsüklilistele metaboliitidele. Samuti käsitletakse biomakromolekulide, nagu peptiidide, valkude, süsivesikute, lipiidide ja nukleiinhapete ülesehitust ning biokeemilis-meditsiinilisi omadusi. Antud õppeaine viimane osa käsitleb segamakromolekule ning raku välismembraani ehitust. Kursus on üles ehitatud meditsiinikeskselt, st. reaktsioonide ja metaboloomi moodustavate biomolekulide näited on valitud inimorganismist lähtuvalt, kusjuures põhitähelepanu on pööratud nende reaktsioonide mehhanismidele, millel baseerub tänapäevase meditsiini diagnostika ja ravi.Objectives/eesmärkid:  Arstiteaduskonna biokeemiakursus on meditsiinipõhine õppeaine tutvustamaks inimorganismi madalmolekulaarsete metaboliitide ja kõrgmolekulaarsete biomolekulide ehitust, nende funktsionaalsete rühmade reaktiivsust ja tähtsamaid inimorganismis toimuvaid reaktsioone. (Sisuliselt on õppeaine: Meditsiinilise metaboloomika alused) Antud õppeaine õpetamise eesmärgiks on varustada tudengid meditsiinilise metaboloomika põhise baasmaterjaliga inimorganismi bioaktiivsete molekulide kohta, mis annab tudengitele hea lähtekoha meditsiinilise biokeemia ning ka teiste järgnevate kursuste (füsioloogia, farmakoloogia, patofüsioloogia, mikrobioloogia, kliinilise biokeemia jne.) omandamisel.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - tunneb inimorganismi ehitust ja talitlust nii tervikuna kui kõikidel tema organisatsioonitasemetel ning oskab asetada neid teadmisi kliinilisse konteksti (aine õpiväljundid vastavad õppekava mooduli \"Erialaained\" õpiväljundite punktile 1 a); - tunneb ja eristab inimorganismi biomolekulide põhilisi aineklasse ning oskab anda antud ühenditele nimetusi süstemaatilise nomenklatuuri (IUPAC) järgi; - teab ja oskab kasutada inimorganismi biomolekulide ülesehituse ja stereokeemia põhimõisteid; - teab ja oskab kirjutada põhilisi inimorganismis toimuvaid tüüpreaktsioone; - tunneb biomolekulide (tähtsamate metaboliitide, peptiidide, valkude, sahhariidide, lipiidide ja nukleiinhapete) ülesehitust, teab nende biofunktsioone ja meditsiinilist tähtsust; - teab rakumembraani ülesehitust ning membraanide bioloogilist ja meditsiinilist tähtsust; - orienteerub meditsiinilise metaboloomika ja bioorgaanilise keemia põhimõistete valdkonnas, oskab tuua nendekohaseid näiteid ja kasutada neid teadmisi ravimite ja teiste bioaktiivsete molekulide funktsionaalsuse kirjeldamiseks."}