{"KURSUSE_NIMI": "Meditsiiniline biokeemia", "KURSUSE_KOOD": "ARBK.01.043", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 7, "seminar": 34, "colloquium": 0, "web_learning": 0, "independent_work": 65, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursus annab üliõpilastele baasteadmised kaasaegsest meditsiinilisest biokeemiast ja arendab biokeemilis-kliinilist mõtlemist. Käsitlemist leiavad järgmised teemad: a) inimorganismi baasbiomolekulid, nende struktuur ja biofunktsioonid; b) vitamiinid ja hormoonid ning inimorganism (sh vitamiinide meditsiiniliste preparaatide teaduspõhine analüüs); c) ülevaade süsivesikute, lipiidide, amino- ja nukleiinhapete metabolismist; d) ksenobiootikumide (sh ravimite) detoksikatsiooni biokeemiline taust; e) toitainete roll inimorganismis ja toitumispõhimõtete teaduspõhine analüüs.Objectives/eesmärkid:  Õppeaine peamisteks eesmärkideks on: a) Anda nüüdisaegsel tasemel ja praktilises töös olulisi teadmisi inimorganismi biomolekulidest ja metaboolsetest protsessidest, millel põhinevad inimorganismi rakkude spetsiifilised                           funktsioonid ja tegevuse häired. b) Anda nüüdisaegseid ja inimorganismile orienteeritud biokeemilisi baasteadmisi vitamiinide, mineraalide (sh nende meditsiiniliste preparaatide), toidulisandite ja lisaainete (E-ainete) kohta ning analüüsida toitumise farmatseutiliselt tähtsaid aspekte. c) Arendada üliõpilastel biokeemilis- farmatseutilist mõtlemist                           ja luua baas biokeemilise vilumuse kasutamiseks tulevases praktikas.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: \r\n- on omandanud nüüdisaegsel tasemel ja praktilises töös olulised teadmised inimorganismi biomolekulidest ja metaboolsetest protsessidest, millel põhinevad inimorganismi rakkude spetsiifilised funktsioonid ja tegevuse häired;\r\n- oskab kasutada nüüdisaegseid ja inimorganismile orienteeritud biokeemilisi baasteadmisi vitamiinide, mineraalide (sh nende meditsiiniliste preparaatide), toidulisandite ja lisaainete (E-ainete) kohta;\r\n- on võimeline teaduspõhiselt analüüsima toitumise olulisi aspekte ning kasutama \r\nbiokeemilis- farmatseutilist lähenemist ja omandatud biokeemilise analüüsi vilumust praktikas."}