{"KURSUSE_NIMI": "Granuleerimise ja tableteerimise tehnoloogia", "KURSUSE_KOOD": "ARFA.02.126", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Farmatseutilised abiained", "Farmatseutiline keemia I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 4, "independent_work": 32, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate: a) granulatsiooni ja pelletite moodustumise teooriast, b) granulatsioonil kasutatavate oluliste materjalide iseloomustamisest, c) pihustuskuivatamisest, d) superktiitilise vedeliku tehnoloogiast, e) kõrgnihke granulatsiooni, fluidisatsiooni ja valtspress granulatsiooni tehnoloogiatest, f) granulatsiooniprotsessi lõpp-punkti määramisest, g) pelletite tootmise tehnoloogiast, h) tabletide pressimisest ja pressitavate osakeste vahel sidemete moodustumisest, i) tablettide pressimisel olulistest valemitest...j) tableteerimisel kasutatavatest aparaatidest, k)granultsiooni ja tableteerimise PAT-ist ja PIT-ist.Objectives/eesmärkid:  Kursuse eesmärgiks on anda kursusle osalejatele kõrgel tasemel teadmisi farmaatsias kasutatavate kuiv- ja märggranuleerimisetenoloogiatest (kaasa arvatud pelletite tootmise tehnoloogiast) ja tabletide pressimisest. Kursus käsitleb graanulite ja pelletite moodustumise ja kasvamise mehhanisme, granulatsiooniprotsessi kontrollli ja monitoorimise süsteeme, granulatsiooni PAT-i ja PIT-i, tablettide pressimise parameetreid ja tabletide pressimise teooria valemeid ning granulatsiooni ja tableteerimise lõpproduktide iseloomustamist.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng tunneb: - granuleerimise ja pelletite moodustumise teooriat - osakeste moodustumise peamisi meetodeid ja tehnikaid - farmatseutilise kuiva ja märja granuleerimise põhimeetodeid - tableti pressimisel osakeste ja molekulide tasemel toimuvate muutuste teooriat - tableti pressimise põhiparameetreid ja tableti pressimise teooria põhivalemeid - PAT-i ja PIT-i olulisust granuleerimises pelletite moodustumises ja tableteerimises. Contact person: \nProf. Jyrki Heinämäki, Department of Pharmacy, room 715, tel. 7375281, \nemail - jyrki.heinamaki@ut.ee."}