{"KURSUSE_NIMI": "Praktiline sotsiaalfarmaatsia", "KURSUSE_KOOD": "ARFA.01.114", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Bioeetika", "Esmatasandi meditsiin", "Sissejuhatus laborimeditsiini", "Farmakoloogia", "Farmakognoosia III"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 48, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "1 osa\nAinekursuse jooksul käsitletakse järgmisi teemasid:\nTervishoiu- ja farmaatsiasüsteemi korraldus ja seadusandlus Eestis; farmaatsiaeriala ja farmaatsiaharidus Euroopas ja Eestis; ravimipoliitika Euroopas ja Eestis; tervishoiu rahastamine; ravimeid ja jaemüügiapteeke puudutav seadusandlus; turunduse mõisted ja meetodid.\n2 osa\nAinekursuse jooksul käsitletakse järgmisi teemasid:\nsotsiaalfarmaatsia, farmatseutilise hoole ja kliinilise farmaatsia olemus, seosed farmaatsias ja tervishoius; proviisorite kutse-eetika; ravimsuhtlemine apteegis; ravimiinfo ja selle olulisus tõhusa ravitulemuse saavutamisel; ravimsoostumus; ravimite kasutamise nõustamine praktiliste näidete põhjal.Objectives/eesmärkid:  1 osa Anda ülevaade Euroopa ja Eesti tervishoiu- ja farmaatsiasüsteemist, selle korraldusest ja  ravimitega seotud seadusandlusest. 2 osa Selgitada ravimite ohutuse kontseptsiooni ning sotsiaalfarmaatsia ja farmatseutilise hoole mõisteid ja rolli farmaatsiavaldkonnas. Teoreetiliste teadmiste ja praktiliste näidete varal luua ja kinnistada erialaseid teadmisi apteegikülastajate ja patsientide igakülgseks ravimialaseks nõustamiseks.Learning outcomes/õpiväljund:  1 osa\n- tunneb tervishoiu- ja farmaatsia korralduses ning vastavas seadusandluses kasutatavaid mõisteid; \n- oskab leida ja sisuliselt hinnata loetletud valdkondadesse puutuvat teavet; \n- on võimeline omandatud teadmisi süstematiseerima ja praktiliselt kasutama; oskab vajaliku teabe otsimisel kasutada infotehnoloogia võimalusi\n2.osa\n- tunneb sotsiaalfarmaatsia, farmatseutilise hoole ja ravimite ohutuse alaseid mõisteid; \n- oskab leida ja sisuliselt hinnata loetletud valdkondadesse puutuvat teavet; \n- on võimeline omandatud teadmisi süstematiseerima ja praktiliselt kasutama patsientide ravimialasel nõustamisel; oskab vajaliku teabe otsimisel kasutada infotehnoloogia võimalusi."}