{"KURSUSE_NIMI": "Farmatseutiline nanotehnoloogia", "KURSUSE_KOOD": "ARFA.02.141", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 0, "seminar": 4, "independent_work": 64, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "See kursus on mõeldud täiendavaks teadmiste omandamiseks nanoosaksestest valmistatud ravimite kandursüsteemide disainimise teaduslike printsiipide, meetodite, disaini, tootmise, kasutamise kohta. Tutvustatakse olemasolevaid ja arendatavaid tehnoloogiaid.\nKursuse käigus tutvutakse parenteraalsele, suukaudsete, lokaalsete, inhaleeritavate ja silma manustatavate (ja mitte ainult) nanotehnoloogial baseeruvate ravimite kandursüsteemidega ja nende kasutamisvõimalustega, neile esitatavate nõuete, nanobiotehnoloogial põhinevate ravimite hetkeseisu ja tulevikuperspektiividega.Objectives/eesmärkid:  Kursus annab ülevaate nanoosaksetel põhinevate ravimite kandursüsteemide uurimise teaduslikest meetoditest, nende disainimise ja tootmise hetkeseisust ning tulevikusuundadest.\nKursusel tutvustatakse nanotehnoloogial põhinevaid ravimite kandursüsteeme ja terapeutilisi lähenemisi, neile esitatavaid bioloogilisi nõudeid. Räägitakse nanobiotehnoloogia kohast nanoravimite arendamisel ja farmatseutilise nanotehnoloogia arengust.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane/doktorant:   - teab ravimite kandursüsteemide klassifikatsiooni ja nanoosakeste tüüpe; - omab ülevaadet erinevatest nano\tsüsteemidest, nende manustamisviisidest ja kasutamisest (kaasa arvatud geeniteraapia ja vaktsineerimine); - oskab nanosüsteeme iseloomustada, tunneb kasutatavaid materjale, tehnoloogiaid ning nende valmistamisega seotud probleeme; - teab nanoterapeutiliste vahendite kasutamise bioloogilisi nõudeid; - tunneb modifitseeritud vabanemisega ravimite kandursüsteeme; - teab nanosüsteemidega seotud nanotoksilisusest ja regulatoorsetest aspektidest; - mõistab arendatud nanosüsteemidega seotud intellektuaalse omandi küsimusi. Kontakt isik / Contact person - prof. Jyrki Tapio Heinämäki (vastutav/responsible)\nProf. Jyrki Heinämäki, Institute of Pharmacy, room 715, tel. 7375281, email -  jyrki.heinamaki@ut.ee"}