{"KURSUSE_NIMI": "Käsimüügiravimite ja teiste apteegikaupade kasutamise nõustamine üldapteegis", "KURSUSE_KOOD": "ARFA.01.120", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 64, "individual_work": 40, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Proviisoriõppe neljanda kursuse lõpetamise järel saavad üliõpilased üldapteegis praktiseerida oma teadmisi ja oskusi käsimüügiravimite ja teiste apteegikaupade kasutamise nõustamisel. Nõusolek valikaine ajal üliõpilast juhendada ning valikaine läbimine kooskõlastatakse apteegi juhataja ja Tartu Ülikooli farmaatsia instituudi poolse juhendajaga. Üliõpilasel on valikaine läbimisel apteegis juhendaja, kellega koos teostatakse käsimüügiravimite alast nõustamist. Piisavate teadmiste olemasolul ja pärast vastavate teadmiste kontrollimist juhendaja poolt võib üliõpilane teisi apteegikaupu väljastada ka iseseisvalt. NB! Valikaine ei asenda kohustusliku õppeaine Apteegipraktika käsimüügiravimite ja teiste apteegikaupade moodulit!Objectives/eesmärkid:  Võimaldada proviisoriõppe üliõpilastel täiendada praktiliselt käsimüügiravimite ja teiste apteegikapuade kasutamise alast nõustamist üldapteegis.Learning outcomes/õpiväljund:  Kursuse lõppedes on üliõpilasel  -\ttäienenud teadmised ja oskused sagedamini kasutatavate käsimüügiravimite ja teiste apteegikaupade kohta, -\toskus nõustada erinevaid patsiendigruppe erinevate käsimüügiravimite ja apteegikaupade kasutamise detailide kohta, -\toskus kasutada erinevaid infoallikaid ja leida kiiresti täiendavat infot käsimüügiravimite ja teiste apteegikaupade kasutamise detailide ja kohta Valikaine toimub paralleelselt üliõpilase töötamisega üldapteegis (nt suvevaheajal), valikaine toimumise aeg fikseeritakse apteegijuhataja poolt allkirjastatud vormil, kuid ei saa olla lühem kui üks kuu ja min 2 tundi päevas. Selle aja jooksul toimub käsimüügiravimite nõustamine koos apteegipoolse juhendajaga. Kui üliõpilane töötab või juba on töötanud klienditeenindajana, siis teiste apteegikaupade nõustamine toimub vastavalt eelnevalt apteegis kokku lepitule."}