{"KURSUSE_NIMI": "Biofarmaatsia", "KURSUSE_KOOD": "ARFA.02.144", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Farmakoloogia", "Farmakoteraapia", "Füüsikaline farmaatsia", "Farmatseutiline tehnoloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 60, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Biofarmaatsia on ravimitega seotud teaduseid ühendav õppeaine. See hõlmab endas teadmisi anatoomiast, füsioloogiast, patofüsioloogiast, farmakoloogiast, keemiast, farmatseutilisest  tehnoloogiast, füüsikalisest farmaatsiast, farmakoteraapiast ning kliinilisest meditsiinist. Biofarmaatsia põhiülesanne on uurida ravimpreparaatide käitumist organismis (raviaine vabanemine, imendumine, jaotumine, biotransformatsioon, eritumine) ja neid mõjutavaid tegureid. Nende protsesside tundmaõppimise käigus mõistad Sa toimeaine, ravimpreparaadi ja manustamistee omaduste tähtsust toimeaine farmakokineetikale ja toimele. Lisaks seod neid teadmisi varasemalt õpitud farmatseutilise tehnoloogia, farmakoloogia ja kliiniliste õppeainetega. Kursuse järgselt oskad Sa rakendada saadud biofarmatseutilisi teadmisi igapäevases proviisoritöös.Objectives/eesmärkid:  Biofarmaatsia kursuse eesmärk on selgitada Sulle biofarmaatsia põhiteadmisi uurimismeetoditest ja nende rakendamisest ravimite biofarmatseutiliste omaduste võrdlemisel ja hindamisel. Biofarmaatsia kursuses käsitletakse farmakokineetilisi põhitõdesid lähtudes ravimpreparaadist ning manustamisteest ja - viisist. Materjali omandamine on oluline mõistmaks ja ühendamaks omavahel farmatseutilise tehnoloogia ja kliinilise meditsiini õppeained. Biofarmaatsia kursuse käigus tuleb Sul oma teadmisi esitada kahel erineval moel: kasutades erialaspetsiifilist oskusteavet suhtluses erialaspetsialistidega ning igapäevast kõnekeelt suhtluses apteeki külastavate patsientidega.Learning outcomes/õpiväljund:  Peale kursuse läbimist üliõpilane: -\tmõtestab ja analüüsib biofarmaatsia ja selles käsitletavate teemade rolli ravimiarenduses; -\tanalüüsib toimeaine vabanemist ja lahustumist, neid mõjutavaid faktoreid ning hindab nende mõju ravimi farmakokineetikale, biosaadavusele ja toimele. -\tanalüüsib ja hindab ravimvormi ja manustamistee/-viisi mõju ravimi farmakokineetikale, biosaadavusele ja toimele;  -\toskab tuua näiteid, selgitada ja anlüüsida, kuidas patsientide anatoomilis-füsioloogilised ja käitumuslikud eripärad võivad ravimi farmakokineetikat, biosaadavust ja toimet mõjutada;  -\tselgitab, millised on farmakokineetika ja farmakodünaamika vahelised seosed ning analüüsides muutuseid farmakokineetikas, oskab selgitada võimalikke muutuseid ravimi toimes; -\toskab patsiente ja erialaspetsialiste nõustada (sh otsida või luua infomaterjale) ravimite manustamisega seotud aspektides, tuues välja biosaadavust ja ravi efektiivsust mõjutavad faktorid, seejuures oskab teha koostööd ja kasutab sobivat erialaterminoloogiat."}