{"KURSUSE_NIMI": "Tööstusfarmaatsia", "KURSUSE_KOOD": "ARFA.02.147", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse eesmärgiks on anda esmased teadmised farmaatsiatööstuse kui majandusharu toimimisest. Tutvustatakse farmaatsiatööstuse toimimise põhiprotsesse nagu tootearendus, tööstuslike tehnoloogiate väljatöötamine, kvaliteedi tagamine ja kontroll, pakkimissüsteemid, õigusaktid ja normatiivdokumendid, tootmisüksuse disain, hulgimüügi korraldamine, kliiniliste katsete korraldamine ja ravimite turustamisstrateegiate väljatöötamine.Objectives/eesmärkid:  Kursuse eesmärgiks on anda esmased teadmised farmaatsiatööstuse kui majandusharu toimimisest. Tutvustatakse tootearendust, tööstuslike tehnoloogiate väljatöötamist, kvaliteedi tagamise- ja kontrollisüsteeme, õigusakte ja normatiivdokumente jm ravimite tööstusliku tootmise põhietappe kuni kvaliteetse ravimi jõudmiseni lõpptarbijani.Learning outcomes/õpiväljund:  Kursuse lõpetaja: -\tteab farmaatsiatööstuse põhifunktsioone ja -operatsioone  -\tomab ülevaadet ravimiarendusest, ravimpreparaatide väljatöötamisest ning ravimite tööstuslikust tootmisest ja pakkimisest -\tteab kvaliteedi tagamise ja kontrolli põhiprintsiipe ning standardeid (k.a Good Manufacturing Practices, GMP ja Good Laboratory Practices, GLP) -\tomab ülevaadet EU ja kohalikest normatiivdokumentidest ning õigusaktidest, mis on seotud farmaatsiatööstusega  -\tteab ravimitega seotud hulgimüügiprotseduure -\tteab ravimitega seotud turustamisstrateegiaid ja -praktikat. Prof. Jyrki Heinämäki (responsible).\nContact person: \nProf. Jyrki Heinämäki, Institute of Pharmacy, room 715, tel. 7375281, email. jyrki.heinamaki@ut.ee\n\nTeachers/Õppejõud:\nProf. Jyrki Heinämäki (JH), Dots. Urve Paaver (U.P.), Prof. Anne Juppo (AJ) (University of Helsinki), Dr. Mia Sivén (MS) (University of Helsinki)"}