{"KURSUSE_NIMI": "Farmatseutilised abiained", "KURSUSE_KOOD": "ARFA.02.103", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Üldine ja anorgaaniline keemia", "Biofüüsika", "Analüütiline keemia", "Meditsiiniline biokeemia", "Orgaaniline ja bioorgaaniline keemia", "Inimese füsioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 33, "colloquium": 0, "web_learning": 0, "independent_work": 65, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ravimpreparaatides sisalduvate abiainete ülesandeks on farmakoloogiliselt aktiivsete ainete sobivasse ravimvormi viimise kõrval ka patsientidele manustatavate preparaatide tootmise võimalikuks tegemine või lihtsustamine. Ravimpreparaatide biofarmatseutilised omadused sõltuvad suurel määral kasutatavatest abiainetest. Abiaineid ei käsitleta enam inertsete inaktiivsete ingredientidena, nende iseloomustamisel lähtutakse füüsikaliste ja keemiliste omaduste detailse tundmise kõrval ka nende ohutusest, funktsionaalsusest ning regulatoorsest staatusest.\nKäesoleva õppeaine esitamine järgib \"Handbook of Pharmaceutical Excipients\" toodud süsteemi. Abiainete klassifikatsioon järgib omakorda EP ravimvormide klassifikatsiooni.Objectives/eesmärkid:  Kursuse eesmärgiks on õppida tundma farmatseutiliste abiainete erinevaid funktsionaalsusi ja olulisemaid füüsiko-keemilisi omadusi.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - tunneb ja teab ravimpreparaatide disainimisel kasutatavaid abiaineid ja teab nende olulisemaid füüsiko-keemilisi omadusi; - tunneb abiainete funktsionaalsuse tõestamise meetodeid; - oskab seostada erinevate abiainete ja tehnoloogiliste võtete kasutamist saadava lõpp-produkti kvaliteediga; - tunneb võimalikke abiainete ja toimeainete vahelisi sobimatusi. Täpsem info kodutööde ja iseseisva töö kohta, juhendid ning ajakava on leitav Moodles\nSeminarid toimuvad vastavalt konkreetsele ajakavale (Moodle)."}