{"KURSUSE_NIMI": "Füüsikaline farmaatsia", "KURSUSE_KOOD": "ARFA.02.122", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Farmatseutilised abiained", "Farmakognoosia III", "Farmakoloogia", "Esmatasandi meditsiin"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ravimite biofarmatseutiline kvaliteet ja ravimvormi valmistamiseks vajalikud tehnoloogilised meetodid sõltuvad suurel määral raviainete ja abiainete füsikokeemilistest omadustest. Käesolev õppeaine käsitleb tahkete ainete ja dispersioonide (sh nanopreparaatide/ravimkandursüsteemide) füsikokeemilisi omadusi/parameetreid ning tutvustab erinevaid analüütilisi meetodeid, mis aitavad neid välja selgitada. Lähemalt räägitakse farmatseutiliste pulbrite ning kolloidsüsteemide füsikokeemilistest omadustest ja nende määramisest. Lisaks tutvustatakse uudseid protsessiaegse analüütilise tehnoloogia (PAT) meetodeid, mida on võimalik kasutada reaalajas protsesside jälgimiseks ning kontrollimiseks ravimpreparaatide tootmise ajal. Programm järgib Martin`i süsteemi ja EP ning USP füüsikaliste analüüsimeetodite klassifikatsiooni. Kursus koosneb tinglikult kahest osast. Kõigepealt selgitatakse tahke aine füsikokeemilisi omadusi, mis on olulised ravimpreparaatide valmistamisel. Teises osas uuritakse dispersioonide (sh nanopreparaatide ja ravimkandursüsteemide) füsikokeemilisi omadusi. Füsikokeemiliste omaduste määramiseks mõeldud analüütilised meetodid on toodud mõlema osa juures eraldi välja.Objectives/eesmärkid:  Füüsikalise farmaatsia kursuse eesmärk on selgitada proviisori eriala üliõpilastele ravimvormide disaini ja väljatöötamise füsikokeemilisi printsiipe, sealhulgas tutvustada ka raviainete ja abiainete füsikokeemiliste omaduste uurimiseks kasutatavaid analüütilisi meetodeid. Materjali omandamine on oluline mõistmaks ja ühendamaks omavahel farmatseutilise tehnoloogia, abiainete, ja biofarmaatsia kursustel saadud informatsiooni. Aine läbimisel oskab üliõpilane analüüsida ravi- ja abiainete olulisi füüsikalisi omadusi ja nende omaduste määramisvõimalusi ning seletada farmaatsias esinevaid nähtusi füüsikalise keemia seaduste ja printsiipide abil.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n- omab arusaama aine füsikokeemilistest omadustest, mida peab arvestama ravimpreparaatide disainil ja mis olulisel määral mõjutavad nende biofarmatseutilist kvaliteeti;\n- selgitab ja toob näiteid, miks need omadused on olulised farmaatsias (farmatseutilises tehnoloogias, biofarmaatsias);\n- teab enamlevinud raviainete ning abiainete uurimiseks kasutatavaid analüütilisi meetodeid;\n- ühendab ja selgitab, millist analüütilist meetodit ja millise omaduse uurimiseks või välja selgitamiseks saab kasutada;\n- selgitab, mis printsiibil mingi füsikokeemiline meetod põhineb;\n- oskab aktiivselt kaasa lüüa grupitöös, analüüsida töö tulemusi ja koostada raporteid\n- teab peamisi akadeemilise kirjatöö reegleid"}