{"KURSUSE_NIMI": "Kliiniline farmakoloogia", "KURSUSE_KOOD": "ARFR.02.026", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Farmakoloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 13, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse läbimisel peab üliõpilane teadma:\n1) Hambaravis kasutatavate ravimite (valuvaigistid, antiallergilised ained, lokaalanesteetikumid, põletikuvastased ained, kemoterapeutikumid) kliinilise kasutamise printsiipe.\n2) Ravimitest tingitud mürgistusi, nende vältimise ja ravii printsiipe. Polüfarmakoteraapia mõistet ja sisu.\n3) Ravimite kasutamise iseärasusi lastel, vanuritel, rasedatel, erinevate organpatoloogiatega patsientidel (neeru-, hingamiselunite-, maksa-, südamehaigused).\n4) Ravimitest tingitud kõrvaltoimeid (allergia) ning nende vältimise- ja raviprintsiipe.Objectives/eesmärkid:  1. Luua seoseid farmakoloogia-alaste baasteadmiste, kliinilise farmakoloogia ja farmakoteraapia vahel, arendada oskust rakendada baasfarmakoloogia-alaseid teadmisi praktikasse. 2. Õpetada kasutama infoallikaid ravimite ja farmakoteraapia kohta, hinnata kriitiliselt teabe tõenduspõhisust ning eristada objektiivset teavet reklaamist. 3. Arendada oskust põhjendatud ravimi valikuks, arvestades patsiendi iseärasusi ja ravimi omadusi. 4. Anda ülevaade ravimite kõrvaltoimetest.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane teab ja oskab kasutada kliinilise farmakoloogia ja tõenduspõhise meditsiini põhimõisteid ning oskab leida, kasutada ja kriitiliselt hinnata ravimite alast teavet.\nÜliõpilane oskab otsustada farmakoteraapia vajalikkuse üle, püstitada mõõdetava ravieesmärgi, valida ravimirühmade ja ravimite hulgast efektiivseima, ohutuima ravi, hinnata ravimi sobivust patsiendile, patsienti ravist teavitada ning ravi jälgida ning selle tulemuslikkust hinnata.\nKursuse läbinud üliõpilane oskab ära tunda ravimi kõrvaltoimet ning seda ravida.\nÜliõpilane teab hammmastega seotud haiguste ravimeid, nende toimeid ning kõrvaltoimeid."}