{"KURSUSE_NIMI": "Farmakoloogia", "KURSUSE_KOOD": "ARFR.02.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Inimese füsioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 48, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus omandab üliõpilane teadmised farmakoloogia üldküsimustes, saab süstematiseeritud ülevaate ravimirühmadest. Põhjalikumalt käsitletakse suuõõne ja hammastiku ravis kasutatavaid aineid, valuvaigisteid ja antibakteriaalseid aineid.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada olulisemate ravimite farmakokineetikat, farmakodünaamikat, kõrvaltoimeid ja põhilisi kasutusnäidustusi.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane teab farmakokineetika ja farmakodünaamika peamisi mehhanisme. Üliõpilane teab ravimirühmi ja nende esindajaid (INN nimetus). Üliõpilane tunneb olulisemate ravimite farmakokineetikat, farmakodünaamikat, kõrvaltoimeid ja põhilisi kasutusnäidustusi. Üliõpilane teab ravimi retseptis väljakirjutamise reegleid ja on võimeline õigesti ravimit retseptis välja kirjutama. Üliõpilane käib seminarides ainult oma rühmaga; rühmade vahetamist võib lubada vaid äärmise vajaduse korral ja väga mõjuvatel põhjustel, sellisel juhul tuleb teavitada seminari läbiviivat õppejõudu vähemalt 2 tööpäeva ette. \nKontrolltööd toimuvad kogu kursusele ühiselt tunniplaanis märgitud nädala reedel algusega kell 10.15 Biomeedikumi auditooriumis 1024. Kontrolltööde nädalatel on ette nähtud videoloeng ja iseseisev õpe ning auditoorset õppetööd (v.a kontrolltöö) ei toimu.\nKontaktõpe (auditoorsed loengud ja seminarid) toimub vastavalt dekanaadi ja/või õppeprorektoraadi juhistele. Farmakoloogia aine korraldust puudutavate muudatuste kohta teavitatakse üliõpilasi Moodle foorumi kaudu ja need kantakse ÕISi jooksvalt semestri jooksul."}