{"KURSUSE_NIMI": "Farmakoloogia ja toksikoloogia", "KURSUSE_KOOD": "ARFR.02.037", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Meditsiiniline mikrobioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 45, "colloquium": 0, "web_learning": 0, "independent_work": 65, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus selgitatakse farmakoloogia ülesandeid ja põhimõisteid, retseptorite tüüpe ja ravimspetsiifilisust. Selgitatakse farmakokineetika põhilisi mehhanisme: ravimite imendumine, jaotumine, biotransformatsioon ja eritumine. Käsitletakse farmakokineetika mudeleid ja parameetreid. Selgitatakse farmakoloogilise vastusega ravimitele seotud mehhanisme, peamiste ravimirühmade farmakodünaamikat ja farmakokineetikat, kasutamisprintsiipe ja kõrvaltoimeid. Samuti käsitletakse ravimite ohtlikke kõrvaltoimeid, rakukahjustuse ja rakusurma üldisi printsiipe, mutageneesi, kartsinogeneesi, teratogeensust ja allergilisi reaktsioone.Objectives/eesmärkid:  Kursuse eesmärgiks on anda üliõpilastele baasteadmised põhiliste ravimite või ravimrühmade farmakodünaamilistest toimetest. Üliõpilane teab kursuse lõpetamisel, kuidas ravimite primaarne farmakodünaamiline reaktsioon transformeerub sekundaarseks reaktsioonks ja kuidas seda kasutatakse haiguste ravis. Üliõpilane teab põhiliste ravimite farmakokineetilisi omadusi ja kuidas ravimi farmakokineetilised omadused määravad ravimite efektiivsuse ja toksilisuse. Üliõpilane teab põhiliste ravimite potentsiaalset toksilisust ja kõrvatoimeid, kõrvaltoimete mehhanisme ning nende vältimise printsiipe. Üliõpilane oskab ravimeid retseptis välja kirjutada vastavalt ravimiseadusele.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane teab farmakokineetika ja farmakodünaamika üldprintsiipe, tähtsamate ravimite toimeid ja toimemehhanisme nii molekulaarsel kui ka terve organismi tasandil. Üliõpilane teab ravimite põhirühmi ning rühmade tähtsamaid esindajaid. Üliõpilasel on iga ravimirühma esindaja kohta piisavalt teadmisi ravimi farmakokineetikast, farmakodünaamikast ja kõrvaltoimetest ning ta on võimeline põhjendama ravimi kasutamist teatud patoloogiliste seisundite korral. Üliõpilane teab, milliste mehhanismide kaudu ravimid avaldavad terapeutilist toimet ja kuidas ravimid võivad põhjustada kõrvaltoimeid ning oskab rakendada oma teadmisi kõrvaltoimete vältimiseks või korrigeerimiseks. Üliõpilane oskab töötada farmakoloogiaalase teadusliku kirjandusega ning on võimeline seda kriitiliselt analüüsima. Farmakoloogia eksam kevadel hõlmab ka sügissemestri materjali.\nÜliõpilane käib seminarides ainult selle rühmaga, kuhu ta dekanaadi poolt määrati. Juhul, kui üliõpilane ei saa mingil väga olulisel põhjusel oma rühmaga seminari või kontrolltööd teha, siis võib ta seda teha teise rühmaga, kuid selleks tuleb teavitada õppekorralduse spetsialisti vähemalt 2 tööpäeva ette, saates oma soovi tabeli kujul Hiie Sarve meilile (hiie.sarv@ut.ee). Vahetamine loetakse kinnitatuks, kui olete meilile vastuse saanud. Tabeli leiate õppematerjalide haldamise alt või Moodle'st. Tingimuseks on aga see, et teise rühma võib juurde tulla vaid kolm üliõpilast. Kui vastavast rühmast inimesi lahkub, siis saab sellevõrra ka teisest rühmast juurde tulla. Haigestumise korral peab üliõpilane teatama sellest kohe õppekorralduse spetsialistile ja esitama arstitõendi 5 tööpäeva jooksul pärast seminari.\nÜliõpilane peab igal seminaril kontrollima, et tema osavõtt seminarist on registreeritud. Hilisemaid pretensioone arvesse ei võeta. Üliõpilane peab seminaris osalema täisajaga, varem seminarist lahkumine võrdsustatakse seminarist puudumisega. Samuti ei tohi üliõpilane seminari hilineda."}