{"KURSUSE_NIMI": "Farmakoloogia", "KURSUSE_KOOD": "ARFR.02.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Inimese füsioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 48, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus omandab üliõpilane teadmised farmakoloogia üldküsimustes, saab süstematiseeritud ülevaate ravimirühmadest. Põhjalikumalt käsitletakse suuõõne ja hammastiku ravis kasutatavaid aineid, valuvaigisteid ja antibakteriaalseid aineid.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada olulisemate ravimite farmakokineetikat, farmakodünaamikat, kõrvaltoimeid ja põhilisi kasutusnäidustusi.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane teab farmakokineetika ja farmakodünaamika peamisi mehhanisme. Üliõpilane teab ravimirühmi ja nende esindajaid (INN nimetus). Üliõpilane tunneb olulisemate ravimite farmakokineetikat, farmakodünaamikat, kõrvaltoimeid ja põhilisi kasutusnäidustusi. Üliõpilane teab ravimi retseptis väljakirjutamise reegleid ja on võimeline õigesti ravimit retseptis välja kirjutama. Kõik võlgnevused tuleb likvideerida semestri viimasel nädalal (tuleb järele vastata puudutud seminarid ja teha uuesti negatiivsele hindele tehtud kontrolltööd). Kui üliõpilane haigestub järelevastamise nädalal, peab ta sellest koheselt teatama vastutavale õppejõule (dzamilja.safiulina@ut.ee) ja esitama arstitõendi järelevastamise nädalale järgneva 5 tööpäeva jooksul.\nÜliõpilane käib seminarides ainult selle rühmaga, kuhu ta dekanaadi poolt määrati. Juhul, kui üliõpilane ei saa mingil põhjusel oma rühmaga seminari või kontrolltööd teha, siis võib ta seda teha teise rühmaga, kuid selleks tuleb teavitada seminari läbiviivat õppejõudu vähemalt 2 tööpäeva ette. \nÜliõpilane peab seminaris osalema täisajaga, varem seminarist lahkumine võrdsustatakse seminarist puudumisega. Samuti ei tohi üliõpilane seminari hilineda."}