{"KURSUSE_NIMI": "Radioloogia (uurimismeetodid, radio-anatoomia, kliinilise radioloogia algkursus)", "KURSUSE_KOOD": "ARHO.01.033", "EAP": 4.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 40, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 51, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine käigus omandatakse erinevate radioloogiliste meetodite füüsikalised alused ja seadmete tööpõhimõte. Kursuse tulemusena teab üliõpilane põhiliste radioloogiliste uuringute läbiviimise metoodikat, diagnostilisi võimalusi ja puudusi, näidustusi ja vastunäidustusi,  patsiendi radioloogiliste uuringutele saatmise aluseid ja patsiendi ettevalmistamise aluseid, erinevate meetodite ohtusid röntgenoloogias, läbivalgustusuuringul, kompuutertomograafilistel, magnetresonantstomograafilistel, isotoop- ja angiograafilistel uuringutel. Teab kiirguskaitse põhiprintsiipe. Aine käigus omandatakse teadmised normanatoomiast rindkere  skeleti röntgenoloogias ja pea, rindlkere ja kõhu kompuutertomograafias, Aine jooksul omandatakse teadmised kaasaegse pildiarhiivisüsteemi võimalustest.Objectives/eesmärkid:  1.\tEesmärk on tutvustada radioloogiliste meetodite füüsikalisi aluseid ja tööpõhimõtet, nende kasutamist, diagnostilisi võimalusi, patsiendi uuringule saatmise näidustusi ja vastunäidustusi ning patsiendi uuringuks ettevalmistamist.  2.\tEesmärk on anda teadmisi radioloogilise pildi moodustamise ja salvestamise põhimõtetest  3.\tEesmärk on anda baasteadmisi kiirguskaitsest.  4.\tEesmärk on anda teadmisi normaalanatoomiast erinevate radioloogiliste meetodite korral ja radioloogilisest normaalleiust.Learning outcomes/õpiväljund:  1.\tÜliõpilane teab ja tunneb röntgenuuringute füüsikalisi aluseid, aparatuuri põhimõttelist ülesehitust ja toimimist, röntgenuuringutega seotud ohtudest, võimalustest ja puudustest, uuringu näidustustest ja vastunäidustustest. \n2.\tÜliõpilane teab patsiendi röntgenuuringule ettevalmistamist ja oskab patsiendile seletada uuringu läbiviimise metoodikat. \n3.\tÜliõpilane teab ja tunneb ultraheliuuringute füüsikalisi aluseid, aparatuuri põhimõttelist ülesehitust ja toimimist, ultraheliuuringutega seoses olevatest ohtudest, võimalustest ja puudustest, uuringu näidustustest ja vastunäidustustest. \n4.\tÜliõpilane teab patsiendi ultraheliuuringule ettevalmistamist ja oskab patsiendile seletada uuringu läbiviimise metoodikat. \n5.\tÜliõpilane teab ja tunneb kompuutertomograafia uuringute füüsikalisi aluseid, aparatuuri põhimõttelist ülesehitust ja toimimist, kompuutertomograafia uuringutega seoses olevatest ohtudest, võimalustest ja puudustest, uuringu näidustustest ja vastunäidustustest. \n6.\tÜliõpilane teab patsiendi kompuutertomograafia uuringule ettevalmistamist ja oskab patsiendile seletada uuringu läbiviimise metoodikat. \n7.\tÜliõpilane teab ja tunneb magnetresonantstomograafia uuringute füüsikalisi aluseid, aparatuuri põhimõttelist ülesehitust ja toimimist, magnetresonantstomograafia uuringutega seoses olevatest ohtudest, võimalustest ja puudustest, uuringu näidustustest ja vastunäidustustest. \n8.\tÜliõpilane teab patsiendi magnetresonantstomograafia uuringule ettevalmistamist ja oskab patsiendile seletada uuringu läbiviimise metoodikat.\n9.\tÜliõpilane teab ja tunneb nukleaarmeditsiini uuringute füüsikalisi aluseid, aparatuuri põhimõttelist ülesehitust ja toimimist, nukleaarmeditsiini uuringutega seoses olevatest ohtudest, võimalustest ja puudustest, uuringu näidustustest ja vastunäidustustest. \n10.\tÜliõpilane teab patsiendi nukleaarmeditsiini uuringule ettevalmistamist ja oskab patsiendile seletada uu"}