{"KURSUSE_NIMI": "Radioloogia", "KURSUSE_KOOD": "ARHO.01.029", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab üldinformatsiooni radioloogiliste meetodite kohta, nende diagnostiliste võimaluste ja puuduste kohta, näidustuste ja vastunäidustuste, patsiendi radioloogiliste uuringutele saatmise aluste ja patsiendi ettevalmistamise kohta. Kursus käsitleb radioloogiliste uuringute planeerimise strateegiat põhinedes erinevate radioloogiliste meetodite  optimaalsele kasutamisele sõltuvalt radiatsioonidoosist. Antakse teadmised radioloogiliste meetodite optimaalsest planeerimisest (erinevate organsüsteemide) pea ja kaela piirkonna patoloogiate korral sõltuvalt kiirguskaitsest. Esitatakse erinevate patoloogiate radioloogilised tunnused erinevate radioloogiliste meetodite korral, käsitletakse enamlevinud haiguste iseloomustamist ja äratundmist röntgenoloogilistel uuringutel: röntgenoloogilisel-. ultraheli-, kompuutertomograafilisel ja magnetresonantstomograafilisel uuringu kujutisel. Kursus annab baasteadmised nukleaarmeditsiini põhiprintsiipidest ja nukrlaarmeditsiini uuringute kohast teiste radioloogiliste meetodite seas. Praktiliste tööde käigus õpitakse kasutama kaasaegseid pildi arhiveerimissüsteeme.Objectives/eesmärkid:  Koolituse eesmärk on omandada teadmised radiodiagnostilise aparatuuri tööpõhimõtetest, ja fuusikalistest alustest radioloogilisteste uurimismeetodite rakendusviisidest, diagnostilistest võimalustest ja  puudustest, uuringute näidustustest ja vastunäidustustest  nind radioloogiliste\nuurimismeetoditega kaasuvatest ohtudest. Eesmärk on anda teadmisi erinevate radioloogiliste meetodite optimaalsest kasutamisest söltuvalt radiatsioonidoosist ja anda teadmisi radioloogiliste uuringute optimaalsest planeerimisest eri organite patoloogiate puhul kiirguskaitsest lähtuvalt.Learning outcomes/õpiväljund:  Oskab pea- ja kaela piirkonna erinevate patoloogiate kahtlusel valida optimaalse radioloogilise uuringu sõltuvalt kiirguskaitsest. Tunneb pea ja kaela patoloogiate olulisi tunnuseid erinevate radioloogiliste meetodite korral. Tunneb ära  ja oskab radioloogiliselt iseloomustada kõige tavalisemaid muutusi pea ja kaela piirkonnas (on omandanud radioloogilise diferentsiaaldiagnostika põhialused eri organsüsteemide patoloogiate korral).  Evib teadmisi tänapäevase pildiarhiivisüsteemi võimalustest ja oskab seda kasutada."}