{"KURSUSE_NIMI": "Kutsekopsuhaigused", "KURSUSE_KOOD": "ARKS.01.025", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 40, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine kava hõlmab tähtsamaid kutsekopsuhaigusi ja kutsetööga seotud tegurite toimel tekkinud kopsuhaigusi, nende definitsioone, riskitegureid, diagnostilisi kriteeriume, diagnostika käiku, diagnoosi kinnitamist, raviseisukohti, vältimise viise ning üldisemaid sotsiaal- ja õigusmeditsiinilisi aspekte. Detailselt aga kutsekopsuhaiguste käsitluse üldisi eripärasid muude kopsuhaigustega võrreldes, samuti olulisemaid pneumokonioose (asbesti-, ränitolmu-, talgi-, söe- ja raskmetallitolmustust, lisaks asbestist tingitud muid kopsuhaigusi), kroonilist obstruktiivset kopsuhaigust (KOK’i) kutsehaigusena, kutseastmat, hüpersensitiivsuspneumoniite, orgaanilise tolmu toksilist sündroomi, toksilisi kopsukahjustusi ja kutse-kopsukasvajaid.Objectives/eesmärkid:  Kursuse eesmärk on õpetada tundma olulisemaid kutsetööst või kutsetööga seotud tegurite toimel  tekkinud kopsuhaigusi - nende definitsioone, riskitegureid, diagnostilisi kriteeriume, diagnostika käiku, diagnoosi kinnitamist, raviseisukohti, vältimise viise ning üldisemaid sotsiaal- ja õigusmeditsiinilisi aspekte. Üldisemaks eesmärgiks on tutvustada kutsekopsuhaiguste käsitluse eripärasid muude kopsuhaigustega võrreldes; konkreetseks eesmärgiks on tutvustada olulisemaid pneumokonioose (asbesti-, ränitolmu-, talgi-, söe- ja raskmetallitolmustust, lisaks asbestist tingitud muid kopsuhaigusi), kroonilist obstruktiivset kopsuhaigust (KOK’i) kutsehaigusena, kutseastmat, hüpersensitiivsuspneumoniite, orgaanilise tolmu toksilist sündroomi, toksilisi kopsukahjustusi ja kutse-kopsukasvajaid.Learning outcomes/õpiväljund:  Õppeaine läbinu tunneb tähtsamaid kutsekopsuhaigusi ja kutsetööga seotud tegurite toimel tekkinud kopsuhaigusi, nende definitsioone, riskitegureid, diagnostilisi kriteeriume, diagnostika käiku, diagnoosi kinnitamist, raviseisukohti, vältimise viise ning üldisemaid sotsiaal- ja õigusmeditsiinilisi aspekte. Konkreetselt valdab õppeaine läbinu kutsekopsuhaiguste käsitluse eripärasid muude kopsuhaigustega võrreldes ning tunneb olulisemate pneumokoniooside (asbesti-, ränitolmu-, talgi-, söe- ja raskmetallitolmustuse koos asbestist tingitud muude kopsuhaiguste), kutsehaigusena esineva kroonilise obstruktiivse kopsuhaiguse (KOK’i), kutseastma, hüpersensitiivsuspneumoniitide, orgaanilise tolmu toksilise sündroomi, toksiliste kopsukahjustuste ja kutse-kopsukasvajate tervikkäsitlust."}