{"KURSUSE_NIMI": "Pulmonoloogia ja torakaalkirurgia", "KURSUSE_KOOD": "ARKS.01.024", "EAP": 4.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Farmakoloogia ja toksikoloogia", "Meditsiiniline mikrobioloogia", "Diagnostika alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 40, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 59, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õpetatakse kompleksselt peamisi kopsude ja hingamiselundite haigusi, samuti keskseinandi, söögitoru ja rindkereseina kirurgilisi haigusi (käsitletakse epidemioloogiat ja patogeneesi, haigustunnuseid ja sümptomeid, haiguse kliinilist kulgu, diagnoosimist (sealhulgas invasiivse diagnostika meetodeid), ravi (sealhulgas kirurgilist ravi) rehabilitatsiooni, haiguste preventsiooni, üldisemat hingamiselundite haiguste ravikorraldust ning rindkeremeditsiinis esinevate ägedate haigusseisundite diagnostikat ja ravi). Käsitlemist leiavad pulmonoloogias ja torakaalkirurgias kasutatavad uurimismeetodid, kopsuhaiguste paomorfoloogia, patofüsioloogia, immunoloogia ja hingamiselundite kaitsemehhanismid. Erinevate hingamiselundite haiguste õpetamise maht on mõnevõrra erinev - suhteliselt detailsemalt on käsitletud sagedamini esinevaid haigusi (bronhiaalastma, krooniline obstruktiivne kopsuhaigus, alumiste hingamisteede infektsioonid ja viimaste tüsistused, rindkerepiirkonna kasvajad, kopsukelme haigused), kuid tundma õpetatakse ka suhteliselt harvem esinevaid haigusi, kus oluline koht on sageli invasiivsel diagnostikal. Pulmonoloogia ja torakaalkirurgia kursus moodustab käesoleval hetkel osa Tartu Ülikoolis õpetatavast sisehaiguste ainest.Objectives/eesmärkid:  Aine eesmärk on õpetada arsti eriala üliõpilastele selgeks hingamiselundite ja rindkere haiguste, nende diagnoosimise ja ravi (sealhulgas invasiivse diagnostika ja kirurgilise ravi) põhialused, hõlmates nii teoreetilisi teadmisi kui praktilisi oskusi, mis võimaldavad lahendada praktikas esinevaid meditsiinilisi situatsioone. Kopsuhaiguste kõrval on eesmärgiks anda põhiteadmised keskseinandi, söögitoru ja rindkereseina kirurgiliste haiguste sümptomatoloogiast, diagnostikast ja raviprintsiipidest.Learning outcomes/õpiväljund:  Ainekursuse läbinud üliõpilane peaks:  1) olema omandanud nii teoreetilised kui praktilised põhiteadmised rindkere- ja hingamiselundite haiguste olemusest ja diagnostikast, samuti kasutatavatest uurimismeetoditest ja oskama tulemusi interpreteerida,  2) tundma rindkere- ja hingamiselundite haiguste epidemioloogia, patoloogia, patofüsioloogia, immunoloogia ja hingamiselundite kaitsemehhanismide põhialuseid,  3) oskama iseseisvalt uurida rindkere ja hingamiselundite haigusega patsienti ja suutma välja pakkuda esialgse diagnoosi olulisemate haiguste puhul (restriktiivsed, obstruktiivsed ja neoplasmaatilised kopsuhaigused, infektsioonid, rindkerepiirkonna vigastused ning keskseinandi, söögitoru ja rindkereseina),  4) oskama põhjendatult valida ja rakendada edasisi uurimismeetodeid, mis on vajalikud diagnoosi kinnitamiseks konkreetsetes situatsioonides ja interpreteerida vastavalt uuringute tulemusi,  5) oskama põhjendatult valida ja kompleksselt rakendada ravivõimalusi, sealhulgas tundma kirurgilise ravi põhimõtteid ja meetodeid erinevate rindkere- ja hingamiselundite haiguste korral,  6) mõistma rindkere ja hingamiselundite haiguste ravi, järelravi, pulmonaalse rehabilitatsiooni ja haiguste ennetamise terviklikkust,  7) oskama hinnata patsiendi seisundit ja osutada vajalikku arstlikku abi vastavates situatsioonides (vigastused, ägedad seisundid rindkere ja hingamiselundite haiguste korral ja krooniliste hingamisteede haiguste ägenemisel. Subject ARKS.01.024 Pulmonary medicine and thoracic surgery\nThe lectures planned will be replaced with video lectures. The rest of the academic teaching, i.e. the practical classes, will occur accordingly to the schedule published previously. The Moodle-based study materials will be renewed. The ordinary practical classes will be replaced by e-seminars on the Moodle-based BigBlueButton platform with mutual connections. The timing will be the same as previously scheduled for ordinary classes."}