{"KURSUSE_NIMI": "Kliiniline mikrobioloogia. Pea ja kaela piirkonna infektsioonid", "KURSUSE_KOOD": "ARMB.01.055", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Meditsiiniline mikrobioloogia"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 7, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Suuõõne, pea ja kaela piirkonna sagedasemad mikroorganismid.Mikroobide patogeensus ja virulentsus . Biofilm . Eksogeensed ja endogeensed infektsioonid. Mikroobide ravimresistentsus.  Erinevate infektsioonide mikrobioloogiline diagnostika.. Mädased infektsioonid. Ultseratiivsed haigused suus.Anaeroobsed infektsioonid.Seenhaigused. Viirusnakkused ja nende diagnostika üldised põhimõttedObjectives/eesmärkid:  Õpetada üliõpilastele inimese suuõõne, pea ja kaela bakteriaalsete, viiruslike  ja seenhaiguste klassifikatsiooni,  patogeneesi ning mikrobioloogilise diagnostika, profülaktika ja ravi põhiprintsiipeLearning outcomes/õpiväljund:  Õppeaine läbimise järgselt üliõpilane: 1. tunneb inimese suuõõne mikroobikoosluse  mikroobe, nende hulgas ka nn. potentsiaalseid patogeene ning  saab aru peremeesorganismi ja mikroorganismide interaktsioonist; 2.  teab haigusetekitajate reservuaari, levikuteid ning tunneb nende poolt põhjustatud haiguste patogeneesi;  3. tunneb inimese immuunsüsteemi ja saab aru selle osast infektsiooni protsessis; 4. suudab kasutada teadmisi sterilisatsioonist ja desinfektsioonist, takistamaks infektsiooni levikut; 5.  oskab valida mikrobioloogiliseks diagnoosimiseks sobivaid meetodeid, teab nende meetodite piire; 6. oskab koguda mikrobioloogiliseks diagnostikaks sobivat uuritavat materjali, seda transportida ja säilitada; 7. suudab tõlgendada mikrobioloogiliste uuringute vastuseid, paigutades seda haiguspilti ja võimalike mikrobiaalsete tekitajate konteksti; 8. suudab rakendada olulisemaid diagnostikas kasutatavaid mikroorganismide samastamise tehnikaid ja kasutada antibiootikumresistentsuse määramise meetodeid."}