{"KURSUSE_NIMI": "Meditsiini geneetika", "KURSUSE_KOOD": "ARMP.01.024", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 9, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 27, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus ehitub üles loengutest ja praktikumidest.\nKursuse saab jagada tinglikult alateemadeks: (1) meditsiinigeneetika alused, s.h. monogeenste ja komplekshaiguste geneetika; (2) hambahaigustega seotud geneetika; (3) geneetika teadmiste ja analüüside rakendused meditsiinis; (4) DNA analüüsi meetodid - baasarusaam; (5) meditsiinigeneetika andmebaaside kasutamine, s.h. kliinilises töös.Objectives/eesmärkid:  Eesmärgiks on omanda meditsiinigeneetika alustõed, teadmised tänastest ja uutest geneetika rakendustest meditsiinis. Eraldi käsitleme hambumuse ja hambahaiguste geneetikat ja selle valdkonna arengusuundi.  Kursus seab ka eesmärgiks täiendada interaktiivsete õppemeetoditega teadmiste sünteesimise ja kriitilise arutelu võimekust - kodutööde lugemismaterjali ühine käsitlus ja seminarettekanded hiljutiste teadusartiklite põhjal praktikumis, meditsiiini geneetika andmebaaside kasutamise pädevus.Learning outcomes/õpiväljund:  1. Omandatud on: - meditsiinigeneetika alustõed - üldised teadmised hammaste tervisega seotud geneetilistest faktoritest - kaasaegne arusaam geneetika teadmiste kasutamisest meditsiinis - baasarusaam DNA testidega seotud laboratoorsest tööst - oskus vajadusel kasutada tänapäevaseid meditisinigeneetika andmebaase 2. Ette valmistatud ja kaastudengitele läbi viidud seminar-ettekanne õppejõu poolt valitud viimase 1-2 aasta jooksul ilmunud olulise teadusartikli baasil, mis käsitleb hambumuse või hammaste tervisega seotud geneetikat. 3. Edasi arendatud on järgmise võtmepädevused: (i) loengus omandatud erialaste teadmiste rakendamine seminari ettevalmistamisel, esitatava teema interpreteerimisel ning hinnangu andmisel käsitletava teadusartikli kvaliteedile ja panusele valdkonda; (ii) iseseisva õppimise ja teiste tudengitega koostöö balanss rühmatöödes, praktilistes töödes ja seminari materjaliomandamisel ja esitamisel; (iii) täiendatud kriitilist mõtlemist ning võimekust sünteesida omandatud teadmisi; (iv) valmisolek jälgida oma erialal geneetika uuringute ja rakendusvõimaluste arenguid Kõik õppematerjalid, juhised ja kordamisküsimused on Moodle-is. \n\nArvestus põhineb ainult kordamisküsimustes kajastatud teemadel."}