{"KURSUSE_NIMI": "Bioloogia", "KURSUSE_KOOD": "ARMP.01.029", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 10, "seminar": 28, "independent_work": 72, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antud õppeaine (10,0 EAP) loengukursus annab ülevaate kaasaegse bioloogia põhilistest valdkondadest: raku-, molekulaar-, arengubioloogiast, geneetikast, evolutsiooniteooriast ja inimese ökoloogiast (s.h meditsiinilisest parasitoloogiast). \nPraktikumides leiavad käsitlemist raku- ja arengubioloogia, geneetika ja inimese ökoloogia (meditsiinilise parasitoloogia) küsimused.Objectives/eesmärkid:  Õppeaine eesmärgiks on meditsiiniteaduste valdkonna arstiteaduse I kursuse üliõpilastele ülevaate andmine tänapäeva bioloogia põhilistest valdkondadest. \nKursus on molekulaarbioloogia- ja geneetikakeskne ja samas meditsiinilis-rakendusliku suunitlusega. Kursusesse  on integreeritud meditsiinilise parasitoloogia osa.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Pärast kursust teab üliõpilane kaasaegse inimesebioloogia põhivaldkondade teoreetilisi aluseid ja oskab teadmisi rakendada praktilises tegevuses probleemsituatsioonide mõistmisel ja lahendamisel.\n\nMolekulaar- ja rakubioloogia:\n1) Teab matriitssünteeside (replikatsioon, transkriptsioon, translatsioon) olemust, nende rolli raku funktsioonide tagamisel.\n2) Teab eukarüootse raku ja selle organellide ehitust ja talitlust, seoseid patoloogiliste protsessidega. 3) Teab tähtsamaid molekulaar- ja rakubioloogilisi uurimismeetodeid, nende kasutust diagnostilistes lähenemistes.\n\nGeneetika:\n1) Teab pärilikkuse materiaalsete aluste hierarhilise süsteemi ehitust, talitlust ja pärilikkuse funktsionaalseid protsesse. \n2) Valdab pärandumise seaduspärasusi ja oskab neid rakendada praktikas.\n3) Teab pärilikust muutlikkusest tingitud inimese haiguste põhitüüpe, nende aluseid ja sagedusi. \n4) Teab inimese geneetikas kasutatavaid meetodeid. \n5) Teab populatsioonigeneetika aluseid, seaduspärasusi ja oskab neid kasutada praktikas.\n\nArengubioloogia:\n1) Teab meioosi, mitoosi, oogeneesi ja spermatogeneesi mehhanisme ja seoseid patoloogiaga.\n2) Omab teadmisi ontogeneesi etappidel asetleidvate protsesside kohta.\n3) Oskab teadmisi seostada arengu morfoloogiliste struktuuridega nii normis kui patoloogias. \n\nInimese ökoloogia ja evolutsiooniline bioloogia:\n1) Ökoloogia, teema meditsiiniline parasitoloogia: teab parasiitide ehitust, elutsükleid ja levikuteid; parasiitnakkuste patogeneesi, sümptomeid, diagnoosimeetodeid, raviskeeme, profülaktikat.\n2) Ökoloogia, teema keskkond: teab keskkonnakaitse aluseid ja saastamisega kaasnevaid meditsiinilisi probleeme.\n3) Omab ettekujutust bioevolutsioonist. Teab: evolutsiooniteooriate tüübid, sünteetilise evolutsiooniteooria tasemed, tegurid ja seaduspärasused. Omab ettekujutust inimese põlvnemisest.\n\nPositiivse hinde saamiseks tuleb materjali vallata kõikides teemades vähemasti teadmiste tasemel Bloomi taksonoomia järgi (1956)."}