{"KURSUSE_NIMI": "Naha- ja suguhaigused", "KURSUSE_KOOD": "ARNH.01.033", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sisehaigused", "Kirurgia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 60, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpetatakse kompleksselt peamisi nahahaigusi ja seksuaalsel teel levivaid haigusi (käsitletakse epidemioloogiat ja patogeneesi, haigustunnuseid ja sümptomeid, haiguse kliinilist kulgu, diagnoosimist, ravi, rehabilitatsiooni ja haiguste preventsiooni. Käsitlemist leiavad dermatoloogias ja veneroloogias kasutatavad uurimismeetodid, naha- ja suguhaiguste patomorfoloogia, patofüsioloogia ja immunoloogia. Erinevate naha ja suguhaiguste õpetamise maht on mõnevõrra erinev - suhteliselt detailsemalt on käsitletud sagedamini esinevaid haigusi (nakkuslikud nahahaigused, allergodermatoosid, papuloskvamoossed nahahaigused, reaktiivsed erüteemid, autoimmuunsed villilised nahahaigused, rasunäärmete haigused, juuste haigused, kroonilised sidekoehaigused, vaskuliidid, nahakasvajad, seksuaalsel teel levivad infektsioonid), kuid tundma õpetatakse ka suhteliselt harvem esinevaid haigusi (pärilikud nahahaigused, troopilised nahahaigused).Objectives/eesmärkid:  Aine eesmärk on õpetada arsti eriala üliõpilastele selgeks nahahaiguste ja seksuaalsel teel levivate haiguste diagnoosimise ja ravi põhialused, hõlmates nii teoreetilisi teadmisi kui praktilisi oskusi, mis võimaldavad lahendada praktikas esinevaid meditsiinilisi situatsioone.Learning outcomes/õpiväljund:  Ainekursuse läbinud üliõpilane peaks:  1) olema omandanud nii teoreetilised kui praktilised põhiteadmised naha- ja suguhaiguste olemusest ja diagnostikast, samuti kasutatavatest uurimismeetoditest ja oskama tulemusi interpreteerida,  2) tundma naha-ja suguhaiguste epidemioloogia, patoloogia, patofüsioloogia ja immunoloogia põhialuseid,  3) oskama iseseisvalt uurida naha-ja suguhaigusega patsienti ja suutma välja pakkuda esialgse diagnoosi olulisemate haiguste puhul (nakkuslikud nahahaigused, allergodermatoosid, papuloskvamoossed nahahaigused, reaktiivsed erüteemid, autoimmuunsed villilised nahahaigused, rasunäärmete haigused, juuste haigused, kroonilised sidekoehaigused, pärilikud nahahaigused, vaskuliidid, nahakasvajad, troopilised nahahaigused ja seksuaalsel teel levivad infektsioonid)  4) oskama põhjendatult valida ja rakendada edasisi uurimismeetodeid, mis on vajalikud diagnoosi kinnitamiseks konkreetsetes situatsioonides ja interpreteerida vastavalt uuringute tulemusi,  5) oskama põhjendatult valida ja kompleksselt rakendada ravivõimalusi, sealhulgas tundma süsteemse ja lokaalse ravi, dermatokirurgia, krüoteraapia, laserravi ja fototeraapia põhimõtteid, 6) mõistma naha-ja suguhaiguste ravi, rehabilitatsiooni ja haiguste ennetamise terviklikkust. Nahakliiniku semestri tunniplaan ja valikainete toimumiskavad saadaval õppematerjalide all ja  ka MOODLE-s.\n\nNAHAHAIGUSTE E-ÕPIK saadaval MOODLE-s Nahahaigused. ARNH.01.033 all.\nSamuti on see saadaval www.utlib.ee-s:\nTartu Ülikooli raamatukogu lehele:\nAndmebaasid\nEestikeelsed e-õpikud ebrary's\nOtsingusse: Nahahaigused\nSiis peaks tulema ette selline link:\nhttp://site.ebrary.com.ezproxy.utlib.ut.ee/lib/tartuuniversity/detail.action?docID=11051543\n\nRaamatut \"Nahahaigused\" saab laenutada nahahaiguste õppetooli sekretäri käest Raja 31, II korrus, ruum A-2066.\n\nKõik loengud toimuvad Raja 31, III korrus, ruum A-3063 (raamatukogu).\nProbleemide ja küsimuste korral palun võtta ühendust nahahaiguste õppetooli sekretäri Eha Käigega\n(e-mail: eha.kaige@kliinikum.ee, tel. 731 9703)"}