{"KURSUSE_NIMI": "Neuroloogia", "KURSUSE_KOOD": "ARNR.01.024", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Anatoomia"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilastele õpetatakse närvihaiguste sümptomaatikat, diagnoosimise põhimõtteid, ravivõimalusi, samuti närvisüsteemi kahjustusega kaasnevaid haigussündroome, nende uurimise metoodikat ja kliinilist tähendust.Objectives/eesmärkid:  Neuroloogia õpetamise eesmärk on selgitada üliõpilastele sagedamini esinevate orgaaniliste närvihaiguste sümptomeid, diagnoosimise ja ravi printsiipe, pöörates erilist tähelepanu näo piirkonna patoloogilistele protsessidele (kolmiknärvi valud, atüüpilised näovalud,peavalu)Learning outcomes/õpiväljund:  Kursuse eesmärgiks on anda stomatoloogia üliõpilastele ülevaade närvisüsteemi anatoomiast ja funktsioneerimisest ning põhiliste neuroloogiliste haiguste tekkemehhanismidest, diagnostikast, kliinilistest avaldustest ja ravist, spetsiifilise tähelepanuga näo ja kolju piirkonna sündroomidele ja haigustele (trigeminaalne neuralgia, atüüpilised näovalud, peavalud). Kursuse läbinud üliõpilased: tunnevad närvisüsteemi funktsionaalset anatoomiat ja neuroloogiliste haiguste toopilist diagnoosimist; tunnevad neuroloogiliste haiguste peamisi mehhanisme; tunnevad haigete neuroloogilise uurimise põhimõtteid; teavad pea- ja seljaaju haiguste, perifeersete närvida ja lihashaiguste kliinilist fenomenoloogiat:; teavad sagedasemate neuroloogiliste haiguste ravi põhimõtteid. Teadmisi hinnatakse suulisel eksamil. Praktikumid ja loengud toimuvad L. Puusepa 8 ruumis H007. Haiglas liikumiseks on vajalikud vahetusjalatsid, arstikittel. Üleriided jätta peasissekäigu juures olevasse riidehoidu."}