{"KURSUSE_NIMI": "Neuroloogia ja neurokirurgia", "KURSUSE_KOOD": "ARNR.01.036", "EAP": 7, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sisehaigused", "Kirurgia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 80, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpetatakse neuroloogiliste haigete uurimise iseärasusi ning tutvustatakse pea-ja seljaaju, perifeersete närvide ja lihashaiguste diagnostikat ja ravi.Objectives/eesmärkid:  Õpetada neuroloogiliste ja neurokirurgiliste haigete kliinilise uurimise võtteid ning pea- ja seljaaju, perifeersete närvide ning lihashaiguste diagnoosimise ja ravi võimalusi. Käsitleda eluohtlike neuroloogiliste sündroomide diferentsiaaldiagnostikat ning esmase käsitluse põhimõtteid.Learning outcomes/õpiväljund:  Kursuse läbinud  üliõpilane: 1. Oskab suhelda patsientidega, kellel on neuroloogilised või neurokirurgilised haigused 2. Oskab patsiendi kaebusi kuulates tuvastada võimalikku neuroloogilist häiret 3. Teab põhilisi aspekte neuroloogilisest toopilisest diagnoosist 4. Oskab patsienti kliiniliselt neuroloogiliselt uurida ning põhjendatult esitada võimaliku diagnoosi hüpoteesid 5. Teab neuroloogia ning neurokirurgia erialasse puutuvaid olulisemaid laboratoorseid, instrumentaalseid ning radioloogilisi uurimismeetodeid. 6. Teab olulisemaid neuroloogilisi ja neurokirurgilisi haigusi - nende levimust, diagnoosikriteeriume, raviprintsiipe (akuutne ravi ning rehabilitatsioon) Iga praktikumi päev kell 8.30 hommikukonverentsist osavõtt kohustuslik,Puusepa 8- H502\nÜliõpilaste iseseisva töö hulka kuulub õppematerjalide läbitöötamine paralleelselt loengukursusega.\nPraktikumide kestvus on 4 tundi. Praktikumid toimuvad L. Puusepa 8 õpperuumides H302 ja H502.\nja haigetega tegelemine toimub palatites. Tagastada eksami päevaks raamat \"Neuroloogilise haige uurimine\", reflekshaamer, helihark ja valgusallikas.\nHaiglas liikumiseks on vajalikud vahetusjalatsid, arstikittel. Üleriided jätta peasissekäigu juures olevasse riidehoidu."}