{"KURSUSE_NIMI": "Vastsündinu ja imiku hooldus", "KURSUSE_KOOD": "AROT.00.025", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 15, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 53, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab tervikliku ülevaate vastsündinu esmasest adaptatsioonist, nahk-naha-kontaktist, arengu hindamisest, imiku arengu jälgimisest, positiivsest vanemlusest, nahahoolduse eripäradest, riietamisest, toitmisviisidest ning sagedasematest terviseprobleemidest ja nende lahendamisvõimalustest vastsündinu- ja imikueas.Objectives/eesmärkid:  Anda ülevaade vastsündinu anatoomilis-füsioloogilistest iseärasustest, hinnata  ja jälgida vastsündinu ning imiku füüsilist, kognitiivset, emotsionaalset ja sotsiaalset arengut, tunda vastsündinu/imiku toitmisviise ning nende erinevusi, osata hoolitseda vastsündinu/imiku naha eest ja omandada teadmisi turvalise keskkonna loomisest ja säilitamisest.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: -teab vastsündinu anatoomilis-füsioloogilisi iseärasusi ning oskab neid seostada esmase adaptatsiooni ning edasise lapse arengu ja vajadustega;  - teab peamisi vastsündinu ja imiku hoolduse põhimõtteid, oskab valida hooldusvahendeid ning kasutada asjakohaseid hooldusvõtteid; - teadvustab positiivse vanemluse olemust ning mõju lapse arengule. Õppejõu meiliaadress: marge.mahla@kliinikum.ee\n\nÕppetöö toimub SA Tartu Ülikooli Kliinikumi naistekliinikus aadressil L. Puusepa 8, C-korpus, I korruse perekeskuse võimlemisruum, ruum 1035, kl. 16.15-17.45 (2 akadeemilist tundi) või 16.15-18.30 (3 akadeemilist tundi).\n\nNB! Enne esimest loengut koguneda garderoobi juurde, kus õppejõud teiega kohtub ja juhatab seejärel õppruumi.\n\nTee ruumi: sisenemine L. Puusepa 8 tänava sissepääsust. Riided panna üliõpilaste garderoobi I korrusel ja suunduda sissepääsust paremale, trepist üles, registratuurist mööda ja otse klaasustest läbi. Infoleti juurest vasakule läbi järgmiste klaasuste ning koridori mööda edasi, kuni vasakule jääb liftivahe ja paremale vahekoridor, teine uks vasakul ongi võimlemisruum (1035). Ruumis ei ole lubatud viibida välisriietes ja -jalatsites."}