{"KURSUSE_NIMI": "Perearstiteadus II", "KURSUSE_KOOD": "ARPO.01.031", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sisehaigused", "Kirurgia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 10, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selekteerimata sümptomide probleemikeskse käsitlemise, riskirühmade väljaselgitamise ja ennetava ning profülaktilise tegevuse metoodika. Sagedasemad probleemid perearstiteaduses. Ambulatoorsete sissekannete metoodika. Epikriiside koostamine. Koduvisiitide metoodika. Perearsti suhtlemine patsientide ja teiste erialade arstidega. Konsultatsiooni metoodika. Perekonna käsitlus perearsti praktikas.Objectives/eesmärkid:  Tutvustada üliõpilastele erinevate ea- ja soogruppide probleemikeskset käsitlemist perearsti praktikas, arendada üliõpilaste suhtlemisoskust patsientidega. Laiendada üliõpilaste arusaamu perekonna ja ühiskonna mõjust üksikindiviidi tervisele ja kuidas efektiivselt ennetada haiguste teket esmatasandi meditsiinis. Õpetada mitme samaaegse kroonilise haigusega patsiendi käsitlust nii üksikindiviidi kui ka perekonna aspektist lähtuvalt.Learning outcomes/õpiväljund:  Kursuse läbimise järgselt üliõpilane:\n- oskab pakkuda patsiendile tema terviseseisundisse puutuvaid asjakohaseid selgitusi, nõuandeid ja tuge;\n- teab põhilisi preventsiooni meetodeid perearsti töös;\n- teab olulisemaid diagnoosimismeetodeid perearstipraksises;\n- teab perearsti praktikas sagedamini esinevate haiguste ravipõhimõtteid ja nende haiguste prognoosi;\n- teab multimorbiidsusega patsiendi ravi põhimõtteid;\n- oskab koostöös patsiendiga püstitada mõõdetava ravieesmärgi ning kavandada optimaalse ravi selle saavutamiseks;\n- teab palliatiivse ravi põhimõtteid:\n- oskab üldarsti tasemel kliiniliselt dokumenteerida ja ambulatoorset patsiendi vastuvõttu ette planeerida. University of Tartu suspended face-to face classes due to state of emergency and will continue as group-based e-learning in Moodle`i. Moodel`i e-course Family Medicine (ARPO.01.031) which includes materials,  individual homeworks. Deadlines and instructions are provided for submission. The subject ends with a final test in Moodle`i  which is opened for each group by the deadline. All study materials are included in the Moodle e-course."}