{"KURSUSE_NIMI": "Patsiendikeskne suhtlemine", "KURSUSE_KOOD": "ARPO.01.042", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Suhtlemise ja tervisekäitumise alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine patsiendikeskne suhtlemine keskendub suhtlemise ja tervisekäitumise aines omandatud teadmiste ja oskuste edasiarendatud rakendamisele patsiendi nõustamises tervisega seotud teemadel. Õpitakse nõustamise struktuuri ja võtteid, mis hõlmab patsiendi kaasamist raviprotsessi, nõustamise fookuse leidmist ja hoidmist, patsiendi ressursside esilekutsumist ning ühise raviplaani tegemist. Aine jooksul antakse teadmisi, kuidas aidata inimestel oma käitumise muutmist sõnastada, tõrjuda käitumise muutmisega seotud kõhklusi, kasutades ära patsiendi endi veendumust, teadmisi, oskusi, energiat ja pühendumist. Lisaks käsitletakse suhtlemist sensitiivsetel teemadel (halva teate edastamine, suhtlemine seksuaalsuse teemal) klassiruumi meetodile, mis annab õppijale õppeprotsessis suurema vabaduse ja ka vastutuse. Aines toimub hindamine jooksvalt. Õppematerjalideks on interaktiivsed õpiobjektid, mis sisaldavad salvestatud videoloengud, teemakohast teaduskirjandust nagu artiklid ja õpikute peatükid ning teemat kinnistavaid ülesandeid ja enesekontrolli teste. Kontaktõpe toimub praktikumide vormis, kus õppijad rakendavad nii üksteise kui ka standardiseeritud patsientide abil eelnevalt läbi töötatud teoreetilisi teadmisi konkreetsete situatsioonülesannete lahendamisel, analüüsimisel ja tagasisidestamisel.Objectives/eesmärkid:  Aine läbinud õppur on omandanud tõenduspõhised alusteadmised patsiendikesksest suhtlemisest ja nõustamisest ning rakendab neid tüüpolukordades ning omab ettekujutust kuidas enda suhtlusoskuseid edasi arendada.Learning outcomes/õpiväljund:  Pärast aine läbimist õppur: - mõistab terviseriskide tunnetamist ning tervisekäitumist mõjutavaid kehalisi, psüühilisi ja sotsiaalseid tegureid; (1) - tunneb ära situatsioonid, kus saab kasutada patsiendikeskse suhtlemise, sh nõustamise põhioskusi ja võtteid; (2) - oskab algtasemel konsultatsiooni läbiviimisel ja patsientide nõustamisel kasutada patsiendikeskse suhtlemise ja motiveerimise oskusi;  (3) - teab erinevate patsiendigruppide suhtlemise eripärasid(4) NB! Õppetööl palun osaleda ainult enda rühmaga. Soovi korral osaleda õppetööl teise rühmaga tuleb võtta eelnevalt ühendust liis.viitkar@ut.ee. Muudatusi lubame teha ainult väga erandkorras.\n\nNB! Seminariks \"Suhtlemine eaka ja kognitiivse häirega patsiendiga ning patsiendi lähedastega\" on nõue riietuse ja jalanõude osas. Kuna õppetöö toimub kliinikumis ning seminari raames kohtute ka patsientidega, siis peavad olema vahetusjalanõud (madalad) ja valge kittel (võib olla ka valge pluus)."}