{"KURSUSE_NIMI": "Kliiniline radioloogia", "KURSUSE_KOOD": "ARRD.00.016", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sisehaigused", "Kirurgia"], "SOOVITUSLIKUD_EELDUSAINED": ["Diagnostika alused"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 27, "individual_work": 0, "internship": 11}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab informatsiooni radioloogiliste meetodite kohta, nende diagnostiliste võimaluste ja puuduste kohta, näidustuste ja vastunäidustuste, ohtude kohta, patsiendi radioloogiliste uuringutele saatmise aluste ja patsiendi ettevalmistamise kohta. Kursus käsitleb radioloogiliste uuringute optimaalse planeerimise strateegiat, põhinedes erinevate radioloogiliste meetodite optimaalsel kasutamisel sõltuvalt radiatsioonidoosist. Antakse teadmised radioloogiliste meetodite optimaalsest planeerimisest erinevate organsüsteemide patoloogiate korral sõltuvalt kiirguskaitsest. Omandatakse teadmised laste ja rasedate uurimisega seotud probleemidest. Praktiliste tööde käigus õpitakse kasutama tänapäevaseid pildiarhiveerimissüsteeme ja radioloogilise uuringu kirjelduse järgi leidma radioloogilisi muutusi röntgenoloogias ja kompuutertomograafias.Objectives/eesmärkid:  1.\tKursuse eesmärk on tutvustada uuemaid radioloogilisi uurimismeetodeid, erinevate diagnostilisi meetodite võimalusi 2.\tKursuse eesmärk on anda ülevaade radioloogilisele uuringule saatmise ohtudest eri meetodite puhul  ja nende vältimisest 3.\tKursuse eesmärk on anda põhjalikud teadmised kiirguskaitsest ja erinevatest kiirgusdoosidest erinevate radioloogiliste uuringute puhul eriti silmas pidades lapsi, noorukeid ja rasedaid. 4.\tEesmärk on anda teadmisi erinevate radioloogiliste meetodite optimaalsest kasutamisest arvestades kiirguskaitset ja optimaalse uuringuplaani koostamisest eri patoloogiate korral, lastel ja rasedatel arvestades kiirguskaitset.Learning outcomes/õpiväljund:  1.\tÜliõpilane oskab erinevate organsüsteemide patoloogiate kahtlusel koostada optimaalset radioloogiliste uuringute plaani sõltuvalt kiirguskaitsest, et kiirgusdoos oleks nii väike kui mõistlikult võimalik (ALARA printsiip). \n2.\tÜliõpilane oskab erinevate organsüsteemide patoloogiate kahtlusel koostada optimaalset radioloogiliste uuringute plaani sõltuvalt sellest, kuidas kõige kiiremini ja optimaalt  jõuda diagnoosini. \n3.\tÜliõpilane teab ja tunneb erinevate radioloogiliste uuringute näidustusi ja vastunäidustusi erinevate organsüsteemi patoloogiate korral\n4.\tÜliõpilane oskab kirjutada saatekirja, et anda edasi kõige olulisem informatsioon radioloogiliste uuringu tegemiseks ja hindamiseks\n5.\tÜliõpilane teab ja tunneb kiirgusdoose erinevatel röntgenoloogilistel uuringutel, kompuutertomograafias, nukleaarmeditsiinis ja angiograafis.\n6.\tÜliõpilane teab patsiendi ohtusid magnettomograafias, magnettomograafiasse saatmise põhimõtteid ja tunneb sellealast seadusandlust \n7.\tÜliõpilane teab radioloogilisele uuringule saatmise, uuringute optimaalse valiku põhimõtteid lastel ja noorukitel sõltuvalt kiirguskaitsest, põhimõtteid kontrastaine süstimisel ja muid lapsi ohustavaid faktoreid. \n8.\tÜliõpilane teab radioloogilisele uuringule saatmise ja uuringute optimaalse valiku põhimõtteid rasedatel sõltuvalt kiirguskaitsest, põhimõtteid kontrastaine süstimisel ja muid loodet ohustavaid faktoreid. \n9.\tÜliõpilane teab radioloogilisele uuringule saatmise ja uuringute optimaalse valiku põhimõtteid neerupuudulikkusega, diabeedi ja allergiaga patsientidel ning muudel  patsientidel, kellele kontrastaine süstimine patsienti ohustab \n10.\tÜliõpilane teab ja tunneb menetlusradioloogiliste uuringute riske, erinevatele uuringutele saatmise põhimõtteid ja patsiendi ettevalmistust menetlusradioloogilisteks protseduurideks. \n11.\tÜliõpilane oskab arvestades radioloogi kirjeldust leida muutused skeleti ja rindkere röntgenipildil ning pea, rindkere ja kõhu kompuutertomograafias. \n12.\tÜliõpilane teab Kontaktid:\nPilvi Ilves: pilvi.ilves@kliinikum.ee, Puusepa 8 7318300\nMare Lintrop: mare.lintrop@kliinikum.ee, Lunini 6, UH kabinet\nKai Ulst: kai.ulst@kliinikum.ee\nJaanika Kumm: jaanika.kumm@kliinikum.ee\n\nsekretär: Annely Ahi: annely.ahi@kliinikum.ee , Puusepa 8 radioloogiaosakond\ntelefon 731 9660"}