{"KURSUSE_NIMI": "Laboratoorne meditsiin", "KURSUSE_KOOD": "ARSK.03.007", "EAP": 1.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 5, "practice": 15, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 19, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tsükli vältel õpitakse tundma laboratoorse meditsiini põhimõisteid ja sagedasemate laboratoorsete uuringute kasutusvõimalusi. Tehakse praktilisi töid vere- ja uriini preparaate mikroskopeerides, glükoosi ainevahetuse interpreteerimisel. Harjutatakse laboratoorsete tulemuste seostamist teiste haige ja terve inimese seisundi kliiniliste näitajatega. Tegemist on ühe osaga diagnostika aluste kursusest.Objectives/eesmärkid:  Omandada laboratoorse meditsiini põhimõisted (terminoloogia,  uuringute tulemuste kriitiline hindamine), sagedasemate hematoloogiliste ja biokeemiliste testide praktiline käsitlus.Learning outcomes/õpiväljund:  Tsükli edukalt läbinud üliõpilased 1.\ttunnevad laboratoorse meditsiini põhimõisteid, 2.\toskavad haiget instrueerida labori uuringute eel, et minimeerida preanalüütiliste tegurite mõju tulemustele, 3.\toskavad tõlgendada suuremaid kõrvalekaldeid sagedasemates hematoloogilistes uuringutes, 4.\toskavad määrata glükoosi taset veres ja tulemusi tõlgendada, 5.\tteavad elutähtsate laboratoorsete parameetrite kriitilisi väärtusi, 6.\toskavad teha otsuseid laboratoorsete näitajate muutuse olulisuse kohta, arvesse võttes analüüdi bioloogilist varieeruvust. Seminari eel tuleb läbida positiivse tulemusega seminari eelsed testid (antud seminari teemal). Test tuleb sooritada enne seminari/praktikumi algust ja selle tegemata jätmisel ei pääse seminaris/praktikumis osalema. Kõigis seminarides ja praktikumidest osavõtt on kohustuslik. Puudutud seminarid/praktikumid tuleb järele teha mõne muu grupiga. Seminarides ja praktikumides on kohustuslik kanda kitlit ja vahetusjalatseid."}