{"KURSUSE_NIMI": "Geriaatria algkursus", "KURSUSE_KOOD": "ARSK.01.057", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Diagnostika alused"], "SOOVITUSLIKUD_EELDUSAINED": ["Patsiendikeskne suhtlemine"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 1, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Iseseisva juhendatud õppe (videoloengud, lugemismaterjal) kaudu omandatakse põhilised teadmised, mida kinnistatakse auditoorsete seminaride raames koos juhendajaga. Teadmisi ja oskusi praktiseeritakse geriaatrilisi haigeid uurides nii seminarides kui iseseisvalt. Kursuse lõpul esitab üliõpilane kokkuvõtte ühe haige uurimisest ja käsitlemisest vastavalt kehtestatud nõudmistele.Objectives/eesmärkid:  Õpitakse tundma ja rakendama eakate meditsiini eripärasid üldarstile vajalikus mahus: vananemise ja vanaea haprusega seotud sagedasemad tervise- ja toimetulekuprobleemid, igakülgne geriaatriline hindamine, geriaatriliste haigete ravi, hoolduse ning ennetuse iseärasused.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilased: 1.\ttunnevad eakate inimeste haiguste avaldumise ning ravi üldisi eripärasid (eaka haige uurimise eripärad, seisundi hindamine enne plaanilist kirurgilist ravi, ravijuhendite rakendamine habrastel eakatel, eakatele potentsiaalselt sobimatud ravimid); 2.\toskavad teha baastasemel igakülgset geriaatrilist hindamist (interRAI KH näitel) ja kasutada täieliku igakülgse geriaatrilise hindamise tulemusi haige edasise diagnostika, ravi ning hoolduse planeerimisel; 3.\ttunnevad olulisemate geriaatriliste sündroomide ja probleemide ilminguid ning oskavad neid arvestada edasises arstlikus tegevuses (vanaea haprus, dementsus, deliirium, alatoitumine, kukkumine, valu; uriini inkontinents); 4.\tteavad pikaajalise ravi- ja hoolekandeteenuste üldist korraldust ning erinevate spetsialistide rolli haigete hoolduse korraldamisel, saavad aru arsti rollist interdistsiplinaarse hooldusmeeskonna töös; 5.\tteavad ning rakendavad geriaatrilise eetika printsiipe (ealise diskrimineerimise vältimine, väärkohtlemise märkamine ja sekkumine, tulevikujuhendid)."}