{"KURSUSE_NIMI": "Spordimeditsiin, harrastusspordi võlud ja valud 2", "KURSUSE_KOOD": "ARSM.01.045", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 8, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 32, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Käsitletakse sportlaste (sh harrastussportlaste) kehaliste võimete arendamise peamisi printsiipe, antakse praktilised oskused  funktsionaalse võimekuse ja tugiliikumisaparaadi võimekuse hindamise kohta.  Omandatakse teadmised ja oskused spordiga seotud vigastuste ennetamiseks ja  esmaabiks. Käsitletakse sportlaste toitumisega seotud aspekte, dopinguainete ning toidulisandite kasutamist.Objectives/eesmärkid:  Anda süvendatud teadmised sportlaste spordimeditsiini-spetsiifiliste probleemide kohta (kehaliste võimete arendamine, funktsionaalse võimekuse ja tugiliikumisaparaadi võimekuse hindamine,  sportlase toitumine ja toidulisandite kasutamine,  dopingu kasutamine spordis)Learning outcomes/õpiväljund:  1)  omab süvendatud teadmisi kehaliste võimete arendamise kohta. 2) oskab hinnata sagedamini esinevaid skeleti-lihassüsteemi ülekoormussündroome sportlastel, oskab anda esmaabi spordivigastuste korral 3)  oskab analüüsida ning korrigeerida sportlaste toitumist, orienteerub toidulisandite ja dopinguainete valdkonnas. \"Spordimeditsiin, harrastusspordi võlud ja valud 2\" toimub kaugõppena, kasutatades Moodle keskkonda. Täpsem info aine läbimise kohta on järgmine:\n\n1)  Palun tutvuge e-loengute, õppevideo materjalidega ja vastavate loenguslaididega. Kõik loengud on eelsalvestatud ja neid võib jälgida mis tahes ajal.\nLoengute juurde on lisatud kontrollküsimused valikvariantidega, millele tuleb vastata õigesti 85%-liselt. Testi sooritamise aeg on 5 minutit. Testi võib sooritada piiramatu arv kordi.\n\n2) Iseseisva töö juhis on esitatud Moodle's \n\n3) Vajalik osalemine ühes veebiseminaris\n\nValikaine saab arvestatud,  kui on vastatud loengute kontrollküsimustele, on osaletud veebiseminaris ja on täidetud iseseisva töö tingimus"}