{"KURSUSE_NIMI": "Harrastusspordi võlud ja valud", "KURSUSE_KOOD": "ARSM.00.015", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 34, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine annab ülevaate peamistest terviseprobleemidest, mis võivad esineda regulaarse sportimise korral. Antakse põhiteadmised erinevate kehaliste võimete arendamisest. Õpetatakse spordivigastuste ja tervisekahjustuste profülaktikat ning esmaabi.\nSeminarid toimuvad rühmades, täpsem informatsioon rühmadesse registreerimise ja teemade kohta antakse 1. loengus.Objectives/eesmärkid:  Anda ülevaade spordiga tegelemise kasulikkusest, kehaliste võimete arendamisest, sagedamini esinevatest tervisprobleemidest, sh ülekoormusvigastustest. Kuidas ennetada spordivigastusi?Learning outcomes/õpiväljund:  1) omandatakse põhiteadmised regulaarse kehalise aktiivsuse ja sportimise  soodsatest füsioloogilistest toimetest ja kehaliste võimete arendamisest 2 oskab hinnata sagedamini esinevaid ägedaid spordivigastusi 3) oskab anda esmaabi spordivigastuste korral 4) oskab hinnata sagedamini esinevaid skeleti-lihassüsteemi ülekoormusprobleeme \"Spordimeditsiin, harrastusspordi võlud ja valud\"  on võimalik läbida kaugõppena. Täpsem info aine läbimise kohta on järgmine:\n1) Loengute materjalid on lisatud Moodle'sse videoloengute ja loenguslaididena. \n2) Palun tutvuge seminarides käsitletavate materjalidega ning osalege vastavateemalistes seminarides (vajadusel veebiseminarid BBB-s)\n\nValikaine saab arvestatud, kui \na) olete omandanud loengutes ja seminardides käsitletud  materjalid\nb) olete osalenud seminaridel (sh veebiseminaridel)\nc)  olete läbinud nn kontrolltesti: Test koosneb valiikvariantidega küsimustest, millele tuleb vastata õigesti 80%-liselt. Testi võib sooritada piiramatu arv kordi."}