{"KURSUSE_NIMI": "Assistendi praktika", "KURSUSE_KOOD": "ARST.01.115", "EAP": 5, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Stomatoloogia propedeutika (õpetus hambaravimaterjalidest)", "Ortopeedilise stomatoloogia propedeutika", "Mälumisfüsioloogia I", "Professionaalne areng II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 130}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktikant töötab hambaarsti assistendina hambaraviteenust pakkuvates raviasutustes. Üliõpilane töötab igapäevastes ravisituatsioonides hambaarsti ja hambaravi assitendi/õe juhendamisel nelja ja/või kuuekäe süsteemis patsientide vastuvõtul. Üliõpilane töötab hambaravi kabineti sterilisatsiooniruumis/piirkonnas omandades praktika käigus instrumentide sterilisatsioonprotokollid ja oskuse neid kasutada ja neist aru saada.Objectives/eesmärkid:  * üliõpilane teab hambaravi assiteerimise põhialuseid\n* üliõpilane saab aru mis on hambaravi assisteerimise põhieesmärgid\n* üliõpilane kasutab oma assisteerimise alaseid teoreetilisi teadmisi praktilises töös\n* üliõpilane võrdleb oma hambaravi assiteerimise erialaseid teoreetilisi teadmisi reaalses  ülikoolivälises praktilises töös vajaminevatega\n* üliõpilane hindab oma assiteerimisealaseid teoreetilisi ja praktilisi teadmisi ja planeerib edasise õppe käigus puudujääkide kõrvaldamise\n* Ülõpilane oskab kasutada omandatud teadmisi ja oskusi praktikas ülikoolivälistes raviasutustes\n* Üliõpilane tutvub raviasutuse töökorraldusega ja osaleb raviasutuses vastavalt tutvunud töökorraldusega\n* Üliõpilane osaleb patsientide ravimisel assiteerimise teel kasutades oma teoreetilisi teadmisi järgidse eelnevalt tutvunud raviasutuse töökorraldusegaLearning outcomes/õpiväljund:  Töötades peale põhiõppe lõpetamist hambaarstina\n* teab õliõpilane hambaarsti assistendi töökohustusi, oskab teda tulevikus kontrollida ja juhendada\n* oskab rakendada teoreetiliselt omandatud teadmisi praktilises töös hambaarsti assistendina vastavalt programmile\n* hambaarsti tööd jälgides õpib täiendavalt hambahaigusi diagnoosima ja ravimeetodeid valima. Üliõpilane saab oma esimese tervishoiusüsteemi ja meeskonnatöö kogemuse."}