{"KURSUSE_NIMI": "Professionaalne areng II", "KURSUSE_KOOD": "ARST.01.109", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Professionaalne areng I", "Sissejuhatus kliinilisse hambaravisse"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 14, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine läbinud üliõpilane tunneb suhtlemisetiketti, ärisuhtlemise iseärasusi, seostab õpitut suhtlemisvajadustega tulevasel erialal või ametis ning oskab neid juhtumipõhiselt rakendada. Suudab kavandada ja läbi viia vestlusi, kirjutada ametlikku kirja ja esineda sõnavõtuga.\nAine omandamisel kasutatakse teoreetiliste loengute kõrval praktiliste ülesannete täitmist (tervitamine, kirja kirjutamine ja analüüs, vestluste planeerimine ja läbiviimine, rühmatööd, juhtumite lahendamine).\n1. Ealised iseärasused ja nendega arvestamine (patsiendid).\n2. Töötaja töövõime säilitamine. Stressi ja läbipõlemise vältimine.\n3. Kriitiline kuulamine ja lugemisoskus.\n4. Elukestev õpe. Isiksuse ja erialase arengu võti.\n5. Konfliktsituatsioonid suhtlemisel ja enesekehtestamisel.Objectives/eesmärkid:  Aine läbinud üliõpilane tunneb patsientide ealisi iseärasusi, oskab kriitiliselt kuulata, lugeda ja otsustada, oskab koostada ja kinni pidada aja ratsionaalse kasutamise reeglitest, vältida läbipõlemist, teab isiksuse arendamise võimalusi elukestva õppesüsteemis ning oma kohta ja rolle selles.Learning outcomes/õpiväljund:  1. Suhtlemine erinevate patsiendirühmadega (lastest vanuriteni) - rollimäng.\n2. Kriitiline kuulamine. Kriitiline lugemine. Ülesannete lahendamine ja otsustamine.\n3. Kuhu kaob aeg? Isiklik ajakava ja selle analüüs ning parandusettepanekud (harjumised, hobid jne).\n4. Elukestev õppesüsteem ja meediku roll selles (erialane sõnavõtt).\n5. Suhtlemine konfliktsituatsioonis, enesekehtestamine (rollimäng).\n\nAine omandamisel kasutatakse teoreetiliste loengute kõrval praktiliste ülesannete täitmist.\nRühma suurus kuni 25 üliõpilast."}