{"KURSUSE_NIMI": "Laste kirurgiline stomatoloogia", "KURSUSE_KOOD": "ARST.01.005", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Mälumisfüsioloogia I", "Suu- ja näolõualuukirurgia I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 40, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine annab ülevaate näo-lõualuude piirkonna kirurgilistest haigustest lastel. Üliõpilane omandab teadmised laste puhul läbiviidavast lokaal- ja üldanesteesiast, põletikulistest haigustest näo-lõualuude piirkonnas, hammaste eemaldamise näidustustest ja vastunäidustustest, lümfadeniidi kliinilistest sümptoomidest, ravist ja differentsiaaldiagnostikast. Laste trauma osas käsitletakse hammaste ja lõualuude murde, diagnoosimist ja ravimeetodeid. Kaasasündinud näo-lõualuude anomaaliate korral käsitletakse huule-suulaelõhede etioloogiat, patogeneesi, sümptomatoloogiat, kompleksraviplaani tegemist ning kirurgilise ravi erinevaid meetodeid. Käsitletakse kaasasündinud branhiogeense-, türeoglossaalse tsüsti ja fistli, dermoidtsüsti, lümf- ja hemangioomi etiopatogeneesi, diagnostika ja ravimeetodeid.\nPraktikumid viiakse läbi Stomatoloogia kliiniku näo-lõualuudekirurgia osakonnas ja Stomatoloogia kliiniku suukirurgia osakonnas, kus üliõpilased õpivad diagnoosima, raviplaani koostama ja läbi viima lihtsamaid protseduure polikliiniku tingimustes. Üliõpilane koostab ja esitab akadeemilise haigusloo. Üliõpilane teeb iseseisvalt kliinilist tööd, analüüsib igat oma tööd praktikat juhendava õppejõuga, tagasisidestatud protseduurid kannab oma e-portfooliosse.Objectives/eesmärkid:  Anda teadmised erinevate lastel esinevate kirurgiliste stomatoloogiliste haiguste etioloogia, diagnostika ja ravi kohta erinevates vanuseperioodides.Learning outcomes/õpiväljund:  * Teab teoreetiliselt näo-lõualuude kasvu ja arengut, näo-lõualuude piirkonnas esinevate kirurgiliste haiguste etioloogiat, sümptomatoloogiat, diagnostika meetodeid ja kirjeldab ravi võimalusi arvestades lapse vanust.\n* Oskab diagnoosida erinevaid haigusi näo-lõualuupiirkonnas, rakendada erinevaid diagnostika meetodeid ja koostada raviplaani."}