{"KURSUSE_NIMI": "Lastestomatoloogia I", "KURSUSE_KOOD": "ARST.01.120", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Ortodontia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "p‰evaıpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus sisaldab loenguid ja praktikume. Aine k‰igus k‰sitletakse hammaste, parodondi ja suulimaskesta haiguste etioloogilisi tegureid, patogeneesi, diferentsiaal diagnostikat ja ravi ise‰rasusi lastel. K‰sitletakse arengu k‰igus tekkivaid hambakudede muutusi. ’pitakse hambakaariese kulgu, seda mıjutavaid tegureid, kaariese erinevaid staadiume ja nende ravi piimahammaskonnas. K‰sitletakse kaariese pıhilisi komplikatsioone:pulpiit ja periodontiit, nende diagnostika ja diferentsiaaldiagnostika meetodeid ja ravi erinevaid vıimalusi piima-ja vahelduvas hammaskonnas, ning juurte formeerumise perioodi j‰‰vhammaskonnas. ’pitakse hindama parodondi seisundit laste hammaskonnas, k‰sitletakse lapseea sh. juveniilse parodontiidi diagnostikat ja ravi meetodeid. ’pitakse erinevaid haigusi, mille kliinilised n‰hud avalduvad limaskestal. Pıhjalikumalt k‰sitletakse lastel enamesinevaid stomatiite ja nakkushaigustega seotud muutusi suuııne limaskestal.Objectives/eesm‰rkid:  Anda teadmisi erinevate suuııne ja hambahaiguste etioloogiast, diagnoosimisest ja ravist lastelLearning outcomes/ıpiv‰ljund:  The course includes lectures and practical trainings. Etiological factors, pathogenesis and characteriatic features of treatment of dental-,pulpal-,periodontal-and oral mucosal diseases in children will be covered during the course. Changes of dental tissues which occur during development will be covered. The course of caries, its affecting factors, different stages of caries and their treatment in decidous-, changing-and permanent teeth and in the period of root formation. The diagnostics and treatment methods of childhood periodontitis including agressive periodontitis will be covered. Various diseases will be learned which have mucosal clinical signs. More frequent changes of oral mucosa associated with infectious diseases will be covered in detail. Traumatic injures of the teeth will be covered."}