{"KURSUSE_NIMI": "Professionaalne areng I", "KURSUSE_KOOD": "ARST.01.108", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 1, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sügissemestril\nProfessionaalne areng I on hambaarsti õpinguid alustavale tudengile mõeldud sissejuhatav õppeaine. \nTutvustatakse akadeemilist keskkonda, õppimist ja käitumist.\n Kevadsemestril\nAine läbinud üliõpilane tunneb suhtlemisetiketti, ärisuhtlemise iseärasusi, seostab õpitut \nsuhtlemisvajadustega tulevasel erialal või ametis ning oskab neid juhtumipõhiselt rakendada. Suudab kavandada ja läbi viia vestlusi, kirjutada ametlikku kirja ja esineda sõnavõtuga.\nAine omandamisel kasutatakse teoreetiliste loengute kõrval praktiliste ülesannete täitmist (tervitamine, kirja kirjutamine ja analüüs, vestluste planeerimine ja läbiviimine, rühmatööd, juhtumite lahendamine).\nAine koosneb kolmest moodulist: intervjueerimistehnikad (küsitlemine ja kuulamisoskused), probleemsete olukordadega toimetulek (konflikt, enesekehtestamine) ning mõjutamise ja veenmise võtted. Moodulid on üles ehitatud praktilise treeninguna, kusjuures osalejad valmistavad end kodulugemise abil ette ning harjutavad õpitud oskusi kodutööna seminari järgsel ajal.Objectives/eesmärkid:  Aine eesmärgiks sügissemestril - on tutvustada ülikoolis õppimise eripära ja anda põhilised teadmised, mis on vajalikud hambaarstiks õppimiseks. Arendada üliõpilaste ülekantavaid oskusi ja toetada kuuluvustunde tekkimist. Aine eesmärk kevadsemestril - on harjutada suhtlemisoskusi arst-patsiendi vahelise suhte kontekstis.Learning outcomes/õpiväljund:  Sügissemestril\nAine läbinud üliõpilane\na.\ton analüüsinud hambaarsti tööks vajalikke oskusi ja teadmisi ning teadvustanud enda õpivajadused\nb.\ton analüüsinud ennast õppijana, teinud õppimise ajaplaani ning oskab valida enda jaoks sobivad õpistrateegiad\nc.\ton kogenud koostööd ning analüüsinud selleks vajalikke tingimusi ja oskusi\nd.\ton arutlenud eetiliste aspektide üle hambaarstiõppes\ne.\treflekteerib õpitut isiklikus e-portfoolios\nHindamine: test, kodutööd\n\nKevadsemestril\na.\tteab ja oskab rakendada peamisi intervjueerimistehnikaid;\nb.\toskab ära tunda konflikt-olukordi arsti-patsiendi suhetes ja teab toimetulekuviise;\nc.\tteab ja oskab rakendada patsiendi veenmise strateegiaid.\nAine läbinud üliõpilane oskab kavandada ja juhtida vestlusi, tunneb nende metoodikat: \n-\toskab esineda sõnavõtuga;\n-\toskab etiketikohaselt käituda;\n-\toskab koostada  ja analüüsida ametikirju, sh e-kirju;\n-\toskab lahendada tüüpilisi erialaseid probleemsituatsioone.\n\nHindamine: vestlemine erinevate sihtgruppidega (vestluse plaan, rollimäng, videotagasiside), CV koostamine ja analüüs, töökuulutuste analüüs ja motivatsioonikirja koostamine."}