{"KURSUSE_NIMI": "Suu- ja hambahaigused I", "KURSUSE_KOOD": "ARST.01.111", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Stomatoloogia propedeutika (õpetus hambaravimaterjalidest)", "Ortopeedilise stomatoloogia propedeutika", "Mälumisfüsioloogia I", "Suu- ja hambahaiguste propedeutika I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 64}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "V semestril kliinilise töö käigus õpivad tudengid täitma hambaravikabinetis kehtestatud hügieeninõudeid, sealhulgas, koristama raviboksi ning võtma instrumente ja tarvikuid üldkasutatavatest kappidest aseptika nõudeid järgides. Üliõpilane õpib kliinilist tööd tegema ergonoomia nõudeid järgides koos abilisega; suhtlema patsientidega nii iseseisvalt kui ka grupitasandil; kliinilise töö käigus õpivad üliõpilased patsienti uurima, panema diagnoosi, koostama raviplaani ning püstitama prognoosi ja määrama kontrollvisiitide sagedust, samuti suunama lisauuringutele ja vajadusel spetsialistile järelravile; hindama kaariesesse haigestumise riski ning riskitegureid kontrollima ja kõrvaldama. Üliõpilane teeb iseseisvalt kliinilist tööd, analüüsib igat oma tööd praktikat juhendava õppejõuga, tagasisidestatud protseduurid kannab oma e-portfooliosse.\n\nVI semestri jooksul üliõpilane lihvib oma oskusi suhtlemisel patsientidega, patsiendi uurimisel, diagnoosimisel, raviplaani koostamisel ja selle elluviimisel ning vajadusel edasisuunamisel spetsialistile. Üliõpilane õpib  praktiliselt ravima pulbi ja periapikaalse piirkonna patoloogilisi seisundeid ja mõistma diagnoosimise, raviplaani koostamise ja järelkontrollide tähendust praktilises endodontilise ravi kuuris.Objectives/eesmärkid:  Eesmärgiks on õppida rakendama aseptikat ja antiseptikat hambaravi kabinetis, ergonoomikat, uurima haiget, ravi plaani tegema, analüüsima hambakaariese riskitegureid, diagnoosima ja ravima  hambakaariest, pulbi ja  periapikaalse piirkonna patoloogilisi seisundeid.Learning outcomes/õpiväljund:  Kursuse lõpetamisel üliõpilane teab ergonoomika, aseptika ja antiseptika nõudeid töötamisel hambaravi kabinetis. Ta oskab suhelda  patsientide ja kolleegidega, uurida haiget, püstitada kaariese ja pulpiidi diagnoosi, hinnata kaariese riskitegureid ja koostada tõenduspõhise raviplaani, ravida hambakaariest ja pulbi- ning periradikulaarset patoloogiat."}