{"KURSUSE_NIMI": "Terved hambad kõigile", "KURSUSE_KOOD": "ARST.01.116", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus toimub sügissemestril septembrist detsembrini ja materjalide läbitöötamiseks kulub maksimaalselt 26 tundi (1 EAP).\nKursus on koostatud Tartu Ülikooli hambaarstiteaduse instituudi õppejõudude poolt. Kursuse toimumise ajal hoiavad e-õppe kursusel silma peal Riina Runnel ja Estelle Saavaste. Teie küsimustele annavad vastuseid meie erinevate erialade spetsialistid.\nKursus on 100% veebipõhine. Üliõpilane tutvub materjalidega, esitab kodutöö, lahendab situatsioonülesandeid ning sooritab testid (hindamine on mitteeristav). On vaja tutvuda nii Moodles kui ka veebilehel aadressiga www.ut.ee/tervis/hambad oleva materjaliga. Uute hambapastade kohta leiate lisainfot antud materjalide hulgast. Ülesannete kirjeldused on toodud kursuse avalehel. Lõpuks tuleb sooritada lõputest. Test on sooritatud positiivselt, kui 100% vastustest on õiged. Lõputesti saab sooritada piiramatu arv kordi.\nLoodame, et edaspidi käite ise ja soovitate ka oma sõpradel-tuttavatel külastada hambaarsti kaks korda aastas.\nAlustan kursuse tutvustamist moodsa vanasõnaga: \"Aita ennast ise, siis aitab sind ka hambaarst.\"\nTeadmised hammaste hoolduse eripära kohta erinevatel eluperioodidel võiksid olla igal inimesel, et hoolitseda enda ja oma lähedaste eest. Lihtsustatud ülevaade muutustest suulimaskestal võiks aidata inimestel kiiremini jõuda hambaarstile. Väiksemad mured - lihtsamad lahendused.\nEestis tuleb täiskasvanute hambaravi puhul rääkida ka rahast. Samas laste hammaste ravi eest tasub Eesti Haigekassa ja ka seda suurepärast võimalust ei kasutata maksimaalselt.\nKokkuvõtteks: loodame teile anda ülevaate hambaraviga seotud teemadest.Objectives/eesmärkid:  Suu tervise ja haiguste ennetamise kohta esitatud informatsioon on vajalik igale kõrgharidusega inimesele. Eesmärgiks on tedmiste omandamine hambahaiguste vältimisest, millised on hambaravi võimalused ja milline on hambaravi teenuste eest tasumine.Learning outcomes/õpiväljund:  Kursuse lõpetanu * teab hambahaiguste vältimise võimalusi * teab täpselt milliste hambaraviteenuste eest tasub Eesti Haigekassa ja milliseid hüvitisi makstakse * teab rohkem hambaravi võimalustest ja vajadustest eri eluperioodidel * saab kasutada kursuse materjalide hulgas olevaid faile, et õpetada väikelapsele, algklassiõpilasele õiget toitumist ja hammaste pesemist"}