{"KURSUSE_NIMI": "Suu- ja hambahaigused II", "KURSUSE_KOOD": "ARST.01.096", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Suu- ja näolõualuukirurgia I", "Suu- ja hambahaigused I", "Ortopeediline stomatoloogia I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 52}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilased kinnistavad oma praktilise töö oskusi  kaariese ja kaariesekomplikatsioonide ravis (ulatuslikud hambakudede direktsed restauratsioonid, mitmejuureliste hammaste endodontiline ravi) ning teostavad lihtsamaid parodondi haiguste ravi etappe. 8. semestri põhiülesanne on õppida diagnoosima ja ravima parodondi haigusi. \nIga nädal toimuvas praktikumis üliõpilane ravib parodondi patoloogiaga  patsiente alustades raviplaani koostamisest kuni täieliku sanatsioonini. Üliõpilane teeb iseseisvalt kliinilist tööd, analüüsib igat oma tööd praktikat juhendava õppejõuga, tagasisidestatud protseduurid kannab oma e-portfooliosse.Objectives/eesmärkid:  Üliõpilased kinnistavad oma praktilise töö oskusi kaariese ja kaariese komplikatsioonide ravis: ulatuslikud hambakudede direktsed restauratsioonid; komposiittäidiste keerukad värvilahendused; mitmejuureliste hammaste endodontiline ravi ja teostavad lihtsamaid parodondi haiguste ravi etappe.\n8. semestri põhiülesanne on õppida diagnoosima ja ravima parodondi haigusi. \nIga nädal toimuvas praktikumis üliõpilane ravib parodondi patoloogiaga patsiente alustades raviplaani koostamisest kuni täieliku sanatsioonini. Loengutes käsitletakse suu limaskesta haigusi.Learning outcomes/õpiväljund:  Kursuse läbinu oskab teha suuri ülesehitusi hammastele, ravida endodontiliselt kitsaste juurekanalitega hambaid; uurida parodondi patoloogiaga haiget ja püstitada diagnoosi; koostada parodontiidi raviplaani konkreetsele haigele; eemaldada supra- ja subgingivaalseid ladestusi; anda esmaabi; määrata ravimeid parodontiidiga patsiendile; hinnata riskitegureid ja motiveerida patsienti koostööks parodontiidi ravis."}