{"KURSUSE_NIMI": "Lastestomatoloogia II", "KURSUSE_KOOD": "ARST.01.121", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 6, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus sisaldab loenguid ja praktikume. Aina käigus käsitletakse hammaste, parodondi ja suulimaskesta haiguste etioloogilisi tegureid, patogeneesi, diferentsiaal diagnostikat ja ravi iseärasusi lastel. Käsitletakse arengu käigus tekkivaid hambakudede muutusi. Õpitakse hambakaariese kulgu, seda mõjutavaid tegureid, kaariese erinevaid staadiume ja nende ravi piimahammaskonnas. Käsitletakse kaariese põhilisi komplikatsioone: pulpiit ja periodontiit, nende diagnostika ja diferentsiaaldiagnostika meetodeid ja ravi erinevaid võimalusi piima- ja vahelduvas hammaskonnas ning juurte formeerumise perioodi jäävhammaskonnas. Õpitakse hindama parodondi seisundit laste hammaskonnas, käsitletakse lapseea sh juveniilse parodontiidi diagnostikat ja ravi meetodeid. Õpitakse erinevaid haigusi, mille kliinilised nähud avalduvad limaskestal. Põhjalikumalt käsitletakse lastel enamesinevaid stomatiite ja nakkushaigustega seotud muutusi suuõõne limaskestal.Objectives/eesmärkid:  Anda teadmisi erinevate suuõõne ja hambahaiguste etioloogiast, diagnoosimisest ja ravist lastel.Learning outcomes/õpiväljund:  1) teab teoreetilisi teadmisi lapse arengust ja füsioloogilistest eripäradest\n2) teab piima- ja jäävhammaste mineralisatsiooni häirete etioloogiat, diagnoosimist ja ravi. Oskab diagnoosida hammaste lõikumise anomaaliaid ja hammaste kuju ning arvu anomaaliaid.\n3) oskab läbi viia hammaste röntgenoloogilist uuringut lastel\n4) oskab diagnoosida ja ravida kaariest piima- ja jäävhammastel\n5) omab teadmisi traumadest piima- ja äsja lõikunud jäävhammaskonnas. Oskab diagnoosida ja ravida hamba traumasid\n6) teab kaariese komplikatsioonide erinevaid ravimeetodeid ja oskab neid kasutada piimahammaskonnas ja formeerumata juuretippudega jäävhammastel\n7) suudab diagnoosida ja ravida parodondi haigusi lastel ja noorukitel\n8) oskab diagnoosida ja eristada suus avalduvaid infektsioone lastel\n9) teab krooniliste haigustega ja puuetega laste ravi iseärasusi ja arvestab nendega ravi läbiviimisel"}