{"KURSUSE_NIMI": "Mälumisfüsioloogia II", "KURSUSE_KOOD": "ARST.01.126", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Suu- ja näolõualuukirurgia I", "Suu- ja hambahaigused I", "Ortopeediline stomatoloogia I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 16}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Üliõpilane saab aru mälumissüsteemi e. stomatognaatse süsteemi seotusest lokaalselt hammaskonnaga ja üldiselt kogu terve organismiga. Üliõpilane on tuttav mälumissüsteemi füsioloogiliste funktsioonidega ja patofüsioloogiliste mehhanismidega. Üliõpilane mõistab alalõualiigese omavahelist ühendust ja seotust kõrvalasetsevate struktuuridega, on võimeline diagnoosima ja ravima mälumissüsteemi häireid (alalõualiigese- ja lihaspatoloogiaid).Objectives/eesmärkid:  Antud kursuse eesmärk on integreerida anatoomias, füsioloogias, suu- ja hambahaiguste erilas, ortopeedilises stomatoloogias, ortodontias, suu- ja näolõualuukirurgias ning radioloogias omandatud tedmised ja praktilised kogemused mälumisfüsioloogia eriala omandamiseks, kuna hästi funktsioneeriv mälumissüsteem on iga hambaravi lõppeesmärk.Learning outcomes/õpiväljund:  Tudeng saab aru mälumissüsteemi e. stomatognaatse süsteemi seotusest lokaalselt hammaskonnaga ja üldiselt kogu terve organismiga.\nTudeng on tuttav mälumissüsteemi füsioloogiliste funktsioonidega ja patofüsioloogiliste mehhanismidega.\nTudeng mõistab alalõualiigeste omavahelist ühendust ja seotust kõrvalasetsevate struktuuridega.\nTudeng on võimeline teostama patsiendi mälumissüsteemi kliinilist eksamineerimist (hambumuse hindamine, röntgenogrammide interpreteerimine jne), diagnoosima ja esmatasandil ravima mälumissüsteemi häireid (alalõualiigese- ja lihaspatoloogiaid) ning vajadusel oskama patsienti edasi suunata teiste erialade (ortodont, näo-lõualuude kirurg jt) spetsialistide poole."}