{"KURSUSE_NIMI": "Suhtlemise ja tervisekäitumise alused", "KURSUSE_KOOD": "ARTH.02.082", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 21, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 71, "individual_work": 0, "internship": 4}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sisu lühikirjeldus\nSuhtlemise ja tervisekäitumise aluste aine keskmes on suhtlemise baasoskused ja nende rakendamise võimalused patsiendiga konsultatsiooni läbiviimisel ja tervisekäitumise edendamisel. Käsitletav kontekst lähtub Calgary-Cambridge konsultatsioonimudelist, mida sisustavad motiveerivast intervjueerimisest lähtuvad suhtlemisvõtted. Mõlemad lähenemised on tõenduspõhised ning leidnud meditsiinivaldkonnas laialdast rakendamist. \n\nAines omandatakse teadmised ja oskused õppematerjalidega tutvumise, analüüsimise, praktiseerimise ja arutelude kaudu. Aine jaguneb iseseisvaks õppeks ja kontaktõppeks ning sellel on Moodle tugi. Moodle keskkonnas paiknevad õppematerjalid ja õpijuhised ning seal saab sooritada teste ja sinna tuleb esitada oma iseseisvad tööd. Moodle vahendusel toimub hindamine ja iseseisvate tööde tagasisidestamine. Kujundavat tagasisidet saavad õppijad ka praktikumides nii õppejõult kui kaasõppijatelt.\n\nÕppematerjalideks on interaktiivsed õpiobjektid, mis sisaldavad videoloenguid, linke ja viiteid õppekirjandusele ning kinnistavaid ülesandeid ja enesekontrolli teste. Aine keskne õppemeetod lähtub ümberpööratud klassiruumist, kus teemekohane materjal omandatakse enne ja koha peal praktikumides rakendavad õppijad eelnevalt omandatud teadmisi praktikas situatsioonülesannete lahendamisel. Praktikumides harjutatakse nt konsultatsiooni alustamise, info kogumise ja jagamise põhimõtteid, kuidas hoida struktuuri ja koostöölisi suhteid patsiendiga, jagatud raviotsuste/plaanide tegemiseni välja. \n\nAines käsitletakse muid patsiendiga suhtlemise kulgu ja ravisoostumist mõjutada võivad teemasid: hoiakud ja väärtused, suhtlemistõkked, otsustusprotsessi mõjutavad tegurid ning nende seosed konfliktide tekkimise ja ravivigadega.  Lisaks käsitletakse aines laiemalt tervisekäitumist mõjutavaid tegureid ning kitsamalt erinevate haavatavate gruppidega (nt lapsed, noorukid).\nObjectives/eesmärkid:  Aine läbinud õppur saab aru inimese käitumist mõjutavatest füüsilistest, psüühilistest ja sotsiaalsetest tagamaadest (teguritest) ja oskab tüüpülesannetes rakendada tõenduspõhiseid suhtlemise võtteid patsiendiga konsultatsiooni läbi viimisel (sh anamneesi võtmisel).Learning outcomes/õpiväljund:  Õppeaine läbinud õppijad: (1) Oskavad rakendada Cambridge-Calgary mudelit ja motiveerivast intervjueerimisest lähtuvaid suhtlemise põhioskusi, arvestades patsiendi ja arsti perspektiive tervikliku ja isikukeskse tervishoiuteenuse tagamisel.\n(2) Mõistavad empaatia olemust ning oskavad uurida patsiendi ideid, muresid ja ootusi (IMO) ning kasutada uuri-paku-uuri mudelit efektiivseks infovahetuseks ja patsientide kaasamiseks otsustusprotsessi. \n(3) Rakendavad eesmärgipäraselt suhtlemisvõtteid situatsioonülesannetes ja konsultatsioonil, toetades patsiendi autonoomiat ja aktiivset osalust.\n(4) Teavad tervishoiule ligipääsu mõjutavaid tegureid ja sotsiaaldemograafiliste tunnuste mõju tervisele.\n(5) Mõistavad hoiakute ja väärtuste mõju suhtlemise kvaliteedile ning oskavad rakendada konfliktide lahendamise võtteid situatsioonülesannetes. \n(6) Oskavad anda konstruktiivset tagasisidet ja tegeleda eneserefleksiooniga, et pidevalt parandada oma suhtlemisoskusi ja professionaalset arengut. "}