{"KURSUSE_NIMI": "Praktika rahvatervishoius", "KURSUSE_KOOD": "ARTH.00.038", "EAP": 12, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Rahvatervishoiu alused", "Biostatistika meetodid rahvatervishoius", "Tervisedenduse alused", "Tervisemõjurid", "Teadustöö alused", "Epidemioloogia ja uurimismeetodid terviseteadustes", "Tervishoiu organisatsioon ja seadusandlus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 136, "individual_work": 0, "internship": 160}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktika käigus omandatakse praktilise töö kogemusi rahvatervishoiu valdkonnas tegutsevates  riiklikes asutustes, mittetulunduslikes ettevõtetes või koolitus- ja konsultatsioonifirmades (Terviseamet, Sotsiaalministeerium, Haigekassa, Tervise Arengu instituut, TÜ arstiteaduskond, haiglad, perearstikeskused, Praxis jt). Osalemine asutuse arendustegevuses või projektis. Tööülesannete täitmine juhendaja abiga ja iseseisvalt ning oma tegevuse hindamine. Praktikana arvestatakse ka aktiivset osalemist teadusuuringu kavandamisel, läbiviimisel ja analüüsil (magistritöö) juhendaja juhendamisel.Objectives/eesmärkid:  Aine eesmärgiks on õppida praktiseerima ühes rahvatervishoiu valdkonnas, rakendades loovalt teoreetilisi teadmisi, oskusi ja väärtusi.Learning outcomes/õpiväljund:  Üliõpilane: 1. oskab otsida, koguda ja analüüsida andmeid, mis aitavad kaasa tõenduspõhisele tegevusele rahvatervishoius 2. rakendab iseseisvalt teoreetilisi teadmisi oma praktilises tegevuses 3. oskab töötada meeskonnas ja analüüsida oma rolli tähtsust 4. oskab hinnata oma erialaste teadmiste ja oskuste arengut 5. oskab kirjeldada ja analüüsida oma praktikaasutuse funktsioone, tööprotsesse, organisatsiooni toimimist, ja -kultuuri. Praktika mahuks praktikabaasis on 160 astronoomilist tundi (4 nädalat), mille võib planeerida kokkuleppel asutusega  pikema ajaperioodi peale."}