{"KURSUSE_NIMI": "Traumatoloogia ja ortopeedia", "KURSUSE_KOOD": "ARTO.01.018", "EAP": 1.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 19, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Traumatoloogia on üks osa ainest \"Diagnostika alused\".\nKursuse jooksul läbitakse 4 loengust koosnev tsükkel, mille jooksul käsitletakse traumatoloogia ja ortopeedia üldküsimusi, termilist traumat, luumurdude diagnostikat, pehmete kudede vigastusi, luumurdude ravi ja nende tüsistused ning ortopeedilisi operatsioone. Nelja praktikumi jooksul käsitletakse traumahaige uurimist, kuidas võtta anamneesi ja läbi viia objektiivset uuringut, aga ka kasutada instrumentaalseid ja radioloogilisi uurimismeetodeid. Samuti õpetatakse luumurruga haige käsitlust, millal rakendada konservatiivset ja millal operatiivset ravi, kuidas käsitleda termilise traumaga patsienti. Osa õpetusest viiakse läbi praktilise tegevusena patsiendi juures. Käsitletakse ka osteoporoosi, selle epidemioloogiat ja diagnoosimist. Traumapunkti praktikumis antakse esmane ülevaade traumahaige käsitlusest. Mida esmasel visiidil haige puhul märgata, kuidas kirjeldada ja milliseid ravivõtteid kasutada. Käsitletud saavad järgmiste vigastuste esmane ülevaatus ja ravi traumapunkti ulatuses: põrutused, hematoomid, haavad, lihas – ja kõõlusvigastused, luumurrud, liigeste nihestused.Objectives/eesmärkid:  Anda ülevaade traumatoloogia ja ortopeedia olemusest käsitledes eriala üldküsimusi.  Õpetada eriala terminoloogiat, luumurruga ja pehmete kudede vigastusega haigete uurimise metoodikat, diagnostikat, ravi aluseid ja tüsistusi.Learning outcomes/õpiväljund:  Läbinud kursuse, üliõpilane: •\ttunneb skeletisüsteemi uurimist •\ttunneb traumatoloogias ja ortopeedias kasutatavat terminoloogiat •\ton võimeline aru saama ortopeediliste haiguste raviprintsiipidest •\ton võimeline aru saama skeletisüsteemi traumade raviprintsiipidest •\ton võimeline aru saama termilise trauma raviprntsiipidest •\ttunneb eespool nimetatud seisundite esmaabi In case of all arising questions please ask secretary of the department (Kaire Kallas, Block H, 1st floor, dept of orthopaedic surgery)  kaire.kallas@kliinikum.ee"}