{"KURSUSE_NIMI": "Eesti kunst pärast II maailmasõda", "KURSUSE_KOOD": "FLAJ.05.091", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Eesti kunst peale II Maailmasõda hõlmab perioodi alates 1945. aastast kuni tänapäevani. Aine esitamisel on lähtutud järgmistest printsiipidest: \na) Aine on esitatud lähtudes tänapäevasest uurimisseisust.  \nb) Aine esitamisel on aluseks ajalisuse printsiip, mis loob abistava koordinaadistiku nagunii abstraktses konstrueerimis-ja fikseerimisprotsessis.\nc) Ajalise telje sees on aine  struktueeritud nende probleemide ümber,  mis on hilisemale kujunemisele kõige olulisemat mõju avaldanud. \nd) Aine on jagatud 32 tunnile ehk 16 loengule, mis omakorda moodustavad 4 etappi. Esimene etapp esitab sissejuhatuse ainesse ning tutvustab viimastel aastatel esitatud uusi analüüse ja interpretatsioone ainest,  käsitleb  sotsialistliku realismi toomist Eesti kunsti ning lõpeb esteetilise positsiooni taaskehtestamisega eesti kunstis (loengud 1-6). Teine etapp käsitleb paradigma muutusi eesti kunstis, eesti vangardkunsti  ja selle lõpetamist 1980.aastate stagnatsiooniperioodil (loengud 7-10). Kolmas etapp käsitleb postmodernistliku ideoloogia jõudmist eesti kunsti, uut rahvusromantismi lainet  (loengud 11-14).  Neljas etapp käsitleb muutusi, mis algasid 1990.aastate kunstis ja kunstielus, institutsionaalseid muutusi ning uue tehnoloogia ja uue meedia mõju ja tähendust eesti kunstis (loengud 15-16).Objectives/eesmärkid:  a) Anda ülevaade kunstiprotsessidest ja kunstnike loomingust kogu sõjajärgse perioodi jooksul.\nb) Anda ülevaade nii ajaloolisest kui kaasaegsest kontekstist,  ideedest ja liikumistest, mis on mõjutanud sõjajärgset kunsti Eestis.Learning outcomes/õpiväljund:  Üliõpilane saab ülevaate kunstiprotsessidest kogu sõjajärgse perioodi jooksul."}