{"KURSUSE_NIMI": "Uusim aeg", "KURSUSE_KOOD": "FLAJ.06.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus arutleb, kas Uusim aeg on eraldiseisev ajaloodistsipliin, kas teda eristab teisest ajaloo valdkondadest mingisugune eriline meetod ning kuidas tuleks uusimat aega kronoloogiliselt piiritleda. Selleks vaadeldakse 19. sajandi lõpu, 20. sajandi ja 21. sajandi  ajalugu eri vaatepunktidest, tutvustatakse ajaloo eri valdkondi (majandusajalugu, kultuuriajalugu jne),  neile omaseid teooriaid ja kontseptsioone, ning kaardistatakse tähtsamaid tänapäeva maailma ning tulevikku mõjutavaid ajaloolisi sündmusi ja protsesse.Objectives/eesmärkid:  Uusima aja (Contemporary History, histoire contemporaine, Zeitgeschichte) eesmärgiks on selgitada lähimineviku sündmusi ja protsesse ning tänapäeva arenguid ja suundmusi analüüsides neid historistlikult, s-o kontseptualiseerides, kontekstualiseerides ja narrativeerides. \n\nAjaloo ülesandeks on juhatada kätte kaasaja asjade lähted, sest \"tegelikkust ei mõista kunagi paremini kui tema põhjuste kaudu\" (G. W. Leibniz), kuid ajaloolane ei pea esile tõstma vaid seda, mis on jäänud (nn võitjate ajalugu, \"Ajalugu\" E. H. Carri mõistes), vaid ka arenguvõimalusi, mis ei täitunud juhuse, eksituse, inimliku valiku vms tõttu (arheoloogia ja geneoloogia - M. Foucault). \n\nUusim aeg lähtub Marc Blochi tõdemusest, et \"oleviku mittemõistmine sünnib paratamatult mineviku mittetundmisest\" ning järgnevast paradoksaalsest oletusest: \"Aga võib-olla on sama asjatu püüda mõista minevikku, kui ei tea midagi olevikust.\" Lähtudes E. H. Carrist tuleb möönda, et \"Olevik eksisteerib pelgalt kujuteldava eraldusjoonena mineviku ja tuleviku vahel ... huvi mineviku ja huvi tuleviku vahel on läbipõimunud.\" Kuigi kõik head ajaloolased säilitavad aktiivse kokkupuute oleviku (või tulevikuga - Carr), on kaasaja sündmuste ja protsesside jälgimine eriti oluline uusimale ajale. Mineviku analüüs toimub kahekõnes tänapäeva maailmaga, ja selleks kasutatakse humanitaar- ja sotsiaalteadustest laenatud meetodeid ja mõisteid.\n\nKursus arutleb, kas Uusim aeg on eraldiseisev ajaloodistsipliin, kas teda eristab teisest ajaloo valdkondadest eriline meetod ning kuidas tuleks uusimat aega kronoloogiliselt piiritleda. Selleks vaadeldakse 19. sajandi lõpu, 20. sajandi ja 21. sajandi ajalugu eri vaatepunktidest, tutvustatakse ajaloo eri valdkondi (majandusajalugu, kultuuriajalugu jne), neile omaseid teooriaid ja kontseptsioone, ning kaardistatakse tähtsamaid tänapäeva maailma ning tulevikku mõjutavaid ajaloolisi sündmusi.Learning outcomes/õpiväljund:  Kursuse eduka läbimise järel üliõpilane\n1) oskab arutleda Uusima aja kui ajaloodistsipliini meetodite ja põhiprobleemide üle,\n2) oskab diskuteerida uusima aja dateerimise eri võimaluste üle,\n3) tunneb Uusima aja eri valdkondi, nende põhilisi lähenemisnurki ja kontseptsioone,\n4) oskab nimetada uusima aja olulisemaid sündmusi ja arenguid."}