{"KURSUSE_NIMI": "Eesti keele võõrkeelena õpetaja põhipraktika", "KURSUSE_KOOD": "FLEE.04.221", "EAP": 6, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Eesti keele kui teise keele didaktika I", "Pedagoogiline praktikum II", "Võõrkeelte õpetamise pidev praktika", "Keeleõppe kavandamine ja hindamine", "Keeleõppe teooriad ja meetodid", "Eesti keele kui teise keele didaktika II", "Eesti keele struktuur", "Eesti keele võõrkeelena grammatika erikursus", "Pidev pedagoogiline praktika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 30}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Praktika koosneb vaatluspraktikast ja õpetamispraktikast.\nTutvutakse praktikakoolidega ning õpetajate tööga, analüüsitakse õpetajate ja praktikantide tunde; antakse eesti keele ja kirjanduse tunde ning analüüsitakse neid.Objectives/eesmärkid:  1) toetada üliõpilase kujunemist õpetajaks, luues võimalused eelnevalt läbitud õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses;\n2) luua võimalused õppe- ja kasvatustöö kui terviku tundmaõppimiseks ja läbiviimiseks kompaktse õppeperioodi vältel;\n3) võimaldada ainedidaktiliste põhimõtete rakendamist.Learning outcomes/õpiväljund:  Praktika lõpuks üliõpilane  1) oskab kavandada, ette valmistada, läbi viia, analüüsida ja hinnata oma õppe- ja kasvatustöö alaseid tegevusi; 2) oskab õpet kavandades ja läbi viies ning õppijaid toetades arvestada nende eripära, eelteadmiste, vajaduste (sh erivajaduste) ning huvidega; 3) kavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja/või õppeaine eripärast ning õppijate vajadustest ja huvidest; 4) integreerib tulemuslikult ülikooliõpingutes omandatud teadmisi, oskusi ja hoiakuid. 30 tundi praktikat sisaldab tundide ettevalmistamist, õpetamist, hindamise kavandamist ja läbiviimist ning tundide andmist gümnaasiumis"}