{"KURSUSE_NIMI": "Eesti keele lauseõpetuse praktiline põhikursus", "KURSUSE_KOOD": "FLEE.04.173", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Eesti keele morfoloogia alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel antakse ülevaade eesti keele lausestruktuurist ja lauseliikmetest eesti keele kui võõrkeele kontekstis ning tehakse praktilisi harjutusi.Objectives/eesmärkid:  Anda ülevaade eesti keele lauseliikmetest ja lauseehituse üksikasjadest ning oskus teoreetilisi teadmisi praktilistes ülesannetes rakendada, sealhulgas analüüsida põhilisi eesti keele lauseehituse üksikasju eesti keele võõrkeelena kontekstis.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane - tunneb lause moodustajate grammatilisi seoseid; - omab ülevaadet eesti keele lauseliikmetest, oskab neid lauses määrata; - tunneb eesti lause põhitüüpe (normaallause, olemasolulause, omajalause, kogejalause, tulemuslause) ja oskab neid moodustada ning iseloomustada, - oskab eristada ja iseloomustada erinevaid lausetüüpe (täis-, vaeg- ja lünklause, koondlause, rindlause, põimlause); - oskab kasutada eesti keele kirjavahemärke eri lausetüüpides; - tunneb lauselühendeid ja nende funktsioone ning oskab moodustada erinevate lauselühenditega lauseid; - oskab rakendada ja põhjendada ühildumise reegleid; - tunneb põhilisi eesti keele sõnajärje kasutamise reegleid ja oskab neid rakendada. Kõik loengumaterjalid on kursuse Moodle'i lehel.\n\nOsalemise arvestust ei ole, eksamile pääsemise eelduseks on kõigi kohustuslike ülesannete õigeaegne sooritamine (sh kontrolltöö tulemusele \"arvestatud\" ja Moodle'i testid 100% tulemusele).\n\nEksamiajad lepitakse üliõpilastega ühiselt kokku kursuse lõpus."}