{"KURSUSE_NIMI": "Eesti keele sõnavara struktuur ja sõnamoodustus", "KURSUSE_KOOD": "FLEE.02.184", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 6, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Leksikoloogia uurimisobjekt ja põhimõisted. Erinevad teoreetilised lähenemised sõnavara uurimisele. Seosed sõnade vahel. Tähenduste kirjeldamise mudelid. Ülevaade eesti leksikoloogiast ja selle põhiprobleemidest. Eesti keele sõnade moodustusstruktuur. Sõnamoodustuse kui keelesüsteemi osa tegelik funktsioneerimine. Keeletarvitaja sõnamoodustuskompetentsus. Tuletiste ja liitsõnade tähendus- ja vormirühmad sõnaliikide kaupa (tegusõna, nimisõna, omadussõna, määrsõna).Objectives/eesmärkid:  Aine eesmärgiks on anda süsteemne ülevaade leksikoloogia põhimõistetest, uurimismeetoditest ja -suundadest, samuti tänapäeva eesti keele sõnamoodustusest nii tuletusse kui liitmisesse puutuvalt.Learning outcomes/õpiväljund:  Kursuse läbinu tunneb leksikoloogia põhimõisteid, oskab vahet teha semiootilisel, strukturaalsel ja kognitiivsel lähenemisel sõnavarale; tunneb sõnavaras valitsevaid paradigmaatilisi ja süntagmaatilisi seoseid ning sõnavara kirjeldamise mudeleid. Õppeaine edukalt läbinud üliõpilane tunneb tänapäeva eesti keele sõnamoodustusviise. Üliõpilane oskab etteantud tekstis eristada lihtsõnu, tuletisi ja liitsõnu. Ta oskab analüüsida tuletiste ja liitsõnade struktuuri ning eristada sõnamoodustuse leksikaalseid ja süntaktilisi aspekte. Kursuse läbinu teeb vahet tänapäeva eesti keele produktiivsetel ja ebaproduktiivsetel sõnamoodustusmallidel. Ta suudab moodustama nõutud struktuuri ja tähendusega sõnu ning oskab oma sõnamoodustustegevust teoreetiliselt põhjendada. Üliõpilane teeb rühmatöödes koostööd kaasüliõpilastega ning selgitab oma iseseisva töö tulemusi kaaslastele suulises vormis. Kõikide ainet puudutavate küsimuste ja probleemidega palun pöörduda aadressil kulli.habicht@ut.ee.\n\nMoodle'is on loengute materjal ning harjutused teemade kaupa. \nÕppetöö korralduse teavet vahendatakse ÕISi ja Moodle'i kaudu."}