{"KURSUSE_NIMI": "Praktika (filosoofia ja praktika magistrantidele)", "KURSUSE_KOOD": "FLFI.00.128", "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "See kursus koosneb praktikast ja toetusseminarist, mis abistab üliõpilasi praktikakohtade otsimisel, praktika läbimisel ja analüüsil ning mida juhivad praktikajuhendaja ja toetusseminari moderaator.Objectives/eesmärkid:  See kursus on koht, kus üliõpilased rakendavad stardimoodulis ja rakendusfilosoofia moodulis omandatud oskusi ja teadmisi praktikas. Kursus soodustab nõnda professionaalsete suhete arendamist, koostööoskuste kujundamist ja kogemuste omandamist võimalikes tulevastes töökeskkondades. \nPraktika peab kuuluma ühte järgmistest kolmest kategooriast: \n\n1) Praktiline koolitus ettevõttes. Üliõpilane läheb praktikalepingu alusel tööle mõnda asutusse väljaspool ülikooli. Talle määratakse praktikajuhendaja. Ta täidab oma praktikakoha poolt määratud tööülesandeid. \n\n2) Projektipõhine praktika. Tudeng osaleb ühe konkreetse projekti meeskonna töös projekti algusest lõpuni. Projekt peab olema vastus/lahendus konkreetsele vajadusele või ülikoolivälise asutuse või ka ülikooli allüksuse taotlusele. See võib hõlmata interdistsiplinaarseid projekte, mis on loetletud FUTULABi algatuses. NB: Julgustame üliõpilasi ka ise koostöös huvitatud asutuse/üksuse töötajatega FUTULABi projekte välja mõtlema, kui neil on selleks hea idee (https://futulab.ut.ee/en/). \n\n3) Õppeassistendi praktika. Tudeng assisteerib õppejõudu ühe konkreetse õppeaine läbiviimise või teadustöö tegemise juures (sh akadeemiliste ürituste korraldamine).Learning outcomes/õpiväljund:  Praktika sooritanud üliõpilane: - on saanud kogemuse selliste töökohtade leidmisel ja neile kandideerimisel, mis võimaldavad neil praktikas rakendada stardimoodulist ja rakendusfilosoofia moodulist saadud suhtlus- ja argumenteerimisoskusi ning filosoofilisi teadmisi ja probleemilahendusoskusi;  - on saavutanud kokkuleppe(d) lepingu sõlmimiseks ühe või mitme eelmises punktis kirjeldatud nõuetele vastava praktikakohaga (need lepingud kokku peavad katma praktikaaine mahu);  - on sooritanud praktika(d), mille raames lepingud sõlmiti;  - on arendanud professionaalseid suhteid, koostööoskusi ja saanud kogemusi keskkondades, mida ta võib kaaluda oma tulevase karjääri tarbeks;  - on pärast praktika lõpetamist jaganud oma kogemusi ülikoolipoolse juhendaja ja kaasõpilastega;  - on mõtisklenud oma kogemuste üle ja teab oma tugevusi ning nõrkusi seoses asjakohase töökeskkonnaga."}