{"KURSUSE_NIMI": "Olemist otsimas: Martin Heidegger ja nihilism", "KURSUSE_KOOD": "FLFI.01.128", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus loetakse viit Martin Heideggeri hilisesse loominguperioodi kuuluvat esseed, pühendades igale neist kaks seminarikohtumist. Konkreetsed tekstid on valitud lähtudes sellest, et neis kõigis tegeletakse tähenduse taasavastamisega nihilismi ja modernsuse kontekstis. Vaadeldavates esseedes esitab Heidegger väljakutse mõnedele kõige olulisematele aluseeldustele, mis puudutavad inimkogemust ja inimese rolli tänapäeva maailmas.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada üliõpilastele Martin Heideggeri hilisema perioodi filosoofia võtmekontseptsioone. Kursuse jooksul tutvutakse Heideggeri filosoofiat läbivate ideedega, mille mõju võiks osalejad ergutada sügavamalt järele mõtlema oma elu/olemise ja teaduslike/akadeemiliste huvide üle.  Kuna Heideggeri hilisemaid kirjutisi võib pidada ligipääsetavamaks kui  tema peateost \"Olemine ja aeg\", annab hilise Heideggeri lugemine hea aluse lähenemiseks tema varasematele töödele sh teosele \"Olemine ja aeg\".Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilased on: * õppinud tundma ja kriitiliselt hindama mitmeid Martin Heideggeri filosoofia põhikontseptsioone, * omandanud muudele Heideggeri teostele lähenemiseks vajalikud teadmised, * saanud väärtuslikke lisateadmisi filosoofia ajaloost. * Description of Content\nWe will read five essays of Heidegger's later writings, spending two classes on each essay. These essays have been selected because they all deal with the rediscovery of meaning within the context of nihilism and modernity. In these essays, Heidegger challenges some of our most basic assumptions concerning our human experience and where we stand in the world today. \n\nThese essays deal with: \n*\tthe history of Western philosophy\n*\tthe nature of truth\n*\tnihilism\n*\tmetaphysics\n*\tmeaning-making\n*\tdestiny\n*\tmodern crises\n*\ttechnology\n*\tpoetry contrasted with logic and science\n*\tthe role of philosophy\n\n* Class Structure\nDuring each seminar, we will begin with questions students may have and then proceed to review the homework questions (in pairs and as a group). The remainder of the seminar will be devoted to reading passages of the text aloud and interpreting/discussing them. With two classes per essay, we can proceed at a speed that will facilitate increased depth of discussion and comprehension of the materials."}