{"KURSUSE_NIMI": "Mälu, ajalugu ja traditsioon", "KURSUSE_KOOD": "FLFI.02.146", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Side mineviku ja oleviku vahel on olnud filosoofiliste arutelude teemaks alates Platoni kirjeldusest mälust kui vahatükist kuni Hegeli ajaloolise mälu mõiste ja Nietzsche historitsismi kriitikani. Kursusel vaadeldakse Halbwachi, Gadameri, Freudi ning Derrida arusaamu minevikust ja mälust. Arutleme selle üle, mida tähendab olla minevikust teadlik, olla minevikusündmustest mõjutatud, determineeritud või isegi painatud. Õppeaine läbivaks teemaks on inimese võimetus minevikukogemust täielikult talletada ning olevikus edasi anda.Objectives/eesmärkid:  Õppeaine eesmärk on tutvustada üliõpilastele ajalooteadvuse ning kollektiivse mäluga seotud peamisi filosoofilisi ideid.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilasel on selge arusaam kollektiivse mälu teemalise filosoofilise kirjanduse peamistest ideedest ning olulisematest ajaloofilosoofia klassikutest. Although memory is a \"re-presentation\" of the past, its impermanence seems to defy representation. Whether expressed in historical documents, novels, figurative monuments, poetry or film -- there is an explicit attempt to catch meaningful aspects of the past for future generations. Memory recalls and interprets the past in both their positive and negative aspects - as tradition and traumatic burden. During the course, we will read key texts that deal with the complex relationship of memory, history and tradition. From the Platonic notion of memory as a wax block to Hegel's historical consciousness and Nietzsche's critique of historicism, the link between past and present has been an object of philosophical debate. The writings of Maurice Halbwachs on collective memory emphasize that memory is not entirely individual, but linked to particular groups. Gadamer's philosophical hermeneutics foregrounded the importance of interpretation, tradition and historical consciousness. Freud, on the other hand, was more interested in the traumatic aspect of past experience, rather than the past as a repository of tradition. The course ends with Derrida's hauntology as a substitute for ontology. In our discussions, we will examine what it means to be conscious of the past, to be influenced, determined or even haunted by past events. An underlying theme throughout the course will be the inability to fully capture and represent past experience in the present. Readings include selections from Plato, Hegel, Nietzsche, Halbwachs, Gadamer, Freud and Derrida. The course is both in lecture and seminar format."}