{"KURSUSE_NIMI": "Keelefilosoofia ja õigus", "KURSUSE_KOOD": "FLFI.04.103", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 52, "independent_work": 104, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine käigus uurime, kuidas õigusaktide, juhiste, lepingute ja muude dokumentide tõlgendamine võib varieeruda sõltuvalt sellest, kes sellega on seotud ja millises kontekstis seda tehakse. Nii nagu ametnikud ja politseinikud võivad erinevalt tõlgendada sama õigusakti, võivad ettevõtte raamatupidajad ja turundusmeeskond mõista erinevalt ka ettevõtte sees kehtivaid juhiseid. See, kuivõrd õigusnorme mõistetakse vastavalt seadusandja tahtele, ja kuivõrd juhiseid mõistetakse sarnaselt erinevates kasutajagruppides, sõltub enamast kui ainult vastuvõetud tekstist. Selles õppeaines uurime, milline on normide tõlgendamisel nende kasutuskontekstide roll ja milliseid muudatusi oleks nendes kontekstides võimalik teha selleks, et tagada normide tõlgendamisel järjepidevus ja vastavus seadusandja tahtele.Objectives/eesmärkid:  Normid (õigusaktides, lepingutes, juhistes ja mujal) on tihti loodud selleks, et koordineerida inimeste käitumist või saavutada teatud eesmärke. Kord kirja pandud, elavad normid edasi oma elu ning mitte kõiki nende tõlgendamisega seotud küsimusi ei lahenda kohtud: teatud normid võivad rakenduda näiteks üksnes mõne organisatsiooni sees. Selle aine eesmärk on luua kaasaegse keelefilosoofia ja eksperimentaalse õigusfilosoofia pinnalt teadmiste ja meetodite pagas, mis võimaldab paremini mõista normide tõlgendamise, strateegilise rakendamise ja kontekstitundlikkuse hindamisega seotud praktikaid.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilasel on:  1. Teadmised analüütilise õigusfilosoofia peamistest teooriatest ja eksperimentaalse õigusfilosoofia harudest, mida saab rakendada normide tõlgendamisel; samuti oma õigusfilosoofilise seisukoha kaitsmise kogemus nii spontaanse arutelu (debati) käigus kui argumenteerivas tekstis (essees). 2. Oskus analüüsida, kuidas õigus- ja muude normide allikad suhestuvad kontekstiga, milles neid rakendatakse, ja kuidas neid allikaid või konteksti saaks kohandada, et täita paremini allika eesmärki. 3. Ülevaade praktika- ja töökohtadest, kus omandatud keele- ja õigusfilosoofilised teadmised ning meetodid võiksid aidata praktikaid parandada. Prerequisite courses:\n* Philosophy MA students must have completed the Start module courses of the Philosophy MA before they can take this course. \n* Students from other MA curricula must have completed 12 ECTS in Philosophy or Law before taking this course.\n\nThe course is meant for MA students from Philosophy and MA students from the following programmes:  \n\nLaw School \n- Law (Õigusteadus) (Regular study) \n- Information Technology Law (Infotehnoloogiaõigus) (Regular study)  \n\nSkytte Institute of Political Studies \n- Politics and Governance in the Digital Age (Poliitika ja valitsemine digiajastul) (Regular study) \n- International Relations and Regional Studies (Rahvusvahelised suhted ja regiooni uuringud) (Regular study) \n- European Studies (Euroopa õpingud) (Block mode study) \n\nSchool of Economics and Business Administration \n- Innovation and Technology Management (Innovatsiooni ja tehnoloogia juhtimine) (Regular study) \n- Strategic Management (Strateegiline juhtimine) (Block mode study) \n- Contemporary Economy (Kaasaegne majandus) (Block mode study)  \n\nInstitute of Social Sciences joint curriculum \n- Change Management in Society (Muutuste juhtimine ühiskonnas) (Block mode study)"}