{"KURSUSE_NIMI": "Sissejuhatus Immanuel Kanti esteetikasse", "KURSUSE_KOOD": "FLFI.01.086", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Maitse üle ei vaielda! Igalühel ju oma. Kuidas on aga nii, et kui ütlen, et miski on ilus, siis eeldan justkui, et ka teised peaksid nõusse jääma? Kuidas see, mis oma suures ilus on nii ülev, võib tekitada minus põhjatut õudu? Ja millest räägib Kant siis, kui ütleb, et ilu on otstarbeta otstarbekus? Ja siis, kui ta seda argumenteerides laseb  mängu tulla mängul?\n\nKeskendudes \"Otsustusjõu kriitikale\", on seminaride sisuks nii ajalooline sissejuhatus esteetikasse kui ka sissevaade Kanti filosoofiasse. Kolmanda peateose ehk kolmanda kriitikana tuntud \"Otsustusjõu kriitikas\" (1790) teeb Kant katse viia oma filosoofia tervikliku süsteemina lõpetatusesse ehk siis näidata teoreetilise ja praktilise mõistuse süstemaatilist ühtsust. Otsustusjõud, mis on ühe tunnetusvõimena ka juba \"Puhta mõistuse kriitikas\" ja \"Praktilise mõistuse kriitikas\" kõne all, nihkub nüüd kolmandas kriitikas teoreetilise ja praktilise tunnetuse vahendajana fookusesse. Seejuures võtab Kant lähema uurimise alla kaks valdkonda: esteetika ning teleoloogilise lähenemise loodusele. Seminarides tuleb üksikasjalisemalt vaatlusele esteetika ehk siis see, kuidas Kant üritab mõtelda loodus(paratamatus)t ühitatavana vabadusega otsustustes ilu üle.   \n\nAinekursusel osalemine ei eelda Kanti filosoofia tundmist, vaid seab selle sihiks.Objectives/eesmärkid:  Sissejuhatus Immanuel Kanti esteetikasse ja ka üldisemalt tema filosoofiasse.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. orienteerub Immanuel Kanti esteetika põhimistes teemades ja mõistetes;  2. suudab need siduda esteetika põhimiste suundumuste ja arengutega ning Kanti teoreetilise ja praktilise filosoofia põhiküsimustega. Maitse üle ei vaielda! Igalühel ju oma. Kuidas on aga nii, et kui ütlen, et miski on ilus, siis eeldan justkui, et ka teised peaksid nõusse jääma? Kuidas see, mis oma suures ilus on nii ülev, võib tekitada minus põhjatut õudu? Ja millest räägib Kant siis, kui ütleb, et ilu on otstarbeta otstarbekus? Ja siis, kui ta seda argumenteerides laseb mängu tulla mängul?\n\nKeskendudes \"Otsustusjõu kriitikale\", on seminaride sisuks nii ajalooline sissejuhatus esteetikasse kui ka sissevaade Kanti filosoofiasse. Kolmanda peateose ehk kolmanda kriitikana tuntud \"Otsustusjõu kriitikas\" (1790) teeb Kant katse viia oma filosoofia tervikliku süsteemina lõpetatusesse ehk siis näidata teoreetilise ja praktilise mõistuse süstemaatilist ühtsust. Otsustusjõud, mis on ühe tunnetusvõimena ka juba \"Puhta mõistuse kriitikas\" ja \"Praktilise mõistuse kriitikas\" kõne all, nihkub nüüd kolmandas kriitikas teoreetilise ja praktilise tunnetuse vahendajana fookusesse. Seejuures võtab Kant lähema uurimise alla kaks valdkonda: esteetika ning teleoloogilise lähenemise loodusele. Seminarides tuleb üksikasjalisemalt vaatlusele esteetika ehk siis see, kuidas Kant üritab mõtelda loodus(paratamatus)t ühitatavana vabadusega otsustustes ilu üle.\n\nAinekursusel osalemine ei eelda Kanti filosoofia tundmist, vaid seab selle sihiks.\n\n\n\n\n...\n\nCharles Baudelaire\n\nCorrespondances \n\n\nLa Nature est un temple oú de vivants piliers\nLaissent parfois sortir de confuses paroles;\nL'homme y passe à travers des forêts de symboles\nQui l'observent avec des regards familiers.\n\nComme de longs échos qui de loin se confondent\nDans une ténébreuse et profonde unité,\nVaste comme la nuit et comme la clarté,\nLes parfums, les couleurs et les sons se répondent.\n\nIl est des parfums frais comme des chairs d'enfants,\nDoux comme les hautbois, verts comme les prairies,\n- Et d'autres, corrompus, riches et triomphants,\n\nAyant l'expansion des choses infinies,\nComme l'ambre, le musc, le benjoin et l'encens\nQui chantent les transports de l'esprit et des sens."}