{"KURSUSE_NIMI": "Abstraktse kunsti fenomenoloogia", "KURSUSE_KOOD": "FLFI.01.110", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lähtudes Michel Henry fenomenoloogilisest kunstikäsitusest teoses \"Näha nähtamatut. Kandinskyst\" (1988) ning ühtlasi pidades silmas abstraktse kunsti tekkimise ideedeajaloolist (sümbolism, teosoofia, antroposoofia, nietzscheaanlus, empiriokrititsism, fenomenoloogiline filosoofia) ja iseäranis kunstiajaloolist (Hilma af Klint, Mondrian, Malevitš, El Lissitzky, Bauhaus) ja ka muusikaajaloolist (Schönberg) konteksti, on seminarid sissejuhatuseks nii Vassili Kandinsky abstraktse kunsti loomingusse kui ka Michel Henry materiaalsesse fenomenoloogiasse.Objectives/eesmärkid:  Sissejuhatus abstraktse kunsti fenomenoloogiasse.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. orienteerub Vassili Kandinsky kunstiloomingu ja teoreetiliste tekstide põhjal abstraktse kunsti eripäras ja põhiprobleemides, 2. orienteerub võimalusis abstraktset kunsti fenomenoloogiliselt tõlgendada Michel Henry Kandinsky-käsituse põhjal, 3. suudab selle siduda fenomenoloogilise kunstikäsitamise põhimiste suundumuste ning avaramalt fenomenoloogilisse filosoofiasse puutuvate küsimustega. Vassili Kandinsky (1866-1944) on abstraktse kunsti rajajaid ning esimesi teoreetikuid. Nii tuleb seminarides lisaks maalidele ja graafikale üksikasjalisema vaatluse alla ka tema peamine teoreetiline kirjatöö \"Vaimsest kunstis. Iseäranis maalis\" (1912). \n\nMichel Henry (1922-2002) on üks kandvamaid 20. sajandi teise poole prantsuse fenomenolooge. Tema filosoofia keskseks teemaks on elu (mittebioloogilises tähenduses) ja selle radikaalne immanentsus. Üksikasjalisemalt klaaritakse seminarides Henry kunstikäsituse (\"Näha nähtamatut. Kandinskyst\" (1988)) filosoofilisi eeldusi selle valguses, kuidas Henry  kritiseerib Edmund Husserli (1859-1938), fenomenoloogia raja ja Kandinsky põlvkonnakaaslase, põhiseisukohti (intentsionaalsus). \n\nTeosoofia ja sellest hargnenud antroposoofia näol on tegemist okultse spirituaalse õpetusega, mis otseselt inspireeris ja mõjutas varajast abstraktset kunsti. Seda silmas pidades loeme Kandinsky kõrvale ka Annie Besanti (1847-1933) teosoofilist traktaati „Mõttevormid” (1896) ja võimalusel Rudolf Steineri (1861-1925), antroposoofia raja, kirjatöid, püüdes seejuures tabada ka  ideedeajaloolisi paralleele fenomenoloogilise filosoofiaga. \n\nSeminaride üldisemaks sihiks on katsetada fenomenoloogilise filosoofia ja abstraktse kunsti võimalusi dialoogiks.\n\nVeebiseminarid, aine on avatud kõigile huvilistele.\n\n"}