{"KURSUSE_NIMI": "Rahvusvahelise poliitilise mõtte ajalugu", "KURSUSE_KOOD": "FLFI.05.023", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Läbi ajaloo on inimesed lahterdanud teisi inimesi \"omadeks\" ja \"võõrasteks\" ning arutlenud selle üle, kuidas peaksid erinevad kogukonnad üksteise suhtes toimima. Rahvusvaheliste suhete teooria ajalugu on traditsiooniliselt keskendunud suveräänsete riikide omavahelistele suhetele, ent maailma jagamine iseseisvateks riikideks on vaid üks ajalooliselt kujunenud võimalus globaalse korra mõtestamiseks. Kursusel vaatleme \"maailmakorra\" küsimuse lahendusi Lääne mõtteloos antiigist uusajani, tehes seda kolmel olulisemal tasandil: 1) printsiibid, mille alusel on maailma jaotatud erinevateks kogukondadeks; 2) printsiibid ja mehhanismid, mis reguleerivad globaalse korralduse või \"süsteemi\" toimimist ja säilimist 3) normatiivne sfäär ehk moraali- ja õigusnormide roll ja sisu nimetatud süsteemis. Konkreetsemalt pöörame tähelepanu järgmistele teemadele: tsivilisatsioon ja barbaarsus, õiglane sõda, impeerium ja suveräänne riik, universaalmonarhia ja jõudude tasakaal, eraomandi filosoofilised alused ja kolonialismi õigustamine.  \nKursus koosneb loengutest, seminaridest ja iseseisvast tööst. Loengutes antakse sissejuhatav ülevaade rahvusvahelise mõtte peamistest suundadest, teoreetikutest ja nende põhiideedest. Seminarides analüüsitakse probleeme sügavuti, toetudes iseseisvale tööle kursuse võtmetekstidega. Kursuse sooritamiseks eeldatakse seminarides vähemalt ühe ettekande pidamist (sõltuvalt tudengite arvust), aktiivset osalemist diskussioonides ning ühe essee esitamist.\nAinet on võimalik sooritada 3 EAP mahus (sel juhul pole esseed vaja kirjutada).Objectives/eesmärkid:  * Anda ülevaade rahvusvahelise poliitilise teooria ja rahvusvahelise õiguse ideestiku kujunemisloost antiigist uusajani.\n* Analüüsida rahvusvahelise poliitilise teooria ja õiguse võtmetekste nende ajaloolises kontekstis.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilasel on: 1) Süstemaatilised põhiteadmised rahvusvahelise poliitilise teooria ja rahvusvahelise õiguse ideestiku kujunemisloost antiigist uusajani. 2) Oskus mõista ja analüüsida rahvusvahelise mõtte teoreetikute ideid. 3) Oskus mõista ja kasutada rahvusvahelise mõtte ajaloo põhitermineid nende ajaloolises kontekstis (riik, impeerium, tsivilisatsioon, rahvaste õigus, rahvusvaheline õigus, võimutasakaal, sõda, rahu jne)."}