{"KURSUSE_NIMI": "Vaim tulevikus", "KURSUSE_KOOD": "FLFI.04.105", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Süvendatud sissejuhatus vaimu- ja keelefilosoofiasse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine käsitleb vaimufilosoofia tänaseid ja tuleviku küsimusi nagu tehisteadvus, superintellekt, küborgid, virtuaalreaalsus, vaimu üleslaadimine ja transhumanism. Aine valmistab osalejaid ette selliste probleemide üle kriitiliselt mõtlema.Objectives/eesmärkid:  Õppeaine on mõeldud üliõpilastele, keda huvitavad filosoofilised küsimused seoses tehisintellekti (AI) kiire arengu ja selle mõjuga inimvaimule tänapäeval ja tulevikus. Õppeaine eesmärk on aidata üliõpilastel mõista AI arenguga seotud filosoofilisi probleeme. Süüvime tehis- ja inimmõistuse tulevikku, et uurida tehisintellekti arendamise metafüüsilisi, eetilisi ja sotsiaalseid tagajärgi. Uurides erinevaid teemasid nagu superintellekt, tehisteadvus, vaimu üleslaadimine, virtuaalreaalsus, transhumanism, küborgid ning inimese ja roboti suhted, harjutavad üliõpilased oma analüüsi-, kriitilise mõtlemise ja suhtlemisoskusi.Learning outcomes/õpiväljund:  Õppeaine edukalt läbinud üliõpilane on:  * võimeline tuvastama filosoofilisi võtmeküsimusi, mis on seotud tehisintellekti kiire arengu ja selle mõjuga vaimu mõistele, ja nende üle arutlema;  * arendanud oma filosoofia-spetsiifilist kirjutamisoskust ning suulise suhtlemise ja argumenteerimise oskusi.  Täpsemalt on üliõpilane: * uurinud küsimusi, mis on seotud vaimu, isikusamasuse ja toimijalisuse mõiste muutumisega tehisintellekti ajastul;  * rakendanud kriitilist mõtlemist päriselu väljakutsete lahendamisel, ennetades tehisintellekti edasisi arenguid ja nende laiemat mõju inimkonnale; * sõnastanud ja kaitsnud lahendusi filosoofilistele probleemidele, millega tuleb tegeleda, et olla edukas tehisintellekti arenguga seotud päriselu väljakutsete lahendamisel; * arutlenud tehisintellekti eetiliste ja ühiskondlike mõjude üle inimese tunnetusele ja ühiskonnale, edendades seejuures vastutustundlikku vaatevinklit. Prerequisite courses:\n* Philosophy MA students must have completed the Start module courses of the Philosophy MA before they can take this course. \n* For everyone else, the course \"Advanced Introduction to the Philosophy of Mind and Language\" from the Start module in the Philosophy in Practice MA\n* Recommended: BA-level Philosophy of Mind course FLFI.04.060."}