{"KURSUSE_NIMI": "Euroopa romantism", "KURSUSE_KOOD": "FLFI.05.035", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 34, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 34, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppejõud pakuvad ühekordselt õpetatavate ainekursustena välja süvendatud käsitlusi oluliste mõttelukku kuuluvate autorite töödest või kesksetest probleemidest.Objectives/eesmärkid:  Eesmärgiks on aidata kaasa spetsialiseerumisele mõtteloo alal ning anda süvendatud teadmisi perioodi, peamiste autorite ning probleemivaldkondade kohta.Learning outcomes/õpiväljund:  Kursuse läbimisel on üliõpilasel: - süvendatud teadmised Euroopa mõtteloost;  - arenenud oskus töötada mõtteloo alaste tekstidega;  - arenenud akadeemilise eneseväljenduse oskus. Kas romantism oli liikumine, mille peategelased olid revolutsionäärid ja poliitilised visionäärid või pigem rajanes see indiviidi tasandil igatsusele, võimalikele ning \"võimatutele\" armastustele? Kuhu \"Valgustus\" romantismi tulekul siis jäi, ehk on romantism hoopis üks vastus terendava või ähvardava \"modernsuse\" kogemisele? Kas romantism on diskursus ja kui nii, siis mis sellest johtub? Millised olid romantismi jäljed, mis ulatusid edaspidisesse kultuuriajalukku? Käesolev kursus on võrdlev käsitlus mõttevooludest, mis said kokku XIX sajandi vältel koondnime all \"romantism\" ning mille trajektoor ning tempo olid Euroopa kultuurides erinevad, ka vastuolulised. Kursuse eesmärk on tutvustada põhimõisteid, mille üle vaieldi, kasutades näideteks kirjalikke, visuaalseid ning musikaalseid tekste inglise, saksa, prantsuse, kohati ka eesti kultuurist. Kursus ei jutusta nii palju romantismi ajalugu (ei ainsuses ega mitmuses), vaid Löwy ja Sayre`i (2001) eeskujul üritab defineerida romantismi mõiste (Begriff) alamõisteid ja mõistetekobaraid (loodus, kujutlusvõime (imagination), ülevus, sümbol, fragment, tumemeelsus jne) kasutades selles töös mõningate võtmetekstide lähilugemist. Oluliseks läbivaks teemaks on kultuuriülekanded/kultuuritõlked, nii ajalises kui ruumilises mõttes. Kursus (loengud, seminarid, lugemine) on eesti keeles. Loengud on eelnevalt lindistatud ning järelevaadatavalt õpikeskkonnas Moodle, nendele põhineb ka arutlus viies seminaris ning kohustuslikus lugemispäevikus."}