{"KURSUSE_NIMI": "Eesti mõtteloo tüvitekstid", "KURSUSE_KOOD": "FLFI.05.025", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus koosneb tekstide iseseisvast lugemisest ning nende arutamisest seminarides. Kursuse sooritamiseks peetakse seminarides 2-3 ettekannet ja osaletakse aktiivselt diskussioonides. Kursuse lõpuks kirjutatakse temaatiline lühiessee Eesti mõtteloost.Objectives/eesmärkid:  1) Anda ülevaade Eesti mõtteloo mõnest valitud põhisuundumusest või kesksest probleemist nii selle lähemas kohalikus kui ka kaugemas, euroopalikus ja üleilmses kontekstis eriilmsete kirjalike allikate põhjal.  2) Õppida analüüsima Eesti mõtlejate ideid nii nende ajaloolises, tänapäevases kui ka tulevikulises mõõtmes. 3) Õppida tõlgendama erilaadilisi erinevatelt teadmis- ja tegevusaladelt pärinevaid mõttekäike ja mõtteallikaid Eesti mõttelugu loovana -- Eesti enesemõtestamist võimaldavana.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane on omandanud: 1) teadmised ühest või mitmest Eesti mõtteloo põhisuundumusest või põhiküsimusest, 2) oskuse mõista ja analüüsida Eesti mõtlejate ideid nii kohalikus kui rahvusvahelises kontekstis nii 'Eesti mõtteloo' sarja raamatute kui ka teiste relevantsete allikate põhjal, 3) arusaamise Eesti enesemõtestamise mõtteloolistest võimalustest ja viisidest. Sügissemestril 2025/2026 on kursuse kitsamaks teemaks \"Filosoofilisi debatte ja ideoloogilisi vastasseise Nõukogude Eestis\".\nSeminarid keskenduvad filosoofilistele debattidele ja ideoloogilistele vastasseisudele Nõukogude Eestis. Käsitlemisele tuleb stalinistlik keele- ja luulekriitika (Aira Kaal, Max Laosson, Alfred Koort, Nigol Andresen, Paul Viiding, Johannes Semper), selle lätted marksismis-leninismis ning järelmid poliitiliste repressioonide näol. Stalini-järgsest perioodist tuleb vaatlusele eksistentsialismi- ja võõrandumisdebatt 1960. aastate lõpul, selle vastukajad kirjanduskriitikas, akadeemilises filosoofias ning parteilises kultuuri- ja teaduspoliitikas (Rem Blum, Mihhail Makarov, Eduard Päll, Arvo  Valton, Mati Unt, Vaino Vahing,  Jaak Kangilaski, Nigol Andresen). Kõnealused debatid on seni leidnud käsitlemist peamiselt kirjanduslooliselt. Käesolevate seminaride taotluseks on  neile läheneda pigem filosoofiliselt, tõlgendades marksismi-leninismi (Marx, Lenin, Stalin) kui ka eksistensialismi ja fenomenoloogia (Sartre, Camus, Heidegger) kontekstis. Ühtlasi on eesmärgiks uurida filosoofia ja ideoloogia kokkukõlamise, filosoofia ideoloogilise instrumentaliseerimise ja repressiivse koostoimimise viise, ent ka sellele vastuhakkamist nõukogude ühiskonnas."}