{"KURSUSE_NIMI": "Moraalifilosoofia klassikat", "KURSUSE_KOOD": "FLFI.02.153", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 136, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus vaadeldakse igal aastal üht moraalifilosoofia ajaloos eriliselt tähenduslikku teksti, mis püsib olulisena ka tänapäeva normatiivse eetika, metaeetika ja rakenduseetika alastes debattides.Objectives/eesmärkid:  Kursuse eesmärkideks on: * tutvustada tudengitele süstemaatiliselt üht moraalifilosoofia olulist teksti, * näidata selle teksti tähtsust nii autori vaadete kui tänapäeva moraalifilosoofiliste debattide kontekstis, * rekonstrueerida tekstis esitatud argumendid ja seisukohad ning hinnata nende veenvust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse edukalt läbinud üliõpilane:\n* omab head ülevaadet käsitletud moraalifilosoofia põhitekstist ning teab, mis on selle teksti iseloomulikud jooned,\n* oskab kriitiliselt hinnata argumente tekstis esitatud väidete poolt ja vastu,\n* suudab lugeda ja mõista ajaloolist filosoofilist teksti ning suhestada seda tänapäevaste filosoofiliste küsimustega,\n* suudab teadusartiklitest aru saada ja neid analüüsida,\n* on võimeline avaldama käsitletud teemadel arvamust nii suuliselt kui kirjalikult. The course will in each different year examine a particular work in moral philosophy that is especially significant in the history of moral philosophy and that continues to be relevant for contemporary debates, whether in normative ethics, metaethics, applied ethics, etc.\nAutumn 2024: David Ross, The Right and the Good, 1930.\n\nWe will read back to back a rediscovered classic of moral philosophy. In this book the British philosopher David Ross (1877-1971) defended a clear, non-Kantian, deontological alternative to utilitarianism, arguing for the existence of a plurality of basic duties which apply in our lives and which may conflict with each other with no obvious solution. Moreover, as an alternative to simplistic views of value, Ross argues for the existence of a plurality of distinct goods that it is one of our duties to promote - one of them being the moral good of virtue. But Ross also addresses foundational questions about the objectivity of the concepts \"right\" and \"good\". The course therefore covers equally what would be normally covered in metaethics and normative ethics classes. Emphasis will be on the close reading and accurate understanding of a text which is now almost 100 years old, as well as on critical re-elaboration of its insights."}