{"KURSUSE_NIMI": "Filosoofia karjääriseminar", "KURSUSE_KOOD": "FLFI.00.122", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus tegeleb filosoofiadoktori karjääriga seotud vajaduste, võimaluste ja väljakutsetega. Käsitletakse järgmisi teemasid: filosoofiline kirjutamine ja publitseerimine, oma teadustöö nähtavaks tegemine, akadeemilise maailma muutlikkus, akadeemiline tööturg, kandideerimise ja teadusraha taotlemisega seotud tekstiformaadid, mitteakadeemilisele tööturule sisenemise võimalused.Objectives/eesmärkid:  Kursuse eesmärk on anda filosoofia eriala doktorantidele ülevaade filosoofiast kui teadusharust, aidata neil püstitada oma doktoriõpingute perioodiks vahe-eesmärke, ning anda näpunäiteid selleks, et õpingute aega efektiivselt kasutada.Learning outcomes/õpiväljund:  Kursuse läbinud doktorant:  1) oskab oma õpingute käiku paremini hallata, et jõuda õppeaja lõpuks enda seatud eesmärkideni, 2) tunneb akadeemilise filosoofia kirjutamis- ja avaldamistavasid, 3) oskab koostada ja uuendada oma akadeemilist CV-d, 4) teab, mida võidakse oodatakse akadeemilistele töökohtadele kandideerijalt, 5) oskab valmistuda sisenemiseks mitteakadeemilisele tööturule, 6) mõistab oma eriala ja akadeemilise maailma majanduslikku tausta. Active participation in and preparation for the seminars is obligatory. If you sign up for this course, then you will be expected to actively participate in, and prepare for every seminar. If you cannot attend a seminar, then you must tell the course lecturer in advance and explain why. The course will function well only if students who sign up for it are active and support each other. Absences will be treated on a case by case basis. But if a student is absent without good reason, or absent so many times that it starts to thwart their ability to support their peers in the course and/or acquire the skills the course teaches, then the student risks failing the course."}