{"KURSUSE_NIMI": "Moraalifilosoofia klassikat", "KURSUSE_KOOD": "FLFI.02.153", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 112, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus vaadeldakse igal aastal üht moraalifilosoofia ajaloos eriliselt tähenduslikku teksti, mis püsib olulisena ka tänapäeva normatiivse eetika, metaeetika ja rakenduseetika alastes debattides.Objectives/eesmärkid:  Kursuse eesmärkideks on:\n* tutvustada tudengitele süstemaatiliselt üht moraalifilosoofia olulist teksti,\n* näidata selle teksti tähtsust nii autori vaadete kui tänapäeva moraalifilosoofiliste debattide kontekstis,\n* rekonstrueerida tekstis esitatud argumendid ja seisukohad ning hinnata nende veenvust.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane:\n* omab head ülevaadet käsitletud moraalifilosoofia põhitekstist ning teab, mis on selle teksti iseloomulikud jooned,\n* oskab kriitiliselt hinnata argumente tekstis esitatud väidete poolt ja vastu,\n* suudab lugeda ja mõista ajaloolist filosoofilist teksti ning suhestada seda tänapäevaste filosoofiliste küsimustega,\n* suudab teadusartiklitest aru saada ja neid analüüsida,\n* on võimeline avaldama käsitletud teemadel arvamust nii suuliselt kui kirjalikult. Autumn 2017: J. S. Mill, Utilitarianism.\n\nThis course examines John Stuart Mill's utilitarianism, through a close reading of his essay Utilitarianism (1861). The book has five chapters: 1. General Remarks; 2. What Utilitarianism Is; 3. Of the Ultimate Sanction of the Principle of Utility; 4. Of What Sort of Proof the Principle of Utility is Susceptible; and 5. On the Connection Between Justice and Utility. In the study materials I will indicate secondary literature that will help us in our interpretation and serve as basis for the written essay."}