{"KURSUSE_NIMI": "Lugemisgrupp: mälu, aeg ja modernsus", "KURSUSE_KOOD": "FLFI.02.165", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus filosoofiasse"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine käigus loetakse aega käsitlevaid tekste võtmetähtsusega filosoofidelt nagu Augustinus, Heidegger, Benjamin ja Koselleck. Uurime, kuidas arusaamine aja mõistest on seotud modernismi ja postmodernismi ajalise piiritlemisega.Objectives/eesmärkid:  Aine eesmärk on tutvustada üliõpilastele tänapäeva kontinentaalset aja- ja ajaloofilosoofiat.Learning outcomes/õpiväljund:  Aine läbinud üliõpilasel on selge arusaam tänapäeva kontinentaalsest aja- ja ajaloofilosoofiast. Ta on ka arendanud oma filosoofilise teksti analüüsimise oskust ning esitlusoskusi. Time has a capricious quality to it because it is the narrative element that structures our lives  - both in the natural world of the seasons and in the man-made world of historical existence. It was St Augustine who famously wrote, \"What then is time? If no one asks me, I know what it is. If I wish to explain to him who asks, me, I do not know.\" Time is an enigma: we cannot see time itself, only its effects in space. How is time measured and represented? How is time related to literary and historical narration? How does the objective measuring of time clash with the subjective experience of temporality? Why do certain times appear meaningful while others are empty? What political and philosophical meanings does the passage of time have? Can one live in different times: mythical and ordinary, sacred and profane?\nThe course will examine key thinkers who have contributed to philosophical reflections on time such as Augustine, Heidegger, Benjamin  and Koselleck. We will ask how conceptions of time are related to temporal distinctions of modern and postmodern.\nAlthough the course is open to all students who have already taken some introductory course of philosophy, it is intended for upper-level students."}