{"KURSUSE_NIMI": "Arthur Schopenhauer: maailm kui tahe ja ettekujutus", "KURSUSE_KOOD": "FLFI.05.042", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Arthur Schopenhaueri ainsat peateost \"Maailm kui tahe ja ettekujutus\" (1819 esmaväljanne; 1844 oluliselt täiendatud trükk, mis nüüdisaegsete väljaannete aluseks) lugedes võetakse läbi tema filosoofia peamised teemad ja argumendid  tunnetusteoorias, metafüüsikas, esteetikas ja eetikas nii nende ajaloolises kontekstis kui ka tänapäevases aktuaalsuses. Akadeemiliste filosoofide poolt paljuski alahinnatuna omandas Schopenhauer 19. ja 20. sajandi vahetuse paiku tohutu mõju muusika-, kunsti- ja kirjandusloomele.Objectives/eesmärkid:  Sissejuhatus Arthur Schopenhaueri filosoofiasse  tema peateose \"Maailm kui tahe ja ettekujutus\" najal. Arendada kriitilise mõtlemise võimet ja argumenteerimisoskust.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. orienteerub Arthur Schopenhaueri filosoofia põhimistes teemades ja mõistetes, 2. suudab need siduda nii filosoofiaajaloolise konteksti kui ka  nüüdisaegse filosoofia aktuaalste küsimustega. 3. on arenenud kriitilise mõtlemise ja argumenteerimise oskuse osas. Arthur Schopenhaueri ainsat peateost \"Maailm kui tahe ja ettekujutus\" (1819 esmaväljaanne; 1844 oluliselt täiendatuna aluseks nüüdisaegsetele väljaannetele) lugedes võetakse seminarides läbi tema filosoofia peamised teemad ja argumendid  tunnetusteoorias, metafüüsikas, esteetikas ja eetikas nii nende ajaloolises kontekstis kui ka tänapäevases aktuaalsuses. Akadeemiliste filosoofide poolt paljuski alahinnatuna omandas Schopenhauer 19. ja 20. sajandi vahetuse paiku tohutu mõju muusika-, kunsti- ja kirjandusloomele, selle mõtestamisele."}