{"KURSUSE_NIMI": "Filosoofia kui elulaad: stoitsism kohtub budismiga", "KURSUSE_KOOD": "FLFI.01.126", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 28, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb stoikute ja budistliku filosoofia ja eetika aluspõhimõtteid. Kursusel on nii teoreetiline kui ka praktiline osa: me katsetame mõningaid vaimseid praktikaid, mille sihiks on toetada vastavate eetiliste hoiakute mõistmist ja ellurakendamist ning aidata kaasa hea ja mõtestatud elu elamisele.Objectives/eesmärkid:  Selle kursuse eesmärgid on: * tutvustada stoikute ja budistliku filosoofia põhimõisteid ja aluspõhimõtteid; * näidata stoikute ja budistliku filosoofia relevantsust tänapäeva maailmas; * toetada stoikute ja budistliku filosoofia ellurakendamist, võimaldades õppijatel kursusel tutvustatud ideid oma elus katsetada ja osaleda praktikates, mille sihiks on õppija elu positiivselt mõjutada;  * harjutada lääne ja ida filosoofiate võrdlevat analüüsimist, arendades võrdlevat ja kriitilist lähenemist stoikute ja budistlikule filosoofiale.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: * on süvitsi uurinud mõningaid stoikute ja budistliku filosoofia võtmemõisteid, alusprintsiipe ning praktikaid ja suudab neid selgelt sõnastada; * on rakendanud mõningaid stoikute ja budistliku filosoofia tarkusi oma igapäevaelus ning suudab vastavaid harjutusi kasutada isikliku arengu ja eneserefleksiooni tööriistadena; * on võimeline kriitiliselt analüüsima ja võrdlema stoikute ja budistlikku filosoofiat, tuvastades nii ühisjooni kui ka erinevusi nende lähenemiste võtmekontseptsioonides (nt seoses arusaamadega õnnest, kannatusest, \"mina\" olemusest jne);  * on täiustanud oma suhtlemis- ja argumenteerimisoskusi arutelude ja kirjalike tööde käigus;  * on võimeline tuvastama praktikavõimalusi seoses kursusel omandatud oskustega. This course takes as its starting point the insight that philosophy is not (or should not be) merely a theoretical discourse but a way of life that aims to make one's life better. The course has both a theoretical and a practical component: we will learn about different conceptions of a meaningful life and try out some of the practises or exercises that were taken to contribute to living a meaningful life.\n\nIn the first half of the course, we will examine the ethical views of Stoics. Stoic ethics is not just a set of beliefs, but a way of life - it aims to make our lives better and achieve tranquility of mind. To achieve this aim, one has to not only understand and accept the basic tenets of Stoic ethics, but also engage in \"spiritual exercises\" to strengthen and internalize one's intellectual understanding and acceptance. \n \nIn the second part of the course, we will explore some core  tenets of Buddhist thought. More than a collection of ideas, Buddhism is a practical path toward liberating oneself and others from suffering where philosophical understanding, ethical conduct and mind training mutually inform and reinforce one another. \n\nWe will end the course by comparatively analyzing the similarities and differences between Stoic and Buddhist philosophies."}