{"KURSUSE_NIMI": "Eetika ja \"teine\": lapsed, eakad, loomad, keskkond", "KURSUSE_KOOD": "FLFI.02.190", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 22, "independent_work": 114, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Filosoofiline eetika on enamasti keskendunud sellele, mis on õige ja vale täiskasvanud inimeste vahelistes suhetes ning võtnud sellised suhted lähtepunktiks, mõtlemaks inimese suhetest muude moraalsete agentide ja subjektidega. See kursus võtab erineva fookuse, kuna see käsitleb eetilisi küsimusi, mis on seotud meie suhetega moraalsete agentide ja subjektidega, kelle eluetapp (noored, eakad), kaugus (väga kauged tulevased põlvkonnad) või meist erinev bioloogiline olemus (mitteinimloomad, keskkond) toob välja  erilisi probleeme nii individuaalse kui ka ühiskondliku tegevuse tasandil.Objectives/eesmärkid:  Aine käsitleb kaasaegse eetika kontseptuaalseid ja normatiivseid vahendeid ning seda, kuidas neid saab kasutada nii igikestvate kui ka kaasaegsete normatiivsete küsimuste lahendamiseks, millele meil tuleb vastata, et tulla toime väljakutsetega, mis on seotud laste, eakate, mitteinimestest loomade ja keskkonna kohtlemisega. Toetutakse teadmistele, mis üliõpilased said stardimooduli raames filosoofiliste tekstide intelligentseks ja kriitiliseks lugemiseks, ning edendatakse osalejate võimet tegeleda selliste eetiliste küsimustega nii kirjalikus kui ka suulises suhtluses. Kursus loob aluse, et arendada edasi uurimistööd nendel teemadel, olgu siis filosoofias või lähedastes distsipliinides, samuti tuvastada akadeemiaväliseid institutsioone (avalikus või erasektoris), mis käsitlevad kursuse teemaks olevaid väljakutseid ja leida võimaluse korral võimalusi koostööks ja professionaalseks kaasamiseks nendes asutustes kas õpingute ajal (praktikal viibides) või pärast lõpetamist.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased on: * omandanud kaasaegse eetika pakutavad vahendid, et lahendada tänase maailma pakilisi eetilisi küsimusi, * harjutanud lugemise ning kirjaliku ja suulise suhtluse oskusi, et pidada põhjendatud väitlust, * võimelised neid oskusi kasutama nii uurimistöös kui väljaspool ülikooli. In order to participate, Philosophy in Practice MA students must have completed the Start Module courses. \n\nStudents from other MA and PhD curricula are welcome if they have completed 12 ECTS of philosophy courses, or if they come from non-philosophy curricula directly relevant to the course."}