{"KURSUSE_NIMI": "Seksuaaleetika ja -filosoofia", "KURSUSE_KOOD": "FLFI.02.155", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 20, "independent_work": 114, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine vaatleb seksuaalsusega seotud filosoofilisi küsimusi. Esmalt uuritakse, mis on seks, arutledes mitmesuguste seksuaalteooriate üle. Muuhulgas käsitletakse traditsioonilist vaadet seksile kui millelegi eelkõige järglaste saamisega seotule, kujutlust seksist kui armastuse väljendamise viisist ning teooriaid, mis rõhutavad eelkõige seksuaalset naudingut. Kursuse teises pooles vaadeldakse seksuaalkäitumise eetikat, arutledes monogaamia, prostitutsiooni, seksiga nõustumise ning pedofiilia üle.Objectives/eesmärkid:  1) Anda ülevaade peamistest seksuaalsusega seotud mõistelistest ja eetilistest küsimustest, 2) näidata, kuidas filosoofia saab meid aidata igapäevaste praktiliste küsimuste mõtestamisel, 3) arendada üliõpilaste oskust filosoofilisi tekstide kriitiliselt analüüsida, 4) arendada oskust oma seisukohti praktilistes eetikaküsimustes nii suuliselt kui kirjalikult korrektselt põhjendada, 5)  harjutada väitlemist era- ja avalikku sfääri kuuluvate väga emotsionaalsete ja vastuoluliste küsimuste üle.Learning outcomes/õpiväljund:  Aine edukalt läbinud üliõpilane: 1) on omandanud ülevaate seksuaaleetika ja -filosoofia peamistest küsimustest ja teooriatest,  2) oskab nii suuliselt kui kirjalikult esitada vaadeldud väidete tugevaid ja nõrku külgi, 3) teab, milline on filosoofia kui distsipliini panus seksuaalsuse uurimisse, 4) oskab selgelt ja täpselt suuliselt ja kirjalikult väljendada oma seisukohti vastavatel teemadel, 5) on võimeline mõistma ajaloolisi ning tänapäevaseid filosoofilisi, eetilisi ning ühiskondlikke seksuaalsust puudutavaid debatte ning neis osalema, 6) oskab hõlmata kaasüliõpilasi aruteludesse filosoofilistel teemadel. WARNING: The course includes material which may be found offensive, disturbing, or triggering.\n\nIn 2024/25 we will have the first meeting, all together, on 12 February, 10-12. Then we will meet in class only for SEMINARS (divided into two groups) every Wednesday times tba. LECTURES are posted as videos in Moodle.  \nLeaving a substantial comment on the video BY THE SUNDAY BEFORE THE SEMINAR is required and tells me that you have \"attended\" the lecture. After seeing your comment, I will mark your lecture attendance on the attendance sheet. A \"substantial comment\" means a relevant question or a relevant remark based on the actual content of the lecture.\n\nHow to write your comment: during or after watching the video, click on the arrow that looks like this  at the bottom of the video, then write your text in the line (it can be as long as you want). Your comment will show up under your name.\nAttending the lecture is crucial for understanding the texts to be discussed in seminars.\n\nPlease use Moodle e-mail for all communication with the lecturer. E-mails sent to my ut address may be discarded.\n\nNote for those taking the course as FLFI.00.025 Autori- või probleemseminar II (3 EAP): In your case, you are not required to do the mid-term essay. You may also choose to write it, in order to get writing practice, but I won't grade it. Your overall grade will result from seminar (50%) and final essay (50%)."}