{"KURSUSE_NIMI": "Praktika", "KURSUSE_KOOD": "FLFI.00.097", "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktika on õpiväljundite saavutamise sihipärane tegevus, mille eesmärk on rakendada õpitud teadmisi ja oskusi õppeasutuse määratud vormis ning juhendaja juhendamisel töökeskkonnas (võib toimuda ka õppekeskkonnas, kui õppijal on praktika käigus tavapärasest erinev roll).\nKõik tegevused tuleks eelnevalt kooskõlastada praktika koordinaatori Mats Volbergiga (mats.volberg@ut.ee)\nEnne praktikale asumist  tuleb koostada eesmärgistatud praktika plaan. Pärast praktika lõppu enesereflektsiooniga aruanne.\n\nNB! Praktikakoha leidmine on tudengi ülesanne ning see on osa praktikast (oskus leida endale töökohta)\n\n(see aine on mõeldud MA tudengitele)Objectives/eesmärkid:  Praktika eesmärk on anda üliõpilastele praktilist töökogemust. Arendada nende ülekantavad oskusi (sh projektijuhtimine, ajaplaneerimine, enesejuhtimine jne). Harjutada erinevates õppeainetes õpitu rakendamist töökeskkonnas ja arendada vastavaid vilumusi. Arendada oskust õpitut praktikakogemuse põhjal analüüsida ja kriitiliselt hinnata. Praktika täpne sisu lepitakse kokku individuaalselt ning sõltub üliõpilase taustast, huvidest ja karjääriplaneerimisest, praktika tegevus peab langema ühte allpool kirjeldatud kategooriasse: 1) Ettevõtluspraktika. Tudeng läheb praktikalepingu alusel praktikale mõne organisatsiooni juurde ülikoolist välja. Talle määratakse praktikakoha poolt juhendaja. Ta sooritab praktikakohas talle ettenähtud tööülesanded. 2) Projektipõhine praktika. Tudeng osaleb ühe konkreetse projekti meeskonna töös projekti algusest lõpuni. Projekti lähteülesandeks on kas ülikooliväline tellimus mõne organisatsiooni poolt. Või ülikooli sisene tellimus mõne allüksuse poolt. 3) Õppeassistendi praktika. Tudeng assisteerib õppejõudu ühe konkreetse õppeaine läbiviimise või teadustöö tegemise juures (sh akadeemiliste ürituste korraldamine).Learning outcomes/õpiväljund:  Praktika sooritanud üliõpilane: - oskab erialateadmisi ja -oskusi töökeskkonnas loovalt rakendada; - analüüsib oma praktilist tegevust enesekohaselt ja -kriitiliselt (eneseanalüüs), püüdes selle käigus lõimida praktikat teoreetiliste teadmistega; - on arendanud ülekantavaid oskusi töökeskkonnas (näiteks meeskonnatöö, ajaplaneerimine, projektijuhtimine jt); - annab praktika kohta tagasisidet juhendajale ja kaastudengitele. - on reflekteerinud oma kogemuse üle ning tunneb oma tugevusi ja nõrkusi seoses praktilise töökesskonnaga This course can be replaced by other practice based courses offered by the University (e.g. FLAJ.02.014 Practical Training in Archives, MTAT.03.324 Participation in Hackathons, etc.) Please contact the practice co-ordinator Mats Volberg (mats.volberg@ut.ee) beforehand to get prior authorization."}