{"KURSUSE_NIMI": "Euroopa mõtteloo sissejuhatus", "KURSUSE_KOOD": "FLFI.05.022", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "See 6 EAP õppeaine on mõeldud täiendusena õppeainele \"Euroopa ideede ajalugu\" (FLAJ.07.198; 3 EAP) ning toetub selle aine kavale. Õppeaine loengud on samad (K 10-12), aga lisandub iseseisev töö ideeajalooliste tekstidega Euroopa mõtteloo kesksetelt autoritelt (Aristoteles, Cicero, Machiavelli, Bodin, Hobbes, Locke, Rousseau).  \nKui varem on FLAJ.07.198 sooritatud, on aine võimalik teha 3 EAP mahus. \nKursuse läbimiseks tuleb kirjutada iga autori kohta kirjalik töö ehk memo (ca 1-2 lk) ning sooritada kirjalik eksam.Objectives/eesmärkid:  Aine eesmärkideks on: 1. Süvendada teadmisi Euroopa ühiskondliku mõtte ajaloo sõlmprobleemidest antiigist uusajani 2. Õpetada lugema ja mõistma Euroopa ühiskondliku mõtte ajaloo põhitekste nende ajaloolises kontekstis  3. Arendada analüüsioskust ning mõtete süstemaatilist ja loogilist väljendamist nii kõnes kui kirjasLearning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane on omandanud: 1. Süvendatud teadmised Euroopa ühiskondliku mõtte ajaloo sõlmprobleemidest antiigist uusajani. 2. Oskuse lugeda ja analüüsida ühiskondlik-poliitilisi tekste nende ajaloolises kontekstis. 3. Oskuse kasutada ühiskondliku mõtte ajaloo põhitermineid ning mõista nende ajaloolist tausta. Akadeemiline ausus ja loomevargus (plagieerimine)\nTartu Ülikoolis ei tolereerita pettust eksamitel ja loomevargust kursusetööde, esseede jm kodutööde kirjutamisel. Pettuselt või loomevarguselt tabatud üliõpilased kukuvad aines läbi ning võidakse eksmatrikuleerida.\nLoomevarguse liigid:\n1) allikatele pole viidatud - teiste autorite ideede või väljendite esitamine enda omadena; mujalt võetud idee esitamine uudse ja originaalsena\n2) alllikatele on viidatud, ent:\n- ebatäpselt, nii et allikat pole võimalik leida\n- tsitaadilt jäetakse ära jutumärgid, nii et jääb mulje, et tegemist on refereeringuga\n- refereerides muudetakse üksikuid sõnu või sõnade järjekorda, mitte ei võeta teksti mõtet iseseisvalt kokku\n- viited ja jutumärgid on olemas, ent puudub igasugune iseseisev panus\nLoomevargusel on kaks komponenti: teise töö tulemuste omandamine ning selle kohta valetamine Loomevarguse vältimiseks:\n1) kui tekst on võetud otse teisest tekstist, kasuta alati jutumärke (ka märkmeid tehes)\n2) teiste teksti refereerides väldi üksnes \"kosmeetilist\" muutmist (kasulik võte: loe enne tekst läbi ja refereeri seda peast, oma sõnadega; kontrolli pärast üle)\nViidata ei ole vaja üldtuntud faktidele (näiteks \"George Bush oli USA president 2000-2008\"), vaid faktide tõlgendustele ja vähetuntud faktidele."}