{"KURSUSE_NIMI": "Lugemisgrupp: mälu, aeg ja modernsus", "KURSUSE_KOOD": "FLFI.02.165", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus filosoofiasse"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine käigus loetakse aega käsitlevaid tekste võtmetähtsusega filosoofidelt nagu Augustinus, Heidegger, Benjamin ja Koselleck. Uurime, kuidas arusaamine aja mõistest on seotud modernismi ja postmodernismi ajalise piiritlemisega.Objectives/eesmärkid:  Aine eesmärk on tutvustada üliõpilastele tänapäeva kontinentaalset aja- ja ajaloofilosoofiat.Learning outcomes/õpiväljund:  Aine läbinud üliõpilasel on selge arusaam tänapäeva kontinentaalsest aja- ja ajaloofilosoofiast. Ta on ka arendanud oma filosoofilise teksti analüüsimise oskust ning esitlusoskusi. Topic: Historicity and crises\n\nIt is not uncommon to hear claims that this or that event is bound to change the way we perceive history. Such a change was expected at the beginning of the COVID-19 pandemic and is also discussed in relation to the ongoing climate change. The same talk about \"the end of the end of history\" or \"the return of the past\" was caused by the beginning of the Russian invasion of Ukraine. But what is \"perception of history\" anyway, and how can crises and major historical events influence it? In this course, we will study the concept of different types of historicity and how theorists explained its changes during epochal events - from the French Revolution and World War II to events of our day and the near future.\n\nPlanned course outcomes: Upon completion of this course, the student will be able to recall major theories of the studied branch of philosophy of history, as well as their aspects (remembering).\nThe student will also be able to demonstrate an understanding of the topic, compare the theories studied with each other, and identify their differences and possible applications (understanding).\nThe student will also gain the skill to critically analyze different theories in relation to each other and analyze both current and past historical events from the point of view of the material studied during the course (application).\nIn addition, the student will be able to demonstrate proficiency in presentation skills, communication skills, debate, academic writing, research, and independent sourcing (transferable skills).\nMethods used in the seminar: discussion of the reading material, group analysis of case studies."}