{"KURSUSE_NIMI": "Uurijaseminar", "KURSUSE_KOOD": "FLFI.00.116", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Filosoofia osakonna erinevate õppetoolide esindajad tutvustavad esimese semestri magistrantidele uurimisteemasid, millega nad parajasti töötavad või on töötanud. \nIgal kohtumisel arutatakse üht või mitut vastava õppejõu või teiste sobivate autorite kirjatööd.Objectives/eesmärkid:  - Tutvustada magistrantidele tänapäevase filosoofilise uurimistöö meetodeid ja konkreetseid näiteid.\n- Aidata üliõpilastel mõista, millistele filosoofia valdkondadele nad sooviksid spetsialiseeruda ning milliste kitsamate küsimustega oma uurimistöös tegeleda.\n- Tutvustada TÜ filosoofia osakonnas tehtava teadustöö suundi.\n- Alustada uurimistöö oskuste arendamist.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud magistrandid omavad ülevaadet tänapäevase filosoofilise uurimistöö meetodeist ja konkreetseist näiteist, on arendanud oma teadusliku uurimistöö oskusi, võimet osaleda akadeemilises diskussioonis ning oskust töötada koos kaastudengite ning õppejõududega. About using chatbots in this course:\nFor the tasks of this course, the use of chatbots like ChatGPT is practically pointless. Besides, your first point of contact for any kind of help with writing or understanding a text should be the lecturer: he or she knows more about the subject of the course than ChatGPT. In any case the guidelines of the University must be followed, in particular keep this in mind: \"Using an AI chatbot or other AI application to an unjustified extent or without reference constitutes academic fraud\". See the full document at https://ut.ee/et/sisu/university-tartu-guidelines-using-ai-chatbots-teaching-and-studies."}