{"KURSUSE_NIMI": "Rahvusvahelise korra piirid: riik ja suveräänsus ajaloos ja tänapäeval", "KURSUSE_KOOD": "FLFI.05.043", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 24, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine käsitleb suveräänsuse ja riigiga seonduvaid ideid nende ajaloolises kontekstis, toetudes poliitilise mõtte ajaloo kesksetele tekstidele varauusajast tänapäevani. Kursus arendab filosoofiliste tekstide lugemise ja tõlgendamise oskust, keskendudes riigivõimu, õiguse, õiguste, vägivalla ja biopoliitikaga seotud küsimustele ja sidudes need tänapäeva väljakutsete ja probleemidega nagu hädaolukord, rahvatervis, terrorism, sõda jm nii totalitaarsetes kui demokraatlikes riikides.Objectives/eesmärkid:  This course improves understanding of the current international order and its limits (the erosion of political legitimacy, war and terrorism, cybersecurity, the paralysis of international organizations, etc.) through a study of the ground and limits of state power in a globalized world. This study is centered on the concept of sovereignty. The course traces the philosophical and historical origins, interpretations, and permutations of the concept, and uses these as a lens to understand the problems facing the international order today.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane: * teab mõistete \"riik\" ja \"suveräänsus\" ajaloolist päritolu ja filosoofilisi aluseid ning hoomab suveräänsuse mitmetahulisi tähendusi tänapäeva poliitilises filosoofias; * oskab siduda suveräänsuse kontseptsiooni aktuaalsete aruteludega poliitilise legitiimsuse ja rahvusvahelise korra küsimustes. Täpsemalt üliõpilane:  * on omandanud süstemaatilise arusaama suveräänsuse ja riigi ideedest poliitilise mõtte ajaloos; * on omandanud teadmisi olulisematest poliitikafilosoofidest ja võtmetekstidest riigi- ja suveräänsusvaidlustes; * on omandanud võime näha laialdast viisi, kuidas põhimõttelised eeldused suveräänsuse olemuse kohta raamivad kaasaegseid arutelusid legitiimsuse ja rahvusvahelise korra üle; * on omandanud suutlikkuse arutleda poliitiliste ja rahvusvaheliste kriiside põhjuste ja võimalike lahenduste üle suveräänsuse ja riigivõimu mõistete prisma kaudu; * on omandanud oskuse analüüsida poliitilise mõtte ajalukku kuuluvaid tekste, arvestades nende ajaloolist konteksti; * on parandanud oma kriitilise mõtlemise võimet ja oskust väljendada mõtteid selgelt kirjalikult ja suulistes aruteludes; * on rakendanud kriitilist mõtlemist suveräänsusest tänapäeva poliitika tegelikele väljakutsetele. Prerequisite courses:\n* For Philosophy in Practice MA students--the Start Module courses. \n* MA and PhD students from topically related curricula (e.g., politics, law, history) should speak to the course lecturer about the possibility of participation.\n* Recommended BA in philosophy, politics, or history."}