{"KURSUSE_NIMI": "Kirjandustekstid eesti tõlkekultuuris", "KURSUSE_KOOD": "FLFL.00.010", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kasutades mitmesugustest lähtekeeltest (ladina, inglise, hispaania, prantsuse, vene jne) pärinevaid tekste, tutvustatakse erinevaid võimalusi tõlgitud kirjandustekstide analüüsiks, pöörates tähelepanu erinevate tõlkevalikute tähendusele kultuuriruumis ja sellest lähtuvatele võimalikele retseptsioonierinevustele. Lisaks ilukirjanduslike tekstide analüüsile antakse kursuse raames ülevaade tähtsamatest arengutest ja põhisuundadest tänapäeva tõlketeaduses. Tutvustatakse tõlkeuuringute kui distsipliini eripära ja võrreldakse Eesti tõlketeaduslikku mõtet (Lotman, Torop, Lange jt) mujal valitsevate suundadega.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade eesti tõlkeloo peajoontest, tutvustada ilukirjanduslike tekstide eestindamiskultuuri tähtsamaid arenguid, käsitleda peamisi tõlkekeeli, - meetodeid ja - strateegiaid läbi eesti tõlkeajaloo ning analüüsida tekste, keskendudes ilukirjanduslikele tõlgetele ja vaadeldes eraldi proosa-, draama- ja luuletõlkeid. Kursus pöörab tähelepanu ilukirjanduse tõlgete olulisusele  eesti keele ja kultuuri kujunemiseloos ja tõlkija valikute määravusele tõlketeksti kujunemises ja retseptsioonis.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane omab ülevaadet eesti tõlkeloo tähtsündmustest, pöördepunktidest ja olulisematest ilukirjandusliku tõlke meetoditest, on võimeline analüüsima erinevat tüüpi ilukirjanduslikke tekste, märkab võimalikke tõlkeprobleeme ja nende lahendusvõimalusi, suudab näha erinevaid tõlkevõimalusi ja teha ise tõlkijana mõtestatud valikuid. Lisaks sellele tunneb üliõpilane tõlketeaduse uuemaid suundi ning on saanud esmase ettevalmistuse tõlgete teaduslikuks uurimiseks."}