{"KURSUSE_NIMI": "Saksa keele grammatika I", "KURSUSE_KOOD": "FLGR.04.717", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tähtsamad sõnaliigid (tegusõna, nimisõna, omadussõna, asesõna), nende vormistik ja vormide funktsioonid. \nSaksa lauseehituse põhialused: tegusõna asukoht lauses (3 struktuuritüüpi) ja tüüpilised lausemudelid.Objectives/eesmärkid:  Grammatika annab üliõpilastele võimaluse täiendada oma teadmisi saksa keele grammatika olulisemates küsimustes, mis on aluseks saksa keele valdamiseks nii kõnes kui kirjas. Kursuse eesmärgiks on keelelise mõtlemisoskuse arendamine.Learning outcomes/õpiväljund:  Pärast kursuse läbimist üliõpilane\n\n1) teab ja kasutab ükskeelseid elektroonilisi sõnaraamatuid (dwds.de, duden.de) ja keelekorpusi (deSkell) grammatilise teabe leidmiseks;\n2) oskab määrata nimisõnade sugu tähenduse ja järelliite põhjal ning tunneb enamlevinud homonüüme saksa keeles;\n3) kasutab kontekstis õigesti määravat, umbmäärast ja nullartiklit;\n4) tunneb viit mitmuse moodustamise põhitüüpi ja teab mitmuse moodustamise reegleid;\n5) tunneb nimisõnade käändkondi, oskab nimisõnu oma tekstides õigesti käänata nii ainsuses kui ka mitmuses;\n6) tunneb omadussõnade käändkondi ja oskab moodustada võrdlusastmeid, kasutab omadussõnu tekstides grammatiliselt õigesti;\n7) teab millised eessõnad nõuavad nimisõna geniitivis, daativis, akusatiivis või daativis (kus?) ja akusatiivis  (kuhu?) ning kasutab eessõnu tekstiloomes grammatiliselt õigesti;\n8) tunneb ja kasutab erinevaid ajavorme;\n9) tunneb ja kasutab tegusõna rektsiooni,\n10) määrab tegusõna eesliite (lahutatav/ mittelahutatav) ning kasutab neid kontekstis;\n11) moodustab tingiva kõneviisi (Konjunktiv II) erinevaid ajavorme ning kasutab neid tekstiloomes,\n12) moodustab passiivi erinevaid ajavorme ning kasutab neid tekstiloomes.\n13) väärtustab grammatikat ning kirjakeele normile vastavat kirjutusviisi, kasutades klaviatuuril saksa ß-i ja automaatset õigekirjakontrolli."}