{"KURSUSE_NIMI": "Seminar vene keele semantikast ja pragmaatikast", "KURSUSE_KOOD": "FLGR.05.193", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 2, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus tutvustab semantika (tähendusõpetuse) üldiseid suundi ja terminoloogiat ning vene keele semantika tunnusjooni. Kursus katab järgmisi teemasid: sõna funktsioonid, sõnatähenduse struktuur (signification, denotation, referent), vene polüsemantilise sõna tähenduste hierarhia ning arenemise üldjooned, sõna semantilised ning süstemaatilised seosed keeles, sõnatähenduse komponentide analüüs. Kursus on pühendatud  vene keele pragmaatiliste vahendite kirjeldusele lauses ja tekstis. Käsitletakse vene keele pragmaatika iseärasusi: temporaalsuse ja lokaalsuse pragmaatilist aspekti, hinnangu erinevaid tüüpe, kõneakti tüüpe, evidentsionaalsust, dialoogi tüüpe ja struktuuri.Objectives/eesmärkid:  Tutvustada üliõpilastele sõnatähenduse probleeme ja kirjeldamise meetodeid, keeleühikute vene keeles ja kõnes funktsioneerimise tingimusi, erinevaid keeleühikute tähendusi käsitlevaid suundi (sh komponentanalüüsi meetod, Moskva semantilise koolkonda mudel „Mõte  Tekst\", kognitiivlingvistika, korpuselingvistika). Kursuse käigus arutatakse vene keeles eksisteeriva keelemängu semantilist alust, vene sõna süsteemseid seoseid (mitte ainult süntagmaatilisi ja paradigmaatilisi, vaid ka sõnamoodustusseoseid, mis on vene keele semantika mõttes väga spetsiifilised). Kursuse eesmärgiks on anda teoreetiline ülevaade keelte pragmaatilisest aspektist, vene keele pragmaatikast, pragmaatika väljendusviisidest vene keeles ja keele ja kõnepragmaatika analüüsi meetoditest.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: omab süsteemseid teadmisi leksikaalse tähenduse struktuurist, vene sõna süntagmaatilistest, paradigmaatilistest ja sõnamoodustusseostest, oskab kasutada komponentanalüüsi võtteid. Omandatud teadmiste põhjal üliõpilane oskab leida vene sõna valekasutamise põhjusi ning seletada õige kasutamise tingimusi. Kursuse läbinud üliõpilane orienteerub pragmaatika teoreetilises taustas, tunneb vene keele pragmaatika iseärasusi, oskab analüüsida erinevaid tekste, suudab rakendada omandatud meetodeid iseseisvas analüüsis."}