{"KURSUSE_NIMI": "Hispaania keele praktikum I", "KURSUSE_KOOD": "FLGR.03.257", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb kahest osaainest: hispaania keele foneetikast ja tekstianalüüsist. Tekstianalüüsis arendatakse hispaaniakeelse kirjaliku teksti mõistmise oskust.\nFoneetika osaaine sisaldab praktilist (kuulamine, häälduspraktika) ja teoreetilist osa (foneetika põhimõisted, hispaania keele häälikusüsteem, foneetiline transkriptsioon).Objectives/eesmärkid:  Omandada hispaania keele häälduspõhimõtted ja alusteadmised foneetikast ning arendada kirjaliku teksti mõistmise oskusi.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Ainekursuse edukalt läbinud üliõpilane:\nTEKSTIANALÜÜS:\n1) loeb ja mõistab lihtsaid hispaaniakeelseid kirjalikke tekste; \n2) on omandanud peamised kirjaliku teksti mõistmise õpistrateegiad.\nFONEETIKA:\n1) valdab hispaania keele hääldus- ja ortograafiapõhimõtteid; \n2) tunneb hispaania keele foneetika põhialuseid;\n3) on omandanud transkribeerimisoskuse. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}