{"KURSUSE_NIMI": "Bakalaureuseseminar ja bakalaureusetöö", "KURSUSE_KOOD": "FLGR.01.268", "EAP": 6, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 144, "individual_work": 8, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Bakalaureuseseminari tulemusena valmib iseseisev uurimus inglise keele, ingliskeelse kirjanduse või maiskonnaloo mõnest kitsamast, uurimist väärivast aspektist. Aine toetab töö kirjutamise protsessi. Käsitletakse bakalaureusetöö kirjutamise teoreetilisi ja metoodilisi aluseid ning ingliskeelsete akadeemiliste tekstide kirjutamise tavasid; antakse praktilisi näpunäited kirjutamisprotsessi edendamiseks ning töö edukaks kaitsmiseks. Olulise osa seminarist moodustab üliõpilaste bakalaureusetöö peatükkide analüüsimine ja tagasisidestamine.Objectives/eesmärkid:  Iseseisva uurimuse kirjutamine inglise keele, ingliskeelse kirjanduse või maiskonnaloo mõnest kitsamast, uurimist väärivast aspektist koos ingliskeelse akadeemilise kirjutamise probleemidega tutvumisega ja sobivate võtete rakendamisega. Bakalaureuseseminar annab üliõpilastele võimaluse: - õppida tundma keele, kirjanduse või kultuuri uurimise põhilisi meetodeid ingliskeelses kultuuriruumis; - süvendada teadmisi valitud uurimisvaldkonnast; - arendada oskust iseseisvalt sõnastada aktuaalset uurimisküsimust, koguda informatsiooni ning seda tõlgendada; - täiendada praktilisi oskusi ingliskeelse teadusteksti loomisel.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane - valdab ingliskeelse akadeemilise uurimistöö koostamise peamisi teoreetilisi põhimõtteid ja praktilisi võtteid, - oskab leida uurimistööks sobivaid allikmaterjale ja nende usaldusväärsust hinnata, - suudab koostöös juhendajaga püstitada uurimisküsimuse, valida sobiva metoodika, viia läbi uurimuse ning analüüsida ja tõlgendada tulemusi, - suudab luua argumenteeritud akadeemilist teksti lähtudes ingliskeelse akadeemilise kirjutamise tavadest. Bakalaureusetöö on uurimuslik töö, mis käsitleb ühte uurimist väärivat erialast probleemi, kasutades vastava teemaga seotud teaduskirjandust. Töö keskendub inglise keele, inglise keeles kirjutatud kirjanduse või inglise keelt kõnelevate maade kultuuri mingile konkreetsele fokusseeritud aspektile ning see kirjutatakse ühe anglistika osakonna õppejõu juhendamisel. Bakalaureusetöö kirjutatakse inglise keeles.  See peab sisaldama konkreetset probleemipüsitust, iseseisvat analüüsi ja sünteesi. Töö järgib ingliskeelse akadeemilise kirjutamise tavasid ja on kirjutatud korrektses inglise keeles. Bakalaureusetöö (6 EAP) põhiteksti maht on orienteeruvalt 25-30 standardlehekülge (1800 tähemärki). Bakalaureusetöö inglise keele kasutus on üks hindamisele kuuluvaid töö aspekte."}