{"KURSUSE_NIMI": "Ülevaatekursus Skandinaavia maade kirjandusest", "KURSUSE_KOOD": "FLGR.06.025", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Skandinaavia keeled"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb  Skandinaavia kirjanduse peamiseid suundi, epohhe, autoreid ja teoseid perioodil 16. sajandist kuni tänapäevani. Kursuse keskmes on tekstide lugemine ja analüüs; väljavalitud tekstid illustreerivad Norra, Rootsi ja Taani kirjandusajaloo tähtsamaid autoreid ja teoseid. Norra filoloogide puhul on rõhuasetus tehtud rootsi ja taani kirjandusele; rootsi filoloogide puhul norra ja taani kirjandusele ning taani filoloogide puhul norra ja rootsi kirjandusele. Samas tuuakse esile Skandinaavia kirjanduse üldiseid suundumusi ning selgitatakse paralleele ja erinevusi erinevate maade vahel.Objectives/eesmärkid:  Kursuse eesmärgiks on ülevaate andmine Skandinaavia maade (Norra, Rootsi, Taani) kirjandusest umbes 16. sajandist kuni tänapäevani, selgitades Norra, Rootsi ja Taani kirjandustraditsiooni peamiseid suundi, epohhe ja olulisemaid autoreid. Kursus loob võimaluse õppida tundma Skandinaavia kirjanduse tähtteoseid, mis omakorda aitavad kaasa Skandinaavia kultuuriloo ja ühiskonna mõistmisele. Kuna kursuse raames loetakse tekste originaalkeeles, loob kursus ühtlasi soodsa pinnase üliõpilaste passiivse keeleoskuse arendamiseks neis keeltes, mis ei kuulu põhieriala juurde.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - nimetab Norra, Rootsi ja Taani kirjandusajaloo põhilisi arengujooni ning suundi 16. sajandist kuni 20. sajandi teise pooleni; - võrdleb ja analüüsib Norra, Rootsi ja Taani kirjandustraditsioone; - nimetab Skandinaavia kirjanduse tähtsamaid autoreid ja teoseid ning tutvustab neid teistele. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}