{"KURSUSE_NIMI": "Diskursuseanalüüsi seminar", "KURSUSE_KOOD": "FLGR.01.181", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tutvustab diskursuse mõiste ja selle rakendamisvõimalusi erinevates anglistika alavaldkondades (keele- ja kirjandusteaduses, kultuuriuuringutes, keeleõppes).\nKursus tutvustab ingliskeelsetes tekstides kasutatavaid argumentatioonivõtteid ja diskursusi ning tekstide ja diskursuste analüüsiks sobivaid meetodeid. Vaadeldakse nii suulisi kui kirjalikke tekste, analüüsides neis kasutatavaid argumentatsioonivõtteid, struktuurilist ülesehitust, kultuurilis-ideoloogilisi diskursusi. Tekstide analüüs toetab üliõpilaste ingliskeelse suulise ja kirjaliku väljenduse oskuse arengut, aga ka iseseisvaks uurimistööks vajalike kriitilise lugemise ja analüüsi oskust.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada diskursuse mõistet ja selle rakendusvõimalusi erinevates anglistika valdkondades (keele- ja kirjandusteaduses, kultuuriuuringutes, keeleõppes). Kursus tutvustab ingliskeelsetes tekstides kasutatavaid argumentatsioonivõtteid ja diskursusi ning tekstide ja diskursuste analüüsiks sobivaid meetodeid. Vaadeldakse nii suulisi kui kirjalikke tekste anglistika erinevates alavaldkondades. Loetakse ja analüüstakse erinevaid tekstitüüpe, sh akadeemilisi tekste, mille kaudu üliõpilased harjutavad oma uurimistöödes vajalikku kriitilise lugemise oskust.Learning outcomes/õpiväljund:  Kursuse tulemusena  omandavad üliõpilased ülevaate diskursusanalüüsi interdistsiplinaarsetest võimalustes ning oskavad selle põhimeetodeid oma uurimustöös rakendada. Nad tunnevad  ära ingliskeelsetes kultuurides käibivaid diskursusi ning oskavad neid Eesti omadega võrrelda. Nad omandavad erinevate ingliskeelsete tekstitüüpide analüüsiks sobivaid võtteid ja õpivad ka kriitiliselt analüüsima diskursusanalüüsi kasutust teaduskirjanduses. Üliõpilased arendavad kriitilise lugemise ja tekstide lähianalüüsioskust, oskust töötada ingliskeelsete tekstidega ning akadeemilise kirjaliku eneseväljenduse oskust."}