{"KURSUSE_NIMI": "Rootsi keeleajalugu", "KURSUSE_KOOD": "FLGR.06.034", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus antakse ülevaade rootsi keele ajaloolisest arengust erinevatel perioodidel. Selgitatakse suulise keele ja kirjakeele vahekorda erinevatel perioodidel. Kursuse põhitemaatika keskendub iseäranis keelesüsteemi muutumisele alates 16. sajandist ning kirjakeele stabiliseerumise ja standardiseerumise protsessidele. Selgitatakse keelesiseseid muudatusi ning vaadeldakse mõjutusi (laensõnu) teistest keeltest. Moodsa rootsi keele kirjeldamisel antakse ülevaade olulisematest keelepoliitilistest põhimõtetest ning keele normeerimisest. Seminarides tutvutakse erinevatest perioodidest pärinevate tekstidega ja püütakse nende põhjal analüüsida ja selgitada keelelisi muudatusi (fonoloogilised, morfoloogilised, süntaktilised, leksikaalsed muudatused). Samuti tutvustatakse erinevate perioodide isikunimede traditsiooni.Objectives/eesmärkid:  Kursuse eesmärgiks on anda põhiteadmised rootsi keele ajaloost, vaadeldes rootsi keele erinevaid arenguetappe nende ajaloolises muutumises ning iseloomustades keelesüsteemi kindlates arengujärkudes. Analüüsides eri perioodide tekstimaterjali, õpitakse tundma rootsi keele peamiseid tunnusjooni ning seoseid lähemate sugulaskeeltega. Kursus selgitab samuti suulise keele ja kirjakeele vahekorda, nende sotsiaalseid ja kultuurilisi arengutingimusi ning loob sel moel eelduse Rootsi tänapäevase keeleolukorra mõistmiseks.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - nimetab rootsi keele erinevaid arenguetappe; - seostab ajalooliseses perspektiivis rootsi keelt selle sugulaskeeltega; - analüüsib lihtsamaid keeleajaloolisi tekste ning iseloomustab nende põhjal keele konkreetseid arengustaadiume; - saab aru Rootsi tänapäevase keelesituatsiooni ajaloolisest tagapõhjast; - selgitab keele ja ühiskonna sotsiokultuurilisi seoseid. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}