{"KURSUSE_NIMI": "Proseminar antiikkultuurist: sissejuhatus erialasse", "KURSUSE_KOOD": "FLGR.02.133", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 4, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab ülevaate klassikalise filoloogia arengust ja uurimissuundadest, vaadeldes keele- ja kirjandusteaduse taustal antiikautorite tekstide käsitlemist. Selgitatakse tekstikriitika, editsioonikriitika ja interpretatsiooni suundi. Antakse lühiülevaade eriala arengust Eestis. Kursus loob aluse orienteerumisele järgnevates ainetes klassikalises filoloogias.Objectives/eesmärkid:  Anda üldine iseloomustus klassikalise filoloogia eriala kohta, selgitada põhilisi arengusuundi, kuidas antiikautorite tekste on vaadeldud, milliste abiteadustega eriala on seotud. Rõhuasetus on uuematel arengutel erialal, mille kaudu iseloomustatakse erinevaid lähenemisi probleemidele. Tutvustatakse erialaga seotud teisi teadusi, mia aitavad kaasa antiikkirjanduse ja kultuuri mõistmisele.Learning outcomes/õpiväljund:  Üliõpilased \n1) omavad ülevaadet klassikalise filoloogia erinevatest uurimisvaldkondadest ja nende ajaloolisest arengust;\n2) tunnevad erinevaid uurimisvaldkondi, mis avardavad arusaamist antiikkultuurist: keele- ja kirjandusuurimused, epigraafika, arheoloogia jne.;\n3) loovad seoseid klassikalise filoloogia ja teiste humanitaarvaldkondade vahel;\n4) omavad esialgset arusaama antiikkeelte ja -kultuuride uurimisvaldkonna karjäärivõimalustest. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}