{"KURSUSE_NIMI": "Kreeka keele ajalugu ja dialektid", "KURSUSE_KOOD": "FLGR.02.518", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 26, "seminar": 4, "independent_work": 100, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpitakse tundma vanakreeka keele ajalugu nii indoeuroopa ajaloolise keeleteaduse osana (keskendudes ajaloolisele fonoloogiale ja morfoloogiale) kui selle dialektide väljakujunemise ja arengu käsitlemise kaudu. Praktikumide ja loengute käigus tutvutakse vanakreeka keele peamiste dialektidega, analüüsides erinevates dialektides kirjutatud tekste (mykeene perioodist hellenismiajani).Objectives/eesmärkid:  Õppida tundma vanakreeka keele ajalugu, nii ajaloolise indoeuroopa võrdleva keeleteaduse seisukohast (ajaloolise fonoloogia ja morfoloogia käsitlemise kaudu) kui selle keele erinevaid dialekte ja nende arengut (Mykeene perioodist kuni kuni bütsantsi ajani).Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Üliõpilased õpivad tundma peamisi jooni, mis põhjustavad muudatusi keelte arengus. Nad õpivad tundma tähtsamaid vanakreeka keele häälikumuutuste seaduspärasusi, samuti morfoloogia ja süntaksi arengu põhijooni. Kursuse 2. pooles omandatakse põhiteadmised erinevate vanakreeka dialektide kohta, nii et üliõpilased on võimalik neid ära tundma ning lugema nendes kirjutatud epigraafilisi tekste Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}