{"KURSUSE_NIMI": "Tekstianalüüs", "KURSUSE_KOOD": "FLGR.06.026", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus analüüsitakse ja koostatakse erinevat tüüpi tekste, õpitakse tundma olulisemaid praktilise tekstianalüüsi mudeleid ja võtteid ning arendatakse edasi suulist ja kirjalikku väljendusoskust. Analüüsimaterjaliks on autentsed norra-/rootsi-/taanikeelsed tekstid aimekirjanduse, ilukirjanduse, teabekirjanduse ja tarbekirjanduse vallast, sh kultuurispetsiifilise sisuga tekstid. Kursuse sisu varieerub aastast-aastasse vastavalt sihtgrupile: rootsi filoloogid teevad tööd rootsikeelsete, taani filoloogid taanikeelsete ja norra filoloogid norrakeelsete tekstidega.Objectives/eesmärkid:  Kursuse eesmärgiks on arendada üliõpilaste praktilise norra / taani/ rootsi keele oskust töös mitmesuguste tekstidega, tutvustades neile ühtlasi erinevat tüüpi tekstide koostamise ja analüüsi lihtsamaid põhimõtteid. Autentsete tekstide lugemise ja analüüsi teel õpitakse samuti tundma Norra / Rootsi / Taani ühiskonnale iseloomulikke jooni.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - analüüsib erinevat tüüpi tekste, rakendades peamiseid praktilise tekstianalüüsi mudeleid ja võtteid; - toob välja erinevat tüüpi tekstide olulisemaid tunnusjooni, eristab neid üksteisest ning võrdleb neid omavahel (sh ilukirjandus, aimekirjandus, teabekirjandus, tarbetekstid);  - kirjutab omandatud teadmisi aluseks võttes lihtsamat tüüpi standardtekste norra / rootsi / taani keeles; - on töös autentse tekstimaterjaliga omandanud alusteadmised Norra / Rootsi / Taani ühiskonnaelu kohta. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}