{"KURSUSE_NIMI": "Taani morfoloogia ja süntaks", "KURSUSE_KOOD": "FLGR.06.032", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse esimene pool keskendub taani sõnade morfoloogilise struktuuri ning klassifikatsiooni käsitlemisele, teises osas tutvutakse süntaktilise analüüsi mõistetega ning süvendatakse arusaamist taani keele lauseehitusest. Kursuse jooksul tehakse morfoloogilise ja süntaktilise analüüsi harjutusi, et omandatud mõisteid ja teoreetilisi teadmisi praktikas rakendama õppida. Kursuse morfoloogiaosa käsitleb järgmisi teemasid: morfoloogia eesmärk ja põhimõisted, morfoloogilise analüüsi põhimõtted, sõnamuutmine (pööramine ja käänamine) ja sõnamoodustus (tuletus ja liitmine). Süntaksiõpetuses on põhirõhk taani keele lausete ja lauseosade süntaktilisel analüüsil (taani lausestruktuuri skeem). Samuti võrreldakse taani keele lauseehitust eesti keele lauseehitusega, juhtimaks tähelepanu sarnasustele ja erinevustele nimetatud keeltes.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade taani keele vormilisest ülesehitusest - morfoloogiast ja süntaksist. Kursuse käigus omandatakse teoreetilised põhiteadmised taani keele sõna- ja lauseõpetusest ning õpitakse tundma antud valdkonda puudutavat terminoloogiat. Omandatud mõisted ja teoreetilised teadmised kinnistatakse praktilisi harjutusi tehes. Kursuse eesmärgiks on seega suurendada teadmisi taani keele grammatikast, omandada oskused taani keele keeleteaduslikuks kirjeldamiseks ja seeläbi süvendada taani keele valdamist.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - mõistab taani keele vormilist ülesehitust ning võrdleb seda teoreetilisel ja praktilisel alusel teiste keeltega; - analüüsib grammatiliselt taani keele sõnu ja lauseid; - nimetab taani keele morfoloogia ja süntaksi valdkonda kuuluvat olulisemat terminoloogiat ning selgitab mõistete sisu; - rakendab omandatud teadmisi praktilises keelekasutuses."}