{"KURSUSE_NIMI": "Tõlge: ajalugu, teooria, praktika", "KURSUSE_KOOD": "FLGR.01.341", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 6, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 4}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus Tõlge: ajalugu, teooria, praktika annab ülevaate Euroopa tõlkeloost ja tõlkepraktikatest Püha Hieronymusest Martin Lutheri ja Anton Thor Helleni ning käsitleb muutusi Eesti tõlkepoeetikas Johannes Aavikust Tõnu Õnnepaluni. Analüüsime tõlkimise teooriaid ja praktikaid nii läbi tõlkeloo kanooniliste kui ka erandlike tekstide. Võrdleme, analüüsime ja tõlgime ka ise. Kursus toimub kombineeritult loengu vormis osade, vestluste, arutelude ja praktiliste töödega. Kursusel käsitletakse tõlketekste erinevatest keeltest ja anritest, põhirõhk on esmalt sakraalsete tekstide ja seejärel ilukirjanduslike tekstide tõlkimisel eri keeltest eri ajastutel. Kolmandik kursusest keskendub Eesti tõlkeloole ja tõlkepraktikatele Eestis alates eelmise sajandi esikümnendist.\nJuhul, kui pole teisiti instrueeritud, tuleb kursuse jooksul mitteauditoorse tööna ette valmistada üks kommenteeritud tõlge (vastavalt osavõtjate arvule võib ülesande asendada esseega või presentatsiooniga). Muud praktilised tööd toimuvad auditoorselt.\nObjectives/eesmärkid:  Kursuse eesmärk on tutvustada tõlketeoreetilise mõtte arengut läbi aja peamiselt lääne kultuuriruumis, kuid mitte ainult läbi lääneliku vaatevinkli, ja proovida nii praktilise tõlke kui tõlketekstide kõrvutamise kaudu mõnda teooriat rakendada ja testida. Kursus annab üliõpilasele võimaluse arutleda tõlke tähenduse ja olulisuse üle konkreetsete tõlketekstide võrdleva analüüsi kaudu. Samas kompame ka keelelisi ja kultuurilisi piire. Üliõpilane saab aine raames harjutada võrdlevat tekstianalüüsi, analüüsida ja praktiseerida erinevaid tõlkestiile ja võrrelda eri anridesse ja ajastutesse kuuluvate tekstide tõlkimise viise.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: omab ülevaadet Euroopa tõlkeloos olulistest sündmustest, tekstidest ja tõlkepraktikatest; oskab tuvastada uurimiseks sobivat materjali, leida meetodit materjali analüüsiks ja teooriat leidude süsteemseks kirjeldamiseks.  Kursus arendab üliõpilase erialaseid pädevusi tõlketeaduse ja praktilise tõlke valdkonnas. Teooriat ja praktikat ühendades õpetab kursus hindama tõlke ja tõlkimise olulisust erinevates valdkondades, kultuurides ja erinevatel aegadel. Kursuse läbinud üliõpilane omab kronoloogilisi teadmisi Euroopa (Sh. ka Eesti) tõlkeloost, tõlkimise teooria arengust ja erinevatest tõlkepraktikatest."}