{"KURSUSE_NIMI": "Saksa kultuur ja interkultuurilisus", "KURSUSE_KOOD": "FLGR.04.732", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel käsitletakse mõisteid 'kultuur' ja 'interkultuurilisus' nii ajaloolises kui süstemaatilisest aspektist. Kursuse esimeses pooles keskendutakse Herderi, Rousseau ja Goethe arusaamadele kultuurist, vaadeldakse eeposeid tõeluse ja fiktsiooni pingeväljas, kultuuri ja propaganda seoseid ja kultuuri ning barbaarsuse seoseid totalitaarse reziimi ajal 20.sajandil. Kursuse teises pooles uuritakse kultuuri ja interkultuurilisuse mõistete kontseptualismi erinevates teadusvaldkondades: semiootika, kultuuridevaheline kommunikatsioon, tõlketeadused, kultuurididaktika ja kirjandusteadused.Objectives/eesmärkid:  Üliõpilasele antakse võimalus arutleda kirjanduse ja kultuuri fundamentaalsete küsimuste üle, laiendada oma teadmisi kultuuri ja interkultuurilisuse enamlevinud kontseptsioonide kohta. Analüüsides lähemalt 18.-21.sajandi kultuuriteooria võtmetekste ning kaasaegset saksa kirjandust ja filmi, avardavad üliõpilased oma kirjanduslik-kultuurilist teadvust ja silmaringi ning arendada kriitilist meelt ja uurivat mõtteviisi. Kursus on saksa keeles.Learning outcomes/õpiväljund:  After the course, the students will be thoroughly familiar with key texts of cultural and intercultural theory, as well as with some examples of contemporary German language literature and film.\nThey will have developed an understanding of the concepts of culture and interculturality and will be able to apply them to the national, European and international contexts, as well as to literature and film.\nThey will be able to recognize, define and explain various theoretical approaches to culture and interculturality. \nThey will be able to compare different perspectives and their effects and have thus developed their own position about culture, including their own. \nThey will have trained their reading and analytical skills of highly complex theory, primary and secondary literature, as well as of film. They will also have developed and applied their own methodological and theoretical skills in academic oral and written exercises, thus developed their presentational skills.\nThey will have learned to compare texts and periods, and produce a cogent, clearly structured evaluation.\nThey will also have developed and practised transferable skills such as problem solving, data analysis, communication skills, time management, work ethics, listening and providing feedback.\nThey will have developed digital skills such as using search engines and data banks while being aware of their structure and operation modes so that they can critically evaluate the sources and their reliability. Furthermore, they have practised using various word processing functions and creating content in different formats.\nNad on arendanud erinevaid digipädevusi nagu otsingumootorite ja andmebaaside kasutamine, nad oskavad kriitiliselt hinnata kasutatud allikaid, nad on praktiseerinud mitmeid tekstiloomefunktsioone ning loodnud erinevaid tekste."}