{"KURSUSE_NIMI": "Klassikajärgse kirjanduse seminar", "KURSUSE_KOOD": "FLGR.02.074", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ülevaade kreeka romaani anrist. Katkendite lugemine, tõlkimine ja stilistiline analüüsimine Achilleus Tatiose, Heliodorose, Xenophoni Ephesosest, Longose ja Charitoni romaanides. Analüüsitakse stiili ja kompositsioonitehnikat, narratiivi erinevaid osiseid, autori ja lugeja suhet.\n        Analüüsitakse Apuleiuse romaani Kuldne eesel ehk Metamorfoosid. Jälgitakse raamjutustuse ja sissepõimitud lugude vahelist seost, tegelaskujusid ja nende iseloomustamiseks kasutatavaid kirjanduslikke võtteid. Tegevuse dünaamika vaatlemisel keskendutakse eriti peatükke alustavatele ja lõpetavatele tekstilõikudele, Stiili analüüsitakse kõlakujundite, metafooride, korduste, leksika kasutamise (neologismid, arhaismid), sõnajärje jm. aspektidest. Näitena vaadeldakse ka katkendit Petroniuse romaanist.Objectives/eesmärkid:  Süveneda klassikajärgse proosa, eelkõige romaanianri stilistilistesse ja leksikaalsetesse iseärasustesse, võrreldaseda arhailise ja klassikalise aja keelekasutusega. Jälgida kreeka ja ladina narratiivi struktuuri ja selle komponente. Praktiseerida proosatekstide tõlkimist kreeka ja ladina keelest, arvestades iga autori stiili eripära.Learning outcomes/õpiväljund:  Kursuse lõpuks üliõpilane:  omab ülevaadet viiest terviklikult ning mõnedest fragmentaarselt säilinud kreeka romaanist, ladina romaanidest;  oskab analüüsida ja tuua välja erinevused romaaniautorite kompositsioonitehnikas ja stiilis;  analüüsib tekstis kasutatud stilistilisi võtteid ja retoorilisi väljendusvahendeid, näeb neid teost kujundavate elementidega ja seostab karakterite kujutamisega; omab ülevaadet põhimõtetest, mis kujundavad narratiivi, autori-lugeja vahelist suhtlemist narratiivi käigus, analüüsib, milliseid vormilisi ja sisulisi elemente kasutab autor tegevuse esitamiseks.  rakendab kreeka- ja ladinakeelsete teksti tõlkimise oskusi ning kursusel omandatud pädevusi loominguiselt tekstikatkendi tõlkimisel. Epidemioloogilisest seisukorrast lähtuvalt toimuvad loengud-praktikumid veebruaris-märtsis veebi vahendusel, edaspidi vastavalt olukorrale. Täpsem info jõuab teieni Moode'i teadete foorumi kaudu.\n4. aprillil seminari ei toimu, õppereis."}