{"KURSUSE_NIMI": "Taani foneetika ja fonoloogia", "KURSUSE_KOOD": "FLGR.06.029", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus koosneb paralleelselt nii teoreetilisest kui praktilisest osast. Teoreetilises osas tehakse sissejuhatus foneetika põhimõistetesse ning taani keele fonoloogilisse süsteemi, kirjeldatakse taani keele häälikusüsteemi ja intonatsiooni ning õpitakse kasutama häälduskirja (peamiselt Dania, kuid tehakse tutvust ka IPA-ga). Praktilises osas sooritatakse hääldusharjutusi, mis tõstavad õppija teadlikkust taani keele häälduse omandamise protsessist ja vajadusel korrigeerivad hääldust. Kursuse juurde kuulub taanikeelsete tekstide kuulamine ja foneetiline analüüsimine, hääldamisharjutuste iseseisev sooritamine ning analüüsiks lindistamine.Objectives/eesmärkid:  Kursuse eesmärgiks on korrigeerida praktiliste harjutuste ning teoreetiliste alusteadmiste abil taani keele hääldust ja intonatsiooni, õpetada kõne kirjapanekut (transkriptsiooni: peamiselt taani keele tarvis loodud Daniat, aga ka IPAd) nii paberil kui digitaalselt ning anda üldine teoreetiline sissejuhatus taani häälikuõpetusse. Eraldi tähelepanu pööratakse tüüpiliste intonatsiooni- ja artikulatsiooniprobleemide ületamisele.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - omab ülevaadet taani keele fonoloogilisest süsteemist; - nimetab taani keele häälikute moodustamise põhimõtteid ning rakendab omandatud teoreetilisi teadmisi praktikas; - tunneb taani keelele iseloomulikku kõneprosoodiat; - analüüsib lihtsamat foneetilist materjali, rakendab peamiseid transkriptsiooni põhimõtteid; - on teadlik enamlevinud intonatsiooni- ja artikulatsiooni-probleemidest taani keele omandamisel ning oskab neid vajadusel enda puhul märgata ja korrigeerida."}