{"KURSUSE_NIMI": "Skandinaavia maade ajalugu ja kultuur", "KURSUSE_KOOD": "FLGR.06.155", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Sissejuhatus. Kursuse eesmärk. Kursusega seotud kirjandus.\n2. (Viikingiaeg): Üldiseloomustus. Viikingite retked. Ristiusustamine. Taani, Norra ja Rootsi kuningriikide teke.\n3. (Kõrgkeskaeg): Ühiskondlikud arengujooned. Kirik ja kuningavõim. Sisesõjad. Keskaegse ühiskonna seadused ja tavad.\n4. (Hiliskeskaeg): Must surm. Agraarkriis. Kalmari uniooni tõus ja langus. Kontrolltöö.\n5. (Varauusaeg): Reformatsioon Skandinaavia maades. Sõjad 16-18. sajandil. Rootsi suurriigi ajastu.\n6. (Varauusaeg): Taani-Norra ja Rootsi kuningriigid valgustusajastul. Usuküsimused varauusaegses ühiskonnas. Absolutism. Kontrolltöö.\n7. (19. sajand): Sõjad 19. sajandi alguses. Rootsi-Soome ja Taani-Norra suhted. 1809. ja 1814. aasta tähendus Skandinaavia ajaloos.\n8. (19. sajand): Skandinaavia maad 19. sajandil. Poliitilised parteid, areng demokraatia suunas, industrialiseerumine ja moderniseerumine. Rahvusromantism Põhjamaades.\n9. (20. sajand): Skandinaavia maad sajandivahetusel. Sisepoliitilised ja sotsiaalsed olud. Moderniseerumine ja rahvuslik identiteet.\n10. (20. sajand): Skandinaavia maad Esimese maailmasõja ajal ja sõdadevahelisel ajal.\n11. (20. sajand): Skandinaavia maad Teise maailmasõja ajal. Kontrolltöö.\n12. (20. sajand): Poliitilised ja sotsiaalsed arengud pärast Teist maailmasõda. Heaoluideoloogia ja sotsiaaldemokraatia. \"Põhjamaine mudel\".Objectives/eesmärkid:  Ülevaatekursus tutvustab Norra, Rootsi ja Taani ajalugu ja kultuurilugu vanimast ajast kuni 20. sajandi teise pooleni, keskendudes nimetatud maade omavaheliste sidemete kui ka iga maa tähtsamate sündmuste ja arengute kirjeldamisele. Tähelepanu all on peamised ühiskondlikud, poliitilised ja kultuurilised protsessid. Kolme Skandinaavia maa ajalugu vaadeldakse koos ning keskendutakse nende ühisjoontele, kuid samas tuuakse välja ka olulisi erinevusi ja eripärasid. Ühtlasi selgitatakse Skandinaavia maade positsiooni ja rolli Euroopa ajaloo vaatenurgast (sh Läänemere regiooni kontekstis).Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - tunneb Norra, Rootsi ja Taani ajaloo ja kultuuriajaloo põhilisi arengujooni käsitletaval perioodil; - refereerib ja kommenteerib kriitiliselt kursuse kohustuslikku kirjandust ning lähtuvalt sellest peamisi probleeme, mis on seotud vastavate perioodide ajaloo uurimisega; - tutvustab grupitöö vormis läbitöötatud materjale, võrdleb neid üksteisega ning toob välja ühisosi ja erinevusi; - oskab näha ning tõlgendada seoseid ja erinevusi erinevate Skandinaavia maade kultuuritraditsioonide vahel ning nende olulisust tänapäevase ühiskonna ja mentaliteedi seisukohast; - võrdleb ja analüüsib seoseid ja erinevusi kolme Skandinaavia maa ajaloos. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}