{"KURSUSE_NIMI": "Süvendatud Põhjamaade kirjandus (epohhid, žanrid, autorid)", "KURSUSE_KOOD": "FLGR.06.126", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 60, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus tutvustatakse Põhjamaade kirjanduse valitud epohhe, žanre ja autoreid. Peatähelepanu all 19. ja 20. sajand ning eeskätt keskendutakse taani, norra ja rootsi kirjandusele, ent  paralleele tuuakse ka islandi, fääri ja soomerootsi kirjandusega. Kursus koosneb ülevaateloengutest ja temaatilistest blokkidest, mis seostuvad konkreetse epohhi, žanri, kirjandusliku motiivi või autoriga. Teemad võivad aastate lõikes varieeruda, vastavalt õppejõudude ning üliõpilaste huvidele. Seminarides analüüsitakse vastava temaatikaga seonduvaid tekste.Objectives/eesmärkid:  Kursuse eesmärgiks on anda üliõpilastele võimalus süvendada teadmisi Põhjamaade kirjandustraditsiooni valitud epohhidest, žanritest ja autoritest (rõhuasetusega 19. ja 20. sajandil). Arendatakse oskust tõlgendada kirjanduslooliselt olulisi tekste võrdlevas perspektiivis ning antakse ülevaade viimase aja tuntumatest kirjanduslikest uurimisprojektidest Põhjamaades.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\r omab süvendatud teadmisi Põhjamaade kirjandustraditsiooni arengujoontest 19. ja 20. sajandil;\r oskab lähemalt iseloomustada Põhjamaade kirjanduse valitud žanre; \r oskab teostada komparatiivset analüüsi erinevate autorite teoste alusel;\r omab ülevaadet Põhjamaade kirjandusloo aktuaalsetest uurimisteemadest. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\n\nNorra keele ja kirjanduse õpetamine Taru Ülikoolis on rahastatud EMP/Norra Kõrghariduse koostööprogrammi poolt."}