{"KURSUSE_NIMI": "Inglise keele didaktika I", "KURSUSE_KOOD": "FLGR.01.362", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab inglise keele õpetaja kutse taotlejatele teadmisi keeleõpetuse põhiprintsiipidest ja oskusi keeletundide kavandamiseks, läbiviimiseks ning õpilaste töö tagasisidestamiseks. Lisaks tutvutakse võtetega, mida saab kasutada töös akadeemiliste didaktika-alaste tekstidega ning arutletakse õpioskuste ja õpistrateegiate rakendamise üle. Objectives/eesmärkid:  1. Viia üliõpilased kurssi kaasaegsete suundumustega keeleõppes. 2. Anda üliõpilastele võimalusi arutleda tehnikate ja õpetamisvõtete üle, leida ja koostada keeleõpet ja õppijaid toetavaid materjale, planeerida tegevusi, tegevuste jadasid, tunde ja õppetsükleid 3. Varustada üliõpilased praktika sooritamiseks vajalike õppematerjalide, tehnikate ja tegevustega keeletunni erinevate osade läbiviimiseks. 4. Anda üliõpilastele teadmised ja oskused professionaalse arengu jätkamiseks. 5. Arendada õppijate üldoskusi nagu informatsiooni töötlemine, kriitiline mõtlemine, suhtlus- ja koostööoskus ning digioskused.  6. Arendada õpipäeviku, arutelude ja õpetaja portfoolio abil selliseid õpioskusi nagu oma õppimise eesmärgistamine ja kavandamine, ajaplaneerimine, õpistrateegiate kasutamine ja eneserefleksioon.Learning outcomes/õpiväljund:  Kursuse esimese osa lõppedes üliõpilased 1. määratlevad keeleõppe positsiooni õppekavas, kirjeldades, mis iseloomustab erinevaid õppijaid, loetledes ja sõnastades õpetaja rolle keeletunnis; 2. kirjeldavad erinevaid klassi haldamise probleeme, pakuvad neile lahendusi ja põhjendavad võimalike lahenduste eeliseid ja kitsaskohti; 3. nimetavad erinevaid tegevusi (sh IKT vahenditel põhinevaid) ja strateegiaid, mille abil saab toetada õppijate suulise ja kirjaliku teksti vastuvõtu, tekstiloome, suhtluse ning vahendamise toimingute arengut; 4. kasutavad erinevaid suulise ja kirjaliku töö vigade parandamise võtteid ja vigadega tegelemise tehnikaid; 5. analüüsivad inglise keele tunde kokkulepitud kriteeriumite põhjal; 6. kriitiliselt loevad didaktika-alast akadeemilist kirjandust, tuues välja autori põhiseisukohad ning avaldades ja põhjendades oma arvamust käsitletaval teemal; 7. eesmärgistavad ja kavandavad oma edasist professionaalset arengut, analüüsides oma tugevamaid ja nõrgemaid külgi digitaalses õpetaja portfoolios. "}