{"KURSUSE_NIMI": "Taani keele väljendusõpetus", "KURSUSE_KOOD": "FLGR.06.038", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on mõeldud teise aasta tudengitele, kes õpivad Skandinaavia keelte ja kultuuride erialal. Kursusel osalemise eeltingimusteks on taani keele teadmised Euroopa Nõukogu keeleoskustasemel B1. Kursus tegeleb taani keele suulise ja kirjaliku väljendusoskuse arendamisega ametlikes ja mitteametlikes suhtluskontekstides. Suuline väljendusõpetus koosneb harjutustest, mis ulatuvad lihtsamatest vestlustest keerukamate kommunikatsiooni-situatsioonideni (reklaamvideo, ettekanded, debatid, arutelud jms). Lisaks üldise väljenduslaadi arendamisele aitavad suulised harjutused kaasa kommunikatiivsete oskuste süvendamisele taani keeles ning treenivad korrektset hääldust. Teoreetilise poole pealt antakse ülevaade praktilise retoorika olulisematest põhimõtetest ning treenitakse üliõpilaste esinemisjulgust ja argumenteerimisoskust. Kirjalik väljendusõpetus keskendub iseseisvate kirjalike tööde kirjutamisele, mis seostuvad erinevate etteantud tekstide ja ülesannetega. Õpitakse koostama mitmesuguseid standardseid tekste, mida võib vaja minna ametlikus asjaajamises. Täiendavalt süvendatakse akadeemilise kirjutamise oskust erialastel teemadel (referaadid, esseed jms) ning antakse põhiteadmisi mitmesuguste tekstianride keeleliste ja stilistilise nõudmiste kohta.Objectives/eesmärkid:  Kursuse eesmärgiks on arendada edasi üliõpilaste väljendusoskust taani keeles nii kõnes kui ka kirjas erinevates suhtluskontekstides. Suuline väljendusõpetus loob võimaluse harjutada erinevaid suulisi etteasteid ning praktilist taani keeles kõnelemist, kuna kõiki etteasteid analüüsitakse nii keelelt kui ka stiililt. Ühtlasi harjutatakse taani keelest arusaamist ning antakse sissejuhatus praktilise retoorika põhimõtetesse. Kirjalik väljendusõpetus pakub võimalust arendada üldist kirjutamisoskust ning erinevat tüüpi tekstide koostamisoskust (sh akadeemilised ja erialased tekstid). Samuti süvendatakse teadmisi taani keele grammatikast ja sõnastusnüanssidest, kuna kõiki kirjalikke töid parandatakse ja kommenteeritakse ka keeleliselt.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: -peab taanikeelseid vestlusi erinevatel teemadel ning tunneb ennast taani keeles esinedes kindlalt; - leiab, hindab ja analüüsib asjakohast infot kirjalike, suuliste ja multimeediatekstide koostamiseks; - esitleb ja analüüsib erinevaid teemasid suulise ettekande vormis nii individuaalselt kui rühmatööna; - vestleb ja debateerib argumenteeritult, rakendades põhilisi retoorikavõtteid; - omab ülevaadet erinevatest kirjalikest tekstitüüpidest (sh mitmesugused ametlikud ja erialased tekstid) taani keeles ning koostab neid; - kirjutab taani keeles akadeemilisel tasemel analüütilisi tekste ja teeb sealjuures korrektseid keelelisi ja stilistilisi valikuid."}