{"KURSUSE_NIMI": "Bakalaureusetöö või bakalaureuseeksam", "KURSUSE_KOOD": "FLGR.05.057", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Bakalaureuseseminar ja praktika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 146, "individual_work": 10, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Bakalaureusetöö on esimene iseseisev uurimus, milles lahendatakse üliõpilasele jõukohane teaduslik ülesanne keeleteaduslikul või kirjandus-/ kultuuriteaduslikul teemal ja mis lõpeb töö avaliku kaitsmisega. Esmalt valib üliõpilane teda huvitava uurimisprobleemi, siis valib juhendaja toel konkreetse teadusülesande ning selle lahendamise meetodid, arendab välja töö struktuuri. Peatükkide kavandit arutatakse samuti juhendajaga, kes suunab üliõpilase tööd.  \nBakalaureuseeksam on kokkuvõte kolme aasta vältel omandatud materjalist vene keele, vene kirjanduse ja slaavi filoloogia alal. Üliõpilane valmistub eksamiks lähtudes  juhendis ära toodud küsimuste nimekirjast, mis on toodud ÕISis.Objectives/eesmärkid:  Bakalaureusetöö kirjutamine annab üliõpilastele võimaluse: -\tvalida enda jaoks huvitava ja meelepärase uurimisproblemaatika kas keele- või kirjandusteaduse alal; - arendada oskust iseseisvalt sõnastada aktuaalset uurimisküsimust, koguda informatsiooni ning seda tõlgendada, täiendada praktilisi oskusi teadusteksti loomisel; - süvendada teadmisi valitud uurimisvaldkonnas esinevatest analüüsivõimalustest ja põhilistest meetoditest; Bakalaureuse eksamiks ette valmistades kordab üliõpilane süvendatult kolme aasta vältel omandatud erialaseid teadmisi, täiendab oma eneseväljendamise võimeid ja oskusi.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Bakalaureusetööd edukalt kaitsnud üliõpilane:\n- teab peamisi praktilisi võtteid ning teoreetilisi põhimõtteid koostamaks akadeemilist uurimistööd;\n- suudab orienteeruda teadusteksti koostamise metoodilistes põhimõtetes;\n- suudab iseseisvalt püstitada uurimisküsimuse, teostada analüüsi ning tõlgendada tulemusi;\n- oskab hankida uurimistööks vajamineva informatsiooni kohaseid meetodeid ja vahendeid kasutades.\nBakalaureuseeksami edukalt sooritanud üliõpilane:\n-\ton värskendanud kolme aasta vältel omandatud erialaseid teadmisi;\n-\toskab kokkuvõtlikult ja veenvalt vastata talle esitatud küsimustele;\n-\ttunneb erialast terminoloogiat ja teaduskeelt. Praktiline info üliõpilasele leidub slavistika osakonna lehel https://maailmakeeled.ut.ee/et/slavistika/oppimine \nLõputööde kirjutamise-kaitsmise nõuded, lihtlitsentsi vormi lõputöö elektrooniliseks avaldamiseks ja BA eksami küsimused leitakse Moodle'is.\n\n"}