{"KURSUSE_NIMI": "Vanakreeka keele põhikursus I", "KURSUSE_KOOD": "FLGR.02.377", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 60, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel käsitletakse vanakreeka keele põhileksikat, vormiõpetust ja süntaksi, tehakse tõlkeharjutusi ja praktilisi töid, loetakse põhilisemate vanakreeka autorite tekstikatkendeid.Objectives/eesmärkid:  Anda ülevaade kreeka keele grammatilisest struktuurist, omandada põhisõnavara, tutvustada tähtsamaid antiikautorite tekste.Learning outcomes/õpiväljund:  Üliõpilased  1) on saanud ülevaate vanakreeka keele grammatilisest struktuurist; 2) on omandanud algteadmised morfoloogiast ja süntaksist ning põhisõnavara; 3) analüüsivad sõnu morfoloogilisest aspektist, lihtlauseid süntaktilisest aspektist; 4) tõlgivad algtasemel vanakreekakeelseid lauseid; 5) koostavad kõige lihtsamaid vanakreekakeelseid lauseid. Kontrolltöödeks valmistumise juhendid on Moodle'is vastava teema juures nähtavad vähemalt nädal enne tööd.\n\nHead tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}