{"KURSUSE_NIMI": "Tekstiloome ja konversatsioon norra keeles", "KURSUSE_KOOD": "FLGR.06.166", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on praktilise suunitlusega, mille käigus täiendatakse senist väljendusoskust. Kursuse raames koostatakse erinevaid tekste ning täiustatakse suulist keelekasutust erinevates suhtluskontekstides (näiteks: argumentatsioon, esitlus, referaat, essee, aruanne, uurimus, kokkuvõte jne). Kursuse raames õpitakse tundma protsessile orienteeritud töömeetodit ning harjutatakse nii enda kui teiste tekstide kriitilist analüüsi ja kommenteerimist.Objectives/eesmärkid:  Kursuse eesmärgiks on täiendada ja korrigeerida tudengite väljendusoskust norra keeles nii kõnes kui kirjas. Kursus on praktilise suunitlusega, koosnedes erinevatest kirjalikest ja suulistest harjutustest. Kirjaliku väljendusoskuse raames täiendavad tudengid oma oskusi erinevate akadeemiliste, teabe- kui ka meediatekstide koostamisel tekstianalüüsi ja praktiliste harjutuste kaudu. Suulise väljendusoskuse raames täiendatakse oma keelekasutust praktiliste harjutuste kaudu erinevates suhtluskontekstides. Kursus käsitleb ka raskemaid õigekirja- ja keelekasutusreegleid ning sellega seoses tutvustatakse olulisi käsiraamatuid ja sõnaraamatuid. Kursuse raames õpitakse tundma protsessile orienteeritud töömeetodit ning harjutatakse nii enda kui teiste tekstide kriitilist analüüsi ja kommenteerimist.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - kirjutab efektiivseid ja funktsionaalseid tekste korrektses norra keeles; - on saavutanud suurema kindluse ja ulatuslikumad oskused erinevate norrakeelsete tekstide koostamiseks; - kohandab oma teksti vastavalt olukorrale ja konkreetsele tekstile esitatavatele formaalsetele ja stilistilistele nõuetele; - väljendab end akadeemilises kontekstis nii kõnes kui kirjas; - rakendab süvendatud teadmisi norra keele õigekirja ja struktuuri kohta."}