{"KURSUSE_NIMI": "Antiigi pärand Euroopa kultuuritraditsioonis", "KURSUSE_KOOD": "FLGR.02.460", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine käsitleb Euroopa kultuuri aluseks oleva antiikaja pärandi avaldumist eri valdkondades. Käsitlusi seob kirjandusliku pärandi jälgimine. Keele ja kirjanduse arengu jälgimine keskendub antiikaja mõjutuste jõudmisele rahvuskultuuridesse (sh. Eesti kultuuri). Ainelisest kultuurist, olmest, harrastustest ja tavadest on valitud käsitlemiseks need küljed, mille suhtes antiik on tänapäevale enim mõju avaldanud (nt. teater, sport, teaduse areng, poliitiline kultuur)Objectives/eesmärkid:  Käsitleda Euroopa arengu põhilisi mõjutegureid, anda ülevaade põhilistest valdkondadest, viisidest, kuidas ja milles antiikaja kirjandus, kunst, aineline kultuur ning kreeka ja ladina keel on mõjutanud Euroopa kultuuri arengut erinevatel perioodidel. Luua interdistsiplinaarsed seosed klassikalise filoloogia ja kaasaja keelte ja kultuuride vahel Euroopas.Learning outcomes/õpiväljund:  Üliõpilane  1) on omandanud teadmised põhilistest kultuurivaldkondadest, mis kujunesid välja antiikajal ja mis kandusid ajaliselt edasi hilisematesse arenguperioodidesse; 2) loob seoseid antiikaja ja hilisemate ajaperioodide vahel, selgitab antiikaja mõjutusi eri perioodide kirjanduses, kunstis, kommetes, arhitektuuris, keeles; 3) eristab eri perioodide mõjutusi sissejuhatavate teadmiste tasemel, analüüsib ja selgitab filoloogilisi ja kultuuriloolisi seoseid romaani, germaani ja Põhjamaade kultuuriruumis. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}