{"KURSUSE_NIMI": "Norra keeleajalugu", "KURSUSE_KOOD": "FLGR.06.033", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus antakse ülevaade norra keele ajaloolisest arengust, keskendudes muinaspõhja, vanapõhja, vahenorra ja uusnorra arengustaadiumite ning olulisemate keeleliste muutuste kirjeldamisele. Selgitatakse suulise keele ja kirjakeele vahekorda erinevatel perioodidel. Erilist tähelepanu pööratakse 19. sajandi ja 20. sajandi keelesituatsioonile ning arengutele, mille tulemusena Norras on tänapäeval kasutusel kaks ametlikku kirjakeele teisendit. Moodsa norra keele kirjeldamisel antakse ülevaade olulisematest reformidest 20. ja 21. sajandil ning selgitatakse keelepoliitilisi põhimõtteid. Seminarimaterjalide hulka kuuluvad eri perioode illustreerivad tekstinäited, mida üheskoos analüüsitakse.Objectives/eesmärkid:  Kursuse eesmärgiks on anda põhiteadmised norra keele ajaloost, vaadeldes norra keele erinevaid arenguetappe nende ajaloolises muutumises ning iseloomustades keelesüsteemi kindlates arengujärkudes. Analüüsides eri perioodide tekstimaterjali, õpitakse tundma norra keele peamiseid tunnusjooni ning seoseid lähemate sugulaskeeltega. Kursus selgitab samuti suulise keele ja kirjakeele vahekorda, nende sotsiaalseid ja kultuurilisi arengutingimusi ning loob sel moel eelduse Norra tänapäevase keeleolukorra mõistmiseks.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - nimetab norra keele erinevaid arenguetappe; - seostab ajalooliseses perspektiivis norra keelt selle sugulaskeeltega; - analüüsib lihtsamaid keeleajaloolisi tekste ning iseloomustab nende põhjal keele konkreetseid arengustaadiume; - saab aru Norra tänapäevase keelesituatsiooni ajaloolisest tagapõhjast; - selgitab keele ja ühiskonna sotsiokultuurilisi seoseid."}