{"KURSUSE_NIMI": "Bakalaureuseseminar ja bakalaureusetöö (Skandinaavia keeled ja kultuurid)", "KURSUSE_KOOD": "FLGR.06.122", "EAP": 2, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 22, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Bakalaureuseseminar aitab kaasa bakalaureusetöö valmimisele. Teematika on seotud bakalaureusetöö kirjutamise teoreetiliste ja metoodiliste alustega; lisaks antakse mitmesuguseid praktilisi näpunäited kirjutamisprotsessi edendamiseks ning töö edukaks kaitsmiseks. Olulise osa seminarist moodustab tagasiside andmine üliõpilaste poolt esitatud peatükkidele bakalaureusetööst ning bakalaureusetööde eelkaitsmine.Objectives/eesmärkid:  Bakalaureuseseminar annab üliõpilastele võimaluse: - õppida tundma keele, kirjanduse ja kultuuri uurimise põhilisi meetodeid; - süvendada teadmisi valitud uurimisvaldkonnas esinevatest analüüsivõimalustest; - arendada oskust iseseisvalt sõnastada aktuaalset uurimisküsimust, koguda informatsiooni ning seda tõlgendada; - täiendada praktilisi oskusi teadusteksti loomisel ning omandada ülevaade bakalaureusetöödele esitatavate nõuete kohta.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n- valdab peamiseid praktilisi võtteid ning teoreetilisi põhimõtteid akadeemilise uurimistöö koostamiseks;\n- mõistab eesti ja Skandinaavia akadeemilise keele kultuurierisusi ning arvestab nendega oma uurimistöös;\n- orienteerub teadusteksti koostamise metoodilistes põhimõtetes;\n- püstitab iseseisvalt uurimisküsimuse, teostab analüüsi ning tõlgendab tulemusi;\n- hangib uurimistööks vajaminevat informatsiooni kohaseid meetodeid ja vahendeid rakendades ning hindab leitud informatsiooni kriitiliselt;\n- rakendab relevantseid digitaalseid ressursse info leidmiseks ning uurimistöö vormistamiseks;\n- annab autorile suulist ja kirjalikku tagasisidet akadeemilise teksti kohta;\n- valdab erialast akadeemilist Skandinaavia keelt."}