{"KURSUSE_NIMI": "Runoloogia", "KURSUSE_KOOD": "FLGR.06.107", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Valikkursuse raames antakse algteadmised runoloogia uurimisobjektist, põhimõistetest, uurimisviisidest ning -vahenditest. Kursus käsitleb ruunide tekke ja ajaloolise arenguga seotud küsimusi ning tutvustab valimikku erinevatest perioodidest pärinevaid ruunikirju. Peatähelepanu all on Skandinaavia ruunitraditsioon viikingiajal ja keskajal, aga paralleele tuuakse ka teiste piirkondadega. Kursus selgitab, kuidas analüüsida ruunikirju kui kirjalikke allikaid erinevate uurimisvaldkondade vaatenurgast. Ruunikirjade analüüsi käigus tuuakse esile nende tõlgendamisel esinevaid sagedasemaid probleeme. Kursus tutvustab samuti Skandinaavia varajase kirjakultuuri olemust ja peamisi tunnusjooni.Objectives/eesmärkid:  Kursuse eesmärkideks on: - tutvustada runoloogia (ruuniteaduse) põhimõisteid ja olulisemaid uurimisvõtteid ning -vahendeid - anda ülevaade ruunide kui kirjasüsteemi arengust ja kasutusvaldkondadest Skandinaaviamaades rõhuasetusega viikingi- ja keskaja traditsioonidele - tutvustada erinevaid Skandinaaviast leitud ruunikirju keeleajaloolisest ja kultuuriloolisest vaatenurgast ja arendada oskust rakendada varaste kirjalike allikate analüüsis erinevate uurimisvaldkondade teadmisi - selgitada suulise kultuuri ja varajase kirjakultuuri olemust ja seoseid.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - omab põhiteadmisi runoloogia põhimõistetest, metoodikast ja uurimisvahenditest - omab ülevaadet ruunikirja arengust ja oskab ära tunda erinevate perioodide kirjavariante - tunneb lähemalt mõningaid Skandinaaviast leitud viikingi- ja keskaegseid ruunikirju ja mõistab nende keeleajaloolist, kultuurilist ja ajaloolist tähendust - omab ülevaadet Skandinaaaviamaade varajase kirjakultuuri põhijoontest ja iseärasustest."}