{"KURSUSE_NIMI": "Iirimaa ajalugu filmis", "KURSUSE_KOOD": "FLGR.01.054", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 33, "colloquium": 0, "web_learning": 0, "independent_work": 45, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate Iirimaa ajaloost alates kiviajast kuni 21. sajandi alguseni, kasutades kirjalikke allikaid ning dokumentaal- ja mängufilme. Käsitletakse selliseid traumaatilisi ajaloosündmusi nagu anglo-normannide vallutused, üheteist-aastane sõda (1641-1653), Kuningas Williami sõda (1688-1691), 1798. aasta ülestõus, suur näljahäda, lihavõtteülestõus, iseseisvussõda, kodusõda ja Põhja-Iirimaa rahutused ning nende mõju iiri identiteedi kujunemisele. Vaadatakse neid Iiri ajaloosündmusi käsitlevaid filme ja arutletakse selle üle, mis on ajalooline tõde ja kuidas filmi loomise kontekst mõjutab ajaloosündmuste kajastamist filmis.Objectives/eesmärkid:  Kursuse eesmärgiks on anda üliõpilastele filmide ja kirjalike tekstide kaudu põhiteadmised Iirimaa ajaloolisest ja kultuurilisest arengust, et aidata neil mõista tänapäeva iiri identiteedi kujunemislugu  Üliõpilased omandavad oskuse vaadata ajaloolisi filme kriitliselt ja hinnata nendes kajastatuse vastavust ajalootõele.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilased - on omandanud põhiteadmised Iirimaa poliitilisest ja kultuurilisest arenguloost, - on arendanud koostöö- ja akadeemilise kirjutamise oskusi, - seletavad Iiri ajaloos esinenud ühiskondlike, poliitilisite ja usuliste konfliktide põhjuseid ja tagajärgi, - analüüsivad kriitiliselt ja hindavad Iiri ajaloo sündmuste filmis kajastamise täpsust ja tõesust, - analüüsivad filmi kui ajaloolist dokumenti, mis heidab valgust selle loomise aja kultuurilisele, ühiskondlikule ja poliitilisele kontekstile, - hindavad filmide rolli ja mõju ajaloo mõtestamisel. NB! Nende seminaride pikkus, milles me vaatame filme, on 3 akadeemilist tundi (kell 16.15-18.30). Teiste seminaride pikkus on 2 akadeemilist tundi (kell 16.15-17.45). Kokku on semestris 13 seminari.\nWhen we watch a feature film, the seminar lasts three academic hours (from 4.15 p.m. until 6.30 p.m.). The other seminars last for two academic hours (from 4.15 p.m. until 5.45 p.m.). There are 13 seminar meetings altogether."}