{"KURSUSE_NIMI": "Saksa kirjanduse proseminar", "KURSUSE_KOOD": "FLGR.04.061", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Saksa kirjanduse proseminari kursus hõlmab saksakeelse kirjanduse tekste kuni19.sajandi lõpuni. Käsitletakse selliseid autoreid nagu  Gryphius, Lessing, Lenz, Goethe, Schiller, Kleist, Hölderlin, Mörike, Tieck, Büchner, Heine, Fontane ja Hauptmann. Põhirõhk on lugemistehnikatel ja hermeneutikal ning valitud kirjandusteoste analüüsil ja arutelul, kuid puudutatakse ka erinevaid kirjandusteooriaid ja metodoloogikat.Objectives/eesmärkid:  Üliõpilasele antakse võimalus:\n- omandada süvendatud teadmised saksakeelse kirjanduse perioodidest keskajast kuni 19.sajandi lõpuni;\n- omandada oskus analüüsida erinevatesse ajaloolistesse epohhidesse kuuluvaid kirjanduslikke tekste (barokk, valgustusajastu, Sturm und Drang, klassitsism, Biedermeier, realism);\n- õppida tundma tähtsamaid saksa kirjandusteaduse seisukohti nende ajaloolises kujunemises.\n- õppida tundma tähtsamaid saksa kirjanikke ja nende loomingut keskajast kuni 19.sajandi alguseni;Learning outcomes/õpiväljund:  Õppeaine edukalt läbinud üliõpilane :\n- tunneb suurt hulka saksa kirjanduse tähtsamatest autoritest ja omab süvateadmisi saksa kirjanduse kujunemist mõjustanud ühiskondlik-poliitilistest protsessidest enne 19.sajandi lõppu;\n- teab ja oskab võrrelda saksa kirjanduse ajaloo tähtsamaid etappe ja kirjanduslikke voole;\n- tunneb ära ja oskab analüüsida eri ajastuisse kuuluvaid kirjanduslikke tekste;\n- tunneb eri ajastute konteksti kuuluvaid tähtsamaid kirjandusteaduslikke seisukohti;\n- on arendanud digitaalseid oskusi, näiteks otsingu-mootorite ja andmepankade kasutamist, olles samal ajal teadlik nende struktuurist ja töörežiimist, et nad saaksid allikaid ja nende usaldusväärsust kriitiliselt hinnata."}