{"KURSUSE_NIMI": "Ameerika kirjanduse autoriseminar", "KURSUSE_KOOD": "FLGR.01.195", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 24, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus süüvib aastate lõikes vahelduvate 20. sajandi ameerika autorite või kirjandusrühmituste loomingule. Autorite loomingut vaadeldakse ajastu kultuuriliste pingeväljade kontekstis  (modernsus, I maailmasõda, suur majanduslangus, II maailmasõja järgne konformism, globaliseerumine jne, sõltuvalt konkreetsel semestril käsitletevate autorite ringist) ja seoses rahvusvahelise kirjanduskontekstiga. Kursuse käigus loetakse originaaltekste ning kirjandusteoreetilisi tekste ning harjutatakse teoreetiliste mõistete rakendamist kirjanduse analüüsis. Arendatakse erinevaid kriitilise lugemise viise ning ingliskeelse akadeemilise kirjutamise oskust.Objectives/eesmärkid:  Kursuse eesmärgiks on süüvida aastate lõikes vahelduvate 20. sajandi ameerika autorite või kirjandusrühmituste loomingule. Autorite loomingut vaadeldakse ajastu kultuuriliste pingeväljade kontekstis  (modernsus, I maailmasõda, suur majanduslangus, II maailmasõja järgne konformism, globaliseerumine jne, sõltuvalt konkreetsel semestril käsitletevate autorite ringist) ja seoses rahvusvahelise kirjanduskontekstiga. Kursuse käigus loetakse originaaltekste ning tõlgendatakste neid erinevate kirjandus- ja kultuuriteoorate valguses. Arendatakse erinevaid kriitilise lugemise viise ning ingliskeelse akadeemilise kirjutamise oskust.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased tunnevad kursuse jooksul käsitletud 20. sajandi ameerika kirjanduse autoreid ja nende tekstides väljenduvaid keskseid kultuurilisi pingevälju (modernsus, I maailmasõda, suur majanduslangus, II maailmasõja järgne konformism, globaliseerumine, jne., sõltuvalt konkreetsel semestril käsitletavatest autoritest). Üliõpilased oskavad rakendada erinevaid kirjanduse analüüsi meetodeid (sh lähilugemine ja kirjandusteoreetilisi võtteid. Nad arendavad suulise ja kirjaliku inglise keele, kriitilise lugemise,diskuteerimise ning akadeemilise kirjutamise oskust."}