{"KURSUSE_NIMI": "Norra kirjanduse ajalugu", "KURSUSE_KOOD": "FLGR.06.039", "EAP": 4.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 45, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Norra kirjanduse ajaloo esimene osa hõlmab tekste ning autoreid alates keskaja kirjandusest kuni 19. sajandi keskpaiga romantismini. Läbitavad teemad: keskaja kirjandus, barokkaja kirjandus, klassitsismi ja valgustusaja kirjandus, rahvaluule, muinasjutud ja ballaadid, Norra kirjanikud nn Taani perioodil, rahvuslik ärkamisaeg ja romantism.\n\nNorra kirjanduse ajaloo teine osa hõlmab tekste ning autoreid alates 19. sajandi lõpu realismist kuni tänapäevani. Läbitavad teemad: realism, sotsiaalne realism, modernistlikud arengud (luules), sõdadevahelise perioodi kirjandus, sõjajärgne kirjandus, uuem luule, draama ja proosa.Objectives/eesmärkid:  Kursuse eesmärgiks on kujundada terviklik kirjandus-ja kultuurilooline teadmiste süsteem ning ajatelg norra keskaja kirjandusest kuni tänapäevani, selgitades peamiseid suundi, epohhe ja olulisemaid autoreid. Kursus loob võimaluse õppida tundma norra kirjanduse tähtteoseid, mis omakorda aitavad kaasa Norra ühiskonna ja kultuuriloo mõistmisele eri perioodidel. Põhirõhk asetub erinevate tekstide lugemisele ning analüüsimisele, millele lisanduvad ülevaatlikud loengud-arutelud vastavate ajastute kohta.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - nimetab ja võrdleb norra kirjanduse põhilisi suunitlusi ja arengujooni keskajast kuni 20. sajandi teise pooleni; - nimetab norra kirjanduse tähtsamaaid autoreid ja teoseid eri ajastutel; - analüüsib ja võrdleb eri liiki tekste; - on läbi lugenud vähemalt kaks teost norra kirjandusest ning tutvustab neid teistele; - seostab kirjanduslikke tekste vastava ajastu ühiskondliku taustaga (ajalooga); - seostab norra kirjanduse tähendust avarama maailmakirjandusliku kontekstiga."}