{"KURSUSE_NIMI": "Hispaania ajalugu ja kultuur", "KURSUSE_KOOD": "FLGR.03.282", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate Pürenee poolsaare ja Hispaania ajaloo peamistest sündmustest eelajaloost tänapäevani. Üliõpilastele antakse lühiülesandeid, mille põhjal nad koostavad e-õpimapi, mida õppejõud hindab.Objectives/eesmärkid:  Kursuse käigus õpivad üliõpilased Pürenee poolsaare ja Hispaania ajaloo põhisündmusi ning Hispaania olulisemaid kultuurilisi aspekte, pöörates erilist tähelepanu internetis leiduvatele allikatele ning meetoditele, kuidas teavet iseseisvalt ja kriitiliselt analüüsida. Õpilased koostavad lühikeste uurimisülesannete põhjal hindamiseks esitatava e-õpimapi.Learning outcomes/õpiväljund:  Ainekursuse läbinud üliõpilane: 1. tunneb Hispaania ajaloo põhisündmusi 2. oskab leida peamisi internetist kättesaadavaid ajalooallikaid Hispaania ajaloo kohta 3. oskab info- ja kommunikatsioonitehnoloogia abil otsida ja valida teavet ning seda töödelda, hallata tõhusalt dokumentaalseid allikaid 4. on arendanud oskust mõista hispaania keeles akadeemilisi materjale, ajaloolisi tekste, teadusartikleid ja audiovisuaalseid materjale 5. analüüsib tekstides, piltides ja sõnavõttudes sisalduvat teavet ning oskab neid iseseisvalt ja kriitiliselt hinnata 6. oskab antud teabe põhjal luua selgeid ja arusaadavaid hispaaniakeelseid tekste 7. on õppinud kasutama digioskusi akadeemilises valdkonnas nii uurimis- kui ka meeskonnatöös, esitluste tegemiseks, graafika loomiseks, andmete kogumiseks, bibliograafiliste viidete haldamiseks, videote või heli salvestamiseks jm toiminguteks 8. on õppinud looma e-õpimappi, milles kajastuvad uurimisülesannete tulemused No se espera de los alumnos un control absoluto de la lengua española, de hecho su nivel de lengua no será evaluado. Sí se espera que demuestren esfuerzo, interés y capacidad crítica. Se tendrán en cuenta las capacidades de cada alumno y su calificación se llevará a cabo en base a su progreso y no en comparación con la actuación de otros estudiantes.\n\nEste curso es para estudiantes extranjeros que están estudiando la lengua española, por eso no se aceptan estudiantes de interambio cuya lengua materna sea el español.\n\nDebido a la situación excepcional por la COVID-19 los alumnos deben estar dispuestos a estudiar en línea si es necesario."}