{"KURSUSE_NIMI": "Saksa keel algajatele II (süvaõpe), tase A1 > A2", "KURSUSE_KOOD": "FLKE.02.278", "EAP": 12, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Saksa keel algajatele I (süvaõpe), tase 0 > A1"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 128, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 184, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Jätkukursus FLKE.02.277le\nTutvumine igapäevaelu käsitlevate teemadega (sõnavara, tekstide lugemine ja kuulamine, grammatikaharjutused).Objectives/eesmärkid:  Üliõpilasele antakse võimalus omandada baasteadmised saksa keelest nii kõnes kui kirjas.Learning outcomes/õpiväljund:  Õppeaine edukalt läbinud üliõpilane: 1. oskab korrektselt hääldada tuttavaid sõnu ja fraase 2. mõistab kuulamis- ja lugemistekste tuttavatel teemadel ning on võimeline edasi andma loetu ja kuuldu sisu 3. arendab vestlust tuttavatel teemadel 4. koostab A2 tasemel kirjalikke ja suulisi tekste ja kasutab A2 taseme grammatikat  5. kasutab erinevaid digikeskkondi koostööks ja iseseisvaks keeleõppeks Võlgnevused peavad olema likvideeritud enne kirjalikku ja suulist eksamit. Võlgnevuste likvideerimine kokkuleppel õppejõududega.\n\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale! \nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses. \nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\n \nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}