{"KURSUSE_NIMI": "Sissevaateid eesti kultuuri. Filmi- ja muuseumikursus, inglise keele baasil", "KURSUSE_KOOD": "FLKE.03.121", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse jooksul külastatakse Tartus asuvaid muuseume ja vaadatakse nii dokumentaal- kui ka mängufilme.Objectives/eesmärkid:  Kursuse eesmärk on anda välisüliõpilastele algteadmisi Eestist ja Tartust ning Eesti kultuurist ja ühiskonnast.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine lõpuks omandab üliõpilane Eesti filme vaadates ja Tartu muuseume külastades esialgsed teadmised Eestist ja Tartust ning Eesti kultuurist - üliõpilane tunneb Tartu peamisi muuseume ja teab valitud eestikeelseid filme. - The course is for foreign/visiting students only.\n\n- The courses HVLC.09.052 and FLKE.03.121 are parallel; taking these courses simultaneously is impossible. Please choose and register for one, either HVLC.09.052 or FLKE.03.121.\n\n- Classes start on the first week of the semester, NB! at 12.00 (not 12.15!).\n\n- No phones, tablets, laptops, and eating during the films, please! Coffee, tea and other drinks are very welcome.\n\n- The fee for the course is 25 euros and should be paid by the second week/class. This price includes the ticket (either a student ticket or a group ticket, whichever is the cheapest option) and guided excursion in English. If any money is left at the end of the course, it is equally divided by all students (not only the ones that missed some/certain visits). \n\n- The museum visits take place only when at least 18 students are in the course. Otherwise, museums will be replaced with movies. \nMuseums (may change):\n1. Estonian National Museum / Eesti Rahva Muuseum - Muuseumi tee 2, Tartu\n2. The University of Tartu Museum / Tartu Ülikooli Muuseum - Lossi 25, Tartu\n3. KGB Cells Museum / KGB kongide museum - Riia 15b, Tartu OR Eesti Spordi- ja Olümpiamuuseum / Estonian Sports and Olympic Museum - Rüütli 15\nVisit more: https://visittartu.com/museums/\n\n**\n!  Please pay attention to the registration cancellation deadline in the course outline!\n\n!  If you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counselling centre: https://ut.ee/en/content/psychological-counselling \nRequiring special conditions at the end of the semester is not acceptable."}