{"KURSUSE_NIMI": "Ladina keel loodusteadlastele: grammatika- ja terminoloogiakursus", "KURSUSE_KOOD": "FLKE.05.010", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "A. Ladina keele algteadmised: käsitletakse ladina keele morfoloogilist struktuuri ja grammatilisi kategooriaid, õpitakse pöördsõnu ja käändsõnu, adjektiivide kompareerimist, partitsiipe etc. (e.g. suur, suurem, suurim- magnus, a, um; major, majus; maximus, a, um; adjektiiv pratensis, pratense aas-, aasa-, Trifolium pratense &acute;aasristik&acute;). \nB. Loodusteadusliku põhisõnavara omandamine (nimedes sagedamini esinevad sõnad, lühendid, lihtsamate tekstide ja liigikirjelduste lugemine). Ladinakeelsete teaduslike nimetuste moodustamise viisid, allikad ja põhimõtted. \nC. Kursus aitab tudengil aru saada ladina keele tähtsusest Euroopa kultuuris ja ladina keele mõjust rahvusvahelises kultuuri ja teaduse sõnavaras ning terminoloogias. \nD. Kursus sisaldab loenguid, suulisi ja kirjalikke harjutusi ja teste.Objectives/eesmärkid:  Aine eesmärgiks on anda algteadmised ladina keelest, ülevaade ladinakeelse terminoloogia keelelistest  printsiipidest ja liiginimede elementaarsemantikast. Pööratakse tähelepanu nimede olemusele ja õigekeelsusele, õpitakse ladina keele häälduspõhimõtteid ja grammatikat.Learning outcomes/õpiväljund:  Üliõpilane - oskab ladinakeelseid sõnu õigesti hääldada; - eristab ladina keele viit deklinatsiooni ja nende tüüpilisemat sõnavara loodusteadustes;  - oskab käänata ja ära tunda kreeka laensõnu ja ladina keele nimi- ja omadussõnu nominatiivis, genitiivis, akusatiivis, daativis ja ablatiivis nii ainsuses kui mitmuses; - eristab omadussõnade puhul 1. ja 2. ning 3. deklinatsiooni omadussõnu ning nende võrdlusastmeid;  - oskab moodustada ladina keele adverbe;  - tunneb ladina keele eessõnu, eesliiteid, järelliiteid ja nende kasutamise põhimõtteid; - oskab kasutada korrektseid ladina keele käändelõppe terminites, nimedes, epiteetides ja kirjeldustes;  - tunneb ära järgmised ladina verbi kategooriad: isik, arv, tegumood, aeg ja käändelised vormid nagu infinitiiv, partitsiibid, gerundium ja gerundiiv;  - tõlgib sõnaraamatu abiga lühikesi ja kergeid ladinakeelseid tekste;  - oskab ladina keeles lihtsamaid väljendeid kirjutada; - oskab kasutada ladina keele sõnaraamatuid;  - mõistab ja oskab kasutada täpset ladinakeelset erialaterminoloogiat."}