{"KURSUSE_NIMI": "Hispaania keel algtasemel (süvaõpe) I, tase 0 > A1", "KURSUSE_KOOD": "FLKE.05.063", "EAP": 12, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 120, "seminar": 0, "independent_work": 192, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus õpitakse hispaania keeles lugema ning suuliselt ja kirjalikult algtasemel väljenduma. Üliõpilased omandavad oskuse rääkida endast ja oma perest, töökeskkonnast ja igapäevastest tegevustest, kirjeldada inimesi ja kohti, kasutada linnas liikumiseks, sisseostude tegemiseks jms vajalikke väljendeid ja sõnavara.\nKursus põhineb Euroopa keeleõppe raamdokumendi A1 ja A2 tasemele vastaval õpikul.\nKursus eeldab osalejatelt aktiivset osavõttu dialoogide moodustamisel, käsitletavatel teemadel kaasarääkimist, lühikeste tekstide koostamist.\n\nSuhtlusvormelid ja sõnavara:\n-igapäevased elementaarsed suhtlusvormelid\n-reisimine\n-suhtlemine kodu- ja töökeskkonnas\n-erinevad suhtlemissituatsioonid (kauplus, vaba aeg jne)\n-inimese kirjeldus (välimus, meeleolu, isikuomadused jne)\n-looduskeskkonna kirjeldus (ilm, maastik jne)\n-inimkeskkonna kirjeldus (eluase, asulad jne)\n\nGrammatika:\n-verbi \"olema\" erinevad kasutusvariandid\n-grammatiline olevik ja tulevik\n-imperatiiv\n-ase-, arv-, omadus- ja määrsõnad\n-grammatiline minevik: erinevate minevikuaegade kasutamineObjectives/eesmärkid:  Õppeaine eesmärgiks on hispaania suhtluskeele omandamine algtasemel (A1 ja A2 tase vastavalt Euroopa keelestandardile).Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud üliõpilane tunneb suhtlusvormeleid, grammatikat algtasemel ning igapäevase elu esemeid ja nähtusi tähistavat põhisõnavara, oskab seda dialoogides ja muudes vormides kasutada. Üliõpilane oskab hispaania keelt hääldada ja lugeda, tunneb peamisi ortograafiareegleid ning oskab lihtsate lausetega rääkida ja kirjutada iseendast ja oma igapäevasest elust. NB! Aine on mõeldud hispaania filoloogidele. Vabade kohtade olemasolul (arv selgub augusti viimasel nädalal) saavad õppida kõrvaleriala võtjad ja teiste erialade üliõpilased. Huvilised saavad end kirja panna õppekorraldaja juures elica.mateo@ut.ee\n\nHead tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}