{"KURSUSE_NIMI": "Etnoloogia ja folkloristika magistriseminar", "KURSUSE_KOOD": "FLKU.03.006", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Magistriseminaride sisu on seotud aine eesmärgi ja õpiväljunditega.\n\nKursuse esimese osa seminarides tutvutakse magistriprogrammi võimaluste ning seotud osakondades tehtavate teadusprojektidega. Iseseisvate tööde abil jõutakse teadlikult ajastatud semestriplaani, välissemestri plaani ning individuaalse õpitee kavani.\n\nKursuse teise osa seminarides süvenetakse  lähemalt igasse magistritöö kavandi alapunktiga seotud teemasse. Seminarides on oluline osa aruteludel, üksteise kodutööde ja varem kaitstud magistritööde vastastikusel analüüsil, üliõpilane saab jooksvalt tagasisidet oma uurimistöö eri etappidele ja tööprotsessi käigus esilekerkivate probleemidele. Seminarides käsitletavad alateemad sõltuvad ka magistrantide individuaalsetest uurimisteemadest.Objectives/eesmärkid:  Seminari eesmärgiks kursuse esimeses osas on \n1) anda ülevaade magistriprogrammi ülesehitusest ja valikuvõimalustest, sh välisõpingute võimalustest\n2) toetada üliõpilast isiklike õpivajaduste tundmaõppimisel, õpitegevuste analüüsimisel ja läbimõeldud valikute tegemisel õppekavas\n\nSeminari eesmärgiks kursuse teises osas on:\n1) valmistada üliõpilasi ette iseseisvaks uurimistööks oma magistritöö raames ning anda sellele jooksvalt individuaalset tagasisidet. Keskendutakse planeeritava magistritöö kavandi koostamise eri etappidele etnoloogia ja folkloristika erialadel, lähemalt käsitletakse iga kavandi osaga seotud spetsiifilisi probleeme. Ainekursuse lõpuks valmib igaühel individuaalne magistritöö kavand.Learning outcomes/õpiväljund:  Õppeaine edukal läbimisel oskab üliõpilane: a) kavandada teadlikult oma õppimisprotsessi b) reflekteerida (enese)kriitiliselt õppimiskogemuse üle c) suhelda konstruktiivselt kaasõppijatega, anda tagasisidet ja analüüsida saadud tagasisidet d) iseseisvalt planeerida akadeemilist uurimistööd  piiritletud ja magistriõpingute raames teostataval teemal; e) püstitada uurimisküsimusi; f) kriitiliselt analüüsida teemakohast erialast kirjandust; g) kavandada teemakohase empiirilise materjali kogumist ja analüüsi; h) planeerida kogu uurimisprotsessi ajakava."}