{"KURSUSE_NIMI": "Magistritöö", "KURSUSE_KOOD": "FLKU.03.003", "EAP": 30, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 780, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Nõuetele vastava magistritöö koostamine ja kaitsmine. Magistritöö juhend ja hindamiskriteeriumid on kättesaadavad magistriseminari Moodle'is.Objectives/eesmärkid:  Iseseisva tervikliku erialase uurimistöö planeerimine, kirjutamine ja kaitsmine. Magistritöös näitab üliõpilane oma teadmisi ja võimet loovalt kasutada magistriõppes omandatud teadmisi praktiliste või teoreetiliste probleemide lahendamisel. Magistritöö kirjutamisel demonstreerib üliõpilane uurimisprobleemi ja/või eesmärgi ning uurimisküsimuste seadmise oskust, erialase kirjanduse tundmise ja kasutamise, allikate leidmise ja/või loomise ning ainevaldkonna piiritlemise ja iseseisva uurimistöö oskust. Uurimistulemuste magistritööks vormistamisel näitab üliõpilane akadeemilise kirjutamise oskust ning kaitsmisel avaldub tema akadeemilise väitluse oskus.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: Püstitab valdkonna seisukohalt olulise uurimisprobleemi ja/või -eesmärgi ja uurimisküsimused ning kasutab nende lahendamiseks sobivaid allikaid/materjale ja uurimismeetodeid. Tunneb uuritava teema varasemat uurimislugu, paigutab käsitletava teema erialasesse konteksti  ja kasutab teemakohaseid allikaid/materjale eesmärgipäraselt.  Viib läbi iseseisva uurimistöö: leiab uurimisprobleemist ja/või -eesmärgist lähtuva argumenteeritud lahenduse, struktureerib töö loogiliselt, tõlgendab tulemusi ning seostab neid omavahel ja sünteesib kirjandusega. Vormistab oma magistritöö vastavalt akadeemilise uurimistöö nõuetele erialases ja korrektses eesti keeles.   Argumenteerib uurimistööd kokku võtvas kaitsekõnes ja akadeemilises diskussioonis põhjendatult oma uurimistöö seisukohtade üle"}