{"KURSUSE_NIMI": "Kirjandusteaduslik magistriseminar II", "KURSUSE_KOOD": "FLKU.05.256", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kirjandusteaduslik seminar II toestab ja monitoorib magistritöö kirjutamise protsessi, pakkudes ühtlasi kirjandusteaduslikku diskussioonifoorumit erinevate erialade magistrantidele, kes kirjutavad kirjandusteaduslikku magistritööd. Osalevad tudengid kirjandus- ja teatriteaduse  ja Euroopa keeled ja kultuurid õppekavalt.\nSeminaris tutvustatakse ja retsenseeritakse magistritöö kavandit ja üht valminud magistritöö peatükki.\nSeminaril toimub arutelu magistritöö kaitsmisele sarnases formaadis: töö autor tutvustab oma magistritöö projekti ja edasist tööplaani selle teostamiseks. seejärel saab sõna kaasüliõpilasest retsensent, järgneb arutelu juhendaja osalusel.\nMagistriseminari oluliseks osaks on osalemine HUMA sügiskoolis, kus magistrandid peavad ettekandeid oma magistritöö teemal. Selleks toimuvad eelnevalt seminarid akadeemilise ettekande vormidest ja teeside koostamisest.Objectives/eesmärkid:  Magistriseminari eesmärgiks on edendada magistritöö valmimist ning pakkuda nii erialast kui ka interdistsiplinaarset diskussioonifoorumit.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Magistriseminar suunab tudengit süsteemselt tegelema oma magistritööga, õppima esitama uurimisküsimust ja valima vastavalt sellele uurimistöö mahu ja teoreetilis-metodoloogilise lähenemise. \nInterdistsiplinaarses magistriseminaris õpitakse põhjendama ja sõnastama oma erialast, teoreetilist vaatepunkti ja valitud metodoloogilist lähenemist, väitlema ja argumenteerima, küsima ja vastama erinevates rollides (nii retsenssendi kui ka kaitsjana).  \nEt jõuda ideest teostuseni, on tarvis osata tööd planeerida ja korraldada, seada ajakava ja suuta sellest kinni pidada. Kuna magistriseminari on kaasatud nõuandjaid erinevates funktsioonides, kujuneb seminaris töökeskkond, milles on oluline koostöö, planeerimine, tähtaegade seadmine, kooskõlastamine, ajakavast kinnipidamine.  \n\nMagistriseminaris õpitakse pidama akadeemilist ettekannet, seda struktureerima, pealkirjastama, esitama teese, koostama slaide. Kõike seda ka praktiseeritakse: magistrandid osalevad 15-minutilise ettekandega iga-aastases HUMA sügiskoolis. Ka siin pööratakse tähelepanu ajaplaneerimisele, seda nii ettekandeks ettevalmistuse kui ka ettekande pidamise osas.\n\nMagistriseminari on kaasatud ka magistritöö juhendaja.\nKirjandusteaduslik magistriseminar II toimub magistriõpingute 3. semestril. Selle jooksul peab olema täpsustunud magistritöö kavand ja magistritööst peab olema valmis üks peatükk. HUMA sügiskool toimub 14.-15. novembril 2024.\n\nSügiskooli eesmärk on võimaldada humanitaarvaldkonna magistrantidel pidada populaarteaduslik ettekanne oma magistritöö teemal ja saada sellele tagasisidet. Ettekandega osalevad eeskätt 2. aasta magistrandid, kuid 1. aasta magistrandid saavad teha posterettekande.\nEttekanne on 15 minutit, järgneb 15 minutit diskussiooni.\nEttekanne on mõeldud laiale interdistsiplinaarsele kuulajaskonnale. Oskus oma eriala populariseerida on akadeemilises maailmas väga oluline. Sügiskooli ettekannet valmistades tuleks mõelda, kuidas selgitada oma uurimisprobleemi ja erialast lähenemist teise eriala inimestele ja miks uurimistöö on ühiskonnale oluline.\n\nEesti kirjandusteaduse ajakirjad:\nMethis http://www.methis.ee/\nKeel ja Kirjandus http://kjk.eki.ee/\nJournal of Baltic Studies http://www.aabs-balticstudies.org/journal-of-baltic-studies (raamatukogus)\nInterlitteraria vt: https://ojs.utlib.ee/index.php/IL/index\n\nVõrdleva kirjandusteaduse veebilehed ja ajakirjad:\nInternational Comparative Literature Association http://www.ailc-icla.org/site/\nCLCWeb: Comparative Literature and Culture: http://docs.lib.purdue.edu/clcweb/all_issues.html\nRéseau européen d'études littéraires comparées/European Network for Comparative Literary Studies: http://encls.net/\nComparative Literature: http://complit.dukejournals.org/\nComparative Literature Studies: http://www.cl-studies.psu.edu/index.shtml\nOrbis Litterarum: http://www.blackwellpublishing.com/journal.asp?ref=0105-7510\nNeohelicon: http://www.springer.com/education+%26+language/linguistics/journal/11059\narcadia, International Journal of Literary Culture Internationale Zeitschrift für literarische Kultur: http://www.degruyter.com/view/j/arca?rskey=3sem3r&result=2&q=arcadia\nComparative Criticism and Comparative Critical Studies: http://www.bcla.org/compcrit.htm\nCulture, Theory and Critique: http://www.tandfonline.com/loi/rctc20\nPortals: A Journal of Comparative Literature http://portalsjournal.com/about-portals/"}