{"KURSUSE_NIMI": "Kirjandusteaduslik magistriseminar II", "KURSUSE_KOOD": "FLKU.05.256", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kirjandusteaduslik seminar II toestab ja monitoorib magistritöö kirjutamise protsessi, pakkudes ühtlasi kirjandusteaduslikku diskussioonifoorumit erinevate erialade magistrantidele, kes kirjutavad kirjandusteaduslikku magistritööd. Osalevad tudengid kirjandus- ja teatriteaduse  ja Euroopa keeled ja kultuurid õppekavalt.\nSeminaris tutvustatakse ja retsenseeritakse magistritöö kavandit ja üht valminud magistritöö peatükki.\nSeminaril toimub arutelu magistritöö kaitsmisele sarnases formaadis: töö autor tutvustab oma magistritöö projekti ja edasist tööplaani selle teostamiseks. seejärel saab sõna kaasüliõpilasest retsensent, järgneb arutelu juhendaja osalusel.\nMagistriseminari oluliseks osaks on osalemine AKK sügiskoolis, kus magistrandid peavad ettekandeid oma magistritöö teemal. Selleks toimuvad eelnevalt seminarid akadeemilise ettekande vormidest ja teeside koostamisest.Objectives/eesmärkid:  Magistriseminari eesmärgiks on edendada magistritöö valmimist ning pakkuda nii erialast kui ka interdistsiplinaarset diskussioonifoorumit.Learning outcomes/õpiväljund:  Magistriseminar suunab tudengit süsteemselt tegelema oma magistritööga, õppima esitama uurimisküsimust ja valima vastavalt sellele uurimistöö mahu ja teoreetilis-metodoloogilise lähenemise. \nInterdistsiplinaarses magistriseminaris õpitakse põhjendama ja sõnastama oma erialast, teoreetilist vaatepunkti ja valitud metodoloogilist lähenemist, väitlema ja argumenteerima, küsima ja vastama erinevates rollides (nii retsenssendi kui ka kaitsjana).  \nEt jõuda ideest teostuseni, on tarvis osata tööd planeerida ja korraldada, seada ajakava ja suuta sellest kinni pidada. Kuna magistriseminari on kaasatud nõuandjaid erinevates funktsioonides, kujuneb seminaris töökeskkond, milles on oluline koostöö, planeerimine, tähtaegade seadmine, kooskõlastamine, ajakavast kinnipidamine.  \n\nMagistriseminaris õpitakse pidama akadeemilist ettekannet, seda struktureerima, pealkirjastama, esitama teese, koostama slaide. Kõike seda ka praktiseeritakse: magistrandid osalevad 15-minutilise ettekandega iga-aastases AKK sügiskoolis. Ka siin pööratakse tähelepanu ajaplaneerimisele, seda nii ettekandeks ettevalmistuse kui ka ettekande pidamise osas.\n\nMagistriseminari on kaasatud ka magistritöö juhendaja.\nKirjandusteaduslik magistriseminar II toimub magistriõpingute 3. semestril. Selle jooksul peab olema täpsustunud magistritöö kavand ja magistritööst peab olema valmis üks peatükk. Ajaloo-, kirjandus- ja kultuuriteaduste magistrikooli sügiskool 6.-7. detsembril\n\nÜlesanded 2. aasta magistrantidele: \npidada ettekanne oma magistritöö teemal (ettekanne 15 min, diskussioon 15 min);\n\n1.\taasta magistrantidel on võimalus teha posterettekandeid, osaleda aktiivselt aruteludes, moderaatoritena, magistrikooli korraldustoimkonnas.\n\nTärminid:\n\n20. november: esitada AKK korraldustoimkonnale (kooskõlastatult juhendaja või seminarijuhendajaga) ettekannete pealkiri ja kokkuvõte (300 sõna)"}