{"KURSUSE_NIMI": "Laste- ja noortekirjandus", "KURSUSE_KOOD": "FLKU.05.095", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 4, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ülevaade eesti lastekirjanduse ajaloost maailma lastekirjanduse taustal. 20. sajandi eesti lastekirjanduse liikide, teoste ja autorite lähem vaatlus, seostatuna lastekirjanduse teooriaga.\n\nKursuse teemad\n1. Lastekirjanduse mõiste. Lastekirjanduse eripära.\n2. (Eesti) lastekirjandusest enne 19. sajandit.\n3. Lastekirjandus ja eesti lastekirjandus 19. sajandil.\n4. Eesti lastekirjanduse ajaloo põhijärgud ja suundumused 20. sajandil.\n5. Eesti lastekirjandus 21. sajandil.\n6. Muinasjutt ja fantaasiakirjandus (fantastika). Mõisted ja liigid.\n7. Olulisemaid tekste maailma muinajutu- ja fantaasiakirjanduses.\n8. Eesti muinasjutud ja muinasjututöötlused.\n9. Eesti lastekirjandusliku fantastika (kunstmuinasjutu) arengujooni.\n10.Lasteluule eripära. Folkloor ja lasteluule..\n11.Eesti lasteluule tähtsamaid autoreid (K.-E. Sööt, E. Enno, J. Oro, E. Niit, H. Mänd, H. Runnel, L. Tungal).\n12. Realistliku lastekirjanduse tunnused, liigid, põhiteemad.\n13. Poistekirjandus ja tüdrukutekirjandus, nende erijooned.\n14. Noortekirjanduse määratlus. Temaatikast ja kujutuslaadist.\n15. Uuema eesti noortekirjanduse iseloomustus.\n16. Eesti laste- ja noorteproosa tähtsamaid autoreid: J. Parijõgi, K.A. Hindrey, I. Truupõld, S. Rannamaa, R. Vaidlo, E. Raud, H. Väli, J. Rannap, H. Mänd, A. Pervik, H. Nõu, A. Kivirähk, A. Vallik.\n17. Väärtushinnangute ja positiivsuse probleem laste- ja noortekirjanduses.\n18. Näiteid eesti laste- ja noortekirjanduse teemade kohta: kodu, kool, loodus, põlvkondadevahelised vastuolud, suhted eakaaslastega, üksindus, sõprus, armastus, vägivald, haigus, surm.\n19. Lapsed ja teabekirjandus (aimekirjandus). \n20. Lastekirjandusteoste vastuvõtt ja tõlgendamine.Objectives/eesmärkid:  Kursuse vältel tutvustatakse lastekirjandust kui kirjandusuurimise objekti, selle ajaloolist arengut ning eri liike ja žanre, rõhuga eesti lastekirjandusel. Võrdleva kontekstina tutvustatakse ka olulisemaid suundumusi anglo-ameerika ja skandinaavia lastekirjandusest.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n*\tannab ülevaate eesti laste- ja noortekirjanduse ajaloolisest kaanonist ja tänapäeva olulisematest autoritest ja teistest;\n*\tmõtestab laste- ja noortekirjanduses toimunud muutusi ajaloolises ja kirjandusloolises kontekstis;\n*\tanalüüsib, tõlgendab ja mõistab laste- ja noortekirjandusteoseid žanri- ja tekstipoeetika aspektidest;\n*\thindab kriitiliselt laste- ja noortekirjanduse põhiteemade (nt mäng, kodu, kool, suhted, ühiskond, loodus) käsitlemist ja tähendust;\n*\tkoostab paaris- või rühmatööna uudisteost tutvustava slaidiettekande, annab tagasisidet kaasõppijate ettekandele."}