{"KURSUSE_NIMI": "Rakendusantropoloogia praktika", "KURSUSE_KOOD": "FLKU.03.091", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Etnograafiliste välitööde metodoloogia", "Sissejuhatus rakendusantropoloogiasse"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 78}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilane viib kursust koordineeriva õppejõu juhendamisel läbi iseseisva praktika rakendades varem omandatud teadmisi rakenduslikust kultuurianalüüsist.  \nPraktika raames üliõpilane:\n- koostab koostöös ülikoolivälise partneriga uurimisprojekti plaani ja sõnastab praktika eesmärgid; \n- viib ülikoolivälise partneri juures läbi rakendusliku projekti;\n- esitab kirjaliku praktikaaruande, milles analüüsib ja hindab kriitiliselt oma välitööde materjali, omandatud kogemust ja projekti raames ilmnenud eetilisi aspekte (s.h. kasutatud meetodeid ja nende rakendamist ja saadud tulemusi jm);\n- esitab oma uurimuse tulemused ülikoolivälisele partnerile (kelle juures välitööd läbi viidi) sobivas vormis ja viisil.Objectives/eesmärkid:  Õppeaine eesmärgiks on pakkuda võimalus rakendusliku kultuurianalüüsi praktiliste kogemuste omandamiseks ülikooliväliste koostööpartnerite juures (nt teine uurimisasutus, organisatsioon, ettevõte, MTÜ vm).Learning outcomes/õpiväljund:  Kursuse edukal läbimisel üliõpilane: 1.\toskab rakendada rakendusliku kultuurianalüüsi  meetodeid praktilise projekti läbiviimiseks ülikoolivälise partneri juures. 2.\toskab kriitiliselt analüüsida praktika käigus omandatud teadmisi ja kogemusi ja suudab kriitiliselt reflekteerida praktilise kultuurianalüüsi rakendamisvõimaluste, s.h. eetiliste probleemide, üle ühes võimalikus uurimiskontekstis. NB! Enne ainele registreerimist tuleb ühendust võtta praktikakoordinaatori Kirsti Jõesaluga. kirsti.joesalu@ut.ee"}