{"KURSUSE_NIMI": "Luule- ja proosateksti analüüs", "KURSUSE_KOOD": "FLKU.05.107", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 36, "colloquium": 0, "web_learning": 0, "independent_work": 36, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel \n*\tvaadeldakse luule- ja proosateksti analüüsi lähteteooriaid ja meetodeid ning õpitakse neid praktilises tekstianalüüsis rakendama;\n*\tpööratakse tähelepanu kirjandusteaduslikele distsipliinidele, mis tegelevad tekstiehituslike küsimustega (poeetika, värsiõpetus, narratoloogia, strukturalism jt);\n*\tanalüüsitakse ja tõlgendatakse peamiselt eesti luulet ja proosat, kirjutatakse luule- ja proosatekstide analüüse (nt luulekogu analüüs ja proosatekste võrdlev essee) ja tehakse seminariettekandeid.Objectives/eesmärkid:  Õpitakse analüüsima luule- ja proosatekste ning kasutama erinevaid kirjandusteaduslikke analüüsimeetodeid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Luule- ja proosateksti analüüsi kursuse lõpus üliõpilane\n*\teristab ja selgitab luule- ja proosatekstidele omaseid poeetikavõtteid ning mõtestab nende tähendust teose (üksikluuletuse, luulekogu, novelli või romaani) kui terviku seisukohalt;\n*\trakendab luule- ja proosatekstide poeetikaanalüüsis sobivaid kirjandusteaduslikke mõisteid ja meetodeid;\n*\tavaldab kultuuriteadliku suhtlemise käigus loetud kirjandusteoste kohta põhjendatud arvamust nii individuaalselt kui ka rühmaarutelus;\n*\tkoostab ja esitab suulise lühiettekande ühe luule- ja ühe proosateksti analüüsi ja tõlgendamise võimalustest, annab tagasisidet kaasõppija ettekandele;\n*\tkirjutab sobivale tekstianalüüsi meetodile tuginedes nii luulekogu analüüsi kui ka proosateoseid võrdleva essee, analüüsides luule- ja proosatekstide poeetikat, nende kirjandusloolisi taustu ja moraalseid väärtusi. Proosateksti analüüsi täpsem korraldus ja ülesanded Moodle'is.\n\nProosateksti analüüsi kursuse teemad:\n* Mis on proosa? Proosakirjanduse elemendid ja struktuur (tegelased, süee, kronotoop, vaatepunkt, stiil, keel) \n* Alaanrid ja tüübid (romaan, novell, jutustus, essee, päevik, autofiktsioon) \n* Kirjandusvoolud (romantism, realism, modernism, postmodernism)\n* Proosa uurimise meetodid: autori-, lugeja-, konteksti- ja tekstikesksed ning kombineeritud lähenemised;\n- Vene vormikoolkond ja uuskriitika (Šklovski, Jakobson, Eliot, Pound)\n- Strukturalistlik ja semiootiline lähenemine (Bahtin, Lotman, Eco, Barthes)\n- Narratoloogia (Propp, Genette, Bal)\n- Historitsism (Auerbach)\n- Poststrukturalism ja dekonstruktsioon (Derrida, de Man)\n- Teemakesksed lähenemised: feministlik, kväär- ja ökokriitika, postkolonialism, trauma \n- Intertekstuaalsus ja võrdlev analüüs (Kristeva, Wellek)\n\n\nProosateksti analüüsi kirjanduse loetelu samuti Moodle'is."}