{"KURSUSE_NIMI": "Kreeka keele morfoloogia ja süntaks", "KURSUSE_KOOD": "FLLC.02.016", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus süvendab teadmisi kreeka- ja ladina keele vormi- ja lauseõpetusest. Tegeldakse lauseliikmete ja lausestruktuuride funktsioonide analüüsiga, tehakse praktilisi harjutusi. Kursus on täienduseks ja abiks kreeka autoritekstidega töötamisel.Objectives/eesmärkid:  Süvendada üliõpilaste alusteadmisi vanakreeka keele morfoloogias ja süntaksis, mis on vajalik edaspidi kreeka autoritekstide lugemisel.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1) tunneb sõnaliike, lauselauseliikmeid, analüüsib sõnavorme ja lauset morfoloogilisest ning süntaktilisest aspektist; 2) mõistab lausete ja tekstide üldist ülesehitust, keele struktuuri; 3) tõlgib vanakreekakeelseid lihtsamaid tekste kasutades omandatud teadmisi vanakreeka keele morfoloogiast ja süntaksist; 4) loob iseseisvalt (ent abimaterjalidega) lihtsamaid vanakreekakeelseid lauseid. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}