{"KURSUSE_NIMI": "Eesti keel eelkesktasemele II, A2.2 - B1.1", "KURSUSE_KOOD": "FLLC.09.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppematerjal:\nÕpetaja  koostatud õppematerjal.\nTeemad:\n1) Kel tarkus peas, sel ohjad peos. Grammatika: imperatiiv, impersonaali preesens\n2) Pühad ja tähtpäevad. Grammatika: adessiiv (mitmendal?), adverb (kuidas?)\n3) Linnas asju ajamas. Grammatika: impersonaali preesens, pluurali partitiiv, objekt\n4) Sõprus on väärt rohkem kui raha. Grammatika: adjektiivi komparatiiv ja superlatiiv, komparatiiv + kellest? millest?, pluurali genitiivObjectives/eesmärkid:  Üliõpilaste keeleoskuse arendamine esmase keeleoskuse tasemelt iseseisva keelekasutaja (suhtluslävi) tasemeni. Kursusel arendatakse üldist suulist suhtlust, teemakohast sõnavara, vestlust, mitteametlikku mõttevahetust, toiminguid teenuste saamiseks ja info vahetamist põhiliselt kahe osaoskuse raames. Rääkimine: info küsimine ja selgituste palumine, arvamuse avaldamine (nõustumine-mittenõustumine), ettepanekute tegemine, sündmuste ja nähtuste kirjeldamine, võrdlemine ja lihtsam analüüs. Kuulamine: kuuldu mõistmise arendamine igapäevaelu puudutavatel teemadel, info leidmine tuttaval teemal salvestatud tekstidest, lihtsamate raadio- ja teleuudiste jälgimine, rutiinsete telefonivestluste harjutamineLearning outcomes/õpiväljund:  Kursuse läbinud üliõpilane\nkirjeldab lihtsate lausetega oma õpinguid, haridussüsteemi ja kooliteed\nkirjeldab pühade ja tähtpäevade kombeid, jutustab oma kodumaa pühast, kasutab levinumate pühade soove\nsuudab esitada oma soove pangas (postkontoris, PPAs)\njutustab oma kogemustest klienditeeninduses ja / või klienditeenindajana\nkirjeldab inimese välimust ja iseloomu\nräägib sõprusest ja sõpradest"}