{"KURSUSE_NIMI": "Elu inglise maahäärberis", "KURSUSE_KOOD": "FLLC.01.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus vaatleb elu inglise maahäärberis läbi selle viiesajaaastase ajaloo tema väljakasvamisest keskaegsest lossist kuni hukuni 20. sajandil seoses maaomandi tähtsuse vähenemisega riigivalitsemises. Inglise maahäärber on kujunenud ihaldusväärse inglasliku elu sümboliks ja nostalgia laineharjal valmib üha uusi rahvusvahelise menuga telesarju, mis taaselustavad nende majade languse-eelse hiilguse. Üha hoogustuv muinsuskaitseliikumine Suurbritannias on säilitamas või aitamas uuele elule maju, mis veel hiljuti olid määratud hävingule. Inglise maahäärber kui võimukeskus ja sümbol on lahutamatu inglise (ja shoti ja iiri) kirjandusest, käsitlegu see siis suuri ühiskondlikke probleeme või inimeste eraelu.\n\tSeega vaatleme kursuse jooksul inglise maahäärberit paljude nurkade alt: arhitektuur kui sümboli väline kest ja manifestatsioon; kuidas maja funktsioneeris ja kes seal elasid; kuidas majade otstarve aja jooksul muutus ja mis sellega kaasnes; kuidas saabus häving ja mida on tehtud selle peatamiseks. Kirjanduslikku ja ajalookirjutuslikku materjali toetab rikkalik pildikogu.\n\tKursus lõpeb kirjaliku eksamiga, mis ei ole hindeline ja milles on lubatud kasutada kõiki kursuse vältel läbi võetud materjale. Eksamile pääsemiseks tuleb osaleda vähemalt kaheksal kümnest sessioonist (sissejuhatav loeng ei lähe siin arvesse). Eksam on kirjalik ja koosneb neljast küsimusest materjalide kohta, mis on tarvis kodus iseseisvalt läbi lugeda, mis on seminarides läbi arutatud ja mille läbitöötamise hõlbustamiseks on küsimused igaks sessiooniks olemas kursuse materjalide juures.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada elu inglise maahäärberis viie viimase sajandi jooksul kasutades eri ajastute kirjanduslikke ja muid asjasse puutuvaid tekste vaatlemaks, kuidas maahäärberist sai lahutamatu osa inglise identiteedist.Learning outcomes/õpiväljund:  Kuruse lõpuks peaks üliõpilane olema võimeline orienteeruma inglise maahäärberi ajaloos, tundma erinevate ajastute mõtteviise, vajadusi ja neist tulenevaid ehitusstiile, mis annavad iga perioodi majadele nende näo ja otstarbe. Samuti on olnud ka võimalik heita pilk nende ajasute mõttemaailma läbi kirjandustekstide, kus kirjeldatakse kas koomilises, eleegilises või realistlikus võtmes inimeste elu, kes neis majades erinevatel aegadel elasid."}