{"KURSUSE_NIMI": "Eesti keele algkursus I, inglise keele baasil, tase 0 - A1.1", "KURSUSE_KOOD": "FLLC.09.001", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Eesti keele kursus annab põhiteadmised eesti keele grammatikast ja sõnavarast.\nPeamised teemad:\nTERE TULEMAST! Welcome!\nEESTI JA TARTU. Estonia and Tartu\nEESTI KEEL. Estonian language\nTEEMA 1. TERE! SAAME TUTTAVAKS! Hello! Let's get acquainted\nTEEMA 2. MINA OLEN ... I am ...\nTEEMA 3. MINU LEMMIKUD. My favourites\nTEEMA 4. POES JA KOHVIKUS. In the shop and in the café\nTEEMA 5. MINU PÄEV. My day\nTEEMA 6. PERE JA SUGULASED. Family and relatives\n\nPeamised grammatikateemad:\n* Käänded ainsuses: põhikäänded, kohakäänded, kaasaütlev ja ilmaütlev; mitmuses: nimetav, omastav\n* Isikulised asesõnad, omadussõnad, põhiarvsõnad;\n* Olevik\n* Käskiv kõneviis\n* ma- ja da-infinitiivObjectives/eesmärkid:  Õpetada eesti keele grammatika aluseid ja eesti keele põhisõnavara. Üldeesmärkide saavutamise lõpptase kõigis osaoskustes on A1.1.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane * tunneb ja oskab kasutada eesti keele käändeid, pöörata verbe olevikus, kasutada käskivat kõneviisi, kasutada omadussõnu ja põhiarvsõnu. * suudab suhelda lihtsamates argisituatsioonides poes ja söögikohtades, oskab rääkida ja kirjutada endast, perekonnast, päevast, söökidest-jookidest ning sellest, mis meeldib ja ei meeldi. * suudab mõista ning luua lihtsamaid suulisi ja kirjalikke tekste. As a course FLLC.09.001. Estonian language.Course for Beginners I is taught by two or three teachers there might be differences during the presentation of the material and materials, the overall requirements are the same and the level at the end corresponds to the A1.1. At the beginning of the course a teacher gives the participants the schedule and handouts with detailed requirements for the course."}