{"KURSUSE_NIMI": "Eesti keel eelkesktasemele I, A2.1 - A2.2", "KURSUSE_KOOD": "FLLC.09.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "independent_work": 82, "individual_work": 10, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpetaja koostatud materjalid.\n\nTeemad:\n1. Kodu\n2. Riided ja välimus\n3. Tervis\n4. Kultuur ja meelelahutus \n\nGrammatikateemad:\npospositsioonid, lõpetatud ja lõpetamata tegevus (objekt),  täisminevik, järgarvsõnad, eesti keele käänded ainsuses ja mitmuses.\nObjectives/eesmärkid:  Keelekursus on mõeldud üliõpilastele, kelle eesti keele oskus on tasemel A1.2>A2.1. Keelekursus ei ole mõeldud üliõpilastele, kes on juba omandanud eesti keele oskuse tasemel A2.1>A2.2 ja kes vajavad B1 või B2 keeletasemele vastavaid teadmisi. Üliõpilaste keeleoskuse arendamine esmase keeleoskuse (A2) taseme raames. Kursusel arendatakse üldist suulist suhtlust, teemakohast sõnavara, vestlust, mitteametlikku mõttevahetust, toiminguid teenuste saamiseks ja info vahetamist põhiliselt produktiivsete osaoskuse raames. Rääkimine: info küsimine ja selgituste palumine, arvamuse avaldamine (nõustumine-mittenõustumine), ettepanekute tegemine, sündmuste ja nähtuste kirjeldamine, võrdlemine ja lihtsam analüüs. Kuulamine: kuuldu mõistmise arendamine igapäevaelu puudutavatel teemadel, info leidmine tuttaval teemal salvestatud tekstidest, lihtsamate raadio- ja teleuudiste jälgimine.Learning outcomes/õpiväljund:  Kursusel osalenu: osaleb aruteludes tuttaval teemal, väljendab ja põhjendab oma seisukohti; räägib tervisest ja tavalisematest terviseprobleemidest; annab nõu; Kirjeldab ja tutvustab inimesi, elutingimusi ning igapäevatoiminguid, sõnastab, mis meeldib, mis mitte jne, kasutades selleks lihtsaid sidesõnadega seotud väljendeid ja lauseid; jälgib esitlust tuttaval teemal, kui sõnum esitatakse aeglaselt ja selgelt lihtsas keeles ning seda toetatakse visuaalsete vahenditega (nt slaidid, käsilehed); kasutab järgmist grammatikat: pospositsioonid, lõpetatud ja lõpetamata tegevus (objekt),  täisminevik, järgarvsõnad, eesti keele käänded ainsuses ja mitmuses; mõistab lühikesi lihtsaid tekste tuttaval konkreetsel teemal; esitab selgeks õpitud ettekande ning lühidalt põhjendab ja selgitab arvamusi. Tuleb toime mõne otsesõnalise esinemisjärgse küsimusega."}