{"KURSUSE_NIMI": "Magistritöö", "KURSUSE_KOOD": "FLLC.00.011", "EAP": 15, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 340, "individual_work": 50, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Üliõpilane viib õppejõu juhendamisel läbi uurimistöö või koostab õppetöös kasutatava metoodiliselt põhjendatud materjali, mis võib luua eeldused õpingute jätkamiseks doktoriõppes.Objectives/eesmärkid:  Üliõpilane viib iseseisvalt läbi uurimistöö aktuaalsel teemal kasutades sobivat metoodikat või koostab õppetööks kasutatava metoodiliselt põhjendatud materjali.Learning outcomes/õpiväljund:  Õpetajakoolituse lõputöö koostanud ja edukalt kaitsnud üliõpilane: 1) On püstitanud õpetaja tööd ja võõrkeelte õppimise ja/või õpetamise alast uurimistööd siduva uurimisküsimuse ja -eesmärgi ning valinud koostöös juhendajaga selle analüüsimiseks sobiva meetodi. Uurimus järgib teaduseetika põhimõtteid. 2) On koostöös juhendajaga koostanud teostatava tööplaani ja töö valmimise protsessis iseseisvalt rakendanud konstruktiivset kriitikat töö parendamiseks. On pidanud kinni kokkulepetest juhendajaga.  3) On läbi töötanud teemakohast erialakirjandust, valinud sobivad allikad ja sidunud need oma uurimuse analüüsiosaga tervikuks. 4) On analüüsinud ja tõlgendanud läbi viidud uurimuse tulemusi või koostatud õppematerjali valitud teoreetilisele ja/või metoodilisele raamistikule toetudes. 5) On lähtunud teksti sõnastuses, ülesehituses ja vormistuses osakonna juhendist ja akadeemilise kirjutamise tavadest. 6) On valmistanud ette ja esitanud tööd kokku võtva kaitsekõne ja vastanud tööd puudutavatele küsimustele avalikul kaitsmisel.  Osakondade lõputööde juhendid:\nInglise keele õpetaja: https://maailmakeeled.ut.ee/et/sisu/anglistika-magistritood\nSaksa keele õpetaja: https://maailmakeeled.ut.ee/et/germanistika/oppimine\nVene keele õpetaja: https://maailmakeeled.ut.ee/et/slavistika/oppimine\nPrantsuse keele õpetaja: https://maailmakeeled.ut.ee/et/sisu/tahtajad-lopetajatele/prantsuse-keel-ja-kirjandus\nHispaania keele õpetaja: https://maailmakeeled.ut.ee/et/sisu/tahtajad-lopetajatele-hispaania-keel-ja-kirjandus"}