{"KURSUSE_NIMI": "Erikursus antiikmaailmast ja antiigitraditsioonist I", "KURSUSE_KOOD": "FLLC.02.014", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 18}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus hõlmab tutvumist antiikmaailma materiaalsete säilinud objektidega de visu kas antiikses Vahemereruumis või Euroopa kesksetes antiigipärandit säilitavates muuseumides. Sissejuhatavale seminarile järgneb tutvumine erialakirjandusega valitud objekti kohta, õppereis ning lõpuks teadmiste süstematiseerimine, mis päädib rühmatöö või õpimapiga.\n  Kursust on võimalik läbida ka iseseisvat projekti läbi viies - see lepitakse kokku aine õppejõu(dude)ga.Objectives/eesmärkid:  Õppereisil osaledes tutvuda materiaalse antiigipärandiga ja antiikmaailmast säilinud arhitektuuriliste objektidega de visu; õppida materiaalsete objektide vaatlus- ja kirjeldamistehnikaid; harjutada materiaalsetelt allikatelt saadava info seostamist kirjanduslike allikate infoga; õppida koostama ülevaadet kuuldud ning nähtud materjali kohta, analüüsida õpitut enda seisukohalt.   Eestis kohapeal ainet sooritades on eesmärgiks osaleda mõnes antiikkeeli ja/või -kultuure puudutavas projektis, kuulata erialaseid loenguid, sostada neid seniõpituga.Learning outcomes/õpiväljund:  Õppereisil osalenud üliõpilane \n*oskab seostada teoreetilisest erialaõppest saadud teadmisi säilinud materiaalse pärandi ja keskkonnaga; \n*tunneb olulisemaid antiikmaailma pärandit hoidvaid institutsioone ja paikkondi;\n* oskab planeerida muuseumide külastusi, teha õppereisiks vajalikku eelnevat uurimistööd;\n*teeb koostööd kaasüliõpilastega õppekäigu/projekti planeerimisel, kursuse lõputöö/projekti tegemisel.\n\nIseseisva projektiga tegelenud üliõpilane:\n*planeerib ja viib õppejõu juhendamisel läbi kokkulepitud uurimisülesande või\n*planeerib ja aitab läbi viia mõnd erialaga seotud üritust, näitust vms.\n*juhib iseenda tegevust, reflekteerib tööprotsessi üle. 21/22 kevadsemestril on põhiplaaniks Jaan Jõgeveri Homerose tõlke (aga võimalusel ka mõne teise autori tõlke/tõlgete) viimine käsikirjaliselt kujult digitaalsele.  Täpsem info liigub Moolde'i foorumis, tegevuskava arutatakse esimesel kohtumisel veebruaris. Digitaalsele kujule viidud käsikrijafailid lisatakse pärast projekti lõppemist TÜR DataCite'i platvormile, osalemisega kinnitab kursusel osaleja oma nõusolekut selleks, et tema töö koos atributsiooniga sinna lisatakse. \n\nÕppereisi hetkeoludes ette planeerida ei julge, aga kui selleks avaneb võimalus, siis vähendatakse põhiprojektis oleva töö mahtu õppreisi arvelt."}