{"KURSUSE_NIMI": "Eesti keel kõrgtasemele II, tase B2.2 - C1.1", "KURSUSE_KOOD": "FLLC.09.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpik:\nM. Kitsnik, L. Kingisepp \"Avatud uksed\" õpik ja töövihik\nTeemad: \n\n1) Kaubandus ja tarbijakaitse. Grammatika: ainsuse ja mitmuse osastav, umbisikulise tegumoe minevik.\t\n2) Kodukeemia ja prügi. Grammatika: põhiarvsõnade käänamine, v-, tav- ja nud- kesksõna.\n3) Kool ja haridus. Grammatika: liitlause, sõnajärg lauses.\n4) Tervis ja eluiga.Grammatika: verbirektsioon (saav kääne), sihitud ja sihilised tegusõnad.Objectives/eesmärkid:  Üliõpilaste ettevalmistus eesti keele C1 tasemeeksami sooritamiseks.\nVestlus- ja argumenteerimisoskuse arendamine: sõnavara laiendamine ühiskondliku ja tööalase suhtluse teostamiseks, spontaanse ja ladusa väljendusoskuse arendamine, C1 tasemel sobiva kõneregistri kujundamine. \nKirjutamisoskuse arendamine: selge, hästi liigendatud teksti koostamise arendamine. Ametikirja, essee, põhjaliku aruande kirjutamise arendamine; järelduste, põhjenduste, argumentide väljatoomise oskuse kujundamine. \nPikemate ja keerukamate tekstide kuulamisoskuse arendamine, eesti dialoogi ja monoloogi omapära tutvustamine. \nOlustikuliste, publitsistlike ja kirjanduslike tekstide stilistilise eripära tutvustamine ja lugemisoskuse arendamine, valik- ja lünktestide täitmise harjutamine, teksti sisu mõistmise, leksikaalsete ja grammatiliste seoste ning õigekirja arendamine.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane on saanud ettevalmistuse eesti keele C1 tasemeeksami sooritamiseks kõigi osaoskuste lõikes: rääkimine C1: oskab üksikasjalikult kirjeldada sündmusi, arutleda ja argumenteerida, ladusalt ja raskusteta infot esitada, teha sidusaid ja loogilisi ettekandeid läbitud teemadel, reageerib pingutusteta kuulajale kirjutamine C1: oskab kirjutada loogilise struktuuriga arutlust, esseed, kirjeldust, kasutab tasemele vastavaid keelendeid ja registrit kuulamine C1: suudab eristada ja mõista idiomaatilisi ja kõnekeelseid väljendeid, jälgida keerukama sisuga loenguid, mõistab salvestatud ja meedia teel levitatud materjale. lugemine C1: oskab aru saada kasutusjuhendite ja instruktsioonide sisust, suudab hõlmata pikki, keerukaid tekste ning tabada detaile. Kursuse läbinud üliõpilastel soovitatakse sooritada C1-taseme eksam. Vt www.harno.ee.\nKõik iseseisvad tööd on eristava hindamisega ja tuleb esitada tähtajaliselt."}