{"KURSUSE_NIMI": "Multimeedia ja kunsti semiootiline analüüs", "KURSUSE_KOOD": "FLSE.00.273", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on jaotatud kahte ossa. Esimene osa on pühendatud etenduse semiootilisele käsitlusele (täpsem ülevaade teemadest ajakava all). Teine osa annab ülevaate erinevate semiootiliste modaalsuste rollist tekstilise tähenduse loomisel ja semiootilise kontseptualiseerimise vahenditest ning modaalsuste interaktsiooni analüüsist.Objectives/eesmärkid:  Kursuse peamine eesmärk on anda ülevaade performatiivsete (teater, tants, rituaalid, kehaline eneseväljendus jmt) ja multimeedialiste (kino, televisioon, video, reklaam, trükimeedia, uus meedia jne) kultuurinähtuste semiootilise analüüsi erinevatest vahenditest. Tutvustatakse olulisemaid probleeme, tähtsamaid autoreid, teooriaid, käsitlusi ja analüüsimeetodeid. Seminarides proovitakse erinevaid teooriaid rakendada perfomatiivsete ja multimeedialiste tekstide konstrueerimisel ning analüüsimisel. Kursus sisaldab ka praktilisi ülesandeid (nt etüüdid).Learning outcomes/õpiväljund:  Loengu läbinud üliõpilane:\n1) suudab tekstidest olulisima välja tuua kaitstes oma seisukohti diskussioonis;\n2) õpib kehalise eneseväljenduse vahendusel isiklikku kogemust analüüsima;\n3) teab etenduse uuringute ajalugu, tunneb semiootilist ning fenomenoloogilist lähenemist;\n4) saab aru erinevatest etenduse all mõistetud kultuurinähtustest;\n5) teab ja oskab rakendada erinevaid semiootilisi lähenemisi tekstide multimeedialiste suhete analüüsimisel;\n6) eraldab, kombineerib ja kirjeldab erinevaid semiootilisi modaalsusi ning analüüsib nende interaktsiooni tähenduse konstrueerimisel;\n7) suudab luua multimediaalset teksti ning hinnata autori, vastuvõtja ja konteksti mõju ja rolli teksti analüüsimisel või konstrueerimisel. The course gives an overview of the nature of semiotic issues in multimedial and performative phenomena in culture and an introduction to different semiotic means of analysis of performative (dance, theatre, rituals, bodily expression etc) and multimedial (cinema, TV, video, commercials, print media, new media etc) texts. The course gives an overview of the central problems, main perspectives, authors, approaches and methods for thinking about and analysing performative / multimedial texts, and performativity and multimediality in culture more generally.\nIn seminars various perspectives and methods are applied in discussing, constructing and analysing performative and multimedial texts."}