{"KURSUSE_NIMI": "Semiootilise analüüsi metodoloogia", "KURSUSE_KOOD": "FLSE.00.252", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "xObjectives/eesmärkid:  Semiootilise analüüsi keskne ülesanne on tuua ilmsiks tõsiasi, et kõik tajumused on vahendatud. Kõik tajud filtreeritakse läbi tõlgendava subjekti kognitiivsete, keskkondlike ja meeleliste filtrite. Niisuguse filtreerimise kirjeldust nimetatakse semiootikas modelleerimiseks, ja semiootika metodoloogia tähendabki uurida, kuidas sellist modelleerimist eri viisidel teostatakse. Semiootilise metodoloogia mõistmine lisab määra objektiivsust uurimustöödele, mis muidu võivad kalduda ebateadusliku relativismi poole. Muuhulgas on semiootiliste mudelite iseloomulikeks tunnusteks uurija suhe uurimisobjekti, vaatluste ja kirjelduste sõltuvus kontekstist ja olukorrast, verbaalsete ja mitteverbaalsete väljendite erinevad registrid, problemaatika, mis puutub kujundlike sõnumite süstemaatilisse kirjeldamisse, kunstiliste objektide eristamine mittekunstilistest, diagrammid verbaalsete ja visuaalsete väljendite ikooniliste tahkude modelleerimiseks, ja muu meediaga seonduv, kus objektiivset kirjeldust komplitseerivad vastuolulised koodid. Kursusel püütakse anda vastus küsimusele mis on semiootika, visandades talle iseloomulikud tunnused võrdleva ülevaate andmise teel.Learning outcomes/õpiväljund:  Kursuse väljundiks teha tudengitele selgeks, kuidas rakendada modelleerimise põhimõtteid kvaliteetsete esseede kirjutamisel, ettekandmisel ja loengupidamisel. Uurimisobjektide sõltuvus uurijast nõuab, et iga objektikirjeldus toob üksikasjalikult esile tema spetsiifilise konteksti, mis hõlmab, aga ei piirdu varasemate taustateadmistega, institutsionaalsete seostega, populaarsete trendidega, nagu ka teadlikult rakendatavate intellektuaalsete ja ideoloogiliste vahenditega. Lühidalt öeldes: konkreetse uurimisprojekti raames tähendab see teooria lahutamist objektist. Objekti valimine semiootilise kirjelduse tarbeks peaks olema piisavalt kitsas, et uurija suudab ammendavalt kirjeldada selle objekti kõiki asjakohaseid tahke määrani, et kõik väited, mida nende tahkude kohta esitatakse, oleksid veenvad. See käib kõikide uurimistööde kohta, kuid semiootilise analüüsi metodoloogia edukalt läbinud tudeng mõistab lisaks ka mudelite vahelisi transdistsiplinaarseid ühisjooni, mis niisuguse objektiivsuse võimalikuks teevad. Tudeng mõistab baastasandil, kuidas see põhimõte laieneb kõikidele uurimisvaldkondadele humanitaarteadustes, teemast sõltumatult, ning näeb ka, kuidas semiootika metodoloogia heidab valgust inimteaduste kasulikkusele sotsiaalsfääris."}