{"KURSUSE_NIMI": "Mentaalsuse semiootiline analüüs", "KURSUSE_KOOD": "FLSE.00.160", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 148, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Loengutes/seminarides tutvutakse kultuuride tüpologiseerimise ajaloo ja põhimõtetega ning tutvustatakse traditsiooni kui sotsiaalse edastamise mehhanismi. Antakse ülevaade kultuuri kui indiviidiülese kollektiivintellekti tekkimise põhimõtetest, selgitatakse kultuuri dünaamika toimemehhanisme. Tutvutakse tüpoloogiliste elementide organiseerumise põhimõtete ja tingimustega. Selgitatakse kultuuri(teksti) ja indiviidintellekti analoogsuse tagamaid ning arutatakse nii intellekti kui sellise kui ka tehisintellekti eelduste üle. Antakse põhjalik ülevaade erinevates kultuuritüüpides valitsevate mõttetüüpide vastastikmõjust. Selgitatakse kultuuri normide, väärtuste ja ideede (teadmise) kui modaalsuste toimimist reaalsuse erinevatel tasanditel. Tutvutakse kultuurisisese ja kultuuridevahelise kommunikatsiooni eripäradega. Lõppeesmärgiks on kultuuri, teksti, ja inimintellekti kui mõtleva(te) seadeldis(t)e erinevate operatiivsete dimensioonide tundmaõppimine.Objectives/eesmärkid:  Tutvustada mentaalsuse semiootilise analüüsi teooriat ja metodoloogiat ning kultuuriti erinevaid märgisuhteid nii keelepõhiselt kui ka lähtudes kollektiivse ja individuaalse intellekti analoogsusest. Selgitatakse kultuuri tüpologiseerimise analüütilis-metodoloogilisi põhimõtteid ning nendega seostuvaid erinevatele kultuuridele omaseid mõttetüüpe. Kursuse eesmärk on 1) mõista kollektiivse ja individuaalse intellekti analoogsuse tagamaid; 2) anda ülevaade kultuuride tüplogiseerimise ajaloost ning tutvustada teadusliku tüpologiseerimise mõistestikku; 3) selgitada tüpologiseerimise põhimõtteid ja -mõisteid kultuurisemiootika raamistikus, mis tingimustel kultuur liigitub ühe või teise tüübi alla; 4) tutvustada kultuuridega kaasnevaid mõttetüüpe, selgitada kuidas ja missugus(t)es sõltuvussuh(e)tes on kultuuritüüp mõttetüübiga.Learning outcomes/õpiväljund:  Aine läbinud mõistab kultuuridega kaasnevate mõttetüüpide erinevusi-sarnasusi ning oskab neid tüpologiseerida analüütilis-metodoloogiliselt.\n\t1) omab põhjalikku ülevaadet kultuuritüpoloogia mõistestikust, tunneb tüpoloogilise analüüsi võtteid, suutes eris \t1) omab põhjalikku ülevaadet kultuuritüpoloogia mõistestikust ja toimimisest, tunneb tüpoloogilise analüüsi võtteid, suudab eristada erinevaid kultuuri- ja mõttetüüpe iseseisvalt ning omandatud oskusi kasutada oma uurimistöös; 2) orienteerub erinevate kultuuri- ja mõttetüüpide teoreetilises mõistestikus, valdab antud paradigma terminoloogiat ning metodoloogiat; 3) suudab end (kui uurijat) paigutada oma uurimisobjektist - kultuurist ja mõtlemisest - nö. väljapoole, so. erapooletu kolmanda isiku metatasandilise positsioonile, mõistab \"erinevus(t)e\" alustalasid."}