{"KURSUSE_NIMI": "Sissejuhatus semiootika uurimismeetodeisse", "KURSUSE_KOOD": "FLSE.00.319", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatus semiootikasse", "Sissejuhatus kultuuriteooriatesse"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengutes tutvustatakse teadusliku uurimistöö üldisi põhimõtteid, antakse ülevaade semiootika metodoloogilistest alustest ning sellega seotud diskussioonidest tänapäeva semiootikas. Neid diskussioone interpreteerides vaadeldakse mõningaid semiootilise mudeldamise põhimõtteid. Tutvutakse lähemalt mõningate uurimismeetoditega semiootikas.\nSeminarides loetakse ja analüüsitakse erinevaid tekste. Selle üheks eesmärgiks on õppida tundma teadusliku teksti ülesehitust ja argumendi struktuuri ning oma eriala diskursuse implitsiitseid reegleid. Teiseks eesmärgiks on tutvuda erinevate semiootika uurimismeetoditega.\nPraktikumid ja kirjalikud tööd arendavad tudengi praktilisi vilumusi iseseisva uurimustöö läbi viimisel.Objectives/eesmärkid:  Kursuse eesmärk on (1) anda üliõpilasele esmane sissejuhatus semiootika uurimismeetodeisse ja semiootika kui distsipliini metodoloogilistesse alustesse, tutvustada semiootilise mudeldamise ja probleemipüstituse põhimõtteid; (2) tutvustada teadusliku uurimistöö põhimõtteid, uurimistööle esitatavaid nõudeid, uurimistöö eri etappe ja praktilisi võtteid: mudeldamine, hüpoteesi ja uurimisküsimuse püstitamine, probleemi piiritlemine, töö kirjandusega (sh allikakriitika põhimõtted) (3) kujundada seminarides, praktikumides, kollokviumil ja kirjalike tööde kaudu esmane vilumus teaduslikuks uurimistööks, uurimismeetodite rakendamiseks, teadustöö kirjutamiseks ja vormistamiseks edasise stuudiumi jooksul.Learning outcomes/õpiväljund:  Üliõpilane: \nTunneb teadusliku uurimistöö põhimõtteid, uurimistööle esitatavaid nõudeid, uurimistöö eri etappe ja praktilisi võtteid.\nTunneb semiootika kui distsipliini metodoloogilisi aluseid, semiootilise mudeldamise ja probleemipüstituse põhimõtteid.\nOrienteerub semiootika erinevatest teoreetilistest mudelitest lähtuvates mudeldamise ja probleemipüstituse põhimõtetes ja suudab neid omavahel võrrelda.\nOrienteerub semiootika uurimismeetodeis.\nOrienteerub semiootika erinevates rakendusvaldkondades.\nOskab mudeldada, formuleerida ja piiritleda uurimisprobleemi ja püstitada uurimisküsimust. \nTunneb ja oskab rakendada allikakriitika põhimõtteid."}