{"KURSUSE_NIMI": "Semioosi mõistmine radikaalse loovusena", "KURSUSE_KOOD": "FLSE.00.349", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus ammutab eri valdkondadest, nagu semiootika, filosoofia, matemaatika ja füüsika. Näiteks Peirce'i agapistliku evolutsiooni \"positiivsed sümpaatiad\" käiakse välja uute dünaamikate allikatena, mis on võimelised semioosi olemuslikke pingeid lahendama. Gilbert Simondoni individuatsiooni-teooria \"uudsed dimensioonid\" iseloomustavad sarnaselt radikaalset loovust. Matemaatik Giuseppe Longo radikaalne emergents aitab seda generatiivsust formaalsemalt iseloomustada, sellal kui eri mõisted füüsikast, nagu entroopia ja töö, põhistavad Peirce'i agapismi, Simondoni uudsed dimensioonid ja Longo radikaalse emergentsi.Objectives/eesmärkid:  Kursuse eesmärgiks on mõista semioosi lähtuvalt radikaalsest loovusest. Kursuse põhieelduseks on, et semioos kui adaptiivne tähendusloome peab iseend pidevalt problematiseerima katkematult kehastunud pinge teel. See nõuab, et vastavalt tuleb luua uudseid dünaamikaid nende olemuslike pingete lahendamiseks. Seda eeldades tekib küsimus: millest need uued dünaamikad tekivad? Käesolev kursus pakub tudengeile eri perspektiividest hulga vastuseid sellele küsimusele.Learning outcomes/õpiväljund:  Kursusel on kaks peamist õpiväljundit: 1) mõista põhieeldust, et semioos on kehastunud pinge, mis peab iseend pidevalt mingil moel lahendama, ja 2) pakkuda eri perspektiive, mille abil saab sellele arusaamale poolt ja vastu argumenteerida, koos vastustega sellele, kuidas niisugused iselahenevad pinged eksisteerivad semioosilises kehas. Mõlemad õpiväljundid seisnevad eri valdkondade uurimises, mis puutuvad sellesse dünaamilisse semioosiprotsessi ja tema loomuldasa generatiivsesse loomusse."}