{"KURSUSE_NIMI": "Filmisemiootika", "KURSUSE_KOOD": "FLSE.00.232", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatus semiootikasse"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate filmist kui semiootika objektist ja selle tähendusmehhanismide erinevate tasandite käsitlemisvõimalustest filmisemiootikas. Loengud jaotuvad nelja plokki: \nEsimene, sissejuhatav osa annab üldise ülevaate filmist kui semiootika objektist ja tähenduse probleemist kinos, tutvustab filmisemiootika (ja -semioloogia) ajalugu, olulisemaid suundi ja põhiterminoloogiat ning suhestab filmisemiootikat teiste filmikunsti uurimise paktikatega. \nTeine plokk on pühendatud kinomatograafiliste väljendusvahendite ning annab ülevaate kinokeele erinevatest uurimis- ja teoretiseerimisviisidest ning kesksematest analüüsimeetoditest.\nKolmas plokk annab ülevaate filmiteksti erinevatest tasanditest, tekstuaalse terviku analüüsimise viisidest, vaatleb filmikommunikatsiooni erinevaid osapooli ja neist lähtuvaid intrepreteerimisstrateegiaid ning filmi kultuuritekstina.\nNeljas plokk vaatleb filmikeele ja filmiteksti probleeme erinevate žanrite lõikes ja uurib žanri spetsiifikat valitud teemade ja näidete varal.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada filmi tähendusmehhanismide ja -tasandite erinevaid interpreteerimise ja analüüsimise võimalusi ja vahendeid semiootikas, andes ülevaate filmi semiootilistest aspektidest, erinevatest filmisemiootilistest (-semioloogilistest) käsitlustest, tutvustades tähtsamaid teoreetikuid, käsitlusi, valdkonna põhiterminoloogiat, kesksemaid analüüsimeetodeid ja mudeleid.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane teab filmisemiootika võtmeautoreid ja -mõisteid, orienteerub erinevates käsitlustes ja oskab hinnata erinevate allikate relevantsust. Oskab kasutada erinevaid filmisemiootika teooriaid, mõisteid, meetodeid ja mudeleid praktilises analüüsis. Oskab kirjeldada filmi semiootilisi aspekte, eristab erinevaid filmi tähendusmehhanisme ja uurimistasandeid, oskab käsitleda ja analüüsida nii individuaalseid mehhanisme ja tasandeid kui tekstuaalset tervikut ja selle konteksti. Tunneb filmikommunikatsiooni olemust ja erinevate osapoolte mõju tähendusele ja interpretatsiooniprotsessile. Suudab eristada erinevate žanrite spetsiifilisusi ja suhestada neid omavahel. Suhestab filmisemiootika probleeme üldsemiootikaga. Filmid tuleb vaadata iseseisvalt, auditooriumis ainult analüüsime."}