{"KURSUSE_NIMI": "Sotsiokultuurilised süsteemid ja semiootiline subjekt", "KURSUSE_KOOD": "FLSE.00.336", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse põhiteemad:\n1.\tSotsiosemiootika: aines ja ajalooline taust. (Sotsio)semiootika kui sotsiaalteadus: pragmatismi ja semioloogia positsioon.  \n2.\t'Kultuuri' ja 'ühiskonna' suhted: ajaloolis-kontseptuaalne taust. Ühiskonna ja indiviidi avastamine-tegemine. Objekt- ja metatasandi põimitus ühiskonnauuringutes.   \n3.\tInterdistsiplinaarsus meta- ja objekttasandil. Teadmiste eri liigid ja maailmad, nende ühendamise viisid.  \n4.\tObjekt, metakeel ja eelarvamus kultuuri ja ühiskonna kirjeldamises.  \n5.\tMärkide materiaalsus-psühholoogilisus-sotsiaalsus. Lõppematu semioosis, harjumus ja interpretantide põimitus.  \n6.\tSotsiaalne suhtlusakt: žestid, tähendused ja tähtsused. Objektitüübid semiootilises reaalsuses.  \n7.\tSemiootiline mina.\n8.\tSemiootiline kompetentsus. Ratsionaalsus ühiskonnas.Objectives/eesmärkid:  Kursus annab ülevaate sotsiosemiootikast interdistsiplinaarsuse ajajärgu|,ja tutvustab sotsiosemiootika kui interdistsiplinaarse suuna seoseid üleüldise sotsiaalhumanitaarteadusliku transdistsiplinaarsusega. Vaadeldakse sotsiaalteaduslikke metoodeid ja põhimõtted sotsiosemiootikas. Suhtluse uurimise põhiseisukohad sotsiosemiootikas. Kommunikatsioonisüsteemide struktuur ja funktsioon ühiskonnas. Indiviidi arengu staadiumid võrrelduna nende eritlemisega psühholoogia, sotsioloogia jm ühiskonnadistsipliinide raames. Tuuakse näiteid nendest objekt- ja metatasandi vahelistest seostest, mis on teadusliku mõtte arengut mõjutanud ning viinud sotsiosemiootika tekkeni. Fookuses on, et sotsiosemiootika ei keskendu individualiseeritud objektidele, vaid tegeleb pigem kompleksiga'inimene-kultuur-ühiskond-keskkond'.Learning outcomes/õpiväljund:  Õppeaine läbinu:\n1) omab teadmisi semiootilisest ja semioloogilisest paradigmast, mis viisid\nsotsiosemiootika tekkeni;\n2) on võimeline kriitiliselt hindama sotsiosemiootikaks nimetatud uurimusi ning\nvõrdlema/eristama neid sotsiosemiootikast kui teaduslikust paradigmast;\n3) mõistab semiootikat kui sotsiaalteaduslikku distsipliini ja evib teadmisi\nsotsiaalteadusliku semiootilise uurimuse läbiviimise põhitõdedest."}