{"KURSUSE_NIMI": "Sotsiosemiootika ja sotsiaalteooriad", "KURSUSE_KOOD": "FLSE.00.262", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Peamisteks käsitletavateks teemadeks on: sotsiosemiootika positsioon semiootikas ja selle seoseid muude ühiskonnateadustega; „sotsiosemiootika\" semiootilised lähtekohad; „semiootiliselt reaalne maailm\" ja „sotsiaalselt konstrueeritud reaalsus\"; tähenduslike struktuuride tekitamine ühiskonnas; kultuurinähtuste „suhtlus\" ühiskondliku kontekstiga; kommunikatsioon kui ühiskondlik-kultuurilisi süsteeme kooshoidev nähtus; ühiskonna tähenduslike struktuuride uurimisvõimalused.Objectives/eesmärkid:  Loengus osalejad saavad teadmise semiootilise mõtte arengust seotuna muude humanitaar- ja sotsiaalteadustega 19. sajandi lõpul ja 20. sajandi alguses ning põhjustest, mis viisid semiootika ja semioloogia lahknemisele. Arusaam sellest lahknemisest võimaldab mõista vastavaid eri objektivalikuid. Arusaam semiootilisest üldisest trendist, mis lahknes muudest sotsiaalteadustest pärast võimalikust ühendatud teaduste loomisest loobumist võimaldab tunnetada neid metodoloogilisi erisusi, mis tekkisid muude sotsiaalteadustega. Teisalt peab kujunema arusaam semiootika positsioonist kaasaja sotsiaal- ja humanitaarteaduste põhimõttelistes metodoloogilistes võimalustes. Semiootika paradigmaatiliste ja metodoloogiliste võimalustele ja probleemidele lähenetakse semiootilise reaalsuse loomise ja alalhoidmise analüüsimise eri mooduste tutvustamise abil.Learning outcomes/õpiväljund:  1)\tomab teadmisi semiootilisest ja semioloogilisest paradigmast, mis viisid sotsiosemiootika tekkeni;\n2)\t on võimeline kriitiliselt hindama sotsiosemiootikaks nimetatud uurimusi ning võrdlema/eristama neid sotsiosemiootikast kui teaduslikust paradigmast;\n3)\tmõistab semiootikat kui sotsiaalteaduslikku distsipliini ja evib teadmisi sotsiaalteadusliku semiootilise uurimuse läbiviimise põhitõdedest. In the case of need, two seminars can be arranged on compulsory literature, one in the mid-semester and one at the end. That can be done on the basis of students' need."}