{"KURSUSE_NIMI": "Sissejuhatus muusikasemiootikasse", "KURSUSE_KOOD": "FLSE.00.295", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Teemad:\n1. Mis on muusika ja mida muusika 'tähendab'?\n2. Miks on muusika konkreetsest mõjust/tähendusest kuulajale nii keeruline konkreetselt kõneleda?\n*\tErinevad muusikalised kompetentsused: loojapoolne (poieetiline), vastuvõtjapoolne (esteesiline), intertekstuaalne, metakontekstuaalne\n*\tKriitiline ülevaade olemasolevatest semiootilistest lähenemistest muusikale\n3. Muusikalised väljendusvahendid\n4. Musemaatiline analüüs\n*\tMuusikalise märgi tüpoloogia\n*\tAnafoonid (helilised, kineetilised, taktiilsed); žanrisünekdohhid; episoodilised markerid; stiili-indikaatorid\n*\tVokaalne persona\n*\tMuusika kui muusika enda 'metakeel': intersubjektiivne ja interobjektiivne meetod; kommutatsioonitestid; muusikaline ja paramuusikaline konnotatsioon\n5. Süvamuusika, levimuusika, filmimuusikaObjectives/eesmärkid:  Kursuse eesmärgiks on pakkuda teoreetilist ja praktilist alust mõistmaks muusikat kui üht inimkonnale omast sümboolset suhtlusvormi. Kursuse käigus:  *\tarendatakse muusika teadlikku kuulamisoskust; *\tvaadeldakse, mil moel on muusika struktuurilised omadused seotud selle erinevate psühholoogiliste, ühiskondlike, kultuuriliste ja ideoloogiliste väljendustega; *\tjulgustatakse tudengit muusikast mõtlema ja muusikat mõtestama selle erinevates ilmumiskontekstides (süvamuusika, levimuusika, filmimuusika); *\tõpitakse suhestama omaenda isiklikke muusikaelamusi üldisemate muusikast mõtlemise suundadega.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng 1. oskab muusika tähendustamisel kasutada erinevaid kursuse käigus käsitletud mõisteid ja meetodeid; 2. teadvustab erinevate muusikaliste ja paramuusikaliste tegurite mõju muusikalise tähenduse kujunemisel;  3. omab ülevaadet erinevatest semiootilistest lähenemistest muusikale kui analüüsiobjektile; oskab nimetada olulisemaid autoreid ja tekste."}