{"KURSUSE_NIMI": "Käsitöö, kodunduse ja kunstiõpetuse didaktika", "KURSUSE_KOOD": "HTHT.02.015", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Eritehnikad kunstiõpetuses", "Toiduainete keemia", "Lõngatööde metoodika", "Toiduvalmistamise tehnoloogia", "Käsitöö ja kodunduse alused", "Rõivaste ajalugu ja õmblemise tehnoloogia", "Värvi-, kompositsiooni- ja perspektiiviõpetus"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 20, "seminar": 10, "independent_work": 72, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel tutvustatakse käsitöö, kodunduse ja kunstiõpetuse didaktika põhialuseid. Tutvutakse käsitöö, kodunduse ja kunstiõpetuse õpetamise ajalooga, erinevate õpetamismeetoditega, õpikeskkonnaga jne. Käsitletakse vasakukäeliste ja erivajadustega laste õpetamist.Objectives/eesmärkid:  Üldeesmärgiks on saada põhilised ainedidaktilised teadmised käsitöö ja kodunduse ning kunstiõpetuse tundide läbiviimiseks II ja III kooliastmes.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud üliõpilane:\n1. omab ülevaadet käsitöö ja kodunduse ning kunsti ainekavast, oskab kirjeldada selle seost üldosaga ning tuua näiteid õppeainete ja läbivate teemade lõimimispõhimõtete kohta;\n2. oskab koostada ja kasutada erinevaid õppematerjale ning analüüsida neid;\n3. mõistab õppimise olemust, on teadlik selle toetamise võimalustest;\n4. oskab kavandada ja analüüsida käsitöö ja kodunduse ning kunsti tunde II ja III kooliastmes, kasutades teadmisi õppeprotsessist, ainetunni planeerimisest, kaasaegsete õpimeetoditest, -stiilidest õppetöös ning pidades silmas õpikeskkonna võimalusi;\n5. omab ainedidaktilisi teadmisi käsitöö ja kodunduse ning kunsti õppeainete õpetamiseks, suutes neid selgelt ja loogiliselt formuleerida nii kõnes kui kirjas;\n6. oskab ennast ja oma tegevust aineõpetajana mõtestada ning suudab lõimida õpetaja läbivaid kompetentse aine- või valdkonnaspetsiifilise õppetööga."}