{"KURSUSE_NIMI": "Akadeemilise teksti loomine", "KURSUSE_KOOD": "HTOS.02.486", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 156, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "E-kursuse ülesehitus ja tegevused toetavad üliõpilasi oma bakalaureuse- või magistritöö kirjutamisel. Kursusel antakse ülevaade teadusteksti struktuurist, stiilist, keelest; õpetatakse defineerima mõisteid/termineid; kasutama korrektselt APA viitamist; sõnastama eesmärke ja hüpoteese; tegema üldistusi joonistest/ diagrammidest/ tabelitest. Keskendutakse oskusele integreerida oma ja teiste autorite mõtteid, analüüsida ja argumenteerida; kirjutada resümeed ja lõppsõna. Teoreetiline materjal on toetatud autentsete näidetega, rohkete praktiliste harjutuste ja nõuannetega. Ülesanded võimaldavad üliõpilastel keskenduda oma bakalaureuse- või magistritöö kirjutamisele/ parandamisele/ viimistlemisele. Kõik loengumaterjalid, iseseisva töö juhendid, diskussiooni küsimused, harjutused ja hinnatavad testid esitatakse Blackboard Learning System  keskkonnas. Foorumites analüüsitakse erialaseid teadusartikleid, näiteid bakalaureuse- ja magistritöödest, sooritatakse harjutusi.\r\n\r\nKursus on jaotatud neljaks mooduliks.\r\n1. Teadusteksti struktuur ja kompositsioon\r\n2. Kirjandusallikate kasutamine ja viitamine\r\n3. Teaduslik diskussioon, definitsioonid ja terminid haridusteaduslikes tekstides\r\n4. Akadeemiline keel ja stiilObjectives/eesmärkid:  Üldeesmärk on valmistada alus- ja alghariduse õppekava üliõpilasi ette kirjutama bakalaureuse-  ja magistritööd, lähtudes haridusvaldkonna teadustraditsioonidest ja standarditest.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane järgib haridusteadustes väljakujunenud akadeemilise kirjutamise tavasid, teadustöö kompositsiooni ja vormistamise nõudeid, juhindub normeeritud viitamisest (APA manual 6th Edition, 2009). Ta on omandanud oskuse hinnata erialase kirjanduse relevantsust, koostada sidusat integreeritud teadusteksti, esitada terminoloogiliselt korrektselt ja stiilselt oma ideid ning kasutada eetiliselt teiste autorite mõtteid. Läbinud kursuse, vormistab üliõpilane oma bakalaureuse- või magistritöö, lähtudes alus- ja alghariduse erialal kehtivatest teadustöö sisulistest ja vormilistest nõuetest."}