{"KURSUSE_NIMI": "Teadusliku uurimistöö alused", "KURSUSE_KOOD": "HVAJ.00.013", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine HVAJ.00.013 toimub kolmes osas. \n\n2024/2025 sügissemestril õpetatav I osa on suunatud 2024. sügisel ajalooõpinguid alustanud tudengitele: vastavast auditooriumist lähtub nii õppeaine temaatiline ülesehitus kui kontakttundide ajakava. Õppeaines tutvustatakse professionaalse ajalooteaduse olemust, antakse ajalooteaduslikuks uurimistööks vajalikud alusteadmised ning õpetatakse ja harjutatakse erialaseks tööks vajalikke baasoskuseid. Need on teadmised, oskused ja hoiakud, mis on hädavajalikud iga erialase akadeemilise teksti (sh: akadeemilise essee, referaadi, uurimuse) kavandamiseks, kirjutamiseks ja vormistamiseks. \n\nÕppeaine II ja III osa on toimuvad vastavalt 2024/2025 sügis- ja kevadsemestril ja on mõeldud aine I osa positiivsele tulemusele läbinud üliõpilastele. 2024/2025 sügissemestril õppeainesse (HVAJ.00.013, 2. osa) registreerides valib üliõpilane endale rühma ja juhendaja(d). Ainekursuse II ja III osa raames kirjutab üliõpilane juhendajaga kooskõlastatud teemal uurimistöö. Juhendamiskohtumiste toimumise viis ja aeg lepitakse igas rühmas reeglina kokku vastava semestri alguses (II osa - september 2024, III osa - veebruar 2025). Lisainfo saamiseks tuleb pöörduda vastava juhendaja poole.Objectives/eesmärkid:  Õppeaine eesmärgid:\n\nI osa\n1. anda alusteadmised ajalooteadusliku uurimistöö olemusest ja eripäradest võrreldes teiste teadusdistsipliinidega;\n2. anda ülevaade olulisematest erialastest teadusandmebaasidest ning õpetada ja harjutada nende kasutamist;\n3. anda teadmised olulisematest allikaliikidest ja erinevatest ajalookirjutuse žanridest;\n4. selgitada ja õpetada erinevate allikaliikide eristamise põhimõtteid;\n5. selgitada ja õpetada primaarsete ja sekundaarsete allikate kriitilise hindamise põhimõtteid;\n6. selgitada ja õpetada ajalooteaduslikule uurimistööle esitatavaid eetilisi nõudeid;\n7. selgitada ja õpetada ajalooteaduslikule akadeemilise teksti sisule ja vormile kehtivaid nõudeid.\n\nII ja III osa\n1. süvendada ja kinnistada ajalooteadusliku uurimistöö kirjutamiseks vajalikke hoiakuid, teadmiseid ja oskuseid;\n2. õpetada ja arendada erialaspetsiifilise iseseisva uurimistöö kavandamise ja läbiviimise oskust;\n3. kinnistada teadmiseid ajalooteaduslikule uurimistööle esitatavatest eetilistest nõuetest, sh kohustusest teadlikult hoiduda võltsingutest ja plagiaadist;\n4. anda üliõpilasele kogemus erialaspetsiifilise uurimistöö kavandamiseks, läbiviimiseks ja korrektseks vormistamiseks.Learning outcomes/õpiväljund:  Õppeaine I osa edukalt läbinud üliõpilane:\n\n1. mõistab akadeemilise ajalooteadusliku uurimistöö olemust ja eripärasid võrreldes teiste teadusdistsipliinidega;\n2. on kursis olulisemate erialaste teadusandmebaasidega ning oskab neid kasutada;\n3. oskab kriitiliselt hinnata sekundaarsete ja primaarsete allikate kohasust nende kasutamiseks akadeemilises uurimistöös;\n4. oskab eristada erinevaid erialaseid teaduslikke ja populaarteaduslikke tekste;\n5. oskab hinnata teksti vastavust akadeemilise kirjutise reeglitele;\n6. teab ajalooteaduslikule uurimistööle kehtivaid eetilisi nõudeid ja oskab neid erialases töös rakendada;\n7. teab akadeemiliste tekstide sisule ja vormile kehtivaid nõudeid ja oskab neid teadmisi erialases töös kasutada.\n\nÕppeaine II ja III osa edukalt läbinud üliõpilane:\n\n1. on omandanud ajalooteadusliku uurimistöö kirjutamiseks vajalikud hoiakud, teadmised ja oskused;\n2. on omandanud oskuse kavandada ja kirjutada erialaspetsiifilist iseseisvat uurimistööd;\n3. on omandanud oskuse esitada ja vormistada oma uurimistulemusi vastavalt teaduseetika reeglitele."}