{"KURSUSE_NIMI": "Rahvusvahelise ajaloo seminar", "KURSUSE_KOOD": "HVAJ.06.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Rahvusvahelise ajaloo seminar pakub narratiive ja tõlgendusi ajaloost, aidates kaasa tänapäeva rahvusvahelise poliitika paremale mõistmisele. Seminar vahendab paremaid teadmisi ja uuemaid uurimissuundi välispoliitika ja diplomaatia ajaloo, rahvusülese ja rahvusvahelise ajaloo, imperiaalse ja globaalse ajaloo, samuti Lähis-Ida, Aasia, Põhja-Ameerika ning teiste regioonide uuringutest.\n\nRahvusvaheline ajalugu kasvas välja 19. sajandil õitsema puhkenud diplomaatia ajaloost ja oli seotud rahvusriikide kujunemisega maailmaajaloo põhitegijaiks. 1960.-1970. aastatel ülikoolides kanda kinnitanud distsipliin käsitles rahvusvahelise elu laia spektrit: diplomaatia, välispoliitika ja sisepoliitika seosed, kaubandus, propaganda, strateegia ja luure. Keele-, kultuuri- jms pöörded ühiskonnateadustes sundisid aga valdkonda kaitseseisundisse: selgitada tuli nii konservatiivseid arhiivipõhiseid uurimismeetodeid kui ka keskendumist riigimeestele, diplomaatidele ja ametnikele. Transnatsionaalne ja globaalne ajalugu seadsid kahtluse alla riigi rolli keskse toimijana. Tänapäeva sündmused on aga kinnitanud rahvusvahelise ajaloo jätkuvat olulisust rahvusvahelise poliitika mõistmisel.\n\nRahvusvahelise ajaloo seminarid defineerivad oma ainest laialt ning käsitlevad interdistsiplinaarselt. Uurime nii diplomaatiat, välispoliitikat, kultuuri- ja ideedevahetust, rahvusvahelist majandust, regionalismi, propagandat, luuret, strateegiat, sõjaajalugu jpm. Kuigi põhirõhk on 20. ja 21. sajandil, tunneme huvi ka varasemate perioodide vastu. Seminaridel esinevad nii oma õppejõud Tartu Ülikoolist kui ka teistest Eesti kõrgkoolidest ja välismaalt. Võimaluse oma teadustööd tutvustada saavad üliõpilasedki. Samuti kutsutakse esinema välispoliitika praktikuid ja eksperte. Seminari formaat võib olla nii klassikaline ettekanne kui ka vestlus, arutelu, mäluseminar vms.Objectives/eesmärkid:  'Learning outcomes/õpiväljund:  '"}