{"KURSUSE_NIMI": "Aktuaalseid küsimusi keskaja ajaloost", "KURSUSE_KOOD": "HVAJ.07.033", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 6, "seminar": 2, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursus \"Habsburgide võim: ajalugu, kultuur, kunst\" käsitleb Habsburgide rolli Euroopa juhtiva dünastiaga 15. sajandi lõpus ja 16. sajandi esimesel poolel. Lisaks ülevaatele Habsburgide poliitilisest süsteemist ja võimupoliitika erinevatest aspektidest pööratakse tähelepanu isiklike sidemete, valitseja õukonna ja seal eksponeeritud kunstiteoste rollile diplomaatilises suhtluses ja võimuteostuses. Habsburgide õukonda võib pidada eeskujulikuks näiteks tolleaegse Euroopa õukonnakultuurist, mille oluliseks tahuks oli kunst ja kultuur rakendamine valitseja ideoloogilise programmi teenistuses.Objectives/eesmärkid:  - Ülevaate andmine Habsburgide dünastia ajaloost ja selle olulisimatest monarhidest 15. sajandi lõpul ja 16. sajandi I poolel. - Tutvustada Habsburgidest monarhide, eelkõige Maximilian I ja Karl V, poliitilist, ühiskondlikku ja kultuurilist tegevust. - Tutvustada Habsburgide poliitilist võimusüsteemi ja poliitikat ning selle seoseid õukonnaelu ja kultuurilise tegevusega. - Arendada ajalooalaste teaduslike tekstide mõistmise ja analüüsimise oskust. - Arendada primaarallikate lugemise, mõistmise ja analüüsimise oskust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: - On tuttav Habsburgide dünastia poliitika põhijoontega. - Tajub eelmodernsele ühiskonnale omase personaalsetel suhetel põhineva poliitilise süsteemi põhiolemust. - Teadvustab õukondliku hiilguse seotust valitseja poliitilis-diplomaatilise võimekusega. - Omab ettekujutust Habsburgide õukonnakultuurist, kus luksusesemed, mida sageli kasutati ideoloogilistel eesmärkidel, mängisid olulist rolli. - On teadlik esemete ja kunstiteoste rollist poliitilise instrumendina. - Omab isiklikku kogemust ajalooalaste teadustekstide mõistmisel ja analüüsimisel. - Omab isiklikku kogemust primaarallikate lugemisel, mõistmisel ja analüüsimisel."}