{"KURSUSE_NIMI": "Diplomaatiline protokoll ja tseremoniaal Eestis 20. sajandil", "KURSUSE_KOOD": "HVAJ.03.026", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus algab ülevaatega diplomaatilise protokolli ja riiklike tseremooniate valdkonna kujunemisloost ning käsitleb võrdlevalt diplomaatilise etiketi reeglite, tseremooniameistrite ja protokolliülemate institutsioonide väljakujunemist Esimese maailmasõja alguseks. Seejärel vaadeldakse valdkonna omaksvõttu ja arengut iseseisvas Eestis (1918-1940) võrdlevalt lähinaabruses toimunud arengutega. Kursus vaatleb ja analüüsib põhjalikumalt Eesti protokolliteenistuse kujunemislugu ja diplomaatide, eriti protokolliülemate rolli rahvusvaheliste reeglite juurutamisel. Eraldi tuleb juttu välisriikide diplomaatiliste ja konsulaaresinduste eesõigustest, välissaadikute saabumise ja lahkumise ning teiste kõrgemate riigitegelaste ametlike visiitide puhul korraldatud tseremooniatest. Vaatleme põhjalikult valdkonna eest vastutanud ametiisikute, eriti protokolliülemate tegevust ja mõju Välisministeeriumis. Eraldi küsimusena võetakse vaatluse alla küsimus, kas ja kuivõrd mõjutas välispoliitilise ja kultuurilise orientatsiooni küsimus diplomaatilise protokolli reegleid Eestis ning milliste riikide vastavat praktikat Eestis kui äsja iseseisvunud riigis uuriti ja arvestati. Okupeeritud Eesti (1940-1991) kontekstis vaadeldakse, millist rolli etendasid diplomaatilise protokolli ja tseremoniaali valdkonnas okupatsioonivõimu kohalikud instrumendid, sh ENSV Välisasjade Rahvakomissariaat (ENSV Välisministeerium), ja milliseid valdkonnaga seotud probleeme tuli paguluses lahendada Eesti riiklikku järjepidevust kandnud Eesti välisesindajatel. Kursuse lõpetab ülevaade valdkonna taassünnist ja arengust iseseisvuse taastanud Eestis 1990. aastatel.Objectives/eesmärkid:  Kursus annab ülevaate diplomaatilise protokolli ja riiklike tseremooniate teoreetiliste lähtekohtade ning praktika kujunemisest Euroopas 20. sajandi alguseks ning omaksvõtust Eesti Vabariigis (1918-1940). Käsitlemist leiavad ka kokkupuuted diplomaatilise protokolli valdkonnaga okupeeritud Eestis ja paguluses (1940-1991) ning uus algus iseseisvuse taastanud Eestis. Lisaks teoreetiliste lähtekohtade ja minevikusündmuste analüüsile antakse sõna valdkonnas viimastel kümnenditel tegutsenud praktikutele.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\nÕppeaine läbinud õppija saab tervikliku ülevaate diplomaatilise protokolli ja riiklike tseremooniate kujunemisloost ning oskab näha järjepidevust ning katkestusi mujal levinud praktika ning Eestis juurdunud reeglite ja kommete vahel. Lisaks sellele oskab kursuse läbinu analüüsida diplomaatilises protokollis 20. sajandi algusega võrreldes toimunud muutusi ning nende tagamaid. See, omakorda, aitab paremini hoomata arenguid 20. sajandi diplomaatias ja kombestikus ning paremini mõista tänagi kehtivate reeglite kultuurilisi tagamaid"}