{"KURSUSE_NIMI": "Keskaegse Euroopa kirjakultuur", "KURSUSE_KOOD": "HVAJ.07.020", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Keskaeg"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 4, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 80, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursus annab ülevaate keskaja Euroopa kirjakultuuri peamistest arenguetappidest ja keskaegse kirjasõna uurimise ja kasutamise võimalustest. Käsitletakse olulisemaid mälestisi nende ajaloolises kontekstis ning tutvustatakse nende uurimise võimalusi (sh uurimislugu) ja metodoloogiat. Lähema vaatluse all on keskaegse kirjakultuuri eripärad ja kirjasõna roll keskaegses ühiskonnas, eriti suhestatuna kaasaja ühiskondlike, religioossete ja poliitiliste arengutega.Objectives/eesmärkid:  1. anda süsteemne ülevaade kirjakultuuri arengust keskaegses Euroopas;\n2. tutvustada ja selgitada keskaja kirjakultuuri eripärasid ja kirjasõna peamiseid funktsioone;\n3. tutvustada keskaja kirjakultuuri eri vorme ja kirjasõna anrilise jaotuse võimalusi;\n4. tutvustada keskaja kirjasõna olulisi mälestisi ja nende uurimislugu ning nende ajalooallikana kasutamise võimalusi;\n5. õpetada erialast terminoloogiat ning selle aktiivset kasutamist kõnes ja kirjas.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. tunneb keskaegse Euroopa kirjakultuuri arenguloo põhilisi etappe nende üldajaloolises kontekstis;\n2. tunneb keskaegse kirjakultuuri, sh kirjasõna eripärasid ja oskab neid arvestada keskaegsete tekstide kasutamisel ja tõlgendamisel;\n3. oskab identifitseerida keskaja kirjalikke allikaid ning suudab neid tõlgendada kaasaja kontekstis;\n4. tunneb keskaja kirjasõna olulisemaid mälestisi, oskab määratleda nende anrilist kuuluvust ja analüüsida neid ajaloolises kontekstis;\n5. valdab olulisemat ainespetsiifilist ja allikaomast terminoloogiat ning oskab seda erialases töös rakendada;\n6. on omandanud oskuse kasutada ainespetsiifilisi teadmisi ja oskussõnavara kirjaliku töö koostamisel ja suulises ettekandes. Alternatiiv õppeainele HVAJ.07.002 Üldajaloo seminar."}