{"KURSUSE_NIMI": "Uurimistöö kirjutamise alused", "KURSUSE_KOOD": "HVEE.01.005", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Akadeemiline eesti keel"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aines keskendutakse eestikeelse uurimistöö kirjutamisele, lähtudes protsessipõhise tekstiloome põhimõtetest. Üliõpilane õpib, kuidas\n- teha eeltööd, sh piiritleda uurimisteemat, otsida teadusteavet, rakendada lugemisvõtteid;\n- kirjutada mustandit, sh korrektselt refereerida ja viidata ning viiteid automaatselt vormistada;\n- anda kaasõppijale tekstide kohta tõhusat tagasisidet ja teha saadud tagasiside põhjal oma kirjutamisprotsessis muudatusi;\n- teha rühmatööd, mis toetab kirjutamist;\n- vormistada teksti arvutiga.\n\nTeemad: kirjutamisprotsess, kirjutamistõrge, uurimisväli, infootsing, allikakriitilisus, pind- ja süvalugemine, refereerimine, tsiteerimine, lõigu ülesehitus, lausestus, sõnakasutus (sh stiil), endale kui kirjutajale osutamine\n\nKursusele oodatakse eelkõige bakalaureuseõppe teise ja kolmanda aasta üliõpilasi, et pakkuda neile praktikumide ja kirjutamisrühmade kaudu uurimistöö kirjutamisel tuge.Objectives/eesmärkid:  Aine eesmärk on arendada üliõpilaste kirjutamis- ja lugemisoskust, et toetada neid iseseisva teadustöö tegemisel.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - juhindub hea teadustava põhimõtetest; - kavandab tõhusalt oma kirjutamisprotsessi (sh eesmärgid, ajakava); - kasutab asjakohaseid infootsinguvõtteid ja hindab teabeallikaid kriitiliselt; - rakendab teadusteksti lugemisel pind- ja süvalugemisvõtteid; - viimistleb ja vormistab teksti, tuginedes keelehooldeallikates jm esitatud juhistele; - järgib teadusteksti keele- ja stiilinõudeid nii tervikteksti, lõigu, lause kui ka sõna tasandil."}