{"KURSUSE_NIMI": "Keel, sugu ja seksuaalsus", "KURSUSE_KOOD": "HVEE.00.041", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus keskendub keele, soo ja seksuaalsuse seoste uurimisele, pakkudes ülevaadet nii ajaloolistest kui ka kaasaegsetest lähenemistest. Arutame, kuidas keel mõjutab ühiskondlikke arusaamu soost ja seksuaalsusest ning millist rolli mängib keel sooliste ja seksuaalsete identiteetide ja stereotüüpide kujunemisel. Uurime ka peamisi teooriaid, mille kaudu keele, soo ja seksuaalsuse uurimist raamistatakse, keskendudes soo väljendustele Lääne kultuuris. Käsitletavate teemade hulka kuuluvad institutsionaalne keel ja võim; sooidentiteet, seksuaalsus ja keelekasutus; soo ja keele ideoloogiad; \"mehelikkuse\" ja \"naiselikkuse\" kultuurilised määratlused ja nende seos keelekasutusega; ning sooliste ja seksuaalsete identiteetide sotsiaalne konstrueerimine keele kaudu.\nKursus on interdistsiplinaarne, lõimides keeleteaduse, kirjandusteaduse, kultuuriuuringute ja meediauuringute lähenemisi, et mõista keele rolli identiteetide kujundamises ja normide loomises. Formaadilt on tegu seminaridega, milles on ka väike loenguosa.Objectives/eesmärkid:  Kursuse peamine eesmärk on ärgitada õppijaid analüütiliselt mõtlema soost, seksuaalsusest ja keelest ning iseäranis nendevahelistest suhetest. Kursus pakub fakte, teooriat ja analüütilisi tööriistu, et kriitiliselt hinnata keele, soo ja seksuaalsuse vahelisi suhteid ühiskonnas. Kriitilise mõtlemise all peame silmas millegi kohta otsuste langetamist, toetudes analüütilisele hinnangule selle tugevustest ja nõrkustest ning oskusest valida sobiv raamistus. Lisaeesmärk on arendada uue materjali kokku võtmise ja esitamise oskusi ning aruteluoskusi.\nKursus on mõeldud eelkõige magistritudengitele, aga on avatud ka teistele õppeastmetele. Oodatud on kõikide humanitaaralade üliõpilased, sh keeleteadus, kirjandusteadus, tõlkeõpetus jm, aga ka humanitaarainete õpetajakoolituse üliõpilased. Sobib potentsiaalseks vabaaineks.Learning outcomes/õpiväljund:  1.         Oskab luua seoseid soo ja seksuaalsuse ühiskondliku ja privaatse olemuse vahel.             2.         Selgitab ajaloolist ja teoreetilist arengut keele, soo ja seksuaalsuse uuringute valdkonnas.             3.         Mõistab keele rolli soolise ja seksuaalse identiteedi kujunemisel.             4.         Oskab analüüsida kaasaegses ühiskonnas soo ja seksuaalsuse esitust, kasutades asjakohast terminoloogiat ja kriitilist mõtlemist.             5.         Tunneb ära stereotüübid, mille kaudu soo ja seksuaalsuse norme avalikes tekstides võimendatakse.             6.         Reflekteerib omaenda hoiakute üle seoses soolise ja seksuaalse identiteediga ning mõistab nende mõju.             7.         Teab eri keelte sõnavara kasutusvõimalusi soo ja seksuaalsuse väljendamisel ning oskab analüüsida, kuidas sõnavara annab edasi sotsiaalset informatsiooni sugude kohta.             8.         Oskab osaleda grupiaruteludes, rakendades kursusel omandatud teadmisi ja toob esile näiteid kursuse sisust ja kirjandusest.             9.         Oskab pidada lühiettekannet ja esitada ettekandjale asjakohaseid küsimusi.             10.       Oskab kirjutada analüüsi/arvustust ja arutelukokkuvõtet. Aine sobib HVEE.01.027 Erikursus eesti keelest asendamiseks."}