{"KURSUSE_NIMI": "Eesti keele kui teise keele omandamine", "KURSUSE_KOOD": "HVEE.05.003", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Akadeemiline eesti keel võõrkeelena"], "SOOVITUSLIKUD_EELDUSAINED": ["Eesti keele lauseõpetuse praktiline põhikursus"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel käsitletakse teise keele omandamise problemaatikat, lähtudes täiskasvanud keeleõppijast, fookuses on eesti keele kui teise keele omandamise eripära ja senised uurimistulemused. Käsitlemist leiavad järgmised teemad: \n- teise keele omandamise põhimõisted; \n- olulisemad keeleõppemeetodid; \n- teise keele omandamise teooriad; \n- õppija emakeele mõju teise keele omandamisele; \n- teise keele omandamise uurimisvõimalused; \n- keelevead ja veaanalüüs, kirjalik õppijakeel; \n- keeleoskuse areng, CAF-triaad (keerukus, täpsus, sujuvus); \n- interaktsiooni roll teise keele omandamisel, suhtlusstrateegiad, suuline õppijakeel; \n- õppijate erinev edukus teise keele omandamisel, õppijakeele kivinemine, motivatsioon.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada täiskasvanud õppija teise keele omandamise seaduspärasusi eesti keele kui teise keele kontekstis, anda ülevaade eesti keele kui teise keele alastest uurimustest, õpetada eesti keele kui teise keele õppija keelekasutuse eripära ja arengut analüüsima.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane -\ttunneb teise keele omandamise põhimõisteid; -\tomab ülevaadet olulisematest keeleõppemeetoditest ja teise keele omandamise teooriatest; -\ttunneb teise keele omandamise uurimise viise ja on kursis eesti keele kui teise keele omandamise alaste uurimustega; -\ttunneb teise keele omandamist mõjutavaid tegureid; -\tseostab õpitut eesti keelega ning oskab kirjeldada ja analüüsida eesti keelt teise keelena õppija keelekasutuse eripära ja arengut."}