{"KURSUSE_NIMI": "Kvantitatiivse andmeanalüüsi alused humanitaarteadlastele ja rakendustarkvara R", "KURSUSE_KOOD": "HVEE.00.044", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus R-i ja andmestruktuuridesse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 34, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel tutvutakse kvantitatiivsete andmeanalüüsi meetoditega, kasutades tarkvara R. Kursuse sihtgrupp on humanitaar- ja sotsiaalalade tudengid. Tutvutakse statistilise mudeldamisega humanitaarias, eelkõige tekstiandmeid kasutades. Esmalt antakse ülevaade mudeldamisstrateegiatest ning statistilise mõtteviisi alustest. Seejärel keskendutakse kvantitatiivse analüüsi ja mudeldamise olulisematele meetoditele: regressioonile, klassifikatsioonile ja hüpoteeside kontrollimisele. Lisaks tutvustatakse keerukamate meetodite, nagu näiteks mitmetasemeliste mudelite kasutamist.Objectives/eesmärkid:  Aine eesmärgiks on tutvustada kvantitatiivsete meetodite kasutamist humanitaaralade tudengitele, kelle uurimistöö seondub eelkõige keele ja tekstiga. Kuna kursusel käsitletud meetodeid saab rakendada mis tahes humanitaaria valdkonnale, ei eeldata teadmisi lingvistikast. Kursusel keskendutakse eelkõige selliste andmehulkade süstemaatilisele analüüsile, mis on (pelgalt) kvalitatiivsete meetodite rakendamiseks liiga suured. Keeleandmete puhul võivad uurimise all olla seega näiteks tekstid, sõnad, laused, sagedusloendid korpustest või katselised andmed.  Õpetatakse tarkvara R (ja selle laienduse, RStudio) kasutamist, mis võimaldab neid analüüsimeetodeid rakendada, tulemusi visualiseerida ja replitseerida. Samuti omandavad tudengid kursuse käigus statistika põhialused.Learning outcomes/õpiväljund:  Aine läbinu: - on omandanud statistilise mõtteviisi alused - on omandanud tarkvara R kasutamise oskuse vähemalt algtasemel ning suudab andmestikke R-i keskkonda importida - oskab vastavalt andmetele valida ja kasutada lihtsamaid kirjeldavaid statistikuid, statistilisi teste ja andmete visualiseerimise meetodeid - mõistab, et kvantitatiivsete meetodite rakendamiseks ei ole tarvis tingimata numbrilisi andmestikke - mõistab, mis on vahet valimil ja populatsioonil, protsendil ja absoluutsel sagedusel, korrelatsioonil ja põhjuslikkusel - on uurinud vähemalt üht analüüsimeetodit süvitsi, rakendanud seda oma (või ette antud) andmetele ning oskab selle tulemusi valideerida, visualiseerida ja interpreteerida. Kursuse materjalid ja kodutööd on Moodle'is ning neid uuendatakse vähemalt igal esmaspäeval ja kolmapäeval. \nKõikidele küsimustele vastatakse Moodle'i foorumis ning ka meilitsi."}