{"KURSUSE_NIMI": "Keeleõppe tandemkursus II", "KURSUSE_KOOD": "HVEE.05.050", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Keeleõppe tandemkursus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 10, "independent_work": 42, "individual_work": 26, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus toimub üliõpilaste paaristööna. Eri emakeeltega üliõpilased moodustavad keeleõppetandemid, mille kumbki liige õpetab teisele liikmele oma emakeelt ja õpib ise oma paarilise emakeelt. Üks tandemis õpitavatest keeltest peab olema eesti keel, teine võib olla mistahes muu võõrkeel. Tandemid moodustatakse kursusele registreerunud üliõpilastest esimesel kokkusaamisel, võimalik on ka ise endale keeleõppepartner leida ja koos kursusele tulla. Üks tandemi liikmetest on eesti emakeelega, teine muu emakeelega. Iga tandem koostab endale individuaalse tööplaani, sõltuvalt keeleoskustasemest ja keeleõppe eesmärkidest. Õppetöö sisu ja vormi otsustavad tandemis osalejad koostöös aine õppejõuga. Kursusel osalemiseks on vajalik õpitava võõrkeele oskus suhtlustasemel. Kõik tandemid täidavad Moodle'is õpipäevikut, kuhu tuleb iga keeletunni kohta teha lühike sissekanne.Objectives/eesmärkid:  Arendada mitte-eesti emakeelega üliõpilaste eesti keele oskust ning eesti emakeelega üliõpilaste võõrkeeleoskust keeles, mis on tandemikaaslase emakeel. Anda üliõpilastele kogemusi oma emakeele õpetamisest võõrkeelena, arendada õpi-, suhtlus- ja koostööoskust ning õppimise kavandamise ja kultuuridevahelise suhtlemise oskust.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane a) on parandanud oma suhtlusoskust ühes võõrkeeles; b) oskab analüüsida enda ja tandemikaaslase keelelisi oskusi ja vajadusi ning kavandab koostöiseid keeleõppetegevusi tandemis; c) suudab anda  tandemikaaslasele suulises vormis tagasisidet tema keeleoskuse arenemise kohta tandemkursuse jooksul ning analüüsida saadud tagasisidet;  d) on teadlikum kultuuridevahelise suhtluse eripäradest ning enda tugevatest ja nõrkadest külgedest selles;   e) olles planeerinud teadlikult ja eesmärgipäraselt oma õppimist tandemkursusel, hindab kriitiliselt oma koostöö-, suhtlus- ja ajaplaneerimisoskust. Keeleõppetandemid moodustatakse esimeses seminaris kursusele registreerunud üliõpilastest, võimalik on ka ise endale keeleõppepartner leida ja koos kursusele tulla. Tandemi üks liige on eesti, teine liige mitte-eesti emakeelega, nii et üks tandemis õpitav keel on eesti keel, teine võib olla mistahes muu võõrkeel. Keeletundide sisu otsustavad paarilised ise, lähtuvalt oma keeleoskuse tasemest ja keeleõppe eesmärkidest. Vajadusel saab alati pöörduda aine õppejõu poole abi ja nõu küsimiseks. Kursus ei sobi algajatele, eelduseks on õpitava võõrkeele oskus suhtlustasemel. Keeleoskustaseme testimist kursusel ei toimu."}