{"KURSUSE_NIMI": "Lugemisseminar teise keele omandamisest ja õpetamisest", "KURSUSE_KOOD": "HVEE.05.056", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Iganädalastes lugemisseminarides arutletakse teadusartikleid aluseks võttes üldiste teise keele omandamise ja õpetamisega seotud protsesside üle ning seostatakse uurimistulemusi oma kogemustega erinevate keelte õpetamise ja õppimise kontekstis.  \n\nTekstid tuleb enne seminari iseseisvalt läbi töötada, ühe tekstiga tegeletakse üldjuhul kaks nädalat.  Loetavad tekstid on valdavalt ingliskeelsed, arutelu toimub eesti keeles.  \n\nArutelus keskendume 1) teadusteksti sisule; 2) osalejate L2 omandamise ja õpetamisega seotud kogemustele konkreetse artikli teemade perspektiivist; 3) teadustöö tulemuste rakendamisvõimalustele keeleõppes. \n\nIga osaleja peab loetavate tekstide kohta jooksvalt lugemispäevikut.Objectives/eesmärkid:  Valitud teadustekstidele tuginedes tutvuda teise keele (L2) omandamist ja õpetamist puudutavate aktuaalsete uurimissuundade ning -tulemustega.      Jagada ja mõtestada loetud tekstide valgusel kursusel osalejate kogemusi L2 omandamisel ja õpetamisel.      Arutleda teadustöö tulemuste rakendamisvõimaluste üle L2 õppimisel/õpetamisel.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud õppija - On loetud artiklite ja aruteluteemade piires omandanud süvendatud teadmised teaduspõhisest lähenemisest L2 õppele ning saanud ülevaate selle valdkonna aktuaalsetest uurimissuundadest, -teemadest, -meetoditest ja -tulemustest. - Tunneb L2 omandamise alast inglis- ja eestikeelset terminoloogiat, oskab töötada vastavasisulise ingliskeelse erialakirjandusega ning loetust eesti keeles ülevaadet anda, loetu üle arutleda ja osaleda L2 omandamise teoreetilisi ja rakenduslikke küsimusi puudutavas diskussioonis. - Oskab seostada teaduslikke uurimistulemusi ja seisukohti oma keeleõppe ja -õpetamise kogemustega ning analüüsida nende rakenduslikku perspektiivi. Seminar on mõeldud eelkõige keelega seotud erialadele.  Kohapeal toimuval seminaril pole võimalik osaleda veebi vahendusel, hübriidõpet ei toimu. Kursusel on Moodle'i tugi. Kursusel loetavad artiklid ja ajakava täpsustatakse kursuse algul koos osalejatega ning on seejärel leitavad Moodle'is."}