{"KURSUSE_NIMI": "Soome-ugri keelte võrdlev grammatika", "KURSUSE_KOOD": "HVEE.03.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Sissejuhatus soome-ugri keelte fonoloogia, morfoloogia ja süntaksi uurimise aktuaalsetesse uurimisküsimustesse, tüpoloogilised ja areaalsed seosed ja mõjud; uurimisprobleemide käsitlemine erinevates grammatikates ja uurimistraditsioonides, keele uuritavus olemasolevate korpuste baasil. Kursuse käigus teevad üliõpilased juhendatud uurimistöö ja tekstianalüüse.Objectives/eesmärkid:  Keelestruktuuride uurimine tüpoloogia ja Uralistika vaatenurgast deskriptiivsel, võrdleval ja ajaloolisel alusel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Seminari lõpuks on üliõpilased lugenud ja läbi arutanud mitmeid artikleid käsitletaval teemal, et tutvuda Uurali keelte grammatikakirjelduse alase keeleteooriaga ja viimaste arengutega selles vallas; nad on aktiivselt töötanud tekstidega erinevates Uurali keeltes, et arendada oma keelestruktuuride analüüsimise ja kirjeldamise oskust ning filoloogilisi oskusi; nad on kirjutanud kodutöö, et arendada oma akadeemilise kirjutamise oskust. Teemaks 2025. a. kevadsemestril on KÜSIMUSED. The course Comparative Grammar of Uralic Languages will focus on form, meaning, and pragmatics of questions across Uralic languages from the typological perspective. We will discuss the ways Uralic languages express canonical (information-seeking) and non-canonical (biased, rhetorical, reflective, echo-) questions. We want to find out how questions of different structural types (polar, constituent, disjunctive) are formed, explore the taxonomy of interrogative words, and talk about wh-in-situ languages. We’ll also discuss question-answer pairs and response words in Uralic languages and beyond.\n\nTo get the gist of some features we’ll be looking at, we advise participants to get familiar with the following chapter: Aikhenvald, Alexandra Yu. 2014. Sentence types. In Jan Nuyts & Johan van der Auwera (eds.), The Oxford handbook of Mood and Modality, 141165. Oxford: Oxford University Press.\n\nAs the outcome of the course, the students are required to compile a typological questionnaire based on which a grammar chapter about questions in a particular Uralic language could be written. Students taking the 6-EAP course are required to make their own research work based on their questionnaire in a language (or languages) of their choice and present the results in a seminar paper.\n"}