{"KURSUSE_NIMI": "Suhtluspõhine keeleõpe: keelesõbrakursus Narva kolledži üliõpilastega", "KURSUSE_KOOD": "HVEE.05.055", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 20, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Keelesõbrakursus on suhtluspõhise keeleõppe üks vorme.  Keelesõbrakursus on vastastikuses koostöös ja autentses suhtluskeskkonnas toimuv keeleõpe kahe keelesõbra vahel, kus ühe paarilise õpitav keel on teisele emakeel või sellega sarnasel tasemel keel.  Iga keelesõbrapaar kohtub kord nädalas 90 minuti jooksul (kokku 9 kohtumist), täidab iganädalaselt õpipäevikut ning osaleb kolmes kohustuslikus seminaris.Objectives/eesmärkid:  Kursuse eesmärk mitte-eesti emakeelega üliõpilaste puhul on arendada nende suhtluspädevust eesti keeles; eesti emakeelega üliõpilaste puhul kujundada nende pädevusi eesti keele ja kultuuri tutvustamisel muu emakeelega üliõpilastele. Kursuse sihtrühm on \"Tartu akna\" õpirände programmi õppetöös osalevad Tartu ülikooli Narva kolledži üliõpilased ja nende keelesõpradeks valitud Tartu ülikooli eri erialade üliõpilased.Learning outcomes/õpiväljund:  Kursuse läbinud Tartu ülikooli üliõpilane:  a) mõistab suhtluspõhise keeleõppe aluseid; sõnastab ja selgitab suhtluspõhise keeleõppe lähtekohti;  b) rakendab suhtluspõhise keeleõppe võtteid praktilises õppetegevuses suhtluses keelesõbraga;  c) planeerib tulemuslikult suhtluspõhise keeleõppe tegevusi;   d) kujundab keele- ja kultuuri- ning sotsiaalseid pädevusi, koostöiseid ning ajaplaneerimisoskusi.  Kursuse läbinud Tartu ülikooli Narva kolledži üliõpilane:  a) arendab suhtluspädevust eesti keeles;  b) süvendab oma teadmisi eesti keele eri suhtlusviisidest ja -normidest, eesti suhtlus- ja kultuuriruumist ning ühiskonnast;   c) mõistab suhtluspõhise keeleõppe aluseid; sõnastab ja selgitab suhtluspõhise keeleõppe lähtekohti;  d) rakendab suhtluspõhise keeleõppe võtteid praktilises õppetegevuses suhtluses keelesõbraga;  e) planeerib tulemuslikult suhtluspõhise keeleõppe tegevusi;  f) kujundab keele- ja kultuuri- ning sotsiaalseid pädevusi, koostöiseid ning ajaplaneerimisoskusi. Kursusel ei mõõdeta eesti keele oskust. Kursuse ülesehitusel ei lähtuta keeleoskustasemete süsteemist."}