{"KURSUSE_NIMI": "Filosoofilised lahkarvamused", "KURSUSE_KOOD": "HVFI.01.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Argumentatsiooniteooria moodul:\n1. Argumentatsiooniteooria I. \n2. Argumentatsiooniteooria II. \n3. Argumentide praktiline rekonstrueerimine ja hindamine I.\n4. Argumentide praktiline rekonstrueerimine ja hindamine II. \n5. Kriitiline mõtlemine teaduses I. \n6. Kriitiline mõtlemine teaduses II. \n\nFilosoofiliste lahkarvamuste moodul:\n7. Lahkarvamused. \n8. Uskumise eetika.\n9. Emotsioonid. \n10. Teadusfilosoofilised küsimused. \n11. Objektiivsus. \n12. Sugu. \n13. Vaba tahe.\n14. Enesemääramine.\n15. Õiglane sõda.\n\n\nNB! Kursusele on võimalik registreerida kolmel eri viisil (üliõpilasel tuleks valida neist üks):\n* HVFI.01.003 Filosoofilised lahkarvamused (6 EAP) - kogu kursus, kestab terve semestri,\n* HVFI.01.003 Filosoofilised lahkarvamused (3 EAP) - 1. osa \"Argumentatsiooniteooria\" (kestab 7 nädalat semestri esimesel poolel),\n* HVFI.01.003 Filosoofilised lahkarvamused (3 EAP) - 2. osa \"Lahkarvamused\" (kestab semestri teise poole).Objectives/eesmärkid:  Aine esimene osa keskendub kriitilise mõtlemise ning argumenteerimise alustele (3 EAP), teine osa tutvustab tudengitele mitmeid distsipliinideüleseid filosoofilisi probleeme (3 EAP).Learning outcomes/õpiväljund:  Kursuse õpiväljundid jagunevad kaheks. 1. Argumentatsioonimooduli läbinud tudeng: *\tOn õppinud tundma argumentatsiooniteooria aluseid ning peamisi mõisteid. Ta oskab neid argumendi analüüsil rakendada. *\tOn õppinud teiste teksti ja kõnet taasesitama nii, et põhiline tuleb selgelt välja. Ta oskab seda põhilist kriitiliselt analüüsida. *\tOn omandanud baasteadmised teaduslikust mõtlemisest ja metodoloogiast. Ta on kriitiliselt analüüsinud enda uurimistöö metodoloogiat. 2. Filosoofiliste lahkarvamuste mooduli läbinud tudeng: *\tMõistab käsitletud teemade näitel filosoofiliste küsimuste eripära ja nende distsipliinideüleseid esinemisvorme ning implikatsioone. *\tOskab paigutada oma uurimistöö laiemasse mõtteloo konteksti. *\tOskab rakendada kursuse raames käsitletud mõisteid ja teooriaid konkreetsete juhtumite analüüsimisel. The course has no prerequisite subjects. It is possible to participate in only one module of the course (Argumentation theory or Philosophical disagreements); passing the first module is not required for participation in the second module.\nSee course trailer at \nhttps://www.youtube.com/playlist?list=PL2MLstCZaxkarZykKep4-soJgJ4ObGqum\n\n-- This course has been financed by the University of Tartu ASTRA Project PER ASPERA (European Regional Development Fund).\n-- The course was supported by the European Regional Development Fund and the programme Mobilitas Pluss (top researcher grant 'Expertise and Fundamental Controversy in Philosophy and Science', MOBTT45)."}