{"KURSUSE_NIMI": "Magistriseminar", "KURSUSE_KOOD": "HVFI.01.004", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 8, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Magistriseminar koosneb kahest osast ja toimub kolme semestri vältel. Esimene osa keskendub (a) uurimistöö oskuste õpetamisele (kuidas läheneda uurimisteemale, kuidas leida relevantset kirjandust, kuidas lugeda teaduslikku kirjandust, kuidas esitleda oma uurimistööd kirjalikult ja suuliselt, kuidas leida sobivateemalisi konverentse ning neile kandideerida jne) ja (b) annab üliõpilastele ülevaate sellest, mida on vaja teha doktoriõppesse kandideerimiseks (kui nad soovivad seda teha), ning kuidas kasutada magistriharidust mitteakadeemilise karjääritee arendamiseks (kui nad soovivad seda teha). Seminari teine osa toimub teisel ja kolmandal semestril. Seminari teine osa keskendub üliõpilaste uurimistööde kursusekaaslaste-poolsele tagasisidestamisele.Objectives/eesmärkid:  Magistriseminari eesmärgid on: (a) arendada oskuste kogumit, mis on kasulik iseseisva uurimistöö läbiviimiseks, ja (b) pakkuda üliõpilastele ruumi uurimistöö tegemiseks sotsiaalsel viisil, arendades oma uurimistööd kursusekaaslastelt erinevates formaatides saadud tagasiside abil.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: on harjutanud eduka uurimistöö jaoks vajalikke oskusi, näiteks uurimisprobleemi määratlemist, oskab otsida asjakohaseid allikaid, tunneb asjakohaseid andmebaase, oskab kasutada viitehaldustarkvara ja muid olulisi uurimisvahendeid, on harjutanud esinemisoskust ning küsimuste ja vastuste esitamise praktikat nii mono- kui ka interdistsiplinaarsele publikule,  on õppinud, kuidas kirjutada kokkuvõtet ja käsilehte, oskab filosofeerida koos teistega, st anda konstruktiivset tagasisidet ja osaleda abivalmilt kaaslaste tööde arutelus, on võimeline kandideerima filosoofia või sellega seotud erialade doktoriõppesse, on õppinud aja- ja projektijuhtimise oskusi. Prerequisite courses: Start module of the Philosophy in Practice MA."}