{"KURSUSE_NIMI": "Hea teadus: raamnõuded, väärtused ja tegevuspõhimõtted", "KURSUSE_KOOD": "HVFI.01.002", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 28, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse eesmärk on anda osavõtjatele ülevaade hea teaduse võtmeküsimustest: teaduspublikatsiooni autorsuse kokkuleppimine mitme autoriga publikatsiooni korral, teavitatud nõusoleku küsimine, andmete töötlemine, uuringusse kaasatud inimeste privaatsuse ja isikuandmete kaitse tagamine, teadustööks vajalike lubade, nõusolekute ja eetikakomitee kooskõlastuste sisu ja taotlemine.\nKogu kursust toetab eesti- ja ingliskeelne e-keskkond, mis koondab erinevate teadusvaldkondade jaoks olulist materjali, mille hulgast doktorant valib enda jaoks õppeülesanded 6 EAP mahus.\nKursus on ehitatud üles nii, et vastavalt eriala ja uurimistöö spetsiifikale saavad doktorandid valida enda jaoks sobivad teemad ja ülesanded. Kursusel on seminarid, kus erinevate erialade doktorandid saavad kogeda hea teadustava tõlgendamisel distsiplinaarseid erinevusi.Objectives/eesmärkid:  Teadus on kollektiivne tegevus, mis põhineb usaldusel. Usaldusväärsuse tagamiseks on vaja, et teadlased tunnetaksid oma vastutust, mis eeldab aga, et tuntakse eetilisi põhimõtteid, osatakse märgata teadustöös ettetulevaid moraalseid valikukohti ja teha põhjendatud otsuseid. Tartu Ülikool kirjutas 1. 11. 2017 koos 20 teise Eesti teadusasutuse, Haridus- ja Teadusministeeriumi ning Eesti Teadusagentuuriga alla hea teadustava kokkuleppele: https://www.eetika.ee/et/eesti-hea-teadustava. Käesolev kursus annab kõigile TÜ doktorantidele võimaluse tutvuda süvitsi hea teaduse aluseks olevate väärtuste ning tegevuspõhimõtetega, käsitledes teadustöö tegemise kõiki osi - alates teadustöö kavandamisest, teadustöö läbiviimisest kuni tulemuste avaldamise ja rakendamiseni ühiskonnas. Samuti käsitletakse teadlase ja ühiskonna suhteid ning teadlase erinevaid rolle, nt õpetaja, juhendaja, retsensendi, eksperdi ja koostööpartnerina, ning neist tulenevaid dilemmasid.Learning outcomes/õpiväljund:  Kursuse läbinud doktorant omab ülevaadet hea teadustava aluseks olevatest väärtustest ja tegevuspõhimõtetest, oskab näha teadustöös ette tulevaid kaalutluskohti. Kursuse läbinu on võimeline osalema interdistsiplinaarses meeskonnatöös, oskab juhtumeid analüüsida ning suudab kriitiliselt reflekteerida ja kaaluda argumente, mida vastavates analüüsides kasutatakse, teadvustab enda hoiakuid hea teaduse (research integrity) valdkonnas: on avaldanud oma arvamust nii suuliselt kui kirjalikult, on sooritanud nõuetekohase kvaliteediga kirjaliku töö ja oskab teha põhjendatud moraaliotsuseid. Course will be held 100% online in Moodle. That means independent work in Moodle and also attending of six online seminars that take place on particular fixed times every other week. During a independent learning week, doctoral students watch short interactive video lectures, answer questions about the lectures and read one thematic article. By the end of this week of independent work, written question(s) need to be submitted to the lecturer(s) conducting the online seminar during the next week. The seminar week follows the independent learning week. This cycle of an independent learning week followed by a seminar week is repeated throughout the course. The seminars are partially designed following the method of flipped classroom, where learners acquire information independently and during the online seminars particular texts and students' questions are discussed.\n\nThe course is supported by the University of Tartu ASTRA Project PER ASPERA, financed by the European Regional Development Fund."}