{"KURSUSE_NIMI": "Sissejuhatus digihumanitaariasse", "KURSUSE_KOOD": "HVHV.00.002", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Digitaalne keskkond on kultuuri ja kirjanduse uurimist kiiresti muutnud. See tähendab kultuuriandmete säilitamist ja esitamist või digidokumendi olemuse mõistmist uutmoodi, automaatset tekstianalüüsi, keerukate kultuurisüsteemide arvutimodelleerimist või andmetundlikke teooriaid (nt kultuurievolutsiooni teooria). Paraku on praegu kombeks, et kõik häguste piiride ja ebaselge definitsiooniga on \"digitaalne\".\nKursus on mõeldud üliõpilastele teejuhiks selles valdkondadeüleses maailmas, mis hüpleb toimetamisteooriate, geograafiliste infosüsteemide, arvutilingvistika, meediauuringute ja võrguteaduse vahel. Olemata kaugeltki ammendav, annab kursus ülevaate digihumanitaaria peamistest teemadest, lähenemistest ja ideedest, pöörates tähelepanu ka kultuuriandmete ja tekstianalüüsi ajaloole.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada digihumanitaaria valdkonna mitmekesisust: käsitleda humanitaarteaduste arvutistamise teoreetilisi ja metoodilisi vaatenurki ning digihumanitaaria uusi uurimusi ja kriitilist mõtlemist selles.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1) teab digihumanitaaria peamisi teemasid, probleeme ja uurimistöö arengusuundi; 2) saab aru arvutuslikest lähenemistest humanitaaria probleemide ja andmete puhul; 3) on tutvunud mitmesuguste meetoditega, alates teksti märgendamisest kuni loomuliku keele töötlemise, kaartide ja võrgustikeni; 4) oskab kavandada oma projekti, rakendada oma teadmisi uurimistöö jaoks ja paigutada töö laiemasse teoreetilisse raamistikku. Kursuse toimumist toetab Tartu Ülikooli ASTRA projekt PER ASPERA, finantseerib Euroopa Liidu Regionaalarengu Fond/The course is supported by the University of Tartu ASTRA Project PER ASPERA, financed by the (European Union) European Regional Development Fund."}