{"KURSUSE_NIMI": "Eesti kultuuri ruumiline mudel ja arengud", "KURSUSE_KOOD": "HVKU.03.062", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse jooksul toimub neli kontaktkohtumist õppejõuga loengu ja seminari vormis. Esimesel kohtumisel jagatakse rühmatöö teemad ja lepitakse kokku esitluste ajad. Loenguteks valmistumiseks saavad üliõpilased lugemismaterjali, mille põhjal saavad seminarides arutleda.\nÕppeaine hõlmab teemasid, mis on seotud Eesti kultuuriavalikkuse ja kultuuri ruumilise mudeli, kultuurikorralduse ja -poliitika kujunemise ning arenguga (sh regionaalse kultuuripoliitikaga). Seminarides mõtestatakse kunsti- ja kultuurihariduse (huvihariduse) arenguid; rahvamajade rolle, kultuuritöö piirkondlikku mõju ning tänapäeva regionaalse kultuurikorralduse väljakutseid.Objectives/eesmärkid:  tutvustada Eesti kultuuri ruumilise mudeli ja kultuuripoliitika kujunemist ning arengut seltsi- ja rahvamajade võrgustiku näitel 19. sajandi teisest poolest kuni tänaseni arutleda Eesti kultuuri ruumilise mudeli ja kultuurihariduse (huvihariduse) vaheliste seoste üle mõtestada kultuuritöö rolle, huvihariduse ja kultuuritöö mõju kogukonnas ning arutleda tänapäeva regionaalse kultuurikorralduse väljakutsete üleLearning outcomes/õpiväljund:  Õppeaine edukalt läbinud üliõpilane: teab, kuidas Eesti kultuuriavalikkus on seltsi- ja rahvamajade võrgustiku toel ajalooliselt kujunenud ja arenenud on teadlik kultuuripoliitika ja - korralduse arengutest ja kultuuritöö eesmärkidest eri ajastutel oskab näha seoseid traditsiooniliste harrastuskunstide, kultuuri- ja huvihariduse ning professionaalse kunsti ja  kultuurikorralduse vahel oskab mõtestada kultuurikeskuste ja huvihariduse mõju ja kultuuritöötaja rolle kogukonnas on teadlik regionaalse kultuurikorralduse väljakutsetest"}