{"KURSUSE_NIMI": "Kirjanduse didaktika erikursus", "KURSUSE_KOOD": "HVKU.05.055", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Eesti keele ja kirjanduse didaktika alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse sisu (L 10, S 6, I 36)\n\n-\tL2: Kontsentriline ja lõiminguline kirjandusõpetus\n-\tL2Probleemõpe ja uurimuslik õpe kirjanduse õpetamisel. Kirjandusteemalise uurimistöö koostamine ja juhendamine. Loovtööde ja praktiliste tööde juhendamine\n-\tL2: Eesti uuem noortekirjandus põhikoolile. Noortekirjanduse tõlked põhikoolile\n-\tI14: Noortekirjanduse põhjal õppematerjali koostamine (õpetajakonspekt, töölehed)\n-\tS2: Noortekirjanduse põhjal õppematerjali esitlus, tagasiside andmine\n-\tI 2: Õppematerjali täiendamine tagasiside põhjal\n-\tL2: Kirjanduse õppematerjalid põhikoolis ja gümnaasiumis\n-\tL2: Luulekogu käsitlemine põhikoolis ja gümnaasiumis. \n-      S2: Filmiõpe kirjandustunnis\n-\tI20: Kontsentrilise ja lõimingulise õppematerjali koostamine (õpetajakonspekt, tunnikavad, töölehed).\n-\tS2: Kontsentrilise ja lõimingulise õppematerjali esitlus, tagasiside andmine \n-\tI 2: Õppematerjali täiendamine tagasiside põhjal\n\nKursuse läbimiseks on vaja koostada KAKS ÕPPEMATERJALI (õpiobjekti), teha nende kohta seminaris ettekanne ja esitada need materjalid tagasiside põhjal täiendatuna õppejõule.Objectives/eesmärkid:  Õppeaine eesmärgid\n*\tKäsitleda kirjandusõpetuse didaktikat, süvenedes olulisemate õppemeetodite ja õppetegevuste rakendamisega seotud probleemidesse. \n*\tAnda ülevaade aktiivõppe võimalustest koolikirjanduse käsitlemisel, pakkuda teksti käsitlemise põhimõtteid ja metoodikat; vahendada oskusi koolikirjandustekstide analüüsimiseks ja tõlgendamiseks (sh teema-, probleem- ja uurimusõpe).Learning outcomes/õpiväljund:  Üliõpilane *\tanalüüsib ja tõlgendab erinevaid koolikirjanduse klassika- ja uudisteoseid nii eepika kui ka lüürika põhiliikides; *\tkasutab koolikirjanduse käsitlemisel aktiiv- ja interaktiivõppe, samuti teema-, uurimus- ja probleemõppe meetodeid ning digitehnoloogilisi lahendusi; *\tkoostab ja esitleb kas individuaalselt või paaristööna loodud terviklikke teemapõhiseid ja lõimingulisi õpielemente (sh õpetajakonspekt, tunnikavad, töölehed). Kirjanduse didaktika erikursuse hindelised ülesanded jäävad samaks, s.o kahe kirjanduse õppeelemendi koostamine paaris- ja/või kolmiktööna. Õppijate omavaheline tagasiside valminud õppeelementidele on nüüd kirjalik (varem plaanisime seda teha suuliselt). Lisandub üks 90-minutilise ajakuluga kirjalik kodutöö, mis kontrollib kahe loengumaterjali omandamist. Info jagamine käib Moodle'i vahendusel."}