{"KURSUSE_NIMI": "Rahvapärased väljendusvormid ja analüütilised kategooriad", "KURSUSE_KOOD": "HVKU.04.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Lähtudes mõistepaarist analüütiline ja rahvapärane, vaatleb kursus ametliku kultuuri ja rahvakultuuri vastasmõjusid ning suhteid kogukondade ja teiste rühmade argipraktikate tasandil, mille tundmine on vajalik vaimse kultuuripärandi valdkonna protsesside mõistmiseks ja vastutustundlikuks suunamiseks. Kursusel käsitletakse süvendatult folkloori ajaloolist kujunemist analüütilise kategooriana erinevas geograafilises ja ühiskondlik-kultuurilises kontekstis, autentsuse mõistega seonduvat ning kaasaegseid folkloristlikke teooriaid, mis mõtestavad pärimust traditsioonisidusa kommunikatiivse praktika ja identiteediloome ressursina. Erilist tähelepanu pööratakse neile folkloorianritele, mis leiavad aktiivset kasutust meelelahutustööstuses, turisminduses ja teistes majandusharudes nii kohalikul kui ka rahvuslikul ja rahvusvahelisel tasandil, või mida rühmad kasutavad sümboolseks kommunikatsiooniks ametliku kultuuri esindajatega.Objectives/eesmärkid:  Kursus annab üliõpilasele süvendatud teadmised folkloristika ajaloost, põhimõistetest ja tänapäevastest teoreetilistest suundumustest, selgitamaks erinevate folkloorianrite (sh müüt, muistend, uskumused, kohapärimus) toimimist nii rühmade kui ka indiviidide argielu ja kultuurilise identiteedi (taas)loomise protsessis ja kommunikatsioonis. Samuti arendatakse selle kaudu üliõpilaste võimet mõista vaimse kultuuripärandi eripära ning hinnata kriitiliselt kultuuripärandi valdkonna protsesse, kultuuripärandi rakendusvõimalusi ühiskonna erinevates sfäärides ning reflekteerida enda ja teiste erialast tegevust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine läbinud õpilane 1) mõistab folkloori kui traditsioonisidusat kommunikatsioonipraktikat ja selle erinevust kultuuripärandi kategooriast; 2) tunneb hästi erinevate folkloorianrite funktsioone kogukondade argielus, 3) oskab näha rahvapäraste väljendusvormide vastutustundlikke rakendusvõimalusi identiteedipoliitikas, kultuuritööstuses ja turisminduses ning 4) oskab toimida vahendajana kogukondade, ettevõtjate ja ametiisikute vahel. 5) Arenenud on üliõpilase võime anda hinnanguid enda ja kolleegide erialasele tegevusele, juhtida erialase töörühma tegevust ning oma erialaseid seisukohti erinevatele sihtrühmadele väljendada."}