{"KURSUSE_NIMI": "Välispraktika", "KURSUSE_KOOD": "HVKU.03.028", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Välispraktika on õpiväljundite saavutamiseks korraldatav üliõpilase sihipärane tegevus rahvusvahelises töökeskkonnas õppeasutuse määratud vormis ning juhendaja juhendamisel. Kõik tegevused tuleks eelnevalt kooskõlastada programmijuhiga (ene.koresaar@ut.ee). Välispraktika sooritatakse väljaspool Eestit.Objectives/eesmärkid:  Välispraktika eesmärk on anda üliõpilastele praktilist töökogemust. Arendada nende ülekantavad oskusi (sh projektijuhtimine, ajaplaneerimine, enesejuhtimine jne). Harjutada erinevates õppeainetes õpitu rakendamist töökeskkonnas ja arendada vastavaid vilumusi. Arendada oskust õpitut praktikakogemuse põhjal analüüsida ja kriitiliselt hinnata. Välispraktika täpne sisu määratakse individuaalselt ning sõltub üliõpilase taustast ning huvidest, praktika tegevus peab langema ühte allpool kirjeldatud kategooriasse: 1) Ettevõtluspraktika. Tudeng läheb praktikalepingu alusel praktikale mõne organisatsiooni juurde ülikoolist ja Eestist välja. Talle määratakse praktikakoha poolt juhendaja. Ta sooritab praktikakohas talle ettenähtud tööülesanded. 2) Projektipõhine praktika. Tudeng osaleb ühe konkreetse projekti meeskonna töös välismaal projekti algusest lõpuni. Projekti lähteülesandeks on ülikooliväline tellimus mõne organisatsiooni poolt. 3) Õppeassistendi ja/või teaduskorralduse praktika. Tudeng assisteerib õppejõudu välisülikoolis ühe konkreetse õppeaine läbiviimise või teadustöö tegemise juures (sh akadeemiliste ürituste korraldamine).Learning outcomes/õpiväljund:  Praktika sooritanud üliõpilane: - oskab erialateadmisi ja -oskusi töökeskkonnas loovalt rakendada; - analüüsib oma praktilist tegevust enesekohaselt ja -kriitiliselt (eneseanalüüs), püüdes selle käigus lõimida praktikat teoreetiliste teadmistega; - on arendanud ülekantavaid oskusi rahvusvahelises töökeskkonnas (näiteks meeskonnatöö, ajaplaneerimine, projektijuhtimine jt); - annab välispraktika kohta tagasisidet juhendajale ja kaastudengitele."}