{"KURSUSE_NIMI": "Eesti kirjandus ja kultuur", "KURSUSE_KOOD": "HVKU.05.039", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 0, "independent_work": 144, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate eesti kirjandusloost üldises kultuuriloolises kontekstis, samuti käsitletakse eesti nüüdiskirjanduse põhijooni, suundi ja autoreid, samuti kirjandusega seotud asutusi, organisatsioone, väljaandeid ja infokanaleid. Põhjalikumalt käsitletakse kahte kanoonilist kirjanikku ja nende põhiteoseid erinevatest perioodidest ning kaht nüüdiskirjanduse olulist suunda. Kursus toimub osaliselt koos kursusega HVKU.05.004. Kursus toimub loengute ja seminaride segaformaadina. Loengutes antakse laiem kirjandus- ja kultuurilooline taust, seminarid keskenduvad kirjandusteoste ja nende põhjal tehtud filmide arutelule. Võimalusel hõlmab kursus ka ekskursioone Tartu kirjanduslikesse paikadesse (nt Eesti Kirjandusmuuseum, kirjanduslik Tartu, Tartu kui UNESCO kirjanduslinn).Objectives/eesmärkid:  Kursuse eesmärgiks on eesti kirjandusloo, selle olulisemate protsesside ja autorite ning nüüdiskirjanduse peamiste suundade tutvustamine välisüliõpilastele üldise Eesti kultuuriloo kontekstis koos põhjalikemate sisevaadetega valiku kesksete autorite loomingusse ja olulistesse arengusuundadesse.Learning outcomes/õpiväljund:  Kursuse läbinud välisüliõpilane:\n- Omab ülevaadet eesti kirjanduse arengust ja oskab seda suhestada Eesti üldise kultuurilooga ja võrdlevalt oma maa/regiooni kirjanduskultuuriga\n- On kursis eesti nüüdiskirjanduse peamiste teemade, suundade ning autoritega\n- Omab ülevaadet eesti kirjanduskaanoni kesksetest autoritest ja nende loomingust\n- On süvendatult tutvunud valiku eesti kirjanike loominguga\n- Oskab otsida täiendavat infot eesti kirjanduse kohta (ajakirjad, andmebaasid) ning omab ülevaadet kirjandusega seotud asutustest ja organisatsioonidest Eestis"}