{"KURSUSE_NIMI": "Tarbesõna kunst", "KURSUSE_KOOD": "HVKU.05.054", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ilukirjanduslikke ja tarbetekste võib ühendada sõnakunst, kuna poeetika suurendab teksti kommunikatiivset mõju. Vahel soovitakse, et tarbetekstid (nt ajakirjanduslikud ja turundustekstid, juhendmaterjalid ja avalikud ametkondlikud tekstid) oleksid lisaks informatiivsusele ka poeetiliselt viimistletud, mis tõstab sisu prestiii. Ka funktsionaalsed tekstid saavad olla kujundlikud ja tarbesõna kunsti kursus aitab kaasa nende mõistmisele ning loomise oskusele.Objectives/eesmärkid:  Kursus ühendab ilukirjandusliku ja ajakirjandusliku loovkirjutamise ning poeetika. Teoreetilises osas antakse ülevaade erinevatest tarbetekstiliikidest, nende omavahelistest seostest ja rakendamisvõimalustest. Käsitletakse kujundliku mõtlemise ja ütlemise olemust. Praktilises osas katsetavad osalejad erinevaid kujundliku eneseväljenduse võimalusi rakenduslikes lühianrites: loosungid, reklaamid, nupukesed, uudised jmt. Eesmärk on pakkuda teoreetilisi ja praktilisi teadmisi erinevatest väljendusvormidest ning võimalust mängida loovusega. Kursuse metodoloogiliseks mitmekesistamiseks kasutatakse ühiskonnateaduste instituudi stuudio tehnilisi lahendusi.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel tudeng: teab erinevate ajakirjanduslike anrite tunnuseid; teab tarbetekstide funktsioone ja kasutusvõimalusi; mõistab poeetilise funktsiooni, kujundliku mõtlemise ja väljendamise olemust; teab poeetika põhimõisteid ja oskab kasutada kujundlikke võtteid; oskab näha sekundaarse poeetilise funktsiooni tunnuseid funktsionaalsetes tekstides; oskab luua kujundlikku lühiteksti reklaaminduse, ajakirjanduse, teabevahetuse või igapäevasuhtluse vallas."}