{"KURSUSE_NIMI": "Kirjanduse didaktika", "KURSUSE_KOOD": "HVKU.05.015", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Kirjanduse roll ja väärtus tänapäeval. Kirjandusõpetuse eesmärgid ja õpiväljundid põhikoolis ja gümnaasiumis. Kirjanduse õpetamise kontseptsioon põhikoolis ja gümnaasiumis.\n2. Põhikooli ja gümnaasiumi kirjanduse ainekava lugemine ja analüüs.\n3. Kirjandustundide ettevalmistamine ja kavandamine. Õpetaja töökava koostamine. Kirjandusõpetuse meetodid ja õppevormid. Meetodi demonstratsioon.\n4. Õppe- ja õpitegevused kirjandustunnis: lugemine, kuulamine, jutustamine ja esitamine; teksti analüüs, mõistmine ja tõlgendamine, omalooming, loovkirjutamine.\n5. Luuleteksti õpetamise metoodika. Luuleõpetustundide tüübid.\n6. Proosateksti õpetamise metoodika. Tekstisisene ja -väline analüüsitasand.\n7. Draamateksti õpetamise metoodika. Teatri- ja draamaõpetus koolis.\n8. Kontsentriline ja võrdlev kirjandusõpetus. Vertikaalne ja horisontaalne lõiming kirjandusõpetuses. Läbivate teemade käsitlemise võimalusi kirjandusõpetuses.\n9. Väärtuskasvatus kirjandusteoste kaudu põhikoolis ja gümnaasiumis.\n10. Tagasiside andmine kirjandusõpetuses. Hindamine ja hinnang kirjandustunnis. Kujundav ja kokkuvõttev hindamine kirjandusõpetuses. Ainealane arenguvestlus.\n11. Kirjandustunniks vajalikud õppematerjalid ja -vahendid. Digitaalse õppematerjalid ja veebikeskkonnad. IKT kasutamine kirjandustunnis.\n12. Kirjanduse tunnikavade koostamine. Kirjanduse tunnikavade esitamine ja analüüs.\n13.  EksamObjectives/eesmärkid:  Kursus annab ülevaate ülddidaktika ja ainedidaktika proportsioonidest, aine- ja õpilasekeskse paradigma rakendamisvõimalustest kirjanduse õpetamisel. Ühtlasi vaatleb kursus kirjanduse didaktika probleeme, kirjandusõpetuse meetodeid ja lähenemisvõimalusi, vahendab oskusi ja pädevusi aineõpetaja tööks, annab juhtnööre kirjandusteemade käsitlemiseks, proosa-, luule- ja draamatekstide lugemiseks, kuulamiseks, kirjutamiseks, analüüsimiseks ja tõlgendamiseks.Learning outcomes/õpiväljund:  Üliõpilane omandab pädevuse *\tkasutada aineõpetuses sobivaid didaktilisi printsiipe, õppevorme ja -meetodeid, pidades silmas riikliku õppekava nõudeid ja võimalusi; *\ttoime tulla kirjandusõpetaja erinevate rollide, kutse-eetiliste probleemide ning enese-täiendamise väljakutsetega; *\tette valmistada põhikooli ja gümnaasiumi ainekavadest lähtuvalt kirjandustunde (tunni eesmärgid, ülesehitus, meetodid, tegevused, hindamine, ajakava jm); *\tanalüüsida-tõlgendada proosa-, luule- ja draamatekste ning leida sobivaid didaktilisi lähenemisnurki kirjandusteoste ja -teemade käsitlemiseks; *\trakendada kirjanduse õpetamisel vertikaalse ja horisontaalse lõimingu võimalusi, tegeleda kirjandusteoste kaudu väärtuskasvatuse, läbivate teemade ja üldpädevuste käsitlemisega."}