{"KURSUSE_NIMI": "Kuidas sünnib elumuutev looming ja mis minul sellest võita on? Praktiline kursus.", "KURSUSE_KOOD": "HVKU.00.011", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine ei eelda muusikalist kuulmist ega sügissemestri kursuse läbimist, ent sobib hästi ka sügisel aine läbinud õpilasele jätkuaineks. Käsitleme sügissemestril läbitud õppetükke praktilisest vaatepunktist.  \nAnalüüsime loomingus peituva sõnumi usutavuse ja mõju suurust. Õpime inimhääle näitel edastama mõjuvat sõnumit vastavate tehnikate abil. Praktiseerime neid tehnikaid ka loengute sees (aktiivne kohalolu). Avame elumuutva loomingu sünnilugu. \nParandame loovprotsessis vajalikku keskendumisvõimet.\nÕpime kasutama tehnikaid muusika kuulamiseks või mistahes loomingu tarbimiseks eesmärgiga suurendada selle positiivset mõju iseenda loovusele ja vaimsele tervisele. Räägime muusika intensiivsusest. Peame aru loomingus peituva loogika või selle puudumise üle. Mõtestame autentse narratiivi maailma parandavaid võimalusi. Mõnes loengus leiavad aset vestlusringid ning üllatuskülalistena liituvad meile tuntud kõneisikud. Mitmed loengud kätkevad endas ka hääle kasutamist grupis ja seda eelkõige tarvitades sõna. Iga loeng kätkeb endas praktilist muusika kuulamist. \nPraktika selle õppeaine raames ei tähenda tingimata laulmist ega looming laulu kirjutamist, luubi all on hääl kui üks võimalik sõnumi edastuse vahend ning looming kui mistahes vormis loominguline eneseväljendus. Pooltes loengutes kasutame oma häält, vaba valiku ja tahte alusel saab teatud harjutuste puhul praktiseerida ka lauluhäält.Objectives/eesmärkid:  Kursuse eesmärk on\n- avardada teadmisi loomingulises protsessis peituvatest loogikatest; \n- parandada loovat keskendumisvõimet;\n- mõtestada narratiivi usutavuse ja mõju küsimust (inimhääle ja muusika näitel);\n- omandada ja praktiseerida tehnikaid, mille abil kuulata ja valida muusikat enda vaimse heaolu ja loovuse kultiveerimiseks;  \n- arendada praktilisi oskusi mõjusamaks sõnumi edastuseks (kõnehääles või muus sõnumi edastamise vormis);\n- mõtestada autentse sõnumi maailma parandavaid võimalusi;\n- praktiseerida elumuutvat loomist.\n\nSügissemestri ainega võrreldes on selle aine eesmärk loengutes aktiivsema osaluse kaudu jõuda praktiliste oskuste tõhusama omandamiseni. Loeng käsitleb antud teemasid inimhääle ja muusika näitel, kuid seab sihiks selle kaudu toetada mistahes loomingulisi protsesse mistahes erialal või suunal.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane \n- oskab sõnumit mõjusamalt edasi anda; \n- omab suuremat teadlikkust loovast keskendumise kunstist ja suudab varasemast tõhusamalt loovalt keskenduda;\n- oskab praktiseerida tehnikaid muusika kuulamisel või mistahes kunsti tarbimisel eesmärgiga suurendada positiivset mõju iseenda loovusele ja vaimsele tervisele;\n- omab selgemat ettekujutust loomeprotsessist nii teoorias kui ka läbi praktilise kogemuse;\n- oskab teadlikumalt hinnata narratiivi usutavust inimhääle kõla erinevuste näite varal; \n- oskab mõtestada seda, milline on tema elu muutev looming (läbi praktilise kogemuse);\n- oskab mõtestada muusika intensiivsust;\n- osaleb kursuse lõputööna valmivas lühijutustuste kogumikus helisalvestiste näol ja kirja pandud või muus vabas visuaalses vormis. Õppetöö tulemused sisestatakse ÕIS-i hiljemalt semestri lõpuks ehk 29. juuniks 2025.\n\nNB! Tegemist on vabade kunstide kutsutud professori õppetööga, mille viimast kohtumist (lühijutustuste esitlus 6. mail) filmitakse ning salvestus jääb uttv.ee vahendusel järele vaadatavaks.\n\nLisainfo: ut.ee/vabadkunstid, tel 737 5669, vabadkunstid@ut.ee"}