{"KURSUSE_NIMI": "Uuema maailmakirjanduse seminar", "KURSUSE_KOOD": "HVKU.05.033", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel alustatakse 19. sajandi rahvusromantismiga, kus lüürilisel luulel oli lauluna oluline koht rahvuste kui “emotiivsete kogukondade” (Leerssen 2023) loomisel. 20. sajandi puhul vaadeldakse nii populaarsemaid sajandialguse luulelugemisi, eriti Ameerikas (modernistid, biitkirjanike avaüritus), mis tõi selle kirjaliku žanri koos oma autoriga inimestele lähedale, aga ka raadio ja televisiooni mõju luulele II maailmasõja järel. Lisaks käsitletakse luulet popmuusika tekstina (nt Bob Dylan , aga ka eesti autorid) ning USA räpi teke. Käesoleva sajandi puhul on fookus eelkõige räppluulel, lavaluulel, sh luuleprõmmudel ning Instagramiluulel. \nObjectives/eesmärkid:  Kursuse eesmärgiks on käsitleda intermediaalset luulet ehk luulet, kus tähendust omavad ka teised meediumid – muusika, visuaalsed ja etenduskunstid. Seega vaadeldakse kursusel luulet, mis jääb raamatukaante vahelt välja ning mida võiks nimetada ka leviluuleks: ühest küljest suuliselt esitatav luule nii lauluna, teleesinemisena kui lavaluulena, teisalt sotsiaalmeedialuule.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Üliõpilane:\n* saab ülevaate luule võimalikest väljundutest ja suhetest teiste kunstidega (muusika, visuaalsed ja etenduskunstid);\n* oskab näha erinevate meediumite mõju luuletusele ning neid mitmeaspektiliselt analüüsida;\n* oskab näha seoseid tekstide vahel ja mõista teose tekstuaalseid ja intermediaalseid suhteid (kontekst, inter- ja paratekstid ning erinevad meediumid);\n* oskab mõtestada kirjandusteost oma ajastu mõtte- ja kunstiliste voolude taustal, tajudes kirjanduslikke ülekandeid ja mõjusid; \n* märkab ka kirjandusprotsessi pidevust; Tegu on pooleldi loenguga, pooleldi seminariga, kus loengu osas avatakse tausta, seejärel analüüsitakse koos kuulatud/nähtud/loetud luuletekste ja arutletakse nende üle. Kursus toimub sessioonõppes: saame kokku üle nädala reedeti, vabadel nädalatel loetakse kohustuslikku kirjandust, mille tekstid on saadaval Moodle'is. Iga tudeng on ühel seminaril analüüsiv eestkõneleja. Hinne kujuneb seminaridel osalemise ja kirjalikult esitatud analüüsi (u 3-5 lk) eest."}