{"KURSUSE_NIMI": "Sissejuhatus rakendusantropoloogiasse", "KURSUSE_KOOD": "HVKU.03.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Folkloristlikud välitööd"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 2, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 10, "individual_work": 0, "internship": 122}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aines toimub õppetöö kahes vormis: (1) seminarid ja (2) iseseisev töö. Alguses omandatakse kirjandust lugedes ja aruteludes olulisemad rakendusantropoloogilise uurimistöö tegemise lähtekohad. Seejärel valmistuvad tudengid meeskonnaetnograafiaks analüüsides enda kui tiimi tugevusi ja väljakutseid. Järgneb konkreetne uuringuülesanne, mis on sõnastatud TÜ välise tellija poolt ja mille tudengid peavad meeskonnaga lahendama vastates tellija poolt püstitatud küsimustele ja esitledes tulemusi eelnevalt kooskõlastatud vormis. Rakendusantropoloogiline uuring viiakse läbi meeskonnatööna, mis hõlmab muu hulgas ka välitööde läbiviimist andmete kogumiseks ja saadud materjali analüüsi. Meeskonnatöö korralduse lepivad tudengid kokku omavahel, saades semestri jooksul regulaarselt oma tööle tagasisidet ja nõustamist ainet läbiviivatelt õppejõududelt. Aine lõpus esitlevad tudengid oma rakendusantropoloogilise uuringu tulemust tellijale ja TÜ poolsetele aine õppejõududele. Pärast seda analüüsitakse meeskonnatöö kogemust ja reflekteeritakse igaühe individuaalse panuse üle.\nObjectives/eesmärkid:  Aine eesmärgiks on pakkuda sissejuhatus rakendusantropoloogiasse ja osutada võimalustele, kuidas atnropoloogia meetodid ja vaatepunktid töötavad konkreetsetes kontekstides ja konkreetseid probleeme lahendades (nt erinevates avaliku sektori institutsioonides, ettevõtetes ja mittetulunduslikes organisatsioonides).Learning outcomes/õpiväljund:  Kursuse edukal läbimisel üliõpilane: -Tunneb rakendusantropoloogia olulisemaid uurimissuundi; -Oskab püstitada rakendusantropoloogiale omaseid uurimisküsimusi; -Tunneb olulisemaid  rakendusantropoloogias kasutatavaid lähenemisviise ja meetodeid; - Omandab meeskonnetnograafia tegemise kogemuse. -Suudab arvesse võtta erinevaid viise  rakendusantropoloogilise uurimuse tulemuste esitamiseks; -On kursis  rakendusantropoloogia olulisemate eetiliste probleemidega. Tehisintellekti vahendite kasutamine selles aines on lubatud kirjandusest esmase kokkuvõtte tegemiseks, ideede genereerimiseks, välitöö kavandamiseks, esialgse intervjuukava koostamiseks. Tehisintellekti kasutamine ei ole lubatud välitöömatejalide analüüsil ja esitluse ning refleksiooni koostamisel. Soovitame järgida Tartu Ülikooli suuniseid tehisintellekti rakenduste kasutamiseks õppetöös: https://ut.ee/et/sisu/tartu-ulikooli-suunis-tehisintellekti-kasutamiseks-oppetoos"}