{"KURSUSE_NIMI": "Kirjandus totalitaarsetes režiimides", "KURSUSE_KOOD": "HVKU.05.059", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 60, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Seminaris on vaatluse all kirjandussituatsioon, kirjanduse funktsioon ja kirjanduse engagement (kirjandus kui võimu tagaja  versus kirjandus kui vastupanu) totalitaarsetes ühiskondades (tsensuuri tingimustes).\nVõrreldakse ENSV jt nõukogude liiduvabariikide, samuti DDR-i jt Kesk-Ida-Euroopa kommunistlike režiimide kirjandussituatsioone.Objectives/eesmärkid:  Omandada teadmised sotsiaalsete süsteemide mõjust kirjandusele, totalitarismi erinevaist survemeetoditest loomingule ning kirjanduse autonoomia ja sõltuvuse astmetest, määradest ja võimalustest poliitilise režiimi suhtes.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppida esseistika, sotsioloogilise kirjanduse ning ilukirjanduslike proosa- ja luuletekstide varal tundma kirjandusliku eneseväljenduse avaldumisviise (nt. kaugenemine minevikku, kaugenemine fantastikasse, avalik sotsiaalne protest, kaudne protest) totalitaristlikes tingimustes eelkõige Ida- ja Kesk-Euroopa riikides, aga ka Saksamaal ja mujal maailmas põhiliselt ajavahemikus 1930 - 1990. Omandada põhiline pädevus kirjalikuks analüüsiks vaadeldaval teemal. Seminare juhivad Epp Annus ja Inga Kirs. Kuna Epp Annus viibib kevadsemestril Eestist eemal, toimuvad tema seminarid Zoomis. Inga Kirsi juhitud seminarid ning viimane kollokvium toimub Ülikooli 17-220 - ruumis, mida saab kasutada ka Zoomi-seminaride ajal.  \n\nKohustuslik kirjandus\n\nEpp Annus, \"Ma tõstan klaasi vene rahva terviseks: sotskolonialismi diskursiivsed alustalad\" (2017, Methis) (PDF Moodle'is)\nJuhan Smuul, \"Mina - kommunistlik noor\" (1953), Tallinn: Eesti Riiklik Kirjastus. (PDF Moodle'is)\nChrista Wolf, \"Lõhestatud taevas\" (1963, e. k ajakirjas Noorus 1964 (nr 10-12), 1965 (nr 1-6), tlk tlk Virve Aruoja), (PDF Moodle'is)\nTšõngõz Aitmatov, \"Ja sajandist on pikem päev\" (1980, e. k 1982, tlk Maiga Varik)\nAlberts Bels, \"Juured\" (1982, e. k 1987, tlk Mari Vaba, Lembit Vaba)\nOsvald Tooming, \"Puude taga on mets\" (1975): (sealt jutud \"Vana õõnes haab\", lk 44-49; \"Kohanemisvõime\", 56-59, \"Keemiakombinaadid\", 81-82)\nJelena Tžišova, \"Naiste aeg\" (2009, e. k 2022, tlk Ilona Martson)\nLilli Luuk \"Kolhoosi miss\" (2022): (sealt jutt \"Kolhoosi miss\")"}