{"KURSUSE_NIMI": "Ühiskonna kultuuriline mõtestamine enne ja nüüd", "KURSUSE_KOOD": "HVKU.04.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse esimeses pooles tutvutakse eesti talupoja maailmakäsitusega modernismieelsel ajal ja moderniseerumise algusajal ning allikatega, mille põhjal saab neid teemasid käsitleda. Arutletakse selle üle, mil moel mõjutasid talurahva elu seadused, regulatsioonid, mõisnike käsud, luterlik õpetus, rahvakombed ja -uskumused ning lojaalsus suguvõsale. Kursuse teises pooles käsitletakse kultuuri, folkloori ja kultuuripärandi mõistete ning etnograafiliste meetodite toel eelkõige identiteediga seotud protsesse tänases Eestis, mida kujundavad ränne, suurenenud mitmesus ja ebavõrdsus ning info- ja kommunikatsioonitehnoloogiad.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade mõistetest, allikatest ja lähenemistest, mida kasutatakse Eesti ühiskonna kultuuriliseks mõtestamiseks ühelt poolt modernismieelsel perioodil ja teisalt tänapäeval. Tutvutakse modernismieelse eesti soost talupoja mõtte- ja elulaadiga ning kontekstiga, milles need välja olid kujunenud. Antakse sissevaade sellesse, kuidas muutusid modernismiajastu uues keskkonnas talupoegade sotsiaalsed suhted, elulaad ja mõttemaailm. Õpitakse tundma võimalusi nüüdisühiskonna etnograafiliseks uurimiseks kultuuri, folkloori ja kultuuripärandi mõistete toel, pöörates erilist tähelepanu identiteedi (ümber)mõtestamisele ja Eesti mitmesusele. Praktilised ülesanded julgustavad üliõpilasi erialaseid oskusi ja teadmisi ümbritsevale elule rakendama.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased tunnevad mõisteid, allikaid ja meetodeid ühiskonna kultuuriliseks mõtestamiseks varasematel sajanditel ja tänapäeval ning omavad kogemusi nende kasutamisest iseseisvas ja rühmatöös. Õppijad oskavad eristada mitmeid modernismieelse ja modernismiaja tunnusjooni ning mõtestada Eesti- ja Liivimaa ajaloolisi ühiskondlik-kultuurilisi protsesse üleeuroopalises kontekstis. Teisalt oskavad nad paigutada tänase Eesti globaalsesse konteksti, mida iseloomustavad inimeste, asjade, ideede, ja informatsiooni kiire liikumine, paljusus ja ebaühtlane jaotus, ning käsitleda identiteedi ja rändega seotud teemasid etnograafilise kultuuriuurimise vaatepunktist. Arenenud on üliõpilase oskus refereerida erialast teksti, end suuliselt ja kirjalikult väljendada ning teha rühmatööd."}