{"KURSUSE_NIMI": "Kultuuripärand ja kultuuripoliitika", "KURSUSE_KOOD": "HVKU.03.014", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 26, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus keskendub kultuuripärandi mõtestamisele ja rakendamisele erinevas geograafilises, ühiskondlik-kultuurilises ja majanduslikus kontekstis, pöörates ainelise kõrval süvendatumat tähelepanu vaimse kultuuripärandi sfäärile. Analüüsitakse kultuuripärandi rolli kohalikus, riiklikus ja rahvusvahelises kultuuripoliitikas ning majanduses, lähtudes erinevatest vajadustest ja võimalustest maailma eri piirkondades. Vaadeldakse minevikupraktikate, artefaktide, väljenduste ja suhtlusvormide kasutust tänases kontekstis, kus kaasaegse turisminduse, brändingu ja migratsiooni tingimustes toimib kultuuripärand ühiskondlik-kultuurilise ning majandusliku ressursina. Pärandipoliitika kujundamist analüüsides eritletakse sümboolse, sotsiaalse ja materiaalse huvi tasandit.Objectives/eesmärkid:  Anda sissevaade uuringutesse, mis käsitlevad kultuuripärandi temaatikat laias ühiskondlik-kultuurilises ja majanduslikus kontekstis. Õpetada kultuuripoliitika ja kultuuriprotsesside analüütilist uurimisviisi ning tutvustada kaasaegseid meetodeid antud väljal. Eritleda kultuuripärandiga seotud potentsiaali või probleeme.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine läbinud üliõpilane 1) tunneb kultuuripärandi uuringute põhilisi teooriaid ja mõisteid ning oskab neid omavahel suhestada; 2) omab ülevaadet kultuuripärandi poliitiliste, majanduslike ja ühiskondlike rakendustega seotud võimalustest ja probleemidest; 3) oskab seostada kaasaegseid kultuuriprotsesse kultuuripoliitiliste toimemehhanismidega; 4) oskab rakendada omandatud teadmisi nii individuaalses uurimistöös kui ka rühmatöös."}