{"KURSUSE_NIMI": "Kirjanduskriitika seminar", "KURSUSE_KOOD": "HVKU.05.060", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ainekursuse esimestes seminarides on vaatluse all \"kriitika\" mõiste, selle eri tähendusväljad nii ajaloolis-kontekstuaalsel teljel kui ka eri kultuuriruumide kontekstis. Loeme ja eritleme üheskoos 20. sajandi olulisemaid oma- ja välismaiseid kriitikateoreetilisi tekste. Seejärel kaalume kirjanduskriitikat kui kunstivormi ning seame kirjanduskriitika laiemasse konteksti: võrdleme kirjanduskriitikat teiste kunstivaldkondade kriitika(te)ga ja mõtestame selle positsiooni üldisemate ühiskondlik-poliitiliste arengute taustal. Viimaks projitseerime saadud teoreetilised teadmised kitsamalt viimaste kümnendite eesti kirjanduskriitikaväljale: eritleme kriitika eri avaldumisviise ja poeetilisi printsiipe. Seminaride ettevalmistuseks tehakse loovaid ja analüütilisi lühiülesandeid. Kursusetööks tuleb kriitiliselt lugeda kursuse vältel ilmuvat eesti kirjanduskriitikat ning koostada selle põhjal kursuselt saadud teadmisi kasutades üldistav ja mõtestav metakriitiline mapp, mida esitletakse kursuse lõpukollokviumil.Objectives/eesmärkid:  * Tutvustada kirjanduskriitika eri tähendusvälju ja funktsioone. * Tutvustada kriitika ajaloolis-kontekstuaalseid iseärasusi ja 20. sajandi olulisemaid teoreetilisi lähenemisi kirjanduskriitikale. * Eritleda eesti kirjanduskriitika muutumist ja hetkeseisu. * Eritleda kirjanduskriitika kirjutamis- ja avaldumisviiside põhimõtetteid ja poeetikat.  * Võrrelda kirjanduskriitika ja teiste kunstivaldkondade kriitika(te) iseärasusi. * Seostada kirjanduskriitikat laiemate ühiskondlik-kultuuriliste protsessidega.Learning outcomes/õpiväljund:  Üliõpilane: (1) teab kirjanduskriitika eri tähendusvälju ja funktsioone; (2) selgitab kirjanduskriitika ajaloolis-kontekstuaalseid iseärasusi ja 20. sajandi olulisemaid teoreetilisi lähenemisi kirjanduskriitikale; (3) rakendab kriitikateoreetilisi teadmisi eesti nüüdiskriitikale; (4) eristab kirjanduskriitika kirjutamis- ja avaldumisviiside põhimõtteid ja poeetikat ning arendab sedakaudu praktilise lähilugemise oskust; (5) võrdleb kirjanduskriitika ja teiste kunstivaldkondade kriitika(te) iseärasusi ning arendab sedakaudu kultuuri- ja väärtuspädevust; (6) arutleb loovalt kirjanduskriitika ühiskondlik-kultuuriliste tähenduste üle ning mõtestab kirjanduskriitika perspektiivist ühiskondlikke protsesse ja arenguid. AINEKURSUSE SISU JA AJAKAVA TÄPSUSTUB 2025. AASTA JAANUARI KESKPAIGAS"}