{"KURSUSE_NIMI": "Rakendusfolkloristika praktika", "KURSUSE_KOOD": "HVKU.04.045", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Folkloristika meetodid ja uurimisprotsess"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 156, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilane viib kursust koordineeriva õppejõu juhendamisel läbi iseseisva praktika rakendades varem omandatud teadmisi.\nPraktika raames üliõpilane:\n- koostab koostöös ülikoolivälise partneriga praktika plaani ja sõnastab praktika eesmärgid;\n- viib plaanis nimetatud tööd ellu;\n- esitab kirjaliku praktikaaruande, milles analüüsib ja hindab kriitiliselt omandatud kogemust ja projekti raames ilmnenud vaadet folklooriprotsessidele (s.h. kasutatud meetodeid ja nende rakendamist ja saadud tulemusi jm);\n- esitab oma uurimuse tulemused ülikoolivälisele partnerile (kelle juures välitööd läbi viidi) sobivas vormis ja viisil.Objectives/eesmärkid:  Õppeaine eesmärgiks on pakkuda võimalust folkloristika-alaste teadmiste rakendamiseks erinevate ülikooliväliste partnerite juures (nt teine uurimisasutus, organisatsioon, ettevõte, MTÜ vm) ning seda analüüsida.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel oskab üliõpilane: 1. rakendada erialaseid teadmisi praktilise projekti läbiviimiseks ülikoolivälise partneri juures. 2. oskab kriitiliselt analüüsida praktika käigus omandatud teadmisi ja kogemusi ja suudab analüüsida folkloristika-alaste teadmiste rakendamisvõimalusi, s.h. erinevate allikate kasutamist, konteksti olulisust, kasutus- ja mõjupiiranguid ning loovaid interpretatsioone. Õppeaine toimub igal aastal, sügis- ja kevadsemestril, ent registreerimiseks seda ei avata. Üliõpilane otsib iseseisvalt praktika sooritamiseks sobiva partneri, konsulteerides rahvaluule osakonna praktikakoordinaatori Kristel Kivariga (kristel.kivari@ut.ee), kellega lepitakse kokku praktika mahtudes, ajakavas ning plaanis. \nThe course takes place every year, in both the autumn and spring semesters, but it is not open for registration. The student independently seeks a suitable partner for completing the practice and consulting with Kristel Kivari, the coordinator of practical training at the Department of Folklore (kristel.kivari@ut.ee), to agree on the scope, schedule, and plan of the practice."}