{"KURSUSE_NIMI": "Eesti kirjandus ja kultuur", "KURSUSE_KOOD": "HVKU.05.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate eesti kirjandusloost üldises kultuuriloolises kontekstis, samuti käsitletakse eesti nüüdiskirjanduse põhijooni, suundi ja autoreid, samuti kirjandusega seotud asutusi, organisatsioone, väljaandeid ja infokanaleid. Kursus toimub loengute ja seminaride segaformaadina. Loengutes antakse laiem kirjandus- ja kultuurilooline taust, seminarid keskenduvad kirjandusteoste ja nende põhjal tehtud filmide arutelule. Võimalusel hõlmab kursus ka ekskursioone Tartu kirjanduslikesse paikadesse (nt Eesti Kirjandusmuuseum, kirjanduslik Tartu, Tartu kui UNESCO kirjanduslinn).Objectives/eesmärkid:  Kursuse eesmärgiks on eesti kirjandusloo, selle olulisemate protsesside ja autorite  ning nüüdiskirjanduse  peamiste suundade tutvustamine välisüliõpilastele üldise Eesti kultuuriloo kontekstis ning ühtlasi võimaluse pakkumine kohalikele üliõpilastele kogemuste omandmiseks eesti kirjanduse tutvustamisel võõrkeeles ja teistsuguse kultuuritaustaga inimestele.Learning outcomes/õpiväljund:  Kursuse läbinud välisüliõpilane:\n- Omab ülevaadet eesti kirjanduse arengust ja oskab seda suhestada Eesti üldise kultuurilooga ja võrdlevalt oma maa/regiooni kirjanduskultuuriga\n- Omab ülevaadet eesti kirjanduskaanoni ja nüüdiskirjanduse kesksetest autoritest ja nende loomingust ning  kirjandusega seotud asutustest ja organisatsioonidest Eestis \n- Oskab otsida täiendavat infot eesti kirjanduse kohta (ajakirjad, andmebaasid) \n\nKursuse läbinud kohalik üliõpilane:\n- Oskab tutvustada eesti kirjandust ja kultuuri inglise keeles väheste eelteadmistega inimestele, sh ingliskeelse ettekande ja temaatiliste diskussioonide vormis."}