{"KURSUSE_NIMI": "Kirjanduspraktika koolis", "KURSUSE_KOOD": "HVKU.05.020", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 32}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kirjanduspraktika toimub kas mõnes Tartu üldhariduskoolis või mujal üliõpilase enda valitud koolis. \n\nPraktika tegevused: \n- suhtlus õppejõu ja tegevõpetajaga praktika vältel, refleksioon ja praktikapäeviku kirjutamine \n- õpilaste loov- ja uurimistööde või praktiliste tööde juhendamine ja tagasisidestamine \n- kirjandusega seotud ürituste korraldamine ja/või projektide läbiviimine koolis \n- kirjandustundide vaatlemine ja ettevalmistamine koolis \n- kirjandusteemaliste ülesannete ja harjutuste koostamine õppetööks \n\nKirjanduspraktika koolis on soovituslik õppeaine neile, kes soovivad jätkata õpinguid magistriastmes eesti keele ja kirjanduse õpetaja õppekaval.  \n\nTäpsem info: Piret Põldver (piret.poldver@ut.ee)Objectives/eesmärkid:  Kirjanduspraktika eesmärk on anda üliõpilastele ülikooli õppejõu koordineerimisel ja kooli aineõpetaja juhendamisel praktiline koolikogemus kirjandusõpetusega seotud valdkondades.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kirjanduspraktika läbinud üliõpilane \n\n- osaleb kooli kirjandusõpetusega seotud tegevustes tundide vaatleja, ürituste korraldaja, materjalide koostaja ja/või õpilaste juhendajana; \n- saab tegevõpetaja juhendamisel praktilise õppetöö läbiviimise esmase kogemuse ja tagasiside, orienteerub õpetaja tööülesannetes ja -meetodites, tegutseb nii iseseisvalt kui ka meeskonnas; \n- koostab ülevaatliku ja struktureeritud praktikapäeviku, keskendub praktika käigus tehtud ülesannete ja omandatud kogemuste analüüsile; \n- arendab ülekantavaid oskusi koolikeskkonnas, sealhulgas meeskonnatöö, aja ja tegevuste kavandamise, suhtlemis- ja õpioskusi. Aine sooritamiseks on enne ainele registreerimist vaja isiklikult ühendust võtta vastutava õppejõuga.\nVaata kirjanduse praktika Moodle'it \"Kirjanduspraktika koolis\", https://moodle.ut.ee/course/view.php?id=9765 (ligipääs parooliga: Praktika) ja võta ühendust vastutava õppejõuga (piret.poldver@ut.ee)."}