{"KURSUSE_NIMI": "Rakenduslik meditsiiniantropoloogia", "KURSUSE_KOOD": "HVKU.03.061", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kokkuvõttes on üliõpilastel kursuse lõpuks põhiteadmised, oskused ja pädevused, et analüüsida kriitiliselt tervishoiuga seotud küsimusi kultuurilises kontekstis, viia läbi originaaluuringuid, kasutades antropoloogilisi meetodeid, ning aidata kaasa kultuuriliselt tundlike tervishoiutavade ja -poliitika väljatöötamisele.Objectives/eesmärkid:  See kursus pakub praktilist meditsiiniantropoloogia avastamist, rõhutades antropoloogiliste teooriate ja meetodite rakendamist tervise, haiguse ja tervendamispraktikate uurimisel erinevates kultuurikontekstides. Loengute, arutelude, lugemiste ja juhtumiuuringute kaudu omandavad üliõpilased täpsema arusaama sellest, kuidas sotsiaalsed, kultuurilised ja keskkonnategurid kujundavad tervishoiu tulemuslikkust ja tervishoiusüsteeme kogu maailmas. Kursus kulmineerub praktilise juhtumiuuringu projektiga, mille käigus üliõpilased viivad läbi originaaluuringu, rakendades antropoloogilisi lähenemisviise, et uurida konkreetset tervisega seotud probleemi kultuurilises kontekstis.Learning outcomes/õpiväljund:  Praktilise meditsiiniantropoloogia kursuse jooksul peaksid üliõpilased omandama mitmesuguseid oskusi ja pädevusi, mis võimaldavad neil kriitiliselt analüüsida ja käsitleda tervisega seotud küsimusi kultuuridevahelisest vaatenurgast. Need oskused hõlmavad: Kultuuriline pädevus: Üliõpilased arendavad arusaamist erinevatest kultuurilistest uskumustest, tavadest ja vaatenurkadest, mis on seotud tervise ja haigusega, võimaldades neil tõhusalt liikuda ja suhelda ka üle kultuuripiiride. Analüütiline mõtlemine: Antropoloogiliste teooriate ja meetoditega tutvumise kaudu analüüsivad üliõpilased kriitiliselt sotsiaalseid, kultuurilisi, majanduslikke ja poliitilisi tegureid, mis kujundavad tervishoiu tulemusi ja tervishoiusüsteeme, edendades keeruliste tervishoiuküsimuste detailset mõistmist. Uurimisoskused: Üliõpilased omandavad praktilisi uurimisoskusi, sealhulgas etnograafilisi uurimismeetodeid, nagu osalusvaatlus, intervjueerimine ja andmeanalüüs, valmistades neid ette empiirilise uurimistöö läbiviimiseks tervishoiu valdkonnas. Interdistsiplinaarne perspektiiv: Uurides antropoloogia, sotsioloogia, rahvatervise ja teiste distsipliinide vahelisi kokkupuutepunkte, arendavad üliõpilased interdistsiplinaarset lähenemist tervise ja tervendamise mõistmiseks, tunnustades sotsiaalsete, kultuuriliste ja bioloogiliste tegurite omavahelist seotust. Suhtlemisoskus: Loengutes toimuvate arutelude, ettekannete ja kirjalike ülesannete kaudu parandavad õpilased oma võimet väljendada oma ideid selgelt ja veenvalt nii suuliselt kui ka kirjalikult. Eetiline teadlikkus: Üliõpilased omandavad arusaama meditsiinilise antropoloogia uuringute eetilistest kaalutlustest, sealhulgas teadliku nõusoleku, konfidentsiaalsuse ja kultuuritundlikkuse küsimustest, mis võimaldab neil viia uuringuid läbi eetiliselt ja vastutustundlikult."}