{"KURSUSE_NIMI": "Tõlkepraktika", "KURSUSE_KOOD": "HVLC.07.021", "EAP": 9, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 192, "individual_work": 0, "internship": 40}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktika korraldus. \nPraktikat võib sooritada tõlkeoskust nõudval ametikohal, näiteks tõlkebüroodes, kirjastustes, kohtutes, muuseumides, turismiettevõtetes jne. Praktikakoha leiab üliõpilane üldjuhul ise ja enne praktikale asumist kooskõlastab selle ülikoolipoolse juhendajaga.\n \nPraktika kestus on kuus (6) nädalat, maht 9 EAP. Seda ei pea tegema korraga, vaid koormus ja selle ajaline jaotamine on praktikandi ja praktikakoha kokkuleppe küsimus. Praktika jooksul tehtava tegeliku töö hulk ja mahu arvestuse meetod sõltub samuti kokkuleppest praktikakoha ja ülikoolipoolse juhendajaga.  \nTegevused: vastavalt spetsialiseerumisele suuline või kirjalik tõlkimine; sõltuvalt praktikakoha iseloomust muud tõlkimise ja tõlkekorraldusega seotud tööd, nt toimetamine, terminoloogiatöö, tõlkekorraldus, konverentsikorraldus, giiditöö jneObjectives/eesmärkid:  .Praktika eesmärk on  - anda võimalus rakendada kõrghariduse omandamise jooksul saadud teadmisi  - tutvuda välja valitud ettevõtte või organisatsiooni töökorraldusega  - täiustada eneseanalüüsi oskusi ja seeläbi anda praktikandile parem ülevaade tema tugevatest ja täiendamist vajavatest külgedest - sõlmida suhteid võimalike tulevaste tööandjate ja tellijatega.Learning outcomes/õpiväljund:  .Õpiväljundid. Praktika sooritanud üliõpilane  - oskab erialateadmisi töösituatsioonis rakendada, arvestades sotsiaalset ja kultuurilist konteksti; - oskab seostada varem omandatud teadmisi ja oskusi praktiliste tööülesannete täitmisega - analüüsib oma tegevust eriala praktiliste tööalaste probleemide lahendamisel ja oskab neid kriitiliselt hinnata.  - omab konkreetsete tööülesannete ja tegevusplaani täitmise kogemust ning oskab selle käigus saavutatut konstruktiivselt hinnata Praktikandil on kaks juhendajat, ülikoolipoolne ja praktikakohapoolne. \nÜlikoolipoolne juhendaja nõustab üliõpilast praktikakoha valimisel, vaatleb vajadusel praktikandi tööd praktikakohal ja hindab koostöö laabumist; annab tagasisidet juhendajale ja praktikandile. Samuti annab ülikoolipoolne juhendaja lõpliku hinnangu praktika edukusele, kõrvutades töökohapoolse juhendaja hinnangut, praktikandi eneseanalüüsi ning isiklikke tähelepanekuid. Kui hinnangud on väga erinevad, on ülikoolipoolsel juhendajal õigus nõuda üliõpilaselt ja töökohapoolselt juhendajalt täiendavaid selgitusi. \n\nPraktikakoha poolne juhendaja tutvustab praktikandile töökorraldust, annab talle konkreetseid tööülesandeid, annab praktika jooksul tagasisidet praktikandi tegevusele ning täidab hinnangulehe, mis koos praktikandi koostatud aruandega on aluseks ülikoolipoolse juhendaja lõplikule hinnangule."}