{"KURSUSE_NIMI": "Hispaania keele eelkesktasemele I, tase A2.1 > A2.2", "KURSUSE_KOOD": "HVLC.03.029", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 60, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Teemad: tervitamine; enese ja teiste tutvustamine; maad; rahvad; keeled; arvud; järgarvud; telefoninumbrite küsimine ja ütlemine; ametid; perekond; kellaaeg; igapäevategevustest rääkimine; huvidest rääkimine; kohvikus/restoranis käimine;  kodu kirjeldamine; teenete palumine; linna kirjeldamine.\nGrammatika: reeglipäraste ja ebareeglipäraste verbide pööramine olevikus; refleksiivsete verbide pööramine; omastav asesõna; verb gustar, eessõnad, käskiv kõneviis; tegusõnade hay ja está kasutamine; tegusõnade ser ja estar kasutamine.Objectives/eesmärkid:  Kursuse põhieesmärgiks on nelja osaoskuse (lugemine, kirjutamine, kuulamine, rääkimine) süstemaatiline arendamine mitmesuguste tegevuste kaudu: 1) tekstide lugemine ja kuulamine; 2) töö sõnavaraga; 3) grammatika õppimine; 4) häälduse harjutamine.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng suudab mõista lihtsamaid hispaaniakeelseid tekste, oskab kasutada õpitud sõnavara ja grammatikat igapäevastes situatsioonides. Ta oskab olevikus rääkida ja kirjutada endast, oma  perekonnast, kodukülast/linnast, oma meelistegevustest ning saab hakkama kohvikus/restoranis käimisega. Ta suudab mõista ning luua lihtsaid suulisi ja kirjalikke tekste. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}