{"KURSUSE_NIMI": "Prantsuse keele algkursus II, tase A1.1 > A1.2", "KURSUSE_KOOD": "HVLC.03.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel A.1.1.\nSemestris käsitletavad suhtlussituatsioonid ja sõnavara:\n- ruumiline paigutamine, teejuhatamine, kohtade kirjeldamine;\n- eluaseme kirjeldamine, toa reserveerimine hotellis;\n- kuuluvuse väljendamine;\n- korralduste andmine;\n- igapäevategevuste kirjeldamine, tänasest ja eilsest kõnelemine, minevikusündmuste edasiandmine;\n- kahtluse ja kindlustunde väljendamine;\n- inimese kirjeldamine, välimus, rõivad, mood;\n- esemete kirjeldamine (vorm, värv, materjal), valik, ostmine;\n- toit, toidupoed, söögitavad, tellimine kohvikus või restoranis;\n- peod ja tähtpäevad.\nGrammatika: \n- küsilause struktuur, demonstratiivid, kuuluvuse väljendamine possessiivi ja eessõna à abil;\n- pronominaalne tegusõna;\n- käsklause, il faut + infinitiiv;\n- liitminevik passé composé;\n- jätkuv töö tegusõnaga, ülevaade kindla kõneviisi aegadest, verbivormidest;\n- umbmäärane asesõna (quelqu'un, quelque chose) ja selle vasted eituslauses;\n- kvantiteedi väljendamine, osa-artikkel (du, de la, de l').Objectives/eesmärkid:  Kursuse eesmärgiks on jätkata algtaseme keelestruktuuride ja suhtluskeele omandamist kõnes ja kirjas, arendades lugemis-, jutustamis-,  vestlus- ja kuulamisoskust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud üliõpilane on omandanud vajaliku sõnavara ja grammatika viisil, mis semestri käigus käsitletud igapäevaelu valdkondades võimaldab rakendada kõiki keelelise kompetentsi osaoskusi: mõista ja koostada erineva sisuga tekste, vestelda ning aru saada kuulatud tekstidest. Vajadusel toimub kursus e-õppe vormis. Hübriidtunde ei tehta.\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}