{"KURSUSE_NIMI": "Vene kirjanduse poeetika probleeme", "KURSUSE_KOOD": "HVLC.05.052", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 2, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kirjaniku ja lugeja, kirjanduse ja ühiskonna suhted. Kirjanduse ajaloolised ümberkujundused (läänestumine ja sekulariseerumine uue kirjanduse tekkimise mõjutava tegurina; kirjaniku enesemääramine).\nKirjanik vene kultuuriloos.\nKirjanduse emantsipatsioon ja romantism Venemaal.\nKirjanduse institutsionaliseerimine ja rahvusliku kaanoni moodustamine.Objectives/eesmärkid:  Kursuse eesmärgid: \n1) süvendada teadmisi 18. saj teise poole - 19. saj esimese poole vene kirjanduse ajaloost ja poeetikast;\n2) laiendada teadmisi kirjandusloo sotsiaalsetest teguritest, kirjanike ja avalikkuse suhetest, kirjanduse ja võimude suhetest, kirjandusala tegijate vastasmõjust;\n3) oskab analüüsida kultuurinähtusi ajaloolises ja sotsioloogilises perspektiivis.\n\n\nOsa 2. L. Pild.\n\n\n Kursuse 2. osa eesmärgid:\n\n1) Laiendada üliõpilaste teadmisi vene kirjanduse modernistlikust perioodist\n2)Vormida ja täiendada üliõpilaste oskusi ilukirjandusliku teksti analüüsil. Suunata nende tähelepanu sümbolistliku teksti struktuuri eripärale\n3) Vormida üliõpilaste ettekujutust sümbolistlikust elu- ja müüdiloomest, milledel põhinevad nende tekstid.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:\n1) tunneb ja suudab analüüsida kirjandusloo fakte kaasaegse situatsiooni kontekstis;\n2) oskab analüüsida kirjandusloo sotsiaalseid tegureid, hinnata nende mõju individuaalsele poeetikale;\n3) omab ettekujutust vene kirjanduskaanonist, selle kujunemisest ja kujunemisteguritest.\n\n\nOsa 2..L,Pild .Kursuse 2. osa läbinud üliõpilane:\n\nOmab süsteemseid teadmisi vene sümbolismi esteetikast ning poeetikast;\nOmab ettekujutust 19.saj lõpu- 20.saj alguse vene sümbolistide tekstidest;\nOskab välja tuua ning analüüsida vene sümbolistliku romaani erisusi;\nSuudab kirjeldada ja analüüsida vene dekadentliku luule eripära;\nSuudab iseseisvalt töötada allikmaterjalidega\nOskab analüüsida ja kriitiliselt hinnata teemaga seotud kirjandusteaduslikke uurimusi."}