{"KURSUSE_NIMI": "Prantsuse keel eelkesktasemele I, A2.1 > A2.2", "KURSUSE_KOOD": "HVLC.03.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel A2 või TÜ maailma keelte ja kultuuride kolledži prantsuse keele kursuse kolmanda semestri edukas läbimine.\nKursusel käsitletav sõnavara ja grammatika on seotud järgnevate teemadega:\n- sport ja tervis;\n- inimese iseloomu ja isiksuse kirjeldamine;\n- stress ja selle põhjused;\n- uued tehnoloogiad;\n- prantsuse seltskonnakombestik;\n- kultuuride võrdlus;\n- Frankofoonia keeleline varieeruvus, kõlalised ja sõnavaralised erinevused sõltuvalt maast või piirkonnast (Québec, Belgia jne);\n- erinevad keeleregistrid, ametlik ja kodune kõnepruuk, kirja- ja kõnekeel;\n- tarbimiskultuur vs ökoloogilised valikud;\n- oma kogemustest, maitseeelistustest ja tegevustest kõnelemine;\n- tänapäevane elu võrreldes vanavanemate eluga;\n- tööelu (tingimused, väärtused, võimalikud konfliktid).\nGrammatika põhifookus on minevikuaegadel, tulevikul, tingival kõneviisil ja siduvatel asesõnadel.Objectives/eesmärkid:  Eelkesktaseme kursus, mille käigus arendatakse vestlus-, kuulamis-, lugemis- ja kirjutamisoskust ning kinnistatakse juba teoreetiliselt tuttavaid keelestruktuure. Kursuse põhirõhk on (prantsuse keelt emakeelena kõneleva) õpetaja poolt läbi viidavais tundides suuliste osaoskuste treeningul.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane on õppinud end väljendama selgemini, sõnavara ja väljendite poolest rikkamas keeles, mõistab paremini nii suulist kui kirjalikku teksti. Üliõpilase keelekasutus on arenenud nii kõnerütmi kui foneetika seisukohalt, on suurenenud valmisolek end prantsuse keeles väljendada. Äärmisel vajadusel toimub kursus kogu keeleõpperühmale e-õppe vormis. Hajatunde ei tehta.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/noustamiskeskus.\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}