{"KURSUSE_NIMI": "Poola keel eelkesktasemele II (inglise keele baasil), tase A2.2 > B1.1", "KURSUSE_KOOD": "HVLC.05.050", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on ülesehitatud poola keele vormiõpetuse ja lauseõpetuse praktilistel aspektidel. Tähelepanuallikateks on nimisõnad, omadussõnad, määrsõnad, eessõnad, tegusõnad jne. Põhiliselt õpitakse kursusel suulise ja kirjaliku kõne oskusi: lugemist, tõlkimist ja erinevate raskusastmetega tekstide analüüsimist.\n\nArutluste põhiteemad:\n1. isiksused, huvialad\n2. töö, hõivatus\n3. tulevikuplaanid\n4. linn, turism\n5. inimestevahelised suhted\n6. eetika\n7. olmetarbed\n8. televisioon, kino, raamatud\n9. tehnoloogia ja leiutised.\n\nGrammatika põhiküsimused:\n1. tegusõna mineviku, oleviku ja tuleviku vormid\n2. artiklite kasutamine\n3. modaaltegusõnad\n4. tingimust väljendavad laused\n5. gerundiiv ja infinitiiv\n6. passivi kasutamine.Objectives/eesmärkid:  Keelekursuse käigus saavad üliõpilased täiendada oma poola keele teadmisi, oskusi ja grammatikat. Arendavad poola keele suulisi ja kirjalikke oskusi, tõlke osakust ja erinevate tekstide analüüsimise oskust, mille abil saavad võrrleda oma teadmisi erinevates valdkondades. Kursus keskendub suuremas osas praktilistele tundidele ning teoreetilistele alustele, mis on vajalikud arutluse ja analüüsi arendamiseks. Kursus on mõeldud kõigile üliõpilastele, kes huvituvad poola keelest ja kultuurist.Learning outcomes/õpiväljund:  Kursuse lõpuks oskavad üliõpilased kasutada poola keele grammatikat B1 tasemel ning lisaks oskavad võrrelda teadmisi poola keelega seotud teiste teaduslike valdkondadega. Nad oskavad moodustada grammatiliselt õigeid keelelisi struktuure ning kasutades vastavat terminoloogiat oskavad selgitada oma valikuid, mis omakorda seonduvad õpitud reeglitega."}