{"KURSUSE_NIMI": "Taani keel kesktasemele, tase B1.1 > B1.2", "KURSUSE_KOOD": "HVLC.06.029", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on mõeldud teise aasta tudengitele, kes õpivad Skandinaavia keelte ja kultuuride erialal. Kursusel osalemise eeltingimusteks on taani keele teadmised Euroopa Nõukogu keeleoskustasemel B1. Kursus on üles ehitatud praktilisele keelekasutusele sh. sõnavara laiendamisele ja grammatikaküsimustele. Tunnid eeldavad aktiivset osavõttu, teeme palju rühma- ja paaristööd. Samuti on suur rõhk iseseisval tööl Moodle'i keskkonnas.Objectives/eesmärkid:  Kursuse eesmärgiks on süvendada tudengite praktilist taani keele oskust ja viia see Kursuse eesmärgiks on süvendada tudengite praktilist norra keele oskust ja viia see Euroopa Nõukogu keeleoskustasemele B1.2, arendada tudengite oskuseid taani keele lugemises, rääkimises, kuulamises ja kirjutamises, süvendada teoreetilised alusteadmised, mis on vajalikud lingvistilise arutelu ja analüüsi jaoks ning suurendada teadmisi taani keele ühiskonnale ja kultuurile omastest väljendusviisidest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane:\n\n- saab aru tekstidest endale tuttaval ja huvipakkuval teemal, nagu töö, kool, vaba aeg vm;\n- vestleb ladusalt endale tuttavatel ja huvipakkuvatel teemadel;\n- esineb ettevalmistunult lihtsas keeles endale tuttaval teemal, väljendudes võrdlemisi selgelt ja arusaadavalt;\n- koostab lihtsat teksti tuttaval või enda jaoks huvipakkuval teemal;\n- rakendab teoreetilisi alusteadmisi taani filoloogia valdkonnas;\n- kirjeldab kogemusi, sündmusi, unistusi ja eesmärke ning põhjendab ja selgitab lühidalt \noma seisukohti ja tulevikuplaane;\n- mõistab eesti ja taani kultuurierisusi ning arvestab nendega nii suulises kui kirjalikus keelekasutuses."}