{"KURSUSE_NIMI": "Rootsi keel algtasemele II (inglise keele baasil), tase A1.2 > A2.1", "KURSUSE_KOOD": "HVLC.06.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Peamised vestlus- ja grammatikateemad: \n\nHarjutame palju reaalseid suhtlusolukordi, arendame sõnavara, mida võid vajada \"kohe täna\" Rootsi õppima v elama asudes ning Rootsit külastades.\n\nSõnavara: perekond ja sugulased, inimeste kirjeldamine, poes käik, kombed ja traditsioonid, kirja kirjutamine, sport. Rootsi kultuur ja ühiskond; sissejuhatavad väljendid ärikeeles ja koosolekusõnavara.\nGrammatika: Aegade tabel. Preteritum, Perfekt, Pluskvamperfekt. Omadussõnad ja määrsõnad - ühildumine nimisõnaga (kordus). Ajaväljendid. Sõnade järjekord kõrvallauses. Määratlussõna tabel. Modaalverbid. S-tegusõna: vastastikused tegusõnad, depoonens ja passiiv. Enesekohased tegusõnad ja asesõnad. Oleviku ja mineviku kesksõna. Omadussõnade võrdlusastmed. Sihilised ja sihitud verbid. Liitverbid. Passiiv. Lühendid.Objectives/eesmärkid:  NB! Kursusel osalemiseks on kohustuslik kursuse rootsi keel algajatele I läbimine v sellele vastavad oskused ( tõend, et läbitud on vähemalt 30x2 akadeemilise tunniga kursus).\n\nJätkukursusel tegeletakse:\n\n1. Sõnavara arendamine ja grammatikastruktuuride omandamine A1-A2 tasemel.\n2. osata kõneleda ning mõista igapäevaseid suhtlemissituatsioone tasemel A2.\n3. Osata lugeda tekste tasemel A2-B1.\n4. Hääldamise viimistlemine, jõudmaks tasemele A2-B1.\n5. Kirjutamisoskuse arendamine: eesmärk - suuta kirjutada iseseisvalt etteantud teemadel omandatud grammatika piires - A2.\nTekstid, vestlusteemad ja videod keeletasemel A2/B1. \nEttekanded, rühmatööd, õpivisiidid ja -üritused.\n6. Mõista tekste (kuulamine, autentsed tekstid ja õppematerjalid ) ja suuta kõnelda tasemel A2.\n7. Samuti tutvume erinevate tegevuste käigus põgusalt rootsi kultuuri, ühiskonna ja igapäevaeluga\n\nTekstid, vestlusteemad ja videod keeletasemel A1-1A2/B1. Ettekanded, rühmatööd, õpivisiidid ja -üritused.Learning outcomes/õpiväljund:  Kursuse lõpuks on sõnavara suurenenud ning kõnelemisoskus arenenud tasemeni A2; grammatikatase, lugemis- kuulamis- ja kirjutamisoskus arenenud tasemeni A2. Rootsi ühiskonna ja kultuuriga lähemalt tutvumine. Rootsi koosoleku-, äri- ning suhtlusstiiliga tutvumine ( valitud õppuritele rootsi ärikeele õppereis Soome). Dear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling.\nRequiring special conditions at the end of the semester is not acceptable."}