{"KURSUSE_NIMI": "Prantsuse keel kõrgtasemele II, B2.2 > C1.1", "KURSUSE_KOOD": "HVLC.03.015", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "The course presupposes the Council of Europe Level B2.\nThe course will be given in French. Students are expected to speak French during the course as well. \nA particular focus will be given to the oral comprehension and expression. Some grammar structures will be studied as well.\nVarious topics related to french culture and the actuality will be studied during the semester. Authentic documents will be given as much as possible, in order to familiarize students to an authentic language.Objectives/eesmärkid:  Le but du cours est de développer les compétences orales et écrites en français et également de les entretenir. Les étudiants apprendront comment s'exprimer de façon plus naturelle et amélioreront leur compréhension de la langue française.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: A la fin du niveau, les étudiants pourront s'exprimer couramment en français. Il comprendront des textes variés et difficiles. Il parleront sans chercher leurs mots. La langue sera utilisée de façon efficace, que ce soit dans un contexte social, professionnel ou académique. Le discours est organisé et cohérent. Vajadusel toimub kursus e-õppe vormis. Hajatunde ei tehta.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine.\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}