{"KURSUSE_NIMI": "Kultuur ja suhtlus", "KURSUSE_KOOD": "HVLC.00.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel õpitakse tundma erinevatele kultuuridele iseloomulikke suhtlemisviise, keskendudes inimestevahelisele suhtlusele ja selle olulistele aspektidele (nt viisakuskäitumine, aja- ja ruumikasutus, kultuurilised väärtused). Lisaks auditoorsele sissejuhatusele tehakse osalejatele kättesaadavaks erinevad videomaterjalid, mis näitlikustavad kultuuridevahelises suhtluses potentsiaalselt keerukaid teemasid ning toovad näiteid erinevatest hakkamasaamistrateegiatest. Uuritakse visuaalseid või tekstuaalseid allikmaterjale ning erinevaid juhtumiuuringuid. Seminarides tõmmatakse paralleele materjali ning osalejate isiklike kogemuste vahel ning arutatakse keerulisemate juhtumite detaile. Objectives/eesmärkid:  Kursuse eesmärgiks on täiendada üliõpilase teadmisi maailma erinevatest kultuuridest, pöörates ennekõike tähelepanu kommunikatsiooniviisidele ning interpersonaalses suhtluses tõusetuda võivatele möödarääkimistele. Üliõpilasi suunatakse kultuure omavahel võrdlema, keskendudes kultuurikäitumise eri tahkudele (nt viisakuskäitumine, aja- ja ruumikasutus, kultuurilised väärtused) ning läbi konkreetsete näidete analüüsi arendama oma kultuuridevahelise suhtluse pädevust ning hakkamasaamist mitmekultuurilistes keskkondades.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: mõistab kultuuridevahelises interpersonaalses suhtluses olulisi käitumise aspekte (nt viisakuskäitumine, aja- ja ruumikasutus, kultuurilised väärtused), oskab kultuure võrrelda ja mõista ning arendab oma kultuuridevahelise suhtluse pädevust. Erinevate tööde käigus arendavad üliõpilased ka kriitilise mõtlemise ja rühmatöö tegemise oskust, empaatiat ja suhtlusoskust. . Aine toimub hüdriidselt: asünkroonne e-õpe ja auditoorsed seminarid e-õppena läbitud materjalide arutamiseks"}