{"KURSUSE_NIMI": "Prantsuse keele algkursus II (inglise keele baasil), tase A1.1 > A1.2", "KURSUSE_KOOD": "HVLC.03.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel A.1.1.\nSemestris käsitletavad suhtlussituatsioonid ja sõnavara:\n- ajakavast rääkimine, kellaaeg;\n- kohtumise kokku leppimine;\n- eluaseme kirjeldamine, toa reserveerimine hotellis;\n- ruumiline paigutamine, teejuhatamine, kohtade kirjeldamine;\n- kuuluvuse väljendamine;\n- korralduste andmine;\n- igapäevategevuste kirjeldamine, tänasest ja eilsest kõnelemine, minevikusündmuste edasiandmine;\n- inimese kirjeldamine, välimus, rõivad, mood;\n- esemete kirjeldamine (vorm, värv, materjal), valik, ostmine;\n- toit, toidupoed, söögitavad, tellimine kohvikus või restoranis.\nGrammatika:\n- jätkuv töö tegusõnaga, ülevaade kindla kõneviisi aegadest, verbivormidest;\n- küsilause struktuur, inversiooniga küsimus;\n- demonstratiivid, kuuluvuse väljendamine possessiivi ja eessõna à abil;\n- pronominaalne tegusõna;\n- käsklause, il faut + infinitiiv;\n- liitminevik passé composé;\n- umbmäärane asesõna (quelqu'un, quelque chose) ja selle vasted eituslauses;\n- kvantiteedi väljendamine, osa-artikkel (du, de la, de l').Objectives/eesmärkid:  Kursuse eesmärgiks on jätkata algtaseme keelestruktuuride ja suhtluskeele omandamist kõnes ja kirjas, arendades lugemis-, jutustamis-, vestlus- ja kuulamisoskust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud üliõpilane on omandanud vajaliku sõnavara ja grammatika viisil, mis semestri käigus käsitletud igapäevaelu valdkondades võimaldab rakendada kõiki keelelise kompetentsi osaoskusi: mõista ja koostada erineva sisuga tekste, vestelda ning aru saada kuulatud tekstidest. Äärmisel vajadusel toimub kursus kogu keeleõpperühmale e-õppe vormis. Hajatunde ei tehta.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/en/counselling-centre.\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}