{"KURSUSE_NIMI": "Erialane inglise keel füüsika, keemia ja materjaliteaduse üliõpilastele (100% e-õpe), tase B2 > C1", "KURSUSE_KOOD": "HVLC.01.010", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel loetakse erialaseid tekste ning kuulatakse erialaseid loenguid, tehakse sõnavara- ning kuulamisülesandeid. Osalejatelt eeldatakse vähemalt B2 keeleoskustaset.Objectives/eesmärkid:  Kursuse eesmärgiks on sõnavara laiendamine ning kuulamis- ja lugemisoskuse parandamine erialaste teemade raames.Learning outcomes/õpiväljund:  Üliõpilane on omandanud kursuse raames läbitud sõnavara; oskab teha akadeemilist erialast ettekannet; on arendanud erialaste tekstide lugemis- ja kuulamisoskust. 1. By registering for this course you agree with the course requirements and policies.\n2. Please note the deadline for dropping the course. If you want to drop the course after the deadline, you need to contact the study coordinator (marilii.adamson (at) ut.ee).\n3. You are expected to maintain the highest standards of academic integrity. Academic misconduct (copying text/sentences and presenting it as one's own, not using paraphrasing, not crediting the sources) will be penalised according to the university's regulations.\n4. All study debts need to be settled by Jan 14 (tasks)/16 (tests), 2023.\n5. You can sit each test twice.\n6. This is not a grammar/writing course.\n7. This course is non-graded (pass/fail). Foreign and Erasmus exchange students can get a course attainment percentage at the end of the course. If they want the attainment percentage, they need to inform me in advance.\n8. Failing to meet deadlines constantly results in failing the course. If you need extension, let me know in advance!\n9. I do not read and assess overdue written tasks.\n10. In case of any problems, contact me right away to find a solution."}