{"KURSUSE_NIMI": "Inglise kirjandus keskajast romantismini", "KURSUSE_KOOD": "HVLC.01.074", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 60, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse loengud koosnevad teoreetilisest ja praktilisest osast. Teoreetilises osas vaadeldakse ajastu kultuuripilti tervikuna, läbi arhitektuuri ja kaunite kunstide, et tuua välja vastastikused mõjud kirjandusega ja anda laialdased taustteadmised, mille põhjal siis vaadeldakse valitud representatiivseid tekste, et avada kultuurilised seosed ja selgitada erinevate kirjanduslike stiilide ja voolude põhialuseid. Sellele vastavalt on ka eksam kaheosaline, koosnedes teoreetilisest ja praktilisest osast. Kursust illustreerib rikkalik pildimaterjal. Kõik kursuse materjalid on leitavad kodulehel sisu.ut.ee/pilvirajamae.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade inglise kirjanduse põhisuundadest alates vana-inglise kirjandusest kuni kaheksateistkümenenda sajandi viimase veerandini. Sel eesmärgil vaadeldakse erinevaid kirjandusilminguid nende ajaloolises kontekstis ja seoses arengutega kujutavas kunstis ning arhitektuuris, et käsiteldavast perioodist kujuneks terviklik ülevaade.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursus läbinuna on üliõpilane võimeline orienteeruma käsiteldava perioodi inglise kirjanduse erinevate stiilide ja voolude kujunemises nende ajaloolises kontekstis ja paigutatuna üldisesse kultuuripilti, mille lahutamatuks osaks nad on. Ta tunneb ära ja eristab erinevate perioodide stiile ja iseärasusi nende tekstide põhjal, mida kursuse jooksul käsitletakse. Ta orienteerub erialases terminoloogias, olles seda harjutanud nii konspekteerides loengus kuuldut kui töötanud õpikutekstidega. Ta on võimeline analüüsima selle perioodi kirjandustekste ja looma ka ise erialast teksti. Õppeaine on soovitavaks eeldusaineks kursusele \"Inglise kirjandus romatismist modernismini\" 3 EAP"}