{"KURSUSE_NIMI": "Kreeka eepika", "KURSUSE_KOOD": "HVLC.02.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse Kreeka  autorite eepikateoseid. Homerose ja Hesiodose eeposte näitel tutvustatakse Kreeka eepose kui suulise luule eripära, selgitatakse dialektilisi eripärasid, mütoloogilisi aspekte.Objectives/eesmärkid:  Kursuse jooksul on kavas lugeda katkendeid Homerose \"Iliasest\" (üks osa, 3 EAPd) ning Hesiodose \"Töödest ja päevadest\" või \"Theogoniast\" (üks osa, 3 EAPs), käsitleda nende luuleteoste tähtsamaid teemasid. Lisaks õpivad üliõpilased kirjutama kirjanduskriitilist kommentaari teoselõigu kohta, mis hõlmab lõigus esinevaid teemasid, stiilivõtteid, mütoloogilisi detaile ja keelekasutuse eripärasid. Kursuse lõpuks on üliõpilased suutelised iseseisvalt lugema  läbivõetud tekstikatkendeid kreeka keeles ja koostama kommentaari etteantud tekstilõigu kohta eksami tingimustes. \nSemestri jooksul saavad üliõpilased tuttavaks terve \"Iliasega\" tõlke baasil ning loevad läbi \"Tööde ja päevade\" eestikeelse tõlke ning oskavad asetada loetud katkendid tervikteose konteksti.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: tõlgib ja analüüsib ilma suuremate vigadeta värssteksti kreeka keeles; selgitab teose stilistilisi eripärasid; oskab lugeda kreeka heksameetrit; selgitab üldjoontes teoste ajaloolist ja kultuurilist tausta; õpib leidma ja kasutama sekundaarkirjandust. Kursus toimub põhiliselt kontaktõppena, vajadusel on võimalik osaleda BBB vahendusel (selle sooviga palume pöörduda õppejõu poole, automaatselt praktikume veebis üle ei kanta), praktikume ei salvestata. \nKursuse läbimiseks vajaliku ajakulu soovituslik arvestus:\n3 EAP = 78 tundi. Sellest \nauditoorne töö (kontaktõpe): 13x1,5 - 19,5 tundi\neksam - 0.5  tundi\neksamiks valmistumine - 8 tundi\niganädalane praktikumiks valmistumine -  26 tundi (2 tundi nädalas)\n3 eksamiülesannet - 24 tundi (igaühele 8 tundi)"}