{"KURSUSE_NIMI": "Rootsi keel algtaseme läbinuile (süvaõpe), tase A2 > B1", "KURSUSE_KOOD": "HVLC.06.025", "EAP": 12, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 128, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 184, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Rootsi keel algtaseme läbinuile (süvaõpe) on jätkukursus HVLC.06.022 Rootsi keel algtaseme läbinuile (süvaõpe), tase 0>A2'le Skandinaavia keelte ja kultuuride valdkonnas rootsi keele ja kirjanduse harus õppivatele üliõpilastele. Kursusel osalemise eeltingimusteks on rootsi keele teadmised Euroopa Nõukogu keeleoskustasemel A2. Tunnid eeldavad aktiivset osavõttu, teeme palju rühma- ja paaristööd. Samuti on suur rõhk iseseisval tööl.\n\nKäsitletavad teemad:Objectives/eesmärkid:  Kursuse eesmärgiks on süvendada praktilist rootsi keele oskust ja viia see Euroopa Nõukogu keeleoskustasemele B1, omandada teoreetilised alusteadmised rootsi filoloogia valdkonnas ning omandada ülevaade rootsi kultuurile ja ühiskonnale iseloomulikest joontest.Learning outcomes/õpiväljund:  Kursuse läbinud läbinud üliõpilane: - saab aru tekstidest endale tuttaval ja huvipakkuval teemal, nagu töö, kool, vaba aeg vm; - vestleb ladusalt endale tuttavatel ja huvipakkuvatel teemadel; - esineb ettevalmistunult lihtsas keeles endale tuttaval teemal, väljendudes võrdlemisi selgelt ja arusaadavalt; - koostab lihtsat teksti tuttaval või enda jaoks huvipakkuval teemal; - on omandanud teoreetilised alusteadmised rootsi filoloogia valdkonnas; - mõistab eesti ja rootsi kultuurierisusi ning arvestab nendega nii suulises kui kirjalikus keelekasutuses. - Osavõtt praktikumidest üle 75%: lisaülesannete tegemist puudumiste pärast ei nõuta.\n- Osavõtt 50%-74%: Positiivse eksamihinde saamiseks nõutakse lisaülesannete tegemist ja nende eest positiivse hinde saamist. Lisaülesandeid antakse seda rohkem ja suuremaid, mida väiksem on olnud osavõtt.\n- Osavõtt alla 50%: ÕISi kantakse eksamihindeks \"F\". Üliõpilasel ei ole õigust juunis eksamile tulla."}