{"KURSUSE_NIMI": "Bakalaureuseseminar ja -töö", "KURSUSE_KOOD": "HVLC.02.008", "EAP": 6, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Bakalaureuseseminar lõppeb kaheosalise eksamiga: kirjalik eksam (tõlge) ja bakalaureusetöö, mida kaitstakse suuliselt eksaminõukogu ees. Kirjalik eksam koosneb kahe tundmatu tekstikatkendi (ladina ja vanakreeka keelest) kirjalikust tõlkest ja grammatilisest analüüsist, sõnaraamatu abil (kuid ilma grammatikata).  \nKursuse vältel tehakse seminarides ettevalmistusi eksamiks, samuti valmistutakse bakalaureusetöö kirjutamiseks. Tutvustatakse vajalikke tekstivormistamise ja bakalaureusetöö nõudeid, vajadusel vormistamise vahendeid. Vaadatakse, kuidas töö sisuliselt üles ehitada, vormistada korrektsed viited. Antakse juhiseid info otsimiseks ja allikate kriitiliseks hindamiseks.Objectives/eesmärkid:  Seminar valmistab üliõpilasi ette iseseisvaks uurimistööks. Õpitakse tundma ja kriitiliselt lugema teemaga seonduvat erialakirjandust ning kasutatavat uurimimeetodit. Õpitakse tundma uurimistöö ülesehituse ja vormistuse peensusi. Õpitakse koostama uurimistöö plaani ja ajakava ja seda järgima. Üks osa seminarist keskendub ka võõra ladina- ja vanakreekakeelse teksti tõlkimiseks ettevalmistamisele ja selleks vajaliku juba õpitud materjali ülekordamisele. Põhieesmärk on toetada üliõpilasi bakalaureusetöö kirjutamisel (ja tõlke-eksamiks valmistumisel) ning anda  nende tööle regulaarset tagasisidet.Learning outcomes/õpiväljund:  Bakalaureuseseminari läbinud üliõpilane: 1) mõistab ja tõlgib iseseisvalt kergemat vanakreeka ja ladinakeelset teksti sõnaraamatu abiga, valib tõlkimiseks sobiva taktika;  2) analüüsib teksti morfoloogilist, süntaktilist ja leksikaalset struktuuri, selgitab tekstis leiduvaid viiteid antiiksetele reaalidele, olulisematele isiku- ja kohanimedele; 3) suudab iseseisvalt leida ja hindab kriitiliselt uurimistööks vajalikke erialaseid allikmaterjale (nii paberkandjal kui elektroonilisi ressursse kasutades); 4) püstitab uurimisküsimuse, lahendab uurimisprobleemi rakendades selleks sobivat uurimismeetodit, põhjendab  uurimistöös saavutatud tulemusi; 5) planeerib uurimistöö kirjutamisel oma aega, reflekteerib oma tööprotsessi üle, teeb koostööd juhendajaga ja kaasüliõpilastega;  6) esitleb oma töö tulemusi avalikul kaitsmisel, arutleb tööprotsessis esinenud probleemide üle, põhjendab uurimistöö käigus tehtud valikuid; 7) kirjutab korrektses keelepruugis uurimistöö, kasutab uurimistöö kirjutamiseks, vormistamiseks, esitamiseks ja kaitsmisel sobilikke digitaalseid abivahendeid."}