{"KURSUSE_NIMI": "Prantsuse keel kesktasemele I, B1.1 > B1.2", "KURSUSE_KOOD": "HVLC.03.012", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel B.1 või keelekeskuse neljanda semestri edukas läbimine. \nKursusel käsitletav sõnavara ja grammatika on seotud järgnevate teemadega:\n- Erinevate keeleregistrite kasutamine (hoolitsetud kõnepruuk; ametlik versus kodune kõnepruuk), prantsuse kõnekeele variatsioonid (verlan, argoo jne.)\n- Ajakirjanduse lugemise oskus: ülevaade üleriiklikest väljaannetest (päeva- ja nädalalehed ning tähtsamad ajakirjad)\n- Mõista uudiste kajastamist meedias, osata uudist edastada\n-  Erinevad isiksusetestid\n- CV ja motivatsioonikirja koostamine\n-  Reklaam, reklaamikampaaniate seos ühiskonnaelu küsimustega\n-  Stereotüübid, kõneldes erinevatest maadest ja rahvastest \n-  Ebausk ja sellega seotud kombed\n-  Filmitutvustuse mõistmine ja koostamine, filmikriitika, hinnangute andmine\n-  Mitmekultuuriline Prantsusmaa\nHarjutatavad kõneaktid: arvamuste, soovide, lootuste, ootuste, kahtluse ja kindlustunde väljendamine; oletuste tegemine.\nGrammatika:\nsiduvad asesõnad, isikulised asesõnad, minevikuajad ja ajaväljendid, eituslause, umbisikuline tegumood, tingiv ja kahtlev kõneviis.Objectives/eesmärkid:  Kesktaseme kursus, mille käigus arendatakse vestlus-, kuulamis-, lugemis- ja kirjutamisoskust ning peamiselt kinnistatakse juba teoreetiliselt tuttavaid keelestruktuure. Kursuse põhirõhk on prantsuse keelt emakeelena kõneleva õpetaja poolt läbi viidavais tundides suuliste osaoskuste treeningul.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane on nii kõnes kui kirjas õppinud end väljendama selgemini, sõnavara ja väljendite poolest rikkamas keeles, mõistab paremini nii suulist kui kirjalikku teksti. Üliõpilase keelekasutus on spontaansetes kõnesituatsioonides muutunud korrektsemaks. Vajadusel toimub kursus e-õppe vormis. Hübriidtunde ei tehta.\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}