{"KURSUSE_NIMI": "Inglise keele praktiline grammatika II", "KURSUSE_KOOD": "HVLC.01.003", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel käsitletakse seminaride (30 tundi) ja iseseisva töö (48 tundi Moodle keskkonnas) vormis inglise keele morfoloogiat ja süntaksit. Kursuse teises osas käsitletakse järgnevaid teemasid: lauseliikmed, verbid, ajavormid, modaalverbid, passiiv ja kausatiiv, tingimuslaused ja verbi täiendid. Lisaks tutvutakse võtetega, mida saab kasutada töös akadeemiliste teabeallikatega ning arutletakse õpioskuste ja õpistrateegiate rakendamise üle. Objectives/eesmärkid:  Kursuse eesmärgiks on arendada üliõpilaste teadmisi grammatikast ja nende teadmiste rakendamist eneseväljendamisel. Kursuse keskmes on praktilised keeleõppeharjutused, mida sooritatakse individuaalselt ja rühmatööna, toetudes erinevatele akadeemilistele teabeallikatele. Lisaks sellele omandavad üliõpilased keeleteaduslikuks aruteluks vajalikud teoreetilised teadmised, mida rakendatakse teksti analüüsimisel ja loomisel teistes eriala ainetes. Lisaks erialaoskustele arendab kursus ka üldoskusi nagu informatsiooni töötlemine, kriitiline mõtlemine, suhtlus- ja koostööoskus ning digioskused. Kursuse käigus arendatakse õpipäeviku ja seminari arutelude abil selliseid õpioskusi nagu oma õppimise eesmärgistamine ja kavandamine, ajaplaneerimine, õpistrateegiate kasutamine ja eneserefleksioon. Kursus on mõeldud esimese aasta üliõpilastele, kelle peaerialaks on inglise keel ja kirjandus.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane - nimetab olulised mõisted läbitud grammatikateemade kohta (lauseliikmed, verbid, ajavormid, modaalverbid, passiiv ja kausatiiv, tingimuslaused, verbi täiendid) ja selgitab neid mõisteid, tuues näiteid;  - analüüsib ja seletab keelestruktuuride kasutust, viidates vastavatele grammatikareeglitele ja kasutades korrektset terminoloogiat;  - valib ja loob inglise keeles korrektseid grammatilisi struktuure, toetudes selle hulgas ka digitaalsetele teabeallikatele ja materjalidele;  - on teadlik oma tugevatest ja nõrkadest külgedest inglise keele grammatikas; leiab ja kasutab abimaterjale oma grammatikateadmiste arendamiseks;  - loeb kriitiliselt erinevat tüüpi tekste, toob välja tekstide põhisõnumid;  - osaleb paaris- ja rühmatöös, jagades ja argumenteerides oma arvamust ning panustades rühma eesmärgi saavutamisse;  - eesmärgistab ja kavandab oma õpiprotsessi, rakendab erinevaid õpistrateegiaid ja reflekteerib oma õppimise üle. "}