{"KURSUSE_NIMI": "Balti mõtte lugu", "KURSUSE_KOOD": "HVLC.04.057", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine raames arutletakse küsimuse üle, mida tähendab \"Balti\"/\"balti\" nii ajaloolises perspektiivis kui ka tänapäeval. Mis alasid ja rahvaid on see erinevatel perioodidel tähistanud? Kuidas on erinevates ajaloolistes situatsioonides konstrueeritud \"balti\" identiteeti? Kuidas mõjutab ajalooline taust tänapäeval Baltikumi mõtestamist? Kuigi sõnaga \"Balti\" või \"balti\" võib tähistada erinevaid kooslusi, on üheks läbivaks jooneks mitme rahva või piirkonna koostöö. Sellest tulenevalt laseb balti/Balti ideele keskendumine arutleda ka laiemalt võimaluste ja väljakutsete üle, mis kerkivad esile erinevate rahvaste ja/või riikide koostöös.\nObjectives/eesmärkid:  -\tTutvustada mõiste \"Balti\"/\"balti\" erinevaid tähendusi selle varasest ajaloost tänapäevani\n-\tAnalüüsida \"Balti\"/\"balti\" mõistet erinevatest perspektiividest ning seostatuna teiste rahvuslike ja regionaalsete määratlustega\n-\tArutleda erinevate rahvaste ja piirkondade koostöö võimaluste ja kitsaskohtade üle\nÕpiväljundidLearning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine edukalt sooritanud üliõpilane\n-\tteab \"Balti\"/\"balti\" erinevaid tähendusi ja oskab neid siduda ajalise ja ruumilise kontekstiga\n-\ton lugenud ja oskab kriitiliselt arutleda ajalooliste alliktekstide ja sekundaarkirjanduse üle Õppeaine toimub germanistika osakonnas, saksa keele oskus tuleb kasuks, kuid pole kohustuslik. Seminaride lugemismaterjalide valikul arvestatakse osalejate keeleoskust. Loomult interdistsiplinaarne õppeaine ning võib hästi sobida valik- või vabaaineks ka teiste erialade tudengitele kõigil õppeastmetel. Õppeaine maht on 6 EAP-d, kuid kokkuleppel õppejõuga on võimalik sooritada vaid aine 1. osa (3 EAP) ehk saada arvestus seminarideks ettevalmistavate memode ja semestri vältel aktiivse seminarides osalemise eest. \n \nKüsimuste korral võtke palun ühendust õppeainet vedava õppejõu, üldajaloo nooremteaduri Kadi Kähär-Petersoniga (kadi.kahar-peterson@ut.ee)."}