{"KURSUSE_NIMI": "Prantsuse keele algkursus III (inglise keele baasil), tase A1.2 > A2.1", "KURSUSE_KOOD": "HVLC.03.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel osalemise eelduseks on prantsuse keele teadmised Euroopa Nõukogu keeleoskustasemel A1.2.\nSemestris käsitletavad suhtlussituatsioonid ja sõnavara:\n- õpingud ja õppimine;\n- arvamuse avaldamine, emotsioonide verbaalne väljendamine, motivatsiooni ja eelistuste selgitamine;\n- majutus- ja elukohtade tüübid ja kirjeldamine;\n- võrdlemine;\n- igapäevategevused;\n- nõuannete küsimine ja andmine;\n- mineviku kirjeldamine (mälestused, harjumused), eluloost rääkimine, minevikulugude jutustamine, oma kogemuste edastamine.\nGrammatika: \n- tegusõna pööramine olevikus (ülevaatlik kordamine);\n- sihitisasesõnade kordamine: otsesihitis COD (pronom personnel complément d'objet direct) ja kaudsihitis COI (pronom personnel complément d'objet indirect);\n- kohaasesõna Y ja kohaeessõnad;\n- kesk- ja ülivõrre;\n- põhjendavad sidesõnad;\n- siduvad asesõnad (qui, que, où);\n- umbmäärased ase- ja omadussõnad;\n- minevikuajad: kestev minevik imparfait, liitminevik passé composé ja ülevaade mineviku kesksõnade ühildumisest;\n- sobiva minevikuaja (imparfait või passé composé) valik minevikuloo jutustamisel;\n- kestev olevik présent continu.Objectives/eesmärkid:  Kursuse eesmärgiks on jätkata algtaseme keelestruktuuride ja suhtluskeele omandamist kõnes ja kirjas, arendades lugemis-, jutustamis-, vestlus- ja kuulamisoskust. Rõhku pööratakse sihitisasesõna ja levinumate minevikuaegade kasutamisele.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud üliõpilane on omandanud vajaliku sõnavara ja grammatika viisil, mis semestri käigus käsitletud temaatika piires võimaldab rakendada kõiki keelelise kompetentsi osaoskusi: mõista ja koostada erineva sisuga tekste, vestelda ning aru saada kuulatud tekstidest nii olevikus kui minevikus. Äärmisel vajadusel toimub kursus kogu keeleõpperühmale e-õppe vormis. Hajatunde ei tehta.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/noustamiskeskus.\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}