{"KURSUSE_NIMI": "Prantsuse keele algkursus I (inglise keele baasil), tase 0 > A1.1", "KURSUSE_KOOD": "HVLC.03.006", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel osalemiseks ei nõuta eelteadmisi prantsuse keeles.\nSemestris käsitletavad suhtlussituatsioonid ja sõnavara:\n- enese ja teiste esitlemine (nimi, rahvus, elukutse);\n- inimeste ja asjade tuvastamine või tutvustamine (Kes see on? Mis see on?);\n- viisakusväljendid (tervitamisviisid, vabandamine jne);\n- enesetutvustus, isikuandmed (nimi, vanus, elukoht, amet, perekonnaseis jne);\n- töö ja õpingud;\n- vaba aja tegevused, sport, maitse-eelistused;\n- kodulinn ja elukoht;\n- kuupäev, kellaaeg, ajakava;\n- ettepaneku tegemine, nõustumine, keeldumine;\n- Euroopa Liidu ja maailma riigid.\nGrammatika:\n- sissejuhatus grammatika terminoloogiasse;\n- häälduse alused;\n- numbrid;\n- tegusõna pööramine olevikus;\n- määrav, umbmäärane ja liitunud artikkel;\n- nimisõna grammatiline sugu, omadussõna mees- ja naissoo vormid, mitmuse moodustamine;\n- eessõna \"de\" kasutamine nimisõna ees (nimisõnalise täiendi sidumiseks või kuuluvuse väljendamiseks);\n- eessõna kasutamine maa- ja kohanimede ees;\n- eituslause;\n- küsilause, küsisõnad;\n- possessiivid ehk omastavad omadussõnad;\n- isikulised asesõnad (lause alus, rõhuline asesõna);\n- lähitulevik;\n- \"si\" kasutamine (jah-vastus eitavas vormis esitatud küsimusele).Objectives/eesmärkid:  Kursuse eesmärgiks on keelestruktuuride ja suhtluskeele omandamine algtasemel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud üliõpilane on omandanud vajaliku sõnavara ja grammatika viisil, mis võimaldab semestri käigus käsitletud igapäevaelu valdkondades rakendada kõiki keelelise kompetentsuse osaoskusi: oskab lihtsal viisil suhelda; kirjutada lühikest teadet või postkaarti ja täita formulare isikuandmetega; kirjeldada ennast, oma elukohta, oma perekonda ja tuttavaid; mõistab kirjalikku ja kuuldud teksti tuttaval teemal. Lisaks teeb tudeng tutvust esmase erialase sõnavaraga prantsuse keeles. Äärmisel vajadusel toimub kursus kogu keeleõpperühmale e-õppe vormis. Hajatunde ei tehta.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/noustamiskeskus.\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}