{"KURSUSE_NIMI": "Vene keel eelkesktasemele (inglise keele baasil), tase A2 > B1", "KURSUSE_KOOD": "HVLC.05.014", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on mõeldud üliõpilastele, kes on õppinud vene keelt vähemalt ühe aasta.\nKursuse teemad:\nMinu sugulased ja minu sõbrad.\nMinu elulugu: aastad ja kuupäevad. \nInimese iseloom ja välimus.\nLiikumine linnas.\nArmastan reisida.\n\nGrammatika põhiteemad: verbi aspektipaarid, aja- ja ruumiväljendid, järgarvsõnad ja aastaarvud, liikumist väljendavad tegusõnad, kohamäärsõnad, käänete uued tähendused.Objectives/eesmärkid:  Kursuse eesmärk on edasi arendada algajate tasemel omandatud teadmisi ja oskuseid läbi erinevate keelesituatsioonide. Kursuse käigus laiendatakse lugemis-, kuulamis-, kirjutamis- ja suhtlusoskuseid. Kursusel käsitletakse erinevaid kuulamis-, lugemis- ja tõlketekste, arendatakse suhtlemist, diskussioonioskust ning tehakse tööd sõnavara ja grammatika vallas, et hakkama saada igapäevastes suhtlussituatsioonides.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane:\n- kasutab õpitud sõnavara ja grammatikat dialoogis ja monoloogis;\n- suudab luua sotsiaalset kontakti (tutvustada, tänada, vabandada, õnnitleda, üle küsida,\n  paluda abi ja avaldada soovi, määrata kokkusaamist jne)\n- suudab vahetada olulist infot ja avaldada oma arvamust tuttavatel teemadel;\n- suudab kirjeldada inimest, oma linna, kodu, igapäevaseid tegevusi, reisimist jne;\n- osaleb lihtsates igapäevastes suhtlussituatsioonides läbitud teemade raames;\n- saab aru kuuldud ja loetud tekstide üld- ja lisainfost\n- oskab kirjutada isiklikke kirju, lühikesi teateid ning sõnumeid The <b>first class</b> is on 05.09.2024.\n\nThere is no class on 07.11 & 05.12.2024.\n\nPlease make sure to regularly check your email @ut.ee  for course updates and important information.\n\nOffice hours of Mihhail Orehhov: Jakobi 2-129 at 18:00 on Thursdays. Please come and ask any questions."}