{"KURSUSE_NIMI": "Vene keel algtasemele II (inglise keele baasil), tase A1 > A2", "KURSUSE_KOOD": "HVLC.05.013", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on mõeldud üliõpilastele, kes on õppinud vene keelt ühe semestri (6 EAP). \nKursuse teemad:\nSaame tuttavaks, ennast jutustamine.\nKeeled ja riigid.\nNimisõnade ja omadussõnade mitmus.\nElukutsed.\nInstrumentaal kääne.\nTehkem midagi! Kus ja millal.\nPrepositsionaal ja Akusatiiv käänded.\nToitu ostmine ja valmistamine. Restoranis.\nGenitiiv kääne.\nPühad. Ostame kingitusi.\nDaativ kääne.\nOmadussõnad ja määrsõnad: vastandid ja võrdlusastmed.\nRäägime ilmast.\nTegusõna aspekt.Objectives/eesmärkid:  Kursuse eesmärk on edasi arendada algajate tasemel omandatud teadmisi ja oskuseid läbi erinevate keelesituatsioonide. Kursuse käigus laiendatakse lugemis-, kuulamis-, kirjutamis- ja suhtlusoskuseid. Kursusel käsitletakse erinevaid kuulamis-, lugemis- ja tõlketekste, arendatakse suhtlemist, diskussioonioskust ning tehakse tööd sõnavara ja grammatika vallas, et hakkama saada igapäevastes suhtlussituatsioonides.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - kasutab õpitud sõnavara ja grammatikat dialoogis ja monoloogis;  - suudab kirjeldada oma igapäevaseid tegevusi jne; - suudab vahetada olulist infot ja avaldada oma arvamust tuttavatel teemadel; - osaleb lihtsates igapäevastes suhtlussituatsioonides läbitud teemadel; - oskab kirjutada isiklikke kirju, lühikesi teateid ning sõnumeid. The <b>first class</b> is on 15.02.2024.\n\nThere is no class on 02.05.2024.\n\nImportant information will be sent during semester to course participants via email @ut.ee.\n\nOffice hours of Mihhail Orehhov: Jakobi 2-129 at 18:00 on Thursdays. Feel free to come and ask any questions."}