{"KURSUSE_NIMI": "Akadeemiline väljendusõpetus", "KURSUSE_KOOD": "HVLC.06.039", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on mõeldud toetama Euroopa keelte ja kultuuride magistriõppekava skandinavistika osakonna magistrandide akadeemilise eneseväljenduse arenemist ja magistritöö kirjutamist. Kursus käsitleb Skandinaaviakeelset akadeemilise maailma keelekasutust nii kõnes kui kirjas ja uurimuslike tööde koostamist kavandamisest kaitsmiseni. Kursuse esimene pool keskendub akadeemilise keele arendamisele ning selle kasutamisele lihtsamate tekstide koostamisel ja ettekandmisel. Kursuse teine pool keskendub akadeemiliste tekstide analüüsimisele, kirjutamisele ja ettekandmisele, seostades seda oma tulevase magistritööga.Objectives/eesmärkid:  Kursuse eesmärgiks on toetada Skandinaaviakeelsete akadeemilise maailma keelekasutuse, uurimuslike tööde sealhulgas magistritööga seotud oskuste arenemist. Kursuse raames arendatakse järgmiseid oskuseid: \n- praktilise keeleoskuse (rootsi/norra/taani) tase nii kõnes kui kirjas, \n- tekstide kriitiline lugemine,  \n- akadeemiliste tekstide analüüs,\n- akadeemiliste tekstide koostamine ja vormistamine,\n- akadeemiliste tekstide tagasisidestamine,\n- uurimustöö esitlemine.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n- väljendab ennast suuliselt erinevates suhtlussituatsioonides norra/rootsi/taani keeles,\n- koostab grammatiliselt ja stilistiliselt korrektseid tekste norra/rootsi/taani keeles,\n- rakendab akadeemilist sõna- ja väljendusvara norra/rootsi/taani keeles, \n- kasutab praktilist keeleoskust ning teoreetilisi põhimõtteid akadeemiliste tekstide koostamiseks,\n- mõistab akadeemiliste tekstide vaatepunkti ja autoripositsiooni ning nende seost teksti keelekasutusega,\n- omab oskuseid teadustekstide kriitiliseks lugemiseks, analüüsimiseks, koostamiseks ja vormistamiseks,\n- annab kaastudengile suulist ja kirjalikku tagasisidet akadeemilise teksti kohta,\n- esitleb akadeemilise teksti suuliselt kasutades akadeemilist sõnavara. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}