{"KURSUSE_NIMI": "Shakespeare'i ajalooteemalised näidendid", "KURSUSE_KOOD": "HVLC.01.043", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus käsitleb nn. Shakespeare'i autorluse küsimust tema ajalooteemaliste näidendite kaudu. Vaatleme lähemalt kaheksat Rooside sõja tsükli näidendit, mis hõlmavad Richard II, Henry  IV, Henry V, Henry VI, Edward IV ja Richard III valitsusaegu, lisaks \"Kuningas Leare'i\" ning  \"Macbethi\", milles väljenduvad eriti selgelt Shakespeare'i kui autorit sügavalt ja isiklikult puudutavad teemad. Igaks seminariks tuleb lugeda üks näidend, taustamaterjalid nii autorluse kui ka nende ajalooliste isikute ja sündmuste kohta, mida näidend käsitleb, et saada ülevaadet, kuidas Shakespeare on meile teadaolevaid ajaloolisis sündmusi tõlgendanud ja milliseid vabadusi selle käigus endale lubanud. Seminaris toimub arutelu loetu üle, millest eeldatakse üliõpilase aktiivset osavõttu. Vaatame ära ka kõik kümme näidendit BBC versioonis. Kursus lõpeb kirjaliku eksamiga, millele pääsemise eeltingimus on osavõtt vähemalt 8st sessioonist 10st, mille hulka ei kuulu kursust tutvustav loeng. Eksam seisneb kirjalikus töös, mis kirjutatakse loenguruumis koha peal, vastates neljale küsimusele nende küsimuste hulgast, mida oli vaja ette valmistada sessioonideks. Kõiki kursuse materjale saab eksamitöös kasutada, olgu nad paberil või elektroonilised.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada Shakespeare'i ajalooteemalisi näidendeid, asetades nad nn. Shakespeare autorluse küsimuse konteksti.Learning outcomes/õpiväljund:  Kursuse lõpuks on üliõpilane teadlik Shakespeare'i autorluse proleemist, nagu see avaldub tema ajalooteemaliste näidendite kaudu, olles neid näidendeid lugenud, vaadanud ja tutvunud nende ajaloolise taustaga."}