{"KURSUSE_NIMI": "Ingliskeelsed kultuurid", "KURSUSE_KOOD": "HVLC.01.002", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Inglise keelt kõnelevate maade ajalugu"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 44, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate ingliskeelsete kultuuride ühisjoontest ning käsitleb seejärel nelja kultuuri - Suurbritanniat, Iirimaad, Kanadat ja Ameerika Ühendriike - põhjalikumalt. Keskendutakse riikide ühiskonnakorraldusele ja väärtushinnangutele, nii ajaloolises dimensioonis kui päevakajaliste küsimuste valguses. Üliõpilased õpivad analüüsima erinevaid ühiskondlikke ja kultuurilisi fenomene riikides eraldi ning riikide võrdluses, samuti võrdluses nende endi kultuuriga. Üliõpilased teevad eri liiki ülesandeid, mis arendavad nende kriitilist mõtlemist ja uurimistöö läbiviimiseks vajalikke oskusi.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade tänapäeva ingliskeelsetest kultuuridest (Suurbritannia, Iirimaa, Kanada ja Ameerika Ühendriikide näitel), nende riikide ühisjoontest ja eripäradest. Konkreetsemalt on kursuse eesmärgiks aidata üliõpilastel - mõista erinevate ingliskeelsete maade kultuuride ja väärtuste sarnasusi ja erinevusi, - tõlgendada ingliskeelses maailmas toimuvaid poliitilisi ja kultuurilisi arenguid, - mõtestada ingliskeelsete maade rolli tänapäeval maailmas toimuvates sotsiaalsetes ja poliitilistes arengutes.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane - omab põhiteadmisi ingliskeelsete kultuuride ühisjoontest ja erinevustest; - tunneb ja seletab käsitletud riikide ühiskonnakoraldust (s.hj poliitilist ja õiguslikku korraldust) ning sotsiaalseid ja kultuurilisi väärtusi; - kasutab omandatud teadmisi, et analüüsida erinevaid ingliskeelseid kultuure, püstitada nende kohta kriitilisi küsimusi ning leida neile vastuseid; - võrdleb kriitiliselt käsitletud riikide sotsiaalseid ja kultuurilisi väärtusi ja poliitilisi institutsioone; - leiab ja hindab allikmaterjale ja kasutab neid kirjalikus analüüsis."}