{"KURSUSE_NIMI": "Saksa keel algtasemele III, tase A1.2 > A2.1", "KURSUSE_KOOD": "HVLC.04.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 60, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel korratakse ja täiendatakse õpitut. Lisanduvad uued grammatilised struktuurid.\nGrammatikateemadeks on muuhulgas: modaalverbid, lahutatavad ja lahutamatud eesliited, omastav asesõna, eessõnad daativiga ja akusatiiviga, tegusõna täisminevikus, kõrvallausete moodustamine ning omadussõnade võrdlusastmed.\n\nÜldised teemad kursusel: haridusteest ja kooliajast rääkimine, vabaaeg ja virtuaalmaailm, tähtpäevad, sõbrad, linnaelu keskel toimetamine.\nHarjutatakse vaba vestlust õpitud teemadel. Kursuse põhirõhk on õpitu (kuulamisülesanded, kirjalikud ülesanded, lugemisülesanded) sõnalisel taasesitamisel, st igas tunnis tuleb käsitletud teemade üle ka arutleda, suulised diskussioonid. \n\nLoetakse lihtsama leksikaga kodulektüüri iseseisva tööna ning koostatakse miniettekanne.Objectives/eesmärkid:  Kursuse eesmärgiks on saavutada saksa keele A2.1 tase, juhindudes Euroopa keeleoskustasemete skaala A2.1 sisust. Kursusel arendatakse kõiki osaoskusi: lugemist, rääkimist, kuulamist ja kirjutamist.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. mõistab tuttavaid fraase ja sõnu, mis puudutavad teda ennast või tema perekonda, tema kodukohta ning tema vahetut ümbrust ja õpinguid;\n2. suudab leida vajalikku infot nt menüüdest, sõiduplaanidest;\n3. loeb kergemat lektüüri ning kirjeldab läbi loetud teksti sisu; \n4. räägib kaasa argipäevastes suhtlusolukordades; \n5. kirjutab lihtsat teadet, koostab lihtsat isiklikku kirja, täidab ankeete;\n6. loob miniettekande ning esitleb seda;\n7. kasutab iseseisvalt erinevaid asjakohaseid infoallikaid, nt erinevaid sõnastikke."}