{"KURSUSE_NIMI": "Norra keel algtasemele II, tase A1.2 > A2.1", "KURSUSE_KOOD": "HVLC.06.016", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kesktaseme edasijõudnute kursus arendab edasi üliõpilaste suulist ja kirjalikku väljendusoskust ning arusaamisoskust norra keelest nii kõnes kui kirjas.  Jätkub norra keele grammatika ja leksika omandamine ning häälduse viimistlemine. Kursuse sisu katab mitmesuguseid suhtlussituatsioone ning arutlusteemasid. Kursuse komponentideks on tekstide lugemine, kirjutamine ja analüüs; rühmatööd ja diskussioonid; grammatika- ja sõnavaraharjutused; audiovisuaalsete materjalide abil keeleoskuse arendamine. Erinevate tekstide ja illustratiivsete õppematerjalide abil täiendatakse samuti teadmisi Norra ühiskonna ja kultuuri  kohta, tehes muuhulgas tutvust ilukirjanduslike tekstidega.Objectives/eesmärkid:  Kursuse eesmärgiks on arendada praktilise norra keele oskust nii kõnes kui kirjas, omandamaks taset A2 (vt http://www.coe.int/t/dg4/linguistic/cadre_en.asp.). \nKursuse käigus täiendatakse sõnavara, arendatakse vestlus- ning arusaamisoskust ja süvendatakse teadmisi grammatikast. Samuti antakse üliõpilastele võimalus õppida tundma Norra kultuuri ja ühiskonda ning lihtsamaid ilukirjanduslikke tekste.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane: oskab end norra keeles nii kõnes kui kirjas arusaadavalt väljendada;  saab aru norrakeelsest vestlusest igapäevastel teemadel; oskab lugeda ja mõista keskmise raskusega norrakeelseid tekste; omab põhiteadmisi norra keele grammatikast; tunneb Norra kultuuri ja ühiskonna põhijooni. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad."}