{"KURSUSE_NIMI": "Inglise keel kõrgtasemele II (100% e-õpe), tase C1", "KURSUSE_KOOD": "HVLC.01.034", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 156, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusest osavõtjatelt eeldatakse CEF B2 (upper-intermediate) keeleoskustaset. Pärast kursuse avanemist tuleb teha tasemetest kursuse Moodle lehel.\n\nKursuse jooksul loetakse/kuulatakse/analüüsitakse erinevaid tekste (esseed, lühijutud, ajakirjanduslikud tekstid, sketšid, intervjuud) ja tehakse grammatika- ja sõnavaraülesandeid. Kursuse lõpus tuleb esitada sõnavara-päevik ja teha lühike gramatikatest semestri jooksul läbitud grammatika peale. \n\nLäbimise tingimused:\n1. Iganädalaste töölehtede üleslaadimine\n2. Iganädalaste grammatikatestide läbimine positiivsele tulemusele\n3. Sõnavara-päeviku esitamine\n4. Grammatika lõputesti tegemineObjectives/eesmärkid:  Kursuse eesmärgiks on laiendada üldkeele sõnavara inglise keeles C1 tasemel erineva suunitlusega tekstide (esseistika/novellistika ning ajakirjandus) lugemise ning kuulamise kaudu ning konsolideerida mõningaid kõrgema taseme keelestruktuure.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel üliõplane 1. on harjutanud erinevaid sõnavara õppimise strateegiaid; 2. oskab kasutada teatud C1-taseme keelestruktuure; 3. oskab sõnavara ja teksti tasmemel analüüsida ingliskeelse akadeemilise suunitlusega suulist/kirjalikku teksti; - By registering for this course you agree with the course requirements and policies.\n- This is not a grammar or writing or exam preparation course.\n- This course is non-graded (pass/fail). \n- You need to complete all course components with a positive result to pass the course.\n- You need to collect 71 points to pass the course. \n- Please note the deadline for dropping the course. If you want to drop the course after the deadline, you need to contact the study coordinator (marilii.paalo (at) ut.ee).\n- In case of plagiarism or any other kind of academic dishonesty (copying text/sentences and presenting it as one's own, not using paraphrasing, not crediting the sources, cheating during the test) the you will be removed from the course immediately and your result for the course will be \"fail\".\n- According to the decision of the Department of English Studies, large language models must not be used during the course.\n- In case of any problems, contact me right away to find a solution.\n\nDEADLINES\n• May 18, 23.59 is the deadline for the grammar quizzes. Grammar quizzes will not open after May 18.\n• May 18, 23.59 is also the deadline for the course work (weekly worksheets, film task, vocabulary notebook) to get feedback. Course work submitted after May 18 won’t get feedback.\n• June 13, 16.00 is the final deadline for course work (weekly worksheets, essay).\n• June 15, 23.59 is the final deadline for the final grammar test and the vocabulary notebook.\n• After June 13/15 no deadline extensions will be granted as the results need to be put in the SIS."}