{"KURSUSE_NIMI": "Inglise keel kesktasemele. Grammatika ja sõnavara (100% e-õpe), tase B2.1 > B2.2", "KURSUSE_KOOD": "HVLC.01.063", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on 100% veebipõhine. Kursuse käigus läbivad õpilased iseseisvalt kursuse materjalid, teevad erinevaid interaktiivseid harjutusi ja töid sõnavara ja grammatika kinnistamiseks ning sooritavad kaks kokkuvõtvat testi.Objectives/eesmärkid:  Kursuse eesmärk on arendada õpilaste sõnavara- ja grammatikaoskust B2 tasemel.Learning outcomes/õpiväljund:  Kursuse edukalt lõpetanu on laiendanud ja kinnistanud sõnavara, avardanud teadmisi grammatikast ning oskab õpitut kasutada. Kursuse edukalt lõpetanu tunneb ning oskab B2 tasemel kasutada kursusel läbitud sõnavara ning järgmisi grammatilisi struktuure: relatiivlauseid, tingimuslauseid, kaudset kõnet, artikleid ja hulgasõnu, verbimustreid. Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling. Requiring special conditions at the end of the semester is not acceptable."}