{"KURSUSE_NIMI": "Erialane inglise keel. Õiguskeel III, tase B2.2 > C1", "KURSUSE_KOOD": "HVLC.01.019", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Erialane inglise keel. Õiguskeel II, tase B2.1 > B2.2"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel tehakse individuaalseid ülesandeid ning paaris- ja rühmatööd keele osaoskuste ja erialase sõnavara arendamiseks, sh võrreldakse eesti- ja ingliskeelset terminoloogiat, . \nKursuse teemad: rahvusvaheline õigus, rahvusvaheline eraõigus, äriõigus, intellektuaalomand. \nÕppijad loevad individuaalselt erialast kirjandust, teevad sellest suulise ja kirjaliku kokkuvõtte ning arutlevad selle teemal, leides samas ka definitsioone ja vasteid artiklis leiduvatele õigusterminitele. \nRühmatööna tehakse ettekanne ühe kohtukaasuse põhjal.   Objectives/eesmärkid:  Kursuse eesmärk on arendada osaoskusi (rääkimine, kirjutamine, kuulamine, lugemine) õigusalases ja akadeemilises kontekstis C1 tasemel ning arendada õigusalase terminoloogia kasutusoskust. Terminoloogia aluseks on peamiselt Eesti õigussüsteem võrdluses angloameerika õigussüsteemi terminitega.Learning outcomes/õpiväljund:  Õppeaine läbinud õppijad oskavad: erialastes tekstides leida õigustermineid ja neid vastavas kontekstis kasutada; kasutada usaldusväärseid allikaid terminitele ingliskeelsete vastete leidmiseks; eristada tekstis olulist ning seda edasi anda suulises ja kirjalikus vormis; rühmas töötades oma tööd planeerida.   Head tudengid!\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling. Requiring special conditions at the end of the semester is not acceptable."}