{"KURSUSE_NIMI": "Vene keele ja kirjanduse digitaalsed ressursid ja tööriistad", "KURSUSE_KOOD": "HVLC.05.066", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse raames saavad üliõpilased ettekujutuse sellest, kuidas füüsiliste ehk paberil põhinevate allikatega seotud traditsioonilised filoloogilised uurimused transformeeruvad seoses andmete digitaliseerimise ja sotsiaalsete muutustega, nn digitaalse pöördega (digital turn).\nKursuse alguses arutletakse erinevate allikate digitaliseerimise väljakutsete üle: kuidas on mõjutanud paberil põhinevad kartoteegid ja bibliograafiad  tänapäeva andmebaase ja otsingumootoreid, mida kasutavad raamatukogud ning arhiivid. Üliõpilased omandavad praktilised oskused kirillitsa tähestiku abil vene ja teistes keeltes tekstide ning bibliograafiate otsimisel, väljavõtmisel ja salvestamisel. Samuti tutvustatakse slaavi keelte peamisi digirahvuskorpuseid ja nendega töötamise aluspõhimõtteid.\nKursuse viimases osas näidatakse, kuidas oma tekstikorpust ette valmistada ja selle kohta online ning offline tööriistade abil lingvistilist põhiteavet saada.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade mitmesugustest digiressursidest ning lingvistilistest instrumentidest, mida võib kasutada vene keele ja kirjanduse alastes uurimustes. Kursuse raames tutvuvad õpilased Internetis autoriteetsete allikate otsimise põhimõtetega ja saavad esmased teadmised tekstide masin/arvutitöötlusest.Learning outcomes/õpiväljund:  Kursuse lõpus üliõpilased saavad ettekujutuse digiteeritud arhiiviallikate ja bibliograafiliste andmebaaside kohta, mis sisaldavad materjale slaavi keeltest ja kirjandustest; tunnevad ressursse, kus on avaldatud digiteeritud allikad (kroonikad, käsikirjad, raamatud, 17. - 20. saj perioodika); oskavad koostada bibliograafiaid ja bibliograafilisi kirjeldusi erinevat tüüpi dokumentidele; õpivad tundma erinevaid tekstivorminguid, nende ajalugu ja  kasutuspõhimõtteid tänapäeval; - oskavad tekstide esmatöötlemiseks kasutada arvutitöö riistu (võrgus ja väljaspool võrku); - on valmis iseseisvateks uurimusteks digihumanitaaria alal."}