{"KURSUSE_NIMI": "Akadeemiline väljendusoskus", "KURSUSE_KOOD": "HVLC.10.009", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 22, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 30, "individual_work": 0, "internship": 24}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ainekursusel on kolm moodulit: 1) erialase teadusartikli kirjutamine, 2) teadustöö tulemuste suuline esitamine kitsale erialaesindajate ringile (näiteks teaduskonverentsidel) ja laiemale üldsusele (näiteks TED-talks, teaduse populariseerimine kooliõpilaste seas jms) ja 3) populaarteaduslike tekstide kirjutamine (Novaatori või Vikipeedia artiklid, teadusblogid, doktoritöö populaarteaduslik kokkuvõte jms). \n\nKursuse peamine eesmärk on kogemusõppe teel arendada loomulikus ja turvalises keskkonnas doktorantide eneseväljendusoskust. Kursus võimaldab paindlikku õpet, sealhulgas õppijate individuaalsetele vajadustele vastavat e-õpet ja praktikume.\n\n1. Teadusartikli kirjutamine\n\nKursus arendab teadusartiklite ja muude teadustöö keskkonda sobivate tekstide kirjutamise oskust. Selles moodulis arendatakse kirjalikku väljendusoskust teadusartikli kirjutamisega ning kaasõppijatelt ja õppejõult saadava põhjaliku tagasisidega. Kursuse lõpuks valmib üliõpilasel esitamisvalmis teadusartikli käsikiri.\n\n2. Teadustöö tulemuste suuline esitamine\n\nKursus arendab teadustöö tulemuste suulise esitamise oskust. Selles moodulis arendatakse suulist väljendusoskust teadusliku ettekande koostamise ning kaasõppijatelt ja õppejõult saadava põhjaliku tagasisidega. Kursuse lõpuks valmib üliõpilasel esitamisvalmis (konverentsi)ettekanne.\n\n3. Teaduskommunikatsioon \n\nKursusel arendatakse populaarteaduslike ettekannete koostamise ja avaliku esinemise osksusi. Selles moodulis arendatakse kirjalikku ja suulist väljendusoskust populaarteaduslike tekstide koostamise ja kaasõppijatelt ja õppejõult saadava põhjaliku tagasisidega. KObjectives/eesmärkid:  A-osa: Teadusartikli kirjutamine\n- Retooriliste vahendite tundmine ja kriitiline hindamine teadusartiklites,\n- Retooriliste vahendite kasutamine oma teadusteksti kirjutamisel ja parandamisel,\n- Teadusartiklite mustandite lugemine ja tagasisidestamine ning teiste tagasiside arvestamine oma teksti ümberkirjutamisel,\n- Kaaskirja loomine oma teadusartikli mustandile,\n- Teadusartikli loomine mitmes ümberkirjutamise ja teksti parandamise etapis, mis hõlmab ka vahetut vastastikkust tagasisidet,\n- Tagasisidekommentaaride vastuvõtmine ja arvestamine oma teksti ümberkirjutamisel.\n \nB-OSA: Suulise ettekande koostamine ja populaarteaduslikud anrid:\n- Oma teadustöö esitamine lihtsalt ja selgelt,\n- Huvitava ja hästijälgitava konverentsiettekande koostamine,\n- Veenva esinemisoskuse ja personaalse stiili arendamine,\n- Kuulajaskonna tähelepanu paelumine,\n- Enesekindla esinemise tehnikate omandamine,\n- Tehniliste abivahendite kasutamine teadustööst rääkimisel ja kirjutamisel.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased: A-osa: - suudavad analüüsida oma kirjutamisprotsessi ja tekstiloome strateegiaid, rakendades neid vastavalt oma vajadustele ja püstitatud eesmärkidele, - mõistavad oma eriala kirjutamistavasid ja erialaste teadusajakirjade nõudmisi, - mõistavad eri sihtrühmadele suunatud tekstide (koostamise) eripärasid ning oskavad oma sõnumit esitada auditooriumile vastavalt, - on suutelised kriitiliselt, kuid konstruktiivselt analüüsima ja tagasisidestama suulisi ja kirjalikke teadustekste, - oskavad tagasisidet vastu võtta ning seda teksti parandamisel arvestada, B-osa: - on tuttavad konverentsiabstrakti kirjutamise põhimõtetega, - oskavad koostada teadusettekannet ning mõistavad selle erinevusi suuliste populaarteaduslike anridega, - teavad, kuidas adekvaatselt kuulajate küsimustele vastata, - on kursis keelespetsiifiliste tekstiloome põhimõtetega, - oskavad ettekannet alustada ja lõpetada, - oskavad valida strateegiat vastavalt kuulajaskonnale, - oskavad teadustöö esitamisel kasutada loo jutustamise (storytelling) strateegiaid, - oskavad improviseerida ja pidada ettekannet ilma valmiskirjutatud tekstita. Kursuse väljatöötamist toetati Tartu Ülikooli ASTRA projektist PER ASPERA, finantseerib Euroopa Liidu Regionaalarengu Fond.\n\nThis course development has been financed by the University of Tartu ASTRA Projekt PER ASPERA (European Regional Development Fund).\n\n\n2. Teadustöö tulemuste suuline esitamine\n\nKursus arendab teadustöö tulemuste suulise esitamise oskust. Selles moodulis arendatakse suulist väljendusoskust teadusliku ettekande koostamise ning kaasõppijatelt ja õppejõult saadava põhjaliku tagasisidega. Kursuse lõpuks valmib üliõpilasel esitamisvalmis (konverentsi)ettekanne.\n\n3. Teaduskommunikatsioon \n\nKursusel arendatakse populaarteaduslike ettekannete koostamise ja avaliku esinemise osksusi. Selles moodulis arendatakse kirjalikku ja suulist väljendusoskust populaarteaduslike tekstide koostamise ja kaasõppijatelt ja õppejõult saadava põhjaliku tagasisidega. Kursuse lõpuks valmib üliõpilasel esitamisvalmis populaarteadusliku teksti käsikiri ja ettekanne.\n\n--------------------------------------------------\n\n1.\tPresenting science: \n\nThe course increases your presentation skills of scientific and professional genres. This section of the course provides you with opportunities to apply these skills in the process of presenting a full academic presentation and to receive ample feedback from your peers and the instructor. By the end of the course you should have a presentation (more or less) ready for a conference. \n\n2.\tPopular science: \n\nThe course increases your presentation skills of scientific and professional genres. This section of the course provides you with opportunities to apply these skills in the process of writing a popular science article and present a popular science presentation and to receive ample feedback from your peers and the instructor. By the end of the course you should have an article and a presentation (more or less) ready."}