{"KURSUSE_NIMI": "Eesti keel arstiteaduse tudengitele I, tase 0 - A1.2", "KURSUSE_KOOD": "HVLC.09.001", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Eesti keele ettevalmistuskursus annab põhiteadmised eesti keele grammatikast ja sõnavarast ning algteadmised meditsiinialasest sõnavarast. Üliõpilane omandab teadmised ja oskused, mis on vajalikud selleks, et jätkata keeleõpinguid meditsiinialase eesti keele põhikursusel.\n* Eesti ja eestlased;\n* Pere;\n* Maad, rahvad ja keeled;\n* Eluase;\n* Aeg (nädalapäevad, kuud, aastaajad, kellaaeg);\n* Minu päev, minu nädal;\n* Toit ja jook. Toitumisharjumused;\n* Poes ja kohvikus;\n* Jõulud.\n\nPeamised grammatikateemad:\n* Eesti keele põhijooni;\n* Verbi pööramine olevikus ja lihtminevikus;\n* Küsisõnad;\n* Eesti keele käänded (ainsuse peakäänded, kohakäänded, kaasaütlev  kääne, mitmuse nimetav kääne);\n* ma-ja da-tegevusnimi;\n* Arvsõnad;\n* Omadussõnade võrdlemine;\n* (Isikulised) asesõnad;\n* Käskiva kõneviisi ainsus;\n* Ees- ja tagasõnade kasutamine.Objectives/eesmärkid:  Õpetada eesti keele grammatika aluseid ja eesti keele põhisõnavara. Alustada meditsiinialase sõnavara omandamist, harjutada erialase terminoloogia kasutamist suhtlussituatsioonides ja kirjalikes tekstides, valmistada üliõpilasi ette meditsiinialase eesti keele põhikursuseks. Üldeesmärkide saavutamise lõpptase kevadeks kõigi osaoskuste puhul on A2.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane  * tunneb ja oskab kasutada eesti keele käändeid, pöörata verbe olevikus ja minevikus, kasutada käskivat kõneviisi, võrrelda omadussõnu, kasutada põhiarvsõnu ja ajaväljendeid. * suudab suhelda argisituatsioonides tänaval, poes, söögikohtades, seltskonnas, oskab rääkida ja kirjutada endast, oma kodust, tööst, perekonnast, söömisharjumustest, väljendada poolehoidu ja vastumeelsust."}