{"KURSUSE_NIMI": "Saksa keel kesktasemele I, tase B1.1 > B1.2", "KURSUSE_KOOD": "HVLC.04.012", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse teemadeks on aja kasutamine, argipäev, probleemid naabritega, ajalugu, keskkond, erinevad eluvormid, digitaalne tarbimine. Loetakse ja kuulatakse erinevaid tekste ja vaadatakse videoid. Õpitakse kirjalikult ja suuliselt väljendama oma arvamust, soove ja (mitte)nõusolekut, diskussiooni pidama, meilitsi kaebuste edastamist, kokkuvõttete kirjutamist jne.Objectives/eesmärkid:  Kursuse käigus laiendatakse sõnavara, arendatakse lugemis-, vestlus- ja kuulamisoskust ning süvendatakse teadmisi grammatikast.Learning outcomes/õpiväljund:  Kursuse eesmärgiks on saavutada Euroopa Nõukogu keeleoskustase B1 (B1 = B1.2.). Pärast kursuse läbimist suudab üliõpilane nii suuliselt kui ka kirjalikult oma mõtteid paremini väljendada, tema sõnavara on laienenud, keelekasutus on muutunud korrektsemaks. Head tudengid!\n\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale! \nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\nDear Students,\n\nBe sure to pay attention to the registration cancellation deadline stated in the course outline. \nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\nRequiring special conditions at the end of the semester is not acceptable."}