{"KURSUSE_NIMI": "Saksa keel algtasemele I, tase 0 > A1.1", "KURSUSE_KOOD": "HVLC.04.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Vahendatakse algteadmisi saksa keele grammatikast,\nkinnistatakse sõnavara ning arendatakse vestlusoskust lihtsamatel (argi)teemadel:\nenesetutvustus, kohtumised, sisseostude tegemine, kohvikus tellimine jmt.\nHarjutatakse hääldamist, sõnastike kasutamist. Õppematerjalideks on saksa keelt kõnelevates maades ilmunud õpikud koos helilintidega.Objectives/eesmärkid:  Kursuse eesmärgiks on arendada keeleoskust, mis võimaldab õppijal luua sotsiaalseid suhteid pidevalt korduvates argisituatsioonides – üliõpilane oskab kasutada õpitud väljendeid ning vestelda erinevatel lihtsatel (argistel) teemadel, muuhulgas: enesetutvustus, reisimine ja liikumine, orienteerumine, sisseostude tegemine, kohvikus tellimine, kellaajad/nädalapäevad. Pärast kursuse läbimist suudab üliõpilane lugeda ja kuulata kergemaid tekste. Kursuse lõppedes oskab üliõpilane esitada lihtsaid küsimusi ja neile vastata. Kursuse eesmärgiks on saavutada saksa keele A1.1 tase, juhindudes Euroopa keeleoskustasemete skaala A1 sisust. Kursusel arendatakse kõiki osaoskusi: lugemist, rääkimist, kuulamist ja kirjutamist.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) meenutab normipärase häälduse reegleid ning hääldab sõnu korrektselt;\n2) mõistab kuulamis- ja lugemistekste tuttavatel teemadel ning on võimeline edasi andma kuuldu ja loetu sisu lihtsate sõnadega;\n3) võrdleb erinevaid sõnastikke ning suudab leida neist adekvaatset informatsiooni;\n4) formuleerib eri tüüpi küsimusi ning vastab temale esitatud lihtsatele küsimustele;\n5) väitleb kursusel läbitud teemade raames ja suhtlussituatsioonides."}