{"KURSUSE_NIMI": "Hispaania keel algtasemele II, tase A1.1 > A1.2", "KURSUSE_KOOD": "HVLC.03.027", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tundide teemad: igaepäeva rutiinsed tegevused, kohvikus, restoranis ja toidupoes käimine, toiduvalmistamine, tee küsimine ja juhatamine; oma elukogemustest rääkimine.\nÜliõpilased omandavad oskuse rääkida endast ja oma perest, töökeskkonnast ja igapäevastest tegevustest, kirjeldada inimesi ja kohti, kasutada linnas liikumiseks, sisseostude tegemiseks jms vajalikke väljendeid ja sõnavara.\n\n\nGrammatika: tegusõna pööramine olevikus sh reeglipärased ja ebareeglipärased tegusõnad, enesekohane tegusõna, täisminevik, otsesihitis.Objectives/eesmärkid:  Õppeaine eesmärgiks on suhtluskeele omandamine A2 tasemel vastavalt Euroopa keelestandardile. Tutvutakse ka Hispaania ja Ladina-Ameerika kultuuri ja ajalooga.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane suudab mõista ning luua lihtsamaid suulisi ja kirjalikke hispaaniakeelseid tekste, oskab kasutada õpitud sõnavara ja grammatikat igapäevastes situatsioonides. Üliõpilane oskab rääkida ja kirjutada oma igapäevastest harjumustest, toidust ja toidu valmistamisest, kirjeldada elukeskkonda, juhatada ja küsida teed. Üliõpilane oskab hispaania keelt hääldada, lugeda ning tunneb peamisi ortograafiareegleid. Kursus eeldab osalejatelt aktiivset osavõttu dialoogide moodustamisel, käsitletavatel teemadel kaasarääkimist, lühikeste tekstide koostamist.\n\n\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\n\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\n\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine  .\n\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\n\n_ _ _\n\nThe course assumes an active participation from the students in making dialogues, in expressing their views on the given themes, it also assumes composition of short texts.\n\nBe sure to pay attention to the registration cancellation deadline stated in the course outline.\n\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\n\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling  .\n\nRequiring special conditions at the end of the semester is not acceptable."}