{"KURSUSE_NIMI": "Vene keel eelkeskastmele I, tase A2.1 > A2.2", "KURSUSE_KOOD": "HVLC.05.018", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Vene keele kursus on mõeldud üliõpilastele, kes on õppinud vene keelt kahe semestri vältel või kelle tase on A2.1. Kursus hõlmab erinevate tekstide (sh dialoogide) lugemist, tõlkimist, vestlust, arutelu ning tööd sõnavaraga toimetulekuks igapäevastes suhtlussituatsioonides. Kursuse jooksul korratakse ka põhjalikult grammatikat.Objectives/eesmärkid:  Kursuse eesmärk on suhtlus-, lugemis-, kuulamis-, kirjutamis- ja grammatikaoskuste arendamine ning sõnavara täiendamine. Kursus kinnistab ja süvendab baasteadmisi, arendab kõne- ja kirjakeele oskust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane:\n* suudab mõista kõike olulist endale tuttaval (kursuse jooksul õpitud) teemal;\n* oskab koostada teksti tuttaval või enda jaoks huvipakkuval teemal nii kirjalikult kui ka suuliselt, kasutades õigesti õpitud grammatilisi konstruktsioone;\n* suudab aru saada lühikestest ja lihtsatest tekstidest tuttavatel teemadel;\n* oskab kirjeldada kogemusi, sündmusi, eesmärke, muljeid jne ning lühidalt põhjendada / selgitada oma seisukohti ja plaane, vahetada olulist infot ja avaldada oma arvamust praktiliste probleemide kohta;\n* suudab leida vajalikku infot igapäevatekstidest (reklaamid, menüüd, ajakavad jm) ning aru saada raadio- või telesaadete põhisisust, kui need käsitlevad tuttavaid või huvipakkuvaid teemasid;\n* suudab ettevalmistuseta osaleda lühikestes vestlustes igapäevastel praktilistel teemadel ja tavapärastes situatsioonides;\n* suudab luua sotsiaalset kontakti (tervitada, hüvasti jätta, tutvustada, tänada, määrata kokkusaamist jne);\n* oskab kirjutada lühikesi lihtsaid seostatud tekste."}