{"KURSUSE_NIMI": "Hispaania keel algtasemele III, tase A1.2 > A2.1", "KURSUSE_KOOD": "HVLC.03.028", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ainekursusel töötame õpikuga \"Aula Internacional plus 2\" (peatükid 2, 8, 9,10); ISBN: 9788418032202 \n\nRäägime inimese erinevatest eluetappidest, minevikusündmustest, möödunud aegadest ja praegustest oludest, suurtest avastustest ja leiutistest, mis on muutnud maailma; tervisest (haigused, emotsioonid).\n\nGrammatika:\n\n- lihtminevik (pretérito indefinido)\n- täisminevik (pretérito perfecto)\n- kestev minevik (pretérito imperfecto)\n- gerundium\n- imperatiivObjectives/eesmärkid:  Õppeaine eesmärgiks on suhtluskeele omandamine A2 tasemel vastavalt Euroopa keelestandardile. Tutvutakse ka Hispaania ja Ladina-Ameerika kultuuri ja ajalooga.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane\n \nvaldab hispaania keele hääldus- ja ortograafiapõhimõtteid, tunneb hästi suhtlusvormeleid, oskab kasutada õpitud sõnavara ja grammatikat igapäevastes situatsioonides, oskab rääkida olevikus ja minevikus toimunud sündmustest, oskab lugeda ja ümber jutustada erinevaid tekste, suudab kirjutada omandatud teemadel lühikesi iseseisvaid töid.\n\nKursusel käsitletakse põhiteemadena:\n\ninimese erinevad eluetapid ja CV koostamine; ajalugu ja ühiskond (suured avastused); emotsioonidest rääkimine ja emotsioonide väljendamine; tervis (haigused ja ravi, inimese kehaosad) Kursus eeldab osalejatelt aktiivset osavõttu dialoogide moodustamisel, käsitletavatel teemadel kaasarääkimist, lühikeste tekstide koostamist.\n\n\nKui teil on õppetööd mõjutavaid muresid või erivajadusi, siis palume sellest õppejõudu informeerida kohe semestri alguses.\n\nVajadusel võtke ühendust Tartu Ülikooli nõustamiskeskusega: https://ut.ee/et/sisu/psühholoogiline-nõustamine .\n\nSemestri lõpus esitatud erinõudmised ei ole enam vastuvõetavad.\nPöörake kindlasti tähelepanu kursuse kirjelduses märgitud registreeringu tühistamise tähtajale!\n_ _ _\n\nThe course assumes an active participation from the students in making dialogues, in expressing their views on the given themes, it also assumes composition of short texts.\n\n\n\nIf you have concerns or special needs affecting your studies, please inform the lecturer at the beginning of the semester.\n\nIf necessary, contact the University of Tartu counseling centre: https://ut.ee/en/content/psychological-counselling .\n\nRequiring special conditions at the end of the semester is not acceptable.\n\nBe sure to pay attention to the registration cancellation deadline stated in the course outline."}