{"KURSUSE_NIMI": "Tänapäeva keele- ja kirjandusteaduse meetodid slavistikas", "KURSUSE_KOOD": "HVLC.05.078", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus toimub nii loengu-, kui ka seminari vormis ja võimaldab algaja doktorandile paremini orienteeruda tänapäeva slavistika probleemides ja nende lahendamise meetodites, arendada oma esinemisoskusi ning kasutada omandatud kogemust oma väitekirjade arendamisel. Kursus annab ülevaate vene keele- ja kirjandusteaduse kujunemisest. Käsitletakse slavistikale aktuaalseid teoreetilise keeleteaduse probleeme ja arengusuundi: kognitiivne lingvistika, funktsionaalne grammatika, aspektoloogia, tüpoloogia meetodid, kommunikatiivgrammatika, kõneaktide teooria, keele loogiline analüüs jt. Arutatakse tänapäeva kirjandusteaduse valupunkte: kommentaar kui probleem, intertekstuaalsuse uurimise raskusi, kirjanduse ja kirjeldava reaalsuse vahekorra uurimismeetodeid. Kursus laiendab ettekujutust teadusliku analüüsi olemusest, keele- ja kirjandusteadusliku analüüsi meetoditest.Objectives/eesmärkid:  Eesmärgid:\n1.\tArendada doktorandi teadusanalüüsi oskusi.\n2.\tArendada doktorandi esinemisoskusi.\n3.\tSüvendada doktorandi teadmisi kaasaegsete slaavi keele- ja kirjandusteaduses kasutatavatest uurimismeetoditest, nende arengust ja omavahelistest seostest.\n4.\tValmistada doktorandi ette iseseisva uurimistöö läbiviimiseks ja vormistamiseks.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: 1) on arendanud oma teadusanalüüsi oskusi; 2) on saanud täiendava kogemuse teadusettekande pidamisel; 3) oskab rakendada saadud teadmisi ja oskusi enda väitekirjateema uurimisel ning uurimustöö kirjutamisel; 4) omab ülevaadet vene keele- ja kirjandusteaduse kujunemisest; 5) omab ülevaadet tänapäeva slaavi keeleteaduses kasutatavatest uurimismeetoditest, nende arengust ja omavahelistest seostest; 6) on teadlik kaasaegse kirjandusteaduse tähtsamates probleemidest: teksti kommenteerimis ja intertekstuaalse analüüsi teostamise raskustest;  7) tunneb kirjandusteksti ja kirjeldava reaalsuse vahekorra uurimismeetodeid."}