{"KURSUSE_NIMI": "Vana-Iisraeli ning algkristluse aja- ja usundilugu", "KURSUSE_KOOD": "HVUS.05.003", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Vana-Iisraeli ning algkristluse aja- ja usundilugu"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus käsitleb Vana-Iisraeli aja- ja usundiloo  ja uurimismeetodeid, Iisraeli usundi tausta, tekkelugu ja põhijooni, põhilisi sündmusi ja perioode ajavahemikus 2. e.m.a. aastatuhande lõpp kuni 1. e.m.a. aastatuhande lõpp ning piibliarheoloogia probleeme. Ajalooline ülevaade 1. m.a.j. sajandi Palestiinast. Juutluse põhilised rühmitused. Jeesuse elu ja ajaloolisuse ja kronoloogia probleemid. Selgitatakse Jeesuse elu põhilisi sündmusi ja õpetuslikke peateemasid.Objectives/eesmärkid:  Õppida tundma Vana Testamendi aegse Iisraeli aja- ja religioonilugu, mõista seeläbi Vana Testamendi tekkelugu ning õppida tundma uurimislugu ja meetodeid. Anda baasteadmised kristluse tekke ajastuloolise korra ja kristluse keskse isiku elu kohta ja sellega seotud ajaloolistest ja teoloogilistest probleemidest.Learning outcomes/õpiväljund:  Üliõpilane\n- tunneb Iisraeli aja- ja religiooni uurimisloo tähtsamaid suundi, esindajaid ja kaasaegseid probleeme ning meetodeid;\n- tunneb Iisraeli usundi tausta, kujunemislugu ja põhivorme;\n- teab Iisraeli ajaloo põhiperioode ja tähtsamaid sündmusi 2. at lõpus ja 1. at eKr;\n- tunneb üldjoontes Vana Lähis-Ida tausta 2. at lõpus ja 1. at eKr;\n- mõistab üldjoontes piibliarheoloogia iseloomu ning meetodeid;\n- leiab olulisemat teatme- ja teaduskirjandust ning sõnastab selle põhjal järeldusi;\n- üliõpilasel on ülevaade I sajandi Palestiinast ja juutluse põhilistest rühmitustest; \n- ta tunneb Jeesuse elu põhilisi sündmusi ja õpetuslikke suundumusi. Õppetöö toimub semestri alguses kokkulepitud ajakava järgi.\nJooksev info saadetakse aine kuulajatele Moodle'i teadetefoorumi teel meilile."}