{"KURSUSE_NIMI": "Ühiskond, usk ja poliitika kaasaegses Lähis-Idas", "KURSUSE_KOOD": "HVUS.06.006", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 6, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel käsitletakse metoodilisi ja teoreetilisi eeldusi islami ühiskondade (ja Iisraeli) uurimisel; demokraatia, autoritaarsuse, monarhia, teokraatia jne rolli MENA riikides; islamit (aga ka judaismi, kristlust jt) sise- ja välispoliitika, ühiskonna, õigusruumi jne mõjutajana; Iisraeli erilist rolli MENA poliitikas; religioosse fundamentalismi mõju; MENA ühiskondade suhet inimõigustega, eriti naiste õiguste dünaamikat; üksiknäidete varal \"Araabia kevade\" aegset ja järgset poliitilist ja ühiskondlikku olukorda.Objectives/eesmärkid:  Kursuse peamised eesmärgid on anda ülevaade Lähis-Ida ja Põhja-Aafrika riikide (MENA) ühiskondlikest, usulistest, etnilistest, poliitilistest aspektidest; analüüsida usuliste ja ühiskondlike tegurite mõju MENA riikide sise- ja välispoliitikas ning kaasajal toimuvaid muutusi islami (ja Iisraeli) ühiskondades.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane mõistab Lähis-Ida ja Põhja-Aafrika riikide (MENA) ühiskonnakorralduse komplekssust ning oskab kirjeldada nende poliitilisi ja ühiskondlikke struktuure; oskab hinnata religiooni ja religioossete struktuuride osa MENA riikide arengus; määratleda kultuuriliste, etniliste ja religioossete hoovuste mõju MENA riikide omavahelisele suhtlusele ja konfliktidele; leida relevantset kirjandust ning koostada suulist või kirjalikku ülevaadet ühe või teise MENA ühiskonna usulise, kultuurilise ja poliitilise profiili kohta. Teaching is carried out according to the schedule agreed at the beginning of the semester, A full schedule of lectures and seminars is available on the moodle environment. Teaching takes place in the auditorium."}