{"KURSUSE_NIMI": "Religioon Eestis: tänapäev ja ajalugu", "KURSUSE_KOOD": "HVUS.00.017", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on kombinatsioon religioonisotsioloogilisest ja religiooniloolisest lähenemisest, kus lähtepunktiks võetakse religioosne olukord tänapäeva Eestis. Sellest liigutakse ajaloos tagasi, avades järjest põhisündmusi ning nende seoseid poliitilise, sotsiaal- ja kultuuriajalooga, mis on viinud tänase olukorra kujunemiseni.\nKursus jaguneb kolmeks mõtteliseks osaks:\n1.    Eesti tänapäevase religioosse olukorra analüüs - mida me sellest teame ning millised teooriad seda võiksid selgitada\n2.    Ajalooline ülevaade - kuidas tänane olukord on kujunenud\n3.    Sissevaade Eestis enamlevinud religioonidesse ja religiooniga seotud sfääri laiemalt - siin käsitleme põhjalikumalt enam levinud kristlikke usugruppe, aga ka uususundeid, uut vaimsust, looduse rolli religioonisfääris ning mittereligioossust.Objectives/eesmärkid:  Anda ülevaade Eesti religioossest olukorrast tänapäeval ning religiooniloolistest arengutest, mis selle olukorrani on viinud; tutvustada teooriaid, mis seda olukorda võiksid selgitada, ning anda ülevaade peamistest usugruppidest ja religiooniks peetava piirialadel paiknevatest nähtustest.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: *    on kursis Eesti tänapäevase religioosse olukorra ja üldiste ajalooliste arengutega *    oskab seostada religiooniloolist materjali tänase olukorraga *    orienteerub Eestis enamlevinud religioossete liikumiste eripärades *    oskab näha seoseid \"religiooni\" ja sellega piirnevate nähtuste (uus vaimsus, mittereligioossus, loodus) vahel. Kogu praktiline info kursuse kohta on leitav Moodle'ist"}