{"KURSUSE_NIMI": "Süstemaatilise teoloogia magistriseminar", "KURSUSE_KOOD": "HVUS.02.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb kahest osast. Esimene osa annab ülevaate põhjendustest kaasaegses teoloogias. Käsitletakse mõningaid tähelepanuväärseid tänapäeva- arusaamu sellest, mida, miks ja kuidas teoloogia mõtleb. Seejuures ei ole sihiks täieliku ülevaade andmine teoloogia põhjendamise katsetest. Samuti ei hõlma kursus kõiki probleeme, millega teoloogia tänapäeval tegeleb. Teine osa tutvustab nii ajaloolisi kui piibellike Jeesuse ja Kristuse kujutlusi ja nendest lähtuvaid kaasaegseid versiooneObjectives/eesmärkid:  Kursuse eesmärgiks on näidata üliõpilastele olevikulise süstemaatilis-teoloogilise refleksiooni vajalikkust ja atraktiivsust ning innustada selle iseseisvale viljelemisele ning arendada arusaama nii Jeesuse kui Kristuse portreede mitmekesisusest, seostada piibellikku ja esimeste kristlike sajandite kristoloogiaid kaasaegsete võimalustega.Learning outcomes/õpiväljund:  Tudeng orienteerub kaasaegse süstemaatilise teoloogia põhiküsimus(t)e näitel kaasaegse teoloogilise diskussiooni ja uurimistöö paljususes\n- tunneb ja võrdleb üksikasjalikumalt kahte silmapaistvat lahenduskatset teoloogia probleemi(de)le \n- küsib nende lahenduskatsete asjakohasuse kohta, esitades kaalutlusi nende tugevuste ja nõrkuste kohta\n- väitleb iseseisvalt süstemaatilis-teoloogilise refleksiooni ülesande ja iseloomu üle\n- identifitseerib süstemaatilis-teoloogilisi probleeme ja arutleb kriitiliselt nende lahendusvõimaluste üle\n- tutvub mõnede kaasaegsete kristoloogiliste arendustega dialoogis piibellike ja ajalooliste kristoloogiatega. Üliõpilane arendab enda nö funktsionaalset kristoloogiat. To develop an appreciation of (a) the distinctive Christology of each of the NT authors, (b) the Christology of the early church and contemporary theological options (c) to develop understanding how the words, acts, person, and presence of the \"historical Jesus\" relates to contemporary art, architecture, politics, agencies of human services, hospitals, educational institutions, theology, music, etc., (d) To sort out one's own perspective on Jesus and the Christological tradition and to consider the implications this might have for one's life."}