{"KURSUSE_NIMI": "Seksuaalteoloogia", "KURSUSE_KOOD": "HVUS.02.003", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "20. saj lõpp ja 21. algus on kristlikes õhtumaades liberaalse demokraatia ja sekulariseerumise taustal tähistanud muuhulgas ka märkimisväärset seksuaalset emantsipatsiooni. LGBTQ temaatika, naise seksuaalne vabadus ja \"traditsiooniline\" peremudel põhjustavad mitmeid pingeid ka sekulaarses mõtlemises. Kristliku (aga ka islami ja juudi) pärandi seisukohalt on siin tegu aga nö kuuma kartuliga, mida ei saa hästi alla neelata ega ka välja sülitada. Robert Shore-Gossi sõnul: kristlus on seksuaalsusega seoses vaevalt jõudnud varasesse puberteeti, staadiumisse, milles püütakse esilekerkinud uusi küsimusi nö purki tagasi toppida. Käesolevas kursuses võetakse need teemad otse ja valehäbita ette, räägitakse asjadest nende õigete nimedega ja püütakse välja jõuda seksuaalteoloogiani, mis suudaks vastu võtta 21. sajandi väljakutse.Objectives/eesmärkid:  Orienteerida osalejaid religiosse (rõhuasetusega eelkõige Euroopas esindatud usundite) seksuaalsusekäsitluse seostes kaasaegse reproduktiivtervise ja sekulaarse seksuaaleetika käsitlustega. Korrigeerida kristluse (jt religioonide) erotofoobset kuvandit ning pakkuda sellele teoloogiliselt elujõulisi alternatiive.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:     1.\tOrienteerub peamistes pingeteemades, mis tõusetuvad akadeemilise reproduktiivmeditsiini ja -õiguse, liberaalse sekulaarse seksuaaleetika ja kristluse (ning teiste suuremate religioonide) keha- ning seksuaalsusemõistmise erinevustest.     2.\tNimetab aabrahamlike religioonide erotofoobseid aspekte, rakendab neid teadmisi analüüsimaks kaasaegset sekulaarset diskursust läbivat naivismi religioosse seksuaaleetika suhtes.     3.\tKonstrueerib teoloogilisi tõlgendusi, mis võimaldavad seksuaalsuse erinevaid väljendusi (nt üheöösuhted, samasooliste armastus jms) traditsiooniga seostada inklusiivsel, mittevastandaval viisil. Muudatused seoses eriolukorraga:\n1) Loengud videosalvestatakse PanOpto keskkonnas ja tehakse kursuses osalejaile aine Moodle'i lehel kättesaadavaks hiljemalt loengu toimumise plaanipäraseks ajaks;\n2) Loeng-seminaride interaktiivne osa toimub Moodle'i keskkonna foorumite kaudu;\n3) Säilitamaks tudengeile reaalajas võimalust loengus käsitletu reflekteerimiseks ja küsimuste esitamiseks on õppejõud BBB videosilla vahendusel Moodle'is kättesaadav paaritute õppenädalate kolmapäeviti kl 18.15-19.15;\n4) Jooksev info võimalike muudatuste kohta saadetakse kursusel osalejaile e-posti teel.\n\nInformation related to the Emergency State:\n1) Lectures will be videorecorded in PanOpto and made accessible to all paricipants via the course's Moodle page according to the original timetable;\n2) The interactive part of lecture-seminars will take place via the Moodle forums set up for each lecture;\n3) Additionally, the lecturer will be available for those interested via the BBB videobridge on the odd weeks' Wednesdays from 18.15 to 19.15;\n4) All information on possible changes will be sent to the participants via e-mail."}