{"KURSUSE_NIMI": "Looduslike abimaterjalide õpetus", "KURSUSE_KOOD": "HVVK.01.217", "EAP": 7, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines antakse lühiülevaade maailmas levinumatest looduslikest ja sünteetilistest abimaterjalidest. Looduslike abimaterjalide kujunemisest, töötlemistehnoloogiatest ja kasutusvaldkondadest. Põhjalik ülevaade ja tutvustus looduslikud abimaterjalidest Eestis nagu vaigud, vahad, tlubi, tõrv, kliister, tuhk, tuhaleelis, süsi, nõgi, pigi, sõnnik, looduslikud värvained, pigmendid, värvimullad, toorsavi, liiv, piiritus, sool, vaigud, šellak, liimained, tökat, rasvad.\nÕppeaines toimuvad väljasõidud:\nLubiahjud\nLiivimaa Kasetõrv ja tökat\nMesilasvahast küünlad\nViiruki valmistamine Hiiumaal\nSaviukumaja\nTaimedega värvimine tuhaleelisega\nÕppeaines toimuval praktikal saavad osalejad segada vahasid ja pigmente, valmistada vaike, värve ja viirukeid. Iseseisva tööna katsetada vahade ja vaikude kokkusulatamist ja segamist erinevatel temperatuuridel. Kirjeldada ja analüüsida tööprotsessi. Eelnevalt on seminarides ja praktikumides väljatöötatud ohutusnõuded ja tutvutud jääkide utiliseerimisnõuetega.\nJoonistada looduslike ja sünteetiliste abimaterjalide elukaared ja eluringid!Objectives/eesmärkid:  Õppeaine eesmärgiks on anda ülevaade looduslikest ja sünteetilistest abimaterjalidest maailmas ning üksikasjalikumalt keskenduda looduslike abivahendite valmistamisviisidele ja kasutusvaldkondadele Eestis. Viia läbi praktikume erinevate materjalide tutvustamiseks, valmistamiseks ja rakendusviiside leidmiseks. Väljasõidud loodusesse ja erinevatesse ettevõtetesse annavad hetkepildi Eestis valmistavatest ja kasutatavatest looduslikest abimaterjalidest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\n- teab levinumaid looduslike abivahendeid maailmas, tunneb üldiselt nende valmistamise tehnoloogiaid ja peamise kasutusvaldkondi;\n- oskab eristada looduslikke abimaterjale keemilistest nende koostise ja kasutusvaldkonna järgi;\n- oskab leida Eestist looduslike abimaterjalide toormaterjale ja oskab neid koguda ja kasutada, kui taastuvaid loodusmaterjale;\n- oskab kasutada materjalide juures loodusressursse nagu vesi, päike, tuul ja õhk;\n- teab ja tunneb ohutusnõudeid materjalide kogumisel, valmistamisel ja kasutamisel;\n- oskab valmistada ja kasutada vähemalt kolme loodusliku ablimaterjali ja tunneb nende algmaterjale ning kokkusobivust teiste looduslike materjalidega;\n- on teadlik looduslike abimaterjalide jääkide minimeerimisest ja utiliseerimisest."}