{"KURSUSE_NIMI": "Materjaliuuringute alused", "KURSUSE_KOOD": "HVVK.01.048", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Materjaliõpetus"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 12, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tutvutakse tekstiilialase materjaliuuringute ja nende meetoditega, Eestis läbi viidavate materjaliuuringute ja neid teostatavate uurimislaborite ja ettevõtetega. Traditsioonilised looduslikud tekstiilikiud ja -materjalid, nende tööstuslikud arendused, eriomadused, tootmine ja kättesaadavus. Keemilistest kiududest tekstiilimaterjalid. \n\nKui loengu sihtgrupiks on muuseumide tekstiilikogude hoidjaid, suunatakse aine sisu spetsiifilisemalt. Sel juhul oleksid teemad: \nLooduslike ja keemiliste tekstiilmaterjalide füüsikaliste omaduste testimise võimalused, metoodikad ja seadmed. Arheoloogiliste tekstiilide materjalide määramise spetsiifika. Etnograafiliste tekstiiilide määramise spetsiifika. Metoodika, kas ja millised võimalused on kindlaks teha tundmatu kiusisaldusega materjali koostist nii teoreetiliselt kui praktiliselt ja hinnata selle materjali omadusi. Tänapäevased konserveerimismaterjalid ja milliseid kanga teostus- ja parandusvõtteid tänapäeval tekstiilide konserveerimises kasutatakse.Objectives/eesmärkid:  Õppeaine eesmärk on anda ülevaade tänapäevastest tekstiilialastest materjaliuuringute võimalustest ja nende rakendusest pärandtehnoloogia ja innovatsiooni kontekstis. Vajadusel antakse ülevaade ka muuseumikogudega töötamiseks vajalikest materjalide määramise meetoditest.Learning outcomes/õpiväljund:  Aine edukal läbimisel üliõpilane:\n- oskab eristada-määrata looduslikke ja keemilisi tekstiilikiude ja teab, kust leida vajadusel lisaekspertiisi; \n- oskab kasutada esmaseid määramisvahendeid ja materjaliuuringute võimalusei Eestis;\n- oskab kasutada materjaliuuringute võimalusi oma erialases töös."}