{"KURSUSE_NIMI": "Professionaalse enesearengu seminar", "KURSUSE_KOOD": "HVVK.03.050", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 12, "independent_work": 66, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Seminar koosneb ühest auditoorsest kohtumisest, kus tutvustatakse tudengitele professionaali ja isikliku arengu mudelite lähenemisi ning seminari käigus, tudeng määratleb enda, kui tuleviku professionaali nägemuse (eesmärgi),  eeldused ja takistused isiklikus arengus. Seminarile järgnevad personaalsed kohtumised, kus õppejõud tagasisidestab ja aitab paremaks formuleerida eesmärgid ning lahti mõtestada eeldused ja takistused, pannakse paika eesmärgi suunas liikumise teekond. Igakuiselt toimuvad kohtumised, kus lektor jagab tudengid väiksemateks kootsingu gruppideks, kus igal tudengil on võimalus saada tagasisidet oma arengu teekonnale ja mingi takistuse ületamisele. Kootsingu kohtumistega paralleelselt toimuvad ka personaalsed kohtumised lektoriga, kus arutatakse ja analüüsitakse arenguteekonna seisundit.\nKogu protsessi vältel tudeng peab ka päevikut, kuhu ta täheldab olukordi ja muutuseid enda motivatsioonis ja arengus.Objectives/eesmärkid:  Läbi konkreetse seminari tudeng on lahti mõtestanud: 1.\tMis on professionaalsus ja selle erinevad käsitlused 2.\tMillised on erinevad arengumudelid 3.\tMillised on tema eeldused ja takistused õpitaval erialal professionaaliks kujunemisel 4.\tTudeng on teadlik, kuidas ületada takistusi ja teha tööd iseendaga professionaaliks kujunemisel 5.\tTudeng on saanud nõustamist ja tuge oma kaasteelistelt oma enesearengu teekonnal.Learning outcomes/õpiväljund:  Üliõpilane on:  - pädevam professionaalsuse ja arenguteekonna mõistmisel;  - oskab lahti mõtestada ennast tuleviku professionaalina;  - suudab kasutada eelduste, takistuste ja takistuste ületamise mudelit oma motivatsiooni ja professionaalsuse tõstmise teekonnal."}