{"KURSUSE_NIMI": "Joonistamine", "KURSUSE_KOOD": "HVVK.01.199", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 24, "seminar": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Joonistamise põhitõed - pildi ülesehitus, proportsioonid, konstruktsioonid, perspektiiv. \n \nErinevad objektid. Inimene. Loodus. Arhitektuur. Erinevate töövahendite kasutamine, vastavad töövõtted. Tööde eksponeerimine.Objectives/eesmärkid:  Joonistamine on valitud eriala toetav aine.  Eesmärk on anda võimalus loovuse arendamiseks joonistamisele omaste võimaluste ja vahenditega, arendades visuaalseid ja manuaalseid võimeid, vaatlusoskust ning kavandatu teostamist. Anda oskusi iseseisvaks mitmekülgseks tegutsemiseks, eeskätt erialaste ideede visandamisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse edukalt läbinud üliõpilane\n- on omandanud joonistamise peamised alused;\n- tunneb kompositsiooni põhimõtteid;\n- oskab kujutada joonistatavat vastavalt perspektiivile;\n- oskab edasi anda proportsioone ning konstruktsioone;\n- valdab joone- ja pinnakasutust;\n- tunneb kujutatava kahemõõtmelisena käsitlemise põhimõtteid\n - suudab iseseisvalt oma tööga suhestuda,\n- tunneb motiveeritust ja oskab näha oma arengut, \n- oskab oma töid vormistada ja hindamisele esitada. Kõik tööks vajalikud vahendid (sh. joonistuspaber A2) peavad olema tunni alguses kaasas.\nJOONISTUSVAHENDID MÜÜGIL\nViljandis on kunstitarbed (paber, joonistusvahendid) müügil Centrumis, II korrusel kirjatarvete poes.\nTallinnas G-galerii kunstitarvete kaupluses Vabaduse väljak 6 ning kaupluses Vunder, Pirni t. 5.\nSoodsa hinnaga joonistuspaber müügil kaupluses Zelluloos.\n\nThe students must be equipped with all resources for carrying out the assignment (including A2 size drawing paper) at the beginning of the class.\nTHE DRAWING TOOLS CAN BE BOUGHT:\nin Viljandi, art supplies (paper, drawing equipment) are sold at Centrum, in the stationery shop on the 2nd floor;\nin Tallinn, at the art supply shop of G-galerii at Vabaduse väljak 6 and in Vunder shop at 5 Pirni Street;\ndrawing paper at a discount price is sold at Zelluloos shop."}