{"KURSUSE_NIMI": "Enesejuhtimine ja meeskonnatöö", "KURSUSE_KOOD": "HVVK.01.005", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "- Sissejuhatus ajajuhtimisse. Eesmärgi püstitamine ja selle täpsustamine coachinguga. Konsensusliku otsuseni viivad tehnikad.\n- Enda analüüs DISC-isiksuseprofiili jt teiste sarnaste meetodite abil.\n- Koosolekute formaadid Patrick Lencioni järgi. Marshall Goldsmithi meeskonna arengut järgmisele tasemele tõstvad rühmacoachingu meetodid.\n- Inimeste motivaatorid Susan Weinschenki järgi.\n- Oma tegevuste kaardistamine ja prioriteetide paikapanek. Google Calendari, Trello ja märkmiku otstarbekas kasutamine. \n- Ootamatuste ja takistustega toimetulek. Venitamise vältimine. Pomodoro tehnika.\n- Projekti loomulik planeerimine. Mõttekaardi koostamine.\n- Arhiveerimise põhitõed.\n- Rühma ja meeskonna vahe. Rühma arenguprotsessi põhistaadiumid. Konfliktijuhtimise põhivõtted.\n- Meeskonnatöö iseärasused globaalsetes, kultuuridevahelistes, virtuaalsetes ja isereguleeruvates meeskondades.Objectives/eesmärkid:  Kujundada arusaam meeskonnatöö ning isikliku ja meeskondliku tegevuste juhtimise põhimõtetest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse edukalt läbinud üliõpilane \n- oskab püstitada enda ja meeskonna eesmärke ning suudab välja selgitada neist eesmärkidest lähtuva tegevuskava;\n- oskab analüüsida enda kui meeskonna liikme tugevusi ja nõrkusi;\n- tunneb peamisi meeskonnasisese suhtluse põhimõtteid;\n- mõistab meeskonnaliikmete peamisi motivaatoreid;\n- suudab kaardistada ja prioritiseerida lihtsamate projektide tegevusi;\n- mõistab projekti loomuliku planeerimise põhimõtteid, oskab neid lihtsamate projektide puhul rakendada ning koostada vastavat mõttekaarti;\n- oskab otstarbekalt kasutada Google Calendari, Trellot ja märkmikku;\n- teadvustab venitamiste peamisi põhjuseid ja oskab selgitada ootamatuste ja takistuste ületamise võtteid; \n- tunneb arhiveerimise põhitõdesid ja oskab neid isikliku arhiivi kujunduse või kujundusplaani näitel selgitada;\n- teeb vahet rühmal ja meeskonnal;\n- oskab selgitada rühma rajamise ja selle arendamise mudelit;\n- mõistab rühma käitumise dünaamikat;\n- oskab tea valet globaalsel, kultuuridevahelisel, virtuaalsel ja isereguleeruval meeskonnal ning teab, millised probleemid võivad erinevates tiimides kerkida."}