{"KURSUSE_NIMI": "Ülevaade kultuurivaldkonna institutsioonidest", "KURSUSE_KOOD": "HVVK.03.021", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse jooksul tutvuvad üliõpilased Eestis kultuurivaldkonnas ning erinevates alavaldkondades tegutsevate institutsioonidega ning õpivad mõistma institutsioonide seoseid nii kultuuripoliiitika, ühiskonna kui majandusega laiemalt. Aine jooksul käsitletakse nii ajaloolist vaadet nende kujunemisele kui ka tulevikutrende ning selgitatakse olulisi institusionaalse teooria mõisteid nagu  legitiimsus, võim, mõju jne Toimuvad ka praktilised institutsioonide külastused ning iseenda kui kultuurikorraldaja (oma organisatsiooni) koostöövõimaluste ja-oskuste kaardistamine seoses erinevate institutsioonidega.Objectives/eesmärkid:  Kursuse eesmärgikson anda kriitiline sissevaade kultuurivaldkonna institutsioonidesse, nende legitiimsusesse, rahastamisse ning seostesse majanduse ning ühiskonnaga laiemalt. Näidata muusika, teatri, rahvakultuuri jt valdkondade institutsioonide ülesehitust, juhtimist ja kultuurisündmuste korraldajate seotust kultuuripoliitilise kontekstiga ning kujundada üliõpilaste koostöövõimekust antud institutsioonidega.Learning outcomes/õpiväljund:  Aine läbinud üliõpilasel: 1. on terviklik ülevaade avalik-õiguslikest asutustest, riigiasutustest, riigi asutatud sihtasutustest, kolmanda- ja ärisektori asutustest ning munitsipaalsektorist, sh kutselistest teatritest, helikunsti alastest kontserdikorraldajatest, muusikakollektiividest, rahvakultuuri alla käivatest institutsioonidest ning partnerorganisatsioonidest, samuti erinevate kultuurikorralduslike institutsioonide ülesannetest. Omandatud teadmised võimaldavad orienteeruda valdkonna organisatsioonides ja rahastamisallikates. 2.  on võimeline arutlema kultuurivaldkonna institutsioonide ning nendega seotud võimu, legitiimsuse, ühiskondliku mõju ning ühiskonna alaste küsimuste üle ning mõistma oma rolli antud süsteemis."}