{"KURSUSE_NIMI": "Magistriprojekt", "KURSUSE_KOOD": "HVVK.01.151", "EAP": 24, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "independent_work": 612, "individual_work": 4, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Nõuetele vastava magistriprojekti teostamine, vormistamine ja kaitsmine. \nMagistriprojekt on praktilise kallakuga uurimuslik lõputöö, mille eesmärk on teatud probleemi või teema lahendamine erialaste teadmiste abil ning millega kaasneb rakenduslik tulemus. Magistriprojekt koosneb kolmest osast: a) praktiline osa, b) teoreetilis/metodoloogiline raamistus, c) projekti tööprotsessi dokumentatsioon. Praktiline osa on iseseisev tervik, mille vorm ja maht on vastavuses magistriprojekti eesmärkidega. Teoreetilis/metodoloogilise osa põhiteksti maht on orienteeruvalt 20–30 standardlehekülge (36 000–54000 tähemärki koostühikutega).\n\nMagistritöö projektiks loetakse praktilisel sooritusel ja eksperimentidel põhinevat pärimusmuusikalist, pärandtehnoloogilist vm kultuuripärandi loovrakenduslikku disaini-, kunsti-, arendus- või uurimisprojekti ning seda reflekteerivat kirjalikku osa. Projekt võib olla teos, patentne leiutis, näitus, andmebaas, kontsert (30-35 minutit), film, juhend, käsikiri,  õppematerjal, andmebaas vmt; eseme- või tehnoloogiauurimuse puhul võib projekt seisneda praktilise eksperimendi suuremahulises teostamises; projekt võib olla ka ettevõtte või asutuse arendusprojekt või tootearendusprojekt, mis on olemuslikult seotud kultuuripärandi valdkonnaga.Objectives/eesmärkid:  Ühendada omandatud teoreetilised teadmised ja praktilised oskused kultuuripärandi alaseks suuremahuliseks loovprojektiks.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: - oskab läbi viia loomingulist projekti iseseisvalt või meeskonnatööna, projekti dokumenteerida ja selle tulemusi esitada nii kirjalikus kui ka visuaalses/kuuldelises vormis; - oskab kriitiliselt kasutada erialast kirjandust ja teisi allikaid; - on suuteline demonstreerima erialaste oskuste ja teadmiste terviklikku tundmist; - on rakendanud teadlikkust oma tegevuse eetilistest aspektidest ja ühiskondlikust rollist. Magistriprojekt ja selle kirjalik osa peavad olema vormistatud vastavalt Tartu Ülikooli Viljandi kultuuriakadeemia lõputööde juhendile"}