{"KURSUSE_NIMI": "Lõnga valmistamise tehnoloogia", "KURSUSE_KOOD": "HVVK.01.165", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 36, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Villa põhiomaduste ja eri tüüpi villade tutvustus. Villa kvaliteedi hindamine. Villa kraasimine käsikraasidega. Villa ketramine kedervarrega. Voki ehituse ja tööpõhimõtetega tutvumine. Voki töökorda seadmine ja seadistamine ketruseks. Villa ketramine vokiga. Ketrustehnikad. Korrutamine.\nVilma villakoja seadmete ja ohutusnõuete tutvustus. Villa ettevalmistus pesuks, villa pesu ja kuivatamine. Etapiline töö villakoja masinatega: villa huntimine, kraasimine, draftimine ja ketrusmine/korrutamine. Lõnga kerimine. Masinate hooldamine.Objectives/eesmärkid:  Õppeaine eesmärgiks on tutvustada villa töötlemist ja erinevaid ketrustehnikaid, kasutades nii traditsioonilisi kui tööstuslikke villa töötlemisvahendeid. \nKetramise praktika eesmärgiks on tutvustada käsitsi villa töötlemiseks ja ketramiseks kasutatavaid töövahendeid ja -võtteid. Praktilise töö käigus tehakse läbi villa käsitsi kraasimine ja ketramine.\nVillakoja praktika eesmärgiks on tutvustada masinaid ja ohutusnõudeid. Praktilise töö käigus teha läbi kõik tööprotsessid, mille tulemusena valmib villast lõng.Learning outcomes/õpiväljund:  Õppeaine läbimisel oskab/teab üliõpilane: - Villakiu omadusi ja erinevaid villa tüüpe - Villa kvaliteeti hinnata - Villa käsikraasidega kraasida - Villa kedervarrega kedrata - Vokki ketramiseks ette valmistada ja seadistada - Voki tööpõhimõtteid - Vokiga ketramise võtteid - Lõnga korrutada ja üle korrutada - Villakoja seadmeid ohutult kasutada ja hooldada - Villa ettevalmistustöid - Villa tõhusaid pesemisviise - Villa huntimismasinaga töödelda - Villa kraasimismasinaga kraaslindiks töödelda - Kraaslinti draftimismasinaga heidelindiks töödelda - Heidelindist ketrusmasinaga lõnga kedrata - Lõnga ketrusmasinaga korrutada - Valmis lõnga masinate abil poolida ja haspeldada"}