{"KURSUSE_NIMI": "Tantsuõpetaja projekt", "KURSUSE_KOOD": "HVVK.04.088", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 15, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 63, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel võetakse kokku kogu eelnevas õppeprotsessis omandatu. Kasutatakse teoreetilisi ja erinevate ainete raames omandatud praktilisi pedagoogilisi teadmisi püstitatud ülesannete lahendamiseks. Kaasatud on erinevad professionaalid-praktikud tantsupedagoogiliste ja tantsukunsti uurimisküsimustele vastuste otsimiseks. Arutelud, teemapüstitused, küsimused ja diskussioonid on suunatud toetuseks valmivale magistritööle.\nOsaletakse jooksvates tantsukunsti- ja kunstiharidusprojektides.\nEsitatakse kogutud materjale ja antakse tagasisidet.\nKäsitletakse interdistsiplinaarust tantsu- ja kunstiõpetuses.\nEsitletakse praktiliste tööde valmistamisega seotud probleeme.Objectives/eesmärkid:  Luua eeldused interdistsiplinaarse tantsukunsti mõistmiseks, loomiseks ja õpetamiseks.\nAnda ülevaade ja luua tingimused mitmekülgse õppemetoodika kasutamise võimalustest koolis ja õpetaja professionaalses praktikas. Arendada läbi praktiliste loov- ja koostööülesannete erinevaid õpetaja pädevusi. Kaasata õppijad professionaalse õpikogukonna tegevustesse toetamaks nende enesearengut õpetajana. Toetada õppija arengut magistritöö valmimise suunas.Learning outcomes/õpiväljund:  1. Tunneb interdistsiplinaarse tantsukunsti mõistet; 2. oskab oma ideid sõnaliselt väljendada ja põhjendada; 3. saab praktilise kogemuse pikemaajalisest tööprotsessist idee ja vormi väljatöötamisel; 4. on tutvunud erinevate ea-, teema- ja eesmärgikohaste õppemeetoditega ning alustab oma isikupärase metoodika loomist; 5. mõistab loova tegevuse mõju õpilaste ealistele ja arenguliste erisustele ning teab, kuidas nendega arvestada õppetöö korraldamisel."}