{"KURSUSE_NIMI": "Lavastuse audiovisuaalsete kujunduste alused", "KURSUSE_KOOD": "HVVK.04.090", "EAP": 2.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 40, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 25, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus käsitletakse erinevaid meedialiike lähtudes mudelist:\ndigitaliseerimine, töötlemine, edastamine võrgus, inimtaju mõju.\nKäsitletakse põhimõtteliselt sama probleemi ilmnemist nt. digitaalses pildi- ja helitöötluses ning meedialiigist lähtuvaid erinevusi lahendustes. Üliõpilane õpib valguskujunduse põhitermineid, valgustehnikat ja selle kasutamise võimalusi, valgukujunduse tegemise põhialuseid ning kursuse läbinuna on võimeline valguskujundaja/valgusmeistriga koostöös tegema lihtsamaid valgukujundusi/valguseid tantsuetendusele. Kursuse lõpuks on üliõpilane suuteline analüüsima etenduste valguskujundust.Objectives/eesmärkid:  Aine eesmärgiks on anda algteadmised ja praktiline kogemus digitaalset multimeediat võimaldavatest baastehnoloogiatest ning tutvustada üliõpilastele valguskujunduse olemust, tööpõhimõtteid ja terminoloogiat.Learning outcomes/õpiväljund:  Aine edukal läbimisel üliõpilane:\n- oskab turvaliselt oma erialasesse töösse rakendada peamisi multimeediaseadmeid (projektor, kaamera jms);\n- oskab eristada analoogkujul informatsiooni digitaalsest informatsioonist, tunneb digitaliseerimise põhimõisteid, inimtaju rolli multimeedia digitaliseerimisel ning digitaliseerimisega seotud probleemistikku;\n- teeb vahet kadudega ja kadudeta pakkimismeetoditel, teab kadudega pakkimisega seotud riske, oskab tuua vastavaid näiteid;\n- oskab seletada aditiivsete ja subtraktiivsete värvimudelite põhierinevust ja kasutusvaldkondi, tunneb mõistete RGB, CMYK ja YUV tähendust;                                                                                     teab valguskujunduse põhitermineid;\n- tunneb valgustehnikat ja orienteerub selle kasutamise võimalustes;\n- teab valguskujunduse põhialuseid;\n- on võimeline koostöös valguskujundajaga teostama lihtsamaid valguskujundusi;\n- suudab analüüsida etenduse valguskujundust. Sissejuhatus multimeediasse"}