{"KURSUSE_NIMI": "Kompositsioon", "KURSUSE_KOOD": "HVVK.04.130", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Üldkompositsioon on vaatlusoskust, analüüsivõimet, visuaalset mõtlemist ja kompositsioonitaju arendav õppeaine. Kursuse käigus läbitakse järgmised teemad:\nrütm; fookus; dünaamika; sümmeetria; kontrast; kolme- ja kahemõõtmelise ruumi erinevused; asukoha-, proportsiooni- ja värvisuhted. Värviõpetuse- ja kompositsioonialaste baasteadmistega tutvumine.\nVärviõpetuse- ja kompositsioonialaste ülesannete lahendamine.\nValguse ja varju abil modelleerides esemete kujutamise alustega tutvumine (kattevärvid).\nVärviring, erinevad kontrastharmooniad. Ruumikompositsiooni mõistetega tutvumine, ruumilised harjutused ning ruumi loomine maketina.Objectives/eesmärkid:  Arendada vaatlusoskust, visuaalset analüüsivõimet ja kompositsioonitaju. Luua tingimused värviõpetuse rakenduslike põhitõdede omandamiseks ja maalikunsti tähtsamate väljendusvahenditega (koloriit, joon, pind, tekstuur) tutvumiseks. Seejuures ei unustata ka kompositsiooniprintsiipe nagu tasakaal, kontrast, rütm, sümmeetria. Eesmärgiks on samuti esemete kujutamise ning maaliterviku loomise esmaste oskuste omandamine. Anda üliõpilasele teadmisi ruumikompositsiooni loomise alustest, arendada välja iga üliõpilase isikupärane väljenduslaad ja kompositsioonitaju.Learning outcomes/õpiväljund:  Aine edukalt läbinud üliõpilane:\n- mõistab visuaalse kompositsiooni olemust ja tunneb erinevaid kompositsiooni kategooriaid ning nende osa töö ülesehituses;\n- suudab visuaalselt mõelda; oskab oma töödes pildiliselt veenva ja tervikliku tulemuseni jõuda;\n- tunneb kompositsiooni seaduspärasusi ja vastavaid mõisteid - kuldlõige, rütm, kontrast, tasakaal, kooskõla, sümmeetria ning kasutab neid loominguliste ülesannete lahendamisel;\n- tunneb värviõpetuse maalimise ja kompositsiooni seisukohast olulisi põhimõtteid ning rakendab neid loovalt;\n- oskab esmasel tasandil näha ja teadvustada ümbritseva keskkonna ning esemete värvikvaliteete, tooni, koloriiti, heletumedust, küllastatust, õhuperspektiivi, valguse ja varju toonisuhteid;\n- oskab end iseseisvalt motiveerida, oma tegevust analüüsida ja oma tööprotsessi ning selle tulemust hinnata;\n- oskab oma töid esitleda ja vormistada."}