{"KURSUSE_NIMI": "Sümfooniaorkester", "KURSUSE_KOOD": "HVVK.14.117", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 60, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 18, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Osalemine sümfooniaorkestri töös, repertuaari omandamine. Ettevalmistus avalikeks üritusteks ja orkestriga avalikel üritustel osalemine.Objectives/eesmärkid:  Võimaldada Tartu Ülikooli üliõpilasel osaleda sümfooniaorkestri praktilises töös.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1) omab sümfooniaorkestris mängimiseks vajalikke teadmisi, oskusi ja kogemust; 2) oskab koos töötada sümfooniaorkestri dirigendiga; 3) on omandanud sümfooniaorkestri vastava aasta repertuaari; 4) õpib tundma oma pilli ning on arendanud koosmänguoskust orkestriga; Tartu Ülikooli Sümfooniaorkestri peadirigent on Taavi Kull. Orkestriproovid toimuvad esmaspäeviti kell 18.30-21.30.\nOrkestriga saab liituda jooksvalt, kuid seda peab tegema võimalikult vara, et täita 80% mahus orkestri töös osalemise nõue. \n\nLIITUMISSOOVI KORRAL:\n1. Ära täita osalemissoovi avaldus kodulehel (https://tyso.ee/orkestriga-liitumine). \n2. Pärast avalduse esitamist võtab vastav kontsertmeister soovijaga ühendust ning jagab infot individuaalse erialakatse kohta. \n3. Individuaalse erialakatse edukalt läbinud ja orkestrisse vastu võetud üliõpilased saavad kursusele registreeruda.\n\nSõltuvalt pillirühmade vajadustest võivad toimumisaegadele lisanduda pillirühmade proovid. Palun jälgige rühmajuhi juhiseid!\n\nPalun jälgige orkestri listi saadetavaid kirju!\n\nNB! Orkestril on väike liikmemaks.\n\nRohkem infot orkestri kohta: http://orkester.ut.ee/\nÕppekorralduslike küsimustega võib pöörduda: kadri.steinbach@ut.ee\n\n//\nThe conductor for the Tartu University Symphony Orchestra is Taavi Kull.\n\nStudents can join the orchestra any time during the year but it is advised to join as early as possible during or before the semester to fill the 80% participation requirement.\n\nNB! The orchestra has a small member fee.\nDepending on the progress of different instrument groups in the orchestra there may be additional section rehearsal. Please follow the instructions of your section leader!\nPlease read the e-mails sent through the orchestra's mailing list! \n\nMore information about the orchestra: http://orkester.ut.ee/Avaleht\n\nAll are welcome. Registration to the course does not guarantee a place in the orchestra, all registrants must attend a skill level demonstration, if there are places for the specific instrument in the orchestra. Only students accepted after the assessment can (or students who are already members of the orchestra) can earn ECTS.\n\n------------------------------\nArvestus vastavalt kokku lepitud tähtajale, tulemuste sisestamine õppeinfosüsteemi nädala jooksul.\nEvaluation time in agreement with the lecturer. Results will be entered in the Study Info System in no more than a week after evaluation.\n\nKursuse korraldus võib muutuda, juhul kui koroona-pandeemia oht taastub. \nThe organization of the course may change, if the risk for a Corona pandemic grows.\n-----------\nNB! Täpsem info orkestri listis."}