{"KURSUSE_NIMI": "Lõimitud toode", "KURSUSE_KOOD": "HVVK.01.055", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Inimene ja tehnoloogia", "Materjalid ja nende töötlemine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Erinevatest materjalidest ja tehnikatest töötava seadme loov disainiprotsess. Lõimitakse eelnevalt õpitud eriala õppeaineid. Valmib suurem toode koos õpimapiga.\nÕppeaines \"Lõimitud toode\" peab lisaks reaalsele töötavale tootele lisanduma ka kirjalikult vormistatud (nn kaante vahel) (õpi)materjal ja esitlus.\n\nReaalne töötav toode peab sisaldama mikrokontrollerit, elektroonika komponente, 3D printimise ja/või cnc freesimise ning teisi õpitud eriala õppeainete materjale ja nende töötlemist. Soovitav on kasutada uuemaid materjale ja töötlusviise.\n\nÕpimapp koosneb järgmistest osadest:\n\nTiitelleht.\nSisukord.\nSissejuhatus (kirjeldada, millise tööga on tegemist, mis põhjuselt on see valitud, kes seda kasutama hakkavad, miks see vajalik on jne).\nToote kirjeldus (millistest osadest koosneb, kuidas see üldiselt töötab, soovitused kasutamiseks jne).\nMaterjalide loetelu (koos mõõtudega, kustkohast hangitud ja hinnad, lisada pildid algmaterjalidest).\nToote tehnilised lahendused  ja tööpõhimõte (sh liited, konkreetne tööpõhimõte, viimistlus jne).\nJoonised (sh mõõdud ja 3D modelleerimine) ja pildid (sh tööprotsessist). \nJäreldused (tööprotsessist ja tootest tulenevalt) ja soovitused edaspidiseks (mida silmas pidada ka seda, kui teha uus sarnane toode). Kuidas jäite tööprotsessiga rahule, hinnang oma tööle. \nKasutatud kirjandus.\nIga magistrant esitleb (nt PowerPoint vahendusel (vajadusel lisatud videod), lisatud pildid) oma toodet ja reaalselt toote toimimist (ca 10 + 5 min).\nPeale magistrandi esitlust saavad teised (sh magistrandid) esitada esitlejale küsimusi (kuni 5 min).\n\nHinne kujuneb kaitsmise, reaalse toimiva toote ja kirjaliku materjali (õpimapi) põhjal. Kirjalik materjal (õpimapp/fail) ja esitluse fail jäävad peale kaitsmist vastutava õppejõu kätte, toode jääb magistrandile.\nKaitsmine toimub  TÜ Viljandi kultuuriakadeemias.Objectives/eesmärkid:  Õppeaine eesmärgiks on võimaldada üliõpilasel omandada iseseisev praktilise suunitlusega tehnoloogiline-loominguline toode. Õppeaine õpetamise vahendusel saavutatakse üliõpilase valmisolek rakendada loovalt omandatud erialaseid teadmisi ja oskusi, mille najal valmib töötav seade. Õpitakse töötama teemakohaste allikatega, analüüsitakse vajalikke materjale ja tehnikaid ning leitakse sobivad lahendused. Lõimitud tootest koostatakse õpimapp.Learning outcomes/õpiväljund:  1.\toskab lõimida erinevates eriala õppeainetes omandatud teadmisi ja oskusi; 2.\tsuudab lahendada toote loomisega seotud ülesandeid ja leida ning lahendada probleeme;  3.\toskab toote disainiprotsessi analüüsida ja sünteesida uusi loovaid lahendusi;  4.\toskab korrektselt koostada õpimappi; 5.\toskab toodet esitleda ja kaitsta."}