{"KURSUSE_NIMI": "BIP House of Europe (Viljandi)", "KURSUSE_KOOD": "HVVK.00.100", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sissejuhatava kursuse käigus toimuvad interaktiivseid veebiloengud. Loengute käigus toimuvad videokonverentsi tarkvara abil muuhulgas arutelud väikestes töögruppides. Kursus sisaldab iseseisvaid kodutöid, mis tuleb esitada veebipõhise platvormi kaudu. Kokku katavad neli veebiseminari mitmeid teemasid, võimaldades õpilastel omandada teadmisi valdkondades nagu muusika autoriõigus, lepingulised küsimused, muusikaäri tavad, laulude esitlemine ja artistide suhtekorraldus, samuti laulukirjutamise põhitõed, töövahendid ja meetodid.\nProjekti teise osa, (Intensiivnädala) raames toimub töö kohapeal, fookuses on koostöö kaastudengitega ja selle läbi üksteiselt õppimine, juhendajateks on projektis osalevad partnerülikoolide õppejõud. Kuigi projekti töökeel on inglise keel, julgustatakse osalejaid kirjutama laulusõnu ka oma emakeeles. Intensiivnädala jooksul valminud muusika tuleb esitlusele avalikul kontserdil nädala lõpus.\nProjekti kolmas osa, Postproduktsiooni Periood toimub kaugtööna ja selle läbiviimiseks kasutatakse vajalikku tarkvara (sh programmid veebi kohtumisteks), laulude salvestamiseks ja produtseerimiseks. Erinevates riikides asuvad meeskonnaliikmed teevad omavahel koostööd, et täiustada ja parendada projekti käigus kirjutatud muusikat. Järelproduktsiooni perioodil toimub kolm veebiloengut, mille raames tudengid saavad tagasisidet enda loomingule ja ideid edasiseks tööks professionaalselt muusikaprodutsendilt. Periood hõlmab kolme veebiseanssi, kus professionaalne muusikaprodutsent annab tagasisidet lauludele. Nende veebiseansside vahel jätkavad õpilased omavahel koostööd,et muusika saaks viimase lihvi. \nProjekti tulemusena valmib uut muusikat. Kuuleme erineva kultuurilise tausta ja kogemustega inimeste lugusid.Objectives/eesmärkid:  House of Europe on projekt, mis pakub võimalust toetada koostööd muusikaüliõpilaste ja külalisartistide (migratsioonitaustaga) vahel. Seda tehakse laulude kirjutamise ja uue muusika loomise kaudu. Programmi raames toimuvad töötoad tudengitele ja külalisartistidele, kus suunamise abil saavad nad võimaluse rääkida oma lugusid, jagada oma muusikatraditsioone ning üheskoos muuta see muusikaks. Füüsilistele töötubadele eelneb sissejuhatav veebikursus, mille eesmärk on tutvustada osalejatele laulukirjutamise põhitõdesid ja meetodeid, muusikaäri tavasid ja autoriõigust. House of Europe'i mobiilsusprogramm toob kokku õpilased ja õpetajad kuuest erinevast Euroopa riigist, kes veedavad koos külalisartistidega nädala võõrustava institutsiooni juures intensiivkursusel. Intensiivnädal hõlmab meeskonnatööna laulukirjutamist (muusikat ja sõnu), improvisatsiooni, produtseerimist, salvestamist ja esinemist. Intensiivnädal kulmineerub kontserdiga, kus kursuse muusikaline tulemus esitatakse, ja kus õpilased ning külalisartistid - kes on kursusel osalenud muusika, lugude ja kogemuste allikana - kohtuvad. Töötubade nädalale Võõrustavas ülikoolis, järgneb kaugtöö periood, kus osalejad arendavad oma laule edasi, kasutades selleks muusika- ja suhtlusrakendusi, mis sobivad veebitööks, eesmärgiga saada lood digitaalselt valmis.Learning outcomes/õpiväljund:  Projekti lõpuks eeldatakse, et õpilased on suutnud parandada oma oskusi järgmistes valdkondades: Mõista rahvusvahelist muusika autoriõiguse põhimõtteid, lepingupraktikaid ja üldisi erinevusi erinevate autoriõiguse konventsioonide vahel. Mõista muusikatööstuse töömeetodeid ja on võimelised oma muusikalisi oskusi turundama ja müüma. Kirjutada laule individuaalselt ja meeskonnas, et jõuda soovitud sihtrühmadeni, kasutades loomingulisi tööriistu, meetodeid ja töömudeleid, mis on loodud ja toetatud valdkonna spetsialistide poolt. Oskus suhelda erinevate indiviidide ja gruppide vahel. Kasvanud on tundlikkus mõista erineva kultuuritausta ja kogemustega inimesi. Kasvanud on teadmised meeskonnatöös, (juhtimises), projektide arendamises ja korraldamises. Online Introductory course will take place on four Fridays from 13:00 to 16:00 (Central European Time (CET))."}