{"KURSUSE_NIMI": "Skulptuur", "KURSUSE_KOOD": "HVVK.01.201", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpetatakse tundma skulptuuri spetsiifikat ja eriliike (pisiplastika, reljeef, figuur, portree, dekoratiiv ja monumentaalskulptuur, skulptuur interjööris ja eksterjööris). Õpetatakse erialale omast mõõtmise ja võrdlemise tehnikaid, horisontaal, vertikaal- ja diagonaaltelgede markeerimist, käte ja silmade töö koordineerimist. Õpetatakse konstrueerima ja modelleerima savist erinevaid kolmemõõtmelisi vorme, reljeefe, loodusvorme, inimkeha vorme, figuure, portreed.\nÕpetatakse valmistama ja kasutama voolimise tööriistu, traatkasrkassi, pöörlevat alust ja muid improviseeritud abivahendeid. Õpetatakse mastaabilt väiksemate, kuid keerulisemate vormide valmistamist modelleerimisvahast. Õpetatakse valmistama ja kasutama vahamodelleerimiseks ja -lõikamiseks vajalikke abivahendeid, puidust ja metallist stekasid, skalpelle, nõelu. Õpitakse tundma vahamodelleerimise spetsiifikat, erinevate vahasegude omadusi ja vahamodelleerimise tehnikaid. Kursuse raames õpitakse vahamudelite ettevalmistamist valamiseks, valuvormide tegemist ning erinevatest esemetest vormide ja jäljendite võtmise meetode.Objectives/eesmärkid:  Anda plastilis-mahulise savi modelleerimise ja konstrueerimise võtete ning töövahendite kasutamise oskusi ja teadmisi.\nTutvustada modellerimisvaha mahulise modelleerimise ja konstrueerimise võtteid ning arendada abivahendite kasutamise oskusi.\nÕpiväljundidLearning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine edukal läbimisel üliõpilane teab skulptuuri eriliike; oskab mõõtmist ja võrdlemist, horisontaal-, vertikaal- ja diagonaaltelgede markeerimist; oskab silmade ja käte tööd koordineerida; oskab konstrueerida ja modelleerida savist erinevaid kolmemõõtmelisi vorme, reljeefe, loodusvorme, figuure, inimkeha; oskab kasutada voolimise tööriistu, pöörlevat alust, traatkarkassi ja improviseeritud abivahendeid.\nTunneb erinevaid vaha modelleerimise tehnikaid, vahasegude omadusi ja modelleerimise põhilisi abivahendeid; oskab reljeefide, figuuride, portreede, pisiplastika, etnograafiliste ehete ja esemete replikatsioonide modelleerimist; oskab reljeefset ja ümarplastilist skulptuurset vormi tajuda, modelleerida ja vormistada; oskab vahamudeleid valuks ette valmistada; tunneb valuvormide tegemise põhimõtteid ja erinevatest esemetest vormide ja jäljendite võtmise tehnikaid. Hindest teatamise tähtaeg 30. juuni"}