{"KURSUSE_NIMI": "Pedagoogiline praktika", "KURSUSE_KOOD": "HVVK.02.002", "EAP": 2, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "1. Vaatluspraktika sisuks on erinevates vanuseastmetes grupitunni (solfedžo, muusikaliteratuur, ansamblid, orkestrid, jmt)ja/või individuaaltunni vaatlemine ja analüüsimine, etteantud vaatluslehtede täitmine, moodlesse laadimine \n2. Praktikatunnid: Eesmärgiks on saada esimene kogemus individuaal- või rühmatunnis õpetajana.Objectives/eesmärkid:  Pedagoogilise praktika eesmärgiks on üliõpilaste õppe- ja kasvatusteaduslike teadmiste integreerimine muusikakooli tegelikkusesse, pilliõpetusalaste teadmiste omandamise rakenduslik vorm, mille põhiülesanded on\n* integreerida pilliõpetamise teoreetilised teadmised ja pedagoogilised oskused;\n* teadvustada õpetaja roll(id) tegelikus muusikakoolitöös selle tänapäevases sotsiaalses ja kultuurilises kontekstis;\n* kujundada üliõpilase pedagoogilist eneseteadvust ning motiveerida teoreetilisi õpinguid;\n* arendada loovtegevuste juhendamisel õpilaste individuaalsusest tingitud eripärasuste tajumist, personaalse submetoodika valiku oskust.                            \n Laiendada ja arendada esimesel koolipraktikal saadud õpilaste tundmaõppimise ning tundide ettevalmistamise ja analüüsimise põhioskusi. Lisaks sellele õpitakse iseloomustama ja käsitlema klassi sotsiaalse rühmana nii distsipliini- kui motivatsiooniprobleemide lahendamisel.    \nKinnistada pilliõpetamise vallas omandatud teoreetilisi teadmisi läbi individuaal- ja rühmatundide läbiviimise muusikakoolis.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n1. omab ülevaadet pilliõpetaja tööst muusikakoolis vm huvikoolis;\n2. tunneb muusikakooli tööd reguleerivat seadusandlust ja dokumentatsiooni;\n3. analüüsib pilliõpet erinevates vanuseastmetes         \n4. analüüsib erinevaid pedagoogilisi situatsioone grupitundides;\n5. loob muusikaõppeks sobiva õpikeskkonna;\n6. arvestab õpilase individuaalseid, ealisi ja isiksuslikke eripärasid pillitundide ettevalmistamisel ja läbiviimisel.                \n7. analüüsib pidevalt oma tööd õpetajana ning planeerib oma pedagoogilist karjääri;\n8. kaasab õppetöö planeerimisse teisi õpetajaid ja lapsevanemaid;\n9. tunneb ja rakendab individuaal- ja grupitöö meetodeid erinevates vanuseastmes õpilaste õpetamisel.\n  ."}