{"KURSUSE_NIMI": "Palkehituse praktika", "KURSUSE_KOOD": "HVVK.01.030", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 32, "individual_work": 0, "internship": 40}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "PALKEHITUSE PRAKTIKA\nHarjutades kinnistatakse aine Palkehituse alused ja Palkehituse põhikursus materjal. Üliõpilane peab tööperioodil praktikapäevikut vastavalt RE praktikajuhendis (https://www.is.ut.ee/pls/ois_sso/tere.tulemast?viit=2120006) määratletud korrale ning esitab iga praktika järgu kohta korrakohase kirjaliku praktikaaruande.Objectives/eesmärkid:  Praktikal kinnistab üliõpilane teadmised palkehitustehnikast ning loob valdkonnaga vahetu kogemusliku suhte. Praktika läbimise järel on üliõpilane omandanud adekvaatse ettekujutuse tootlikkusest, materjali- ja töömahtudest ning kvaliteedist käsitöises palkehituses ning on moraalselt ja tehniliselt küps praktikaks kutselises palkehitusebrigaadis.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Praktika edukalt läbinud üliõpilane oskab\n-\tinventeerida ehituspalke;\n-\tkoostada ja vormistada palgitabelit, töödelda tabeli andmeid tabelarvutusprogrammis;\n-\tkasutada palgitabelit töökohal;\n-\tarvutada ja palgitabeli abil välja valida sobivad alus- ja poolpalgid;\n-\tlõigata välja alumised täis- ja poolpalgid;\n-\tkontrollida aluse või vundamendi tasapinnalisust;\n-\tpaigaldada plaanikohaselt esimest palgirida;\n-\tkontrollida palkkehandi ristmõõte;\n-\tarvutada järgmise palgi sobivaid mõõte ja valida palgitabeli abil sobivat palki;\n-\tmäärata palgi õiget ladva-tüve suunda vastavalt asukohale nurgamustris;\n-\tmäärata sirkli kalibreeringut musta tapi tarvis;\n-\tlõigata välja musta tappi vastavalt tapi tüübile;\n-\tmäärata loodsirkli kalibreeringut lõpliku märkimise tarvis;\n-\tjusteerida loodsirklit;\n-\tmärkida vara ja tappi enamlevinud tapiliikide puhul;\n-\tpalgi töötlemiseks vajalikud töövahendeid komplekteerida ja ette valmistada;\n-\tpalgi töötlemiseks töökohta ette valmistada ning asetada palki ergonoomilisse ja ohutusse töötlemisasendisse;\n-\tkasutada palgi töötlemisel tarvitatavaid rakiseid ning ise lihtsamaid rakiseid valmistada;\n-\tvalida töövahendeid vastavalt sooritatavale operatsioonile;\n-\tlõigata välja tappi ja vara õiges tehnoloogilises järjekorras;\n-\tviimistleda tappi ja vara;\n-\tviimistleda vara ja tappi käsitööriistadega;\n-\tasetada töödeldud palki seinale, iseseisvalt tuvastada ja parandada vigu;\n-\tdimensioneerida ja valmistada salapulki;\n-\tmäärata iseseisvalt salapulkade sobivat asukohta;\n-\tpuurida salapulkade avasid ja paigaldada salapulki;\n-\tsiluda, viimistleda ja puhastada valmis palgipindu;\n-\thooldada palkehituses kasutatavaid töövahendeid;\n-\tkorraldada nõuetekohaselt oma töökohta;\n-\ttöötada ennast ja keskkonda säästvalt."}