{"KURSUSE_NIMI": "Inimene ja tehnoloogia", "KURSUSE_KOOD": "HVVK.01.051", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 10, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaines omandatakse arusaam ja mõistmine inimese ja tehnoloogia suhtest ja mõjudest.  Käsitletakse tehnoloogia erinevaid valdkondi. Sooritakse lihtsaid praktilisi ülesandeid tehnoloogia rakendustest. Õppetöö tulemusena saavutatakse üliõpilase valmisolek rakendada loovalt omandatud teadmisi tehnoloogiõpetuse õpetamisel koolitundides.\n\nTehnoloogia, tehnoloogiline kirjaoskus, tehnoloogiaõpetus. Süsteemid, protsessid ja ressursid. Tehnoloogia valdkonnad. Energeetika ja transport. Info- ja kommunikatsioonivahendid. Tehnoloogia muudab maailma. Analüüs ja süntees. Tehnoloogia ja eetika.Objectives/eesmärkid:  Õppeaine eesmärgiks on võimaldada üliõpilasel omandada ülevaade tehnoloogiast ja selle erinevatest valdkondadest. Õppeaine õpetamise vahendusel saavutatakse üliõpilase valmisolek rakendada loovalt omandatud teadmisi tehnoloogiõpetuse õpetamisel koolitundides.Learning outcomes/õpiväljund:  1. teab ja oskab rakendada tehnoloogia erinevaid valdkondi õppetöös.                                                        2. oskab toodete ja seadmete juures koostada ja esitleda süsteeme, protsesse ja ressursse. 3. oskab analüüsida tehnoloogia positiivseid ja negatiivseid ilminguid. 4. lähtub tehnoloogia eetilistest tõekspidamistest ja jätkusuutlikust lähenemisest.                                                               5. oskab koostada referaati tehnoloogia valdkonna olulistel teemadel.                                                                             6. mõistab tehnoloogilise kirjaoskuse vajalikkust.    7. oskab loovalt lahendada praktilisi ülesandeid ja konstrueerida tehnilisi lahendusi."}