{"KURSUSE_NIMI": "Improvisatsioon", "KURSUSE_KOOD": "HVVK.04.076", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 48, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 30, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tundides uurime ja avastame kehatunnetusliku mõtlemise ja improvisatsioonilise liikumiskeele kokkupuute punktide seotust ja erinevust, pöörates tähelepanu omaenda keha keerukusele ja/ või lihtsusele. Avastame liikumise päritolu, proovime minna erinevatesse suundadesse, laiendades iseenese arusaamist liikumisest enda sees kui ka ümber, leides uusi võimalusi ja avastades end nii uutes tegevusvaldkondades ning saades seeläbi teadlikumaks eneseväljendamise võimalustest tantsuliikumiste kaudu.\nTegeleme inimkehas toimuvate protsesside ja valikutega, mis viivad idee jäljendamisele momentaalselt, mõtlemata liigutuste järjekorrale.\nImprovisatsioon on kui vaba loovuse väljendus ning vabaduse tunnetamine meie enda piiritletud võimalustest.\nImprovisatsiooni tunnis on tähtis avastada oma mina tõeline tuum, tunde-emotsioonid, tahtmised- väljendamised, fantaasia, meeleolud, soovid, unelmad, kehakeele tunnetus, refleksid, zestid jne.\nTegeleme kujutlusvõime ja inimkeha vahel toimuvate protsesside ja valikutega, mis viivad kujutluse jäljendamisele momentaalselt, mõtlemata liigutuste järjekorrale.Objectives/eesmärkid:  Aine eesmärgiks on arendada üliôpilase loomingulist môtlemist ja liikumise tundlikust, kehatunnetust ning konsentratsiooni ning tutvustada keha anatoomiast lähtuvaid improvisatsioonilisi liikumisideid. \nTutvustada improvisatsioonilise kehatunnetusliku liikumiskeele olemust ja kasutamisvõimalusi, julgustades tudengeid vabalt liikuma ning looma spontaanselt uusi liikumismaterjale. Seejuures kasutatakse isiklikku informatsiooni ning kogemust, (intuitiivseid, emotsionaalseid, intellektuaalseid ) füüsiliste katsetuste tulemusena jõutakse välja igaühe originaalse ja individuaalse väljendusviisini.Learning outcomes/õpiväljund:  1. Oskab kasutada muusikalise rütmi asemel sisemist rütmi ja vaikust\n2.On valmis ettevalmistamata liikuma ruumis, ajas, hetkes, nii individuaalselt kui ka grupi situatsioonis\n3.On valmis looma spontaanse inspiratsiooni ajel erinevaid isiklikke liikumiskujundeid\n4. Oskab leida liikumisstiimulit, kasutades igat momenti juhuslikkuse mõjutajana, kogeb ansamblitaju läbi ühisimproviseerimise\n5. Avastab oma mina, tunde - emotsioonid, tahtmised - väljendamised, fantaasiad, meeleolud, soovid, unelmad, kehakeele ja selle tunnetuse,\nrefleksid, zestid jne.\n6. Oskab kogeda, kasutada impulssi, inertsi, gravitatsioonijõudu\n7. Oskab märgata enda liikumismustreid, julgeb neid analüüsida ning anda neile võimaluse arenguks läbi erinevate harjutuste.\n8. Omandab spontaanse tahteväljenduse kasutamise oskuse erinevate kehaliikumiste kaudu, tunnetades loovat energiat.\n9. Mõistab teekonda eneseotsingusse, -leidmisse, -teostusse, arengusse\n10.Omab soovi ja julgust improviseerida laval"}