{"KURSUSE_NIMI": "Loovettevõtja baaskursus", "KURSUSE_KOOD": "HVVK.12.044", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb auditoorsetest loengutest ja grupitöödest, mille raames kaetakse järgmised teemad: \n*ettevõtlusalane baasterminoloogia;\n*äri- ja projektiideede leidmine, analüüsimine, arendamine ja kommunikeerimine;\n*ettevõtlusprotsessi olemus, eeldused ja komponendid;\n*eelarvestamise põhialused, rahastajate leidmine;\n*äri- või projektiidee jaoks taustainformatsiooni kogumine ja analüüsimine (konkurentsianalüüs jne);\n*ärimudel kui kontseptsioon ja ärianalüüsi tööriist;\n*loomeettevõtluse, sotsiaalse ettevõtluse ja kogukondliku ettevõtluse eripärad;\n*turunduse ja kommunikatsiooni põhitõed;\n*ettevõtluskeskkonda kujundavad tegurid, sh seadusandlus, maksundus, raamatupidamise korraldamine, intellektuaalomand ja selle kaitse;\n*innovatsiooniprotsessi olemus ja innovatsiooni juhtimine;\n*rollid meeskonnas ja efektiivne meeskonnatöö korraldamine;\n*äriplaani või projekti koostamine, vormistamine ja esitlemine.Objectives/eesmärkid:  Kursuse eesmärk on arendada ettevõtlushoiakut, omandada ettevõtlusalaseid teadmisi ning rakendada need oma idee vormimisel äriplaaniks. Õppijad omandavad kursuse käigus põhiteadmised ning praktilised oskused (äri)plaani kavandamiseks, käivitamiseks. Kursus lõppeb äriplaanide esitlemisega.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel üliõpilane: * teab olulisemaid sotsiaalseid, kultuurilisi ja majanduslikke trende ning nendest tulenevaid ettevõtlusvõimalusi, valib strateegiliselt sobiva idee arendamiseks ning mudeldab seda; * tunneb meeskonnatöö põhialuseid, tajub enda rolli meeskonnas, oskab seostada isiklikke eesmärke meeskonna eesmärkidega; * mõistab brändi olemust ning turunduse ja kommunikatsiooni põhialuseid; * tunneb erinevaid ettevõtlusvorme (FIE, OÜ, MTÜ) ning on teadlik ettevõtlust reguleerivatest olulisematest seadustest, tunneb maksunduse ja eelarvestamise põhiprintsiipe; * omab ülevaadet toote või teenuse arendamise põhiprotsessidest, kvaliteedi- ja riskijuhtimisest; * oskab vormistada äriplaani ning tunneb olulisemaid esitlustehnikaid. Loovettevõtja mikrokraadi edukalt läbinu oskab lisaks eelnevale: * püstitada sobivaid hüpoteese äriidee ja ärimudeli testimiseks turusituatsioonis; * turusituatsioonis kogutud andmetele tuginedes enda äriideed ja ärimudelit edasi arendada; * ideed investoritele esitleda."}