{"KURSUSE_NIMI": "Pärltikand", "KURSUSE_KOOD": "HVVK.01.162", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "- Pärltikand etnograafilistel tekstiilidel (tanu, põll, vöö, erinevad aksessuaarid).\n- Tehnilised töövõtted (kursusel tehakse tööproovide vormis läbi eesti rahvuslikus tikandis esinevad pärlite kinnituspisted ja sellega seoses õpitakse valima ka õigeid materjale ning töövahendeid).\n- Metoodilise materjali koostamine (praktiliste ülesannetena sooritatakse tööproovid ja valminud materjalidest koostatakse õpimapp, essee vastavast kirjandusest.\n- Loomingulise ülesandena valmib pärltikandiga kaunistatud aksessuaar või rahvarõivas.Objectives/eesmärkid:  Anda ülevaade Eesti rahvarõivastel ja aksessuaaridel kasutatud pärltikandist. Tutvuda eesti etnograafiliste pärltikanditega nii rõivastuses kui ka tarbetekstiilis. Õpetada erinevaid kinnituspisteid ja pärlite (kudruste, piprellide) kinnitamistehnikaid. Tutvuda pärltikandi liikidega ja tehnilise teostusega. Rahvakunstile omaste tikandite ja mustrite loov interpreteerimine ja kasutamine kaasaegses tekstiilis.Learning outcomes/õpiväljund:  Aine edukal läbimisel\n- teab eesti rahvapärase pärltikandi arengut 19.-20.saj alguse rõiva- ja tarbetekstiilidel;\n- tunneb paikkondlikke stiiliiseärasusi, oskab eristada Mandri-Eesti ja saarte tikandidekoori etnograafiliste tekstiilide põhjal;\n- oskab koostada metoodilist õppematerjali ja pärltikandis teostada rahvuslikku rõivakaunistust või aksessuaari, valides selleks sobivad materjalid ja koloriidi;\n- tunneb eesti pärltikandiga kaunistatud esemeliike;\n- oskab määratleda esemete piirkondlikku päritolu;\n- teab pärltikandi arenguloolist tausta;\n- oskab valida pärltikandi teostamiseks sobivaid materjale ja töövahendeid;\n- on omandanud pärltikandi teostamiseks erinevad tehnilised töövõtted;\n- oskab tikandiliigi põhilisi mustreid kaardistada ja materjale käsitleda;\n- oskab kaunistada pärltikandis mõnda riideeset või aksessuaari;\n- oskab koostada metoodilist õppematerjali."}