{"KURSUSE_NIMI": "Kunstiõpetuse didaktika", "KURSUSE_KOOD": "HVVK.03.019", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "I osa\nKunstide õpetamise filosoofilised alused ja ajalugu Lääne kultuuriruumis. \nPatronaat ja ligipääsetavus kunstiõppele, seosed ühiskondlike ideoloogiate ja süsteemidega.\nKunstiõpetuse rolli ja funktsioonide muutumised erinevatel ajalooperioodidel ja ühiskonnakordades.\nKunsti ja käsitöö lahknemine; põhjused ja funktsioonid.\nJoonistamisõpe, erinevad joonistamise õpetamise süsteemid.\nKunsti populariseerimine ja rahvaharidus. Psühholoogia tekkimine ja mõju kunstiharidusele.\nVisuaalsete kunstide õpetamine üld- ja kõrghariduses, riiklikus, era- ja alternatiivhariduses.\nKunstiõpetus Eesti kõrg- ja üldhariduses enne II Maailmasõda.\nBauhaus. Ekspressiivne ja rekontstruktsiooniline vool kunstiõpetuses. DBAE ja ARTS Propel.\nRahvusvaheliste suurorganisatsioonide  roll kunstiõpetuse edendamisel ja arendamisel üldhariduses.\n\n\nII osa\nKunstiõpetuse teoreetilised arengusuunad ja aktuaalsed probleemid.\nLaste kujutava tegevuse arenguetapid.\nH. Gardneri multiintelligentsuse teooria. Õpilaste individuaalsed iseärasused ja võimekus.\nLoovus ja selle arendamise võimalused koolis.\nB. Edwards;Drawing on the Right Side of the Brain.\nÕppeprotsessi eesmärgistamine ja kavandamine.\nÕpikeskkonna kujundamine. Motivatsioon. \nHindamine ja tagasiside.Objectives/eesmärkid:  Anda:\n- süsteemne ülevaade visuaalsete kunstide õpetamise filosoofilistest alustest, ajaloost, eesmärkidest ja funktsioonist Lääne kultuuriruumis; \n- teadmised ajaloolistest ja ühiskondlikest muudatustest  ning nende sostest kunsti- ja hariduspraktikaga:\n- üld- ja  kunstihariduse eesmärkide ning nende saavutamiseks rakendatavate õppemetoodikate vahelise seostamise oskus;\n- teadmised patronaadisüsteemi olemusest ja rakendumisest hariduse ajaloo vältel:\n- teadmised professionaalses ja üldhariduslikus kunstiõppes rakendatud metoodikatest, oskus analüüsida metoodikate efektiivsust õppijatest ning õppe-eesmärkidest lähtuvalt:\n- teoreetilised teadmised kunstiõpetuse didaktikast õpiprotsessi kavandamiseks ja läbiviimiseks õppepraktikas ning oskus tehtut süsteemselt analüüsida.Learning outcomes/õpiväljund:  Õppeaine edukal läbimisel üliõpilane:\n-\tomab süsteemset ülevaadet ja laiapõhjalisi teadmisi visuaalsete kunstide õpetamise ajaloost.\n-\tseostab kunstihariduse eesmärke ajastule iseloomulike filosoofiliste vaadetega, tunneb ära ja selgitab põhjuslikke seoseid ühiskonnakorra, olude, tehnoloogia arengu ja visuaalsete kunstide ning kunstniku staatuse vahel.\n-\tkirjeldab süsteemselt patronaadi ja haridusele ligipääsetavuse problemaatikat eri ajastute  ja ühiskondade ning kunstiõpetuse näitel.\n-\tseostab arenguid kunstiajaloos muudatustega professionaalses ja üldharivas kunstiõppes.\n-\tsaab aru kunsti ja käsitöö ning professionaalse ja üldhariva kunstiõppe protsessi ja eesmärkide erinevustest.\n-\tEesmärgistab õppeprotsessi ja ehitab selle üles õppijate arengut ja teadmiste taset arvestades. \n-\tTeab, mis on erinevate kunstiõppesüsteemide eesmärk ja väljundtasand ning oskab protsessi vastavalt tagasisidestada.\n-\tTunneb kunstiõpetuse teoreetilisi arengusuundi ja aktuaalseid probleeme.\n-\tTeab laste kujutava tegevuse arenguetappe.\n-\tOskab õppeprotsessi eesmärgistada, kavandada ja ellu viia.\n-\tOskab omandatud teoreetilisi teadmisi õpetamispraktikas kasutada arvestades seejuures õpilaste arengutaseme, vajaduste ja individuaalsete iseärsustega.\n-\tTagasisidestab õpiprotsessi ja -tulemust vastavalt püstitatud õppe-eesmärkidele.\n-\tMääratleb enda rolli õpetajana ja teab selle mitmekesisust, on võimeline oma tegevuse kavandamiseks, analüüsimiseks ja parendamiseks."}