{"KURSUSE_NIMI": "Meistripraktika", "KURSUSE_KOOD": "HVVK.01.020", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"practice": 24, "independent_work": 0, "individual_work": 0, "internship": 54}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Üliõpilane kogeb päritud oskuste meistri juures või õppinud rahvarõivategija/väiketootja juures töövõtete ja vahendite kasutamist, materjali arvestamist ja valimist, tellijaga suhtlemist jms vastavalt meistri spetsialiseerumisele. Võib valida järgnevaid meistreid (või ka väljaspool seda nimekirja, aga kindlasti konsulteerida kuraatoriga): \nPille Arold  (Laiuse rahvarõivad)\nAnneli Lumi (tülltikand, Lõuna-Eesti rahvarõivaste tegemine) ja Jane Jõgi (tülltikand)\nRiina Salm (Tarvastu Käsitöökoda, telgedel raami abil vööde kudumine)\nKihnu meistrid\nMuhu tikandi meistrid Muhus (nt Anu Kabur)\nVirve Valtmann-Valdson (metalltikand, siiditikand, fileetikand, Lihula tikand)\nHille Ahun-Vaarpuu, Margot Marks (kurruniitidega seelikukangaste kudumine jms) \nSilja Nõu (professionaalne suurel raamil tikkimine) \nKristiina Halberg, Angelika Nöps (niplispits)\nSeto meistrid, Kirävüü\nSilvi Allimann (lõiked, õmblemine, rahvarõivaste tundmine)\nTiina Unt (seelikute tegemine alates muuseumiesemete uurimisest, lõngade värvimisest) \nJuta Räägel (kaapkübarate viltimine) \nRiina Piir (Mulgi rahvarõivad) \nKristi Jõeste (kindad)\nAnu Pink (sukad)\nAstri Kaljus (kangad)\nPiia Rand (vööd)\nJana Saar (kangad) asub Tartus\nMaret Lehis (kangad, vööd, peakatted) asub TallinnasObjectives/eesmärkid:  Päritud oskustega meistri või rahvarõivavaldkonna kitsama ala spetsialisti töö jälgimine, tema eripäraste töövõtete dokumenteerimine ja omandamine.Learning outcomes/õpiväljund:  Praktika edukal läbimisel: - oskab vaadeldud meistri spetsiifikast lähtuvalt valida materjale ja töövahendeid;   - teab konkreetse meistri töös ettetulnud probleeme;  - on (iseseisvalt ja meistri juhendamisel) omandanud konkreetse meistri töövõtted. Fookus on rahvarõivaseelikute õmblemisel. Loe Moodles meistripraktika juhendist eesmärkide, õpiväljundite ja sisu kohta."}