{"KURSUSE_NIMI": "Näitusepraktika", "KURSUSE_KOOD": "HVVK.01.016", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 3, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 75}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Rahvuslik tekstiil: Üldesitluspraktika koosneb vaatluspraktikast (iseseisev 2-3 rahvakunsti- ja käsitöönäituse külastamine ja analüüsimine) ning reaalsete eriala tutvustavate näituste/väljapanekute korraldamisest (algul grupitööna, hiljem iseseisvalt või kahe inimese koostöös). Võimalikud praktikabaasid selguvad jooksvalt vastavalt vajadustele ja ettepanekutele, mis praktikabaasidest laekuvad. \nMuuseumi näitusepraktika koosneb konkreetsete näituste koostamisest ning ülesseadmisest vastavalt partnermuuseumide ettepanekutele.\n\nRahvuslik metall: Muuseumi näitusepraktika koosneb konkreetsete näituste koostamisest ning ülesseadmisest vastavalt partnermuuseumide ettepanekutele.Objectives/eesmärkid:  Näitusepraktika muuseumitöö moodulis koosneb kahest osast: 1) üldesitluspraktikast, kus õpitakse koostama eriala tööde väljapanekuid ja 2) muuseumi näitusepraktikast, mis tähendab valitud eksponaatide vormistamist muuseumis toimuvaks näituseks, sh näituse ettevalmistamist ja komponeerimist olenevalt näituse ruumist. Erinevate esemete kooseksponeerimise võimaluste ja tingimuste arvestamine. Rahvusliku metallitöö eriala üliõpilased võivad läbida praktika vaid muuseumi näitusepraktikana.Learning outcomes/õpiväljund:  Praktika edukal läbimisel üliõpilane: - oskab koostada näituse ideelist kontseptsiooni, ülesehitust ning reklaammaterjale; - on võimeline välja valima ning ette valmistama sihtrühmast lähtuvad näituse eksponaadid ning need näitusekohas kompositsioonireegleid ja esteetilisi vormeleid arvestades üles seadma; - on õppinud tundma muuseuminäituste korraldamise spetsiifikat.  - oskab esemeid muuseuminäituseks ette valmistada ja neid turvaliselt asetada."}