{"KURSUSE_NIMI": "Lõputöö", "KURSUSE_KOOD": "HVVK.03.069", "EAP": 15, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Seminaritöö"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 388, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lõputööle kehtestatud üldnõuded on kirjeldatud Tartu Ülikooli Viljandi kultuuriakadeemia lõputööde juhendis (vt https://viljandi.ut.ee/sites/default/files/2024-12/T%C3%9C%20VKA%20l%C3%B5put%C3%B6%C3%B6de%20juhend%202024_0.pdf).\n\nKultuurikorralduse õppekava lõputöö sisuks on sündmuse korraldamine ning sellega seotud protsesse analüüsiv tegevusuuring. Sündmuse valikul on oluline lähtuda järgmistest kriteeriumitest:\n\n- sündmuse seos kultuurikorralduse valdkonnaga: sündmus peab olema seotud kultuurikorralduse õppekavas käsitletud valdkondade, kontseptsioonide ja formaatidega;\n- sündmuse ligipääsetavus: sündmus peab olema avalik (teatud põhjendatud juhtudel on võimalik ka kutsetega sündmuste formaat, nt tänu- või tunnustamisüritused);\n- sündmuse toimumise aeg: sündmus ei tohi toimuda varem kui üks aasta enne lõputöö kaitsmist (va programmijuhiga kooskõlastatud ja põhjendatud erandite korral);\n- sündmuse korraldaja: sündmuse korraldajaks on juriidiline isik (va programmijuhiga kooskõlastatud ja põhjendatud erandite korral).\n\n\nLõputöö sündmuste valiku ja ülalnimetatud erandite lubamise kinnitab programmijuht konsulteerides eelnevalt kultuurikorralduse õppejõududega.\n\nLõputöö ülesehitus lähtub lõputööde juhendi punktist 5.5 (tegevusuuring). Töö peamised osad on:\n\n1. sündmust korraldava organisatsiooni ja/või selle tegevuskeskkonna analüüs (soovituslik maht 20% töö mahust);\n2. korraldusprotsessi ülevaade (soovituslik maht 50% töö mahust);\n3. eneseanalüüs (soovituslik maht 30% töö mahust).\n\nLõputöö koostamise juures on oluline selle piisav komplekssus ehk tudengi poolt lõputööks valitud sündmuse ja endale võetud ülesannete seotus erinevate kultuurikorralduse töövaldkondade ja erialaste aspektidega.\n\nTäpsemad soovitused erinevate lähteküsimuste ja temaatiliste aspektide käsitlemiseks on toodud lisamaterjalis, mis on leitav aine Moodle lehel (vt Soovituslik lisamaterjal lõputöö koostajale ja retsensendile).Objectives/eesmärkid:  Rakendada õppekava läbimisel omandatud teadmisi ja oskusi erialase uurimisprobleemi lahendamisel.Learning outcomes/õpiväljund:  Lõputöö edukalt kaitsnud üliõpilane: 1)\tmääratleb erialase uurimisprobleemi, seab eesmärgi ja sõnastab uurimisküsimused;  2)\tkasutab teema käsitlemiseks asjakohaseid allikaid;  3)\tkasutab eesmärgi saavutamiseks sobivaid uurimismeetodeid ja kirjeldab protsessi;  4)\tesitab uurimistöö tulemused, tõlgendab ja analüüsib neid erialases kontekstis;  5)\tvormistab lõputöö kirjaliku osa nõuetekohaselt, viitab allikatele, väljendab end arusaadavalt ja järgib õigekirja norme;  6)\tesitleb oma töö tulemusi kaitsmisel arusaadavalt ja arutleb tööga seonduvatel teemadel;  7)\tjärgib kogu protsessi vältel eetikapõhimõtteid. Hinded avalikustatakse kaitsmispäeva õhtuks."}