{"KURSUSE_NIMI": "Vormiõpetus ja plastilise anatoomia alused", "KURSUSE_KOOD": "HVVK.04.136", "EAP": 1.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 15, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate vormiõpetuse suundadest ja juhib tähelepanu selle aine õppimise vajalikkusele butafoori tööks. Õpetab modelleerimist klassikaliste skulptuuride kipsdetailide järgi nii 1:1-le kui suurendades. Lisaks kasutatakse lihtsamaid tehnoloogilisi nippe. Tutvutakse elava modelli järgi voolimisega. Silmaringi laiendamiseks vaadatakse VKA-sse tellitud ajakirja \"SCULPTURE\".\nSkulptuurse vormitunde arendamine inimfiguuri voolimise teel. Kipsivalamise või mingisse muusse püsimaterjali viimise õpetamine.Objectives/eesmärkid:  Tutvustada butafoori kutsetööks vajalikke skulptuuriga seotud teadmisi ja oskusi. Õpetada tehnoloogilisi võtteid, vormi jälgimist ja käelist mõtlemist. Õpetamine toimub lihtsamalt keerulisemale. Õpetada modelleerimisel kasutama plastilise anatoomia algteadmisi. Harjutada skulptuurse vormiõpetuse põhikriteeriumite järgimist.Learning outcomes/õpiväljund:  Õppeaine läbides üliõpilane:\n- oskab kasutada esmaseid skulptuuri praktilisi võtteid: modelleerimine savis või mõnes teises pehmes materjalis;\n- oskab teostada lihtsamat kipsivalu, karkasside (aluste) kasutamine ja valmistamine;\n- on võimeline iseseisvalt kopeerima algelisemaid loodusvorme, modelleerima kipsmudeli järgi;\n- suudab mingil määral kasutada elavat modelli;\n- omab üldistatud ettekujutust skulptuurist kui kunstiliigist.\nOskab iseseisvalt inimkeha modelleerida, nii ümarplastiliselt kui ka reljeefina. On võimeline tähelepanu pöörama peamistele vormitunnustele: proportsioonid, mahud, suunad, ruum, jne. Valdab kursuse lõpuks modellerimist, kui tehnilist oskust."}