{"KURSUSE_NIMI": "Lõputöö", "KURSUSE_KOOD": "HVVK.01.227", "EAP": 15, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 360, "individual_work": 20, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Pärandtehnoloogia erialade lõputöö on enamasti loovuurimus. Põhjendatud juhtumitel võib kasutada ka teisi uurimuse tüüpe.   \n \nLoovuurimus koosneb kahest osast: \n1) praktiline osa, mis võib seisneda: \n-omaloomingulise tooteseeria või suuremahulise autoriteose kavandamises ja teostamises;  \n-ajalooliste esemete või seadmete koopia või rekonstruktsiooni valmistamises;  \n-erialaga seotud tehnoloogiate, materjalide, töövahendite ja -võtete või seadmete praktikapõhises uurimises; \n-õppematerjalide (nt trükiste käsikirjad, e-õppematerjal, veebilehekülg, video vms) loomises;  \n-ajaloolise hoone või selle osa restaureerimisprojekti koostamises ja/või selle teostuses;  \n-pärandehituse traditsioonidel baseeruva omaloomingulise hoone või selle projekti loomises ja/või teostamises;  \n-muu erialase projekti ettevalmistamises ja läbiviimises.  \n \n2) kirjalik osa, mis on töö tausta avav ja uuriv ning praktilist osa selgitav, dokumenteeriv, analüüsiv ja põhjendav kirjutis, mille põhieesmärgiks on talletada lõputöö praktilise osaga seonduvat teavet ja kogemusi tunnetatavas ja süstematiseeritud vormis. Kirjalikus osas pühendatakse vähemalt üks peatükk praktilise töö loomeprotsessi kirjeldamisele ja analüüsile (sh õnnestumistele, takistustele, probleemidele, teostamisele pühendatud aja ja vajadusel ka hinna kalkulatsioonile). Peale tekstilise osa sisaldab lõputöö asjakohaseid visualiseerivaid materjale, nagu visandid, kavandid, joonised, plaanid, skeemid, fotod, tööproovid (kõik eelnimetatud peavad olema töösse digitaalselt lisatud), videod, multimeedia, vms.  \n \nSõltuvalt konkreetse lõputöö iseloomust ja eesmärgist võib kirjaliku ja praktilise, kavandamise ja vahetu füüsilise teostuse, tekstilise ja visualiseeriva osa kaal varieeruda. Kirjaliku osa maht võib olla 15–30 standardlehekülge (27 000–54 000 tähemärki koos tühikutega). Olulisemad fotod ja joonised tuleb paigutada teksti vahele, sel juhul jälgida tähemärkide arvu. Objectives/eesmärkid:  Rakendada pärandtehnoloogia õppekava läbimisel omandatud teadmisi ja oskusi erialase uurimisprobleemi lahendamisel.Learning outcomes/õpiväljund:  Lõputöö edukalt kaitsnud üliõpilane 1) määratleb erialase uurimisprobleemi, seab eesmärgi ja sõnastab uurimisküsimused; 2) kasutab teema käsitlemiseks asjakohaseid allikaid; 3) kasutab eesmärgi saavutamiseks sobivaid uurimismeetodeid ja kirjeldab protsessi; 4) esitab uurimistöö tulemused, tõlgendab ja analüüsib neid erialases kontekstis; 5) vormistab lõputöö kirjaliku osa nõuetekohaselt, viitab allikatele, väljendab end arusaadavalt ja järgib õigekirja norme; 6) esitleb oma töö tulemusi kaitsmisel arusaadavalt ja arutleb tööga seonduvatel teemadel; 7) järgib kogu protsessi vältel eetikapõhimõtteid. Pärandtehnoloogia õppekava lõputöö kirjaliku osa soovituslik ülesehitus on leitav Moodle kursuselt."}