{"KURSUSE_NIMI": "Lõputöö", "KURSUSE_KOOD": "HVVK.04.153", "EAP": 15, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 370, "individual_work": 20, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Etenduskunstide erialade lõputöö on enamasti  empiiriline uurimus. Põhjendatud juhtumitel võib kasutada ka teisi uurimuse tüüpe. \n\nEtenduskunstide õppekava üliõpilaste lõputöö koosneb loome- või teostusprojektist, seda analüüsivast ja oma tööd reflekteerivast kirjalikust tekstist ning digitaalsest portfooliost.\n1) Lõputöö praktiline osa seisneb valitud erialale vastava iseseisva loomingulise rolli täitmises lavastus- või tehnilises teostusmeeskonnas. \n- Näitleja erialal vähemalt ühes diplomilavastuses osalemine.\n- Lavastaja (sh koreograafi spetsialiseerumine) erialal ühe taasesitatava kunstilise terviku loomine (lavastus/film). \n- Tantsuõpetaja erialal haridusliku suunitlusega protsessi läbiviimine.\n- Tehnilise produtsendi ja visuaaltehnoloogi (valguskujunduse, videokujunduse ja dekoraator-butafoori spetsialiseerumine) erialal lavastus- või tehnilises teostusmeeskonnas osalemine.\n\n2) Lõputöö kirjalikus osas, põhimahus vähemalt 15 lk, kirjeldatakse ja analüüsitakse praktilist tööprotsessi ning põhjendatakse valikuid erialases, valdkondlikus ja/või laiemas teoreetilises kontekstis. \n\nKirjalikule tööle lisatakse vastavalt erialale tehniline ja kunstiline informatsioon (vastavalt erialale asjakohased visuaalsed materjalid nagu nt kavandite koopiad, töö valmimise protsessi fotojäädvustused, tehniline raider ja muu selline).\n\n3) Koos lõputööga esitatakse digitaalne portfoolio.Objectives/eesmärkid:  Rakendada etenduskunstide õppekava läbimisel omandatud teadmisi ja oskusi erialase uurimisprobleemi lahendamisel.Learning outcomes/õpiväljund:  Lõputöö edukalt kaitsnud üliõpilane 1) määratleb erialase uurimisprobleemi, seab eesmärgi ja sõnastab uurimisküsimused; 2) kasutab teema käsitlemiseks asjakohaseid allikaid; 3) kasutab eesmärgi saavutamiseks sobivaid uurimismeetodeid ja kirjeldab protsessi; 4) esitab uurimistöö tulemused, tõlgendab ja analüüsib neid erialases kontekstis; 5) vormistab lõputöö kirjaliku osa nõuetekohaselt, viitab allikatele, väljendab end arusaadavalt ja järgib õigekirja norme; 6) esitleb oma töö tulemusi kaitsmisel arusaadavalt ja arutleb tööga seonduvatel teemadel; 7) järgib kogu protsessi vältel eetikapõhimõtteid."}