{"KURSUSE_NIMI": "Magistritöö", "KURSUSE_KOOD": "HVVK.01.150", "EAP": 24, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Magistriseminar III"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "independent_work": 608, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Nõuetele vastava magistritöö kirjutamine, vormistamine ja kaitsmine. Nõutav on eelkaitsmise läbimine, mis toimub kokkulepitud ajal ja millele esitatakse vähemalt 80% ulatuses valminud magistritöö; see annab võimaluse tööd soovitatud suunas täiendada ja täpsustada. \n\nMagistritöö (40–80 standardlehekülge (72 000–144 000 tähemärki koos tühikutega)) on selgitav, dokumenteeriv, analüüsiv ja põhjendav kirjutis, mille põhieesmärgiks on talletada temaatilist teavet ja praktilisi kogemusi tunnetatavas ja süstematiseeritud vormis. Magistritöö peab sisaldama ka lisasid ehk asjakohaseid visualiseerivaid või kuuldavaid materjale (visandid, kavandid, joonised, plaanid, skeemid, füüsilised materjali- või esemenäidised, fotod, videod, multimeedia vms). Siinkohal ei ole mahupiiranguid.\n\nArtiklipõhine magistritöö koosneb õpingute jooksul kirjutatud ja avaldamiseks vastu \nvõetud eelretsenseeritud teadusartiklist ja saatetekstist, mis kirjeldab ja analüüsib \nuurimisprotsessi. Uurimuse töömaht peab vastama magistritöö mahule.Objectives/eesmärkid:  Rakendada õppekava läbimisel omandatud teadmisi ja oskusi erialase uurimisprobleemi lahendamisel.Learning outcomes/õpiväljund:  Magistritöö edukalt kaitsnud üliõpilane: 1) määratleb erialase uurimisprobleemi, seab eesmärgi ja sõnastab uurimisküsimused; 2) kasutab teema käsitlemiseks asjakohaseid allikaid; 3) kasutab eesmärgi saavutamiseks sobivaid uurimismeetodeid ja kirjeldab protsessi; 4) esitab uurimistöö tulemused, tõlgendab ja analüüsib neid erialases kontekstis; 5) vormistab lõputöö kirjaliku osa nõuetekohaselt, viitab allikatele, väljendab end arusaadavalt ja järgib õigekirja norme; 6) esitleb oma töö tulemusi kaitsmisel arusaadavalt ja arutleb tööga seonduvatel teemadel; 7) järgib kogu protsessi vältel eetikapõhimõtteid."}