{"KURSUSE_NIMI": "Teatriõpetuse didaktika", "KURSUSE_KOOD": "HVVK.00.028", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse raames tutvutakse teatri- ja draamaõpetuse valikaine ainekavadega riiklikus õppekavas ning seostatakse teatriõpetust väärtuskasvatuse ja üldpädevuste arendamisega. Õpitakse kokku leppima põhireegleid turvalise ja mängurõõmsa grupikliima loomiseks (draamalepe). Eesmärgistatakse ja mõtestatakse teatriõpetuse õppeprotsesse ja õppeperioode. Õpitakse koostama erinevaid tunnikavasid, lähtuvalt teatritunni teemast ja eesmärgist. Õpitakse läbi viima teatritunni refleksiooni ja tagasisidestama protsessi.Objectives/eesmärkid:  Kursus tutvustab teatriõpetuse didakat, alates õppeprotsessi eesmärgistamisest ja turvalise ruumi loomisest kuni refleksiooni ja tagasisidestamiseni. Õpitakse loogiliselt üles ehitama teatritunde erinevatel teemadel ja erinevatele sihtrühmadele. Vastavalt teatrutunni eesmärgile rakendatakse ja kombineeritakse erinevaid teatriõpetuse ja rakendusteatri meetodeid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. Mõistab teatriõpetuse kui loovpraktilise õppeaine didaktilisi eripärasid.\n\n2. Mõistab õpilase üldpädevuste arendamise olulisust teatriõpetuses, seab harmoonilise isiksuse arendamise kunstilistest eesmärkidest ettepoole.\n\n3. Oskab luua turvalist ruumi ning jälgida ja suunata usaldusliku grupidünaamika kujunemist.\n\n4. Oskab seada hariduslikke eesmärke teatriõpetuses, eesmärgistades teatritundi, õppeperioodi, õppeaastat.\n\n5. Tunneb erinevaid teatriõpetuse ja rakendusteatri meetodeid ja tehnikaid ning oskab harjutusvara vastavalt tunni eesmärgile kombineerida.\n\n6. Oskab juhtida ja suunata teatritunni refleksiooni ning tagasisidestada õppeprotsessi teatriõpetuses."}