{"KURSUSE_NIMI": "Pärandtehnoloogia uurimismeetodid", "KURSUSE_KOOD": "HVVK.01.166", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 5, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 55, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Vaadeldakse pärandtehnoloogiate uurimiseks vajalike allikate kogumise, loomise ja tõlgendamise meetodeid ning vastavaid praktikaid. \n1. Käsitööteaduse terminoloogia ja terminiloome. \n2. Pärandtehnoloogiate uurimise suunad ja suhestumine materiaalse kultuuri uurimise temaatikaga. Olulisemad autorid. Eseme- või tehnoloogiauurimus: museaalide jm pärandtehnoloogiliste artefaktide loomiseks kasutatud tehnikates, materjalides, tööriistades, kasutuse eripärades, esemete elulugudes, töökodade ruumilises ja sotsiaalses korralduses orienteerumine. \n3. Töö kirjalike allikatega: olemus, võimalused, ohud ja piirangud, allikakriitika. Käik Riigiarhiivi jm.\n4. Töö visuaalsete allikatega, nende loomise või tõlgendamisega: fotod, joonised, esemed. Käik ERMi ja vajadusel TÜ arheoloogia kabinetti. \n5. Pärandtehnoloogiliste välitööde spetsiifika: eesmärkide määratlemine, küsitlus- või vaatluskava ettevalmistamine; tööprotsessi või tehnoloogia visuaalse talletamise plaani loomine.Objectives/eesmärkid:  Õppeaine eesmärk on anda ülevaade põhilistest käsitööteaduses ja pärandtehnoloogiate uurimises kasutatavatest metodoloogilistest suundadest.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane  1) orienteerub pärandtehnoloogia uurimise põhilistes metodoloogilistes suundumustes ning tunneb vastavat terminoloogiat; 2) tunneb valdkonna uurimiseks vajalikke metoodikaid ning vastavaid uurimispraktikaid; 3) tunneb peamiste arhiivide võimalusi, andmebaase ja allikate otsimise protseduure;  4) suudab magistritööks tarvilikke uurimistöid piiratud eelinfo põhjal provisoorselt planeerida."}