{"KURSUSE_NIMI": "Lõpueksam (pärimusmuusika)", "KURSUSE_KOOD": "HVVK.02.112", "EAP": 15, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 1, "seminar": 1, "independent_work": 383, "individual_work": 5, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lõpueksam on loominguline projekt (kontsert, etendus vms) ning kirjalik töö, mis seostub lõputöö loomingulise osaga.Objectives/eesmärkid:  Luua võimalus esitleda õppetöö vältel omandatud teadmisi ja praktilisi oskusi ning arendada iseseisva- ja meeskonnatöö oskust.Learning outcomes/õpiväljund:  Lõpueksami sooritanud üliõpilane: * oskab end tööks ja loominguks iseseisvalt motiveerida; * mõistab ja teostab oma kontsertkava ettevalmistuse perioodil muusikalise juhi rolli * oskab koostada kontserdiks vajaliku audio-visuaalse tehnilise varustuse tellimuse * tunneb pärimusmuusika põhimõisteid, uurimismeetodeid ja oskab praktikas rakendada; * suudab ise või koostöös teostada oma kava sisule sobiva reklaami  * valdab esitatavat kontsertkava, * valitseb esinemissituatsiooni,  Praktiline osa:\n\nÜliõpilane valmistab ette tervikliku kava kestusega 30 - 35 minutit, kava esitamine toimub peamiselt põhipillil (õpingute jooksul õpitud põhipilli(de)ga). Kaasata võib ka sugulaspille. \nKava peab näitama üliõpilase oskusi pärimusmuusika valdamisel, isiklikku mängustiili, kõrget tehnilist taset ning arenenud muusikalist maitset. Kava peab koosnema 60% ulatuses eesti pärimusmuusika lugudest ning ülejäänud 40% võib sisaldada autoriloomingut, omaloomingut, välismaa repertuaari jt. \n50% kavast (ajalise määratlusega umbes 15 minutit) esitab üliõpilane soolona (v.a. löökpillid). \nSoolopala on:\n - üksinda mängitud või lauldud lugu\n - lauljad võivad kaasata järellauljaid\nSoolopala ei ole:\n - klaverisaatega lugu\n - backtrackiga (salvestatud saatega), looperiga lugu\n - laulu saatmine akordioni, lõõtsa, kitarri, viiuli või teiste pillidega\n\nEelnevalt II kursuse eksamil hinnatud palad ei tohi olla IV kursuse eksami kontserdil.\nKirjalikus osas peavad olema palade noodistused, arraneeringud. Soololugudes teemanoodid, koos mängitud lugudes vormi noot (teema, teised hääled, harmoonia ja seade vorm). Noodistused peavad olema vormistatud noodigraafika programmis (Sibelius, Musescore jt.) \n2025. aastal toimub pärimusmuusika lõpetajate  kontserdid 20. mail Pärimusmuusika Aida suures ja väikeses saalis."}