{"KURSUSE_NIMI": "Oskuste didaktika", "KURSUSE_KOOD": "HVVK.01.096", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 18, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Lühiülevaade didaktika ajaloost ja õpikäsitustest. Käsitööoskuste õpetamise ajaloost Eestis.\n2. Pärandtehnoloogiline õppimisviis.\n3. Käeliste oskuste õpetamine erinevates kooliastmetes, tutvumine riiklike õppekavadega. Õpetuse planeerimine ja\nläbiviimine.\n4. Õppetunni külastus ja analüüs.\n5. Motivatsioon käsitöö tegemisel ja õppimisel, tööprotsessi väärtustav õppijakeskne käsitööõpe. Käelise tegevuse mõju inimesele füüsilisel, vaimsel ja sotsiaalsel tasandil. Probleeme ja lahendusi oskuste õpetamisel.\n6. Õppe-metoodiliste materjalide klassifikatsioon ja valiku põhimõtted sõltuvalt seatud eesmärkidest, kasutatavatest\nõppemeetoditest ja õppijate vanusest.\n7. Käsiraamatute, õpikute ja teiste metoodiliste materjalide analüüs.\n8. Märgisüsteemid ja keelekasutus tööjuhendites, õppeteksti loomine.\n9. Metoodiliselt hea joonis, foto, film.\n10. Käeliste oskuste õppimiseks või arendamiseks hästi toimiva tööjuhendi loomine ja retsenseerimine.\n11. Valitud teemal koolituse või töötoa sisuline ja eelarveline planeerimine ning selle läbiviimiseks kõigi vajalike\nmetoodiliste vahendite valmistamine.Objectives/eesmärkid:  Didaktiliste teadmiste ja praktiliste võtete omandamine oskuste õpetamiseks erinevates õpisituatsioonides.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - Omab ülevaadet õpetamisteooriatest ja käsitöötehnikate õpetamise ajaloost; - Tunneb oskusainete üldeesmärke ja õppesisu üldhariduskoolide ja kutsekoolide riiklikes õppekavades; - Analüüsib käsitööoskuste õppimise motiive ja nende muutumist erinevates vanuserühmades ja õpisituatsioonides; - Tunneb erinevaid õppemeetodeid käeliste oskuste õpetamisel ja õppimisel; - Koostab koolituse või töötoa sisulise kava, eelarve ja tegevusplaani. - Koostab õppematerjale valitud sihtrühmale."}