{"KURSUSE_NIMI": "Audioprogrammid", "KURSUSE_KOOD": "HVVK.00.107", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Annab teadmised helitöötluseks kasutatavate programmide ajaloost ning arengust. Tutvustab ja õpetab kasutama audioprogramme ProTools, Logic ProX ja Izotope RX. Annab ülevaate ja tutvustab digitaalseid pistikprogramme (pluginad). Annab teadmised ja oskused MIDI-klaviatuuri, välise helikaardi ühendamiseks ja seadisatamiseks. Annab ülevaate erinevatest failiformaatidest ja nende rakendamisest.Objectives/eesmärkid:  Õppeaine eesmärgiks on:  * Anda ülevaade ja teadmised erinevate heliprogrammide (DAW) ajaloo, iseärasuste ja võimaluste kohta * Anda ülevaade ja oskused kasutada arvutiga ühilduvat helikaarti (interface), kõrvaklappe, MIDI-klaviatuuri * Anda ülevaade ja õpetada kasutama MIDI formaadi võimalusi * Anda ülevaade digitaalses heli töötlemises kasutatavate failiformaatide kohta * Õpetada kasutama audioprogrammi ProTools ja Logic ProX * Õpetada kasutama audioprogrammides kasutavaid pistikprogramme (pluginaid) * Õpetada kasutama audioprogrammi Izotope RX AdvancedLearning outcomes/õpiväljund:  Aine läbinud üliõpilane: * Omab teadmisi ja arusaamist erinevate heliprogrammide ajaloost, tööpõhimõtetest ja erisustest ning võimalustest * Oskab komplekteerida ja seadistada väiksema audiotööks mõeldud keskkonna * Tunneb ja oskab kasutada MIDI süsteeme ning ühildada tarkvaralisi ning raudvaralisi seadmeid * Tunneb audiosignaali töötlemisel kasutatavaid failiformaate ja oskab teostada vajalikud protsessid * Oskab kasutada audioprogramme ProTools ja Logix ProX * Tunneb pistikprogrammide tüüpe ja oskab neid audioprotsessides kasutada * Oskab kasutada audioprogrammi Izotope RX Advanced"}