{"KURSUSE_NIMI": "Loodushariduse praktika", "KURSUSE_KOOD": "HVVK.03.008", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tegevusõppe spetsialiseerumispraktika jaguneb neljaks osaks 1. Loodusharidus-, 2. Seikluskasvatus- 3. mängude ja 4. elamuspedagoogika praktika\nKõik praktika osad koosnevad: a) ettevalmistusest, b) praktilisest tegevusest c) eneseanalüüsist d) õpikogemuse kirjapanekust ja e) arutelust e. suulisest esitlemisest. \nPraktikaprotsess on\n1.\tVaatluspraktikal tuleb tutvuda, määrata ja kirjeldada vaatlustulemuste põhjal loodusharidusliku sündmuse/programmi toimumist.\n2.\t Osaluspraktikal tuleb praktiseerida õuesõppe tegevusi loodusprogrammi käigus sihtgrupiga (sh osaleda korraldus meeskonna liikmena ja vastutada konkreetse töölõigu läbiviimise eest).\n3.\t Korralduspraktikal tuleb iseseisvalt läbi viia loodusprogramm sihtgrupiga ja viia läbi õpikogemuse refleksioon osalejatega.\nVormistada õpipäevik, milles tuleb analüüsida osalejate, meeskonna ja oma tegevust loodushariduse praktika raames ning hinnata oma arengut tegevuste juhendajana.\nArutelu käigus tuleb esitleda oma õpipäevikut ja kaitsta oma seisukohti.Objectives/eesmärkid:  Õppija on osalenud praktilises tegevuses loodusharidusega tegelevas organisatsioonis, \nomandanud tegevuste ja osalejate juhendamise, meeskonna töös osalemise ja refleksiooni läbiviimise oskused loodusprogrammi läbiviimisel ning rakendanud ellu teoorias õpitud oskusi.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane\n- valmistab iseseisval ette ja viib läbi loodushariduse programmi;\n- osaleb loodushariduslike välitegevuste juures ning suudab neid analüüsida ja hinnata;\n- demonstreerib oskust planeerida loodushariduslikke tegevusi reaalset keskkonda ja sihtgruppi arvestades;\n- on võimeline suunama erinevate noorte sihtrühmade õuesõppe protsessi;\n- oskab märgata sündmuste käigus toimuvat ja reageerida vastavalt õpitud teooriatest lähtuvalt;\n- oskab analüüsida sündmust, osalejate tegutsemist, meeskonda ja iseennast erinevates situatsioonides;\n- oskab tegutseda meeskonnas ja noortegruppi juhtida."}