{"KURSUSE_NIMI": "Lavakujundus", "KURSUSE_KOOD": "HVVK.04.053", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 20, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine tutvustab lavakujunduse loomise põhimõtteid ja sellealase kommunikatsiooni mõisteaparatuuri lavakujundusealaste loominguliste kompleksülesannete vormis. Koos esmaste teadmiste omandmisega kavandamises ja tööjooniste tegemises, omandatakse lavastuse teksti kunstniku seisukohast lugemise oskus. Lavakujunduse kavandamise käigus omandatakse ajaloolises ja stiililises paljususes orienteerumise esmased põhimõtted. Eriline rõhk on maketi valmistamise tehnoloogilistel kvaliteetidel.Objectives/eesmärkid:  Õppeaine eesmärkideks on anda ettekujutus lavaruumi kujundamise võimalustest ning selle esitamise viisidest (makett, kavandid, tööjoonised jms) ning lavakujunduse funktsioonidest lavastustervikus, arendada kujundliku mõtlemise oskust, tutvustada lavakujunduse loomise põhimõtteid; võimaldada maketi mastaapides töötamise aluste omandamine ja esmased lavakujunduse kavandamise kogemused; luua tingimused kavandamise klassikaliste põhimõtetega tutvumiseks ja tööks maketiga; tutvustada kavandamiseks vajaliku informatsiooni kogumise ja inspiratsiooni hankimise metoodikat; luua tingimused joonestamisoskuste rakendamiseks lavakujunduse tööjooniste tegemisel.Learning outcomes/õpiväljund:  Õppeaine läbinu:\n- tunneb lavakujunduse, selle loomise ning realiseerimisega seotud mõistestikku ja kasutab seda erialases kommunikatsioonis;\n- oskab analüüsida etendamiseks valitud ruumi;\n- analüüsib lavastuse teksti lavakujunduse loomise seisukohast esmasel tasemel;\n- oskab kujundada lavaruumi vastavalt valitud tekstile eesmärgiga leida tekstile originaale visuaalne ruumiline vaste;\n- tunneb materjali ja inspiratsiooni kogumise põhimõtteid ja oskab valida sobivaid allikaid;\n- tunneb lavaruumi väljendusliku ja kujundliku organiseerimise esmaseid põhimõtteid;\n- väljendab oma lavakujunduse ideid maketis õiges mastaabis nii kabariitide kui materjalide valiku mõttes;\n- tunneb kostüümide kavandamise põhimõttid silueti ja koloriidi seisukohast;\n- unneb lavakunduse valmistamiseks vajaliku informatsiooni tööjoonistes edastamise aluseid ja valmistab lihtsamaid tööjooniseid;\n- tunneb lavakujunduse, selle loomise ning realiseerimisega seotud mõistestikku ja kasutab seda erialases kommunikatsioonis. Õppejõud Inga Vares"}