{"KURSUSE_NIMI": "Laste füsioteraapia II", "KURSUSE_KOOD": "KKSB.05.038", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Terapeutiline harjutus", "Füsioterapeutiline hindamine", "Laste füsioteraapia I"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 14, "seminar": 46, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus võimaldab tutvuda tõenduspõhiste hindamis- ja teraapiameetoditega lapseeas sagedamini esinevate haigusseisundite puhul.Objectives/eesmärkid:  Aine õpetamise eesmärgiks on anda süvendatud teoreetilised teadmised ja praktilised oskused lastel esinevate sensomotoorse defitsiidi, arengu- ja funktsionaalsete häirete füsioterapeutiliseks käsitlemiseks.Learning outcomes/õpiväljund:  Üliõpilane: 1. tuvastab lapse diagnoosist tulenevad funktsionaalsed piirangud, sõnastab füsioterapeutilised probleemid ja eesmärgid, analüüsib saadud hindamistulemusi ning planeerib teaduspõhise teraapia; 2. dokumenteerib füsioteraapia protsessi; 3. otsib ning analüüsib iseseisvalt erialast teaduskirjandust, eristades olulist infot ebaolulisest; 4. teab ja kirjeldab peamisi tõenduspõhiseid füsioterapeutilisi sekkumis- ja hindamismeetodeid pediaatrias; 5. analüüsib erinevate abivahendite vajalikkust ja tunneb abivahendite kohandamise põhimõtteid vastavalt lapse vanusele ja diagnoosile. 6. omab head meeskonnatöö oskust Soodustamaks õpiväljundite saavutamist ei ole ChatGPT või muu tehisintellektil põhineva tarkvara kasutamine selles aines lubatud.\n\nAines tehtud muudatused:\n- hetkel muudatusi õppetöö toimumises ei ole, kõik toimub nii nagu tunniplaanis märgitud \n- palun õppetööle tulla tervena\n\nNB! Palun veenduda, et kontrollid oma ut.ee postkasti regulaarselt. Muutustega seonduvat infot edastatakse e-kirja teel ning võib juhtuda, et mõnikord olude sunnil väikese etteteatamisega."}