{"KURSUSE_NIMI": "Sissejuhatus füsioteraapiasse", "KURSUSE_KOOD": "KKSB.05.117", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 8, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antakse ülevaade füsioteraapia olemusest, selle eri valdkondadest, töötamisvõimalustest ning rehabilitatsiooni- ja taastusravisüsteemist Eestis. Kursus annab esmase info Rahvusvahelise funktsioneerimisvõime, vaeguste ja tervise klassifikatsiooni (RFK) kasutamise ja eriala puudutavate kutseorganisatsioonide töö kohta Eestis ja mujal maailmas. Kursuse raames külastatakse erinevaid füsioteraapiat pakkuvaid asutusi, et saada sügavam arusaam füsioterapeudi igapäevatööst. Kursus annab ka ülevaate kehtivatest eriala puudutavatest nõuetest (seadustest), andmekaitse- ja eetikaprintsiipidest.Objectives/eesmärkid:  Anda ülevaade füsioteraapia olemusest, selle eri valdkondadest, töötamisvõimalustest ning rehabilitatsiooni- ja taastusravisüsteemist Eestis. Tutvuda Rahvusvahelise funktsioneerimisvõime, vaeguste ja tervise klassifikatsiooniga.Learning outcomes/õpiväljund:  Üliõpilane: - kirjeldab füsioteraapia ja rehabilitatsioonisüsteemi olemust Eestis. - teab ja saab aru füsioteraapia valdkonnas kehtivatest eetikanõuetest ja olulisematest andmekaitsega seotud põhimõistetest ning mõistab isikuandmete kaitse põhimõtteid tervishoiuteenuste raames. - analüüsib meeskonnatöö vajalikkust rehabilitatsioonisüsteemis. - kirjeldab erinevate meeskonnaliikmete rolli rehabilitatsioonimeeskonnas. - teab tervishoiuvaldkonnas kasutuses olevat Rahvusvahelise funktsioneerimisvõime, vaeguste ja tervise klassifikatsiooni (RFK) ülesehitust ja olemust. - oskab otsida andmebaasidest erialast teaduskirjandust, teha artiklitest kokkuvõte ning esitada olulisem info kuulajatele. Praktikumid toimuvad neljas rühmas. Praktikumi rühma registreerib õppejõud."}