{"KURSUSE_NIMI": "Füsioterapeutiline hindamine", "KURSUSE_KOOD": "KKSB.05.028", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Anatoomia"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 22, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 123, "individual_work": 0, "internship": 5}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel omandatakse füsioterapeutilise hindamise võtted, mida rakendatakse valdavalt ortopeedilise valdkonna patsientide funktsionaalsete probleemide tuvastamisel. Ainekursusel tutvustatakse üldiselt ka lastehaiguste, sisehaiguste ja neuroloogiliste haiguste valdkonnas rakendatavaid füsioterapeutilise hindamise põhimõtteid ja teste. Ainekursus sisaldab arvukaid praktikume ning iseseisvat, ühe patsiendi funktsionaalsete häirete hindamise praktikat. Õpioskuste arendamist toetab patsiendi hindamisprotsessi planeerimine, hindamismeetodite vaheliste seoste loomine, hindamistulemuste analüüs ja oma tegevuse dokumenteerimine.Objectives/eesmärkid:  Aine eesmärk on omandada teoreetilised teadmised ja praktilised oskused patsiendi/kliendi funktsionaalse probleemi tuvastamisel. Ainekursuse käigus omandatakse füsioterapeutilise hindamise põhimõtted, õpitakse funktsionaalseid teste, mida rakendatakse patsientide/klientide füsioterapeutilisel hindamisel.Learning outcomes/õpiväljund:  üliõpilane:\n*teab füsioterapeutilise hindamise põhimõtteid ning patsiendiga seotud erialase dokumentatsiooni ehk füsioteraapia aruande koostamise printsiipe\n*mõistab füsioterapeutilise hindamise tähtsust patsiendi funktsionaalsete probleemide tuvastamisel\n*otsustab, milliseid füsioterapeutilise hindamise teste patsiendi/kliendi hindamisel kasutada\n*demonstreerib patsiendi/kliendi füsioterapeutilisel hindamisel kasutatavaid teste\n*rakendab ainekursusel omandatud praktilised oskused patsiendi süsteemsel füsioterapeutilisel hindamisel\n*struktureerib füsioterapeutilise hindamise tulemused füsioteraapia aruande vastavatesse alapunktidesse\n*planeerib edaspidi kõikide patsientide teraapias kvaliteetsed füsioterapeutilised hindamised"}