{"KURSUSE_NIMI": "Tervislik liikumisharrastus", "KURSUSE_KOOD": "KKSB.01.036", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 2, "individual_work": 76, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse eesmärgiks on anda tudengile võimalus, olla kehaliselt aktiivne sellisel tasemel (minimaalselt 2,5 tundi nädalas), mis tagab positiivse efekti tervisele. Spordiala valik on vaba. Kursus on veebipõhine. Kursuse käigus peab tudeng koguma andmeid oma treeningute kohta (50 tunni ulatuses) ning salvestama need enda poolt valitud on-line treeningute keskkonda. Treeningute andmeid võib keskkonda sisestada käsitsi või kasutades erinevaid nutiseadmeid. Lisaks tuleb treeningutest teha kokkuvõtted ning esitada need kursusel vastutavale õppejõule. Samuti tuleb kursuse raames läbitöötada Moodle keskkonnas etteantud materjalid ja sooritada kirjalik test, mis käsitleb kehalise aktiivsuse ja koormuse mõju inimese organismile.Objectives/eesmärkid:  Õppeaine eesmärgiks on läbi praktilise liigutustegevuse teadvustada kehaliste harjutuste mõju organismile ning õppida analüüsima treenininguid ning jälgima iseenda seisundit, kasutades selleks loodud tarkvaraLearning outcomes/õpiväljund:  1) On olnud kehaliselt aktiivne minimaalsel tasemel, mis annab tervist toetava efekti;  2) Oskab kasutada tarkvara oma liikumise jälgimiseks ja analüüsimiseks; 3) Teab võimalusi toimetulekuks takistustega, mis segavad olemaks kehaliselt aktiivne. As this course is totally web-based and relys on independent training/moving, then the impact of the coronavirus is small. However, there still exist a chance that the sportclubs may be closed if the situation gets worse, however trainings outside are still possible. Then you might just modify your aims for the course. If there will be a strict rule when even trainings outside are forbidden then we let you know as soon as possible how the course will be handled further"}