{"KURSUSE_NIMI": "Tõenduspõhise füsioteraapia ja uurimistöö alused", "KURSUSE_KOOD": "KKSB.05.123", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 4, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aines  \"Uurimistöö füsioteraapia erialal\" arendatakse üliõpilase tõenduspõhiseid erialaseid teadmisi ning teaduslikku mõtlemist ja akadeemilist kirjutamist. Lisaks arendatakse aines iseseisva teaduslik-metoodiliseks uurimistöö planeerimisoskust ning akadeemilist suulist eneseväljendust. Aine toimub 2-osalisenaObjectives/eesmärkid:  Eesmärgiks on arendada üliõpilase tõenduspõhiseid erialaseid teadmisi ning teaduslikku mõtlemist ning akadeemilist kirjutamist. Lisaks arendatakse aines iseseisva teaduslik-metoodilise uurimistöö planeerimisoskust ning akadeemilist suulist ning kirjalikku eneseväljendust.Learning outcomes/õpiväljund:  Üliõpilane:\n- formuleerib uurimisküsimuse ning analüüsib, milline metoodika võimaldaks püstitatud uurimisküsimusele leida tõenduspõhise vastuse.\n- otsib andmebaasidest teemakohaseid teadusartikleid ning  analüüsib konstruktiivselt teadusartikleid, sh nende \n metodoloogilist asjakohasust ning eetilisi printsiipe;\n- koostab kirjaliku uurimistöö kavandi teoreetilisele kuni 2 aastat kestvale uuringule. \n- kirjaliku uurimistöö kavandi koostamisel tugineb üliõpilane akadeemilise kirjutamise tavadele, viidates oma töös korrektselt erinevatele teaduslikele allikatele. \n- diskuteerib suuliselt formuleeritud uurimisküsimuse ning koostatud uuringukavandi osas. Õppetööga alustame 15. veebruaril.\nPraktikumides  on sülearvuti, millega saab praktikumi ülesandeid sooritada kohustuslik (lae alla ka viidete haldur ZOTERO).\n\nNB! Aine õpiülesannete koostamisel ei ole lubatud kasutada tehisaru (nt chatgpt). Tehisaru kasutamine aines käsitletust parema arusaamise huvides on lubatud."}