{"KURSUSE_NIMI": "Sisehaiguste füsioteraapia", "KURSUSE_KOOD": "KKSB.05.062", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Anatoomia", "Füsioloogia", "Terapeutiline harjutus", "Füsioterapeutiline hindamine", "Sisehaigused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 26, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 80}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine käigus omandatakse teoreetilised teadmised ja praktilised oskused ülikoolis ning reaalses töömaailmas sisehaigusi põdevate patsientide füsioteraapia teostamisel. Käsitletakse tõenduspõhiseid füsioteraapia meetodeid haiguste pre- kui postoperatiivses etapis, aga ka ägedas ja kroonilises etapis. Toimub kliiniline praktika, mille käigus kogetakse ja analüüsitakse töömaailmas toimuvat. Üliõpilane teostab enesereflektsiooni töömaailmas kogetu põhjal.Objectives/eesmärkid:  Aine õpetamise eesmärgiks on anda teoreetilisi teadmisi ja praktilisi oskusi sisehaigusi põdevate patsientide tõenduspõhisest füsioteraapiast sooritades praktika reaalses töömaailmas. Praktika ajal teostab üliõpilane enesereflektsiooni kogetu ja tehtu põhjal analüüsides oma tegevust praktikabaasis.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Üliõpilane:\n- selgitab välja patsiendi füsioteraapia olulisuse/vajaduse sisehaigusi põdevatel patsientidel;\n-anamneesi ja füsioterapeutilise hindamise tulemuste analüüsile tuginedes seab üliõpilane realistlikud füsioteraapia eesmärgid ning koostab patsiendile sobiva tõenduspõhise teraapia plaani ning viib selle ellu, arvestades praktikabaasi nõuetega.\n- üliõpilane jälgib ja hindab patsiendi seisundit teraapia tunni kestel ning kogu teraapia protsessi vältel, tehes vajadusel muudatusi teraapia plaani (vastavalt patsiendi seisundile);\n-üliõpilane viib iseseisvalt läbi patsiendi teraapia lähtuvalt tõenduspõhisusest teostades seda reaalses töömaailmas;\n- on omandanud oskuse tööaega planeerida;\n- on omandanud erialase praktilise töökogemuse ning oskab töötada meeskonnas; \n- püstitab praktikaks individuaalsed eesmärgid ning analüüsib eesmärkide saavutamist ja õpitut/kogetud praktikal;\n- teostab enesereflektsiooni mõtestades ülikoolis omandatud teoreetiliste teadmiste rakendamist praktikal ning uute praktiliste oskuste omandamist;\n- mõtestab karjääri võimalusi antud valdkonnas. Õppetööga alustame esmaspäeval 10. veebruaril, kell 8:30\nNB! Õppejõul on õigus vajadusel muuta rühmadesse registreerimist.\n\nAine on mõeldud läbi viia kontaktõppes. Kontaktõppele tulles veendu, et oled täiesti terve! Kaasa võtta mask! Aine ajakavas ja korralduses (sh õppetöö vormis) võib tulla muudatusi vastavalt Terviseameti ja Tartu Ülikooli soovitustele ja olukorrale riigis"}