{"KURSUSE_NIMI": "Füsioteraapia neuroloogias", "KURSUSE_KOOD": "KKSB.05.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füsioloogia", "Anatoomia", "Neuroloogia alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 22, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 28, "individual_work": 0, "internship": 90}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate perifeerse- ja kesknärvisüsteemi haiguste puhul kasutatavatest füsioterapeutilistest hindamismeetoditest, asendravist, terapeutiliset sekkumisest, abivahendite kasutamisest ja nõustamisest. Kursus annab teoreetilised teadmised ja praktilised oskused neuroloogiliste diagnoosidega patsientide füsioteraapia läbiviimiseks. Kursuse käigus käsitletakse tõenduspõhiseid lähenemisi erinevate diagnooside käsitlemiseks. Aine lõpus toimub kliiniline praktika, mille käigus kasutab üliõpilane oma teadmisi ja oskusi reaalses töökeskkonnas.Objectives/eesmärkid:  Aine õpetamise eesmärgiks on anda teoreetiline ülevaade füsioterapeutilise hindamise ja  sekkumise võimalustest erinevate neuroloogiliste haiguste korral ning pakkuda üliõpilasele võimalust rakendada praktilisi oskusi neuroloogiliste patsientide füsioteraapias reaalses töökeskkonnas.Learning outcomes/õpiväljund:  Üliõpilane, läbides ainekursuse: - Teab enamlevinud neuroloogiliste haiguste põhjuseid ja kasutatavaid füsioteraapia meetodeid - Teab neuroloogilise füsioteraapia terminoloogiat - Oskab võtta neuroloogilise patsiendi anamneesi  - Oskab kirjeldada neuroloogilise füsioteraapia hindamismeetodeid ja neid praktikas kasutada - Teab asendravi, mobiliseerimise, fasiliteerimise ja siirdumise põhiprintsiipe, mida saab kasutada neuroloogiliste häiretega patsientidel - Oskab analüüsida enda erialaste ja praktiliste teadmiste ja oskuste arengut neuroloogilise füsioteraapia valdkonnas Juhul, kui praktikmirühmadesse registreerub ebavõrdne arv õppureid, võib vastutav õppejõud muuta rühma registreeringut, et rühmade suurused oleksid võrdsemad ja õppetingimused võrdsemad."}