{"KURSUSE_NIMI": "Füsioteraapia praktika", "KURSUSE_KOOD": "KKSB.05.034", "EAP": 18, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Skeleti-lihassüsteemi füsioteraapia", "Füsioteraapia neuroloogias", "Laste füsioteraapia I", "Sisehaiguste füsioteraapia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 468}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Füsioteraapia praktika käigus teostab üliõpilane füsioteraapia protseduure skeletilihassüsteemi ja neuroloogia valdkonna patsientidele, valikuliselt ka lastehaiguste või sisehaiguste valdkondade patsientidele. Üliõpilane teab füsioteraapia teenuste eripära nii statsionaarses kui ka ambulatoorses etapis.Objectives/eesmärkid:  Aine õpetamise eesmärgiks on füsioteraapiaga seotud praktiliste kogemuste andmine ja erialaste teadmiste süvendamine.Learning outcomes/õpiväljund:  Üliõpilane: - mõistab ja järgib praktikabaasi tööeetikat ja-korraldust; - oskab teha meeskonnatööd ning analüüsib oma rolli selles; - tunneb erinevates valdkondades esinevate peamiste haiguste eripärasid ning oskab rakendada iseseisvalt oma teoreetilisi teadmisi praktilises tegevuses; - koostab iseseisvalt ja nõuetekohaselt füsioteraapia aruande, kasutades korrektset erialast terminoloogiat; - hindab ja analüüsib oma erialaste teadmiste ja oskuste arengut praktikal. Ainekursuse praktika on seotud mh ka karjääriplaneerimise osadega nagu eneseanalüüs (nt oskab erialast kogemust analüüsida ja mõtestada), võimaluste tundmine (nt omab ettekujutust oma erialaga seotud elukutsete erialasest identiteedist) ja planeerimine (nt oskus oma tööaega planeerida). Praktikabaasidesse registreerumine aine Moodle kursusel \nENG: Registration for internships on the Moodle course\n\nAinekursuse praktika korralduse eest vastutavad Piret Pärsim ja Kadri Medijainen. Praktika dokumentatsiooni ja -eksami eest vastutab Monika Mets \nENG: The organization of internships (clinical pracitice) for this course is managed by Piret Pärsim and Kadri Medijainen. Monika Mets is responsible for clinical practice related documentation and the exam."}