{"KURSUSE_NIMI": "Füsioteraapia magistriõppe praktika", "KURSUSE_KOOD": "KKSB.05.096", "EAP": 18, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Laste füsioteraapia II", "Geriaatriline füsioteraapia", "Täiskasvanute füsioteraapia", "Spordifüsioteraapia"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 440, "individual_work": 22, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tartu Ülikooli (TÜ) füsioteraapia eriala magistriõppe praktika aitab süvendada teoreetilisi teadmisi ja mitmekesistada professionaalsed oskusi ning pädevusi (vastavalt füsioterapeudi kutsestandardi VII kutsekvalifikatsioonitaseme nõuetele ja Euroopa füsioteraapia-alase kõrghariduse võrgustiku pädevusloendile) läbi praktilise, mitmekülgselt analüüsitava kogemuse. Magistriõppe praktika aitab arendada füsioteraapia-alaste probleemide teaduslikku ning kliinilist analüüsioskust.Objectives/eesmärkid:  Aine eesmärgiks on läbi praktilise tegevuse kinnistada ja süvendada õppekava õppeainetes omandatud teadmisi ja oskusi, aidates seeläbi praktikandil saavutada õppeasutuse poolt seatud õpiväljundeid. Praktika ajal teostab üliõpilane enesereflektsiooni, sh analüüsides füsioteraapia-alaseid kui ka üldpädevusi, arendab kliinilise arutluse oskust läbi juhtumianalüüside ning füsioterapeutilise dokumentatsiooni koostamise.Learning outcomes/õpiväljund:  Üliõpilane: - oskab planeerida tööaega; - omab erialast praktilise töökogemust; - oskab töötada meeskonnas; - oskab planeerida kogu füsioteraapia protsessi ning analüüsib sellega seonduvat konstruktruktiivselt; - viib iseseisvalt läbi erinevate patsiendite teraapia, lähtuvalt tõenduspõhisusest; - koostab iseseisvalt nõuetekohase füsioterapeutilise dokumentatsiooni ning analüüsib selle tugevusi ning puudujääke; - hindab ja analüüsib oma erialaste ning üldpädevuste taset;  - püstitab pädevuste tasemest lähtuvalt individuaalsed eesmärgid praktikaks;  - hindab erialaste ja üldpädevuste arengut praktika käigus."}