{"KURSUSE_NIMI": "Tööfüsioteraapia magistrikursus", "KURSUSE_KOOD": "KKSB.05.114", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 8, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaines \"Tööfüsioteraapia magistrikursus\" antakse teadmised ja praktilised oskused inimese töökeskkonna ja tööasendite  ja -liigutuste ergonoomilisuse hindamisest.\nSamuti tutvustatakse aines erinevaid tööga seonduvaid ohutegureid ja nende hindamiseks sobilikke hindamisinstrumente. Käsitletakse tööl mõjuvate füsioloogiliste ohutegurite mõju füsioteraapia protsessile, sh analüüsitakse erinevate ergonoomiliste kohanduste võimalusi ja tööfüsioterapeutilisi lahendusi erinevatel ametitel töötavatel inimestel.\nSaadakse ülevaade erinevate kehapiirkondade tüüpilisematest tööga seotud skeletilihassüsteemi kaebustest. Planeeritakse erinevate tööga seonduvate kaebuste füsoterapeutilist käsitlust. Saadakse baasoskused hindamisest ja käsiltlustehnikatest käeteraapias.\nTutvustatakse töötervishoiu ja tööalase rehabilitatsiooni korraldust Eestis ning nõustamistehnkaid muutuste esile kutsumiseks.Objectives/eesmärkid:  Õppeaine \"Tööfüsioteraapia magistrikursus\" eesmärgiks on anda teadmised ja praktilised oskused inimese töökeskkonna ja tööasendite  ja -liigutuste ergonoomilisuse hindamisest ning teadmised tüüpiliste tööga seotud tervisekaebuste tõenduspõhistest ennetusmeetmetest ning füsioterapeutilisest käsitlusest.Learning outcomes/õpiväljund:  Aine läbimisel üliõpilane: 1. analüüsib vaatluse ja standardiseeritud hindamisvahendite kasutamise abil tööspetsiifiliselt erinevate ohutegurite esinemist töökeskkonnas ning töötaja tööasendeid-töövõtteid ja tööasendeid. 2. teab töövõime hindamise põhimõtteid Eestis. 3. analüüsib töötajal tuvastatud riskide vähendamiseks sobilikke meetmeid 4. planeerib füsioterapeutilise probleemide leevendamiseks ja/või ennetamiseks sobilikud sekkumismetoodikaid. 5. tunneb töötervishoiu ja töö-alase rehabilitatsiooni korraldust Eestis. 6. teostab baastasemel käeteraapia hindamised ning tunneb peamisi käsitlusvõtteid. 7. Dokumenteerib füsioterapeutilised probleemid RFK koodide ja määrajatega. 8. Analüüsib nõustamisvõtete rakendamist tööga seotud tervisekaebusega patsiendi kontekstis."}