{"KURSUSE_NIMI": "Skeleti-lihassüsteemi füsioteraapia", "KURSUSE_KOOD": "KKSB.05.030", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Anatoomia", "Füsioloogia", "Terapeutiline harjutus", "Füsioterapeutiline hindamine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 4, "seminar": 32, "independent_work": 38, "individual_work": 0, "internship": 80}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursuse käigus omandab üliõpilane skeleti-lihassüsteemi füsioteraapia teoreetilised teadmised ning oskused rakendada vastavaid teadmisi patsiendi füsioterapeutilises ravis. Ainekursus sisaldab skeleti-lihassüsteemi vaevuste teemakäsitlustega seotud auditoorset õppetööd ning kliinilist praktikat. Ainekursus toetab erinevate õpioskuste arendamist: luuakse ja analüüsitakse seoseid füsioterapeutilise hindamise, terapeutiliste harjutuste valiku ja skeleti-lihassüsteemi füsioteraapia vahel, planeeritakse, viiakse läbi ning dokumenteeritakse patsiendi teraapiaprotsess.Objectives/eesmärkid:  Skeleti-lihassüsteemi füsioteraapia ainekursuse eesmärk on käsitleda erinevate traumade, ortopeediliste häirete ja ülekoormussündroomide füsioteraapia põhimõtteid. Ainekursuse käigus omandab üliõpilane skeleti-lihassüsteemi füsioteraapia teoreetilised teadmised ning oskused rakendada vastavaid teadmisi ainekursuse kliinilisel praktikal.Learning outcomes/õpiväljund:  üliõpilane: * teab füsioterapeutilisi käsitlusi erinevate traumade, ortopeediliste häirete ja ülekoormussündroomide korral; * mõistab patsiendi skeleti-lihassüsteemi funktsioonihäirega seotud füsioterapeutilise hindamise ning teraapia vahelisi seoseid;  * rakendab ainekursusel omandatud teoreetilisi teadmisi praktikas; * hindab praktikal patsiendi teraapia kvaliteeti ning enda arengut teraapiaprotsessi käigus, et edaspidise erialase karjääri jooksul sünteesida kõikide patsientide teraapias kvaliteetseid lahendusi. *Ainekursuse praktika on seotud karjääriplaneerimise osadega nagu eneseanalüüs (oskab erialast kogemust analüüsida ja mõtestada), võimaluste tundmine (omab ettekujutust õpitava eriala identiteedist) ja planeerimine (oskab planeerida oma tööd ja aega)."}