{"KURSUSE_NIMI": "Neuroloogilise füsioteraapia magistrikursus", "KURSUSE_KOOD": "KKSB.05.103", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 6, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab ülevaate neuroloogilise patsiendi vaimse tervise probleemidest, sõltuvushäirete tulemusena tekkinud neuroloogilistest kahjustusest, toitumise eripäradest, logopeedilistest käsitlusest ja täiendavatest ravimeetoditest neuroloogilises füsioteraapias. Kursus annab süvendatud praktilised oskused ja teadmised krooniliste neuroloogiliste haiguste sekkumismeetoditest ning käsitleb nende mõju patsiendi lähedastele.Objectives/eesmärkid:  Aine eesmärgiks on süvendada üliõpilaste teadmisi neuroloogilise füsioteraapia valdkonnas toetudes tõenduspõhisusele ning anda laiapõhjalised teadmised füsioteraapiat toetavatest meetoditest ning neuroloogilise patsiendi ravimeeskonda kuuluvate spetsialistide tööst.Learning outcomes/õpiväljund:  Üliõpilane 1. Oskab ära tunda enamlevinud vaimse tervise probleeme, mis kaasnevad neuroloogiliste haiguste korral nii patsiendil kui ka tema lähedastel ning oskab vajadusel sekkuda. 2. Saab aru meeskonnatöö olulisusest ja erinevate spetsialistide käsitlusmeetoditest neuroloogilises füsioteraapias. 3. Kasutab tõenduspõhiseid ja kaasaegseid sekkumisstrateegiaid neuroloogilises füsioteraapias. 4. Teab ja analüüsib neuroloogilises füsioteraapias kasutatavaid täiendavaid ravimeetodeid. 5. Hindab kriitiliselt neuroloogilise patsiendi teraapiaplaani. 6. Planeerib ja dokumenteerib progresseeruva või kroonilise neuroloogilise haiguse korral patsiendi teraapiat toetudes tõenduspõhisele füsioteraapiale. 7. Kirjeldab  ja rakendab insuldi ja Parkinsoni tõvega patsiendi füsioteraapias kasutatavaid hindamis- ja sekkumisvõtteid (sh fasiliteerimisvõtteid siirdumiste abistamisel) 8. Kirjeldab erinevusi füsioterapeutilises sekkumises pusher-tüüpi ning tavainsuldi korral."}