{"KURSUSE_NIMI": "Liikumisõpetuse õpetaja põhipraktika", "KURSUSE_KOOD": "KKSP.02.047", "EAP": 7, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Spordipedagoogika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 2, "internship": 92}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Omandatakse praktilisi töö kogemusi likumisõpetuse tunni andmisel. Tutvutakse ja osaletakse kooli spordialases töös.Objectives/eesmärkid:  Õppeainel on kolm üldeesmärki, mille saavutamine on kavandatud koos õpetaja kutseõpingute teiste ainetega: 1)\ttoetada üliõpilase kujunemist liikumisõpetuse õpetajaks, luues võimalused eelnevalt läbitud teoreetiliste õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses; 2)\tluua võimalused õppe- ja kasvatusprotsessi kui terviku tundmaõppimiseks ning õppetöö korraldamise oskuste omandamiseks liikumisõpetuses; 3)\tvõimaldada ainedidaktiliste printsiipide praktiseerimist.Learning outcomes/õpiväljund:  1)\toskab planeerida, läbi viia, analüüsida ja hinnata liikumisõpetuse õppe- ja kasvatustöö alaseid tegevusi; 2)\toskab õpet kavandades ja läbi viies ning õpilasi/lapsi toetades arvestada nende eripära, eelteadmiste, vajaduste (sh hariduslike erivajaduste) ning huvidega; 3)\toskab rakendada motivatsiooniteooriate põhiseisukohti õppeprotsessi organiseerimise ja õppedistsipliini kindlustamisel; 4)\tkavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja õppeaine eripärast ning õppijate vajadustest ja huvidest; 5)\tintegreerib tulemuslikult erinevates valdkonna- ja ainedidaktika ainetes omandatud teadmisi, oskusi ja hoiakuid praktilises õpetamissituatsioonis. Tartu Ülikooli õpetajakoolituse praktikate koostööpartnerite juurde suundumisel peab üliõpilane koostööpartneri nõudmisel tõendama, et on COVID-19 vaktsineerimiskuuri läbinud või haiguse läbi põdenud."}