{"KURSUSE_NIMI": "Treeningu monitooring", "KURSUSE_KOOD": "KKSP.04.098", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füsioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 36, "seminar": 36, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selgitatakse treeningu monitooringu olemust ja põhiprintsiipe. Õpetatakse treeningu monitooringu biokeemilisi, füsioloogilisi, biomehaanilisi ja psühholoogilisi meetodeid. Kirjeldatakse erinevate spordialagruppide treeningprotsessi monitooringu variante ja skeeme.Objectives/eesmärkid:  Õppeaine annab ülevaate võimalustest hinnata sportliku treeningu käigus toimuvaid muutusi sportlase organismis. Selgitatakse monitooringu põhimõtteid ja praktilise rakendamise võimalusi igapäevases treeningus. Tutvustatakse enamlevinud biokeemilisi ja füsioloogilisi meetodeid ja kehaliste võimete määramise meetodeid, mis aitavad muuta treeningkoormuste doseerimise täpsemaks. Avardada üliõpilaste teadmisi ja praktilisi oskusi erinevate kehaliste võimete hindamisel ning treeningu monitooringul.Learning outcomes/õpiväljund:  Õppeaine täies mahus läbinud üliõpilane on: 1. Omandanud süsteemsed baasteadmised treeningu monitooringu olemusest, põhiprintsiipidest ja eesmärkidest 2. Omab teadmisi sportlase treenituse ja ülepingutuse ning ületreeningu seisundi kohta.  3. Omandanud teadmised, mis võimaldavad mõista ja kasutada treeningu monitooringu biokeemilisi, füsioloogilisi, biomehhaanilisi ning psühholoogilisi meetodeid.  4. Teadmised ja praktilised oskused võimaldavad kasutada treeningu monitooringu meetodeid jälgimaks treeningprotsessi kulgu kiirus-jõualade, vastupidavusalade, sportmängude ja kahevõitlusalade sportlastel. 5. Teoreetilised teadmised ja praktilised oskused kasutamaks oma kutsetöös sportlase enesekontrolli ja suhtlusmeetodeid  6. Omandanud ettevalmistuse kasutada erinevaid treeningu monitooringu meetodeid ka kehvade materiaalsete võimaluste korral."}