{"KURSUSE_NIMI": "Kvantmehaanika", "KURSUSE_KOOD": "LOFY.04.073", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füüsikaline maailmapilt", "Matemaatilise füüsika võrrandid", "Elekter ja magnetism", "Matemaatiline füüsika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 54, "practice": 4, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kvantmehaanika kursuses esitatakse mikromaailma protsesside süvakäsitluse teoreetilised alused. Üliõpilane omandab kvantmehaanika matemaatilise aparatuuri ja ülesannete lahendamise oskuse mitterelativistlikul juhul. Relativistliku juhu detailsem käsitlus järgneb teoreetilise füüsika valikkursuses.Objectives/eesmärkid:  Mõista kvantmaailma seaduspärasuste põhimõttelisi erinevusi klassikalises füüsikas tuntutest, harjuda nende paradoksaalsusega. Omandada kvantmehaanika mõistelise ja matemaatilise aparatuuri alused tasemel, mis annab kvantmehaanikale tuginevate õppeainete ja teaduse- või tehnoloogiavaldkondadega tegelemiseks vajaliku kirjaoskuse.Learning outcomes/õpiväljund:  Kursuse positiivsele hindele läbinud üliõpilane: 1) mõistab dualismi 'laine-osake' ning kvantmehaanika põhipostulaate; 2)  teab ja oskab selgitada loengute kavas toodud märksõnade-terminite ulatuses kvantmehaanika ja selle matemaatilise aparaadi mõisteid, võrrandeid ja seoseid (sh määramatusseoseid), efekte ja paradokse; 3) oskab lahendada Schrödingeri võrrandit loengus käsitletud ja kavas toodud lihtsamail mudeljuhtudel ning valdab häiritusarvutuse ideid ning metoodikat; 4) valdab ja oskab rakendada kvantmehaanika matemaatilist aparaati aine programmi, töölehtede ja neis toodud ülesannetega määratud tasemel, sh oskab läbi teha kvantmehaanika  valemite tuletusi, k.a.  neid tuletuste etappe, mis on töölehtedes formuleeritud koduülesandeina; 5) omab ettekujutust kvantmehaanika kontseptuaalsetest ja filosoofilistest probleemidest ja oskab neil teemadel arutleda ning kummutada \"terve mõistuse\" sünnitatud väärarusaamu. Kontrolltööde ja eksami tegemisel pole lubatud kasutada abimaterjale (õpikuid, konspekte jne) ega digitaalseid abivahendeid (arvutit, telefoniäppe jms). Vajadusel antakse kontrolltöö/eksami küsimuste juurde leht vajalike valemitega."}