{"KURSUSE_NIMI": "Keskkonnadosimeetria ja kiirguskaitse", "KURSUSE_KOOD": "LOFY.05.028", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb kiirgusohutuse terminoloogiat ja mõõtühikuid; ioniseeriva kiirguse vastastikmõju ainega, sh bioloogilise koega; kiirguse bioloogilisi efekte, looduslikke ja tehislikke kiirgusallikaid, radionukliidide levikut keskkonnas; kiirgusdoosi kujunemist, sh radooni, keskkonnas ja ruumides; doosi ja doosikiiruse arvutusmeetodeid; ioniseeriva kiirguse dosimeetriat; kiirguskaitse füüsikalisi aluseid; kaasaegse kiirguskaitse põhimõtteid, meetodeid ja organisatsiooni.Objectives/eesmärkid:  Kursuse eesmärgiks on kompetentsi loomine keskkonnadosimeetria ja kiirgusohutuse alal.  Baaskursusena katab see teadus- ja tehnikateemasid, mis on vajalikud looduslike ja tehislike radioaktiivsete ainete esinemise ja leviku mõistmiseks ning kiirgusdoosi kujunemise hindamiseks.  Lisaks füüsika- ja tehnikaküsimustele antakse ülevaade kaasaegse kiirgusohutuse põhimõtetest, meetoditest ja ülesehitusest. Käsitletakse ioniseeriva kiirgusega seotud hüvede ja riskide kommunikeerimist.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: -\toskab kasutada keskkonna radioaktiivsuse ja dosimeetria põhimõisteid, suurusi ja ühikuid; -\tmõistab ioniseeriva kiirguse ja aine vastastikmõju protsesse, sh bioloogilisi mõjusid ja doosi kujunemist; -\ttunneb erinevaid looduslikke ja tehislikke kiirgusallikaid ning nende rakendusvaldkondi; -\ttunneb kiirguskaitse põhistandardeid ja piirmäärasid, oskab rakendada kiirgusohutuse põhimõtteid; -\toskab tasakaalustatult kommunikeerida ioniseeriva kiirgusega seonduvaid riske. The Moodle platform will be used to share the course material."}