{"KURSUSE_NIMI": "Spektroskoopia magistrikursus", "KURSUSE_KOOD": "LOFY.01.029", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika I", "Kvantmehaanika", "Spektroskoopia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antakse sissejuhatav ülevaade aatomite, molekulide ja kristallide spektraalkarakteristikast. Antakse algteadmised rühmateooriast koos rakendusnäidetega, mis on seotud valdavalt 3d ja 4f lisandi-ioonide spektroskoopiliste omadustega kristallides. Vaadeldakse põhilisi aatomi ja kiirguse vahelisi interaktsioone. Pööratakse tähelepanu siirdemetallide ja harilike muldmetallide spetsiifilistele optilistele omadustele seoses nende rakendamisega laserites. Kirjeldatakse levinumaid kristallivälja mudeleid koos rakendusnäidetega.\nKursusel osalemiseks oleksid soovitavad põhiteadmised kvantmehhaanikast ja tahke keha füüsikast. Loengud toimuvad inglise keeles, peale loengut on võimalik saada täiendavat konsultatsiooni (vajadusel vene keeles).Objectives/eesmärkid:  Kursuse eemärgiks on anda põhiteadmised lisandiga aktiveeritud kristallide spektroskoopiast. Kursus pakub huvi üliõpilastele, kes on spetsialiseerunud laserspektroskoopiale, materjaliteadusele, kvantkeemiale või tahkisefüüsikale. Kohustuslik eeldusaineteks on: 1. Kõrgem matemaatika 2. Kvantmehaanika 3. Mõni bakalaureuse spektroskoopia aineLearning outcomes/õpiväljund:  Peale kursuse läbimist peaks üliõpilane valdama järgmiseid teadmisi. 1. Kristalli lisanditsentrite energeetiliste seisundite, neeldumis- ja luminestsentsispektrite päritolu;  2. 3d- ja 4f-ioonidega aktiveeritud kristallide optilised omadused ja nende rakendamine tahkislaserites; 3. Algteadmised rühmateooriast ja selle lihtsamad rakendused aatomite ja kristalli lisanditsentrite spektroskoopiliste omaduste analüüsimisel (valikureeglid, energiatasemete lõhenemine sümmeetria alandamisel jms)."}