{"KURSUSE_NIMI": "Nanoelektroonilised materjalid", "KURSUSE_KOOD": "LOFY.02.045", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursuse alguses antakse ülevaade elektroonikaseadmete komponentide valmistamismeetoditest, komponenttahkiskihtide ja nende erinevate substraatide klassifikatsioonist ning teekaartidest seadmete arendusel. Kirjeldatakse nanomeetrilistes dimensioonides tahkiskihtide, nanokristallide ja nanotorude saamismeetodeid. Samuti kirjeldatakse seadmete erinevate koostismaterjalide valikukriteeriume, materjalide sünteesimeetodeid ja lähteainekeemiat. Käsitletakse ka pinna ning reaktsioonide rolle elektroonse seadise aluseks olevate nanostruktuuride moodustumisel ning protsessiga seotud füüsikalist ja keemilist kvaliteeti. Kursuse jooksul tutvustatakse seadmete prototüüpide elektrilise evaluatsiooni põhimõtteid ning elektroonse defektsuse kriteeriume rõhuga selliste elektriliste karakteristikute nagu pindjuhtivus, juhtivus, mahtuvus, laengulõksude tihedus, jt. sõltuvustel seadme eripäradest. Käsitletakse fundamentaaluuringute ja rakendusuuringute ning teadustöö ja arendustöö vahelist sidestatust.Objectives/eesmärkid:  Eesmärgiks on selgitada magistriõppe ja doktoriõppe tasemel nanoelektroonsete seadmete aluseks olevate tahkiskihtide valmistamise tehnoloogiaid ning mõõtmismeetodeid. Kirjeldatakse nanodimensionaalseid seadmeid peamiselt transistoride ja dünaamiliste- ning püsimälude baasil, samuti nende elektroonseid põhikarakteristikuid.Learning outcomes/õpiväljund:  Kursuse lõpuks osalejad 1. On tutvunud kaasaaegsete ja arendatavate nanoelektroonikaseadmete - kolmedimensionaalsete mälurakkude, transistoride, välkmälude, faasimuutmälude, nanosensorite jt. -tööpõhimõtetega. 2. On viidud kurssi elektroonikaseadiste põhiliste fabritseerimismeetodite ja konfiguratsioonidega. 3. On tutvunud nende seadmete koostismaterjalidega ja analüüsimeetoditega. 4. Tunnevad nanoseadmete edasise arengu aluseks peetavaid põhikontseptsioone: seadmed nanovarrastel, nanotorudel, nanopunktidel, grafeenil. Kirjalik referaat või suuline seminariettekanne.\n\nToimub üle aasta!"}