{"KURSUSE_NIMI": "Mikroskoopiline elektrodünaamika", "KURSUSE_KOOD": "LOFY.04.040", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Elekter ja magnetism", "Analüütiline mehaanika"], "SOOVITUSLIKUD_EELDUSAINED": ["Erirelatiivsusteooria", "Matemaatiline füüsika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursuses ehitatakse mõju printsiibist lähtudes üles laetud osakese ja elektromagnetvälja teooria 4-mõõtmelises formalismis. Tuletatekse osakeste ja elektromagnetvälja ja energia-impulsi ja impulsimomendi tensorid ning nende jäävus. Kirjeldatakse elektromagnetlaineid laenguvabas ruumis, suvaliselt liikuva laengu välja (elektromagnetlainete kiirgamist) ning laengute süsteemi välja suurtel kaugustel süsteemist (multipoolreaksarendust).Objectives/eesmärkid:  Kursuse primaarne eesmärk on kõigepealt ehitada üles elektromagnetvälja ja laetud osakeste relatvistlik teooria 4-mõõtmelises formalismis ning seejärel kasutada seda vabade elektromagnetlainete, kiirendusega liikuva laengu elektromagnetvälja (kiirgamise) ja laengute süsteemi välja multipoolarenduse uurimise jaoks, tuletades lõpuks dipoolkiirguse valemid. Kursuse sekundaarne eesmärk on kinnistada ja täiendada varasemates kursustes aluse saanud teadmisi/oskusi nende konkreetse rakendamise teel: kontra- ja kovariantsed vektorid ja tensorid, nende teisenemine, samuti antakse energia, impulsi ja impulsimomendi relativistlik käsitlus energia-impulsi tensori kaudu (täiendades erirelatiivsusteooriat), mõju printsiip ja Euleri-Lagrange'i ja Hamiltoni võrrandid (analüütilisest mehaanikast), Diraci delta-funktsioon, Fourier pööre,  Greeni funktsioonid (mat. füüs. võrrandid), Cauchy integraal (matemaatiline füüsika).Learning outcomes/õpiväljund:  Kursuse järel üliõpilane (olulisuse järjekorras): ++ oskab kasutada Maxwelli-Lorentzi võrrandeid 4-mõõtmelises formalismis väljatugevuse tensori ja duaalse väljatugevuse tensori kaudu; oskab leida, kuidas Lorentzi teisendustel teisenevad elektromagnetvälja ja laetud osakesi iseloomustavad suurused; teab, mis on elektromagnetvälja invariandid; ++ saab aru elektromagnetvälja 4-potentsiaali seosest elektri- ja magnetvälja tugevusega, kalibratsioonivabadusest, -valikust (Lorenzi ja Coulomb'i kalibratsioon) ja -invariantsuse tähendusest; saab aru, milline on elektromagentvälja vabadusastmete arv; ++ teab, milline on elektromagnetvälja ja punktosakeste süsteemi energia-impulsi tensor ning kuidas energia, impulss ja impulsimoment ning nende jäävus avalduvad energia-impulsi tensori kaudu; saab aru energia, impulsi ja impulsimomendi ning elektrilaengu jäävuse seosest teooria aluseks olevate sümmeetriatega; + oskab tuletada mõjufunktsionaalist Maxwelli-Lorentzi võrrandeid 4-mõõtmelises formalismis, lahendada homogeenset lainevõrrandit 4-potentsiaali jaoks saades elektromagnetlaine esitatuna 4-mõõtmelise polarisatsioonivektori ja 4-mõõtmelise lainevektori kaudu, leida, kuidas elektromagnetlaine paistab erinevates taustsüsteemides (Doppleri efekt, valguse aberratsioon);  + saab aru suvaliselt liikuva laengu välja tuletuskäigust (mittehomogeenne lainevõrrand, Lienardi-Wiecherti potentsiaalid); teab, mis on hilinevad ja ennetavad potentsiaalid ning oskab neid füüsikaliselt interpreteerida;  teab, millistel tingimustel hakkab liikuv laeng kiirgama elektromagnetlaineid ning oskab leida selle kiirguse karakteristikuid; tunneb elektrostaatilise välja ning statsionaarse voolu tekitatud välja multipoolareaksrendust, vastavaid multipoolmomente; oskab leida aeglaselt liikuvate laengute kiirgusvälja dipoollähenduses. Jätkab semestri esimeses pooles toimuvat erirelatiivsusteooriat, paralleelid samal ajal toimuvate optika ja matemaatilise füüsika võrrandite kursustega."}