{"KURSUSE_NIMI": "Kiirguse kvantteooria", "KURSUSE_KOOD": "LOFY.04.036", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käesoleva kursuse põhitähelepanu on suunatud kvantkiirguse omadustele ja interaktsioonile aatomitega. Kiirguse kvantiseerimise tulemusena saame elektromagnetvälja nullvõnkumised, mis vastavad nullenergiale, need on nn vaakumi fluktuatsioonid. Vaakumi fluktuatsioonidega on võimalik seletada selliseid efekte nagu Casimiri efekt. Veel enam, on alust arvata, et Universum on tekkinud kvantfluktuatsioonist. Selles lühikursuses vaatleme neid ja teisi kvantväljateooria probleeme, sealhulgas gravitatsiooni mõju vaakumi nullenergiale ning kiirguse kvantvälja seisundeid: laseritega genereeritavaid koherentseid seisundeid, muljutud ja kaetud seisundeid, tihedusmaatriksiga kirjeldatavaid segaseisundeid, põimseisundeid. Kursuses käsitletakse veel aatomi inversiooni ostsillatsioone, omaindutseeritud läbipaistvust ja ülikiirgust, samuti Hawkingi-Unruh' kiirgust (musta augu kvantkiirgust). Samuti antakse lühiülevaade Tartus arendatud resonantse sekundaarkiirguse (resonantse Ramani hajumise, kuuma ja tavalise luminestsentsi) teooriast. Kursus on vajalik fundamentaalfüüsika suuna magistrantidele ja doktorantidele.Objectives/eesmärkid:  Õpetada kaasaegse kvantteooria kasutamist kiirguseteooria, kvantoptika ja kvantelektroonika nähtuste kirjeldamiseks.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane  mõistab, mis on vaakumi nullenergia, Plancki osake/skaala, Casimiri efekt; teab kiirguse kvantvälja seisundeid: laseritega genereeritavaid koherentseid seisundeid, muljutud ja kaetud seisundeid, tihedusmaatriksiga kirjeldatavaid segaseisundeid, põimseisundeid; teab, mis on musta augu kvantkiirgus (Hawkingi-Unruh' kiirgus), Rabi sagedus, pöörleva laine lähendus, aatomi inversiooni ostsillatsioonid, omaindutseeritud läbipaistvus ja ülikiirgus; valdab nende nähtuste matemaatilise käsitluse aluseid."}