{"KURSUSE_NIMI": "Spektroskoopia alused", "KURSUSE_KOOD": "LOFY.02.019", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika II", "Optika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab avara ülevaate optilise spektroskoopia olemusest ja rakendustest. Kirjeldatakse põhilised spektroskoopilised nähtused, nende spektraalkarakteristika seos aine ehitusega ja tüüpilised mõõtetehnikad. Käsitletakse levinud spektraalaparatuuri tööprintsiipe. Teoreetilist osa toetavad mõningad demokatsed.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade optilise spektroskoopia põhialustest: - spektroskoopilise meetodi idee ja selle rakendused - peamised spektroskoopilised nähtused, nende seos aine ehitusega ja vastavad mõõtetehnikad - üldotstarbelise spektraalaparatuuri tööprintsiibidLearning outcomes/õpiväljund:  Aine läbinud üliõpilane teab (ja oskab lihtsamates olukordades rakendada): 1. Spektroskoopia seost optikaga 2. Levinud spektraalmuutujate (lainepikkus, sagedus, lainearv, energia) tähendust, vastavalt teisendada spektrijoone asukohta ja laiust 3. Läbilaskvus-, peegeldus- ja neeldumisteguri mõisteid ning vastavad spektraalkarakteristikaid, Bougueri-Lamberti-Beeri seadust 4. Soojuskiirguse ja luminestsentsi erinevusi 5. Fluorestsentsi kvantsaagise, ergastusspektri ja kustumisaja mõisteid 6. Kiirguse (footonite) ja aine (aatomite) vahelisi elementaarakte, nende kvalitatiivseid sarnasusi ja erinevusi, aatomispektrite põhiomadusi 7. Molekulide kõige lihtsamaid mudeleid ja seost fluorestsentsi, infrapunaneeldumise ja Raman-hajumisega 8. Optiliste kiirgusallikate (halogeen-, ksenoon- ja deuteeriumlamp, spektraallambid ja laserid) spektrite põhilisi iseärasusi ja sellest tulenevaid rakendusi spektroskoopias. 9. Üldotstarbeliste spektraalseadmete (monokromaator, spektrofotomeeter, spektrofluorimeeter) otstarvet ja tööpõhimõtet, spektraalseadme dispersiooni, lahutusvõime ja spektraalpilu tähendust ning seoseid nende vahel. 10. Kiirgusvastuvõtja koste ja spektraalkoste tähendusi, kõige levinumate kiirgusvastuvõtjate (fotoelektronkordisti, fotodiood, CCD) tööpõhimõtteid. Vajadusel on materjal võimalik täies mahus omandada e-õppes. Moodle'is on kättesaadavad loengute slaidid jm materjalid. Moodle'is on ka foorum, kus saab õppejõu (või kaastudengite) käest küsida selgitusi."}