{"KURSUSE_NIMI": "Bioloogilise füüsika magistrikursus", "KURSUSE_KOOD": "LOFY.05.051", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Optika", "Füüsikaline maailmapilt"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab baasteadmised biofüüsikas ja käsitleb mitmeid eksperimentaalseid meetodeid, mida kasutatakse valitud bioloogiliste protsesside uurimisel. Valgud on bioloogilise evolutsiooni käigus optimeeritud \"nanomasinad\". Nad on heaks looduslikuks mudeliks kaasaja tehnoloogilistele väljakutsetele reageerimiseks, nagu efektiivne päikeseenergia kogumine ja teiste keskkonnasõbralike energiaallikate kasutamine. Valgu struktuur ja dünaamika on seotud tema bioloogilise funktsiooniga. Kursuses käsitletakse valkude sisestruktuuri ja ülesehitust lähtudes molekulidevahelistest vastastikmõjudest; antakse ülevaade olulisematest biomolekulidega seotud funktsionaalsetest protessidest, sh prootonite pumpamisest bakteriorodopsiinis, elektronergastuste energia ja elektroni siiretest fotosünteetilistes pigment-valgu kompleksides jne; käsitletakse erinevate katseliste uurimismeetodite tööpõhimõtteid ja nende võimalusi biomolekulide struktuuri, dünaamika ja vastastikuste interaktsioonide uurimiseks. Peatähelepanu on pööratud nendele meetoditele, mida Tartu Ülikoolis kas juba rakendatakse või mis on rahvusvahelise koostöö korras meie õpetlastele kättesaadavad, sh: a) neutronite hajumismeetodid (difraktsioon, väikese nurga all hajumine, mitteelastse hajumise spektroskoopia) ja b) laserspektroskoopilised meetodid (kiire ajalise lahutusega neeldumis- ja kiirgusspektroskoopia, kõrge spektraalse lahutusega selektiivspektroskoopia, võnkespektroskoopia, ainumolekuli spektroskoopia). Õpe toimub inglise keeles.Objectives/eesmärkid:  Kursus annab algteadmisi biofüüsikast ja käsitleb mitmeid eksperimentaalseid meetodeid, mida kasutatakse bioloogiliste protsesside uurimisel.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1.     Omab ettekujutust bioloogilistest makromolekulidest ja nende ülesehituse aluseks olevatest molekulaarsetest vastastikmõjudest; 2.     Tunneb tähtsamaid protsesse, milles biomolekulid osalevad, nagu valgushaare, elektronergastuste ülekanne, elektronide ja prootonite siirded; 3.     Teab ja oskab rakendada biomolekulide struktuuri ja dünaamika uurimisel kasutatavaid hajumismeetodite tähtsamaid mudeleid; 4.     Tunneb elektronergastuste ja elektronide siirete uurimisel kasutatavate spektroskoopiliste meetodite alusprintsiipe ja oskab neid praktikas rakendada. 2024/2025 kevad ei toimu üliõpilaste puudumise tõttu."}