{"KURSUSE_NIMI": "Kvantmehaanika magistrikursus", "KURSUSE_KOOD": "LOFY.01.045", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kvantmehaanika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursuse esimene osa sisaldab arutlusi kvantmehaanika põhiprintsiipide ja -postulaatide sisu ja tähenduse üle, ülevaadet kvantteooria teket enim mõjutanud eksperimentidest (Plancki kvanthüpotees, fotoefekt, Millikani katsed, Comptoni hajumine), näiteid kvantmehaanika deduktiivse ülesehituse erinevatest ekvivalentsetest variantidest (Schrödingeri, Heisenbergi ja Diraci esituste põhivõrrandite tuletamine; koordinaadi-, impulsi- ja energiaesituste eripära).\nTeises osas omandatakse teadmisi hajumise kvantteooriast. Detailsemalt käsitletakse osalainete meetodit ja häiritusest põhjustatud kvantsiirete teooriat (Dysoni rida, Diraci-Schiffi-Fermi kuldreegel, Borni rea summeerimine ja visualiseerimine), samuti mitmesuguseid tunnel- ning resonantsnähtusi. Põgusalt tutvutakse ka pöördhajumisteooria alustega ning selgitatakse mittepeegeldavate potentsiaalide vahetut seost mittelineaarsete evolutsioonivõrrandite kuju säilitavate püsilahendite ehk solitonidega.\nKolmandas osas võetakse vaatluse alla üldine momendi operaatori omaväärtusprobleem (mis lahendati enne kvantmehaanika teket!). Uuritakse spinn-momendi ja spinn-magnetmomendi mõistete füüsikalist sisu ning osakeste spinniga seotud eksperimente ja rakendusi (Stern-Gerlachi katsetulemuste tõlgendamine, Larmori pretsessioon ja tuumamagnetresonants, ülipeen-vastasmõju ja vesiniku 21-cm joon). Analüüsitakse osakeste eristamatuse printsiibist tulenevaid järeldusi (Pauli keeluprintsiip), spinni otsest mõju kvantansamblite omadustele (Maxwell-Bolzmanni, Fermi-Diraci ja Bose-Einsteini jaotusseadused), selgitatakse elektronide tsooniteooria üldprintsiipe, Brillouini tsooni mõistet, tahkiste klassifikatsiooni elektrijuhtivuse alusel (metallid, pooljuhid, dielektrikud), Bose-Einsteini kondensatsiooni olemust jne.\nLisainfo: vt Õppematerjale.Objectives/eesmärkid:  Loengukursuse eesmärk on süvendada ja täiendada teadmisi neis kvantmehaanika standardse kursuse teemades, mis moodustavad materjaliteaduse, optika ja spektroskoopia, bio- ja kiirgusfüüsika, kvant-infotehnoloogia jt tänapäeva eksperimentaalfüüsika suundade teoreetilise lähtealuse. Soovitakse anda neis suundades spetsialiseeruvatele üliõpilastele teooria-alast tuge, praktiliste probleemide lahendamise oskusi ning ettevalmistust edaspidiseks tööks ning iseseisvaks enesetäienduseks oma erialal..Learning outcomes/õpiväljund:  Selle magistrikursuse lõpetanud üliõpilane - teab, miks üldse, mismoodi ja tänu kellele kvantmehaanika tekkis: oskab kirjeldada tähtsamaid eksperimentaalseid ja teoreetilisi saavutusi aastatel 1887-1926; - tunneb kvantmehaanika erinevaid formalisme ja esitusi, oskab selgitada põhipostulaatide füüsikalist sisu ja matemaatilist tagapõhja; - omab adekvaatset arusaamist klassikalise analüütilise mehaanika ja kvantmehaanika vahekorrast (Poissoni sulud ja kommutatsioonireeglid, trajektoorid Hamiltoni faasiruumis ja kvaasiklassikaline lähendus, momendi omaväärtusprobleem ja spinn); - oskab eristada statistilise ansambli makroskoopilisi ja mikroskoopilisi seisundeid, seostada osakeste eristamatuse printsiipi ja Pauli keeluprintsiipi, tuletada Maxwell-Boltzmanni, Fermi-Diraci ja Bose-Einsteini jaotusseadusi, selgitada Bose-Einsteini kondensatsiooni teket; - tunneb hajumisteooria põhimõisteid - hajumismaatriks, faasinihe, hajumise amplituud ja ristlõige, Levinsoni teoreem, hajumise pikkus, Borni lähendus; - oskab kirjeldada tunnel- ja resonantsefekte, arvutada potentsiaalibarjääri läbilaskvus- ja peegelduskoefitsienti, kasutada ülekandemaatriksi meetodit; - omab ettekujutust ühemõõtmelise Schrödingeri võrrandi pöördülesande (ehk hajumisteooria pöördülesande) lahendusmeetoditest ja rakendustest, teab, misasi on soliton."}