{"KURSUSE_NIMI": "Doktoriseminar keskkonnaseire tehnoloogias", "KURSUSE_KOOD": "LOFY.05.047", "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 74, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Keskkonnaseire tehnoloogia doktoriseminaris käsitletakse  valdkonna aktuaalseid uurimis- ning tehnoloogiaprobleeme. Doktorandid esitavad valdkonna arengu seisukohast olulistel teemadel ettekandeid, samuti ülevaateid oma teadustööst.\n\nTöö arvestamise põhimõtted on järgmised:\n\n1) Osa tuleb võtta ühest regulaarselt (vähemalt 2 korda kuus) toimuvast seminarist. Soovituslik on keskkonnafüüsika seminar. Ühes semestris on võimalik saada maksimaalselt 3EAP. Väiksemas mahus toimuvatelt seminaridelt saab punkte proportsionaalselt vähem. Seminaris nõutakse semestris minimaalselt 60% kohalolekut pluss ettekanne aasta jooksul;\n\n2) Minimaalselt 6 EAP-d saab doktorant ettekannetest/konverentsidest väljaspool instituuti. Sellised tegevused kantakse ÕIS-i atesteerimiskomisjoni otsuse alusel. \n\nKusjuures:\n\n1. Ise ette kantud suuline ettekanne rahvusvahelisel konverentsil, tõestatud ETISes 5.1 või 5.2 kategooria kirjatükiga (võib toimuda ka Eestis, vastavust ETISe klassifikaatoriga võib hinnata ka Atesteerimiskomisjon)- 1 EAP, kui lisandub proceeding ehk toimetis (klassifikaatori järgi 3.1 või 3.4, või 1. publikatsioon), siis lisandub 2 EAP, ehk kokku saab 3 EAP (selle proceedingu eest siis Doktoritöö \"muu teadusliku tegevuse\" alla punkte ei saa).\n2. Posterettekanne rahvusvahelisel konverentsil, kui doktorant on ise postri kõrval seisnud, tõestatud ETISes 5.1 või 5.2 kategooria kirjatükiga - 1 EAP, toimetise lisandumisel punkte juurde ei saa.\n3. Ise ette kantud suuline ettekanne doktorikooli üritusel (konverents, seminarid vms) - 1 EAP\n4. Posterettekanne doktorikooli üritusel (konverents, seminarid vms), kui doktorant on ise postri kõrval seisnud - 1 EAP\n5. Eestisisesed uurimisasutusevälised ettekanded, mis ei kuulu punkti 1. ega 2. alla - 1EAPObjectives/eesmärkid:  Käsitleda keskkonnaseire  olulisi arengusuundi, sellealase uurimistöö tulemusi ja praktikat.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud doktorant: - oskab analüüsida kriitiliselt enda ja teiste teadustöö tulemusi, - oskab kasutada  professionaalsel  tasemel erialast teaduskeelt, - suudab tutvustada oma teadustulemusi sama eriala spetsialistidele ning laiemale teadusüldsusele"}