{"KURSUSE_NIMI": "Matemaatilise füüsika võrrandid", "KURSUSE_KOOD": "LOFY.04.035", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Matemaatiline füüsika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursus sisaldab järgmisi teemasid: ODVde struktuur, klassifikatsioon ja lihtsustamine. ODVd füüsikas. Alg- ja ääretingimused ODVde jaoks. Matemaatilise füüsika ülesannete liigid. Fourier' meetod. Sturm-Liouville'i rajaülesanne. Integraalteisendused. Spetsiaalfunktsioonid. Ülekandeprotsesse kirjeldavad võrrandid. Lainevõrrandid. Statsionaarsed võrrandid.Objectives/eesmärkid:  Loengukursuse eesmärgiks on õppida tundma teist järku lineaarsete osatuletistega diferentsiaalvõrrandite (ODV) olulisemaid lahendusmeetodeid ning sellega seotud matemaatilist aparatuuri. Erilist tähelepanu pööratakse Greeni funktsiooni meetodi kasutamisele.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. Oskab ODVsid klassifitseerida ja lihtsustada; 2. On võimeline koostama lihtsamaid füüsikalisi protsesse ja nähtusi kirjeldavaid ODVsid; 3. Oskab kasutada muutujate eraldamise meetodit ODVde lahendamiseks; 4. Oskab kasutada Greeni funktsiooni meetodit ODVde lahendamiseks; 5. Oskab kasutada Fourier' ja Laplace'i teisendusi ODVde lahendamiseks. 6. Tunneb ja on võimeline kasutama olulisemaid spetsiaalfunktsioone. <P>Lisaks praktikumidele ja loengutele auditooriumis toimub õpe keskkonna Moodle  vahendusel. Võimaliku distantsõppe korral toimub õpe ka keskkonna Teams vahendusel.  Seetõttu on õppetöös osalemiseks hädavajalik ainele registreerumine ÕIS-is.\n<P>\nÕpikeskkond Moodle: <font color=green> <a href=https://moodle.ut.ee/enrol/index.php?id=5638</a> </font>\nhttps://moodle.ut.ee/enrol/index.php?id=5638"}