{"KURSUSE_NIMI": "Laserite füüsika", "KURSUSE_KOOD": "LOFY.01.033", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Optika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Matemaatiliste mudelite (näiteks neljanivooline süsteem) analüüsi teel selgitatalse laseri tööp­himõtet ja sellega seotud parameetreid (nagu võimendus,  genereerimise lävi, küllastusintensiivus). Detailselt käsitletakse Gaussi kimpu kui laserikiire baasmudelit. Käsitletakse ka ülilühikeste (piko- ja femtosekund) impulsside jada saamist  moodlukustuse abil ja suure energiaga impulsside saamist Q-lukustuse abil ning laseri kiirguse mittelineaarset muundamist (kahekordistamine, optiline parameetriline generatsioon). Antakse ülevaade mitmeterest erinevatest laseritüüpe tutvustades nende ehitust ja tööparameetreid. Õppeaine on  mõeldud peamiselt  rakendusfüüsika ja fundamentaalfüüsika suuna magistrantidele.Objectives/eesmärkid:  Mõista füüsikat, mis kirjeldab laseri töötamist, laseri juhtimist ning laseri kiire omadusi.  Saada ettekujutus laserite tehnilise realisatsiooni ning rakendusvõimaluste mitmekesisusest. Üldiselt: paremini orienteeruda ning hakkama saada laseritega ja nende rakendustega seotud küsimustes.Learning outcomes/õpiväljund:  Kursust läbinud üliõpilane teab olulisemate laseritüüpide konstruktsiooni, tööpõhimõtet, väljundparameetrite suurusjärku ja rakendusvõimalusi ning oskab otsida täiendavat infot, teab laserite füüsika põhilisi termineid, mõisteid ja printsiipe ning oskab neid sõnastada ja selgitada, saab aru laseri töötamise erinevaid aspekte ning laserivalguse omadusi kirjeldavatest matemaatilistest mudelitest ja oskab lahendada lihtsamaid laserite füüsika ülesandeid. <B>Ainet loetakse üle aasta!</B>"}