{"KURSUSE_NIMI": "Plasmafüüsika ja tema rakendused", "KURSUSE_KOOD": "LOFY.01.030", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Elekter ja magnetism"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuses vaadeldakse plasma kui aine agregaatoleku põhikarakteristikud, põhitähelepanu pööratakse termodünaamiliselt mittetasakaalulisele plasmale. Tutvutakse elementaarprotsessidega, mis määravad plasma omadused. Esitatakse teoreetilised ja eksperimentaalsed meetodid, mida kasutatakse mittetasakaalulise plasma uurimisel. Ülaltoodud teave alusel kirjeldatakse gaaslahendusplasma põhitüüpe ning momendil aktuaalseid rakendusi.\nLoengu teemad omandatakse iseseisva töö käigus ja seda aitavad kontrollida iganädalased Moodle testid. Seejärel diskuteeritakse kord nädalas neil teemadel koos kaasüliõpilaste ja õppejõuga seminarivormis. Iga üliõpilane valmistab kursuse lõpuks ühel koos õppejõuga valitud teemal ette ettekande mida tutvustatakse seminaris. Teadmiste omandamist kontrollitakse suulise eksami käigus.Objectives/eesmärkid:  Kursusel antakse alusteave plasmast kui aine neljandast agregaatolekust ja tutvustatakse plasmat kirjeldavad põhikarakteristikud. Enim tähelepanu pööratakse termodünaamiliselt mittetasakaalulisele plasmale ja tema rakendustele pinnatöötluses ja keskkonnasaaste vähendamisel. Tutvustatakse kõrgetemperatuurilise plasma rakendamist termotuumareaktsiooni käivitamiseks.Learning outcomes/õpiväljund:  Pärast kursuse läbimist, üliõpilane: * defineerib fundamentaalsete plasma parameetrite abil, millal võib ioniseeritud keskkonna lugeda plasmaks aine neljanda agregaatolekuna; * kirjeldab peamiseid laengukandjate kao- ja tekkemehhanisme ning koostadb plasmakeemilisi reaktsioonide kiirusvõrrandeid; * eristab peamisi mittetasakaalulise gaaslahendusplasma liike ning kirjeldab nende tekkemehhanisme ja olulisemaid rakendusi; * selgitab peamisi plasmadiagnostika meetodeid ja nende kasutamisvaldkondi. Ülekantavad oskustena üliõpilane: * orienteerub plasmafüüsika alases eesti- ja ingliskeelses sõnavaras ja erialakirjanduses; * arendab suulist eneseväljendusoskust koostades ja esitades valitud teemal ettekande teistele üliõpilastele ja õppejõule; * arendab iseseisva õppimise oskust; Ainet loetakse üle aasta!"}