{"KURSUSE_NIMI": "Vaakum- ja krüotehnika", "KURSUSE_KOOD": "LOFY.01.026", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Füüsikaline maailmapilt"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 4, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aines käsitletakse vaakum- ja krüotehnikat lähtudes füüsikaüliõpilaste, eelkõige bakalaureuseõppe rakendusliku suuna üliõpilaste prognoositavast vajadusest vastavate teadmiste järele.\nKäsitletakse gaaside omadusi normaal- ja hõrendatud tingimustes. Tutvustatakse vaakumi kasutamist teaduses ja tehnikas. Õpitakse tundma vaakumpumpade, vaakummeetrite ja vaakumsüsteemide ehitust ja nende tööpõhimõtteid.\nTutvutakse temperatuuri mõõtmise ja gaaside veeldamise meetoditega. Õpitakse tundma erinevat tüüpi krüostaatide ehitust ja vedela heeliumi kasutamise võimalusi ning ülimadalate temperatuuride saavutamise meetodeid. Tutvutakse ainete omadustega ülimadalatel temperatuuridel, ülijuhtivuse ja ülivoolavusega.Objectives/eesmärkid:  Tutvustada eelkõige bakalaureuseõppe üliõpilastele vaakum- ja krüotehnika põhiprintsiipe, meetodeid ja aparatuuri, anda praktilisi oskusi vaakumaurustamiseks ja krüotehnika kasutamiseks.Learning outcomes/õpiväljund:  Peale kursuse läbimist üliõpilane: * Teab, mis on vaakum, madalvaakum, kõrgvaakum ja ülikõrgvaakum ning on kursis absoluutse temperatuuriskaalaga * Teab, kus ja milleks kasutatakse vaakumit ning madalaid temperatuure teaduses ja tehnikas * Teab Maxwelli termodünaamika võrrandeid ja oskab neid rakendada teisendustes * Oskab gaaside kineetilisele teooriale tuginedes arvutada molekulide keskmist vaba tee pikkust ja kiirust hõrendatud gaasides * Oskab arvutada soojusjuhtivust hõrendatud gaasides * Oskab arvutada avade ja vaakumtorude takistust ja juhtivust * Oskab teha gaasi voo ja pumpamise kiiruse arvutusi * Tunneb erinevat tüüpi vaakumpumpade ning vaakummeetrite ehitust ja tööpõhimõtet, samuti oskab tuua näiteid erinevat tüüpi krüostaatide kohta ja seletada nende tööpõhimõtet * Teab, kuidas ühendada erinevaid pumpasid vaakumsüsteemiks * Omab teadmisi lekete otsimisest * Oskab kasutada vaakumsüsteemi, aurustada kilesid."}