{"KURSUSE_NIMI": "Keskkonnafüüsika alused I", "KURSUSE_KOOD": "LOFY.05.024", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengursus füüsikaliste mõõtmiste alustest, mehhaanikast ja hüdrostaatikast pidades silmas erinevate keskkondade (atmosfäär, veekogud, elusorganismid, tehiskeskkonnad (hooned, rajatised) füüsikalist kirjeldamist.Objectives/eesmärkid:  Loengukursuse eesmärgiks on omandada füüsikaliste mõõtmiste alused ning õppida mõistma looduslikes ja tehiskeskkondades, see on atmosfääris, veekogudes, eluslooduses (mikroorganismid, taimed, loomad, inimesed) ja rajatistes toimuvaid protsesse lähtudes mehhaanika ja hüdrostaatika  seadustest. Kuulajaskonnana on mõeldud põhiliselt TÜ loodus- ja täppisteaduste valdkonna mittefüüsika erialade üliõpilasi.Learning outcomes/õpiväljund:  See ainekursus õpetab mõistma:\n-  juhuslikke suurusi ja nende karakteristikuid;\n-  et füüsikalise mõõtmise tulemus on oma olemuselt juhuslik;\n-  terminite 'mõõteviga' ja 'mõõtemääramatus' erinevust;\n-  pöördliikumise dünaamikat; \n-  Maa pöörlemise mõju liikumistele.\n----------------------------- \nSee ainekursus annab oskused:\n-  arvutada ja esitada nii mehhaaniliste kui elektrimõõtmiste määramatusi;\n- esitada füüsikalisi suurusi erinevates ühikutes;\n-  kasutada erinevaid ajasüsteeme;\n-  ohutult juhtida väikeautot;\n-  hinnata hoonete funktsionaalsust; \n          ja palju muud praktilist. ------------------------------------------------ \nMoodle's on detailsed konspektid terviktekstidena, pdf-formaadis. Kokku on 3 konspektifaili  Kui jääte kuskil hätta (sh ülesannete lahendamisel), siis tulge konsultatsioonile:  Physicum, kabinet A407).  \nViimaseks loenguks saadan kordamisküsimused ja loengul tutvustan näidistesti,"}