{"KURSUSE_NIMI": "Magnetmaterjalid", "KURSUSE_KOOD": "LOFY.02.047", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Füüsikaline maailmapilt"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse alguses kirjeldatakse elektri- ja magnetvälja voolupõhiselt ja poolusepõhiselt, samuti magnetvälja iseloomustamisel vajalikke füüsikalisi suurusi ja ühikuid. Magnetmaterjale klassifitseeritakse vastavalt nende dia-, para- ja ferromagnetilistele omadustele. Tutvustatakse magnetilise hüstereesisilmuse parameetreid: jääkinduktsiooni, küllastust ja koertsitiivsust. Samuti tutvustatakse magneetumuse temperatuurisõltuvusi ja sõltuvust reaalse materjali sünteesiprotsessi parameetritest ning sünteesitud magnetilise tahkise dimensioonidest ja keemilisest koostisest. Kirjeldatakse magnetilise infosalvestuse, mälukeskkondade ja magnetpeade tööpõhimõtteid või struktuuri. Kirjeldatakse magnetotakistuslikke nähtusi nagu anisotroopne magnetotakistus (AMR) ja hiiglaslik magnetotakistus (GMR) ning magnetpäid, samuti magnetilisi muutmälusid. Tähelepanu pööratakse spintroonikale ja kirjeldatakse magnetilisi pooljuhte. Tutvutakse materjalide saamisprotsesside ja tehnoloogiaga, kaasa arvatud võimalused sünteesida rahuldavaid magnetilisi karakteristikuid näitavaid materjale suurtel pindaladel ja madalatel temperatuuridel nanomeetrite suurusjärgus mõõdetavate paksusega kihtidena. Kirjeldatakse ferriitstruktuuride kolmedimensionaalse sadestamise meetodeid nanopoorsel substraadil nanotorude või - varrastena.Objectives/eesmärkid:  Käsitletakse magnetvälja kirjeldavaid füüsikalisi suurusi ning ühikuid, ainete magnetiliste omaduste füüsikalisi aluseid ja magnetmaterjalide nomenklatuuri. Vaadeldakse magnetmaterjalide omadusi ja rakendamise iseärasusi ning nende arvestamist kaasaaegsete seadmete konstruktsioonis. Käsitletakse nanodimensionaalsete magnetseadmete arendusperspektiive ja probleeme.Learning outcomes/õpiväljund:  Kursuse lõpuks üliõpilased 1. Tunnevad magnetmaterjalide iseloomustamiseks vajalikke füüsikalisi mõõtühikuid ja mõõtemeetodeid. 2. On tutvunud magnetiliste seadmete väljatöötamisel kasutatavate keemiliste ühendite ja materjalidega, samuti mõningatega nende fabritseerimise viisidest. 3. On kursis magnetiliste infosalvestusseadmete konfiguratsiooni ja tööpõhimõtetega. 4. On tutvunud seadmete arendustöös oluliseks peetavaid põhikontseptsioone: nt. seadmed nanomeetriliste paksustega tahkiskihtidel, kolmedimensionaalsed struktuurid nanotorudel ja nanovarrastel. Ainet loetakse üle aasta!"}