{"KURSUSE_NIMI": "Füüsikaline maailmapilt", "KURSUSE_KOOD": "LOFY.01.002", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 68, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Üliõpilaste varasemaid füüsikateadmisi eeldamata viiakse nad kiiresti kaasaegse füüsika põhiideedeni (aine ja väli, fermionid ja bosonid, tõrjutusprintsiip, energia minimiseerumine, absoluutkiirus, dualism, määramatus). Kuulajate teadvuses püütakse eelkõige tekitada füüsikalisi protsesse peegeldavaid kujutluspilte. Matemaatiliste meetodite rakendamise kohta füüsikas tuuakse markantseid näiteid (diferentseerimine, integreerimine, kompleksarvud). Käsitluse üldist matemaatilist rangust ei taotleta.Objectives/eesmärkid:  Tutvustada füüsikat kui tervikut ja füüsika rolli indiviidi kui vaatleja isikliku looduspildi kujundamisel.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane:\n1. Mõistab füüsikat kui kõige üldisemaid põhjuslikke seoseid uurivat, loodusnähtuste mudeleid loovat ja nii sisemist kui välist nähtavushorisonti edasi nihutavat teadust;\n2. Oskab väljendada füüsikalise maailmapildi alusprintsiipe (näiteks: atomistika, energia minimiseerumine, tõrjutus, absoluutkiirus, dualism, lõtkuprintsiip) ja viidata nende avaldumisele;\n3. Oskab loengute kavas toodud märksõnade raames füüsikaliselt arutleda, eristades olulist ebaolulisest ja kasutades korrektselt füüsika termineid;\n4. Valdab füüsikaliste protsesside kirjeldamiseks vajalikke matemaatilisi võtteid (graafilised meetodid, diferentseerimine ja integreerimine, kompleksarvude kasutamine) ning tunneb peamiste füüsikas esinevate funktsionaalsete sõltuvuste omadusi ja tekke tingimusi (lineaarne, astme-, eksponent- ja harmooniline funktsioon);\n5. Tunneb kaasaegse füüsikalise maailmapildi põhimõisteid aineveebis toodud põhivaraga (30 A4 lehekülge) määratletud tasemel;\n6. Suudab lahendada füüsikalisi arvutusülesandeid aine veebipõhise õppesüsteemi näidisülesannetega määratletud tasemel. Aine toimumiskava kehtib esialgse orientiirina."}