{"KURSUSE_NIMI": "Tahkismaterjalide füüsika", "KURSUSE_KOOD": "LOFY.02.025", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuses vaadeldakse optilisi, elektrilisi ja magnetilisi nähtusi dielektrikutes, pooljuhtides, metallides, ülijuhtides, klaasides ja nanostruktuurides. Antakse ülevaade elektronergastustest, võnkespektritest, punkt- joon- ja pinnadefektidest. Vaadeldakse tänapäevaseid materjalide struktuuri uurimise meetodeid makroskoopilisel ja aatomite tasemel, kristallide kasvatamise mehhanisme, keraamikate ja epitaksiaalkilede valmistamist, niitkristalle. Tutvustatakse materjalide modifitseerimise aluseid mehaaniliste, soojus-, laser- ja kiirgustehnoloogiate abil, materjalide rakendamist lasertehnikas, valgusallikates, optilistes sidekanalites, kiirguse detekteerimisel ja dosimeetrias, ökoloogilises seires, meditsiinis jne. Kursus põhineb tahkiste teoorial, kuid jääb poolkvantitatiivseks. Aine on mõeldud fundamentaalfüüsika ja rakendusfüüsika suuna üliõpilastele.Objectives/eesmärkid:  Antud kursuse põhieesmärgiks on vaadelda mitmesuguseid füüsikalisi nähtusi ja nende rakendusi erinevat tüüpi tahkismaterjalides ning kaasaegse kiirelt areneva materjaliteaduse spetsialistide koolitamine.Learning outcomes/õpiväljund:  Peale kursuse materjalidega tutvumist on tudengil põhiline ettekujutus: *\tkristallistruktuurist ja selle uurimise meetodeist, tihedaima pakenduse tüüpidest, kristallide seoste põhitüüpides; *\tvõre oma- ja lisand-punktdefektidest, dislokatsioonidest ja nende vaatlemise meetodeist, laia keelutsooniga materjalide kasvatamise meetodeist; *\tühemõõtmeliste ühe- ja mitmeaatomiliste ahelate võnkespektrist, kristallide võnkespektrite registreerimise eksperimentaalmeetodeist; *\tluminestsentsitsentrite optilistest karakteristikutest laia keelutsooniga kristallides, Franck-Condoni lähendusest, termilisest kustumisest ja kiirguseta üleminekuist, foononvabadest joontest ja kuumast luminestsentsist, lisandluminestsentsi rakendustest; *\tdielektrikute tsoonistruktuurist, fundamentaalneeldumise spektritest, omaluminestsentsi erinevatest tüüpidest (rekombinatsiooniline, eksiton-, kross- ja tsoonisisene), eksitonidest ja iselõksustumise (autolokalisatsiooni) nähtusest, sünkrotronkiirguse kasutamisest tahkiste uurimisel; *\telektronergastuste kordistumisest pooljuhtides ja dielektrikuis, kordistumise peamistest mehhanismidest ning nende kasutamisest spektraaltransformaatoreis, tahkiste stsintillatsioondetektorite töö põhimõtetest, dielektrilise läbilöögi mehhanismist; *\tstruktuuridefektide tekitamise põhilistest löök- ja ionisatsioonimehhanismidest erinevate kiiritustüüpide toimel, materjalide kiirituskindluse tõstmise meetoditest ning perspektiividest; tuuma- ja termotuumaenergeetika materjalidest, individuaaldosimeetria printsiipidest ja termoaktivatsioonspektroskoopia meetodeist;  *\tmetallide ja sulamite madalatemperatuursest ülijuhtivusest, kõrgtemperatuurse ülijuhtivuse spetsiifikast, pooljuhtoptika ja -elektroonika põhimõisteist. Ainet loetakse vajaduspõhiselt."}