{"KURSUSE_NIMI": "Optika", "KURSUSE_KOOD": "LOFY.01.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Elekter ja magnetism", "Füüsikaline maailmapilt"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 48, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "---Objectives/eesmärkid:  Anda süstemaatiline ülevaade põhiliste optiliste nähtuste füüsikalisest kirjeldamisest, käsitledes valguse kiirgumist ja neeldumist, peegeldumist, murdumist  ja kaksikmurdumist, polarisatsiooni, interferentsi, difraktsiooni ning vastastikmõju ainega. Tutvustada optika olulisemaid füüsikalis-tehnilisi rakendusi.Learning outcomes/õpiväljund:  1.\tValdab valguse kirjeldamiseks vajalike mõistete aparaati (lainefunktsioon ja  intensiivsus, faasikiirus ja rühmakiirus, murdumisnäitaja, neeldumistegur, optiline teepikkus, käiguvahe, lainete koherentsus, läätse optiline tugevus, suurendus, lahutusvõime, apertuur, aberratsioonid, kaksikmurdumine, lainete polarisatsioon, optiline aktiivsus, dikroism, aine dispersioon, soojuskiirgus, luminestsents, hajumine).\n2.\tOskab kasutada radiomeetrilisi ja fotomeetrilisi suurusi: kiirgusvoog, kiirgustugevus, kiirgavus, kiiritustihedus, valgusvoog, valgustugevus, valgustatus. Tunneb valgusviljakuse mõistet ja kõigi nende suuruste ühikuid. \n3.\tOskab konstrueerida kujutist tasase ja sfäärilise peegli ning õhukese läätse korral, aga ka neist elementidest koostatud optilistes süsteemides (luup, mikroskoop, teleskoop).\n4.\tSuudab formuleerida valguslainete jaoks lainevõrrandit ning seda erijuhtudel lahendada, tunneb lainefunktsioonis sisalduvate füüsikaliste suuruste funktsionaalsusi ning lihtsaimaid lainemudeleid (tasalaine, keralaine, dipooli kiirgus, Gaussi kimp). Oskab teisendada omavahel spektraalparameetreid (lainepikkus, lainearv, sagedus ja footoni energia) ja teab nende suurusjärke nähtava valguse jaoks. \n5.\t Suudab kirjeldada valguslaine polarisatsiooni muutusi peegeldumisel,  murdumisel, kaksikmurdumisel ja optiliselt aktiivses aines. \n6.\tOskab rakendada Huygens-Fresneli printsiipi difraktsiooni ja interferentsi kirjeldamisel üksik- ja kaksikpilu ning ümmarguse ava korral. \n7.\tSuudab selgitada olulisemate optiliste elementide (lääts, peegel, prisma, polaroid, faasiplaat, difraktsioonivõre, valguskiud, selgendav kate) ja optiliste seadmete (valgusdiood, laser, monokromaator, spektroskoop, fotokaamera, interferomeeter, fotodiood, fotokordisti) funktsioneerimist."}