{"KURSUSE_NIMI": "Magistriseminar teoreetilises füüsikas", "KURSUSE_KOOD": "LOFY.04.066", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Eriseminaris käsitletakse teoreetilise füüsika huvipakkuvaid ja aktuaalseid probleeme lisaks matemaatilise füüsika, elektrodünaamika, kvantväljateooria, üldrelatiivsusteooria jt. ainete põhi- ja valikkursustele. Toimuvad ka õppejõu(dude) ülevaateloengud. Põhiline töövorm on teadusliku kirjanduse ja/või iseseisva uurimistöö alusel referaatide koostamine, ettekandmine ja analüüsimine. Aine on vajalik fundamentaalfüüsika suuna magistrantidele.Objectives/eesmärkid:  Seminari eesmärgiks on anda üliõpilastele kogemus teadusinformatsiooni läbitöötamisest ja esitamisest suulise ettekandena ning süvendada nende erialaseid teadmisi teoreetilisest füüsikast.Learning outcomes/õpiväljund:  üliõpilane - omandab teadusinformatsiooni läbitöötamise ning süstemaatiliseks ja loogiliseks esitamiseks ettevalmistamise kogemuse, - omandab matemaatilise sisuga suulise ettekande pidamise kogemuse, - omandab kogemuse, kuidas ettekannet saata arvutipresentatsiooniga või üleskirjutusega tahvlil, - täiendab oma teadmisi teoreetilise füüsika aktuaalsetest probleemidest. <font color=\"red\">Oma ettekande aeg on võimalik reserveerida google <a href=https://docs.google.com/document/d/1BTHGgWYB1sJY2DrMGE9ACYlOIBfZFcTvQZbGLLEOEBA/edit?usp=sharing>lehel</a>.</font>\n\nEttekande pealkiri ja lühike sisukokkuvõte palun saata seminari juhatajale (laur.jarv@ut.ee) hiljemalt ettekandele eelneva päeva (st esmaspäeva) hommikuks, et jõuaks selle mõistliku etteteatamisajaga välja kuulutada.\n\nSeminaride toimumise teated postitatakse <a href=http://lists.ut.ee/wws/info/ut.physics>ut.physics</a> ja <a href=http://lists.ut.ee/wws/info/fyysika.fundamentaal>fyysika.fundamentaal</a> listidesse.\n\nBakalaureuse tasemel toimuvad seminarid nime all \"Teoreetilise füüsika seminar\" LOFY.04.045.\nDoktorantuuri tasemel läheb ettekande pidamine ja seminarides osalemine arvesse aine \"Doktoriseminar\" LOFY.00.004 raames. (Punktid võtab arvesse doktorantuuri atesteerimiskomisjon seminari juhataja esildise alusel.)\n\nSeminarid toimuvad hübriidselt või välisesinejate korral täielikult online <a href=https://button.ut.ee/b/lau-2cv-evu>BigBlueButton keskkonnas</a>."}