{"KURSUSE_NIMI": "Elektriahelad", "KURSUSE_KOOD": "LOFY.03.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 48, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 76, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine tutvustab lineaarsete alalis- ja vahelduvvooluahelate kirjeldamise meetodeid. Käsitletakse elektri- ja magnetahelate teooria üldpõhimõtteid, hargneva elektriahela kirjeldamise meetodeid (Kirchhoffi seadused, voolude superpositsioon, Nortoni ja Thevenini ekvivalentskeemid), vahelduvvoolu jada- ning rööpahelate parameetrite arvutamist, RLC-ahela sageduskoste ja hüveteguri leidmist ning ahelate omavahelist sidestamist.Objectives/eesmärkid:  Viia arvutitehnika bakalaureuseõppe üliõpilaste teadmised ja oskused vooluringide talitluse valdkonnas elektroonika kursuste läbimiseks piisavale tasemele.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1.\tOskab arvutada hargneva alalisvooluahela osade takistusi, neid läbivate voolude tugevusi, neil tekkivaid pingesid ja neil eralduvaid võimsusi, kasutades seejuures mõisteid pinge- ja voolujagur, ekvivalentne takistus, allika elektromotoorjõud ja sisetakistus, koormussirge, tööpunkt.  2.\tOskab arvutada funktsionaalseid parameetreid hargnevates ahelates, millel on sõltumatud allikad mitmes harus, kasutades selleks erinevaid formalisme (Kirchhoffi seadused, voolude superpositsioon, Nortoni ja Thevenini ekvivalentskeemid), oskab valida tõhusaimat arvutusviisi tulenevalt ahela geomeetriast (sõlmede ja harude arv) ning arvutuse eesmärgist (detailne ahela analüüs või ahela toimimine koormuse suhtes). 3.\tOskab arvutada voolutugevusi ja pingesid kuni nelja komponenti (R, L või C) sisaldava hargneva vahelduvvooluahela eri osades, oskab arvutada komponentides eralduvaid võimsusi, oskab joonistada etteantud komplekstakistusega vahelduvvooluahela faasordiagrammi. 4.\tOskab leida vahelduvvoolu RLC jada- ning rööpahelate sageduskostet ja hüvetegurit, oskab koostada passiivseid sagedusfiltreid (madalpääs-, kõrgpääs- ning ribafiltreid). 5.\tOskab vahelduvvooluahelat koormuse kasuliku võimsuse suhtes optimeerida (reaktantsi kompensatsioon, koormuse sobitamine trafo abil)."}