{"KURSUSE_NIMI": "Dosimeetrilised ja stsintillatsioonmaterjalid", "KURSUSE_KOOD": "LOFY.02.023", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Energeetika ja uute kiiritustehnoloogiate areng, kiiritusohutuse nõuete kasv, füüsika fundamentaalprobleemide lahendamine jms. nõuavad olemasolevate dosimeetrite ja stsintillatsioonmaterjalide täiustamist ning uute väljatöötamist. Käsitletakse mitmete kiiritustüüpide tahkismaterjalide abil detekteerimise ja dosimeetria üldpõhimõtteid. Tuginedes tahkiste kvantmehaanilistele mudelitele vaadeldakse optilisi ja elektrilisi protsesse laia keelutsooniga materjalides, samuti footonite, kergete ja raskete osakeste vastastikmõju (interaktsiooni) mehhanisme materjalidega. Parimate konkreetsete dosimeetrite ja stsintillaatorite näidetel analüüsitakse nende funktsioneerimise mehhanisme ja põhilisi kasutusi tehnika, meditsiini ning ökoloogia valdkonnas. Vaadeldakse aktuaalseid veel lahendamata küsimusi ja uute materjalide väljatöötamise perspektiive.Objectives/eesmärkid:  Käesolev loengukursus puudutab kaasaegse materjaliteaduse uut ja kiireltarenevat haru. Juba pikka aega on Eestis (Tartu Ülikooli Füüsika Instituudis) tihedas koostöös saksa, tšehhi ja vene teadlastega toimunud uute stsintillatsioon- ja dosimeetriliste materjalide otsing ja väljatöötamine energeetika, meditsiini, ökoloogia, geoloogia jpt rakenduste tarbeks.Learning outcomes/õpiväljund:  Kursuse positiivsele hindele läbinud üliõpilane:\n- tunneb optilisi nähtusi tahkistes (rõhuasetusega luminestsentsi eritüüpidele); laia keelutsooniga dielektrikute energeetilist struktuuri; kristallstruktuuri defekte (põhiliselt nanomõõtmelisi/punktdefekte);\n- tunneb luminestsentsitsentrite optilisi karakteristikuid laia keelutsooniga kristallides ning mõistab, miks nad erinevad vabade aatomite omadest; teab eksitonide ja elektron-aukpaaride poolt luminestsentsitsentritele energia ülekandmise protsesse; \n- teab elektronide, neutronite/prootonite ja raske ioonide ning tahkise vastasmõju protsesse; teab suurte energiatega osakeste ja kvantide detekteerimisel toimuva elektronergastuste evolutsiooni üldskeemi;\n- teab klassikaliste (NaI:Tl) ning uute kiirete stsintillaatorite tööprintsiipe, nende peamisi karakteristikuid ning nende kasutamist kõrgete energiate füüsikas, meditsiinis jm;\n- tunneb tundliku TSL ja PSL dosimeetria ning raskete osakeste trekidosimeetria põhimõtteid, teab nende dosimeetrite rakendusi alfa-, beta- ja gamma-kiirte ning soojuslike ja kiirte neutronite detekteerimisel.\n- on omandanud teadmised, mis lubavad osaleda uute kiirete ja ülikiirete stsintillaatorite ja dosimeetrite (k.a. kiirete ~MeV neutronite detekteerimiseks mõeldud) uurimisel, väljatöötamisel ja täiustamisel. Ainet loetakse üle aasta!"}