{"KURSUSE_NIMI": "Materjalifüüsika praktikum III. Optika", "KURSUSE_KOOD": "LOFY.02.007", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füüsikaline maailmapilt", "Laboritöö praktikum"], "SOOVITUSLIKUD_EELDUSAINED": ["Optika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tööde nimekiri:\n1. Newtoni rõngad (Hödemann) Ülesanded teemal: interferents.\n2.Interferents tasaparalleelselt plaadilt (Hödemann) Ülesanded teemal: interferents.\n3.Michelsoni interferomeeter  (Hödemann) Ülesanded teemal: interferents.\n4. Islandi paost prisma: kaksikmurdumine (polariseeritud valguse interferents) (Hödemann) Ülesanded teemal: polarisatsioon\n5.Polariseeritud valguse uurimine (Hödemann) Ülesanded teemal: polarisatsioon.\n6.Spektroskoobi gradueerimine (Tõldsepp) Ülesanded teemal: peegeldumine, murdumine ja absorbtsioon. \n7. Fotoelemendi kasutamine luksmeetrina (Tõldsepp) Ülesanded teemal: fotomeetria.\n8.Tutvumine mikroskoobiga (Tõldsepp) Ülesanded teemal: läätsed ja nende süsteemid.\n9. Optilise süsteemi prilliklaas uurimine (Tõldsepp) Ülesanded teemal: läätsed ja nende süsteemid.\n\n\n\n\nTöökorraldus praktikumis: Üliõpilast ei lubata praktilist tööd tegema, kui\n  -   tema teoreetiline ettevalmistus on ebarahuldav;\n  -   tal on kaitsmata või esitamata kaks sooritatud tööd.\n\nÜliõpilane arvatakse praktikumi rühmast välja, kui tal on jäänud tegemata kaks praktilist tööd.Objectives/eesmärkid:  Anda vajalikud teadmised ja oskused laboratoorseteks töödeks optika alal.Learning outcomes/õpiväljund:  Kursus koosneb 8 praktikumitööst, mille käigus omandatakse:\n\n1) Arusaam valguse interferentsist järgnevate eksperimentide baasil:Newtoni rõngad, interferents tasaparalleelselt plaadilt ja Mchelsoni interferomeeter. Oskus analüüsida ja interpreteerida interferentsipilte kasutades selleks pilditöötlusprogrammi ImpactGo! ja MathCadi. Oskus lahendada interferentsi teemalisi ülesandeid.\n\n2) Arusaam polarsieeritud valguse saamisest ja analüüisist. Oskus tekitada ja analüüsida polariseeritud valgust (lineaarselt, ring- ja elliptiliselt polariseeritud). Pool- ja veerandlaineplaadi idee ja kasutamine. Oskus lahendada ülesandeid valguse polarisatsiooni kohta.\n\n3)  Polariseeriutud valguse interferents. Oskus lahendada polarisatsiooni teemalisi ülesandeid.\n\n4) Spektroskoobi gradueerimine - Oskus kasutada spektraalriista ning selgitada selle töö põhimõtet. Oskus analüüsida ja interpreteerida neelduvusspektrit. Oskus selgitada spektraalriista ja kiirgusega seonduvaid põhimõisteid (optiline kiirgus, dispersioon, spekter, lahutusvõime jne)\n\n5) Fotoelemendi kasutamine luksmeetrina-Omandatakse teadmised fotomeetrilistest suurustest ja nende ühikutest (nt. valgus- ja kiirgusvoog, kandela ja luumen). Oskus kasutada fotoelementi, teada selle ehitusest ning mõista fotoefekti selles. Oskus lahendada fotomeetria teemalisi ülesandeid.\n\n6) Tutvumine mikroskoobiga - Teadmine kujutise tekkimisest mikroskoobis ja selle töö põhimõttest. Oskus selgitada järgnevaid põhimõisteid (lahutusvõime, aperatuurarv, suurendusvõime jne). Oskus lahenda läätsede ja nende süsteemidega seonduvaid ülesandeid.\n\n7) Optilise süsteemi prilliklaas uurimine - Teadmine erinevatest läätsedest ja silmast kui optilisest süsteemist, need töö põhimõttest ja kiirte käigust nendes. Oskus selgitada põhimõisteid (fookus, sõlmpunkt, optiline tugevus). Oskus lahenda läätsede ja nende süsteemidega seonduvaid ülesandeid."}