{"KURSUSE_NIMI": "Üldine ja anorgaaniline keemia", "KURSUSE_KOOD": "LOKT.00.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 24, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Pööratakse põhitähelepanu keemilise termodünaamika, kineetika, elektrokeemia ja lahuste temaatikale. Käsitlemist leiavad ka aatomi ehituse ja keemilise sideme põhiseisukohad. Samuti tutvustatakse eelkõige proviisoriõppe seisukohalt oluliste lihtainete ning keemiliste ühendite saamist, omadusi ja füsioloogilist toimet.Objectives/eesmärkid:  Üliõpilane tunneb üldise- ja anorgaanilise keemia põhimõisteid ja põhilisi seaduspärasusi, sest üldine ja anorgaaniline keemia on aluseks keemiaga seotud eriala-ainete omandamisel proviisoriõppes.Learning outcomes/õpiväljund:  Üldised õpiväljundid:\n1.\tOskab kasutada korrektselt  keemia-alaseid põhimõisteid, sümboleid, ühikuid. (KT-d)\n2.\tOskab ohutult planeerida lihtsamaid praktilisi töid.\n3.\tOmab süsteemseid teadmisi, oskab arutleda ja langetada otsuseid üldise ja anorgaanilise keemia peamistest teemadest ning oskab neid rakendada praktikas. (praktikumide suuline vastamine, praktiline kontrolltöö, KT-d, eksam)\n4.\tOskab luua seoseid teoreetiliste keemia alaste põhiteadmiste ja eluliste näidete vahel. (ülesannete lahendamine, probleemülesanne, praktikum)\n5.\tOskab leida eri allikatest vajalikke teoreetilisi teadmisi, oskab kogutud infot hinnata, kriitiliselt analüüsida ja suudab kogutud teoreetilisi teadmisi rakendada elulise ülesande lahendamisel. (Lihtsamad elulised probleemülesanded)\nÜlekantavad oskused:\n1.\tProbleemülesannete ja praktiliste tööde vastamiste raames arendatakse üliõpilase kirjalikku väljendusviisi ja suulise eneseväljenduse oskusi. Arendatakse meeskonnatöö oskuseid. 2024/2025 sügissemestri praktikumide ajakava\n\n10.09.2024 Sissejuhatus praktikumi. Ohutusnõuded, laboritehnika.\n17.09.2024  Vaskhüdroksiidkarbonaadi süntees ja lagundamine.\n24.09.2024  Reaktsiooni kiiruse mõõtmine, järgu määramine.\n01.10.2024 Happe-aluse tiitrimise põhialused (tugev alus+tugev hape).\n08.10.2024 Redoksreaktsioonid.\n15.10.2024 Ioonreaktsioonid vesilahustes.\n22.10.2024  Tasakaal elektrolüütide lahustes. Hüdrolüüs. pH\n29.10.2024 Anorgaaniliste ainete tüüpreaktsioonid: metallid, mittemetallid, oksiidid, \n                    alused, happed, soolad.                                  \n05.11.2023  PROTOKOLLIDE ESITAMINE, PRAKTILISED JÄRELTÖÖD!\n12.11.2023  PROTOKOLLIDE ESITAMINE, PRAKTILISED JÄRELTÖÖD! \n19.11.2023  KIRJALIK ARVESTUSTÖÖ PRAKTIKUMIS (NB! Arvestustööle saamiseks peavad olema arvestatud kõik 7 protokolli!)"}