{"KURSUSE_NIMI": "Keemilise analüüsi ja metroloogia praktikum", "KURSUSE_KOOD": "LOKT.06.033", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Praktiline keemiline analüüs", "Keemilise analüüsi praktikum algajatele"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 70, "seminar": 0, "independent_work": 86, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktilised tööd analüütilisest keemiast: proovi võtmine ja eeltöötlus, tiitrimeetria, potentsiomeetria, gaasi- ja vedelikkromatograafia, aatom- ja molekulspektroskoopia (FT-IR, AAS, spektrofotomeetria, leekfotomeetria jne), andmetöötlus ja metroloogilised aspektid analüütilises keemias.Objectives/eesmärkid:  Anda tudengile vahetud kogemused praktilisest analüütilisest keemiast: proovi võtmine ja eeltöötlus, erinevad tiitrimised, potentsiomeetria, kulonomeetria, gaasi- ja vedelikkromatograafia, aatom- ja molekulspektroskoopia (FT-IR, fotokolorimeetria, AAS, leekfotomeetria jne), andmetöötlus ja metroloogilised aspektid analüütilises keemias.Learning outcomes/õpiväljund:  Tudeng oskab selgitada põhimõtteid ja rakendusi järgmiste analüüsimeetodite kohta: tiitrimeetria, fotomeetria, kromatograafia, AAS, AES. \nTudeng oskab selgitada proovide ettevalmistamise põhitõdesid keemilises analüüsis. \nTudeng tunneb selektiivsuse mõistet ja selle saavutamise mooduseid (eraldamine, maskeerimine). \nTudeng oskab keemilise analüüsi määramatuse allikaid ja võimalusi nende vähendamiseks. \nTudeng oskab korrektselt kasutada levinumaid keemilisel analüüsil kasutatavaid laborivahendeid (pipetid, mõõtkolvid, büretid, kaalud, magnetsegajad, kuumutusseadmed). \nTudeng oskab korrektselt kaaluda ja lahuseid valmistada. \nTudeng oskab teostada lihtsamat proovi ettevalmistust keemilise analüüsi jaoks. \nTudeng on võimeline viima omakäeliselt läbi keemilist analüüsi ja arvutama analüüsi tulemus järgmiste meetoditega: tiitrimeetria, fotomeetria, gaasi- ja vedelikkromatograafia, leekfotomeetria, potentsiomeetria, aatomabsorbtsioonspektroskoopia, infrapunaspektroskoopia. \nTudeng õpib kasutama erinevaid analüütilise keemia instrumente. \nTudeng saab baasoskused instrumentide seadistamises, juhtimises ning andmete töötlemises vastavata programmidega. \nTudeng tunneb põhilisi analüütilises keemias kasutatavaid IT lahendusi. \nTudeng oskab etteantud tööjuhendi põhjal koostada plaani eksperimendi läbi viimiseks. \nTudeng oskab hinnata praktilise töö tulemust vastavalt etteantud kriteeriumitele. Exchange students and visiting students who are interested in the course can contact the supervisors and will be \nadmitted to the course if their previous knowledge is suffiient and if there are free places in the course."}