{"KURSUSE_NIMI": "Valitud peatükke elektrokeemiast", "KURSUSE_KOOD": "LOKT.02.020", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 60, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse kaasaegse elektrokeemia aktuaalseid probleeme. Vaadeldakse metalli pindkihis aset leidva potentsiaalilanguse (nn. metallifaasi karakteristikute, nagu elektronide efektiivse massi, Fermi ekraneerimispikkuse ja laengukandjate tiheduse) mõju adsorptsiooniprotsessi ja elektrokeemilise kineetika seaduspärasustele. Antakse ülevaade voltamperomeetrilistest analüüsimeetoditest, korrosioonist ja galvaanilistest protsessidest. Samuti analüüsitakse elektrilise kaksikkihi, orgaaniliste ühendite ja ioonide adsorptsiooni ja elektrokeemilise kineetika kvantkeemilisi mudeleid. Käsitletakse elektrilise kaksikkihi ehituse ning reagentide ja produktide loomuse mõju laenguülekande-kineetikale. Analüüsitakse erinevate kütuseelementide (polümeerelektrolüüdil, fosforhappel, sulatatud karbonaadil, tahketel oksiididel põhinevad kütuseelemendid) tööprintsiipe.Objectives/eesmärkid:  Antud kursusel käsitletakse elektrilise kaksikkihi moodustumise kaasaegseid seisukohti ning analüüsitakse faasidevahelise piirpinna ehituse mõju heterogeense laenguülekande kineetikale; korrosiooninähtusi, elektrokeemilise analüüsi teooriat ja sellega seonduvat. Aine toetab ka ettevõtluspädevuse arengut päriselu probleemide lahendamise kaudu.Learning outcomes/õpiväljund:  Lõpetajatel on piisavad teadmised elektrilise kaksikkihi moodustumise kaasaegsete seisukohtade vallas, samuti   korrosiooninähtuste ja elektrokeemilise analüüsi teooria valdkonnas toimuvatest tööturu väljavaadetest oma ametialal. Suudab analüüsida, hinnata ja pakkuda innovatiivseid lahendusi eriala tehnilistele ja tehnoloogilistele probleemidele. Oskab koguda teaduslik-tehnoloogiaalast informatsiooni, seda loovalt tõlgendada ning kasutada probleemide lahendamisel ja enesetäiendamiseks. Oskab näha erinevate protsesside vahelisi seoseid ja oskab rakendada teoreetilisi teadmisi autentsete protsesside planeerimisel ja kasutamisel kujundada õiged hoiakud erialaliseks loominguliseks tegutsemiseks, vastutuse kandmiseks ja elukestvaks enesetäiendamiseks.  On ettevalmistatud töötamiseks elektrilise kaksikkihi protsesside ja korrosiooninähtuste  vallas või muul kvalifitseeritud tegevusalal,  näidates seejuures algatusvõimet ja vastutustunnet. Tunneb ja oskab hinnata elektrilise kaksikihi protsesside ja korrosiooninähtuste probleeme, elektrokeemilist analüüsi ja kohta jätkusuutliku ühiskonna arengus."}