{"KURSUSE_NIMI": "Metroloogia keemias", "KURSUSE_KOOD": "LOKT.06.030", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Analüütilise keemia põhikursus"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 48, "seminar": 0, "independent_work": 76, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Metroloogia keemias on õppeaine, mis asub analüütilise keemia (keemiliste analüüside) - st ainete koostise (või ühtedes ainetes teiste ainete sisalduse) ja struktuuri määramise teadus - ning metroloogia (mõõtmiste teadus) piiri peal ja mõnevõrra lihtsustatult võib selle aine eesmärgi sõnastada nii: millised meetodid/lähenemisviisid on olemas selleks, et keemiliste analüüside tulemused oleksid \"õiged\" ja kuidas neid meetodeid kasutada. Aine on väga praktiline ja üritab anda teadmised ja oskused, mis on vahetult laboris kasutatavad. Õppetöö toimub loengute, praktikumide (arvutipraktikumid) ja seminaridena ja päris sageli ka niiöelda \"loengpraktikumseminaridena\", st sama õppetunni raames esitatakse tudengitele mingi meetod/lähenemisviis, siis võtavad tudengid oma arvutid ja lahendavad (õppejõu juhendamisel) vastava näiteülesande ning seejärel arutatakse ühiselt, mida saadud tulemustest võib järeldada.\n\nKursus annab teadmised kahes põhilises valdkonnas: \n1. Mõõtmine, mõõtetulemus, mõõtemääramatus keemias (mõõtmiste ja mõõtemääramatuse põhiprintsiibid, ISO GUM ja Nordtest meetodid määramatuse hindamiseks) \n2. Jälgitavus, valideerimine, referentsmaterjalid, laboritevahelised võrdlusmõõtmisedObjectives/eesmärkid:  Loengukursus annab teadmised keemilisteks mõõtmiseks ja analüüsideks, mõõtetulemuste usaldusväärsuse tagamiseks, mõõtetulemuste esitamiseks ja interpreteerimiseks kooskõlas tänapäevaste rahvusvaheliste nõuetega.Learning outcomes/õpiväljund:  Kursuse läbinud tudengil on teoreetilised teadmised ja praktilised oskused kahes põhilises valdkonnas:  1. Mõõtmine, mõõtetulemus, mõõtemääramatus keemias (mõõtmiste ja mõõtemääramatuse põhiprintsiibid, ISO GUM ja Nordtest meetodid määramatuse hindamiseks)  2. Jälgitavus, valideerimine, referentsmaterjalid, laborite vahelised võrdlusmõõtmised  Lisaks, kursuse läbinud tudeng:  -- oskab töödelda kogutud informatsiooni ja seda selgelt esitada.  -- oskab analüüsida etteantud dokumenti vms materjali, hinnata selle sobivust, õigsust ja relevantsust etteantud teemakäsitluses (kriitiline mõtlemine). -- oskab mõõtetulemusi esitada erinevatel, teadustööd toetavatel viisidel - graafikutel, diagrammidel, skeemidel jne.  -- oskab töötada tähtaegade järgi ja planeerida oma tegevust vastavalt etteantud tähistele. -- rakendab aines saadud teadmisi praktikas."}