{"KURSUSE_NIMI": "Meditsiiniline keemia", "KURSUSE_KOOD": "LOKT.00.009", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 27, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 59, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel käsitletakse organismide elutalituse aluseks olevate keemiliste protsesside kulgemise seaduspärasusi.  Vaadeldakse lähemalt vesilahustes asetleidvate protsesside toimumist, sõltuvalt lahuse pH-st, hüdrolüüsist, osmoosist. Õpitakse tundma termodünaamika ja kineetika seadusi ning nende rakendamist keemiliste reaktsioonide korral. Tutvutakse kolloidsüsteemides kehtivate seaduspärasustega ja mõningate kaasaegses meditsiinis kasutatavate analüüsimeetoditega.Objectives/eesmärkid:  Kursuse eesmärgiks on selgitada organismides kulgevate protsesside füüsikalis-keemilisi ja kolloidsüsteemide  aluseid ning anda ülevaade meditsiinis kasutatavatest analüütilistest meetoditest.Learning outcomes/õpiväljund:  Meditsiinilise keemia kursuse raames omandab üliõpilane keemia põhiteadmised mõistmaks inimorganismis toimuvate protsesside seaduspärasusi, keemilisi mehhanisme ning füüsikokeemilisi tasakaale ja instrumentaalanalüüsi meetodeid. (meditsiinilise keemia kursuse kava vastab arstiteaduse erialaainete mooduli õpiväljundile 1 ja 9)\n\nÜldised õpiväljundid:\n1.\tTeab ja oskab korrektselt kasutada keemia-alaseid põhimõisteid, sümboleid, ühikuid.\n2.\tOskab luua seoseid teoreetiliste keemia alaste põhiteadmiste ja eluliste näidete vahel.\n3.\tOmab süsteemseid teadmisi aine ehituse põhialustest. Oskab hinnata parameetrite mõju protsessi tasakaalule ja kineetikale.\n4.\tOskab kriitiliselt hinnata ja eristada olulist informatsiooni ebaolulisest, rakendada teoreetilisi teadmisi alus-happe tasakaalude, lahuse kontsentratsioonide ja osmootse rõhu ülesannete lahendamisel.\n5.\tOskab kirjeldada piirpindadel ja kolloidsüsteemides toimuvaid protsesse ja selgitada nende füsikokeemilisi aluseid.\n6.\tEristab instrumentaalanalüüsi meetodeid üksteisest ja teab nende põhimõtet. Teab ja oskab hinnata instrumentaalanalüüsi kvaliteeti mõjutavaid parameetreid. Oskab valida proovi analüüsiks vajalikku meetodit. \n\nPraktikum\n7.\tTeab laboris töötamise peamisi ohutusnõudeid, oskab ohutult planeerida ning läbi viia lihtsamaid praktilisi töid. \n8.\tTeab laboris töötamise põhilisi töövõtteid ja oskab korrektselt kasutada lihtsamaid laboritarvikuid ja aparatuuri.\n9.\tOskab nii kirjalikult kui ka suuliselt esitada eksperimenditulemusi, neid kriitiliselt analüüsida, tõlgendada ja teha vastavaid järeldusi ning luua seoseid.\n\nÜlekantavad oskused: \n1.\tPraktiliste tööde teotamise ja vastamiste raames arendatakse üliõpilase kirjalikku väljendusviisi ja suulise eneseväljenduse oskusi. Arendatakse meeskonnatöö planeerimise ja meeskonnas töötamise oskuseid. \n2.\tArendatakse matemaatikapädevust, analüüsi ja järelduste tegemise oskust."}