{"KURSUSE_NIMI": "Keskkonnakeemia I", "KURSUSE_KOOD": "LOKT.04.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Keskkonnakeemia kursuses käsitletakse ümbritsevas keskkonnas toimuvaid keemilisi ja füüsikalisi protsesse ning vastastoimeid keskkonnas. Samuti käsitletakse õhus, vees ja pinnases toimuvate biokeemiliste protsesside iseloomu, saasteainete levikut ja sellest tulenevaid keskkonnaprobleeme. Keskkonnas toimuvate keemiliste protsesside käsitlemisel pööratakse erilist tähelepanu mikroorganismide vahendusel kulgevatele redoksprotsessidele, saasteainete biolagundatavuse kriteeriumide määramisele ning keskkonna tingimuste hindamisele, et mõista keskkonnas toimuvate integratiivsete protsesside olemust.\nJuba ammutuntud ja läbiuuritud saasteainete käsitlemisel arvutatakse tasakaalulisi kontsentratsioone, õkotoksikoloogilisi näitajaid ning töötlemisparameetreid (3 kohustuslikku kodutööd) ning arutatakse arvutustulemuse mõju keskkonnale. Lisaks viimastele diskuteeritakse globaalsete keskkonnaprobleemide ning moodsate saasteainete leviku ja mõju üle, et arendada erialalist teemapõhist arutelu- ja analüüsioskust. Viimast hinnatakse ka eksamil.\nKursuse käigus koostab üliõpilane mõistekaardi, mille koostamiseks järjestatatakse loovalt, loogiliselt ja jälgitavalt läbianalüüsitud info.  Mõistekaardi koostamisel hinnatakse ka selle tehnilist lahendust.Objectives/eesmärkid:  Kursusel antakse ülevaade keskkonnas toimuvatest keemilistest protsessidest ja tutvustatakse saasteainete leviku probleeme vees, õhus ja pinnases. Kursusel tutvustatakse üldiseid ja tuntud saasteaineid keskkonnas, arvutatakse ainete sisaldusi tasakaalulistes protsessides ning arutatakse tulemuste mõju keskkonnaseisundile. Lisaks tutvustatakse globaalseid keskkonnaprobleeme, moodsaid saasteaineid ning veepuhastusmeeetodeid.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: * argumenteerib saasteainete mõju, eemaldamismeetodite ning kasutuse miniseerimise teemadel; * analüüsib valitud saasteaine levikut keskkonnas ning väljendab seda loova kirjaliku tööga; * rakendab keemia baasoskusi arvutusülesannetes (kontsentratsioonid, tasakaal, Henry seadus, redoks);  * analüüsib biolagunemise kompleksparameetrite keemilist sisu; * tunneb reoveepuhastuse etappe ja arvutab peamisi reovee koormusnäitajate väärtuseid; * annab hinnangu põlevkivi töötlemisega seonduva jäätmekäitluse keskkonnaprobleemidele."}