{"KURSUSE_NIMI": "Bioaktiivsete ühendite keemia (Materjalide keemia II)", "KURSUSE_KOOD": "LOKT.09.018", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursuses käsitletakse nii looduslike kui ka sünteetiliste\nlõhna- ja maitseainete, \nravimite, vitamiinide, hormoonide, \npestitsiidide ja desinfektsioonivahendite, \ndopinguainete, mürkide, narkootikumide ja hallotsinogeenide, \ntoiduainete ja toidulisandite keemiat; nende ainete koostist, omadusi, biosobivust, saamist ja kasutamist.\nKülastatakse Eesti laboreid ja ettevõtteid, mis tegelevad bioaktiivsete ainete kasutamise ja/või tootmisega. Külaskäigud pakuvad võimalusi kontaktide loomiseks tulevase tööandjatega.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade trendidest nüüdisaegses lõhna- ja maitseainete, valitud bioaktiivsete ainete ja toiduainete keemias. Kursusel osalemine laiendab üliõpilaste silmaringi keemiaalaste teadmiste rakendamisel.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: -oskab luua seoseid igapäevaelus esinevate bioaktiivsete ainete ning nende omaduste vahel -omab ülevaadet mõnede bioaktiivsete ainete seostumisest organismis -tunneb ülalnimetatud materjalide klasse, nende keemilist koostist ja struktuur-omadused seoseid -teab mõnede bioaktiivsete ainete looduslikku päritolu, nende sünteesimist ja tööstuslikku tootmist -kogeb ja eristab meeleelundite abil bioaktiivsete ainete keemilise struktuuri toimeid (tudengi informeeritud nõusolekul) -osaleb efektiivselt grupitöös ja diskussioonides -orienteerub mõnede bioaktiivsete aineklasside regulatsioonides (toidulisandid, ravimipreparaadid jm) -saab teadlikuks tööstuslike protsesside läbiviimisest ja mõnede tähtsamate valdkonnas tegutsevate ettevõtetega Eesti ja mujal Toimumisaegu on võimalik muuta kokkuleppel ainele registreerunud üliõpilastega ja sobiva auditooriumi olemasaolul.\n\nSobivad ajad on neljapäeval ja reedel. Eelistatult reedel, aeg on muudetav."}