{"KURSUSE_NIMI": "Analüütilise keemia praktikum I", "KURSUSE_KOOD": "LOKT.06.012", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Keemia alused", "Laboritöö praktikum"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 40, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktilised tööd analüütilisest keemiast: kaalumine, lahuste valmistamine, levinumate analüüsil kasutatavate laborivahendite käsitsemine, proovi eeltöötlus, titrimeetria, potentsiomeetria, kromatograafia, aatom- ja molekulspektroskoopia. \nIga töö sisaldab erinevaid etappe: etteantud andmete kohta arvutusfaili koostamine; suuline arutelu töö teooria ja rakenduste kohta; praktiline töö; arvutused reaalselt saadud andmetega tabelarvutusprogrammis ning tulemuste kriitiline hindamine.\n4 praktilist tööd toimub grupitööna ja seega saadakse praktikumi käigus ka meeskonnatöö kogemus laboratooriumis. Protokollide koostamise käigus õpitakse kasutama tabelarvutusprogrammi MS Excel keemilise analüüsi andmetöötluseks (tabelarvutusprogrammi toimimispõhimõtted, lineaarne regressioon, vajalikud funktsioonid).Objectives/eesmärkid:  Anda tudengile praktilised teadmised tavalisemate keemiliste analüüside kohta. Toetada õppijate suulise eneväljendusoskuse arengut. Õppija arendab keemiliste analüüside läbiviimisega vajalikke õpioskusi (vajalikud töövõtted ja andmetöötlusoskused).Learning outcomes/õpiväljund:  Pärast praktikumi kursuse läbimist tudeng\n- teab ja tunneb põhimõtteid ja rakendusi järgmiste analüüsimeetodite kohta: tiitrimeetria, potentsiomeetria, fotomeetria, kromatograafia, aatomemissioon-spektromeetria;\n- oskab valida ja korrektselt kasutada levinumaid keemilisel analüüsil kasutatavaid laborivahendeid;\n- oskab korrektselt valmistada lahuseid ja kasutada analüütilist kaalu;\n- teab proovide ettevalmistamise põhitõdesid keemilises analüüsis;\n- tunneb selektiivsuse mõistet ja teab selektiivsuse saavutamise põhilisi mooduseid (eraldamine, maskeerimine);\n- viib iseseisvalt läbi lihtsamat keemilist analüüsi (sh proovi eeltöötlus)\n- arvutab keemilise analüüsi tulemuse, hinnates kriitiliselt kogutud andmeid sealjuures kasutades sihtotstarbeliselt tabelarvutusprogrammi (nt MS Excel)."}