{"KURSUSE_NIMI": "Struktuuranalüüs II", "KURSUSE_KOOD": "LOKT.09.023", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse eesmärk on anda süvendatud teadmisi ja oskusi orgaaniliste ainete struktuuranalüüsist. Kursuse raames käsitletakse orgaaniliste ainete struktuuri määramise meetodeid, keemilisi ja aparatuurseid. Põhiliselt on vaatluse all IR, Raman, TMR-spektroskoopia ja massispektromeetria. Käsitletakse spektrite arvutamist, simuleerimist ja kompleksset interpreteerimist. Tutvustatakse TMR-spektroskoopia erinevaid meetodeid, k. a. dünaamiline ja korrelatsioon-spektroskoopia. Teostatakse praktilisi töid ja lahendatakse struktuuranalüüsi kompleksülesandeid.Objectives/eesmärkid:  Kursuse eesmärk on anda süvendatud teadmisi ja oskusi orgaaniliste ainete struktuuranalüüsist.Learning outcomes/õpiväljund:  Üliõpilased peavad teadma:\n-aatomituumade magnetismiga seotud põhiparameetreid, tuumade käitumist magnetväljas ning nende nähtuste rakendusi TMR eksperimendis.\n-aatomituumade relaksatsiooninähtusi, nende sõltuvust ainete struktuurist ning mõju TMR spektritele.\n-aatomituumade spinn-spinn vastasmõjust tingitud lõhenemiste põhimõtteid, \npeavad oskama hinnata spinnsüsteemide ekvivalentsust-mitteekvivalentsust ning teadma toopilisusest tulenevaid efekte.\n-mis on NOE efekt, ühe ja mitmedimensionaalse TMR tehnikaid, teadma dünaamilise TMR võimalusi ning solvendiefekte TMR spektroskoopias.\n-TMR spektroskoopia rakendusvaldkondi (samuti stereokeemias), oskama spektreid interpreteerida ning teadma TMR spektri andmete publitseerimise nõudeid. English speaking students can take a course, but earlier notice by e-mail is required.\n\nEriolukorra ajal toimuvad loengud ja seminarid BBB keskkonnas tavalistel aegadel ja loodetvasti ka samas mahus."}