{"KURSUSE_NIMI": "Üldkeemia seminar", "KURSUSE_KOOD": "LOKT.01.046", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Seminaris käsitletakse keemia aluste loengus läbivõetud teemasid, lahendatakse mitmesuguseid probleem- ja arvutusülesandeid vastavate teemade kohta selgitamaks ja kinnistamaks õpitud materjali.Objectives/eesmärkid:  Seminaris selgitatakse ja kinnistatakse keemia aluste loengu materjali ning harjutatakse probleem- ja arvutusülesannete lahendamist.Learning outcomes/õpiväljund:  1.Kursuse läbinud üliõpilane teab keemias enamlevinud ühendite nomenklatuuri, aineklasse, keemia põhimõisteid ja põhiseadusi ning oskab neid rakendada erinevates süsteemides.\n2. Teab ja oskab arvutada erinevaid lahuse kontsentratsiooni väljendusviise (massi- ja mahuprotsent, molaalsus, moolimurd) ja lahendada lahuste valmistamisega, lahjendamisega ning segamisega seotud arvutusülesandeid.\n3.Oskab tõlgendada ja põhjendada elektrolüütide lahustes toimuvaid erinevaid protsesse.  Oskab eristada erinevaid tekkivaid süsteeme üksteisest ning lahendada vastavaid arvutus- ning probleemülesandeid.\na) Eristab tugevaid ja nõrku happeid/alused ning oskab lahendada pH-d nendes lahustes.\nb) Teab, mis on tasakaalukonstant ning oskab seda arvutada lähtudes ainete algkontsentratsioonidest. Oskab kasutada dissotsiatsioonikonstanti elektrolüütide tugevuse hindamisel. \nc) Oskab hinnata, kuidas saab tasakaalu nihutada lähetainete või saaduste suunas.\nd) Teab, mis on lahustuvuskorrutis ja oskab seda rakendada sadestustasakaal ülesannetes. Oskab hinnata ainete võrdlemisel ligikaudu aine lahustuvust kasutades lahustuvuskorrutist.\ne) Teab lahuste kolligatiivseid omadusi ja nende sõltuvust erinevatest parameetritest. Oskab lahendada ülesandeid keemistemperatuuri, külmumistemperatuuri ja osmootse  rõhuga eritüüpi lahustes.\nf) Teab, mis on puhverlahused. Oskab soovitada, milliseid aineid peaks kasutama konkreetse puhverlahuse valmistamiseks lähtudes lahuse pH-st. Oskab selgitada puhverlahuste puhverdusvõimet.\n4.Teab elektrokeemia, aatomi ehituse ja keemilise sideme põhiseisukohti ja oskab neid rakendada ainete omaduste üle otsustamisel.\n5. Oskab määrata elementide oksüdatsiooniastmeid ning tasakaalustada redoksreaktsioone nii elektron- kui ioonelektronsel- meetodil.\n6. Oskab lahendada I-järki kineetika järgi toimuvate reaktsioonide kiiruskonstante, poolestus aega ja ainete algkontsentratsioone ja kontsentratsioone mingil aja hetkel"}