{"KURSUSE_NIMI": "Vedelikkromatograafia ja massispektromeetria", "KURSUSE_KOOD": "LOKT.06.016", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Analüütiline keemia I"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 48, "practice": 0, "seminar": 16, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab põhjalikud teadmised kromatograafias ja massispektromeetrias. Kursus koosneb loengutest, seminaridest ja praktilistest töödest. Käsitlusele tulevad teemad hõlmavad: \n1. Kromatograafia põhialused. Kromatograafiline protsess, selle matemaatiline modelleerimine.\n2. Vedelkromatograafia meetodid: statsionaarsed faasid (RP, NP, IE jne), mobiilsed faasid, seadmed, detektorid, praktilised rakendused. \n3. Meetodi väljatöötamine vedelikkromatograafias. \n4. Massispektromeetria - ionisatsiooniallikad, kõrge ja madala resolutsiooniga massianalüsaatorid. \n5. Massispektromeetrite kui vedelikkromatograafia detektorite eripära (ionisatsiooni efektiivsus, maatriksifektid). 6. Praktilised aspektid: proovi ettevalmistamine. \n7. Kõrglahutusega massispektromeetria ja isotoopide suhte massispektromeetria.Objectives/eesmärkid:  Kursuse eesmärk on anda üliõpilastele süvendatud teadmised vedelikkormatograafiast ja massispektromeetriast.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng tunneb vedelkromatograafia ja massispektromeetria järgmisi aspekte:  1. Vedelikkromatograafia põhialused. Kromatograafiline protsess, selle matemaatiline modelleerimine.  2. Vedelkromatograafia meetodid: statsionaarsed faasid (RP, NP, IE jne), mobiilsed faasid, seadmed, detektorid, praktilised rakendused.  3. Meetodi väljatöötamine vedelikkromatograafias.  4. Massispektromeetria - ionisatsiooniallikad, kõrge ja madala resolutsiooniga massianalüsaatorid.  5. Massispektromeetrite kui vedelikkromatograafia detektorite eripära (ionisatsiooni efektiivsus, maatriksi efektid).  6. Praktilised aspektid: proovi ettevalmistamine.  7. Kõrglahutusega massispektromeetria ja isotoopide suhte massispektromeetria."}