{"KURSUSE_NIMI": "Füüsikaline keemia 1. osa", "KURSUSE_KOOD": "LOKT.02.037", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füüsikaline maailmapilt"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 58, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursustes käsitletakse keemiliste ja füüsikaliste protsesside \nkõige üldisemaid seaduspärasusi: soojusefekte ja tööd, protsessi \nisevoolu kulgemise ja tasakaaluoleku termodünaamilisi tingimusi, faaside \ntasakaalu ja faasiliste üleminekute seaduspärasusi. Vaadeldakse molekulaarsete lahuste \nmoodustumise tingimusi ja omadusi.Objectives/eesmärkid:  Loeng annab teoreetilise baasi keemiliste protsesside termodünaamiliste seaduspärasuste mõistmiseks.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane *\tTunneb ideaalsete ja reaalsete gaaside omadusi ja oskab reaalsete gaaside ning vedelike käitumist seletada van der Waalsi olekuvõrrandi alusel. *\tTunneb termodünaamika seadusi ja olekufunktsioone ning oskab kasutada termodünaamilisi suurusi erinevate süsteemide kirjeldamiseks. *\tTunneb keemilise tasakaalu ja faasilise tasakaalu termodünaamilist tagapõhja. *\tTunneb lihtsate keemiliste reaktsioonide diferentsiaalseid ja integraalseid kiirusevõrrandeid ja oskab matemaatiliselt kirjeldada mõningate keerukamate reaktsioonide seaduspärasusi (jadareaktsioon, pöörduv reaktsioon, paralleelne reaktsioon, statsionaarse kontsentratsiooni meetod). *\tTunneb reaktsiooni järgu ja kiiruse määramise meetodeid (sh algkiiruste meetod ja järgu vähendamise meetod) ning oskab eksperimentaalse kineetilise võrrandi alusel ennustada reaktsiooni mehhanismi. *\tTunneb aktiivse vaheoleku teooria põhialuseid.  *\tOskab kirjeldada faaside tasakaalu ja analüüsida ühe-, kahe- ja kolmekomponentsete süsteemide olekudiagramme. *\tOskab kirjeldada ideaalsete ja mitteideaalsete molekulaarsete lahuste omadusi. *      Oskab ülesannete lahendamisel kasutada tabelarvutusprogramme nii arvutusteks kui ka graafikute koolstamiseke."}