{"KURSUSE_NIMI": "Ökotoksikoloogia", "KURSUSE_KOOD": "LOKT.04.016", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Keskkonnakeemia I"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuses käsitletakse ökotoksikoloogia põhialuseid, mis võimaldavad aru saada keskkonnas ja organismides toimuvatest protsessidest ning ohtlike ainete mõjust inimesele ja keskkonnale. Käsitletakse saasteainete levikut keskkonnas ning analüüsitakse koostöös kaasüliõpilastega sellega kaasnevaid keskkonnaprobleeme. Teadusartiklitest ning internetist saadud info põhjal tutvutakse ohtlike saasteainete omaduste ning toimetega. Kursuses tutvustatakse ökotoksikoloogilisi teste ning nende kaudu määratud parameetrite kasutamist ohutute piirnormide leidmisel.Objectives/eesmärkid:  Anda ülevaade ökotoksikoloogia põhialustest ja keskkonna saastumisega kaasnevatest probleemidest. Arendada üliõpilastes iseseisva töö oskusi teadusartiklite ning infomaterjalidega töötamisel ning akadeemilist kirjaoskust referatiivse ülevaate koostamiseks ökotoksikoloogia valdkonnas. Kasutades ökotoksikoloogia temaatikat aidata üliõpilastel arendada kriitilist mõtlemisoskust ning analüüsivõimet globaliseeruvas maailmas, kus praktiliselt kõikide tegevusvaldkondade koosmõjus kujuneb reaalne oht ökosüsteemidele.Learning outcomes/õpiväljund:  Üliõpilane: 1)\ttunneb ökotoksikoloogia uurimisvaldkonda ning ökotoksikoloogia ja toksikoloogia terminoloogiat; 2)\ttunneb kemikaaliseadust, sellest tulenevaid kohustusi ning Euroopa Liidu normatiivdokumente (REACH määrus, jt), mis reguleerivad ohtlike kemikaalide kasutamist. Oskab leida vajalikku informatsiooni kemikaalide ohutuskaartide ning ohutu kasutamise eeskirjade kohta; 3)\toskab leida infot teadusväljaannetest ja internetist ökotoksilisi probleeme põhjustavate kemikaalide leviku ning toimete kohta, et prognoosida võimalikke tagajärgi ökosüsteemidele; 4)\toskab iseloomustada kemikaalide levikut erinevates keskkonna osades ning analüüsida levikuga kaasnevaid stsenaariume ning ökotoksilisi tagajärgi; 5)\ttunneb kemikaalide oluliste parameetrite (püsivus, bioakumuleeruvust ja toksilisus) määramise meetodeid ning oskab leida sellekohast infot; 6)\toskab koostöös teiste üliõpilastega analüüsida kemikaalide olulisi omadusi, et ennustada kemikaalide toimet elustikule ja ökosüsteemidele; 7)\ttunneb kemikaalide ohtlike omaduste klassifitseerimise aluseid; 8)\ttunneb toksikokineetilisi ja toksikodünaamilisi protsesse organismides ning oskab iseloomustada ning klassifitseerida toksikantide põhjustatud toksilisi toimeid; 9)\tteab oluliste ökotoksikoloogiliste testide läbiviimise põhimõtteid ning oskab testides saadud tulemuste alusel määrata kemikaalide ohutuid koguseid keskkonnas; 10)\ton kursis ökotoksiliste kemikaalide seireuuringutega, oskab leida sellekohast infot ning hinnata ohtlike kemikaalide kasutamisega seotud riske."}