{"KURSUSE_NIMI": "Peatükke meditsiinilisest keemiast", "KURSUSE_KOOD": "LOKT.10.026", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus tutvutakse peamiste meditsiinilise keemia põhimõtetega ning vaadeldakse levinumaid bioaktiivsete ainete disainimise ja valmistamise strateegiaid. Materjal toetub valdavalt õpikule \"An Introduction to Medicinal Chemistry\" (Grham L. Patrick, Oxforf Press), millest peamine tähelepanu on osadel C (toimeainete leidmine ja disainimine) ja D (sünteesi strateegiad, struktuur-aktiivsussõltuvused). Kursus eeldab orgaanilise keemia ja biokeemia põhiteadmiste olemasolu.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvuda peamiste meditsiinilise keemia põhimõtega ning vaadeldakse levinumaid bioaktiivsete ainete disainimise ja valmistamise strateegiaid. Materjal toetub valdavalt õpikule \"An Introduction to Medicinal Chemistry\" (Grham L. Patrick, Oxforf Press), millest peamine tähelepanu on osadel C (toimeainete leidmine ja disainimine) ja D (sünteesi strateegiad, struktuur-aktiivsussõltuvused). Kursus eeldab orgaanilise keemia ja biokeemia põhiteadmiste olemasolu.Learning outcomes/õpiväljund:  a) Arusaamine bioaktiivsete ainete toimimise üldistest mehhanismidest. b) Põhiteadmised valkude ja ligandide vahelistest interaktsioonidest. Kuidas neid mõõdetakse ning kuidas kvantitatiivselt kirjeldatakse. c) Arusaamine peamistest bioaktiivsete ainete avastamise ja arendamise strateegiatest. d) Oskus lugeda ja aru saada meditsiinilise keemia alastest teadusartiklitest. Saada aru ainete sünteesi skeemidest ja osata analüüsida lihtsamaid struktuuri ja aktiivsuse vahelisi sõltuvusi. Aine on nüüd arvestuslik, mis peaks olema sobilikum teiste erialade tudengitele. Eelnevad põhiteadmised orgaanilisest keemiast ja biokeemiast on siiski soovituslikud.\nEnglish speaking students can take a course, but earlier notice by e-mail is required.\n\nEriolukorra ajal toimuvad loengud ja seminarid BBB keskkonnas tavalistel aegadel ja loodetvasti ka samas mahus."}