{"KURSUSE_NIMI": "Meditsiiniline keemia", "KURSUSE_KOOD": "LOKT.00.009", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 27, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 61, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel käsitletakse organismide elutalituse aluseks olevate keemiliste protsesside kulgemise seaduspärasusi.  Vaadeldakse lähemalt vesilahustes asetleidvate protsesside toimumist, sõltuvalt lahuse pH-st, hüdrolüüsist, osmoosist. Loengukursuse osas räägitakse füüsikalise keemia poolt kirjeldatavatest mehhanismidest. Õpitakse tundma termodünaamika seadusi ning nende rakendamist keemiliste reaktsioonide korral kui ka kirjeldatakse reaktsioonide kineetilisi parameetreid. Tutvutakse kolloidsüsteemides kehtivate seaduspärasustega ja mõningate nüüdisaegses meditsiinis kasutatavate analüüsimeetoditega.Objectives/eesmärkid:  Kursuse eesmärgiks on selgitada organismides kulgevate protsesside füüsikalis-keemilisi aluseid ning anda ülevaade meditsiinis kasutatavatest analüütilistest meetoditest.Learning outcomes/õpiväljund:  Meditsiinilise keemia kursuse raames omandab üliõpilane keemia põhiteadmised mõistmaks inimorganismis toimuvate protsesside seaduspärasusi, keemilisi mehhanisme ning füüsikokeemilisi tasakaale ja instrumentaalanalüüsi meetodeid. (meditsiinilise keemia kursuse kava vastab arstiteaduse erialaainete mooduli õpiväljundile 1 ja 9) Meditsiinikeemia kursuse loengute raames omandab üliõpilane järgmised algteadmised ning oskab neid seostada elusorganismides toimuvate protsessidega: *\tteab bioenergeetika põhimõisteid ning inimorganismi termodünaamilisi omadusi; *\tteab lahuste põhiteooriaid, mõistab ning oskab analüüsida lahuses toimuvaid lihtsamaid protsesse; *\tteab keemilise kineetika põhialuseid; *\ttunneb kolloid- ja pindnähtuste keemia põhimõisteid; *\toskab kirjeldada piirpindadel ja kolloidsüsteemides toimuvaid protsesse ja mõistab nende füsikokeemilisi aluseid; *\ttunneb ja teab põhilisi instrumentaalanalüüsi meetodeid ning oskab valida proovi analüüsiks vajalikku meetodit. Tudeng omandab praktikumis esmased oskused laboris töötamiseks, teab laboratoorse töö põhimõtteid ja ohutusnõudeid ning kinnistab oma teadmisi loengus omandatud teemade raames: *\ttunneb labori peamisi ohutusnõudeid; *\ttunneb põhilisi töövõtteid ja oskab töötada olulisemate laborivahenditega; *\toskab seada eesmärke etteantud praktiliste tööde lahendamiseks, planeerida ja läbi viia eksperimente. *\tteab erinevate katseseadmete tööprintsiipe, oskab hinnata nende rakendust ning neid efektiivselt kasutada. *\toskab nii kirjalikult kui ka suuliselt esitada eksperimenditulemusi, neid kriitiliselt analüüsida, tõlgendada ja teha vastavaid järeldusi. *\toskab seostada saadud tulemusi organismides kulgevate reaalsete protsessidega. Eduka tulemuse saamiseks on soovituslik loengutes, seminaride ja praktikumides osalemine."}