{"KURSUSE_NIMI": "Keskkonnakeemia alused I", "KURSUSE_KOOD": "LOKT.04.019", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Üldine keemia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on mõeldud keskkonnatehnoloogia, geoloogia ja ökoloogia 1. aasta üliõpilastele ning kõigile neile, kes soovivad mõista nii looduses kui ka tehiskeskkonnas toimuvaid protsesse keemilisest aspektist. Keskkonnakeemia kursuses käsitletakse neid keemia põhialuseid, mis võimaldavad aru saada keskkonnas kulgevate protsessidest, samuti keskkonna saastamise ning selle mõjude uurimise keemilistest alustest. Kursusel õpitakse arvutama ainete ja ioonide sisaldusi ning arutatakse saadud tulemuse üle, et motiveerida üliõpilasi kaasamõtlema ja -rääkima keskkonnasaastumise teemadel. Teemade läbirääkimisel ja ülesannete lahendamisel oodatakse üliõpilaste osalemist individuaalsetes ja rühmaaruteludes, et valmistuda erinevates kategooriates esitatud eksamiküsimuste vastamiseks (vt. all). Kursuse auditoorsed kohtumised toimuvad kaks korda nädalas. Lisaks tuleb ajakava jälgides lahendada ja esitada tähtajaliselt kuus kohustuslikku kodutööd, millele lisaks võib esitada veel 2 kodutöö, mis ei ole kohustuslikud.  \nEksamiküsimuste kategooriad: mõisted (4 küsimust), valikvastusega küsimus, lühike selgitus (4 küsimust), pikem analüüs (2 küsimust), keskkonnakeemiline maailmapilt, arvutusülesanded.Objectives/eesmärkid:  Eesmärgiks on selgitada looduses toimuvate protsesside keemilisi aspekte ning keskkonna saastamise ja selle mõju uurimise keemilisi aluseid. Kursusel arvutatatakse ainete ja ioonide sisaldusi, arutatakse saadud tulemuse rakendatavuse üle ning osaletakse diskussioonides. Kursuse käigus arendatakse õppija arvutusoskusi, kriitilist mõtlemist (saadud tulemuste realistikkus) ja erialast suhtlemisoskust Kursuse saab läbida ainult e-kursusena, sellisel juhul töötab üliõpilane iseseisvalt vastavalt ajakavale.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: * tunneb süsihappegaasi lahustumise mõju veekeskkonnale ja oskab tuua näiteid; * teab õhu koostist ning gaaside lahustumist vees; * mõistab keemilist tasakaalu, leelisust, lahustumis- ja redoksprotsesse ning biolagunemist; * arvutab ainete sisaldusi, leelisust ja lahustuvust;  * mõistab süsiniku- ja lämmastikuringet, selgitab suuliselt aineringet; *analüüsib infot, teeb järeldusi ning esitleb neid; * selgitab ainete keskkonnamõju ja toimet inimesele ainete biolagundatavuse kompleksnäitajatele antud hinnangu alusel."}