{"KURSUSE_NIMI": "Keskkonnakeemia alused II", "KURSUSE_KOOD": "LOKT.04.075", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Keskkonnakeemia alused I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel valitakse välja moodsa elustiiliga kaasnev keemiline aine või ainete rühm, mis põhjustab keskkonnaprobleeme. Ühenditele tehakse juhendatud artikliotsing, mille analüüsi tulemusena tuuakse välja keemilised ja füüsikalised omadused, analüüsimise või töötlemisega (keskkonnast eraldamisega) seotud probleemid, allikad, levik, mõju jmt. Kursus koosneb kodusest ettevalmistusest ja aktiivsest osalemisest diskussioonides.\nKursuse jooksul tuleb koostada vähemalt kaks ettekannet ning vähemalt üks pikem kirjalik töö, mõelda loovalt ning avaldada oma arvamust. Kõigepealt on etteantud artikli ja selle andmete analüüs ja seejärel otsib igaüks oma artikli, mille töö täpne pikk kirjeldus on Moodle kursusel.  Õpime otsima teadusartiklit, keerulist teaduslikku sisu lugema, läbi töötama ja analüüsima, järeldusi tegema suuliselt ja kirjalikult, argumenteerima ja oma väiteid kaitsma. Töötame individuaalselt ja rühmas, samuti saavad üliõpilased tagasisidet nii individuaalselt kui grupina.\nKursusel hinnatakse 1-5 punkti skaalas artiklivalikut, ettekandeid, argumenteerimise oskuseid, osalemist diskussioonides ja kirjalikku eneseväljendusoskust.Objectives/eesmärkid:  Aine eesmärgiks on uurida tänapäevase eelustiiliga kaasnevat ainet või ainete rühma, mis põhjustab uudset keskkonnaprobleemi. Lisaks on on kursuse eesmärgiks kriitilise mõtlemise ja loovuse rakendamine ning erialase, keskkonnakeemilise maailmapildi täiendamine läbi diskussioonide ja  ettekannete.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - teostab teadusartikli otsingu andmebaasidest vastavalt etteantud parameetritele; - analüüsib erialast infot ja annab sellele hinnangu; - teeb ettekande teadusartikli põhjal; - osaleb diskussioonides; - kirjutab erialasel teemal artikli üldisemate teadmistega lugejale; - töötab iseseisvalt vastavalt ajakavale."}