{"KURSUSE_NIMI": "Mõõtmised ja seadus", "KURSUSE_KOOD": "LOKT.06.034", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loeng annab ülevaate mõõtmisi käsitlevast seadusandlusest (mõõteseadus ja selle rakendusaktid) ja õigusaktidest, mille rakendamine baseerub mõõtmistel (mitmesugused lubatud piirnormid, nõutavad väärtused jne). Tuuakse välja seosed EL vastavate aktidega ning käsitletakse mõõtmiste ja analüüside usaldusväärsuse tagamise võimalusi (mõõtja pädevuse hindamine, võrdlusmõõtmised).Objectives/eesmärkid:  Anda ülevaade mõõtmisi käsitlevast seadusandlusest (mõõteseadus) ja seadusandlusest, mille rakendamine baseerub mõõtmistel (mitmesugused lubatud piirnormid, nõutavad väärtused jne). Tuuakse välja seosed EL vastavate aktidega ning käsitletakse mõõtmiste ja analüüsidega seotud seadusloome trende (uued monitooritavad ained, madalamad avastamispiirid jne).Learning outcomes/õpiväljund:  Tudengil on süsteemne arusaamine: \n-- mõõtmisi käsitlevast seadusandlusest (eeskätt EL seadusandlus) ja seadusandlusest, mille rakendamine baseerub mõõtmistel (mitmesugused lubatud piirnormid, nõutavad väärtused jne). \n-- juriidilistest hoobadest kindlustamaks mõõtetulemuste usaldusväärsust. \n-- mõõtmiste ja analüüsidega seotud seadusloome trendidest (uued monitooritavad ained, madalamad avastamispiirid jne). \nTudeng oskab: \n-- oskab selgitada metroloogia, legaalmetroloogia, seaduste ja juriidiliste süsteemide põhimõisteid;\n-- kirjeldada seotud organisatsioone ja põhilisi dokumente, mis on seotud metroloogiaga;\n-- reaalelu olukordades tunda ära asjaolud, mis on seotud mõõtmistega ja seadustega ning rakendada kursusel omandatud teadmisi nendes olukorades käitumiseks;\n-- kirjeldada oma koduriigi metroloogia süsteemi ja eristada erinevate riikide süsteeme;\n-- koostada ja disainida oma uurimistöö või muu teadusliku töö esitust selgel ja efektiivsel moel."}