{"KURSUSE_NIMI": "Looduse tundmise välipraktika", "KURSUSE_KOOD": "LOLH.00.009", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 40}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Välipraktikumis ja /või seminarides tehakse praktilisi töid Eesti looduse mitmekesisuse tundma õppimiseks: määratakse selgroogsete loomade (kalad, kahepaiksed, roomajad, linnud ning imetajad) liike ja tegevusjälgi. Määratakse selgrootute  tähtsamaid rühmi (ussid, limused, lülijalgsed) ning õpitakse nende kogude koostamist. Kogutakse ja määratakse taimi ja samblikke ning õpitakse tundma tähtsaamid seeneliike. Õpitakse eristama tähtsamaid looduslikke kooslusi ning tehakse kindlaks ökoloogilisi seoseid tähtsamates kooslustes. Õpitakse määratlema ja mõõtma elusloodust enam mõjutavaid keskkonnatingimusi ning kriitiliselt ja võrdlevalt analüüsima  erinevusi ja sarnasusi, et mõista nende põhjuseid ning teha kindlaks  eluslooduse üksuste süstemaatilist kuuluvust. Tutvustatakse bioloogiaga seotud elukutseid ja karjäärivalikuid.Objectives/eesmärkid:  Viia läbi seminarid ja praktikumid välitingimustes looduse tundmaõppimiseks, keskendudes eelkõige põhikooli ja gümnaasiumi astme bioloogia ainekavaga seotud loodusobjektidele: selgroogsed, selgrootud, algloomad, taimed, samblad, vetikad, seened,  ja samblikud. Lisaks tutvustada tähtsamaid  Eesti ökoloogilisi kooslusi (metsad, niidud ja sood) ning nende iseloomulikke tunnuseid ning olulisemaid keskkonnaparameetreid ja nende mõõtmist, mis mõjutavad elusloodust. Õpetada kriitiliselt  ja loovalt mõtlema, analüüsimaks loodusobjektide ja eluslooduse taksonite tunnuste sarnasusi ja erinevusi ning mõistma nende põhjusi, et orienteeruda eluooduse süstemaatikas. Tutvustada biooogide töö spetsiifikat välitingimustes, et populariseerida bioloogiaga seotud elukutseid.Learning outcomes/õpiväljund:  1)\ttunneb põhikooli ja gümnaasiumi bioloogiakursustes käsitletavaid tähtsamaid taime, seene- ja loomaliike;\n2)\toskab kasutada dihhotoomseid ja virtuaalseid määrajaid;\n3)\toskab kasutada peamisi metoodikaid eluslooduse objektide uurimiseks;\n4)\ttunneb ära ja oskab iseloomustada tähtsamaid ökosüsteeme; \n5)\tmõistab loodusliku  mitmekesisuse  seotust ökosüsteemide jätkusuutlikkuse seisukohast lähtudes;\n6)     oskab kriittiliselt analüüsida eluslooduse protsesse ja seoseid keskkonnaga ning suudab erinevusi ja\n        sarnasusi teaduspõhiselt põhjendada ning suudab neid süstemaatiliselt määratleda;\n7)     tunneb välitõõde spetsiifikat ning ning on valmis bioloogiaga seotud elukutseid populariseerima. Õppetöö toimub 17.-120.juuni 2024."}