{"KURSUSE_NIMI": "Loovtööde juhendamine põhikoolis", "KURSUSE_KOOD": "LOLH.00.008", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 64, "individual_work": 2, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines käsitletakse põhikooli õpilaste  loovtöö kohta üldhariduskooli õppekavas ja õpilasuurimuse juhendamisega kaasnevaid pedagoogilis-psühholoogilisi probleeme. Omandatakse kompetentsus oma teadusvaldkonna uurimistemaatika alusel õpilaste loovtöö kavandamiseks ning karjäärivalikute tutvustamiseks selles valdkonnas. Omandatakse valmisolek aja planeerimiseks, koostööks  juhendatava õpilasega  ning õpilase kriitilise ja loova mõtlemise arendamiseks loovtöötöö planeerimisel ning  läbiviimisel.Objectives/eesmärkid:  Aine eesmärgiks on tutvustada põhikooli III kooliastmes läbiviidavate  loovtööde tegemise hariduslikke eesmärke ning  juhendmaterjale, loovtööde korralduslikke aspekte ning  loovtööde  teemade valimist. Antakse ülevaade loovtöö liikidest, metoodikatest, loovtöö läbiviimisest, vormistamisest, esitlemisest ja kaitsmisest. Õppeaine eesmärgiks on arendada kompetentsust õpilaste loovtöö juhendamisel ja loodusteadustega seotud karjäärivalikute populariseerimisel. Aines kujundatakse üliõpilaste üldise õpioskusena aja planeerimist õpilaste loovtööde juhendamisel, koostöö- ja kommunikatsioonioskus õpilastega suhtlemisel ning kriitilist ja loovat mõtlemist loovtöö loogilisel planeerimisel ja läbiviimisel.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: 1) mõistab loovtöö kohta üldhariduskooli õppekavas ja nende hindamist reguleerivaid õigusakte; 2) mõistab loovtöö läbiviimisega kaasnevaid probleeme ja nende pedagoogilist tausta ning oskab neid lahendada; 3) oskab toetada õpilast loovtöö sisu ja läbiviimise etappide kavandamisel ning mõistab enda rolli juhendajana; 4) mõistab teadusliku meetodi rakendamise piire loodusteadusliku sisuga loovtöö kontekstis; 5) oskab retsenseerida loovtööd ning oskab läbi viia loovtööde kaitsmist. 6) oskab aega planeerida õpilastööde juhendamisel; 7) oskab valida sobiva kommunikatsiooni- ja suhtlemise vormi juhendatavate õpilastega; 8) oskab juhendamisel kasutada ise ja arendada ka õpilaste kriitilist mõtlemist, et loogiliselt planeerida loovtööd ning seda."}