{"KURSUSE_NIMI": "Koolibioloogia II", "KURSUSE_KOOD": "LOLO.00.077", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Koolibioloogia I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Gümnaasiumi koolibioloogia kursuses antakse seostatud ja kokkuvõtlik ülevaade erinevatest bioloogiateadusharudest. Pööratakse tähelepanu tüüpiliste väärarusaamadele ning üldbioloogia teemade seostamisele igapäevaeluliste probleemidega. Elu omadused ja organiseerituse tasemed. Teaduslik uurimismeetod. Organismide koostis. Raku ehitus ja talitlus. Bakterid ja viirused. Aine- ja energiavahetus. Organismide paljunemine ja areng.  Molekulaarbioloogilised põhiprotsessid. Pärilikkus. Evolutsioon. Ökoloogia ja keskkonnakaitse. Rakendusbioloogia. Inimese talitluse regulatsioon. Lisaks akadeemilstele teadmistele kujundatakse kriitilist mõtlemist ning analüüsivõimet, mis võimaldab bioloogia-alaseid teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning välistab pseudoteaduslike seisukohtadega nõustumise.Objectives/eesmärkid:  Anda süvendatud ülevaade gümnaasiumi bioloogiakursuste sisust ja teoreetilistest põhialustest.   Tervikülevaate kujundamine elu mitmekesisuse, organismide ehituse ja talitluse, pärilikkuse, evolutsiooni  ja ökoloogia ning keskkonnakaitse  põhiprintsiipidest. Ülevaate saamine  bioloogiateaduste  põhilistest seaduspärasustest, teooriatest, praktilistest väljunditest, tulevikusuundumustest ning nendega seotud rakendustest ja elukutsetest.  Lisaks akadeemilstele teadmistele kujundatakse kriitilist mõtlemist ning analüüsivõimet, mis võimaldab bioloogia-alaseid teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning välistab pseudoteaduslike seisukohtadega nõustumise.Learning outcomes/õpiväljund:  1. tunneb gümnaasiumi  bioloogiakursuste sisu ja teoreetilisi põhialuseid;\n2. teab bioloogiaõpetuse eesmärke gümnaasiumis ja põhilisi nõutavaid õpitulemusi;\n3. oskab rakendada oma teadmisi koolibioloogia probleemide selgitamisel ja koostada vastavaid probleemülesandeid õpilastele ning kasutada uurimuslikku õpet bioloogiliste protsesside  õpetamisel;\n4. oskab seostada koolibioloogias käsitletavaid probleeme argielu ning teiste loodusteaduste probleemidega.av enam levinud väärarusaamadega koolibioloogia valdkonnas;\n5. oskab oma teadmisi rakendada nii teaduslike kui igapäevaelu probleemide lahendamisel, põhjendamisel ning otsuste tegemisel ning on võimeline kriitiliselt analüüsima erinevaid pseudoteaduslikke seisukohti ning neid ümber lükkama."}