{"KURSUSE_NIMI": "Bioloogia didaktika", "KURSUSE_KOOD": "LOLO.00.060", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Koolibioloogia I", "Loodusteaduste didaktika I", "Koolibioloogia II", "Õppimist toetav õpetamine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 5, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 91, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Süsteemne käsitlus bioloogia õpetamise teooriast. Antakse ülevaade bioloogia õpetamise eesmärkidest, õppekavadest, programmidest, õppemeetoditest ja -vormidest. Omandatakse erinevate koolitüüpide õppekavade ja programmide koostamise oskused. Tutvutakse bioloogia õppekavade ja -vahenditega erinevates riikides. Seminarides õpitakse koostama bioloogia õppekavasid ja programme ning erinevate klasside tunnikonspekte. Viiakse läbi bioloogiatunde ning õpitakse neid analüüsima. Pööratakse tähelepanu didaktiliste vahendite kasutamisele ning enam levinud metoodilistele vigadele. Kujundatakse õpetajatele vajalikke kompetentsusi nagu tunni planeerimine ja läbiviimine; oma ja kaasüliõüilaste töö reflekteerimine ja analüüs; koostöö- ja kommunikatsioonioskused, ajaplaneerimine ja karjääri planeerimise oskused. Arndatakse üliõpilaste pedagoogilisi oskusi ning pädevusi: kriitiline ja loov mõtlemine, probleemi lahendamine, põhjendamine ja otsuse tegemine;  uurimuslikud oskused.Objectives/eesmärkid:  Anda ülevaade bioloogia didaktikast, õpetamise metoodikast ja sellega kaasnevast temaatikast ja luua  koolibioloogia teoreetiline ja praktiline alus õpetajakoolituses osalevate loodusteaduslike erialade üliõpilastele bioloogia õpetamiseks üldhariduskoolis. Kujundada positiivne ja enesekriitiline suhtumine õpetaja ametisse. Kujundada õpetaja kutsetandardis ettenähtud oskusi: tunni planeerimine ja läbiviimine; oma ja kaasüliõüilaste töö reflekteerimine ja analüüs; koostöö- ja kommunikatsioonioskused, ajaplaneerimine ja karjääri planeerimise oskused. Kujundada üliõpilaste pedagoogilisi oskusi  ning pädevusi: kriitiline ja loov mõtlemine, probleemi lahendamine, põhjendamine ja otsuse tegemine;  uurimuslikud oskused.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:\n1. Saab ülevaate bioloogia didaktikast, õpetamise metoodikast ja sellega kaasnevast temaatikast. \n2. On loodud koolibioloogia teoreetiline ja praktiline baas õpetajakoolituses osalevate loodusteaduslike erialade üliõpilastele.\n3. Suhtub õpetaja ametisse positiivselt ja on adekvaatselt enesekriitiline selle suhtes ning oskab planeerida oma karjääri;\n4. Omab kutsetandardis ettenähtud oskusi: tunni planeerimine ja läbiviimine; oma ja kaasüliõüilaste töö reflekteerimine ja analüüs; koostöö- ja kommunikatsioonioskused, ajaplaneerimine ja karjääri planeerimise oskused.\n5. On omandanud üldoskused: kriitiline ja loov mõtlemine, probleemi lahendamine, põhjendamine ja otsuse tegemine;  uurimuslikud oskused."}