{"KURSUSE_NIMI": "Loodusteaduste didaktika I", "KURSUSE_KOOD": "LOLO.00.074", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Õppimist toetav õpetamine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 6, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine annab ülevaate loodusteadusliku hariduse olemusest ning paradigmaatilistest suundumustest rahvusvaheliste võrdlusuuringute taustal. Omandatakse teadmised ja oskused loodusteadusliku kirjaoskuse tasemete hindamiseks ning loodusvaldkonna õppekava tõlgendamiseks ja rakendamiseks. Kogutakse tõendusmaterjali õpilaste arusaamade kujunemisest  ning koostatakse selle alusel metoodilisis soovitusi.  Käistletakse relevantse õpetamise strateegiaid, mis on suunatud kõrgemat järku mõtlemist nõudvate oskuste kujundamisele. Omandatakse oskus koostada loodusteadsuliku kirjaoskuse tasmeeid hindav test elektroonses keskkonnas.Objectives/eesmärkid:  Omandada  teadmised  loodusteaduste õpetamise paradigmaatilisetest muutustest  ning oskused neid muutusi koostöös teiste üliõpilastega kriitiliselt analüüsida  nii rahvusvahelisel kui kohalikul tasandil, samuti  interpreteerida rahvusvaheliste võrdlusuuringute tulemusi ja selle alusel kavandada nii  õpilastele relevantset õpetamist kui hindamist: - arendada oskust tunda ara ja lahendada probleeme igapäevaeluslistes  situatsioonides;  - arendada digipädevusi läbi  loodusteadusliku kirjaoskuse taset hindava  testi koostamise  elektroonses keskkonnas; - omandada oskused loodusteadustega seotud karjääriteadlikkuse kujundamiseks  - kujundada oskused omandatud  teadmisi ja oskusi reflekteeridaLearning outcomes/õpiväljund:  1. Saab aru loodusteadusliku hariduse olemusest, oskab sõnastada õpetamise eesmärke ning õpitulemusi.\n2. Oskab selgitada loodusteadusliku kirjaoskuse tähendust, selle erinevaid tasandeid ja seotust üldhariduskooli õppekavas esitatud kompetentsustega.\n3. Omab ülevaadet paradigmaatilistest muutustest loodusainete õpetamisel ning oskab analüüsida ja  hinnata loodusainete õpetamisega seonduvaid probleeme Eestis ja rahvusvaheliselt ning prognoosida edasiste muutuste suunda.\n4. Omab ülevaadete rahsvusvahelistest võrdlusuuringutest ning oskab  anda neile põhjendatud  kriitilise hinnangu ning kavandada hindamist.\n6. Omab ülevaadet õpilaste arusaamade kujunemisest, oskab koguda selle kohta  koostöös teistega tõendusmaterjali  ja  koostada  meeskonnatöös metoodilisi soovitusi õpetamiseks aj õppetöö kavandamiseks\n7. Oskab koostada loodusteadusliku kirjaoskuse tasemeid hindava  testi  ülesandeid  elektroonses keskkonnas ja interpreteerida  nende tulemusi.\n8. Tunneb ära probleeme igapäevaelulistes situatsioonides ja kavandab nende alsuel õpilastele relevantset õpet\n9. Koostab refelekteeriva portfolio ."}