{"KURSUSE_NIMI": "Loodusteaduste pidev praktika", "KURSUSE_KOOD": "LOLO.00.072", "EAP": 1, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Õppimist toetav õpetamine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ainekursus toetab üliõpilase professionaalset arengut, luues võimalused seostada valdkonna- ja ainedidaktikaga seotud pädevused õpetamisega mitteformaalses õppekeskkonnas. Õppetöö viiakse läbi Teaduskeskuses AHHAA ja sisaldab pidevat tagasisidet sealsetelt tegevusjuhendajatelt. Ainekursusel kavandavad üliõpilased töötoa, mille viivad läbi Teaduskeskuses AHHAA ja ning kursuse lõpus koostavad enesereflektsiooni, milles toovad esile, kuidas seostada mitteformaalhariduse hariduse kontekstis omandatu formaalharidusega.Objectives/eesmärkid:  1) toetada üliõpilase kujunemist õpetajaks mitteformaalses õppekeskkonnas, võimaldades ülikoolis toimuvate aineõpingute ning valdkonna- ja ainedidaktika õpingute pidevat seostamist õpetaja tegevusega erinevates õppeasutustes; 2) anda üliõpilastele võimalus täita õppeülesandeid koolivälises õppeastuses erinevatele sihtgruppidele; 3) kujundada tulevastes õpetajates oskust reflekteerida oma õpetamiskogemust seostades mitteformaalses keskkonnas õpetamise kogemuse formaalõppes toimuvaga.Learning outcomes/õpiväljund:  1) oskab planeerida õppeprotsessi, õpetada ja analüüsida õpetamist mitteformaalses õppekeskkonnas, arvestades õppija eriala, eelteadmisi ja huvisid; 2) oskab oma kogemustele tuginedes analüüsida oma õppeaine või valdkonnaga seotud pädevust, oskusi ja vajadusi, et kavandada oma edasisi tegevusi professionaalseks arenguks; 3) oskab reflekteerida oma pedagoogilist kogemust, sidudes mitteformaalses õppekeskkonnas omandatud õpetamiskogemuse formaalhariduses toimuvaga."}