{"KURSUSE_NIMI": "Üld- ja käitumisgeneetika", "KURSUSE_KOOD": "LOMR.03.025", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 4, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käesoleva 3- punktilise lursuse raames toimub 8 kohtumist, kuulata on võimalik ettesalvestatud loenguid, sooritada harjutusülesandeid, arutelusid ning iseseisva töö ettekanded.\nTeemad on järgmised:\n1.Sissejuhatus geneetikasse. Ajalooline perspektiiv. Geneetika põhimõisted\n2. Geenid ja kromosoomid. Autosoomid ja sugukromosoomid. Pärandumise põhialused\n3. Geenide avaldumine. Epigeneetika\n4. Muudatused pärilikus materjalis ja nende avaldumine ning mõju fenotüübile\n5. Monogeensed ja komplekstunnused. Keskkonna mõju tunnuste avaldumisele\n6. Käitumisgeneetika kujunemine. Käitumisgeneetika uurimismeetodid ning teemakohased harjutused\n7. Intellektipuue ja selle monogeensed põhjused\n8. Psüühika- ja käitumishäired ja nende geneetilised põhjused\n9. Neuropsühhiaatrilise genoomika meetodid ja arengusuunad Eestis ja maailmas\n10. Käitumisgeneetika osa kokkuvõte, praeguseks kindlakstehtud põhiprintsiibid\nÕppeainel ei ole eeldusaineid, mistõttu antakse kursuse raames ülevaade geneetika põhitõdedest piisavalt üldisel tasemel ning mahus, mis on vajalik käitumisgeneetika temaatika mõistmiseks.Objectives/eesmärkid:  1. Omandada põhiteadmised pärilikkusest ja muutlikkusest. 2. Osata geneetika-alaseid teadmisi interpreteerida inimese tunnuste kontekstis 3. Mõista geneetika osa inimese käitumise kujunemiselLearning outcomes/õpiväljund:  1. Omandada geneetika põhitõed, mõista geneetilisi seaduspärasusi  2. Omandada oskus seostada tänapäeva geneetika põhimõtteid ja teadmisi käitumise ja psühholoogia-alaste küsimuste käsitlemisel 3. Mõista ja selgitada käitumisgeneetika-alaste uuringute tulemusi Arendada õppija võimekust geneetika valdkonna teaduskirjanduse otsimisel ja lugemisel ning loetu kokkuvõtte esitamisel kaasõppijatele Käesolev õppeaine on üles ehitatud eeldusel, et üliõpilased ei ole eelnevalt läbinud geneetika sidusaineid (biokeemia, rakubioloogia, molekulaarbioloogia, arengubioloogia). Seepärast asetatakse rõhk geneetiliste nähtuste selgitamisele läbi põhimõtteliste toimeskeemide. Antakse ülevaade klassikalisest ja tänapäevasest geneetikast. Tutvustatakse käitumisgeneetika uurimismeetodeid. Põhirõhk asetatakse inimesega seonduvale."}