{"KURSUSE_NIMI": "Inimese anatoomia ja füsioloogia (koos praktikumiga)", "KURSUSE_KOOD": "LOMR.09.032", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus sisaldab üldise anatoomia ja füsioloogia aluseid ning annab ülevaate inimese peamiste organsüsteemide (toes, lihaskond, seede-, katte-, ringe-, hingamis-, sisesekretsiooni- ja kuse-suguelundkond, närvi- ja lümfisüsteem) ehitusest ja talitlusest. Käsitluses rõhutatakse talitluse seotust kindlate anatoomiliste struktuuridega.Objectives/eesmärkid:  Aine on sissejuhatuseks inimese ja ka teiste selgroogsete organismide ehituse ning talitluse tundmaõppimisel.Learning outcomes/õpiväljund:  Aine läbimisel üliõpilane: 1.Teab olulisemaid makroanatoomilisi termineid eesti või ladina keeles (luud, lihased, ajuosad) ja oskab nendega kirjeldada organismi ehitust.  2.Tunneb mõningate organite mikroanatoomilisi ehitusprintsiipe ja oskab neid seostada talitlusega.  3.Teab peamiste füsioloogiliste protsesside looduteaduslikku alust ja oskab seletada elundkondade talitlust. Inimese anatoomia füsioloogia (LOMR.09.032) õppetöö korraldus 2025. aasta  kevadsemestril. \n\nTeoreetilise osa õppetöö toimub Moodle-kesksena. \n\nLoengud:\n1.\tTeisipäeviti avanevad eelsalvestatud videoloengud Moodle lingi kaudu vastavalt loengukavale.\n2.\tPeale kontaktõppet lisan vajadusel materjalid Moodle'sse toimumise nädalal.\n3.\tTeemasid ja küsimusi, millede käsitlemist sooviksite kontaktõppel, ootan toimumiseelse nädala komapäeva südaööks Moodle foorumi kaudu või emailile. \n\nTestid:\n1.\tKursusel on 7 harjutustesti, mis on mõeldud iseseisvaks õppimiseks. Need tuleb  eksamile pääsemiseks 100% lahendada. \n2.\tTestid avanevad peale vastava materjali käsitlemist loengus ja jäävad avatuks semestri lõpuni. Testi materjalide põhjal on koostatud  eksamitest.\n\nPraktikumid:\n1. Praktikumid toimuvad 29. - 38. õppenädalal. \n2. Praktikumide eest saate hinde, mis on osa lõpphindest.\n\nEksam:\nEksam koosneb eksamitestist ja kirjalikust eksamitööst.\n1. Eksamitest (kuni 50% lõpphindest) sisaldab valikvastustega küsimusi.\n2. Kirjalikus eksamitöös (kuni 50% lõpphindest) peab üliõpilane ladusalt ning loogiliselt kirjeldama mõnda inimese füsioloogilist protsessi ja selle struktuurseid aluseid.\n\nLõpphinne:\nKujuneb praktikumide hinde (A) ja teoreetilise osa hinde (B) aritmeetilise keskmisena."}