{"KURSUSE_NIMI": "Mikrobioloogia II", "KURSUSE_KOOD": "LOMR.03.020", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Mikrobioloogia I", "Biokeemia I", "Geneetika I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse bakterite toitumist ja energeetikat, sekundaarmetaboliitide (antibiootikumide) sünteesi ja taluvust, sh resistentsuse mehhanisme. Tutvustatakse spetsiifilisi toitumistüüpe ja metabolismiradu: suhkrute kääritamine, kemolitoautotroofia, bakteriaalne fotosüntees, anaeroobne hingamine, õhulämmastiku sidumine jne. Tutvustatakse lühidalt ka inimese eri kehapiirkondade mikroobikooslusi. Viirustele pühendatud loengutes käsitletakse viiruste geneetilist mitmekesisust, süstemaatikat ja  infektsioonitsükleid baktereid nakatavate viiruste- bakteriofaagide - näitel.Objectives/eesmärkid:  Anda baasteadmised prokarüootide metabolismist ja energeetikast, mikroobidega laboris töötamisest ning viiruste geneetilisest mitmekesisusest ja süstemaatikast.Learning outcomes/õpiväljund:  Üliõpilased peaksid loengujärgselt orienteeruma prokarüootide energeetilise metabolismi mitmekesisuses, tundma ATP sünteesi mooduseid, toitumistüüpe, tsentraalseid katabolismiradu ja  käärimisradasid.  Nad peaksid suutma rakendada neid teadmisi ka igapäevaelus. Üliõpilased peaksid omandama baasteadmised viiruste geneetilisest mitmekesisusest ja süstemaatikast. Loengutes osalemine ei ole kohustuslik, kuid väga soovituslik. Õppeaine materjalid pannakse kursuse Moodle keskkonda. Loengud sisaldavad valdavalt ka interaktiivset komponenti, võimalik on õppejõult küsimusi küsida jmt. Loengud toimuvad võimalusel auditoorselt. Äärmisel erivajadusel toimuvad loengud Moodle keskkonnas BigBlueButton loenguruumis. Osad reedesed loenguajad on mõeldud materjali kordamiseks ja iseseisvalt Moodle testide lahendamiseks ning auditoorset loengut ei toimu. Info toimumiste kohta on olemas ajakavas ja Moodle kalendris. Muutustest loengute toimumise osas teavitab õppejõud vähemalt 24 h ette infokirja kaudu.\nEksami mõlemad osad toimuvad ÕIS-is märgitud aegadel auditoorselt. Eksam on avatud materjalidega, kuid individuaalne. Teiste õppijatega eksamil mistahes vormis konsulteerida ei ole lubatud!"}