{"KURSUSE_NIMI": "Geneetika harjutused", "KURSUSE_KOOD": "LOMR.03.009", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Geneetika I", "Kõrgem matemaatika I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 36, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Praktikumis harjutatakse tekstülesannete lahendamist, andmete leidmist tekstist ning valemite koostamist teksti põhjal. Harjutatakse definitsioonide loomist nii klassikalise geneetika mõistete järgi, kui ka juhuslikult valitud objektidele, nähtustele ja seostele. \nTekstülesanded on koostatud klassikalise geneetika põhjal järgnevatel teemadel: mono- ja dihübriidne ristamine; geenide koostoime tunnuse määramisel; suguliitelised tunnused; aheldunud geenid; segatüüpi ülesanded. Kasside karva värvuse geneetiline määratus.\n\nKoduse tööna on vaja määrata kassi karvastiku värvuse ja mustri geneetiline määratus kümnel kassil. Selle abil õpitakse geenide koostoimet ning õpitakse välistamise tehnikat.\n\nPraktikumis lahendatakse näidisüledandeid. Põhiline õppimine toimub iseseisvalt kodus, lahendades selleks ülesandeid \"Geneetika ülesannete\" kogumikust ja e-testidest. Iga teema kohta on Moodle's koostatud e-test, mis peab olema sooritatud järgmiseks praktikumiks100 protsendile. Testi saab teha enne tähtaega nii palju kordi ja nii kaua, kui on 100 % saavutamiseks vajalik. E-testide abil toimub praktikumis kuuldu kinnistamine ning õppimine. \n\nEksamile pääsemiseks on vajalik sooritada kõik e-testid ja määrata iseseisvalt 10 kassi genotüüp. Lõplik hinne kujuneb eksami hindest.Objectives/eesmärkid:  Arendada klassikalise geneetika baasil koostatud probleemülesannete lahendamist, teksti funktsionaalset lugemist ning matemaatika rakendamist probleemülesannete lahendamiseks.Learning outcomes/õpiväljund:  Suureneb tekstülesannete lahendamise oskus, matemaatika kasutamine probleemülesannete lahendamisel ning kinnistub arusaam klassikalise geneetika mõistetest. Paraneb nähtuste ja nendevaheliste seoste defineerimisoskus. Praktikumis lahendatakse ülesandeid paberil kirjutusvahendiga. Vajalik on taskuarvuti. Arvutite ja muude nutisedmete kasutamine pole lubatud. \n\nAbimaterjalide kasutamine eksamil pole lubatud."}