{"KURSUSE_NIMI": "Molekulaarbioloogia", "KURSUSE_KOOD": "LOMR.05.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 50, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate molekulide struktuuri ja funktsioonide seostest kolmes põhilises geneetilise informatsiooni ülekande protsessis: replikatsioon, transkriptsioon ning translatsioon. Teisi geneetilisi mehhanisme (näiteks DNA rekombinatsioon ja reparatsioon, RNA protsessimine, regulatiivsed RNAd, ribosoomide ehitus, valkude stabiilsus) käsitletakse näidete varal lähtudes struktuuri ja funktsiooni seostest.Objectives/eesmärkid:  Kursuse põhieesmärk on anda süsteemsed teadmised päriliku informatsiooni säilitamise ja ülekande mehhanismidest.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane - selgitab molekulide struktuuri ja funktsiooni vahelisi seoseid - tunneb päriliku informatsiooni säilitamise mehhanisme - selgitab kuidas geeniekspressioon on reguleeritud transkriptsiooni ja transkriptsiooni järgsetel tasemetel - oskab kasutada omandatud teadmisi järgnevates bioloogia ainekursustes  - kasutab korrektselt eesti keelset terminoloogiat Seminarid toimuvad kahes rühmas (eraldi rühm Geenitehnoloogia õppekava üliõpilastele (Rühm 1) ja eraldi rühm Bioloogia ja elustiku kaitse õppekava üliõpilastele (Rühm 2), põhjuseks teie tihe tunniplaan). Juhul kui üliõpilasel ei ole võimalik seminaris osaleda, siis on võimalik seminari järele vastata 1 nädala jooksul pärast seminari toimumist. Selleks tuleb seminaris arutatud küsimustele ja ülesannetele kirjalikul vastata (vastused esitatakse käsitsi kirjutatult).\n\nKonsultatsioon toimub 6. jaan. 2025\n\nEksamid toimuvad 8. jaan. 2025 algusega kell 10.15 ja 14.15\n\nVajalik on eksamile registreerimine ÕIS-is.\n\nSuuline eksam toimub neile, kes saavad kirjalikul eksamil vähemalt 81% maksimumpunktidest ning soovivad sooritada eksamit hindele A. Suulise eksami toimumise ajad lepitakse kokku pärast kirjaliku eksami sooritamist."}