{"KURSUSE_NIMI": "Rändav bioklass", "KURSUSE_KOOD": "LOMR.01.007", "EAP": 1, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 14}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus valmistavad tudengid ette vajalikud õppematerjalid teoreetilise ja praktilise osa läbi viimiseks gümnaasiumi õpilastele. Ette valmistatud meterjalide alusel viivad tudengid iseseisvalt läbi geneetika/biotehnoloogia alase koolituse mõnes Eesti gümnaasiumis. Aine läbimsieks peab üliõpilane olema osalenud kolme gümnaasiumi külastusel ja selle ette valmistamisel.Objectives/eesmärkid:  Bioõppekavade üliõpilaste teoreetiline ja praktiline ettevalmistus gümnaasiumiõpilastele tänapäevaste molekulaarbioloogia ja geenitehnoloogia labori töövahendite ja DNA eksperimentide tutvustamiseks. Aine läbimiseks peab tudeng omanadama kõik vajalikud meetodid, et gümnaasiumiõpilastele õpetada lihtsamaid geneetika ja biotehnoloogia aluseid ja tudeng peab käime vähemalt kolmel korral koolides õpilasi õpetamas. Aine on vajalik geenitehnoloogia ja bioloogia õppekavade tutvustamiseks ja populariseerimiseks koolides.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane:\n1.\tOmandatab oskuse komplekteerida õppematerjalid ning  koostada praktiliste tööde juhend\n2.\tOmandatab oskuse ette valmistada ja läbi viia 4 tunnise praktikumi sissejuhatav loenguline osa kekskkooli õpilasele\n3.\tOmandatab oskuse ette valmistada ja läbi viia keskkolli õpilasele 4 tunnise praktikumi praktiline osa (DNA hulga määramine, PCR, elektroforees)\n4.     On võimeline ette valmistama ja läbi viima keskkooli õpilaste praktilist ja teoreetilist tundi.\n5. On võimeline analüüsima oma gümnaasiumi õpilaste õpetamise kvaliteeti ja end selles osas täiendama.\n6. Suudab, tagasiside järgi, analüüsida oma praktilise töö juhendit ja seda täiendama/parandama."}