{"KURSUSE_NIMI": "Rakubioloogia praktikum", "KURSUSE_KOOD": "LOMR.06.003", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Rakubioloogia", "Rakubioloogia II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 32, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Rakkude ja rakuorganellide spetsiifilised värvimismeetodid. Erinevad rakutüübid. Rakuliste protsesside analüüs (mitoos, meioos, rakkude suremine).Objectives/eesmärkid:  Rakubioloogia praktikumi eesmärgiks on tutvuda ja saada kogemusi põhiliste rakubioloogias kasutatavate uurimismeetodite ja aparatuuri osas ning õppida praktiliste tööde tulemusi korrektselt dokumenteerima.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - teab põhilisi valgusmikroskoopia liike ja nende tööpõhimõtet; oskab käsitseda lihtsamat valgusmikroskoopi; oskab valmistada ja vaadelda mikroskoobi preparaati - teab transmissioonelektronmikroskoopia põhimõtet ja tunneb ära elektronmikroskoopiliste piltidel erinevaid rakustruktuure - omab ettekujutust loomsete rakukultuuridega töötamisest; oskab eristada põhilisi rakutüüpe ja kirjeldada rakukultuuri seisundit (rakkude elulemus, rakukultuuri tihedus, kontaminatsioon) - tunneb põhilisi rakkude elulemuse määramise meetodeid - oskab hematsütomeetri abil määrata rakkude arvu koekultuuri tassil  - teab ja oskab põhilisi rakkude fikseerimine ja värvimise metoodikad - tunneb läbivoolutsütomeetria meetodi põhimõtet; saab aru graafilisel kujul esitatud tulemustest ja oskab neid analüüsida apoptootiliste rakkude detekteerimise näitel - teab, kuidas praktiliste tööde tulemusi korrektselt dokumenteerida (laboripäevik) ja oskab hinnata selle vajalikkust. Praktikumides saab osaleda tingimusel, et iga praktikumi alguses on praktikumi teema mõistmiseks vajalike eelteadmiste kohta positiivselt sooritatud lühitest Moodle'is (max 10 min). Vajalikud juhised saavad registreerunud osalejad jooksvalt. Praktikumi teemasid käsitlev materjal ja juhendid on kättesaadavad osalejatele Moodle'is.\nMuutustest õppetöö toimumise osas ja muu olulise info teavitab õppejõud Moodle'i teadete foorumi kaudu. Kiireloomulisemad teavitused saadetakse ÕISi kaudu. Igal juhul on soovitav kontrollida ÕISis, millisele e-maili aadressile on teavitused seadistatud."}