{"KURSUSE_NIMI": "Mikroobifüsioloogia", "KURSUSE_KOOD": "LOMR.03.022", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Geneetika I", "Mikrobioloogia II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate bakterite talitluse üldistest seaduspärasustest ja põhimõistetest. Käsitletakse bakterite ainevahetust, kasvu- ja arengufüsioloogiat, keskkonna muutuste toimet organismi kui terviku funktsioonile, stressifüsioloogiat. kirjeldatakse protsesse, mis toimuvad rakkude jagunemisel. Rõhku on pandud geenide ekspressioonile ning ekspressiooni regulatsioonile lähtuvalt bakteri füsioloogiast. Andakse ülevaade raku membraanide ehitusest ja funktsioonidest. Käsitletakse ainete transporti ja kirjeldatakse erinevaid sekretsioonisüsteeme. Käsitletakse kvoorumi tunnetamisega seotud füsioloogilisi muutusi bakterirakus. Selgitatkse, millised muutused toimuvad stressi tingimustes kasvavates bakterites. Iseloomutatakse füsioloogiliste protsesside geneetilistregulatsiooni erinevates kasvutingimustes.Objectives/eesmärkid:  Kursuse põhieesmärk on anda ülevaade füsioloogilistest protsessidest, mis toimuvad bakterirakus ja tagavad tema normaalse elutegevuse ja jagunemise. Soodustada tudengite iseseisvat mõtlemist ning kaasa aidata laiapõhjalisele arusaamisele mikroobide talitlusest. Tegemist on interdistsiplinaarse ainega, mis seob mikrobioloogiat, geneetikat ning biokeemiat.Learning outcomes/õpiväljund:  Kursuse läbimise järel on tudengil ettekujutus bakterites toimuvatest füsioloogilistest protsessidest ja regulatsioonimehhanismidest, mis kontrollivad nende protsesside toimumist erinevates kasvukeskkondades ja tingimustes. Tudeng saab aru protsessidest, mis toimuvad bakterites erinevate kasvufaaside ajal, energia tootmisest ning selle kulutamisest. Lisaks saab aru bakterite toimimisest populatsioonis, planktiliste ja sessiilsete rakkude kollektiivsest käitumisest. Kursus annab baasteadmised bakterite kasutamiseks mitesugustel rakendusaladel (nt rakuvabrikud). E-kirjadele vastatakse tööpäevadel ja tööajal."}