{"KURSUSE_NIMI": "Rakubioloogia I", "KURSUSE_KOOD": "LOMR.06.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antakse ülevaade pro- ja eukarüoodi raku struktuurist, peamiste organellide (tuum, tuumake, kloroplast, mitokonder, tsütoplasmavõrgustik, Golgi kompleks, lüsosoom, peroksüsoom, proteasoom) ehitusest, koostisest ja nendes toimuvatest protsessidest, erinevate kompartmentide omavahelistest seostest. Käsitletakse membraanide ehitust ja koostist, membraanitranspordi põhiküsimusi, tsütoskeleti komponente (mikrofilamendid, mikrotorukesed, nende mootorvalgud) ja nende funktsioone rakus. Antakse ülevaade rakutsüklist ja selle regulatsioonist, samuti rakkude koostise ja ehituse uurimiseks kasutatavatest meetoditest.Objectives/eesmärkid:  Anda ülevaade pro- ja eukarüoodi raku struktuurist, organellide ehitusest, funktsioonidest ning seostest rakus.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane:\n1.Tunneb rakuteooria põhipostulaate;\n2.Oskab kirjeldada pro- ja eukarüoodi raku struktuurse ja keemilise koostise ning geenide ehituse ja ekspresseerumise peamisi iseärasusi ;\n3. Oskab kirjeldada membraanide ehitust ja kuidas membraanide vahendusel toimub raku erinevate piirkondade ainevahetuse seostumine omavahel ja väliskeskkonnaga;\n4. Oskab anda ülevaate organellide ehitusest ja seal toimuvatest spetsiifilistest protsessidest;\n5. Oskab seletada mitoosiprotsessi, mikrotorukeste ja nende mootorvalkude osa mitoosis ning rakutsükli regulatsiooni;\n6. Oskab kirjeldada peamisi rakubioloogias kasutatavaid meetodeid (erinevad mikroskoopia ja kromatograafia liigid, läbivoolutsütomeetria, antikehade kasutamine jt); Loengutes/seminarides vastab õppejõud aine teemadega seotud küsimustele, harjutatakse teemade seostamist, näidisülesandeid.\nAinele registreerunud lisatakse ÕISi kaudu Moodle'i kursusele.\nMuutustest õppetöö toimumise osas ja muu olulise info teavitab õppejõud Moodle'i teadete foorumi kaudu. Kiireloomulisemad teavitused saadetakse ÕISi kaudu. Igal juhul on soovitav kontrollida ÕISis, millisele e-maili aadressile on teavitused seadistatud."}