{"KURSUSE_NIMI": "Toiduainete mikrobioloogia", "KURSUSE_KOOD": "LOMR.03.006", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Mikrobioloogia II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ülevaade toiduainete tootmisest mikroorganismide abil. Toiduainete riknemist ja toidumürgitusi põhjustavate mikroorganismide iseloomustamine.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade mikrobioloogilisel fermentatsioonil toodetud toiduainetest, toiduainete mikrobioloogilisest riknemisest ja toidumürgistusi põhjustavatest patogeenidest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Peale kursuse läbimist peaks üliõpilasel olema ülevaade mikroorganismide kasutamisest toidutööstuses. Nad peaksid oskama hinnata toiduainete mikrobioloogilise ohutuse tähtsust ja suutma iseloomustada toiduga levivaid patogeenseid mikroorganisme, mis võivad tekitada toidumürgistusi. Loengud ja seminarid toimuvad võimalusel auditoorselt. Kui loenguid ei ole mingil põhjusel võimalik auditoorselt läbi viia, siis toimub õpe Moodles BigBlueButtoni vahendusel. Ajakohastatud loenguslaidid pannakse Moodle'sse. Slaididele on lisatud selgitavat materjali ja lisainfot. Lisatud on asjakohaseid videolinke ja linke artiklitele. Aines saadud teadmisi saab kinnistada ja testida Moodle enesekontrollitestide abil. \nKursuse teises pooles toimuvad seminarid toimuvad auditoorselt või tööstustes kohapeal. Võimalusel toimuvad õppekäigud/seminarid tootmisettevõtetes. Seminarides käsitletavate probleemülesannete ja nende esitamise juhend antakse Moodle kaudu. Töö esitamise tähtajaks on 6. märts kell 17:00. Eksam toimub auditoorselt. Enne eksamit on soovijatel osaleda veebikonsultatsioonil õppejõuga.\nKõigist korralduslikest muudatustest annab õppejõud teada ÕISi infokirja ja Moodle foorumi kaudu vähemalt 24 h varem."}