{"KURSUSE_NIMI": "Mikroobide süstemaatika ja mitmekesisus", "KURSUSE_KOOD": "LOMR.03.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Mikrobioloogia I", "Mikrobioloogia II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb loengutest, seminaridest ja iseseisvast tööst (sh seminari ettevalmistamine). Käsitletakse bakterite taksonoomilisi rühmi, klassifitseerimise teoreetilisi aluseid ja mikroobide identifitseerimist. Antakse ülevaade kaasaegsest süsteemist ja mikroobide mitmekesisusest. Seminarides koostab iga üliõpilane ettekande uue bakteri või arhe liigi (või perekonna) kirjeldamise kohta ja kannab selle ka ette. Iga üliõpilane on retsensendiks ühele kaasüliõpilase ettekandele. Ettekanne koostatakse võõrkeelse (enamasti inglisekeelse) teadusliku artikli baasil. Selleks pannakse Moodle kausta artiklid, mille hulgast üliõpilased saavad endale valida teema. Üliõpilane võib artikli ka ise otsida.Objectives/eesmärkid:  Eesmärgiks on anda ülevaade prokarüootide (bakterite ja arhede) süstematiseerimise alustest ja bakterite ning arhede mitmekesisusest eluslooduses.Learning outcomes/õpiväljund:  Kursuse lõppedes on üliõpilastel ülevaade sellest, kuidas iseloomustatakse baktereid ja arhesid ja milliste kriteeriumide alusel neid süstematiseeritakse. Nad omandavad ülevaate kaasaegsest prokarüootide süsteemist, õpivad seminaride ettevalmistuse käigus läbi töötama asjakohast teaduskirjandust, otsima lisamaterjali ning koostama ja esitama teaduslikku ettekannet slaidikava vormis. Ettekanded on uute bakterite või arhede liikide (või teiste taksonite) kirjeldamisest. Üliõpilased osalevad ettekannete hindamisel. Loengud ja seminarid toimuvad võimalusel auditoorselt. Auditoorselt (või erandkorras BigBlueButtoni vahendusel) toimuvad olulisemaid teemasid kokkuvõtvad loengud. Põhjalikum konspekt koos näidetega on esitatud eraldi slaidikavadena, kuhu on lisatud selgitavat materjali, asjakohaseid videolinke ja linke artiklitele. Loengutesse sissejuhatuseks on Moodles praktilisema suunitlusega lühiülesanded või -küsimused, mida on soovitav lahendada enne vastavat loengut. \nKäsitletavate teemade kohta on tudengitel võimalik teadmisi kinnistada ja testida Moodle enesekontrollitestide abil. \nKontrolltöö toimub Moodle testi vormis etteantud aegadel kursuse keskel. Saab valida kahe aja vahel. Kontrolltöö tegemine on kohustuslik.  \nSeminariteemad ja nende esitamise juhend antakse Moodle kaudu ja infot saab loengutes. Seminarid, kus tudengid esitavad iseseisva tööna koostatud ettekandeid, toimuvad auditoorselt. \nEksam toimub auditoorselt. Enne eksamit on võimalik osaleda e-konsultatsioonil õppejõuga.\nKõigist korralduslikest muudatustest annab õppejõud aegsasti teada ÕISi infokirja ja Moodle foorumi kaudu. Ajakava on lisatud Moodle kalendrisse."}