{"KURSUSE_NIMI": "Viroloogia", "KURSUSE_KOOD": "LOMR.04.001", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Molekulaarbioloogia", "Geneetika I", "Geneetika II", "Mikrobioloogia II"], "SOOVITUSLIKUD_EELDUSAINED": ["Immunoloogia ja immunogeneetika", "Rakubioloogia I"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Viirused ja viroloogia. Üheahelalise DNA genoomiga viirused (geminiviirused, parvoviirused) ja väikesed kaheahelalise DNA genoomiga viirused (polüoomi ja papilloomiviirused). Adenoviirused. Alfa-, beta ja gamma herpesviirused. Suured DNA genoomsed viirused - baculoviirused, phycodnaviirused ja mimiviirus. Poksviirused. Positiivsed RNA viirused - picornaviirused, togaviirused, flaviviirused, hepatiidi viirus C ja coronaviirused. Taimede ja putukate RNA viirused. Kaheahelalise RNA genoomiga viirused - LA viirus ja reoviirused. Negatiivsed RNA viirused - rhabdoviirused, paramyxoviirused, filoviirused, orthomyxoviirused, bunyaviirused ja arenaviirused. Retroviirused, HIV. Pareretroviirused. Subviraalsed patogeenid - satelliidid, viroidid ja prionid-Objectives/eesmärkid:  anda üliõpilastele ülevaade viiruste maailma mitmekesisusest, viirus-infektsioonide põhimehhanismidest, viirus-peremees interkatsioonidest ja viirus-indutseeritud patogeneesi molekulaarsetest alustestLearning outcomes/õpiväljund:  Peale kursuse läbimist üliõpilane: - teab viiruste põhirühmasid - saab aru viiruste geneetilise mitmekesisuse põhjustest ja selle tagajärgedest - mõistab viiruste rolli bioloogilistes protsessides - tunneb peamiste mudelviiruste omadusi - virionide ja genoomide ehitust, infektsioonitsüklit - saab aru viirusliku patogeneesi alustest ja organismide viirus-vastase kaitse mehhanismidest -suudab lahti mõtestada igapäevases elus ettetulevat teavet viiruste kohta, sh. kriitiliselt analüüsida ajakirjanduses ja internetis levivat tõelist ja väärinformatsiooni"}