{"KURSUSE_NIMI": "Laboritöö praktika", "KURSUSE_KOOD": "LOMR.00.097", "EAP": 9, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Biokeemia praktikum"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 234, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilane sooritab praktika töökollektiivis, kus tegeleb omandatud teoreetiliste teadmiste rakendamisega praktiliste ülesannete lahendamisel. Tudeng praktiseerib teadustulemuste korrektset kogumist, vormistamist, esitamist ja nende üle diskuteerimist. Praktika käigus lahendab tudeng erialaspetsiifilisi praktilisi ülesandeid. Praktika läbimisel omandab tudeng võime hinnata oma töö kulgu, teha oma tulemustetst vahekokkuvõtteid, neid eriala tundvatele inimestele esitada ja nende üle diskuteerida diskuteerida ning seda uusi eesmärke.Objectives/eesmärkid:  Praktilise kursuse eesmärgiks on omandada kogemus eenevate teoreetilste teadmiste rakendamisel praktikas, erialaste praktiliste probleemide lahendamisel ettevõttes või teaduslaboratooriumis.Learning outcomes/õpiväljund:  Aine läbimisel üliõpilane: 1. Suudab leida enda huvidele vastava ettevõtte/teaduslabori erialse praktilise töö sooritamiseks 2. Saab suhtlemise ja töötamise kogemuse töökollektiivis; 3. Saab kogemuse teoreetiliste teadmiste rakendamisest praktikas; 4. Saab töökollektiivis eksperimentide ja aja planeerimise kogemuse. 5. Suudab kohaneda igapäevase töörutiiniga ja teab oma rolli antud kollektiivis ja projektis 6. Suudab oma teadustulemusi esitada, analüüsida ja nende üle diskuteerida 7. Oskab hinnata kas eelnevad õpingud toetavad tema praktilist tööd ja suudab teha ettepanekudi õppeprotsessi muutmiseks 8. Suudab perjoodiliselt hinnata kuidas on seatud eesmärgid täitunud ja sellest tulenevalt seada uusi eesmärke. Ainet võib arvestada kahes etapis."}