{"KURSUSE_NIMI": "Arengubioloogia", "KURSUSE_KOOD": "LOMR.09.029", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Rakubioloogia II", "Inimese anatoomia ja füsioloogia alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 34, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 102, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Arengubioloogia kursusel käsitletakse loomade embrüonaalse ja postembrüonaalse arengu käigus toimuvaid protsesse. Loengud ja praktikumid on ülesehitatud arengu loomulikku kulgu järgides. Esmalt keskendutakse isas- ja emassugurakkude arengule (spermatogenees ja oogenees) ja seejärel vastavalt viljastumise, lõigustumise ja gastrulatsiooni protsessidele (varane areng). Kursuse teises osas vaadeldakse gastrulatsiooni käigus tekkinud lootelehtede (ektoderm, mesoderm, endoderm) kujunemist vastavateks organiteks (organogeneesid). Lisaks käsitletakse eraldi ka soo determinatsiooni ja postembrüonaalse arengu põhiprotsesse.Objectives/eesmärkid:  Põhieesmärgiks on loengute ja parktikumide baasil anda ülevaade loomade arengubioloogia põhiprintsiipidest ja protsessidest.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1)\tOrienteerub arengubioloogia terminoloogias, saab aru arengulistest põhiprotsessidest ning oskab luua seoseid erinevate arenguprotsesside/mehhanismide vahel ning võrrelda erinevaid loomarühme arengubioloogilises kontekstis 2)\tOskab kirjeldada varaseid arenguetappe nagu viljastumine, lõigustumine ja gastrulatsioon ning nendes etappides toimuvaid protsesse 3)\tOskab kirjeldada kuidas tekivad lootelehed ja kuidas neist formeeruvad erinevad koed ja organid/organsüsteemid 4)\tOskab kirjeldada  postembrüonaalseid arenguetappe (kasvamine, vananemine, metamorfoos, regeneratsioon) 5)\tOskab kirjeldada nii emas- kui isassugurakkude arengut ning soo determinatsiooni 6)\tOskab töötada mikroskoobiga ja mikroskoobis nähtut analüüsida ning üles tähendada Loengud ja praktikumid toimuvad  kontaktõppena (juhul kui seoses Covid-viirusega ei otsustata TÜ-s teisiti). Kui olete haige/haigustunnustega jääge koju."}