{"KURSUSE_NIMI": "Esmane statistiline andmetöötlus", "KURSUSE_KOOD": "LOOM.01.111", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 24, "seminar": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "TÄHELEPANU: kursusele registreerumise eelduseks on programmeerimiskeele R põhitõdede tundmine (koos R Studio-ga või ilma). Peaksite teadma järgnevat: andmete lugemine ja kirjutamine R-i abil; andmestruktuuride konstrueerimine ja manipuleerimine R-is (nt vektorid, andmestruktuurid, listid); R pakettide paigaldamine ja kasutamine; lihtsa graafika loomine põhi R või ggplot abiga.\n\n24 tundi praktilist tööd\n \nPraktilised sessioonid annavad teavet järgmistel teemadel\n1) Meta-triipkoodistamise sekveneerimisandmete käsitlemine R-i abil. Kvaliteedikontrolli ja sekveneerimisandmete bioinformaatilise analüüsi lähenemisviisid. Bioinformaatilise andmeprogrammi näide R-s, mis kasutab DADA2.\n2) Bioinformaatikast tulenevate koosluseandmete esialgne analüüs. Andmete kvaliteedikontroll, andmete uurimise põhilised lähenemisviisid.\n3) Meta-triipkoodistamise andmete täpsem analüüs. Ühe- ja mitmemõõtmelise statistilise analüüsi lähenemisviisid.\n4) Konsultatsioonisessioonid, kus üliõpilased saavad näitena tuua enda andmeid või esitada oma plaane andmete analüüsi läbiviimiseks ning saada tagasisidet ja juhiseid nii klassilt kui ka õppejõududelt.Objectives/eesmärkid:  Kursuse eesmärk on õppida lähenemisviise, kuidas analüüsida meta-triipkoodistamise andmeid (bioloogilistest kooslustest saadud sekveneerimisandmed).Learning outcomes/õpiväljund:  Kursuse lõpuks  - õppija mõistab meta-triipkoodistamise andmete analüüsi põhiaspekte  - õppija on omandanud oskused rakendada erinevaid bioinformaatilisi ja statistilisi analüüse meta-triipkoodistamise andmetele - õppija on omandanud oskused kasutada meta-triipkoodistamise andmeanalüüsi oma uurimisküsimustes"}