{"KURSUSE_NIMI": "Topograafia välipraktika", "KURSUSE_KOOD": "LOOM.02.008", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 2, "individual_work": 0, "internship": 76}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus omandatakse praktilised oskused maastiku horisontaal- ja vertikaalmõõdistamise osas ülikoolivälises töökeskkonnas erialaspetsialistide juhendamisel. Õpitakse tundma mõõdistusinstrumente, -tehnikaid ja -meetodeid. Rühmatöö tulemusena läbitakse maamõõtmise kõik põhilised tööprotsessid ja koostatakse suuremõõtkavaline plaan ja esitatakse tehniline aruanne. Praktikakorraldust reguleeritakse soovitatavalt kahe- või kolmepoolsete lepingutega, mis sõlmitakse enne praktika toimumist ja praktikantidele antakse tagasisidet nende ülesannetega toimetuleku kohta, milline oli tema areng, ettevalmistus jms.\n\nVälipraktika kohustuslikuks eeldusaineks on TOPOGRAAFIA (LOOM.02.015)! Kuna ÕIS tehniliselt ei luba ainele registreerida, kui samal semestril toimub tema eeldusaine, siis registreerimise võimaldamiseks on eeldusaine ära nimetatud siin sisu lühikirjelduses.Objectives/eesmärkid:  Anda praktiline kogemus põhilistest maamõõtmise võtetest ning oskused käsitseda mõõdistamisinstrumente reaalses maamõõtmise keskkonnas täites reaalseid tööülesandeid. Anda üliõpilasele oskused tegutseda maamõõtja, geodeedi ja ruumiandmete kogujana. Võimaldada tal lahti mõtestada erialaoskused, mis läbitud töödel tagavad kvaliteetse tulemuse.Learning outcomes/õpiväljund:  Kursuse läbinu \n* tunneb topograafilise mõõdistamise põhimõtteid\n* mõistab mõõdistuspõhise loomise vajadust\n* tunneb põhilisi topograafilise mõõdistamise liike (teodoliit-, tahhümeetriline, GPS-mõõdistamine, nivelleerimine)\n* teab olulisemaid maamõõduinstrumente ja nende töötamise põhimõtteid\n* teab mõõdistusandmete töötlemise põhiprotseduure ja topograafiliste plaanide koostamise põhimõtteid\n* omab töökogemust erialal ja oskab seda analüüsida ja mõtestada"}