{"KURSUSE_NIMI": "Eestimaa tundmine", "KURSUSE_KOOD": "LOOM.02.243", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 36, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus toimub 1. õppeaasta järgsel suvel õppekekursioonina, mille käigus käsitletakse loodusgeograafia, inimgeograafia, kartograafia ja Eestimaa tundmise teemasid mingi Eesti piirkonna kohta. Ekskursiooni järel valmivad tudengite referaadid kitsamatel teemadel. Majutus toimub telkides, st kogu ööbimisvarustuse (telk, madrats, magamiskott jne) peate ise kaasa võtma. Samuti peate kaasa võtma hommiku ja õhtusöögi. Ööbimiskohas on enamasti olemas grillimisvõimalus ning pesemisvõimalus (loodetavasti ka saun). Kõigil päevadel tehakse ka poepeatus. Väljasõit Tartust on esimesel päeval kell 9.00 Vanemuise õppehoone eest ja tagasisaabimine (kolmandal päeval) umbes 18.00. Riietus siis võiks olla sobilik vabas õhus viibimiseks ja soovitavalt kaasa ka fotoaparaat ja kaart.Objectives/eesmärkid:  Ülevaate andmine geograafilise uurimistöö spetsiifikast ning Eesti geograafia ja kodu-uurimise allikate tundmaõppimine ja kasutamisoskuse arendamine.Learning outcomes/õpiväljund:  Eestimaa tundmise kursuse läbinud üliõpilane: 1) oskab leida ja analüüsida geograafilist ja koduloolist infot ning suudab seda üldistada ja teistele tutvustada 2) oskab rakendada omandatud teadmisi välitöödel ja õppeekskusrioonidel teadmiste kogumiseks 3) oskab kogutud teadmisi kasutades ette valmistada ja läbi viia uurimisreise ja õppeekskusrsioone 4) tunneb välitööde organisatoorseid, eetilisi ja ohutusnõudeid Pärast ekskursiooni koostatakse referaat.\n\nReferaat peab sisaldama informatsioon käidud alade ja kohtade kohta nii, et seda oleks võimalik kasutada ekskursiooni korraldamisel. Võib lähtuda nii ühe-, kahe- kui ka kolmepäevasest ekskursioonist. Referaat peab sisaldama laiemat lühiülevaadet külastatavast alast ja siis ka täpsemaid kirjeldusi külastatud kohtadest. Töö peab olema vormistatud vastavalt Geograafia osakonna kodulehel oleva juhendi järgi."}