{"KURSUSE_NIMI": "Demograafia", "KURSUSE_KOOD": "LOOM.02.065", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 2, "seminar": 11, "colloquium": 0, "web_learning": 0, "independent_work": 61, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate olulisemate demograafiliste protsesside sündimuse, suremuse ja rändega seotud mõistetest, seaduspärasustest ja kordajatest. Omandatakse nende kordajate kasutamise ning rahvastiku prognoosimise praktiline oskus. Kursusel käsitletakse ka arenenud riikide olulisemaid rahvastikuprobleeme.\n\n1. Sissejuhatus \nDemograafia uurimisobjekt, allharud ja seosed teiste teadustega. Rahvastikuprotsesside omapära. Demograafilise ülemineku teooria. Teine demograafiline üleminek. \n\n2. Andmeallikad\nRahvaloendus: läbiviimise põhimõtted, küsimustik, tulemuste kontroll ja usaldusväärsus. Sündmusstatistika ja rahvastikuregister. Küsitlusuuringud: eelised ja puudused võrreldes kõiksete andmeallikatega, tõenäosuslikud ja empiirilised uuringud, valimi moodustamise ja küsitluse läbiviimise meetodid.\n\n3. Suremus ja sündimus\nSündimuse ja suremuse muutus demograafilisel üleminekul. Suremust iseloomustavad näitajad (üldkordaja, vanuskordaja, standardiseeritud üldkordaja, oodatav eluiga, imikusuremus). Sündimuse periood- (üldkordaja, vanuskordaja, summaarne sündimuskordaja) ja kohortnäitajad.\n\n4. Ränne ja linnastumine\nRände ja linnastumine demograafilisel üleminekul. Rännet iseloomustavad näitajad (üldkordajad, vanuskordajad, summaarne rändekordaja).\n\n5. Vanuskoosseis ja rahvastikuprognoosid\nVanuskoosseis ja selle muutumine demograafilisel üleminekul. Vanus, sünniaeg ja elutsükkel. Rahvastikuprognoosi koostamine vanusnihke meetodil. Prognoosi eeldused ja variandid. Maailma rahvastikuprognoos.\n\n6. Eesti rahvastik\nEesti rahvaarvu muutus läbi sajandite. Demograafiline üleminek. Välispäritolu rahvastik. Eesti rahvastiku sündimus- ja suremusareng. Vananemine.Objectives/eesmärkid:  Demograafia I kursus on üks inimgeograafia õppekava sissejuhatavatest ainetest, mis loob teoreetilised alused rahvastikuprotsesside mõistmiseks, arendab oskusi esmase rahvastikuanalüüsi koostamiseks ning tutvustab arenenud riikide peamisi rahvastikuprobleeme.Learning outcomes/õpiväljund:  Ainekursuse läbinu: * teab demograafia põhimõisteid, protsesse ja seaduspärasid, * mõistab rahvastikuprotsesside vanussõltuvust, * oskab selgitada rahvastiku koosseisu ja demograafilise käitumise rolli rahvastikusündmuste,    (sünnid, surmad, ränne) kujunemisel, * tunneb ja oskab arvutada rahvastikuprotsesse iseloomustavaid põhinäitajaid, * oskab koostada elutabelit ja rahvasikuprognoosi põhistsenaariume."}