{"KURSUSE_NIMI": "Rakendushüdrobioloogia", "KURSUSE_KOOD": "LOOM.04.033", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Üldine hüdrobioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 1, "seminar": 1, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kaasaegne rakendushüdrobioloogia kontseptsioon - see on süsteemsete ökoloogiliste teadmiste rakendamine veekogude ressursside kasutamisel, korraldamisel ja säilitamisel. Eluliselt tähtsaks eesmärgiks tänapäeval on veekogude ökosüsteemsete teenuste taastamine ja nende kestlikkuse tagamine. Käesolev kursus käsitleb veeökosüsteemide kasutamisega seotud aktuaalseid probleeme (nt eutrofeerumine, kalasaakide vähenemine, veekogude hüdrmorfoloogilised muutused) ja nende lahendusvõimalusi. Kursus koosneb kolmest teemade valdkonnast: 1) eutrofeerumine ja järvede taastamine, 2) jõgede toimimine ja taastamine, 3) kalakoosluste taastamine ja kaitse. Objectives/eesmärkid:  Üliõpilased saavad ülevaate veekogude eutrofeerumisega ja veekogude ressursside kasutamisega seonduvatest aktuaalsetest probleemidest. Omandavad veekogude ressursside säästliku kasutamise ja haldamise ökosüsteemi-põhise käsituse.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilased: Õppeaine edukal läbimisel üliõpilased:\nOrienteeruvad veekogude eutrofeerumise probleemistikus.\nOmavad ülevaadet veekogude taastamise meetoditest, oskavad hinnata nende rakendamise võimalusi ja mõju.\nOskavad selgitada säästliku kalanduse põhimõtteid.\nOskavad välja tuua inimtegevuse otsesed ja kaudsed mõjud veeorganismide populatsioonidele, veeökosüsteemide struktuurile ning mitmekesisusele.\nOn tuttavad veekogude troofilise ja ökoloogilise seisundi hindamisega.\nOn kursis Eesti veekeskkonna seisundiga ja selle seirega.\nOn võimelised iseseisvalt otsima ning analüüsima asjakohast informatsiooni. puudub"}