{"KURSUSE_NIMI": "Meteoroloogia ja klimatoloogia alused", "KURSUSE_KOOD": "LOOM.02.240", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 40, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "On sissejuhatavaks kursuseks meteoroloogia ja klimatoloogia süvendatud õppimisel. Antakse ülevaade atmosfääri ehitusest ja koostisest. Kirjeldatakse  soojusülekande protsesse atmosfääris ning temperatuurivälja ajalist ja ruumilist kujunemist. Tutvustatakse kiirgusseadusi ning kiirguslikke protsesse ning optilisi nähtusi atmosfääris. Käsitletakse vee faasiüleminekutega kaasnevaid nähtusi atmosfääris: kaste, udu, pilved, sademed. Uuritakse atmosfääri stratifikatsiooni. Vaadeldakse atmosfääri tsirkulatsiooni peamisi mehhanisme ja nende osa kliima kujunemisel. Kirjeldatakse aluspinna erisuste mõju üldkliima ja mikrokliima kujundajana, peamisi kliima klassifikatsioone ja kliimatüüpe maakeral ning maakera kliima pikaajalisi muutusi.Objectives/eesmärkid:  Eesmärgiks on anda ülevaade atmosfääris toimuvatest nähtustest ja protsessidest, nende füüsikaline selgitus ilma matemaatikasse ja valemitesse laskumata. Samuti anda ülevaade kliimat kujundavatest teguritest, kliimatüüpide levikust maakeral ja kliima muutustest.Learning outcomes/õpiväljund:  Kursuse läbinu suudab/oskab: 1) kirjeldada atmosfääri koostist ja ehitust ning seostada koostise ja ehituse iseärasid omavahel; 2) nimetada meteoroloogilisi instrumente ning illustreerida satelliit- ja radarmeetodite kasutamist meteoroloogias ja klimatoloogias; 3) arutleda meteoroloogilise ja klimatoloogilise informatsiooni kasutusalade üle; 4) analüüsida ilmaennustuse paikapidavust; 5) rakendada oma teadmisi ilmaelementidest nende väärtuste visuaalsel hindamisel; 6) hinnata eri soojusülekandeprotsesside osakaalu globaalse ja lokaalse temperatuurireiimi kujunemisel; 7) selgitada lihtsamate atmosfäärinähtuste füüsikalisi põhjusi; 8) arvutada pilvetekke olulisi füüsikalisi suurusi (niiskuse karakteristikuid, atmosfääri staatilise stabiilsuse näitajaid jm); 9) liigitada pilvi, sademeid ja udusid; 10) aru saada tuult ja atmosfääri üldist tsirkulatsiooni põhjustavaid ja mõjutavaid tegureid; 11) kirjeldada globaalset tsirkulatsioonisüsteemi; 12) nimetada peamisi kliimatekketegureid ja kliimat kujundavaid protsesse; 13) aru saada kasvuhooneefektist ja globaalse kliima soojenemise mehhanismidest; 14) kirjeldada aluspinna erinevuste mõju kliima kujunemisele; 15) aru saada peamistest kliima klassifikatsioonidest; 16) kirjeldada kliimatingimusi maakera erinevates paikades; 17) välja tuua peamised kliima kõikumised maa geoloogilises ajaloos ja sealjuures holotseenis. Õppematerjalid, programm ja referaadid  asuvad ÕIS-is ning Moodles. Täpne info korralduse kohta on toodud aine Moodles. COVID-19 seotud kitsendustega kohanetakse vastavalt vajadusele."}