{"KURSUSE_NIMI": "Käitumisökoloogia", "KURSUSE_KOOD": "LOOM.04.038", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse käitumise seost ökoloogiaga. Vaadeldakse optimaalsusmudelite kasutamist käitumise uurimisel, elukäigu strateegiaid, koostööd ja konflikti, altruismi, optimaalse toitumise teooriat, grupieluviisi ja territoriaalsust, sugudevahelist konflikti, paarumissüsteeme, biokommunikatsiooni, evolutsioonilist \"võidujooksu\" jpm.Objectives/eesmärkid:  See õppejõu juhendamisel eestikeelsest veebiõpikust iseseisvalt õpitav aine on mõeldud neile paljudele, kelle tulevases elus on oluline oskus paremini mõista elusolendite, sealhulgas kaasinimeste, käitumise varjatud põhjusi ja algallikaid. Omandatud teadmised aitavad võtta vastu teaduslikult läbimõeldud otsuseid, mis puudutavad looduslikku elukeskkonda ning kodu- ja lemmikloomi, aga samuti ka inimühiskonda ning oma perekonda. Aine on sihilikult üles ehitatud nii, et seda suudaks raskusteta omandada võimalikult lai õppurite kontingent ka neilt erialadelt, kus puudub eriettevalmistus bioloogia spetsiifilistes distsipliinides.Learning outcomes/õpiväljund:  Õpitakse elusorganismide, sh inimese, käitumise kogu näilise mimekesisuse ja keerukuse taga nägema ühtseid bioloogiliselt põhjendatud mustreid ja printsiipe. Omandatakse parem mõistmine sellest, kuidas, miks ja millised evolutsioonilised ja ökoloogilised mehhanismid on vorminud elusolendite käitumise just selliseks, nagu see erinevatel liikidel, sugupooltel, vanuserühmadel ja isenditel on, ja mis põhjustab loetletute vahel käitumuslikke erinevusi. Aine läbinu oskab teaduslikult põhjendatult analüüsida ja tõlgendada elusorganismide, sh inimese, käitumist erinevates situatsioonides ning näha paremini läbi konkreetse käitumise bioloogilisi algpõhjusi. Lisaks iseseisvale tööle on võimalus osaleda neljal seminaril. Esimene neist on paar nädalat enne esimest kontrolltöövõimalust, kaks tükki enne teist kontrolltöövõimalust ja neljas enne järelkontrolltööd. Kõigil seminaridel tutvustab õppejõud aine keerulisemaid osi, milles teadmiste kontrolli käigus kõige sagedamini libastutakse, ja vastab üliõpilaste küsimustele. Samuti arutletakse käitumisökoloogiliste probleemide üle.\n\nKõigile registreerunutele saadetakse täpsustunud info kursuse läbimise tingimuste ja ajakava kohta oktoobris."}