{"KURSUSE_NIMI": "Keskkonna- ja sotsiaalse mõju hindamine", "KURSUSE_KOOD": "LOOM.02.164", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Loodus- ja keskkonnakaitse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 7, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 63, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb keskkonna-, strateegilise- ja sotsiaalse mõju hindamise teooriat, metoodikat, regulatsiooni ja menetlust, sh tutvustatakse Natura hindamise põhimõtteid. Mõjude hindamise protsessi eesmärgiks on toetada haldusorganit arendusotsuse tegemisel, leides parimad ja põhjendatud lahendid arendusprojektide elluviimisel, kaasates võimalikult hästi erinevate huvigruppide arvamusi ja informeerides avalikkust võimalikest tegevustest. Mõjude hindamisel on rõhk projektide, ruumiliste planeeringute ja arengukavade hindamisel, avaliku sektori, arendaja, planeerija, eksperdi ja avalikkuse vahelisel koostööl, hindamise protsessil ja menetlusel. Kursuse käigus keskendume arendusprojektide keskkonnamõju hindamisele, mida viiakse läbi tegevusloa taotluse menetluse raames.\nKursuse teoreetiline ja praktiline osa on põimitud erinevate õppeülesannete kaudu. Neist keskne ülesanne on analüüsida mõjuhindamise aruandeid ja protsessi kursuse teoreetilises osas omandatavate teadmiste alusel. Auditoorsele tööle eelneb reeglina kodulugemisülesande täitmine.Objectives/eesmärkid:  Ainekursuse eesmärk on teadmiste omandamine keskkonna-, strateegilise ja sotsiaalse mõju hindamise teoreetiliste lähtekohtade, metoodika, hindamismeetodite ja menetluse kohta ning analüüsioskuse arendamine KMH kvaliteedi üle omandatud teadmiste põhjal.Learning outcomes/õpiväljund:  Ainekursuse läbinu * teab keskkonnamõju hindamise õiguslikku raamistikku, põhimõisteid, printsiipe ja menetluse ajatelge; * tunneb Natura hindamise metoodikat; * kirjeldab KMH menetlusosaliste rolle ja seostab neid omavahel; * mõistab avalikkuse kaasamise tähendust ja selgitab kaasamise praktilist külge KMH menetluses; * kirjeldab erinevate mõjuvaldkondade peamisi hindamismeetodeid ja tulemuste esitamise viise ning võrdleb alternatiivseid tegevusvariante erinevate meetodite abil; * analüüsib KMH menetluse ja sisu kvaliteeti meeskonnatööna. Täpne ainekava on näha registreerunud tudengitele Moodle'i kursusel õppetöö alguseks. \nJooksev info õppetöö kohta antakse Moodle'i keskkonnas registreerunud tudengitele (sh kodulugemine, kordamisküsimused, rühmatöö ülesanded nädala teemal, ettekannete ajakava), tudengid registreerivad end Moodle'is seminaritöö rühmadesse, esitavad ja retsenseerivad kirjalikke töid."}