{"KURSUSE_NIMI": "Geodünaamika ja tahke Maa füüsika alused", "KURSUSE_KOOD": "LOOM.03.086", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Maateaduste alused I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 40, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus käsitletakse tahke Maa sfäärilist läbilõiget, füüsikalisi välju (raskusjõu ja magnetväli) ning erinevaid uurimismeetodeid Maa sisemuse uurimisel. Esitatakse litosfääri laamtektooniline, kuuma täpi ja superkontinentide tektooniline mudel. Loengukursus koosneb järgnevatest peatükkidest:\n\n1.\tSissejuhatus. Ülevaade meetoditest, mida kasutatakse Maa siseehituse uurimisel.\n2.\tMaa gravitatsiooniväli. Maa mass ja tihedus; gravitatsioonijõu seos geoloogiaga; kivimite ja setendite tihedus ning poorsus; gravitatsioonjõu mõõtmine; gravitatsioon globaalsetel tektoonilistel situatsioonidel.\n3.\tMaa magnetväli, selle kirjeldamine ja variatsioonid; magnetomeetria aparatuur; kivimite magnetilised omadused; geoloogiliste struktuuridega seonduv magnetväli; paleogeograafia alused.\n4.\tSeismoloogia. Mehaaniline pinge ja deformatsioon; materjalide elastsed omadused; seismilised lained, lainete käitumine ja levik kihilises keskkonnas; maavärinad; maavärinate registreerimine ja kirjeldamine; maavärinad sisesfääride iseloomustamisel.\n5.\tMaa soojusväli; maasisese soojuse allikad; soojusvoo tihedus; sulamisvööndid Maa sees.\n6.\tMaa siseehitus. Maakoor, koore tüübid ja koostis. Maa vahevöö ja tuum, neis toimuvad protsessid.\n7.\tLaamtektoonika. Laamade omavahelised piirid, neis toimuvad geoloogilised protsessid.\n8.\tKuumad täpid; vahevöö konvektsioon; laamasid mõjutavad jõud, superkontinendid.Objectives/eesmärkid:  Omandada teadmised Maa sfäärilisest ehitusest, füüsikalistest väljadest, maakoore liikumisest ning nende teadmiste aluseks olevatest uuringumeetoditest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Üliõpilane tunneb detailselt Maa sfäärilist ehitust, laamtektoonika põhimõtteid, laamade äärtel toimuvaid protsesse, kuuma täpi magmatisimi seoseid laamtektoonikaga. Lisaks teab üliõpilane seismoloogia, gravimeetria, magnetomeetria ja termomeetria meetodite põhimõtteid."}