{"KURSUSE_NIMI": "Molekulaarne ökoloogia ja süstemaatika", "KURSUSE_KOOD": "LOOM.04.011", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Igale bioloogile on teadmised organismide geneetilisest mitmekesisusest, genoomide ehitusest, geenisiirdest populatsioonide vahel, evolutsioonipuude ehitamisest ja korrektsest  tõlgendamisest - kui nimetada vaid mõningaid kursusel käsitletavaid teemasid - äärmiselt oluline osa haridusest. Neid teadmisi saate hiljem rakendada erinevates bioloogia, aga ka näiteks biomeditsiiniga seotud valdkondades, saab teist tulevikus siis teadlane, kooliõpetaja, looduskaitsja, keskkonnaametnik või mõni muu looduse kohta teadmisi vajava eriala esindaja. Kursuse raames käsitletakse molekulaarse ökoloogia ja süstemaatika aluseid, andes ülevaate valdkonna põhiteemadest, olulisematest probleemidest, uurimismeetoditest ja -objektidest. Tutvustatakse uurimistöö eetilisi aluseid, erinevate organismirühmade genoomi ehitust, uurimiseks kasutatavaid peamisi geneetilisi markereid, põhilisi uurimismeetodeid ja nende rakendusvõimalusi nii teadustöös kui rakenduslikel eesmärkidel looduskaitses, aga ka loomade ja inimeste tervisekaitses.Objectives/eesmärkid:  Kursuse eesmärgiks on anda alusteadmised molekulaarse ökoloogia ja süstemaatika olulisematest teoreetilistest lähtekohtadest ja tutvustada nende praktilisi rakendusvõimalusi erinevates valdkondades, sh. loodus- ja tervisekaitses.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane:\n1) Tunneb molekulaarse ökoloogia ja süstemaatika põhimõisteid, olulisemaid teooriaid ja uurimismeetodeid ning nende rakendamisvõimalusi ja  uurimistöö eetilisi alused; \n2) Eristab ainekäsitluse viise molekulaarses ökoloogias süstemaatikas ja hindab kriitiliselt\nnende rakendusvõimalusi;\n3) Loob interdistsiplinaarseid seoseid molekulaarse ökoloogia süstemaatika ja teiste bioloogia ainevaldkondade vahel;\n4) Seostab õpitu oma varasema õpikogemusega;\n5) Demonstreerib süvendatud teadmisi valitud uurimisvaldkonnas, mõistes organismidevahelisi seoseid, nende kujunemist ja muutumist. puudub"}