{"KURSUSE_NIMI": "Geograafilise mõtte kujunemine ja geograafia ajalugu", "KURSUSE_KOOD": "LOOM.02.244", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 2, "seminar": 4, "independent_work": 44, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Geograafia ajaloo kursus on süsteemne analüütiline ülevaade maailma avastamisest Euroopa vaatevinklist. Kursus annab ülevaate koloniaalimpeeriumide sünnist ja langusest ning loodusteadusliku mõtte ja geograafiateaduse arengust kuni 20. sajandi lõpuni.Objectives/eesmärkid:  Geograafia eriala lõpetanud saavad tööd paljudel erialadel tänu hästi laiapõhjalisele õppele. Geograafia ajaloo tundmine on geograafia-alase hariduse üks nurgakive. Tänaste riikide geopoliitilisi, majanduslikke ning kultuurpoliitilisi huvisid  ei ole võimalik mõista ja toimuvaid protsesse iseseisvalt ning kriitiliselt analüüsida, kui me ei tunne maailma ja geograafiliste avastuste ajalugu alates ürgajast.\n\nSuurte riikide omavahelist konkurentsi on kogu aeg saatnud tung laieneda ja kontrollida nii poliitiliselt kui ka majanduslikult üha suuremaid territooriume, et kasvatada oma rikkust ja poliitilist mõju. Maadeavastused ja ümbermaailmareisid olid parimad vahendid rikkuse kasvatamiseks. Oma tegevuse õigustamiseks rakendasid näiteks eurooplased edukalt nö uskmatute ristiusustamist.\n\nMida rikkamaks said riigid seda kiiremini sai võimaluse areneda teadus ja (ülikooli)haridus, mis oli väga kõrgel tasemel olnud antiikajal, kuid sai uuesti hoo sisse pärast suuri maadeavastusi 16. sajandil. Sellest ajast alates jõudis kõrgharidus üha rohkemate inimesteni, sh. 19. sajandil ka esimeste eestlasteni. Geograafia ajaloo kursuse ülesanne on ka näidata millise panuse on andnud  Eestist pärit maadeuurijad ja geograafid geograafiateaduse arengusse.\n\nMis puudutab Maa loodusolude ja avalduvate seaduspärasuste uurimist (nt temperatuurierinevuste mõistmist Maa erinevates piirkondades), territooriumide kaardistamist ja kasulike loodusvarade otsimist, siis kõik need aspektid olid olulised geograafia kui teaduse kujunemisele ja arengule, mille peamiseks uurimisobjektiks muutus maastik. \n\nLühidalt: geograafia ajaloo kursuse eesmärk on soodustada analüütilist mõtlemist ja kujundada geograafide ja teiste ajaloost huvitatud üliõpilaste maailmapilti. Eesmärk on aidata üliõpilasi orienteeruda maailma ajaloo küsimustes  ning tänapäeva riikide huvide dunglis. \n\nLearning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. Üliõpilane tunnetab, et maailma ning geograafia ajalugu ei ole kunagi ainult must ja valge ning seda ka Eesti ajaloo kontekstis. Kõikjal on halle toone ning sageli pole võimalik värvitoonidel põrmugi vahet teha. Kriitiline mõtlemine on alati esmatähtis. \n\n2. Üliõpilane tunneb Maa geograafilise uurimise ajalugu ja teadmiste vähesusest ja tehnilistest vajakajäämistest tulenenud raskusi sel teel;\n\n3. Üliõpilane oskab  siduda riikide tõusu ja languse põhjuseid alates antiikajast poliitiliste protsessidega, maadeavastustega ja  loodusvarade kasutuselevõtuga; \n\n4. Üliõpilane analüüsib suurte riikide mh koloniaalimpeeriumide (Portugali, Hispaania, Holland, Briti, Prantsuse, Vene) omavahelist konkurentsi ja näitab, millised sammud tõid majanduslikku ja poliitilist kasu maadeavastustes ning avastatud maade koloniseerimisel;\n\n5. Üliõpilane suudab selgitada üksikteadlaste, teaduste akadeemiate ja ülikoolide sh Tartu ülikooli ning seal töötanud teadlaste rolli loodusteaduste ja eriti geograafiateaduse ning kartograafia arengu seisukohalt .  \n"}