{"KURSUSE_NIMI": "Arengustrateegia koostamise praktika", "KURSUSE_KOOD": "LOOM.02.344", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kohaliku ja regionaalse arengu planeerimine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 20}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Osaletakse üldjuhul paarides arengustrateegia protsessis kohaliku omavalitsuse arengukava või -strateegia koostamisel.\n\n0. Ettevalmistus\n- KRAP kursuse ja eksami sooritamine - praktikale pääsemise eeltingimus\n- Metoodiliste ja juhendmaterjalide läbitöötamine\n- Vastuvõtva asutuse/ettevõtte valimine\n\n1. Administratiivne eeltöö: Tellijaga suhtlemine ja tööplaani koostamine - märts-mai\n\n2. Eeltöö kirjalike allikatega - PROFIIL, eelstrateegia/planeeringu, lähteülesande koostamine - märts-mai\n\n3. Kohapealne lisainfo kogumine ja töötlemine - välitööd - mai-juuni\n\n4. Probleemide identifitseerimine: intervjuud ja fookusgrupid, lisaanalüüs - mai-juuni\n\n5. Lahenduste leidmine: kirjandus, ajurünnakud, konsultatsioonid ja seminarid - august-sept\n\n6. Strateegia, planeeringu rakendamise kokkuleppimine ja projektide koostamine\nja rahastusallikate leidmine\n\n7. Strateegia rakendamine: projektide sidumine arengukava ja eelarvegaObjectives/eesmärkid:  Kursusele  Kohaliku ja regionaalse arengu planeerimine (LOOM.02.063) järgnev praktika omavalitsuse või mõne muu territoriaalse üksuse üldise arengu või valdkonna (nt. transpordi, ettevõtluse arengu, keskkonna) strateegia, arengukava või arendusprojekti koostamiseks.Learning outcomes/õpiväljund:  Oskus iseseisvalt, proaktiivselt ja koostöös praktikakoha tegevadministratsiooniga kavandada uurimis- ja planeerimistööd. Oskus koguda ja valida erinevatest allikatest arengu kavandamisel olulisi andmeid, sh rakendada sotsioloogilisi meetodeid. Võime eristada strateegilisi probleeme ja leida neile koostöös osalistega loovalt lahendusi. Oskus juhatada töörühmi ja -koosolekuid, rakendada erinevaid grupitöö metoodikaid. Oskus vormistada ja esitada erinevate meediumite kaudu selgelt arengukava ja -strateegia teksti."}