{"KURSUSE_NIMI": "Struktuurigeoloogia ja geoloogilised kaardid", "KURSUSE_KOOD": "LOOM.03.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Maateaduste alused I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 80, "practice": 0, "seminar": 0, "independent_work": 76, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse põhirõhk on suunatud maakoore ehituse, tema erinevate struktuuride, nende tekke ning arengu ja maakoort\nmoodustavate kivimite deformatsioonide tundmaõppimisele. Õpitakse tundma. Omandatakse struktuurse analüüsi\nmeetodeid, selgitatakse maakoore struktuuride kuju geoloogilistel kaartidel ja geoloogilistel läbilõigetel. Kursus annab\nalgteadmisi geoloogiliseks välikaardistamiseks jt. uuringuteks.Objectives/eesmärkid:  Kursuse eesmärgiks on maakoore kivimite struktuuride ja deformatsioonide nende ehituse, tekke ja levikuseaduspärasuste tundmaõppimine ja kujutamine geoloogilisel kaardil.Learning outcomes/õpiväljund:  1.Struktuurigeoloogia olemus; maakoore kivimilise ehituse ja nende struktuuride (arhitektuuri) kirjeldamine selle kujunemisloo ajalis ruumilstest protsessidest ja suhetest lähtuvalt. 2.Selle väljund praktikasse; geoloogilised kaarid kui piirkonna maakoore ehituse (struktuuri) ja selle formeerumise ajalis-ruumiliste protsesside, tingimuste, keskkondade jmt. peegeldajad. 3.Struktuurse analüüsi ja selle erinevate komponentide sisu ja otstarve struktuurigeoloogiliste eesmärkide lahendamisel. 4.Geoloogilise struktuuri sisu; nende klassifitseerimise võimalused sõltuvalt erinevate aspektide (formeerumise, ruumilise ehituse, ajalis-ruumiliste suhete, deformeerituse astme jmt.) esiletoomise vajalikkusest. 5.Settekivimite struktuurgeoloogilised aspektid; settekivimid kui settekeskkonna otsesed väljendajad/iseloomustajad; erinevad settekivimites esinevad struktuurid kui erinevate protsesside, tingimuste, sündmuste peegeldajad ja nende kasutamisvõimalused settekivimite formeerumise ajalis-ruumiliste suhete tõlgendamisel. 6.Põiksuste olemus ja tähtsus piirkonna geoloogilise arenguloo tõlgendamisel. 7.Tektoonilised struktuurid, nende sisu; kivimite deformatsioonid, deformatsioonide olemus ja seda tingivad faktorid. Tektoonuiliste struktuuride kaks suurt gruppi ja nende klassifitseerimise alused. 8.Magma ja moondekivimid kui maakoore struktuursed elemendid ja erinevate geotektooniliste sündmuste/etappide, nende protsesside ja termodünaamiliste tingimuste väljendajad. Magmakivimite struktuuride klassifitseerimine/struktuurid. Moondekivimi struktuursed/tekstuursed tunnused kui maakoore termodünaamiliste tingimuste/protsesside väljendajad.  9.Settekivimite lasumusvormid ja nende esinemine geoloogilistel kaartidel. 10.Tektooniliste struktuuride väljendumine geoloogilistel kaartidel; reeglid nende struktuuride morfoloogia hindamiseks. 11.Magmakivimid geoloogilistel kaartidel. 12.Maakera globaalstruktuurid ja nende seos ja suhtvahekord regionaalsete ja lok"}