{"KURSUSE_NIMI": "Maavarad ja kaevandustehnoloogiad", "KURSUSE_KOOD": "LOOM.03.118", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Maateaduste alused I"], "SOOVITUSLIKUD_EELDUSAINED": ["Mineraloogia", "Sedimentoloogia"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Maavarade ja kaevandamistehnoloogiate kursus annab geoloogia ja keskkonnatehnoloogia üliõpilastele vajalikud baasteadmised ja praktilised oskused ühiskonnale oluliste maavarade säästlikuks majandamiseks.\n\nAinekursus koosneb kolmest temaatilisest loengute-seminaride osast ning arvutipraktikumidest.\n\nEsimene osa käsitleb maavarade geoloogia ja mäenduse aluseid sh maavarade kujunemist geoloogilistes protsessides, maavarade peamiseid uurimise- ja kaevandamise tehnoloogiaid ning kaevandamise keskkonnamõju. Käsitletakse rahvusvahelisi kokkuleppeid maavarade uurimisel ja varude hindamisel, ringmajandusele üleminekut ning Euroopa roheleppe põhimõtteid. \n\nTeine osa käsitleb põhiliste metalliliste, mittemetalliliste ja energeetiliste maavarade iseloomustust sh koostist ja kujunemist, ressursside levikut, töötlemist ja (taas)kasutamise võimalusi ning kaevandamise keskkonnamõju.\n\nKolmas osa annab ülevaate Eesti tänastest ja võimalikest tulevikumaavaradest, nende uurimisest ja kaevandamise tehnoloogiatest. \n\nPraktikumide käigus tutvutakse maapõue geoinfosüsteemidega ning lahendatakse maavara varude hindamisega seotud ülesandeid kasutades GIS-de võimalusi (tarkvara MapInfo, Datamine Discover, Q-GIS).Objectives/eesmärkid:  Baaskursuse eesmärgiks on anda teadmisi ühiskonnale oluliste maavarade leviku ja kujunemise ning maavarade kaevandamise tehnoloogiate ja keskkonnamõju kohta. Samuti on eesmärgiks praktiliste digioskuste (maapõue geoinfosüsteemide kasutusoskus) arendamine maavara kvaliteedi ja varude hindamisel.Learning outcomes/õpiväljund:  1. Üliõpilane tunneb maavarade leviku ning kujunemise seaduspärasusi geoloogilistes protsessides. 2. Üliõpilane teab, kuidas rakendada praktikas erinevaid maavara otsingu-uuringu- ja kaevandamismeetodeid lähtuvalt maavara liigist ja mäendustingimustest. 3. Üliõpilane tunneb rahvusvahelisi kokkuleppeid maavarade uurimisel ja varude hindamisel, samuti ringmajanduse ning Euroopa roheleppe põhimõtteid. 4. Üliõpilane teab erinevate maavaraliikide geneetilis-majanduslikke tüüpe, koostist, levikut, töötlemist ja kasutamist. 5. Üliõpilane tunneb Eesti maavarade uurimisele ja kaevandamisele kehtestatud nõuded. 6. Üliõpilane oskab kasutada maapõue geoinfosüsteeme maavara kvaliteedi ja varude hindamisel."}