{"KURSUSE_NIMI": "Üldine hüdrobioloogia", "KURSUSE_KOOD": "LOOM.04.034", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 40, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Teemad:\n1. teema: Sissejuhatus hüdrobioloogiasse\n2. teema: Plankton\n3. teema: Bentos\n4. teema: Süvaveealade ökoloogia\n5. teema: Rannalähedaste ökosüsteemide ökoloogia\n6. teema: Rifid\n7. teema: Ojad ja jõed: ühesuunalise vee vooluga süsteemid\n8. teema: Järved ja ookeanid kui funktsionaalsed tervikud\n9. teema: Veeökosüsteemid ja globaalökoloogia\n10. teema: Inimtegevuse mõjud veeökosüsteemidele\n11. teema: Järvede ajalugu (paleolimnoloogia)Objectives/eesmärkid:  Üliõpilased saavad selgeks hüdrobioloogia põhialused ja -mõisted. Nad omandavad ülevaate erinevatest veeökosüsteemidest, hüdrobiontide rühmadest ning neid mõjutavatest keskkonnateguritest. Tudengid jõuavad arusaamisele veeökosüsteemide struktuurist ja funktsioneerimisest. Nad teadvustavad vastastikused seosed veeökosüsteemide, globaalsete kliimanähtuste ning inimtegevuse vahel.Learning outcomes/õpiväljund:  Õppeaine edukal läbimisel üliõpilased:  * Valdavad hüdrobioloogia põhimõisteid ja hüdrobioloogiliste protsesside ning seoste toimimise põhiprintsiipe. * Tunnevad peamisi hüdrobiontide rühmi ja oskavad välja tuua hüdrobiontide kohastumusi eluks vee-biotoopides ning nende suhteid keskkonnateguritega. * Oskavad tuua näiteid hüdrobiontide vahelistest suhetest, toiduahelatest ja mõistavad neid kontrollivaid mehhanisme. * Omavad ülevaadet erinevatest veeökosüsteemidest, nende struktuurist ja seda kujundavatest teguritest. * Oskavad leida ja selgitada seoseid veeökosüsteemide, inimtegevuse ning globaalsete kliimanähtuste vahel. * On võimelised nägema konkreetseid hüdrobioloogilisi probleeme ka laiemas sotsiaal-majanduslikus või globaal-ökoloogilises kontekstis. * Oskavad iseseisvalt leida vajalikku informatsiooni, seda kriitiliselt analüüsida ning seostada eelnevalt omandatud teadmistega. Ei ole.\n\nNo other information."}