{"KURSUSE_NIMI": "Digitaalne pilditöötlus", "KURSUSE_KOOD": "LOTI.05.037", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Algoritmid ja andmestruktuurid", "Sissejuhatus andmeteadusesse", "Kõrgem matemaatika I", "Programmeerimine II"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 64, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "The course will help to build a foundation of image processing knowledge on top of preexisting skill of programming, some of which is preferably in Python. The content will be mainly targeted at Master's level students. \nSeminars consist of presenting research results or chapters from the textbook, and discussion. Lab sessions comprise (of) understanding how the core principles of image processing work and how to implement them. \nThe content may include, but is not limited to the following: image formation, compression and representation, colour spaces, pattern recognition, depth and stereo imaging, segmentation, some ML.Objectives/eesmärkid:  The main objective of this course is to give a systematic understanding of image processing techniques to Master's level (or advanced Bachelor's level) students using practical assignments, seminars and a project.Learning outcomes/õpiväljund:  Having passed the course, the successful student is expected to be improved in understanding: * pixels, voxels and vectors; * dimensionality of images; * convolution, inertia, convexity, eigenvectors and eigenvalues; * the colour spaces used for images; * methods compensating for non-ideal light conditions; * handling hardware related image distortions; * determining the hardware limitations of the capturing system; * build an end-to-end image processing pipeline;  * field-specific machine learning. The material is fairly new - do expect some changes and deviations during the semester.\n\nWe will have one 2h timeslot and one 4h timeslot each week for on-site activities with an optional 2h consultation every other week. All of this takes place Wednesdays and Thursdays.\n\nThe use of ChatGPT or any other AI-based software is not allowed in the course."}