{"KURSUSE_NIMI": "Nutilahenduste praktikum", "KURSUSE_KOOD": "LOTI.05.060", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 48, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 30, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Antud praktikumi jooksul käsitletakse praktiliselt asjade interneti (IoT) komponentide ühendamist reaalselt toimivateks ja reaalseid probleeme lahendavateks süsteemideks. Õpitakse, et näiliselt tehniliselt keerulisi ja standardiseeritud või standardeid eeldavaid lahendusi on võimalik igaühel teostada suhtelislt odavalt ja lihtsamalt. Selleks läbitakse ettevalmistatud üldpraktikumid ja probleemõppel baseeruv iseseisev projekt.Objectives/eesmärkid:  Õppida praktiliselt tundma lihtsaid ja käepäraseid võimalusi nutimaailma loomiseks enda ümber:  * nutiseadmetega nagu nuti(mobiil)telefonid, tahvelarvutid jt. kontrollida ja juhtida kodus, tööl ja mujal andureid ja täitureid, meeleahutusseadmeid, turvalisusseadmeid, energia tootmist, jaotamist ja salvestamist sõltumata oma asukohast, nii maalt kui merelt; * saada praktiline ülevaade asjade interneti (Internet of Things, IoT) komponentidest; * luua ise praktiline IoT lahendus.Learning outcomes/õpiväljund:  Praktikumi läbimisel õpitakse tundma: * Raspberry Pi 2 kasutamine välisseadmete juhtimiseks; * (esma)teadmised Linuxi kasutamisest; * klient-server ideoloogia põhialuseid ja praktilist kasutamist; * erinevate traadita (WiFi, Bluetooth, infrapuna, mobiilside) ja traadiga (ethernet) seadmetega suhtlemist ja kontrollimist; * erinevaid sensoreid (veebikaamera, liikumisandur, temperatuuri-, rõhu-, niiskusandur, vooluandur); * välisseadmete autonoomset varustamist elektrienergiaga; * lihtsama rakenduse loomist Android-operatsioonisüsteemile seadmete juhtimiseks; * reaalse probleemi iseseisvat lahendamist. Kõik muud tingimused, juhendid, lisa- ja abimaterjalid, jooksev info jne. on saadaval kursuse moodle'i lehel.\n\nRühmatähiste selgitused: N1: N - nädalapäev (E, T, K, N, R); 1 - aeg (1 - 8..12 või 10-14, 3 - 16..20)\n\nExplanation of the group labels: N1: N - day of week (E(Monday), T(Tuesday), K(Wednesday), N(Thursday), R(Friday)); 1 - time slot (1 - 8..12 or 10-14, 3 - 16..20),"}