{"KURSUSE_NIMI": "Investeerimine iseendasse: visioon, karjäär, enesejuhtimine ja edu", "KURSUSE_KOOD": "LOTI.05.102", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 68, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "See kursus annab tudengitele teadmised ja tööriistad, et tõhusalt planeerida ja juhtida oma isiklikku, akadeemilist ja professionaalset arengut. Kursusel käsitletakse teemasid nagu eesmärkide seadmine, õpitehnikad, ajaplaneerimine ja produktiivsus, samuti väärtuspõhised otsused ja enesemotivatsioon. Tudengid õpivad looma visiooni ja strateegiat, arendama ettevõtlusoskusi, rakendama juhtimisstrateegiaid ning finantsplaneerimist. Lisaks keskendutakse suhete juhtimisele, inimtüüpide mõistmisele ning füüsilise, intellektuaalse ja emotsionaalse heaolu hoidmisele. Kursus ühendab teoreetilised teadmised praktiliste harjutustega, valmistades tudengeid ette isikliku ja professionaalse kasvu sidumiseks.Objectives/eesmärkid:  Kursuse eesmärk on pakkuda tudengitele teoreetilisi teadmisi ja praktilisi oskusi, mis aitavad neil sõnastada oma isikliku ja professionaalse elu visiooni ning koostada selle elluviimiseks strateegia ja tegevusplaaniLearning outcomes/õpiväljund:  *  Oskab seada isiklikke õpieesmärke, koostada tegevusplaani ja kasutada tõhusaid õpitehnikaid. *  Suudab planeerida aega, suurendada produktiivsust ja hoida motivatsiooni. *  Oskab luua isikliku visiooni ning koostada strateegia selle elluviimiseks. *  Tunneb ettevõtluse põhimõtteid ja oskab oma ideid tootestada. *  Mõistab juhtimise strateegiaid ja tööriistu ning suudab teha teadlikke ja kaalutletud otsuseid. *  Tunneb inimtüüpide mudeleid ning oskab analüüsida oma tugevusi ja arenguvõimalusi. *  Teab suhete juhtimise, konfliktide lahendamise ja meeskonnatöö aluseid. *  Oskab planeerida oma finantse ning omab ülevaadet investeerimisstrateegiatest. *  Teab, kuidas hoida tervist, suurendada energiat ja juhtida emotsioone igapäevaelus."}