{"KURSUSE_NIMI": "Robootika II", "KURSUSE_KOOD": "LOTI.05.088", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimine II", "Kõrgem matemaatika I", "Robootika I", "Algoritmid ja andmestruktuurid"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 84, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Eesmärk on anda valdkonnas kogemust omavale õppijale võimalus mitmesuguste robotite käitamiseks, arendades seeläbi nende programmeerimisoskust. Tegu ei ole sissejuhatava kursusega.Objectives/eesmärkid:  Kursuse eesmärk on edasijõudnud robootikahuviliste teadmiste arendamine, lahendades väljakutsuvaid praktilisi ülesandeid.Learning outcomes/õpiväljund:  Selle kursuse edukalt läbinud tudeng on: * rakendanud olekumasinate teoreetilisi ideid praktilises kontekstis keeruliste ülesannete lahendamiseks; * juhtinud mitmeid (mobiilseid) robotplatvorme; * rakendanud pilditöötlust reaalajaprobleemide lahendamisel; * implementeerinud kontrollalgoritmi roboti tasakaalu hoidmiseks; * tutvunud samaaegse lokaliseerimise ja kaardistamise ülesandega; * tuttav kinemaatika otsese ja pöördülesandega; * harjutanud erialastel teemadel kursusekaaslastega arutlemist; * harjutanud füüsilistel robotitel tarkvara arendamist ja testimist. Selle kursuse eelduseks on LOTI.05.010 Robootika I kursusel õpetatud kontseptsioonide tundmine ja praktiliste oskuste rakendamine. Õpilased peavad oskama Pythonis programmeerimist edasijõudnu tasemel. Java tundmine ei ole vajalik. Õpilane peab olema võimeline lahendama iseseisvalt keerukaid programmeerimisülesandeid ning saama aru teiste kirjutatud koodist.\n\nSõltuvalt praktikumist on tudengitel võimalik riistvara laenutada.\n\nProjekti jaoks on vajalik, et saaksid olla füüsiliselt kohal vähemalt kahel täispäeval juunis. Projekti jaoks on nõutav töö väljaspool praktikume.\n\nKursusele registreerimisel võid eeldada kutset vestlusele õppejõududega, mille eesmärk on hinnata sinu eelnevate teadmiste taset.\n\nSemestri jooksul toimub 3 loengut. Need ei ole kohustuslikud, kuid aitavad sind praktikumide ja projektiga.\n\nChatGPT või muu tehisintellektil põhineva rakenduse kasutamine ei ole kursusel lubatud."}