{"KURSUSE_NIMI": "Digitaalne signaalitöötlus", "KURSUSE_KOOD": "LOTI.05.064", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika I", "Programmeerimine arvutitehnikutele"], "SOOVITUSLIKUD_EELDUSAINED": ["Mõõte- ja juhtimissüsteemid", "Robootika I", "Nutilahenduste praktikum", "Objektorienteeritud programmeerimine"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine annab ülevaate tänapäeval praktikas laialdaselt kasutusel olevatest digitaalse signaalitöötluse põhitõdedest. Loengutes käsitletakse põhiliselt signaalide diskreetimist, digitaalseid filtreid, sagedusruumi ning toetavat matemaatilist aparatuuri. Praktikumides on võimalik õpitut rakendada kasutades ühe põhitöövahendina programmeerimiskeelt Python. Lisaks toimub töö Vikipeedia keskkonnas.Objectives/eesmärkid:  Õppeaine eesmärgiks on anda ülevaade digitaalse signaalitöötluse põhitõdedest ja -printsiipidest reaalsete süsteemidega töötamisest tuleneva praktilise kogemuse kaudu.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud tudeng: 1. oskab kasutada analoog-digitaalmuundurit ning valida sobiva kvantimistasemete arvu; 2. oskab pidevat signaali diskreetida ja kvantida ning hinnata tekkivat müra ja moonutusi; 3. oskab arvutada kahe diskreetse funktsiooni sidumit ja teab mõningaid rakendusi; 4. on implementeerinud ja mõistab diskreetse Fourier' pöörde (DFT) sisu; 5. teab, mis on IIR- ja FIR-filtrid; 6. on kasutanud mitmeid signaalitöötluse tööriistu; 7. on kasutanud õpitud metoodikaid kompleksülesande lahendamisel; 8. on õppinud eeltoodud töövahendite kasutamist keeles Python; 9. on aidanud luua Eestikeelset signaalitöötluse alast sisu Vikipeedia keskkonnas. Praktikumid: toimuvad sellel semestril kõigi eelduste kohaselt Nooruse 1 hoones.\nLoengud: toimuvad kohapeal, olemas on otseülekanne (aga see ei anna osaluse punkte), salvestusi ei ole.\n\nHaigustunnustega õpperuumidesse ei lubata. Palume jääda kodusele ravile ja konsulteerida lektoriga õppetöö korraldamise osas.\n\nChatGPT või muu tehisintellektil põhineva tarkvara kasutamine ei ole kursusel lubatud."}