{"KURSUSE_NIMI": "Teaduslike tulemuste vormistamine", "KURSUSE_KOOD": "LOTI.01.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Antud kursus vaatleb biomeditsiini näitel teaduse tegemise protsessi katse planeerimisest tulemuste vormistamiseni teadusartikliks ja teaduslikuks ettekandeks. Loengud käsitlevad teadust kui terviklikku protsessi, mis viib läbi hüpoteesi püstitamise, katse planeerimise, andmeanalüüsi, järelduste tegemise, vormistamise ja avaldamise teadusliku karjäärini. Kursus ei eelda osalejailt matemaatilist tarmu, küll aga soovi küsida küsimusi selle kohta, mis asi on teadus ja kuidas seda tehakse. Statistikat vaadeldakse teadusliku argumendi osana, mitte selle asendajana. Kursuse tähtsaim osa on iga osaleja poolt kirjutatud teadusliku käsikirja retsenseerimine nii teiste osalejate kui õppejõudude poolt, teadustulemuste suuline ettekandmine ning järgnev teaduslik diskussioon. \n\tLoengutes käsitletavad küsimused: vaatlus ja eksperiment, randomiseerimine, valimi suuruse määramine, katse ja kontrolli seosed, katsesüsteemi omadused, katse läbiviimine ja dokumenteerimine, sisemine ja väline üldistatavus, regressioon keskmisele, teadusliku ja statistilise hüpoteesitestimise seosed ja erinevused, korrelatsioon ja põhjuslikkus, tõde ja tõenäosus; küsimused, mida saab statistika abil küsida, erinevad lähenemised nullhüpoteesi testimisele (Neyman-Pearson, Fisher ja nende kriitikud), erinevat tüüpi olulisusintervallid, nende tõlgendused ja kasutusviisid, tõepärade suhted kui tõendusmaterjali hulga mõõt (Royall), Bayesi tüüpi lähenemised statistikale ja teaduslikule meetodile, erinevad vead ja nendega võitlemise meetodid, käsikirja kirjutamine, toimetamine ja avaldamine, eduka ettekande pidamine, teaduslik karjäär.Objectives/eesmärkid:  Arendada teadustulemuste esitamise oskuseidLearning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane -\ttunneb teadustöö kui protsessi erinevaid etappe, -\toskab koostada teaduslikku suulist ettekannet, -\ttunneb teadusartiklile esitatavaid nõudeid ja teadusartiklite retsenseerimise põhimõtteid,  -\tmõistab autori eetikat, õigusi ja kohustusi. Aine toimumise ajaks pannakse ÕISi kõigi loengute slaidid."}