{"KURSUSE_NIMI": "Robootika projekt", "KURSUSE_KOOD": "LOTI.05.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Tehniline joonestamine", "Robootika I", "Programmeerimine", "Võistlusrobootika projekt", "Projektijuhtimine", "Mikroprotsessorid", "Riistvaraprojekt"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 12, "seminar": 36, "independent_work": 100, "individual_work": 8, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Praktiliste robootika valdkonna probleemide lahendamine toimub individuaalsete projektide teostamise kaudu. Tudengid seavad endale eesmärgid, jagavad projekti alamosadeks, planeerivad nende teostamise ajakava ja lahendavaid muid projekti elluviimisega seotud ülesandeid. Iganädalaste seminaride raames arutatakse läbi iga projekti senine edenemine, tekkinud probleemid ja nende lahendused. Juhendajad nõustavad tudengeid konkreetsete tehniliste probleemide ületamisel. Semestri lõpus esitlevad tudengid valminud roboteid ja projekti teostamise kulgu.Objectives/eesmärkid:  Anda üliõpilastele eesmärgistatult tehtava praktilise tähtajalise projekti ja selle tööde planeerimise, dokumenteerimise ja ellu viimise (prototüübi valmistamise) kogemus.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: * oskab eesmärgistada robootika või muu riistvaraarenduse projekti, määratleda selle oodatavat tulemust ning koostada ülevaatlikku projektiplaani; * oskab jagada projekti alamtöödeks ja määrata nendevahelised sõltuvused ning teostatavuse järjestuse, hinnata tegevuste mahtusid ning tulemustele vastavust; * oskab dokumenteerida projekti tegevusi ning suuliselt ja kirjalikult edasi anda erialast infot ja põhjendada oma seisukohti nii esitluse kui vestluse vormis; * suudab hallata nii projekti praktiliste tööde teostamist kui ka strateegilist juhtimist ning on võimeline tagama tööde tähtaegse valmimise; * tajub probleeme, mis on seotud projektidega, millel on mitu erisisulist alamosa, ning oskab vajadusel tekkinud probleeme lahendada; * oskab vastavalt plaanile projekti ellu viia ning kohandada tegevusi vastavalt projekti nõuete muutumisele; * oskab kasutada agiilset arendusmetoodikat. Ainele pääsemise aluseks on tasemevestlus õppejõuga.\n\nJuunis toimub projektide lõpudemo, mille kuupäev lepitakse kokku esimestel nädalatel."}