{"KURSUSE_NIMI": "Võistlusrobootika projekt", "KURSUSE_KOOD": "LOTI.05.023", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimine", "Robootika I", "Elektroonikaseadmete disain ja tootmine"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 52, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Töö toimub 3-4 liikmelistes rühmades. Iga rühm ehitab roboti, mis vastab DeltaX võistluse (https://ut-robotics.github.io/robot-basketball-rules/delta-x-2022/basketball_rules_eng.html) tingimustele. Kõik rühmad osalevad võistlusel, kus selgitatakse välja parim robot. Roboti ehitamine sisaldab roboti kere ehitust, andurite paigaldamist, mootorite ja andurite ühendamist mikroprotsessoriga, mikroprotsessori programmeerimist ja terviklahenduse testimist. Osaleda võivad kõik üliõpilased, kellel on teadmisi mehaanikas, mikroprotsessortehnikas või programmeerimises ning projektijuhtimises. Rühmad komplekteeritakse nii, et igaühes oleks esindatud roboti ehitamiseks vajalik kompetents. Kursusel osalemiseks on vaja avaüritusest osa võtta. Täpsem info esimeses loengus.Objectives/eesmärkid:  Kursuse eesmärk on õpetada kasutama ning omandada praktilisi oskusi elektroonikas, mehaanikas, mehhatroonika projekti juhtimises, disainis ning meeskonnatöös. Kursus toimub intensiivse meeskonnatöö vormis, kus piiratud aja jooksul tuleb valmis ehitada robot, mis täidab etteantud ülesanded.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Oskus realiseerida riistvaraline projekt grupitöökorras, kiirelt omandada vajalikud lisateadmised ning osata meeskonnana funktsioneerida Sissejuhatav loeng toimub 5. septembril 2024 kell 18:15 Deltas, ruumis 2024. Stardilaager toimub 7. ja 8. septembril kell 10:00-18:00 (2-päevane). Selle käigus õpetatakse roboti ehitamist ja moodustatakse meeskonnad."}