{"KURSUSE_NIMI": "Robootika I", "KURSUSE_KOOD": "LOTI.05.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 64, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Sissejuhatus robotisüsteemidesse kasutades Raspberry Pi'd ja Pico't koos GoPiGo platvormiga. Praktikumid ja projekt annavad võimaluse lahendada mitmeid praktilisi ülesandeid ning täidavad seejuures enamiku kursuse mahust. Põhiline programmeerimiskeel on Python.Objectives/eesmärkid:  Käesoleva robootikakursuse eesmärk on robootikaalaste baasteadmiste andmine nii teoreetilisel kui ka praktilisel tasemel. Seejuures arendatakse ka neid teadmisi toetavat programmeerimisoskust.Learning outcomes/õpiväljund:  Selle kursuse läbimisel on tudeng: * osavam Pythoni programmeerimiskeele kasutamisel; * kokku puutunud Raspberry Pi-l põhineva robotplatvormiga; * analüüsinud, mis on robot; * tuttav mõne võimaliku robotisüsteemi ülesehitusega; * tuttav põhiliste andurite ja täituritega; * tuttav põhiliste liikumismehhanismidega; * tuttav roboti positsioneerimise võimalustega; * tuttav mõningate andmesidelahendustega; * omandanud oskuse roboti abil andmeid koguda ja töödelda; * võimeline saadud teadmisi rakendama robootikaalases projektis. Esmakursuslaste ÕIS'i lisamise järel tõstame praktikumirühmade limiite.\n\nJulgustame teid ainele ka siis registreeruma, kui teid huvitav rühm on hetkel täis! Me lisame vajadusel uusi rühmi. Gruppide limiidid on esialgu madalamad, et jätta ruumi septembris alustavatele tudengitele.\nPraktikumid toimuvad kahes erinevas õppehoones: TÜTI (Nooruse 1) ja Delta keskus (Narva mnt 18). Selle eesmärk on tudengite jalavaeva vähendamine.\n\nLoengud toimuvad kohapeal, kuid olemas on ka otseülekanne. Punktiarvestuse mõttes loeb ainult loengus kohapeal osalemine.\n\nPalume õppetöös osaleda ainult ilma haigusnähtudeta. Haigestumise korral on võimalik küsida vastutavalt õppejõult tähtaegade pikendusi."}