{"KURSUSE_NIMI": "Bakalaureusetöö arvutitehnikas", "KURSUSE_KOOD": "LOTI.05.029", "EAP": 12, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 312, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Bakalaureusetöö on eksperimentaalse või teoreetilise teadusliku uurimuse põhjal koostatud iseseisev kirjalik töö.Objectives/eesmärkid:  Luuakse tingimused ülevaate saamiseks erialase uurimistöö spetsiifikast ning vastavasisulise uurimistöö läbiviimisest ja tulemuste esitamisest.Learning outcomes/õpiväljund:  Lõputöö kaitsmise tulemusena üliõpilane: 1) oskab rakendada omandatud teadmisi teadusprobleemide sõnastamisel, vastavate uuringute planeerimisel ja läbiviimisel, kogutud andmete põhjal järelduste tegemisel ning nende kirjalikul ja suulisel esitamisel; 2) oskab leida ja analüüsida teaduslikku infot ning suudab sellest ja enda poolt kogutud teaduslikest andmetest sünteesida uusi erialaseid teadmisi; 3) oskab koostada ja pidada avalikku ettekannet ning end väljendada oma erialal nii suuliselt kui ka kirjalikult ja kaitsta oma seisukohti; 4) tunneb teaduseetika üldprintsiipe ning oskab hinnata oma valdkonna uuringute teaduslikku taset ja rakenduslikku väärtust. Bakalureusetööde esitamise tähtaeg talviseks kaitsmiseks on 23.12.2024 kell 23:59:59.\nLõputöö esitatakse kursuse moodle'i keskkonnas. \nLõputöö fail tuleb esitada digiallkirjastatult PDF-formaadis koos vajaliku litsentsiga. \nSamaaegselt tuleb esitada ka juhendaja arvamus digiallkirjastatult PDF-formaadis samuti moodle'is.\nLõputööde kaitsmised toimuvad 14.01.2025 algusega kell 09:00 tehnoloogiainstituudis Nooruse 1-121.\nBakaleureusetööle on vajalik lisada lihtlitsents, mis annab ülikoolile loa töö avaldamiseks ja säilitamiseks raamatukogu digitaalarhiivis. Lihtlitsentse on kahte tüüpi - tavaline ja ajalist piirangut kehtestav. Seda, millise litsentsi te oma lõputööle lisate, otsustab teie juhendaja. Kui soovitakse lõputööle kehtestada ajalist piirangut, tuleb vormistada ka vastav taotlus dekaani nimele.\n\nMuu lõputööd puudutav info nagu kaitsmiste ajakava,  lõputöö latex'i template ning pdf-näidis jne. on veebilehel https://tuit.ut.ee/et/sisu/loputoode-kaitsmine ja kursuse moodle'is https://moodle.ut.ee/course/view.php?id=3957."}