{"KURSUSE_NIMI": "Digitaalne maailmapilt", "KURSUSE_KOOD": "LTAT.00.020", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aines antakse ülevaade digitaalsete (0/1) tehnoloogiate põhiolemusest ning nende arengu loogikast ja kasutusvõimalustest. Aine on ülevaateaine kõikide erialade kõikidele tudengitele. \nKursuse kodulehekülg:  https://courses.cs.ut.ee/2022/digit/springObjectives/eesmärkid:  Aine eesmärk on anda kõikide erialade tudengitele ülevaade digitehnoloogiate tööpõhimõtetest, seletada lihtsas keeles ja näidete abil selle toimimise aluseid. Peale aine läbimist on tudengil valmidus planeerida enda edasisi vajalikke aineid ja mõtestada lahti digipöörde mõju ja uusi võimalusi enda eriala kontekstisLearning outcomes/õpiväljund:  Aine läbinud üliõpilane:  - Mõistab digitaalsete lahenduste olemust, seoseid, selle üha kiirenevat arengut - Tunneb ära olulisemad IT terminid ja teab nende tähendusi ning seoseid - Oskab hinnata digitaalse jalajälje mahtu - Teeb vahet ideel, algoritmil, programmil ja töötaval tehnoloogial - Teeb vahet andmetel ja andmebaasil, tarkvaralahenduste kihtidel - Oskab eristada tehnoloogia abstraktsiooni tasemeid (näiteks füüsiline, loogiline, mitmed eri rakenduskihid) ja valida endale sobiva taseme - Saab aru arvutite, Interneti ja telekommunikatsioonitehnoloogiate toimimisest kasutaja ja mittespetsialisti tasemel ning kirjeldada IKT võimalusi enda eriala vaatest - Oskab elementaarsel viisil selgitada IT maailma põhitõdesid nagu informatsioon, andmed, andmebaas, algoritm, programm, arvutivõrk, päring, andmeturve, jt. - Saab aru küberturvalisuse vajadusest ja oskab end kaitsta  - Oskab vestelda IKT lahenduste äritehnoloogiliste võimaluste üle - Oskab sõnastada digipöörde võimalusi enda erialal - On motiveeritud, huvitatud ja positiivselt meelestatud digitaalse maailma võimaluste suhtes"}