{"KURSUSE_NIMI": "Sügavõpe masinnägemises", "KURSUSE_KOOD": "LTAT.02.028", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Masinõpe"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Alates numbrimärkide tuvastamisest kuni kaugelearenenud neerumassi avastamiseni on masinnägemise algoritmidest saanud võtmetegur paljudes valdkondades, mis on kaasaegse ühiskonna jaoks olulised, sealhulgas transpordis, meditsiinis, e-kaubanduses, kunstis ja meelelahutuses. Sügavtehisnärvivõrgud on selle edusammu südames. See kursus keskendub sügav tehisnärvivõrkude vaatevinklist masinnägemise ülesannetele, nagu pildi klassifikatsioon, objektide tuvastamine ja segmenteerimine. Me vaatleme peamisi arhitektuure, koolitusprotsesse ja tulemuste mõõdikuid, mida kasutatakse nende ülesannete täitmisel. Lisaks uurime ka kaugelearenenud masinnägemise teemasid, nagu pildi genereerimine, tähelepanu ja muundurid, samuti omaks võtlikku ja nõrgalt juhendatud õpetamist. Õpilased omandavad praktilised oskused, mis on vajalikud reaalse masinnägemise projekti läbiviimiseks.Objectives/eesmärkid:  -Arendada põhjalikku arusaama masinnägemise ja sügavõppe kontseptsioonidest, sealhulgas pildiklassifitseerimisest, objektide tuvastamisest ja segmenteerimisest, samuti nende rakendustest tänapäeva ühiskonnas. Uurida ka edasijõudnud masinnägemise teemasid, nagu pildi genereerimine, tähelepanu ja transformerid ning isesuunatud ja nõrgalt juhendatud õpe, et mõista, kuidas neid saab rakendada reaalmaailma stsenaariumides. -Saada praktilisi kogemusi sügavõppe arhitektuuride, koolitusprotsesside ja tulemusnäitajate osas, mis on tavaliselt kasutusel masinnägemise ülesannetes, näiteks konvolutsioonilised tehisnärvivõrgud (CNN), piirkonnapõhised CNN-id ja masintransformaatorid. -Arendada praktilisi oskusi, mis on vajalikud reaalmaailma masinnägemise projekti kavandamiseks ja rakendamiseks, sealhulgas andmete eeltöötlemine, mudeli koolitus ja hindamine. -Tugevdada probleemide lahendamise ja kriitilise mõtlemise oskusi praktiliste ülesannete, juhtumianalüüside ja rühmaarutelude kaudu.Learning outcomes/õpiväljund:  -Omavad põhjalikku arusaama masinnägemise ja sügavõppe kõige fundamentaalsematest kontseptsioonidest, sealhulgas pildiklassifitseerimisest, objektide tuvastamisest ja segmenteerimisest, samuti nende rakendustest tänapäeva ühiskonnas.\n-On tutvunud edasijõudnud masinnägemise teemade põhimõtetega, nagu pildi genereerimine, tähelepanu ja transformerid ning isesuunatud ja nõrgalt juhendatud õpe.\n-Mõistavad sügavõppe arhitektuuride peamisi omadusi, mis on kasutusel masinnägemise ülesannetes, näiteks konvolutsioonilised neuronvõrgud (CNN), piirkonnapõhised CNN-id ja masintransformaatorid.\n-Omandavad praktilisi kogemusi koolitusprotsesside ja tulemusnäitajate osas, mis on tavaliselt kasutusel masinnägemise ülesannetes raamistiku abil, mis simuleerib reaalmaailma masinnägemise projekti.\n-Omandavad võime analüüsida, tõlgendada ja edastada masinnägemise projektide tulemusi selgelt ja lakooniliselt."}