{"KURSUSE_NIMI": "Privaatsus ja andmekaitse - eetilised, õiguslikud ja IT aspektid", "KURSUSE_KOOD": "LTAT.02.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 36, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 12, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine keskendub andmete töötlemisega kaasnevatele õiguslikele, eetilistele ja poliitilistele küsimustele. Aines lahatakse andmete elutsükliga seodes ette tulevaid infovabaduse, privaatsuse, turvalisuse, julgeoleku, tarbijakaitse jpm teemasid, mis on viimase kümne aasta jooksul kujunenud õigusliku reguleerimise esemeks. Läbi juhtumianalüüside tutvustatakse erinevaid tehnilisi, õiguslikke ja turupõhiseid lahendusi riskide tuvastamiseks ja maandamiseks.  Objectives/eesmärkid:  Andmetöötluse maht ja keerukus kaasaegses ühiskonnakorralduses on viimase kümne aasta jooksul kaasa toonud hulga õiguslikke nõudeid. Aine eesmärk on tutvustada infole juurdepääsu ja selle kasutamise, isikuandmete kaitse, andmemajanduse, andmete tarbijate ja kasutajate õiguste tagamise, andmeturbe ja andmete valitsemise ja haldamise õiguslikke nõuded viisil, mis võimaldab vastavaid riske andmeteaduse ja andmeanalüüsi projektides ära tunda ja hallata.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: -oskab ära tunda ja struktureeritult ning süsteemselt analüüsida andmeteaduse projektides ette tulevaid privaatsuse ja andmekaitsega seotud õiguslikke ja eetilisi küsimusi;\n-mõistab andmete töötlemise ja kaitsega seotud mõisteid, printsiipe ja regulatsiooni Euroopa Liidu õigusruumis;\n-suudab tuvastada andmete töötlemisega seoses tekkida võivaid õiguslikke ja eetilisi probleeme; \n- teab, kuidas õigusakte leida, lugeda, tõlgendada ja rakendada;\n-omab ettevalmistust, et suhelda andmeteaduse alastes projektides juristide ja õigusloome spetsialistidega. Kursus on osaliselt veebipõhine. Individuaaltundides käsitletakse täiendavalt elektroonilise side valdkonnas andmete töötlemisele esitatavaid nõudeid, andmetöötlust teadustöös ja statistikas ja andmetöötluse erinõudeid õiguskaitse ja julgeoleku valdkonnas. Individuaaltunnid (3 x 2h) toimuvad nädalatel 29, 31 ja 33 kell 12.15-13.45 zoomis. Zoomi lingi saadab õppejõud individuaaltunnile eelregistreerunud üliõpilastele. Individuaaltundidesse võib registreeruda ka täiendavaks konsultatsiooniks või tagasisideks - iga individuaaltunni lõpus on küsimustele ja vastustele planeeritud 15-30 minutit."}