{"KURSUSE_NIMI": "Mobiilsuse modelleerimine", "KURSUSE_KOOD": "LTAT.06.016", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus andmeteadusesse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selle kursusel käsitleme muuhulgas järgmisi teemasid:\n- liikuvusandmed ja -mõõdikud,\n- sõidukite mobiilsuse modelleerimine,\n- aktiivse mobiilsuse modelleerimine,\n- heitkoguste modelleerimine,\n- üleminek säästvale linnaliikuvusele,\n- mobiilsus kui sotsiaal-majanduslik näitajaObjectives/eesmärkid:  Antud kursus annab ülevaate mobiilsuse modelleerimise põhimõtetest ning aktuaalsetest teemadest linnaplaneerimises. Kursuse peamine eesmärk on kasutada andmeid mõistmaks kuidas, millal, kus ning miks inimesed liiguvad. Läheneme probleemidele linnaliikuvuses inimesekeskselt, vastupidiselt traditsioonilisele sõidukikesksele lähenemisele, analüüsides liikuvuse lühi- ja pikaajalisi mõjusid keskkonnale ja ühiskonnale. Selle kursuse lõpuks on tudengil ülevaade põhilistest teemadest linnaplaneerimises ning kontseptuaalne arusaam erinevatest mudelitest. Tudeng saab ka vajalikud tehnilised oskused, et läbi viia analüüse liikuvusandmetega. Praktikumides kasutame Python-it, nii et vajalik on eelnev kogemus programmeerimisega. Praktikumide põhiline eesmärk on tutvustada tudengitele erinevaid meetodeid ja tööriistu, mida kasutatakse liikuvusmudelite loomisel ja linnaliikuvuse analüüsimisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursus aitab üliõpilasel mõista, kuidas liikuvuse modelleerimine võib aidata lahendada olulisi probleeme transpordiplaneerimises nii maal kui ka linnas. Lisaks annab kursus üliõpilastele teadmised ja oskused, mis on vajalikud liikuvusmustrite tuvastamiseks, liikuvuse modelleerimiseks ning erinevate probleemide analüütiliseks lahendamiseks."}