{"KURSUSE_NIMI": "Objektorienteeritud programmeerimine", "KURSUSE_KOOD": "LTAT.03.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Programmeerimine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Java programm, kompileerimine, käivitamine.\nAlgtüübid. Avaldised.\nValikulaused, tsüklid.\nOOP paradigma. Objektid ja klassid. Muutujate skoobid. Objektide edastamine meetoditele.\nStaatilised meetodid. Signatuur. Java massiiv.\nSõnetöötlus ja tekstiline I/O.\nPärimine ja polümorfism. Meetodite ülekatmine. Klass Object.\nAbstraktsed klassid ja liidesed. Mähisklassid. Liides Comparable.\nGraafika programmeerimine. JavaFX.\nSündmused. Kuularid.\nKasutajaliidese loomine.\nErindid.\nSündmuste töötlemine. Sündmused. Kuularid.\nVood. Binaarne I/O.\nDünaamilised andmestruktuurid (list, magasin, järjekord).\nJava andmestruktuurid. Liides Collection. Liidesed List ja Map.\nLõimed.Objectives/eesmärkid:  Kursuse eesmärgiks on anda alusteadmised objekt-orienteeritud programmeerimise eripärast, oskused programmide koostamiseks ning esmased rühmatööoskusedLearning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:  *oskab selgitada objekt-orienteeritud paradigma põhimõisteid (kapseldus, abstraktsioon, pärimine, polümorfism, üledefineerimine, ülekate) ning analüüsida vastavaid programme *oskab kirjeldada erinevaid andmestruktuure (massiiv, ahel, magasin, järjekord, paisktabel) ja nende kasutusviise *oskab selgitada rakendusteekide väärtust ja olemust ning leida nendest vajalikku informatsiooni *oskab selgitada sündmuspõhise programmeerimise eripära ja erindite käitlemist ning tuua näiteid nende kasutamisest *oskab ühes objekt-orienteeritud programmeerimiskeeles kasutades integreeritud programmeerimiskeskkonda koostada, testida ja siluda programme, rakendades selleks eelmistes punktides loetletut *oskab kirjeldada isikliku kogemuse põhjal rühmaprojekti keskseid elemente Info süvendusrühma kohta: varasem kogemus Javaga ei ole vajalik. Süvendusrühmas on plaan läbida põhirühma teemad kiiremini ning kasutada ülejäänud aega erinevate ägedate lisateemade käsitlemiseks. See rühm sobib neile, kes on selles aines nõus teistest natuke rohkem vaeva nägema (ja selle eest saada lisaks 3 EAP ainena LTAT.03.026)."}