{"KURSUSE_NIMI": "Võrgustike analüüs", "KURSUSE_KOOD": "LTAT.02.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kõik on omavahel seotud. Selle mõistmiseks algab kursus motiveeriva loenguga, mis käsitleb erinevaid rakendusi ja näiteid sotsiaalvõrgustike analüüsist. Järgmsiena tutvustatakse analüüsi põhimõtteid sh statistilised meetodid. Samuti käsitletakse erinevaid \nmikrokonseptsioone - näiteks kuidas tuvastada olulisi sõlmpunkte võrgustikus;\nmesokonseptsioone - näiteks kuidas tuvastada ühte huvirühma suuremas võrgustikus;\nmakrokonseptsioone - näiteks, kuidas kuidas mõista tervet võrgustiku struktuuri.\nKursusel käsitletakse ka teemaisd nagu ennustamine, informatsiooni voolavus, sisestus graafidesse, graafide konvolutsioonilised võrgustikud.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada võrgustike analüüsi põhimõtteid kasutades praktilisi harjutusi. Tudengid õpivad, kuidas analüüsida ja tõlgendada erinevate osapoolte (näiteks inimesed) vahelisi seoseid sotsiaalvõrgustikes. Kursusel näidatakse, kuida sotsiaalvõrgustike analüüs kasutab matemaatilka (graafiteooria), sotsiaalteaduste (sotsioloogia, majanadus) ja loodusteaduste ning inseneerika (füüsika, arvutiteadus) teooriad probleemide lahendamiseks erinevates valdkondades. Lisaks tutvustatakse tudengitele ka keerukamaid tehisnärvivõrkude tehnikaid. Praktikumides kasutatakse andmete analüüsimiseks, modelleerimiseks ja visualiseerimiseks tööriistu nagu Python, Gephi.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane  Oskab kavandada iseseisvat sotsiaalvõrgustike uuringut; Oskab koguda andmeid on-line ja off-line võrgustikes; Oskab kogutud andmeid kasutada edasises analüüsis; Oskab viia läbi sotsiaalvõrgustike uuringut tuginedes võrgustike analüüsi teooriatele ja kasutades tööriistu nagu Gephi, R ja Python."}