{"KURSUSE_NIMI": "Virtuaalreaalsus", "KURSUSE_KOOD": "LTAT.06.019", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Arvutigraafika seminar"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Virtuaalreaalsus (VR) on muutmas meie töö- ja mänguharjumusi. Suurimaks trendiks on metaversum, mis võib asendada Interneti selle praegusel kujul. Käesolev kursus valmistab tudengeid ette metaversumite loomiseks ning õpetab praktiliselt virtuaalreaalsuse rakendusi looma. Kursus katab VR elamuste sisuloome, optimeerimise, interaktsiionid, parimad arenduspraktikad ja tiimi põhise VR rakenduste loomise. Aines avastatakse ja kogetakse mängudisaini ja töökeskkondade piire ning julgustatakse tudengeid oma virtuaalreaalsuse ideid ellu viima ja ise aine projekti raames metaversumit looma.Objectives/eesmärkid:  Tudeng omadab järgmised teoreetilised ja praktilised teadmised: Virtuaalreaalsuse (VR) ajalugu ja kontekst VR rakenduste disainimine VR rakenduste täiustamise meetodid Interaktsioonid VR keskkondades Graafika, valgustuse, heli ja video disain VR keskkondades Erinevused töö, mängu ja hariduslike VR keskkondade disainimisel.Learning outcomes/õpiväljund:  Aine läbinud tudeng: -Teab, oskab lugeda ja analüüsida ajalugu, rolli ja kasutusi virtuaalreaalsuses (VR). -Disainida ja ehitada keskmise suurusega VR rakendusi väikestes meeskondades. -Kriitiliselt analüüsida ja täiustada eksisteerivad VR rakendusi ning rakendada parimaid praktikaid. -Mõistab ja oskab rakendada erinevaid VR kontseptsioone, nagu lokomotsioon ja inimeste interaktsioonid virtuaalmaailmas. Ning on võimeline hindama nende sobivust kasutamise mugavusele, personaalsele ruumile ja tervisele. -Mõistab ja oskab luua ning parandada VR graafikat ja disaini. -Mõistab ja oskab kasutada erinevaid valgustamise tehnikaid ja animatsioone, et parandada VR stseene. -Optimeerida sisu ja rakendust selliselt, et see sobiks määratud VR seadmel kasutamiseks. -Oskab lisada 360 kraadist mono või stereograafilist videoprojektsiooni. -Konfigureerida ruumilist audiosignaali VR elamustes kasutamiseks. -Kasutada VR keskkondi nii mängudes kui ka töökeskkondades ja simulatsioonides. -Teab võimalusi mitme kasutajaga interaktsioonide ja mitmikmängude loomiseks virtuaalreaalsuses."}