{"KURSUSE_NIMI": "Sissejuhatus plokiahela tehnoloogiasse: praktiline töö", "KURSUSE_KOOD": "LTAT.05.027", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatus Blockchaini tehnoloogiasse"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "pass", "KIRJELDUS": "Põhitegevuste lühikirjeldus. Põhitegevuste hulka kuulub (1) kursuse materjali iseseisev õpe kursuse veebilehel, (2) töökojas aktiivne osalemine. Töökojas peavad õppurid sooritama ülesandeid, vastama küsimustikele ning läbima teste.Objectives/eesmärkid:  1. Defineerida blockchaini põhilisi omadusi; arvestada blockchaini tehnoloogia sisulist võimekust.  2. Valida sobivad plokiahela kavandamise ja implementeerimise tööriistad; täpsustada, parendada, uuendada ning avalikuks teha kavandusotsuste formaalne lähenemine blockchaini rakenduse arendamiseks ja kasutamiseks.  3. Tutvustada, kuidas blockchaini tehnoloogia omaduses saavad tõkestada või uuendada olemasolevaid ärimudeleid ja äriprotsesse; vaadelda olemasolevaid plokiahelapõhiseid kasutusmalle tööstustes nagu finants, avalikud teenused, tarneahelad jne.  4. Tutvustada protsessi- ja olekupõhiseid modelleerimiskeeli, mis sobivad blockchaini rakenduste nõuete analüüsiks ja kavandamiseks; kasutusmalli tuvastamine, sobiva platvormi valimine, väärtust loova lahenduse kavandamine ning nõuetele vastava prototüübi loomine.Learning outcomes/õpiväljund:  Õppeüksuse 1 õpiväljundid. Õppurid on võimelised \n1. Anda ülevaade spetsiifilise blockchain rakenduse hüvedest ja pahedest, rõhuga turvalisusel, hajususel ja üksmeele saavutamisel.\n2. Iseseisvalt selgitada  targa lepingu loogikat kirjeldatud blockchainikeskses olukorras.\nÕppeüksuse 2 õpiväljundid. Õppurid on võimelised \n1. Valida plokiahelaplatvormide vahel, olukorrapõhiste nõudeid luua ja vormistada. \n2. Kavandada olukorrapõhiseid tehnilisi nõudeid. \nÕppeüksuse 3 õpiväljundid. Õppurid on võimelised \n1. Kasutada regulatoorseid ja juriidilisi raamistike blockchaini tehingutes. \n2. Soovitada blockchaini tehnoloogiat äride ja tehingute uuendamiseks. \n3. Blockchaini rakenduse SWOT-analüüsi läbi viia. \n4. Blockchainipõhiseid äriprotsesse ja äriloogikat kavandada. \n5. Blockchaini omadusi selgitada tööstuse kasvu kontekstis. \nÕppeüksuse 4 õpiväljundid. Õppurid on võimelised \n1. Blockchaini rakenduse nõudeid määrata ning rakendust kavandada. \n2. Blockchaini platvormi funktsionaalseid ja mittefunktsionaalseid nõudeid määrata ja vormistada. \n3. Kavandada ja testida prototööpi, mis põhineb olemasoleval plokiahelal. \n4. Arendada ja kasutada sobivat blockchaini arhitektuuri."}