{"KURSUSE_NIMI": "Eestikeelne kommunikatsioon arvutiteaduses", "KURSUSE_KOOD": "LTAT.01.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ainekursusel keskendutakse eestikeelse lõputöö kirjutamise toetamisele. Üldisteks teemadeks on teadusteksti struktuur, allikakriitilisus, refereerimine ja viitamine (sh automaatne viitehaldus), tekstisidusus, erialainfootsing, oskussõnavara (sh tõlkeline), akadeemilise ettekande koostamine ja esitamine, populaarteaduslik tekst, tarbetekst. Kõik kursusel tehtavad iseseisvad tööd on seotud lõputöö teemaga: refereeriv tekst kirjutatakse ühe alateema kohta, andmebaasidest otsitakse bakalaureusetöö jaoks sobivaid allikaid, akadeemiline ettekanne valmistab ette kaitsekõneks. Lisaks koostavad tudengid ajakava oma uurimistöö tegemiseks. \nOrtograafia teemad on põimitud teiste teemade sisse ja neid käsitletakse läbivalt.Objectives/eesmärkid:  Kursus on esimene etapp lõputöö kirjutamisel ja valmistab üliõpilasi ette iseseisvaks uurimistööks. Tudengid õpivad tundma ja kriitiliselt lugema teemaga seonduvat erialakirjandust. Õpivad tundma lõputöö ülesehituse ja vormistuse peensusi. Õpivad koostama lõputöö plaani ja ajakava ning seda järgima. Läbi praktiliste harjutuste  tõstetakse tudengite eneseväljendusoskuseid, mis aitaks neid nii akadeemilises keskkonnas, kui ka oleks abiks tööjõuturul. Harjutustele antakse regulaarset tagasisidet.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased\n- mõistavad eneseväljendusoskuse tähtsust (sh lõputöö koostamisel ning esitamisel),\n- teavad põhilisi reaalteaduste üliõpilaste kirjalikes töödes esinevaid õigekeelsusprobleeme ning oskavad neid vältida,\n- teavad teadusliku ning populaarteadusliku teksti erinevusi,\n- koostavad uurimistöö plaani ja ajakava ning järgivad seda, reflekteerivad oma tööprotsessi üle,  teevad koostööd juhendajaga ja kaasüliõpilastega; \n- tunnevad avaliku esinemise ja esitluse koostamise head tava,\n- on analüüsinud oma lõputöö eesmärkide püstitamise ning valdkonna ülevaate koostamise keelelist ja sisulist korrektsust,\n- tunnevad informaatika eriala lõputööde vormistusnõudeid,\n- on alustanud oma lõputöö kirjutamist."}