{"KURSUSE_NIMI": "Andmebaasisüsteemide uurimisseminar", "KURSUSE_KOOD": "LTAT.05.013", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sissejuhatus põhikontseptsioonidesse ja põhimõtetesse, mis moodustavad automaatse masinõppe (AutoML) aluse.\nErinevate AutoML-i raamistike ja tööriistade uurimine\nErinevate AutoML-i lahenduste tugevuste ja piirangute analüüs.\nAutoML-i mõju masinõppe töövoogude tõhususele ja juurdepääsetavusele.\nAutomatiseeritud masinõppe lähenemisviisiga seotud väljakutsete ja eetiliste kaalutluste arvestamine.\n     Mudeli tõlgendatavuse ja läbipaistvuse olulisuse uurimine tehisintellekti kontekstis.\nMusta kasti mudelite mõjude ja tõlgendatavate alternatiivide vajaduse mõistmine.\nAI mudelite tõlgendatavamaks muutmiseks loodud erinevate meetodite ja algoritmide põhjalik uurimine.\nAutoML ja seletatav tehisintellekt (XAI) koos toimimise uurimine.\nArutelu selle üle, kuidas nende lähenemisviiside integreerimine võib viia tugevamate ja tõlgendatavamate masinõppemudeliteni.Objectives/eesmärkid:  Seminari peamine eesmärk on anda osalejatele sügav ja põhjalik arusaam tänapäeva masinõppe kahest kriitilisest aspektist: automatiseeritud masinõpe (AutoML) ja seletatav tehisintellekt (XAI). Kursuse eesmärk on süveneda AutoML-i ja XAI täiustatud kontseptsioonidesse, metoodikatesse ja rakendustesse, andes osalejatele teadmisi ja oskusi, mis on vajalikud masinõppe areneval maastikul navigeerimiseks ja sellele kaasaaitamiseks.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane oskab:\n1. Struktureeritult koguda, analüüsida ja esitada informatsiooni edasijõudnute teemadel andmebaasisüsteemide valdkonnas.\n2. Arendada kriitilise mõtlemise oskust ning võimet mõista ja lahendada lahtisi väljakutseid andmebaasisüsteemide vallas."}