{"KURSUSE_NIMI": "Krüptotehnika", "KURSUSE_KOOD": "LTAT.04.019", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 16, "seminar": 0, "independent_work": 116, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selle kursuse eesmärk on õppida krüptoprimitiive tõhusalt rakendama ja neid analüüsima, võttes arvesse põhilisi teostusründeid. See kursus sisaldab materjale sissejuhatusest krüptograafiasse ja algoritmidesse.\nSellel kursusel käsitleme aritmeetilisi tehteid lõplikes korpustes/rühmades, nagu näiteks jäägi leidmine mooduli järgi, modulaarne korrutamine, pöördelemendi leidmine ja astendamine. Anname täisarvude/polünoomide aritmeetika algoritmide rakendamise üksikasjad lõplikes korpustes/rühmades, võttes arvesse tõhusust ja ajastusrünnakuid. Seejärel viime  krüptosüsteemid ellu, võttes arvesse tõhusust ja põhilisi ajastusrünnakuid. Arutame avatud lähtekoodiga krüptoteeke  tõhususe ja turvalisuse mõttes.\nKursusel käsitletakse järgmisi teemasid: avatud lähtekoodiga krüptograafilised teegid, lõpliku korpuse aritmeetika realiseerimise algoritmid, modulaarne aritmeetika, asenduspermutatsioonivõrk, plokkšifrid, räsifunktsioonid, avaliku võtme krüpteerimine, võtmevahetuse/kapseldamise mehhanismid, elliptilise kõvera aritmeetika, võrepõhine krüptograafia.\nObjectives/eesmärkid:  Selle kursuse ulatus hõlmab: Uurime krüptosüsteemide rakendusi. Määratleme algoritmilisel tasemel lõpliku korpuse  aritmeetika (modulaarne redutseerimine, korrutamine, astendamine jne), mida on vaja krüptosüsteemide realiseerimiseks. Väljendame tõhusaid rakendusmeetodeid. Arutame krüptosüsteemide juurutamiseks kasutatavate algoritmide keerukust, jõudlust ja maksumust. Tutvustame avatud lähtekoodiga krüptoteeke. Anname põhilised vastumeetmed teostustaseme (ajastamisel põhinevate) rünnakute jaoks. See kursus hõlmab matemaatiliste tõestuste lugemist ja kirjutamist ning programmeerimist. Vajaliku matemaatilise tausta seletame  kursusel lahti.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: mõistab krüptosüsteemi elluviimise põhimõisteid õpib lõplike korpuste/rühmade aritmeetiliste tehete  keerukusanalüüsi oskab võrrelda krüptoalgoritmide rakendamise tulemuslikkuse hindamise tehnikaid ja optimeerimistehnikaid oskab analüüsida ja võrrelda  avatud lähtekoodiga krüptoteeke arendada oskusi tõhusate krüptograafiliste rakenduste asjus"}