{"KURSUSE_NIMI": "Tehisintellekt", "KURSUSE_KOOD": "LTAT.01.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Programmeerimine Pythonis tekstiandmetega"], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus andmeteadusesse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Masinõpe, tehisnärvivõrgud. Pilditöötlus, kõneliidesed. Loomuliku keele töötlus. Robotid ja isesõitvad autod.\nMängude strateegia ja mitte mängitavate tegelaste käitumine... Profit!\n\nÕppeaine sobib neile, kes on juba saanud selgeks programmeerimist, algoritme ja andmestruktuure, ning on valmis õppida rakendada neid praktiliste ülesannete lahendamiseks. Peamine sihtgrupp on 2.-3. kursuse informaatika bakatudengid, kuid vajalike taustateadmiste ja -oskuste olemasolul on kõik vaprad ja kartmatud teretulnud!Objectives/eesmärkid:  Kuidas saab automaatselt tuvastada, kas pildi peal olev inimene on Jaak Vilo? Millised algoritmid juhivad tolmuimeja rooboteid ja isesõitvaid autosid? Kas inimkeelt saab modelleerida kasutades suurt hulka tekste internetist? Kursuse eesmärk on tutvuda tehisintellektiga, ning mõnede selle valdkonna harudega nagu masinõpe, loomuliku keele töötlus, pilditöötlus, jt. Tutvuda saab nii teoreetilise küljega (probleemid, lahendused, algoritmid), kui ka praktiliselt, lahendades tehisintellekti ülesandeid praktikumites ning kodutöö jooksul.Learning outcomes/õpiväljund:  Kursuse põhiteemad on: - masinõpe - pilditöötlus, kõnetöötlus, loomuliku keele (teksti) töötlus - robotite ja agentide käitumise modelleerimine - mängude strateegia Kursuse läbinud tudeng on tutvunud nende teemade teoreetilise taustaga, tunneb nende aktuaalseid ülesandeid, nende olemasolevaid lahendusi, ning kust alustada, kui on vaja ise neid lahendada."}