{"KURSUSE_NIMI": "Autonoomse juhtimise alused", "KURSUSE_KOOD": "LTAT.06.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Tõenäosusteooria ja statistika I", "Programmeerimise alused"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeainel käsitletavad teemad:\n* Lokaliseerimine\n* Kaardistamine\n* Samaaegne lokaliseerimine ja kaardistamine\n* Liikumise kavandamine\n* Kontroll\n* Tunnetamine ja tajumine\n* Anduri liitmine\n* Interaktsioonide ja käitumise modelleerimine\n* Otsast lõpuni lähenemisedObjectives/eesmärkid:  Robootika vaatenurgast üldiselt viitab \"autonoomsus\" või \"ise juhitavus\" roboti võimele töötada ilma inimeste sekkumiseta. Sama määratlus kehtib ise juhtiva sõiduki juhtimise osas, näiteks sõiduki võime liikuda ja end juhtida ilma inimeste sekkumiseta.  See on sissejuhatav kursus autonoomse sõitmise teemal. Kursus hõlmab erinevaid tehnikaid ja alamsüsteeme, mis on vajalikud sõidukite ise juhitavuse tagamiseks. See hõlmab sõiduki võimet tajuda oma keskkonda, kaardistada oma keskkonda ja lokaliseerida ennast kaardil, kavandada oma liikumist enda keskkonnas, teostada seda liikumist sujuvalt, samuti tuvastada, modelleerida ja ennustada teiste selles keskkonnas esinevate agentide käitumist.Learning outcomes/õpiväljund:  Õppeaine läbinud õpilane on võimeline: I. Rakendama kaardipõhist lokaliseerimist osakeste filtreerimise abil II. Rakendama SLAM-i simuleeritud eksterotseptiivsete ja propriotseptiivsete andmete jaoks III. Selgitama erinevaid robotite liikumise kavandamise strateegiaid IV. Rakendama külgmise positsiooni juhtimisstrateegiat V. Kirjeldama väljakutseid käitumise modelleerimisel autonoomses sõidus VI. Mõistma erinevate ekstratseptiivsete andurite tajumissüsteemide plusse ja miinuseid, mida kasutatakse ise autonoomses sõidus VII. Saama aru andurisüsteemi kasutuselevõtu etappidest"}