{"KURSUSE_NIMI": "Pilvetehnoloogia", "KURSUSE_KOOD": "LTAT.06.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aines kaetakse järgmised teemad: Pilvetehnoloogia, IaaS, PaaS, serverivabad rakendused, Mobiilpilve teenused, Uduarvutused ja Suurandmetöötluse lahendused nagu MapReduce, and SparkObjectives/eesmärkid:  Pilvetehnoloogia paradigma on märkimisväärselt viimase kümnendi jooksul arvutiteaduse võimalusi avardanud, võimaldades arvutusliku ressursi pakkumist kommunaalteenusena. See on püüdnud nii akadeemiliste ringkondade, tööstuse ja valitsusasutuste tähelepanu. Nüüdseks toimivad pilvetehnoloogiaid kaasaegse majanduse selgroona, pakkudes tellimuspõhiseid teenuseid igal ajal ja kohas, järgides  \"maksa-palju-kasutad\" mudelit.\nSee on innustanud: (1) iduettevõtete loomist, (2) skaleeruvate, globaalsete ettevõtterakenduste loomist, (3) parema maksumuse-väärtuse vahekorraga teaduslike, suurandmete ning suure jõudlusega rakenduste loomist ja (4) uute mudelite kasutamist nutikate lahenduste loomisel. \nSelle kursuse eesmärk on anda üliõpilastele ülevaade pilvetearvutusest, erinevatest pilveteenuste funktsionaalsustest, hajusandmetöötlusest pilves, pilveteenuste kasutamisest mobiilpilve kaudu ning viimastest selle valdkonna arengutest,nagu serverivabad arvutused ning uduarvutused. \nKursus lõpeb põhjaliku aruteluga pilvetehnoloogia tuleviku  arengusuundade üle.Learning outcomes/õpiväljund:  Selle kursuse edukal läbimisel omandab üliõpilane:  1.\tPõhjalikud teadmised erinevat tüüpi pilveteenuste kohta 2.\tOskused luua skaleeruvaid ettevõtte rakendusi 3.\tOskused rakendada hästi tuntuid tehnikaid andmete töötlemiseks pilves  4.\tTeadmisi erinevate nutikate (ubiquitous, pervasive) lahenduste süsteemimudelite kohta."}