{"KURSUSE_NIMI": "Privaatsust säilitavad tehnoloogiad", "KURSUSE_KOOD": "LTAT.04.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tutvustab erinevaid privaatsuskaitse tehnoloogiaid - nende ülesehitust, nende poolt antavaid ja mitte antavaid garantiisid, nende kasutamise eeldusi eri rakendustes ja protsessides. Tehnoloogiaid kirjeldatakse kategoriseerituna järgmise kolme laia kasutusvaldkonna vahel: olemitevahelise kommunikatsiooni privaatsuskaitse, privaatsust säilitav õiguste ja mandaatide haldamine ja tuvastamine, privaatsust säilitav andmetöötlus. Esimesse kategooriasse kuuluvad tehnloogiad nagu krüpteerimine, sibulmarsruutimine või pimepost. Teise kategooriasse kuuluvad näiteks anonüümsed mandaadid, rühma- ja ringisignatuurid. Kolmandasse kategooriasse kuuluvate tehnoloogiate näideteks on andmete anonümiseerimine ja pseudonümiseerimine, diferentsiaalprivaatsus ja andmete lahterdamine. Eraldi vaatame mitmesse eri kategooriasse kuuluvate tehnoloogiate loomiseks kasutatavaid primitiive nagu nullteadmustõestused, turvaline ühisarvutus või pimesignatuurid.\nLisaks privaatsuskaitse tehnoloogiate tutvustamisele õpetab kursus ka nende valimist ja kasutamist olemasolevate või loodatavate infosüsteemide turvamiseks.Objectives/eesmärkid:  Anda tudengitele arusaam eri tüüpi informatsiooni töötlemisest tulenevatest tehnoloogilistest ohtudest privaatsusele. Anda tudengitele ülevaade paljudest erinevatest privaatsust säilitavatest tehnoloogiatest, ühes nende rakendatavuse, kasutatavuse ja tehtavate kompromissidega eri infotöötluslugudes. Õpetada tudengid disainima privaatsust säilitavaid infosüsteeme, võttes arvesse kompromisse erinevate privaatsus- ja funktsionaalsuseesmärkide vahel.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane - Saab aru tehnoloogilistest ohtudest privaatsusele, mõistes, millistele andmetele ja kasutuslugudele need rakenduvad, ja kui tugevalt. - Oskab analüüsida erinevate infosüsteemide kasutamisega ja iseenda andmejagamistegevustega seotud privaatsusriske. - Suudab kirjeldada eri privaatsust säilitavate tehnoloogiate detaile. - Oskab eri privaatsust säilitavaid tehnoloogiaid klassifitseerida lähtudes nende kasutatavusest, tõhususest ja hinnast (pidades silmas nii arvutuskeerukust, organisatsioonikeerukust, kui ka infosüsteemi funktsionaalsuse vähenemist). - Oskab valida uue või olemasoleva infosüsteemi jaoks sobiliku privaatsust säilitavate tehnoloogiate komplekti. - Oskab infosüsteemi disainides kasutada privaatsuslõime põhimõtteid, et luua kogu infosüsteem sellisena, kus võimalike lekete vähendamine on lihtne."}