{"KURSUSE_NIMI": "Andmebaasid", "KURSUSE_KOOD": "LTAT.03.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 26, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 100, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Relatsioonilise andmebaasi põhimõisted. SQL struktuur ja süntaks. Andmestruktuuride kirjeldamise (DDL) ja andmete muutmise keeled (DML). Lihtsad päringud, filtreerimine, grupeerimine, agregeerimine. Vaated ning andmetele ligipääsu piiramine. Andmeterviklikkus. Andmebaasisüsteemid ja andmemudelid. Enam levinud andmemudelid. Andmebaasi projekteerimise teooria relatsioonilises mudelis. Relatsioonilise andmemudeli keeled, nende klassifikatsioon, reaalsed keeled. Päringute optimeerimine. Andmebaaside eriküsimusi (andmelaod, andmekaitse, töökindlus jt.).Objectives/eesmärkid:  Saada ülevaade relatsiooniliste andmebaaside loomise ja käsitlemise vahenditest, tutvuda relatsiooniliste andmebaaside teooria alustega.Learning outcomes/õpiväljund:  Selle kursuse lõpetanu: - nimetab relatsiooniliste andmebaaside teooriaga seotud põhimõisteid;  - kirjeldab relatsioonilise andmebaasi disainimise printsiipe ja kirjeldab disainiga seotud dilemmasid; - disainib tuntud valdkonna andmemudeli, kasutades ER diagrammi ja oskab seda teisendada relatsiooniliseks mudeliks; - loeb teiste arendajate poolt loodud skeeme; - kirjeldab andmebaase SQL-keeles; - koostab päringuid andmebaasidele kasutades SQL keelt mõistes päringute loomise loogikat; - normaliseerib vajadusel andmebaasiskeeme kasutades funktsionaalsete sõltuvuste teooriat; - koostab päringuid nii relatsioonalgebras kui SQL-s; - koostab erinevaid vaateid antud andmebaasile; - koostab ja muudab funktsioone, protseduure ja trigereid; - kirjeldab, miks ja kuidas andmeid indekseerida; - loob andmebaaside koopiaid, kasutajarühmi, dokumentatsiooni; - nimetab relatsiooniliste andmebaaside eeliseid ja piiranguid; - kirjeldab, mis on andmekaeve ning selle seost andmebaasidega."}