{"KURSUSE_NIMI": "Andmetehnika", "KURSUSE_KOOD": "LTAT.02.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käesolev kursus õpetab andmeteaduse peamisi praktilisi oskusi, nagu andmete kogumine, puhastamine ja muundamine kasutades erinevaid andmete allikaid ning formaate (veebilehed, sotsiaalmeedia, veebiteenused, SQL- ja NoSQL-andmebaasid ning struktureeritud ja lihttekstifailid) ja andmete organiseerimine lähtuvalt erinevatest standardsetest andmemudelitest (relatsioonilised mudelid, mitmemõõtmelised mudelid). Kursus keskendub keskmise suurusega andmetele, kuid käsitleb põgusalt ka suurte andmete jaoks mõeldud tööriistu.Objectives/eesmärkid:  Kursuse põhieesmärk on omandada praktilisi programmeerimisoskusi andmete kogumiseks, puhastamiseks, muundamiseks ning organiseerimiseks, lähtudes mitmetest andmemudelitest. Kursus katab enamik tavalisemaid andmeformaate, -mudeleid ja -tehnoloogiaid.Learning outcomes/õpiväljund:  Kursuse edukal lõpetamisel oskab tudeng:\n* Koguda andmeid mitmesugustest allikatest, nagu veebilehtedelt, sotsiaalmeediast, veebiteenustest, SQL- ja NoSQL-andmebaasidest ning struktureeritud, JSON- ja lihttekstifailidest;\n* Hinnata ja mõõta andmete kvaliteeti ja kogust;\n* Puhastada andmeid, tuvastades ning töödeldes duplikaate ning puuduvaid väärtusi;\n* Organiseerida ning muundada andmeid sobivatele kujudele, nagu Pythoni andmestruktuurid, relatsioonilised andmebaasid, struktureeritud või lihttekstifaili formaadid;\n* Ehitada automaatseid andmetöötluse töövooge keskmise suurusega andmetele;\n* Ehitada andmetele mudeleid kasutades erinevaid andmete modelleerimise metoodikaid nagu relatsiooniline modelleerimine ja mitmemõõtmeline modelleerimine;\n* Kirjeldada erinevate andmete säilitamise ja töötlemise tehnoloogiate eeliseid ja piiranguid, lähtuvalt etteantud nõuetest (näiteks töötlemine pakikaupa või reaalajas);\n* Kirjeldada mõningate suurte andmete tehnoloogiate tugevusi ning nõrkusi."}