{"KURSUSE_NIMI": "Avaliku võtme krüptograafia", "KURSUSE_KOOD": "LTAT.04.017", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse eesmärk on tutvustada traditsioonilisi avaliku võtme krüptosüsteeme ja kvantkindlaid võrepõhiseid krüptosüsteeme. Sellel kursusel vaatleme avaliku võtmega krüptosüsteeme, mis põhinevad täisarvu faktoriseerimise probleemil ja diskreetse logaritmi probleemil erinevate rühmade lõikes. Arutame avaliku võtme krüptosüsteemi rakendamiseks vajalikke algoritme. Arutame raskete probleemide lahendamist. Vaatleme postkvantkrüptograafiat keskendudes võredele. Pakume üksikasju kvantkindlate krüpteerimisskeemide, võtmekapseldamise mehhanismide ja digitaalallkirja skeemide kohta.\nKursusel käsitletakse järgmisi teemasid: täisarvu faktoriseerimise probleem, RSA krüptosüsteem, diskreetse logaritmi probleem, Diffie-Hellmani võtmevahetus vahetus, täisarvu faktoriseerimise ja diskreetse logaritmi probleemi lahendamine, elliptilise kõvera krüptograafia, algoritmid RSA rakendamiseks, Diffie-Hellmani võtmevahetus ja ECDSA, sissejuhatus postkvantkrüptograafiasse, võrepõhisesse krüptograafiasse.Objectives/eesmärkid:  - Määratletakse avaliku võtme krüptograafia idee. Arutelu selle üle, miks me vajame avaliku võtmega krüptograafiat, viiakse läbi reaalsete näidetega. - Esitatakse täisarvude faktoriseerimine ja diskreetse logaritmi ülesanded. Arutatakse nende probleemide lahendamise algoritme. - Vaadeldakse krüptograafias kasutatavaid elliptilisi kõveraid  - Vaadeldakse traditsiooniliste avaliku võtme krüptosüsteemide (RSA, DH, ECDSA, ECDH) implementeerimise algoritme. Arutatakse rakendamise üksikasju. - Tutvustatakse kvantkindlaid krüptosüsteemide perekondi. Arutatakse võrepõhiseid krüptosüsteeme. See kursus hõlmab matemaatiliste tõestuste lugemist ja kirjutamist ning programmeerimist. Vajaliku matemaatilise tausta selgitame kursusel.Learning outcomes/õpiväljund:  -mõistma avaliku võtme krüptograafia põhimõisteid ja tähtsust -genereerima avaliku võtme krüptosüsteemide parameetrite komplekte -analüüsima ja võrdlema avaliku võtme krüptimise, võtmevahetuse ja digitaalallkirja skeeme, võttes arvesse keerukust ja arvutuslikult rasket probleemi -õppima tundma postkvantkrüptograafia standardimise jõupingutusi krüptimise, võtmevahetuse ja allkirjaskeemide jaoks -võrdlema võrepõhiseid krüptosüsteeme turvalisuse ja jõudluse osas."}