{"KURSUSE_NIMI": "Asjade internet", "KURSUSE_KOOD": "LTAT.06.020", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Erinevad allikad ennustavad, et 2030. aasta lõpuks jõuab nutikate ja võrku ühendatud seadmete hulk 50-100 miljardini. Seoses hiljutise suure hinnalangusega võrgutehnoloogiates ja juhtmevabade mikrokontrollerite, andurite, aktuaatorite suurenenud kättesaadavusega on antud valdkonnas potentsiaal massilisteks ärivõimalusteks ja innovatsiooniks. See on Asjade Interneti tärkamine.\n\nAntud aines uurime lähemalt, mida hõlmab endast Asjade Internet ning selle taga olevad jõud, selle mõju. Kogeme seda praktiliselt, ehitades ning leiutades uusi seadmeid. Õpime ka, kuidas integreerida neid seadmeid süsteemidesse ja võrkudesse. Süsteemidisainil on oluline osa selles õppeaines.\n\nKuna disainiprotsess on keeruline, vaatame praegusi masinaside (machine-to-machine) suhtlustehnoloogiaid kui ka raamistikke ning raamistike arendamist. Katame  ka majanduslikke väljavaateid selles valdkonnas, proovime neid ka ennustada. Õpime kriitiliselt reflekteerima, hindama ning rakendama olemasolevaid lahendusi enda innovatiivsete lahenduste realiseerimiseks.\n\nPraktikumides vaatame nii väikesemahulisi tee-seda-ise (DIY) lahendusi, mida võiks kasutada ära meie vahetus keskkonnas, kui arutame ka võimalikke rakendusi ja mõju tööstuses. Kogu klassiruumis toimuv töö, sh nii luhtumised kui ka edulood dokumenteeritakse isiklikus portfoolios, mida saab ära kasutada tulevikus tööotsinguil ning mis on ka põhiliseks hindamise aluseks aines.\n\nAine hõlmab järgnevaid tehnoloogiaid: ESP8266/ESP32 arendus, Arduino, Kommunikatsiooniprotokollid (RS232,  I2C, SPI, MQTT, HTTPS), NodeRED, IoT, IoTempower.Objectives/eesmärkid:  Peale selle aine läbimist, peaksid oskama: -Defineerida ja kriitiliselt reflekteerida \"Asjade Interneti\" mõiste üle ning positsioneerida Asjade Interneti tehnoloogiat võrdluses pilve- ja mobiiliarvutustega -Varustada enamusi füüsilisi objekte võrku ühendatud anduritega -Varustada enamusi füüsilisi objekte aktuaatoritega ning neid mõjutada -Kirjutada koodi, et kokku panna süsteeme, mis koguvad, visualiseerivad, analüüsivad ning reageerivad andmetele füüsilisest keskkonnast -Disainida ja implementeerida erinevaid Asjade Interneti süsteeme mis hõlmavad andureid, juhtmevaba võrguühendust  ning aktuaatoreid -Ehitada ja testida terviklikku, toimivat Asjade Interneti süsteemi ning disainida ja teostada vastavad simulaator-komponendid, et testimist kiirendada -Esitleda ja kaitsta loodud Asjade Interneti süssteemide disaine ning lahendusi portfoolios ja avalikes esitlustesLearning outcomes/õpiväljund:  Aine edukalt läbinud üliõpilane: -Oskab disainida, kokku panna ning ehitada Asjade Interneti süsteemide prototüüpe, mis hõlmavad andur- ning aktuaatorseadmeid -Teab, kuidas tagada Asjade Interneti süsteemi skaleeruvus suure hulga seadmeteni, pidades silmas energiasäästlikust ning hallatavuse lihtsust -On võimeline kasutama Asjade Interneti integratsiooniraamistikke kiireks süsteemide prototüüpimiseks ja monitooringuks."}