{"KURSUSE_NIMI": "Arvutigraafika edasijõudnutele", "KURSUSE_KOOD": "LTAT.05.035", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Arvutigraafika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 14, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus sisaldab kaasaegse arvutigraafika jaoks olulisi teemasi: edasilükatud renderdamine, volümeetriline renderdamine, füüsikal põhinev varjutamine, mittefotorealistlik renderdamine, fraktaalid, võrestamine, järeltöötlusefektid ja anti-aliasimine. Kursuse käigus üliõpilane õpib implementeerima enamikest nendest teemadest algoritme ise valitud tehnoloogiatega ning tutvustama oma lahendusi teistele. Samuti üliõpilane tutvub osade teemade puhul mõjusate teadusartiklitega ning õpib tegema nendest kokkuvõtteid.\n\nIga teema kohta on interaktiivsete näidetega illustreeritud kirjalik õppematerjal õpikeskkonnas CGLearn.Objectives/eesmärkid:  - Anda üliõpilastele arusaam olulistest kaasaegsetest 3D arvutigraafika tehnikatest, algoritmidest, teooriast, probleemidest ja lahendustest. - Valmistada üliõpilased ette töötama arvutigraafika programmeerija ametikohal videomängustuudios või arvutigraafika ettevõttes kaasaegsete ja keeruliste probleemidega. - Seostada arvutigraafika valdkonna teadusartiklite sisu praktiliste probleemide lahendamisega.  - Pakkuda üliõpilastele võimalust tutvuda ja arutada olulisi kaasaegseid arvutigraafika tehnikaid. - Anda üliõpilastele võimalus arendada iseseisva probleemide lahendamise, õppimise ja tutvustamise oskusi.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: - On tuttav arvutigraafika valdkonna oluliste teemadega: edasilükatud renderdamine, volümeetriline renderdamine, füüsikal põhinev varjutamine, mittefotorealistlik renderdamine, fraktaalid, võrestamine, järeltöötlusefektid ja anti-aliasimine. - Mõistab enamike nende teemade väljakutseid, olulisust, mõju ja lahendusi. - Oskab enamikes nendes teemades implementeerida arvutigraafika algoritme ja rakendada arvutigraafika tehnikaid oma eelistatud tehnoloogiatega. - Oskab enamikes nendes teemades lugeda teemakohaseid teadusartikleid ning teha nendest kokkuvõtteid ja järeldusi. - Oskab oma arvutigraafika-alaseid õpitud teadmisi, tehtud järeldusi ja loodud lahendusi teistele tutvustada. Õppeaine tugevalt soovituslikuks eelduseks on eelnevalt õppeaine arvutigraafika (MTAT.03.015) edukas läbimine."}