{"KURSUSE_NIMI": "Operatsioonisüsteemid", "KURSUSE_KOOD": "LTAT.06.001", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimine", "Arvuti arhitektuur ja riistvara I"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaade operatsioonisüsteemide funktsioonidest, ülesehitusest ja tööpõhimõtetest. Tuginetakse peamiselt Unix-laadsetele operatsioonisüsteemidele, kuid käsitlus on laiem, hõlmates ka teistes operatsioonisüsteemides kasutatavaid meetodeid.Objectives/eesmärkid:  Kursuse läbinu mõistab, mis ja milleks on operatsioonisüsteem   ning kuidas see töötab. Kursuse läbinu on paigaldanud ja skriptinud vähemasti Windows- ja Unix-tüüpi opsüsteeme.Learning outcomes/õpiväljund:  Kursuse läbinu * Saab aru, missugustest kihtidest ja komponentidest operatsioonisüsteem  koosneb ning kuidas toimub suhtlus erinevate osade vahel ning   füüsilise ja virtualiseeritud riistvaraga * Mõistab paralleeltöötlust - protsesse, lõimi,  mitmeprotsessorisüsteeme, sünkroniseerimist ja planeerimist * Saab aru salvestussüsteemidest ja failisüsteemidest - mis on nende  ülesanded, liidesed ja algoritmid; on ise hallanud salvestussüsteeme  ja failisüsteeme * Saab aru mäluhaldusest ja virtuaalmälust * Saab aru arvutivõrkude kihtidest ja TCP/IP protokollidest * On paigaldanud ja hallanud Windows- ja Unix tüüpi operatsioonisüsteeme * On kasutanud skriptimist operatsioonisüsteemi tasemel objektide  juhtimise automatiseerimiseks Praktikumides on väga soovitav kasutada oma sülearvutit. Esimesse praktikumi võtta sülearvuti kohe kaasa, vajalikud 64-bit OS (Windows, Linux, MacOS), VT-x virtualiseerimine (protsessoril olemas, BIOS-ist mitte keelatud ning mitte kasutusel muu virtualiseerimistarkvara poolt nagu Hyper-V), VirtualBox (saab koha peal paigaldada) ja 60G vaba ruumi. Praktikumide sooritamiseks ei sobi Apple M1, M2, M3 jne seeria protsessoriga arvutid."}