{"KURSUSE_NIMI": "Küberturvalisuse juhtimine", "KURSUSE_KOOD": "LTAT.05.036", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel käsitletavad teemad hõlmavad turvalist süsteemi modelleerimist, turbehaldusstandardeid, turbe domeenimudelit, riskijuhtimist, riskide hindamist, kaitstud varade haldamist, turvariske ja turvalisuse vastumeetmeid (nt juurdepääsukontroll, läbistustestimine, identiteedihaldus jne. ), turbetaseme hindamine, turbe haldamist erinevat tüüpi süsteemides (nt äriprotsessiteadlikud süsteemid, intelligentne infrastruktuur, plokiahelapõhised süsteemid, identiteedihaldussüsteemid, riskiteadlikud digikriminalistika valmissüsteemid jne).Objectives/eesmärkid:  Kursus annab õpilastele ülevaate küberturvalisuse juhtimise põhimõtetest. Osalejad õpivad turvariskide juhtimist ning kuidas tagada varade konfidentsiaalsuse, tervikluse ja käideldavuse. Kursusel analüüsitakse ka turvanõuete haldamist ja vastumeetmeid (nt juurdepääsukontroll, identiteedihaldus, läbistustestimine jne). Kursusel antakse ülevaade ka turbehalduse modelleerimiskeeltest ning õiguslikest ja regulatiivsetest alustest. Õppijad uurivad turvahalduse põhimõtteid erinevate praktiliste harjutuste ja kasutusjuhtude kaudu. Praktilistel seminaridel rakendavad õppijad erinevate süsteemide turvahalduse põhimõtteid (nt äriprotsessiteadlikud süsteemid, intelligentne infrastruktuur, plokiahelapõhised süsteemid, identiteedihaldussüsteemid, riskiteadlikud digikriminalistika valmissüsteemid jne).Learning outcomes/õpiväljund:  Aine läbinud üliõpilane on võimeline: (1)\nTeavad\n·       Turvahalduse modelleerimiskeeli\n·       Turvahalduse õiguslikke ja regulatiivseid aspekte\n \nSuudavad\n·       Rakendada turvahalduse modelleerimiskeeli\n·       Tõlgendada õiguslikke ja regulatiivseid turvahalduse põhimõtteid\n \nOn võimelised\n·       Omandama turvahalduse jaoks olulisi modelleerimistehnikaid\n (2) \nTeavad\n·       Turvahalduse põhimõtteid, sealhulgas varade tuvastamist, ohuanalüüsi ja vastumeetmete valikuid\n·       Läbivustestimise, juurdepääsukontrolli ja identiteedihalduse põhimõtteid\n·       Turvalisuse hindamise lähenemisviise\n \nSuudavad\n·       Selgitada turvajuhtimise ja riskihindamise põhimõisteid\n·       Turvaohu mudelite haldust\n·       Selgitada ja kavandada turvahaldamise põhimõtteid\n·       Turvalisuse hindamise lähenemisviise\n \nOn võimelised\n·       Tegema kindlaks turvahalduse puudumise põhjused ja tagarjärjed\n (3)\nTeavad\n·       Turvahalduse eripärasid erinevates süsteemides, sealhulgas äriprotsessiteadlikud süsteemid, intelligentsed infrastruktuurid, plokiahelapõhised süsteemid, identiteedihaldussüsteemid, riskiteadlikud digikriminalistika valmissüsteemid\n \nSuudavad\n·       Rakendada turvahalduse lähenemiseviise erinevate süsteemide jaoks\n\nOn võimelised\n·       Väljendama professionaalset suhtumist turvahaldusesse erinevates süsteemides \n"}