{"KURSUSE_NIMI": "Pilvetehnoloogia ja Targa Linna seminar", "KURSUSE_KOOD": "LTAT.06.029", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Pilvetehnoloogia on viimastel aastatel saanud oluliseks osaks teaduse ja infotehnoloogia arengust ning linnad on muutumas üha enam tehnoloogiast sõltuvaks koos suure arvu andureite, ühendatud sõidukite ja tarkade hoonete lisadumisega. Selle seminari eesmärgiks on üliõpilastele tutvustada uusimaid konseptsioone ja edusamme nendes valdkondades. Osalejatelt oodatakse kirjaliku ülevaate kirjutamist valitud teemal, suulise ettekande läviviimist ning aktiivset osavõttu kõikidest seminaridest.\nTeemad mida seminaris kaetakse on järgnevad: Pilveteenuse pakkujad, pilvearvutuspõhised tarkvara raamistikud, suuremahuline andmetöötlus pilvearvutuse platvormil, teaduslikud arvutused pilves, pilvearvutuspõhise tarkvara arendus, olemasolevate rakenduse viimine pilvearvutuse platvormidele, Targa Linna väljakutsed, mobiilsuse analüüs ja modelleerimine, nutikas transport.Objectives/eesmärkid:  Seminari teemadeks on pilvetehnoloogiaga tehnoloogiad, raamistikud ning teenused ja Targa Linna ning mobiilsuse analüüsimise lahenduste, edusammude ja uute kontseptsioonide uurimine. Eesmärgiks on töötada iseseisvalt tehniliste ning teaduslike materjalidega, sooritada arvutieksperimente ning teste seotud tehnoloogiatel, koostada ülevaateartikleid, harjutada suulise ettekande esitust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Läbi töötada ja aru saada viimase aja inglisekeelsetest tehnilistest ning teaduslikest artiklitest Koostada kokkuvõtteid tehniliste ja teaduslikest artiklitest. Teha suulisi ettekandeid valitud teemadel Kursuse veebileht: https://courses.cs.ut.ee/2025/ccscs/spring"}