{"KURSUSE_NIMI": "Seletatav automatiseeritud masinõpe", "KURSUSE_KOOD": "LTAT.02.023", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Nüüdisajal on masinõppe süsteemid kasutusel pea igas valdkonnas, näiteks reklaaminduses ning kasutajakäitumise analüüsimises. Kõrgekvaliteetsete masinõppe süsteemide loomine on üldiselt iteratiivne, keeruline, ning ajakulukas protsess, mille käigus katsetakse erinevaid algoritme ning hüperparameetrite konfiguratsioone. Viimastel aastatel on tekkinud mitmed meetodeid ning raamistikke, mis proovivad efektiivselt lahendada CASH (Combined Algorithm Selection and Hyper-parameter tuning) probleemi. Raamisteke eesmärgiks on vähendada inimese rolli süsteemide loomisel, pakkudes masinõppe võhikule domeenieksperdi funktsionaalselt. Lisaks eelpoolmainitule tutvustab see kursus ka tipptasemel AutoML algoritme.Objectives/eesmärkid:  Aine eesmärgiks on tutvustada õpilastele seletatava automatiseeritud masinõppe (explainable automated machine learning) põhikontsepte, optimeerimise meetodeid ning nende rakendamis valdkondi. Kursuse käigus tutvustatakse mitmed meetodeid ning meta süsteeme, mille rakendamisel saab luua hästi toimivaid masinõppe süsteeme, mis ei vaja toimimiseks valdkonna spetsiifilisi teadmisi. Kursuse käigus tutvustatakse automatiseeritud masinõppe raamistikele lisaks ka meetodeid, millega saab masinõppe mudelite otsustusprotsessi seletada. Need kasutamine suurendab usaldust mudelite vastu ning annab väärtusliku ülevaadet nende toimumis loogika kohta.Learning outcomes/õpiväljund:  Kursuse edukal lõpetamisel peaks tudeng suutma:\n1.    anda ülevaadet tärkavatest AutoML süsteemidest;\n2.    tunda erinevaid mudelite selgitamise süsteeme, nende kasutusvaldkondi ning piiranguid;\n3.    rakendada tipptasemel raamistike skaleerivate süsteemide ehitamiseks;\n4.    rakendada kvalitatiivseid ning kvantitatiivseid meetodeid erinevate AutoML süsteemide hindamiseks;\n5.    demonstreerida oskust ehitada keerulisi andmetöötluse süsteeme, mis saavad hakkama erinevat tüüpi andmete töötlemisega."}