{"KURSUSE_NIMI": "Hajussüsteemid", "KURSUSE_KOOD": "LTAT.06.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Võrgutehnoloogia I", "Programmeerimine"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 16, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "See kursus koosneb 15 loengust ja on jagatud kolme progressiivsesse ossa: algtaseme, kesktaseme ja kõrgema taseme. Algtaseme osas (loengud 1-4) uurivad tudengid hajussüsteemide põhikontseptsioone, nagu aja tähtsus, toimimisjärgsete suhete ja süsteemi rollide määratlus (eesmärk 3 ja 4). Kesktaseme osas (loengud 5-10) süvenetakse edasijõudnud algoritmidesse, mis käsitlevad hajutamise väljakutseid, sealhulgas sündmuste järjekorda, erinevaid levitamise tüüpe, andmete järjepidevuse mudeleid, quorumid ja konsensust (eesmärk 2). Lõpuks keskendub kõrgema taseme osa (loengud 11-15) hajutatud tarkvara arhitektuuride kavandamisele ja süsteemide juurutamisele, optimeerides samal ajal töövõimet teenuse kvaliteedi omaduste, nagu reageerimiskiirus, läbilaskevõime ja teenuse kasutamine, alusel; muu hulgas (eesmärk 1 ja 5).Objectives/eesmärkid:  Hajussüsteem koosneb omavahel ühendatud komponentidest, mis töötavad ühiselt ühise eesmärgi saavutamiseks. Selliste süsteemide kavandamine ja loomine nõuab põhjalikku arusaamist fundamentaalsetest kommunikatsiooniprintsiipidest, koordineerimismehhanismidest ja hajutatud otsustamise meetoditest, et tagada tõhus toimimine. See kursus pakub terviklikku sissejuhatust hajussüsteemide ehitamise kontseptsioonidesse ja praktilistesse aspektidesse. Selle toetamiseks juhindub kursus järgmistest eesmärkidest: Eesmärk 1: Luua hajussüsteem nullist, rakendades põhiprintsiipe ja parimaid tavasid. Eesmärk 2: Analüüsida ja võrrelda erinevate hajussüsteemide arhitektuuride ja algoritmide jõudlust. Eesmärk 3: Kasutada hajussüsteemide kontseptsioone ja algoritme uuenduslike rakenduste loomiseks. Eesmärk 4: Tuvastada ja kirjeldada hajussüsteemi põhilisi elemente. Eesmärk 5: Tunda ära ja hinnata tehnoloogilisi vahendeid, mida kasutatakse hajussüsteemide ehitamisel, nagu vahendustarkvara, kommunikatsiooniprotokollid ja pilveplatvormid.Learning outcomes/õpiväljund:  \nPärast kursuse edukat läbimist on tudengid suutlikud: Loetle ja kirjelda hajussüsteemi põhikomponendid ning nende rollid.\n\nRakenda hajutatud algoritme otsustusprobleemide tõhusaks lahendamiseks.\n\nAnalüüsi ja kavanda optimaalseid strateegiaid hajutatud kommunikatsiooni, salvestamise ja arvutuste tõhustamiseks.\n\nHinda erinevate hajutatud tarkvara-arhitektuuride ja süsteemipaigutuste teenusekvaliteedi omadusi.\n\nLoo toimiv hajussüsteem ja häälesta selle töövõime süsteemi nõuete ja piirangute põhjal."}