{"KURSUSE_NIMI": "Suurandmete haldus", "KURSUSE_KOOD": "LTAT.02.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1.\tSuurandmete fenomeni põhimõtted: Mis on suurandmed? Mis on suurandmete peamised omadused? Mis on peamised suurandmete allikad ning rakendusvaldkonnad?\n2.\tNoSQL ja suurandmete salvestamissüsteemid: Mis on NoSQL süsteemide peamised põhimõtted, projekteerimisotsused ja eelised? Mis on peamised NoSQL süsteemide kategooriad?\n3.\tSuurandmete saritöötlussüsteemid: Hadoop, Spark, Flinl. Hajusandmebaasid ja paralleelsed andmebaasid\n4.\tSuure andmevoo töötlussüsteemid: väljakutsed, nõuded ja süsteemid suure mahu voogandmete töötlemine reaalajas.\n5.\tSuurte graafide töötlus: Mis on peamised väljakutsed hajusate graafide töötlemisel? Millised on adekvaatsed programmeerimismudelid/ andmesalvestustehnikad hajusate graafide töötluseks\n6.\tSuured masin-/süvaõppesüsteemid: Efektiivsete ja täpsete ML.DL mudelite disainimise tehnikad hajuskeskkonnas, mis suudavad jaotada kasvavas mahus andmeid\n7.\tJuhtumipõhised analüüsid suurandmete töötlemisesObjectives/eesmärkid:  Selle kursuse eesmärgiks on tutvustada tudengitele kõrgtasemel andmehalduse ja -töötluse põhimõtteid. Kursusel käsitletakse erinevate andmetüüpide (struktureeritud, semistruktureeritud ja struktureerimata andmed) salvestamist ning töötlust. Käsitletakse kõige uudsemaid suurandmete töötlussüsteeme (nt. andmevoo töötlus-, graafide töötlus-, skaleeritav masin- ja süvaõppe süsteemid)Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane: 1.\tOmab teadmisi kasvavast vajadusest andmete salvestamisel ja töötlemisel erinevates rakendusvaldkondades 2.\tTunneb erinevaid kõrgtasemel andmhaldamismeetodeid ning oskab valida sobiva süsteemi lähtuvalt lahendatavast probleemist 3.\tOskab rakendada kaasaegseid kõrgtasemel andmehaldussüsteeme ja ehitada skaleeritavaid lahendusi erinevatele andmeterohketele rakendusvaldkondadele 4.\tOskab erinevate andmetöötlussüsteemide analüüsimisel rakendada kvalitatiivseid ja kvantitatiivseid tehnikaid hindamaks erinevate süsteemide tugevusi ja nõrkusi. 5.\tOskab ehitada keerukaid andmetöötlus protsesse, mis integreerivad erinevaid süsteemi tüüpe"}