{"KURSUSE_NIMI": "Automaadid, keeled ja translaatorid", "KURSUSE_KOOD": "LTAT.03.006", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Algoritmid ja andmestruktuurid"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb sissejuhatavaid teemasid programmeerimiskeelte transleerimisel: regulaaravaldised, kontekstivabad grammatikad, süntakspuud ja koodi genereerimine. Keskseks teemaks on arvutiteaduse üks kõige olulisemaid mõisteid: induktiivsed definitsioonid. Kontekstivaba grammatika on mugav vahend induktiivselt defineeritud hulkade kirja panemiseks. Programmide ülesehitusest arusaamine on esimene samm selgema ja usaldusväärsema tarkvara arendamiseks. Enamus selle kursuse harjutused on loodud selleks, et just sellist arusaamist arendada.Objectives/eesmärkid:  Kursus süvendab tudengite arusaamist arvutiprogrammide ülesehitusest ja täitmisest. Selline arusaamine on hädavajalik usaldusväärsema tarkvara arendamiseks. Kursuse põhieesmärk on vähendada halvast programmeerimisest tingitud kahju ühiskonnale.Learning outcomes/õpiväljund:  Tudeng näitab oma sügavat arusaamist programmide ülesehitusest ja täitmisest sellega kirjutades etteantud programmeerimiskeelele interpretaator. Seega oskab kursuse läbinud tudeng... - koostada kontekstivaba grammatika etteantud programmeerimiskeele süntaksi täpseks iseloomustmiseks kõnekeelse kirjelduse ja näidete põhjal. - rakendada parseri loomise ning puu läbimise meetodid, et antud keeles kirjutatud programmide abstraktseid süntaksipuid kätte saada. - implementeerida interpretaator, mis väärtustab programmi selle süntakspuu põhjal, ning translaator, mis teisendab puu virtuaalmasina käskude jadaks. - saab põhimõistetest piisavalt aru, et ära tunda tõesed väited automaatide, keelte ja translaatorite kohta; liigitada grammatikad ning analüüsida nende omadusi; kirjeldada keelt, mida regulaaravaldised ja automaadid defineerivad; jne. Kursuse kõige olulisem väljund on aga afektiivses domeenis. Kursuse läbinud tudeng: - tunnistab, et halb programmeerimine teeb teistele inimestele haiget. - hindab koodi korrektsuse moraalset tähtsust ACM kutse-eetika koodeksi valguses. https://courses.cs.ut.ee/t/AKT"}