{"KURSUSE_NIMI": "Sissejuhatus andmeteadusesse", "KURSUSE_KOOD": "LTAT.02.002", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab lühiülevaate andmeteaduse põhimõistetest, põhiprintsiipidest ning praktilistest aspektidest. Lõppeesmärk on õppida planeerima ning läbi viima lihtsat praktilist andmeteaduse projekti. Kursus käsitleb peamisi andmete kirjeldava analüüsi ning visualiseerimise meetodeid, sagedaste mustrite otsimist, klasteranalüüsi, peakomponentanalüüsi, peamisi masinõppemeetodeid klassifitseerimise ja regressiooni jaoks (sealhulgas sügavaid neurovõrke), andmete haldamist ning statistiliste testide interpreteerimist. Tutvutakse andmeteaduse projekti põhiliste etappidega ning tarkvaraliste töövahenditega. Peamiseks töövahendiks Õpime projekti ellu viima baseerudes programmeerimiskeele Python teekidele. Kodutööde lahendamiseks on kasutusel programmeerimiskeel Python 3 ja selle teegid.Objectives/eesmärkid:  Kursuse eesmärk on tutvuda andmeteaduse põhimõistetega, põhiprintsiipidega ning õppida läbi viima lihtsat praktilist andmeteaduslikku projekti.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane on võimeline: - Loetlema ning selgitama peamisi andmeteaduse alamvaldkondi, põhimõisteid ning põhiülesandeid - Teostama etteantud andmestikul kirjeldavat analüüsi - Valima ning teostama andmestikule sobivaid visualiseeringuid - Rakendama tavalisemaid klasterdusmeetodeid ning tõlgendama nende tulemusi - Valima ja rakendama lihtsamaid masinõppe algoritme, et luua ennustavaid mudeleid klassifikatsiooni ja regressiooni jaoks - Kasutama lihtsamaid hindamismeetodeid, et mõõta masinõppe abil saadud mudelite ennustusväärtust - Interpreteerima statistilise testi tulemusi - Plaanima ja teostama lihtsat praktilist andmeteaduse projekti ning koostama selle lõppraporti"}