{"KURSUSE_NIMI": "Sünteetilise bioloogia praktikum I", "KURSUSE_KOOD": "LTBI.00.005", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 92, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 12, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Praktikum on jaotatud  viieks alamprojektiks. Iga projekt algab geneetiliste signaalivõrgustike in silico disainiga, mille eesmärgiks on luua uus bioloogiline funktsioon. See esimene etapp viiakse läbi eraldi, mõned nädalad enne kursuse laboratoorse osa algust, teoreetilise kursuse \"LTTI.00.016 Bioinformaatika biotehnoloogidele\" raames, et oleks aega tellida sünteetilne DNA ja vajaminevad reagendid. Iga üliõpilane osaleb vähemalt kolmes alamprojektis. Projektide nimekiri muutub igal aastal vastavalt arengule ja uute ideede esilekerkimisele. Kursus sisaldab alamprojekte, milles kasutatakse kõiki nelja peamist sünteetilises bioloogias kasutatava organismi: bakter, pärm, taim, imetajarakud.Objectives/eesmärkid:  Praktikum annab üliõpilastele praktilise kogemuse erinevate sünteetilises bioloogias kasutatavate laboratoorsete meetodite ja protokollide rakendamise osas. Peamiselt arendatakse loovat mõtlemist sünteetiliste bioloogiliste süsteemide disainimisel. Selle protsessi käigus õpitakse nii teoreetiliselt kui praktiliselt konstrueerima geneetilisi signaalivõrgustikke ja valgumoodulite aluselemente. Selline lähenemine ärgitab kasutama insenerimõtlemist bioloogiliste süsteemide kontekstis. Samuti kombineerib praktikum meetodeid erinevatest distsipliinidest nagu näiteks elektroonika, biosensorid, jätkusuutlik energia ja biotöötlus, orgaaniline süntees jne. Kursuse lõppeesmärk on alustada sünteetiliste kromosoomide projektiga, mille plaan koostati samal semestril toimuva kursuse \"LTTI.00.016 Bioinformaatika biotehnoloogidele\" kolmanda mooduli käigus.Learning outcomes/õpiväljund:  Praktikumi eesmärk on juhatada üliõpilased läbi sünteetiliste bioloogiliste süsteemide disaini loomingulise tsükli. Proovitakse läbi kõik disain-konstrueerimine-testimine protsessi etapid, millele järgneb tulemuste analüüs ja interpreteerimine. Kursuse läbimise järel valdab üliõpilane mitmeid molekulaarse kloonimise  ja eksperimentaalse rakubioloogia alustehnikaid ja tunneb bioloogilise materjaliga töötamise reegleid. Samuti oskab üliõpilane disainida sünteetilise DNA järjestusi ja omab praktilist kogemust kromosoomi konstrueerimises."}