{"KURSUSE_NIMI": "Laboratoorsed projektid", "KURSUSE_KOOD": "LTBI.00.011", "EAP": 6, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 76, "individual_work": 0, "internship": 60}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusest osavõtjad viivad läbi eksperimentaalseid uurimusprojekte erinevatel aladel. Kursus koosneb kolmest erinevast väikesest projektist, mis sisaldavad kõiki eksperimentaalteadusliku projekti etappe: hüpotees, mudel, eksperimendi plaanimine, eksperiment ja tulemuste analüüs ning korrektne esitamine. Üliõpilased iseseisvalt valivad 3 erinevat 2EAP projekti, millest üks peab olema keemiainstituudist, üks tehnoloogiainstituudist ja üks molekulaar ja rakubioloogia instituudist. Projekti jooksul saab tudeng tutvuda teadusrühma töö teemadega, õppida uusi teadusmeetodeid ja kohe neid praktiseerida, õpib püstitama hüpoteesi, planeerima katseid selle kontrollimiseks, analüüsima saadud tulemusi ja teha andmete põhjal järeldusi. Samuti õppib tudeng esitama teadustulemusi ettekanne vormis. Lõppkokkuvõttes suudab kursuse läbinud õppija töötada teaduslaboris, mis tulevikus soodustab töö otsimist.Objectives/eesmärkid:  Kursuse eesmärk on arendada tudengi õpimisoskust, teha üliõpilastele sissejuhatus teadusliku protsessi, eksperimendi planeerimise ja eksperimentaalse teaduskirjanduse kriitilise analüüsi osas, õpetada oma tulemuste analüüsi ja esitamist. Lisaks anda võimalust tudengile proovida ennast teadustöötaja rollis. Õpetada plaaneerima oma aega, leppima kokku aja ja tegevusplaani projekti juhandajaga, valima endale sobivat uurimisteemat, töötada iseseisvalt. Eesmärk anda kursuse läbinud üliõpilasele ettekujutuse eksperimentaalse teadustöö iseloomust keemia, bioinseneeria, geenitehnoloogia ja robootika alal ning aidata tudengit  teha eriala valikut. Anda eelistuse tulevikus töö otsimisel peale ülikooli lõpetamist (tudeng omab eri eriala praktika kogemust).Learning outcomes/õpiväljund:  Kursusel osalejad saavad laboratoorse uurimustöö kogemuse. Nad õpivad eksperimente planeerima, tööd organiseerima ja esitama kokkuvõtlikult uurimustöö tulemusi. Kursuse läbinud üliõpilane: 1)\tOskab otsida vajalikku infot teadusartiklites; 2)\tPüstitama hüpoteesi 3)\tPlaneerida katseid hüpoteesi kontrollimiseks 4)\tOn proovinud erinevaid teadusmeetodeid bioensineeria, keemia ning robootika alal ja          läbinud praktikat;  5)\tOskab analüüsida eksperimentaalseid andmeid ja teha nende põhjal järeldusi; 6)\tOskab esitada teaduslikke tulemusi nii suulises kui ka kirjalikul viisil; 7)\tOskab teha ettekannet;  8)\tOskab oma tööaega planeerida; 9)\tOskab jõuda juhandajaga kokkuleppele; 10)\tOn saanud praktilist kogemust erinevates erialades, mis aitab teha parimat karjääri valikut; 11)\tOn arenenud oma õpimisoskust."}