{"KURSUSE_NIMI": "Biomolekulaarne katalüüs ja signaaliülekanne", "KURSUSE_KOOD": "LTBI.00.003", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 48, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Valkude 3-D struktuur; röntgenstruktuuranalüüs; Valkude struktuuri määramine lahustes NMR-i meetoditega. Valkude struktuuri elemendid. Supersekundaarse struktuuri motiivid. Valkude assambleerumine struktuurielementidest. Valkude tüübid. Intronid, eksonid, inteiinid ja eksteiinid. Valguperekondade divergeeruv ja konvergeeruv evolutsioon. Valkude evolutsioon geenifragmentide liitumise läbi. Homoloogia ja struktuuriline sarnasus. Keemilise katalüüsi põhiprintsiibid. Vaheoleku-aktiveeritud oleku teooria. Hammondi postulaat. Intramolekulaarne katalüüs: \"efektiivse kontsentratsiooni\" mõiste. Elektrostaatiline katalüüs. Metalli-ioonide katalüüs. Kovalentne katalüüs. Elektrofiilne katalüüs ja Schiffi aluse moodustumine. Püridoksaalfosfaat - elektrofiilne katalüüs. Thiamine pürofosfaat - elektrofiilne katalüüs. Nukleofiilne katalüüs. Struktuur-aktiivsussõltuvused. Mikroskoopse tasakaalu printsiibid. Kineetilise ekvivalentsi printsiip.Objectives/eesmärkid:  Kursuse eesmärgid avalduvad nelja loengu-mooduli koostoimes. Science & Technology õppekava \"Bioengineering and Robotics\" suuna üliõpilased peaksid kursuse tulemusel saama üldised alusteadmised bioloogiliste signaalisüsteemide toimemehhanismide osas ja oskuse kasutada saadud teadmisi mehhanismide loogikast ja komponentidest sünteetilise bioloogia valdkonnas: uute elussüsteemide disainimisel, aga ka ravimiarenduses ning biomedistiinilises uurimustöös. Kursus pakub detailse ülevaate rakkude signaalisüsteemidest ja mehhanismidest kolmel põhitasandil: 1) signaalirajad, 2) signaaliülekandes osalevate valkude struktuur, 3) signaaliülekandes osalevate ensüümide kineetika ja mehhanism. Samuti vaadeldakse ravimiarendusmeetodeid ja võimalusi , kuidas mõjutada haigustega seotud signaalisüsteeme ravimimolekulidega.Learning outcomes/õpiväljund:  Moodul 1: signaalisüsteemid rakkudes. Moodul pakub ülevaate rakusiseste signaaliradade toimimise printsiipidest, peamistest signaaliradade komponentidest ja mehhanismidest. Antakse ka süstemaatiline ülevaade kesksetest eukarüootsetest ja prokarüootsetest signaaliradadest.  Moodul 2 annab ülevaate ensüümide mehhanismist ja peamistest kineetilistest meetoditest ensüümide uurimisel.  Moodul 3 käsitleb valkude struktuuri ja struktuuri uurimise meetodeid. Pakub praktilise kogemuse valkude struktuuri modelleerimise alal.  Moodul 4 vaatleb prokarüootsete rakkude signaaliradu. Samuti tutvustatakse põhjalikumalt valgusünteesi masinavärki ning antibiootikumide toime- ja resistentsuse mehhanisme."}