{"KURSUSE_NIMI": "iGEM", "KURSUSE_KOOD": "LTBI.00.014", "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatav laboritöö praktikum"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse raames osalevad tudengid suurimas rahvusvahelises sünteetilise bioloogia võistluses iGEM. iGEMi jooksul saavad üliõpilased kastetada igast teadustööga seotud rolli: töötada laboris, kommunikeerida ja teha koostööd teiste teadlastega, populariseerida teadust, otsida rahandust, avaldada saadud tulemusi, esitada neid teaduskonferentsil.Objectives/eesmärkid:  Kursuse eesmärk on arendada tudengi õpimisoskust, lisaks anda võimalust tudengile proovida ennast teadustöötaja rollis. Õpetada plaaneerima oma aega, leppima kokku aja ja tegevusplaani projekti juhandajaga, valima endale sobivat uurimisteemat, töötada iseseisvalt. Eesmärk anda kursuse läbinud üliõpilasele ettekujutuse eksperimentaalse teadustöö iseloomust ja anda eelistuse tulevikus töö otsimisel peale ülikooli lõpetamist (tudeng omab eriala praktika kogemust).Learning outcomes/õpiväljund:  Kursuse läbinud õliõpilane: 1)\tOskab otsida informatsiooni teadusartiklitest; 2)\tOskab oma tööaega planeerida; 3)\tOskab töötada laboris iseseisvalt ja meeskonna koosseisus; 4)\tOskab organiseerida ja läbi viia teaduspopulariseerime üritust; 5)\tOskab analüüsida katsete tulemusi; 6)\tOskab kirjutada teadus teksti; 7)\tOskab esitada teadustöö tulemusi teaduskonverentsil; 8)\tOskab otsida rahandust projekti teostamiseks; 9)\tOskab disainida ja programeerida veebilehekülge, kus on olemas kogu projekti info; 10)\tOskab kommunitseerida teiste teadlastega ja organiseerida koostööd; 11)\tOn saanud parima ettekujutust teadustöö spetsifiikast, mis võimaldab teha kaalutud karjääri valikut."}