{"KURSUSE_NIMI": "Bioinformaatika biotehnoloogidele", "KURSUSE_KOOD": "LTBI.00.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 52, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Sisu lühikirjeldus \nKursus koosneb kolmest moodulist:\nI - Sissejuhatus bioinformaatikasse.\n*\tGeenide ja valkude in silico analüüs - peamised otsingualgoritmid (blast), järjestuste andmebaasid, DNA järjestuste failitüübid, alignment analüüs, fülogeneetiliste puude koostamine etc. \n*\tPCR-i praimerite disain\n*\tGenoomi erinevate regioonide analüüs - enhanserid, promootorid, kodeerivad ja mittekodeerivad järjestused, geenide intron-ekson struktuur, (alternative) splicing, kattuvad geenijärjestused (kaasaarvatud miRNA geenid) \n*\tGeeniekspressiooni anmete analüüs (RNA seq, microarray, protein arrays, chip data) \n*\tInteraktoomi ja GO andmeanalüüs\n*\tValk-valk interaktsioonide võrgustike analüüs.\n\nII - Genoomi konstrueerimise moodul\n*\tThe Synthetic Biology Open Language (SBOL):  a community standard for communicating designs in synthetic biology \n*\tDNA järjstusega manipuleerimine, genoomi editing, koodonite optimeerimine\n*\tIn silico sünteetiliste geneetiliste võrkude ja funktsionaalsete moodulite disain ja konstrueerimine lähtudes erinevatest genoomidest pärit algmaterjalidest\n*\tSünteetiliste valk-valk interaktsioonide võrgustike disain kasutades Short Linear Motif (SLiMs) andmebaase\n*\tLoogikaelementide disain - sarnasus arvutitehnoloogiaga\n*\tIn silico valkude disain  \n*\tHeteroloogiliste biosünteesi radade disain ja sisestamine tootjarakkude genoomi: Design-Build-Test-Cycle\n*\tBiosünteesi radade bioinformaatika. \n*\tDisainerrakuvabrikute metabolismi analüüsi meetodid. \n\nIII - Build-a-Genome-Course ettevalmistav moodul\n*\tSCRAMBLe meetod genoomi muutmiseks ja suunatud evolutsiooniks\n*\tSissejuhatus Phosphoprocessor'ite tehnoloogiasse\n*\tKromosoomi struktuuri ja konstrueerimisstrateegia disain\n*\tKromosoomi sünteesi praktiline ajakava ja kuluanalüüs.Objectives/eesmärkid:  Kursuse eesmärk anda üliõpilasele ülevaade peamistest geneetilise informatsiooni analüüsi meetoditest, geeniregulatsiooni mehhanismidest ja olulistest andmebaasidest. Kursuse raames antakse alusteadmised sünteetiliste bioloogiliste süsteemide konstrueerimisest genoomi tasemel. Disainitakse in silico reaalne sünteetiline kromosoom, mille konstrueerimine viiakse läbi loengukursusega seotud sünteetilise bioloogia praktikumis (LTTI.00.007) \"build-a-genome-course\" süsteemi järgi.Learning outcomes/õpiväljund:  Kursus annab ülevaate peamistest bioinformaatika meetoditest, mida kursuse läbinu saab rakendada geneetilise informatsiooni analüüsiks ja uute geneetiliste moodulite ja genoomide disainiks. Kursus erineb klassikalisest bioinformaatika kursusest selle poolest, et lisaks analüüsi meetoditele tutvustatakse ka sünteetiliste geneetiliste võrgustike ja tervete kromosoomide disaini ja konstrueerimise meetodeid ning disainiplatvormi SBOL (Synthetic Biology Open language).  Kursusest osavõtjad omandavad järgmised oskused: 1)\tRakuprotsesside in silico analüüs: geneetiline informatsioon ja selle avaldumine. 2)\tOskus kasutada geeniregulatsiooni uurimiseks vajalikke meetodeid (s.h. järjestuste joondus ja analüüs, praimerite disain, geeniekspressiooni analüüs, CRISPR) 3)\tOskus kasutada bioloogilisi andmebaase (s.h. genoomsed piirkonnad, valkude domeenid, valkude vahelised interaktsioonid, ekspressiooniandmed, geeniontoloogia) 4)\t Sünteetiliste geneetiliste süsteemide disain keskkonnas SBOL (Synthetic Biology Open Language).- DNA järjestusest metabolismi radadeni."}