{"KURSUSE_NIMI": "Rakutsükkel", "KURSUSE_KOOD": "LTBI.00.013", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus algab rakkude pooldumise faaside ja peamiste sündmuste kirjeldusega imetaja rakkudes ja mudelorganismides Xenopus, Drosophila ning pärmid. Hilisemad loengud käsitlevad rakutsükli molekulaarseid kontrollmehhanisme. Juttu tuleb rakutsükli pearegulaatoritest - tsükliinist sõltuvatest proteiini kinaasidest ja tsükliinidest, mis neid ensüüme aktiveerivad. Arutlusele tuleb ka rakutsükli kontrollmehhanismide roll organismide arengus kui ka nende mehhanismide defektide roll vähktõve tekkes. Tänavuse kursuse uuendatud varianti on juurde lisatud eelmise aasta jooksul tehtud läbimurded käävi kontrollpunkti, tsütokineesi ja kinetokoori struktuuri alal.\n1. Rakkude pooldumise tsükli peamised etapid eukarüootides\n2. Rakutsükli analüüsiks kasutatavad mudelorganismid\n3. Rakutsüklit kontrollivate mehhanismide ülevaade\n4. Rakkude pooldumise erinevaid etappe reguleerivad lülitid \n5. Kromosoomide duplitseerumine\n6. Varajane mitoos: kromosoomide ettevalmistamine segregatsiooniks\n7. Mitoossikäävi moodustumine\n8. Mitoosi lõpetamine\n9. Tsütokinees\n10. Meioos\n11. Rakkude kasvu ja suurust kontrollivad mehhanismid\n12. Rakutsükli käigus tekkinud DNA kahjustuse leidmine ja parandamine\n13. Rakutsükli süsteemibioloogia, ülevaade matemaatilistest mudelitest\n14. Rakutsükkel vähkkasvajatesObjectives/eesmärkid:  Kursuse eesmärgiks on anda osalejatele ülevaade rakkude pooldumise tsükli peamistest mehhanismidest ja juurutada süsteemibioloogiline arusaam neid reguleerivatest kontrollvõrgustikest.Learning outcomes/õpiväljund:  Kursusel on kaks peamist eesmärki: 1) Anda osalejatele ülevaade rakkude pooldumise tsüklist ja selleteemaliste teadusuuringute peamistest küsimustest tänapäeval 2) Anda osalejatele kogemus teadusartiklite kriitilise lugemise ja analüüsi alal -"}