{"KURSUSE_NIMI": "Rakenduslik sünteetiline bioloogia", "KURSUSE_KOOD": "LTBI.00.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Molekulaarbioloogia alused", "Süsteemibioloogia", "Molekulaarne süsteemibioloogia", "Biomolekulaarne katalüüs ja signaaliülekanne", "Biokeemia"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Mikroobsete rakkude tehaste üksus (15 loengut ja seminari)\nMikroobirakutehased pärm, bakterid. Rakutehase ehitamine silikoonis. Biosünteetiliste ensüümide spetsiifilisuse ja sünteetilise bioloogia muude rakenduste väljatöötamine rakuvabriku tehnoloogiates, mille eesmärk on biopõhiste kemikaalide, valkude ja bio-inspireeritud materjalide tootmine. Arutatakse järgmise põlvkonna biokütuste teemat ja sünteetilise bioloogia tööriistade rolli mikrobioloogilise ainevahetuse ümberkerimisel suure saagikusega biokütuste tootmiseks ning tutvustatakse uusimate näidetega tööstuses (Loog, Lahtvee, Valgepea).\nImetajate rakuvabrikute üksus (5 loengut ja seminari): Sünteetilise bioloogia rakendust viroloogias ja sääski levivate viirushaiguste vastu võitlemist katab prof Andres Merits.\nSünteetilise bioloogia rakendus taimebioloogias ja põllumajanduses (5 loengut ja seminari; prof Hannes Kollist).\nSünteetilise bioloogia meditsiinilised rakendused (5 loengut ja seminari) (dr Viljar Jaks)Objectives/eesmärkid:  Kursuse eesmärk on anda lai ülevaade sünteetilise bioloogia tööstuslikest, meditsiinilistest, keskkonna- ja põllumajanduse rakendustest. Spetsialistidest õppejõud tutvustavad sünteetilise bioloogia rakendusi rakuvabriku tehnoloogiates, mille eesmärk on biopõhiste kemikaalide, valkude ja bio-inspireeritud materjalide tootmine (Loog, Lahtvee). Arutatakse järgmise põlvkonna biokütuste teemat ja sünteetilise bioloogia tööriistade rolli mikrobioloogilise ainevahetuse ümberkerimisel suure saagikusega biokütuste tootmiseks ning tutvutakse uusimate näidetega tööstuses (Valgepea). Sünteetilise bioloogia rakendust viroloogias ja sääski levitavate viirushaiguste vastu võitlemist käsitleb prof Andres Merits. Sünteetilise bioloogia rakendust taimebioloogias ja põllumajanduses õpetab prof Hannes Kollist. Sünteetilise bioloogia meditsiinilisi rakendusi tutvustab dr Viljar Jaks.Learning outcomes/õpiväljund:  Kuruse läbimisel omandatavad teadmised: 1) hiljutised suured läbimurded sünteetilise bioloogia valdkonnas; 2) sünteetilise bioloogia peamised rakendused biomajanduses; 3) sünteetilise bioloogia peamised rakendused meditsiinis; 4) sünteetilise bioloogia peamised rakendused põllumajanduses; 5) sünteetilise bioloogia peamised rakendused keemia- ja materjalitööstuses; 6) sünteetilise bioloogia peamised rakendused biokütuste, globaalse soojenemise ja biosäästlikkuse humanitaarteaduste eesmärkide saavutamisel."}