{"KURSUSE_NIMI": "Kliimateaduse ja -poliitika teejuht", "KURSUSE_KOOD": "LTFY.05.008", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sisuteemad on globaalse soojenemise põhjused, kliimamuutuse mõjud loodusele ja inimühiskonnale ning oskuste arendamine kliimamuutuse leevendamiseks ja selle mõjudega kohanemiseks. Põhiosas toetub kursus EMP programmi KLIIMATEADLIK projekti raames loodud eestikeelsele õppevahendile \"Kliimamuutuste ABC\" (mis valmib oktoobris 2023), kuid juurde tuleb luua õpiobjektid Moodles, et täiendada materjale konkreetsete ülesannetega elust enesest. Õppetöö viiakse läbi pööratud klassiruumi võtmes e tudengid loevad ise kodus põhimaterjali peatükkide kaupa või vaatavad mingit internetiloengut või populaarteaduslikku filmi ning täidavad selle alusel internetis väikseid teste. Igal korral on üks teema arutluse all. Selle ümber on üles ehitatud kohapealsed diskussioonid. Üliõpilased on jagatud erialaliselt mitmekesisteks rühmadeks. Igal kokkusaamisel on esitusel üks referaat, mis on rühmatööna koostatud ning mida hindavad ja analüüsivad teised rühmad. Aine lõppeb suure debatiga. Soodustatakse ökoloogilise maailmavaate ja keskkonnahoidlike käitumismustrite arengut ja kliimateadlikkuse kujunemist.Objectives/eesmärkid:  kestlik mõtteviis, kriitiline mõtlemine, probleemi lahendamine, koostööoskus, suhtlemisoskus.Learning outcomes/õpiväljund:  Kursuse läbinu: 1) teab kuidas kliima kujuneb ja miks kliima muutub; 2) oskab kirjeldada nii globaalseid kui kohalikke kliimamuutuste mõjusid; 3) teab, mida tuleb teha kliimamuutuste leevendamiseks ning nendega kohanemiseks; 4) suudab kriitiliselt analüüsida Eesti kliima- ja energeetikapoliitikat lähtudes meedias ja kliimapoliitika alusdokumentides avaldatud materjalidest; 5) on koostöös kaasüliõpilastega mõtestanud kliimamuutuste mõjud enda erialalisest vaatevinklist lähtudes."}