{"KURSUSE_NIMI": "Plasmafüüsika praktikum", "KURSUSE_KOOD": "LTFY.03.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Elekter ja magnetism", "Optika", "Plasmafüüsika ja tema rakendused"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktikumi tööd katavad plasmat iseloomustavate olulisemate parameetrite määramist, plasmal põhinevaid diagnostikameetodeid ja plasma rakendusi. Uuritakse väliste parameetrite (gaasi koostis, rõhk, vool) mõju klassikalisele huumlahendusplasma põhisuurustele (temperatuur, laengukandjate kontsentratsioon, väljatugevus). Emissioonspektroskoopia abil määratakse plasma temperatuur. Neeldumisspektroskoopia meetoditest tutvustatakse tuunitava dioodlaseri abil spektrijoone kuju ja neelduvate ühendite koguse määramist. Plasma rakendustest tutvutakse laser ablatsiooni ja laserindutseeritud plasmaga ning nende kasutamisega materjaliteaduses ja diagnostikas. Samuti tutvutakse barjäärlahenduse kasutamisega pindade ja gaaside töötlemisel ning sellega seonduvalt ka plasmasse antava võimsuse ja pinnaenergia mõõtmisega.Objectives/eesmärkid:  Praktikumi eesmärk on tutvustada plasmauuringutes enimkasutatavaid meetodeid ja anda praktilised kogemused mõnede plasmaga seotud rakendustega. Praktikumis käsitletavad eksperimendid toetavad plasmafüüsika ja rakenduse loengut. Samas sobib praktikumi ka teistele füüsika ja materjaliteaduse magistrantidele, kes kasutavad oma töös plasmafüüsikal baseeruvaid meetodeid.Learning outcomes/õpiväljund:  Praktikumi läbimise järel üliõpilane: 1. omab kasutamiskogemust plasmaseadmetega, mida kasutatakse erinevates plasmatehnoloogilistes rakendustes ja laboris plasmaseadmete karakteriseerimiseks kasutatava mõõteaparatuuriga;  2. vormistab praktilise töö tulemusi ja esitleb (neist ühe) tulemusi teiste üliõpilaste ja õppejõudude ees arendades sellega kirjalikku ja suulist eneseväljendusoskust; 3. mõistab peamiste kõrgepinge, laserite ja gaasidega töötamiseks vajalike ohutustehniliste aspektidega. 21/22S jäi ära kuulajate puudumise tõttu"}