{"KURSUSE_NIMI": "Füüsika praktikum I - mehaanika ja soojusõpetus", "KURSUSE_KOOD": "LTFY.01.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füüsika ja tehnika", "Laboritöö praktikum"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 40, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktikum füüsika suuna bakalaureuseõppe 1. aasta üliõpilastele. Praktikumi jooksul tuleb individuaalselt või rühmatööna sooritada 10 praktilist tööd. Praktilisi töid sooritatakse juhendava õppejõu poolt koostataud ajakava järgi. Ühe praktikumitöö mõõtmiste tegemiseks ja juhendava õppejõu küsimustele vastamiseks on ette nähtud 4 auditoorse töö tundi. Iseseisva töö käigus tehakse lõpptulemuste saamiseks vajalikud arvutused, antakse mõõtemääramatuse hinnangud ja vormistatakse töö aruanne. Aruanne valmib reeglina ühe nädala jooksul; see esitatakse juhendavale õppejõule esimesel võimalusel. Protokollide kontrollimine ja õppejõu küsimustele vastamine toimub jooksva töö käigus.Objectives/eesmärkid:  Praktikumi eesmärgiks on aines Mehaanika ja soojusõpetus teadmiste süvendamine ja katseline kinnistamine ning eksperimentide teostamise, füüsikaliste suuruste mõõtmise ja mõõtmistulemuste usaldatavuse hindamise oskuste kujundamine.Learning outcomes/õpiväljund:  Praktikumi sooritanud üliõpilane: * tunneb uurimistöö planeerimise ja andmetöötluse põhielemente; * tunneb enamlevinud mehhaaniliste ja soojusfüüsikaliste suuruste mõõtmisel kasutatavaid mõõteviise, mõõtevahendeid ja seadmeid ning oskab neid kasutada;  * tunneb elementaarseid elektriohutuse ja teisi ohutustehnika nõudeid; * oskab hinnata mõõtmistulemuste usaldatavust (mõõtemääramatust); * oskab vormistada praktilise töö (mõõtmiste) aruannet; * suudab selgitada tehtud mõõtmiste põhiolemust ja põhjendada saadud tulemusi; * oskab iseseisvalt planeerida ja läbi viia lihtsamaid mehhaanika ja soojusfüüsika eksperimente ja katseid."}