{"KURSUSE_NIMI": "Ettevõtte loomise, juhtimise ja arendamise seminar III", "KURSUSE_KOOD": "LTFY.02.012", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ettevõtte loomise, juhtimise ja arendamise seminar  koosneb kolmest osast. Teise osa lõpuks on iga üliõpilane liitunud mõne laboriga ja koostöös selle laboriga on alustatud mingi toote valmistamist. Üliõpilane on loonud ettevõtte, mille eesmärgiks on seda toodet valmistada. Kursuse kolmandas osas jätkab ja arendab üliõpilase poolt loodud ettevõte tootmist, tegeldakse reklaami, turunduse ja aruandlusega. Seminarides arutatakse tegevused läbi ja analüüsitakse tulemusi.Objectives/eesmärkid:  Eesmärgiks on teadmiste, oskuste ja kogemuste andmine materjaliteaduse rakenduste kommertsiaaliseerimisel, teadusmahuka väikeettevõtte kavandamisel ja loomisel ning selle töö kujundamisel.Learning outcomes/õpiväljund:  Ettevõtte loomise, juhtimise ja arendamise seminari läbinud üliõpilane on koostöös teaduslaboriga loonud mingit teadusmahukat toodet valmistava ettevõtte. Ta mõistab materjaliteaduse ja tehnoloogiaettevõtluse seoseid ja omab teadmisi ja oskusi materjaliteaduse ja -tehnoloogia alase teadus- ja arendustöö seostamiseks tootearenduse ja kaubandusega. Ta oskab ära tunda ja sõnastada materjaliteadusega seotud probleeme ettevõtluses ning neid etteantud ajaraamides ja informatsiooniga kohaste meetoditega lahendada, oskab oma tööd  kriitilislt hinnata. On valmis osalema materjaliteaduse uurimistegevuses ning tegutsema materjaliteadusega seotud ettevõtte arendajana, oskab töötada meeskonnas, sealhulgas meeskonna juhina, on valmis aktiivselt osalema kodanikuühiskonnas ning  suhtub sallivalt hoiakute ja arvamuste mitmekesisusse, on teadlik oma tegevuse eetilistest aspektidest, võimalustest, piirangutest ja ühiskondlikust rollist, oskab hinnata enda ja teiste vajadust jätkuõppeks. Ta on suuteline väikeettevõtte tööd korraldama."}