{"KURSUSE_NIMI": "Andmetöötlus ja teadusarvutused", "KURSUSE_KOOD": "LTFY.05.001", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Programmeerimine"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine koosneb kahest osast. Esimeses neist toimuvad loengud, mille käigus antakse ülevaade olulisematest teadusarvutusülesannetest, lahendusalgoritmidest ning arvutusmeetoditest. Tutvustatakse teadusarvutusklastrite (HPC) ja pilvekeskkondade põhilisi omadusi. Detailsemalt käsitletakse levinumaid/kättesaadavamaid tarkvaraprogramme ja teeke suuremahuliste andmete töötluseks ja visualiseerimiseks. \nTeine aine osa toimub probleemipõhise õppe vormis, kus mõneüliõpilaselised rühmad lahendavad tegelikke teadusprobleeme kirjutades lihtsamaid programme teadusarvutuslike ülesannete lahendamiseks ning kasutades levinumaid/kättesaadavamaid tarkvaraprogramme ja teeke suuremahuliste andmete töötluseks ja visualiseerimiseks. Kursus lõppeb ettekandeseminariga, kus rühmad esitavad ning analüüsivad oma projekti tulemusi.Objectives/eesmärkid:  Anda ülevaade teadustöös ettetulevatest arvutusülesannetest, mis põhinevad suuremahulistel eksperimentaalsetel (või vaatlus) andmetel. Arendada teoreetilist arusaamist arvutuslike ülesannete lahendusviisidest. Anda praktilisi kogemusi kasutatavatest tehnikatest koos kaasaegsete teadusarvutuslike keskkondade kasutamise oskusega.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. tunneb põhilisi analüüsi ja arvutusmeetodeid suuremahuliste andmete töötlemiseks; 2. oskab valida sobivaid meetodeid oma kitsama eriala arvutusülesannete lahendamiseks; 3. suudab kirjutada lihtsamaid programme teadusarvutuslike ülesannete lahendamiseks kasutades kõrgtasemelisi programmeerimisvahendeid; 4. oskab kasutada levinumaid/kättesaadavamaid tarkvaraprogramme ja teeke suuremahuliste andmete töötluseks ja visualiseerimiseks; 5. tunneb teadusarvutusklastrite (HPC) ja pilvekeskkondade põhilisi omadusi;  6. oskab analüüsida arvutustega saadud tulemusi ning nende piiratust. Täpne info korralduse kohta on toodud aine Moodles. COVID-19 seotud kitsendustega kohanetakse vastavalt vajadusele."}