{"KURSUSE_NIMI": "Kompleksmuutuja funktsioonid füüsikas", "KURSUSE_KOOD": "LTFY.04.015", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika I", "Kõrgem matemaatika II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 52, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "See on traditsiooniline ülikoolikursus, mõninga rõhuasetusega füüsikaliste rakenduste suunas. Selgitatakse komplekstasandil defineeritud funktsioonide eripära: piirväärtuse, pidevuse ja tuletise mõisteid ning nende omavahelist seost. Sõnastatakse ning tõestatakse tarvilikud ja piisavad tingimused tuletise olemasoluks. Selgitatakse integraalarvutuse põhiteoreemi üldistamist komplekstasandile ning tõestatakse sellega seonduvad tähtsad teoreemid: Cauchy-Goursat' teoreem üheli- ja mitmelisidusas piirkonnas; Cauchy integraalvalem ja selle laiendused; Cauchy resiidide teoreem; Taylori teoreem; Laurent'i\nteoreem; Jordani lemma. Antakse ülevaade resiidide teooria rakendustest.Objectives/eesmärkid:  Anda füüsikule vajalikud baasteadmised kompleksmuutuja funktsioonide teooriast.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1. Tunneb teooria põhimõisteid: sise-, välis- ja rajapunkt; punkti ümbrus ja läbitorgatud ümbrus; sidus hulk; kinnine ja lahtine hulk; hulga sulund; tõkestatud ja tõkestamata hulk; kuhjumispunkt; lõpmatuspunkt. 2. Oskab arvutada kompleksmuutuja funktsiooni piirväärtust ja tuletist. 3. Teab, mis on kompleksmuutuja elementaarfunktsioonid ja tunneb nende põhiomadusi. 4. Omab ettekujutust analüütilisuse kontseptsioonist ja analüütiliste funktsioonide omadustest. 5. Teab mis on Riemanni sfäär ja Riemanni pind. 6. Tunneb konformse teisenduse põhiomadusi. 7. Tunneb komplekstasandi integraalarvutuse üldpõhimõtteid ja tähtsaid teoreeme (Cauchy-Goursat' teoreem, Taylori teoreem, Laurent'i teoreem, Cauchy integraalvalem, Cauchy resiidide teoreem, Jordani lemma). 8. Oskab klassifitseerida analüütiliste funktsioonide isoleeritud iseärasusi. 9. Tunneb resiidide teoreemi rakendusi: päratute integraalide arvutamine, Fourier' integraalid, põigetega kontuurid. Toimub 4.semestril"}