{"KURSUSE_NIMI": "Energiafüüsika", "KURSUSE_KOOD": "LTFY.02.018", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Elekter ja magnetism", "Kõrgem matemaatika II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Energiafüüsika on uus õppeaine, mida pakutakse esmakordselt 2024. aasta kevadel. Kursus on mõeldud  ennekõike TÜ füüsika magistritaseme üliõpilastele, aga ka teistele kolleegidele, kes soovivad mõista inimkasutuses oleva ning üldiselt looduses ringleva energia allikate liike, nende tõhusust, energiaülekande ning -salvestamise, kadude ning lõppkasutust määravaid ja piiravaid füüsikalisi protsesse ning aluspõhimõtteid. Kursusele on kavas kaasata seminaride vormis täiendavaid lektoreid/tippspetsialiste vst. aladelt (kui osalejaid on alla kümne, võib see olla problemaatiline; kursuse organiseerija otsib sellele lahendusi, võimalik on vastavad seminariosad teha kättesaadavaks ka laiemale kuulajaskonnale üldise seminari vormis).Objectives/eesmärkid:  Kursuse eesmärk on tutvustada erinevate keskkonna- ning tehnoloogiliste tegurite vastastikust koosmõju eksperimendi- ja arvutuspõhise füüsika taustal. Kursuse kavandamisel on lähtutud põhimõttest, et saadud teadmised võiksid olla kasulikud nii taristu planeerimisel kui ka taastuvenergia innovaatikas.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. Omab kooskõlalist ja mitmetahulist ettekujutust energia ringlusest looduses ja tehiskeskkonnas. 2. Omab detailsemaid teadmisi energia muundamisel, salvestamisel ja kasutamisel aset leidvatest füüsikalistest protsessidest, 3. Oskab adekvaatselt hinnata tuumaenergeetika tootmistsükliga seotud vabaneva, kasuliku ning kulutatud energia vahekordi. 4. Omab teadmisi taastuvenergiaressurssidest ja nende kasutamisest. 5. Omab teadmisi päikeseenergeetikast ja sellega seotud füüsikalistest protsessidest, 6. Oskab hinnata taastuvenergia varu, 7. Oskab hinnata taastuvenergiasüsteemide positiivset ja negatiivset mõju keskkonnale ja tehnilistele süsteemidele. 8. On teadlik fotokatalüütiliste materjalide kasutusvõimalustest vesiniku- ning jäätmemajanduses ning omab ettekujutust selle kulu/tulu piiridest. 9. On teadlik vesinikumajanduse võimalustest ja kitsaskohtadest. 10. Oskab esitada saadud teadmisi nii kirjas kui sõnas. Toimub alates 2025/2026 õppeaastast sügissemestril."}