{"KURSUSE_NIMI": "Keskkonnafüüsika praktikum", "KURSUSE_KOOD": "LTFY.05.002", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktikumi käigus käsitletakse atmosfääriaerosooli osakeste mõõtmespektri (suurusjaotuse) mõõtmise elektriliste, kondensatsiooniliste ja optiliste seadmete (spektromeetrite) tööprintsiipe ja ehitust, samuti mõõteprotsessi juhtimise ja andmetöötluse tarkvara; harjutatakse esitama mõõtetulemusi kahe- ja kolmemõõtmeliste graafikute ning pind-diagrammidena. Õpetatakse tulemusi tõlgendama aerosooli mõju seisukohalt ilmastikule, inimtegevusele ja elusorganismide  tervisele. \nKeskkonnadosimeetria sissejuhatavate materjalide läbitöötamise järel toimuvad arvutipraktikumid, kus vabavaralist kiirgusdooside hindamise tarkvara kasutades tehakse praktilise tööna läbi kiirgusdoosi hindamise protsess. Vaadeldakse mitut stsenaariumi - doosihinnang loodusliku kiirgusallika ja tehisliku kiirgusallika puhul.Objectives/eesmärkid:  Tutvustada õhus hõljuvaid aerosooliosakesi iseloomustavate põhiliste füüsikaliste omaduste (suurusjaotuse ja kontsentratsiooni) mõõtmise meetodeid ja vastavaid mõõteseadmeid. Luua ettekujutus, kuidas toimub praktiline keskkonnaseire. Anda ülevaade, kuidas toimub ioniseeriva kiirguse doosi hindamine keskkonnas.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1.\tTunneb aerosooliosakeste mõõtmespektri ja nende kontsentratsiooni mõõtmise elektriliste, kondensatsiooniliste  ja optiliste mõõteriistade mõõteprintsiipe ja -võimalusi; sama laetud osakeste liikuvusespektromeetrite kohta. 2.\tOskab käsitseda eelnimetatud seadmeid, tunneb mõõtetulemuste töötlemise tarkvara, oskab tulemusi esitada graafiliselt. 3.\tOskab tulemusi tõlgendada osakeste mõju seisukohalt ilmastikule, inimtegevusele ja elusorganismide tervisele. 4.\tTunneb keskkonna radioaktiivsuse ja dosimeetria põhimõisteid, suurusi ja ühikuid. 5.\tTunneb ioniseeriva kiirguse bioloogilisi mõjustusi, kiiritusradasid ja doosi kujunemist. 6.\tTunneb keskkonnaseire praktilise toimumise põhimõtteid ja oskab osaleda seirega seotud tegevustes. Praktilisi töid sooritatakse juhendavate õppejõududega üheskoos koostatud ajakava järgi. Ühe praktikumitöö sooritamiseks, mõõtmiste tegemiseks ja juhendava õppejõu küsimustele vastamiseks on ette nähtud 4 auditoorse töö tundi. Iseseisva töö käigus tehakse lõpptulemuste saamiseks vajalikud arvutused, antakse mõõtemääramatuse hinnangud ja vormistatakse praktilise töö aruanne. Aruanne valmib reeglina ühe nädala jooksul ja see esitatakse juhendavale õppejõule esimesel võimalusel. Aruannete kontrollimine ja õppejõu küsimustele vastamine toimub jooksva töö käigus. Arvestuse saamiseks peavad olema tehtud ja vastatud kõik praktikumitööd."}