{"KURSUSE_NIMI": "Materjalide uurimis- ja testimismeetodid", "KURSUSE_KOOD": "LTKT.01.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 28, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 98, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse math on 6EAP ja see toimub magistriõppe esimese aasta kevadsemestril. Kursus tutvustab 10-t materjalide uuringutes ja testimisel kasutatavat füüsikalist uurimismeetodit materjalide pinnaomaduste, koostise, struktuuri ja mehaaniliste omaduste määramiseks olles täienduseks kursuses \"Uurimismeetodid materjaliteaduses, LTKT.01.001\" käsitletule - viimane on soovitav, kuid mitte kohustuslik eelnevalt läbida. Kursus koosneb ühest sissejuhatavast loengust füüsikaliste karakteriseerimis- ja testimismeetodite aluste ja õppeaine struktuuri ning korralduse kohta, ja iseseisvast tööst, loengutest ning paraktikumist iga käsitletava meetodi jaoks. Enne seminare toimub iseseisev töö uute meetoditega teoreetiliseks tutvumiseks meetodit tutvustava ülevaate, soovitatava kirjanduse ja lisamaterjalide põhjal. Loengutes arutatakse läbi konkreetse meetodi tööprintsiibid ning meetodi rakendamiseks kasutatava aparatuuri võimalused, praktilise töö eesmärgid ning läbiviimise kord, k.a. tööohutus. Praktilised tööd toimuvad rühmatööna konkreetse ülesande lahendamiseks etteantud meetodit ja katseseadet kasutades, mille jaoks katseobjektid annab meetodit tutvustav õppejõud. Igal üliõpilasel tuleb sooritada vähemalt 7 praktilist tööd. Kursuse keskel ja lõpus on seminarid, kus üliõpilased tutvustavad kõiki kursuses käsitletud meetodeid ja oma praktiliste tööde tulemusi. Üliõpilased saavad punkte nii seminari vastuste kui prakiliste tööde ja ettekannete eduka sooritamise eest. Kursus on positiivselt sooritatud (arvestatud) kui üliõpilane on saanud vähemalt 11 punkti: 7 praktikumi ja 4 seminariettekande eest.\nKursuse jooksul tutvustatakse nelja materjalide testimise valdkonda ning eri meetodeid nii materjalide struktuuri, koostise kui ka piirpinna karakteriseerimisel.Objectives/eesmärkid:  Eesmärgiks on anda lühiülevaade kaasaegsetest materjalide uurimise, karakteriseerimise ja testimise meetoditest, vastava teabe põhilistest allikatest ning tutvuda lähemalt vähemalt kümne meetodiga nii teoreetiliselt kui praktiliselt, arendades iseseisva töö oskusi meetodite teoreetilisel tundmaõppimisel ning kinnistades omandatud teadmisi ja omandades esmaseid praktilisi oskusi praktikumides läbiviidavates lühiuuringutes ja testides.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane omab ülevaadet kaasaegsete materjalide põhilistest uurimis-, karakteriseerimis- ja testimismeetoditest ja oskab leida sellekohast täiendavat informatsiooni nii erialaraamatutest kui -ajakirjadest, samuti ka asjakohastelt veebilehekülgedelt. Ta on saanud teoreetilised alused ja esmase praktilise kogemuse mitmete materjaliteaduses ja -tehnoloogias kasutatavate meetodite alal. Ta oskab neid teadmisi ja oskusi kasutada teadus- ja arendustöö tegemiseks materjaliteaduse ja materjalitehnoloogia vallas, oskab ära tunda nende meetodite kasutamise vajaduse ja neist optimaalse valida, oskab materjaliuuringutega seotud probleeme etteantud ajaraamides ja informatsiooniga kohaste uurimismeetoditega lahendada, on võimeline andma põhjendatud hinnanguid materjalide testimist ja materjaliuuringuid puudutavates küsimustes, osates tulemusi esitada nii suuliselt kui kirjalikult. Samuti oskab neid meetodeid vajadusel kasutada ka teiste valdkondade probleemide lahendamiseks."}