{"KURSUSE_NIMI": "Loodusteadusliku meetodi seminar", "KURSUSE_KOOD": "LTKT.00.001", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 2, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilased omandavad näidete varal loodusteadusliku meetodi, andmete analüüsi ja esitamise põhitõdesid, õpivad eristama teadust pseudoteadusest ning tutvuvad teaduse kvaliteeti tagavate mehhanismide ja teadusinfo-alaste andmebaasidega. Teaduse hea tava nõuete kontekstis analüüsitakse varasematel aastatel kaitstud bakalaureusetöid või teadusartikleid. Seejärel teostatakse lühiprojekt TÜ Keemia instituudi laboris, mille käigus omandatakse praktiline kogemus hüpoteesidele vastavate katsete planeerimiseks, läbiviimiseks, analüüsimiseks ja tutvustamiseks erialasele publikule.\nÕppeaine arendab muuhulgas järgnevaid ülekantavaid oskusi:\na) ajaplaneerimine (tähtajaliste iseseistvate tööde õigeaegse esitamise kaudu),\nb) rühmatöös osalemise kogemus (kodutööd rühmatöö vormis ning suhtlemine mentoriga, sisse elamine funktsioneeriva teadusrühma töörütmi praktilise töö käigus),\nc) tagasiside andmine (anonüümne retsensioon teiste üliõpilaste ettekannetele),\nd) esinemise kogemus (2 suulist ettekannet).Objectives/eesmärkid:  Kursuse esimese osa eesmärgiks on anda üliõpilastele ülevaade loodusteadusliku meetodi olemusest, teadlase karjäärist akadeemias ja tööstuses, teaduslike publikatsioonide kvaliteedinäitajatest ja teaduse heast tavast üldiselt ning arendada üliõpilaste kriitilise mõtlemise ja lugemise oskused. Valmib analüüs varasematel aastatel TÜ KI kaitstud bakalaureusetööst või ETIS 1.1-tüüpi teadusartiklist, mille alusel tehakse suuline ettekanne. Kursuse teise osa eesmärgiks on anda üliõpilastele ülevaade teadusteksti kirjutamise baasoskustest, eksperimentaalse töö planeerimisest ning tutvustada erialaste andmebaaside kasutamist teadusinformatsiooni otsimiseks. Kursuse teises pooles osalevad üliõpilased erinevate teadusgruppide juures ühe teadusprobleemi lahendamisel ning esitavad töö tulemuste põhjal kirjaliku aruande, mille kaitsmine toimub suulise ettekandena. Kursus valmistab üliõpilasi ette bakalaureusetöö tegemiseks.Learning outcomes/õpiväljund:  Aine 1. OSA  1.\tÜliõpilane oskab eristada kvaliteetse teaduse, teadusliku väärkäitumise ja pseudoteaduse tunnuseid (kontrollivorm: kodutöö). 2.\tÜliõpilane oskab sõnastada arvamust fundamentaal- ja rakendusteaduse olulisusest (koos relevantsete näidetega mõlema teema kohta) ning omab ettekujutust teadlase karjääri eri staadiumitest ja teaduskollektiivide toimimisest (kontrollivorm: kodutöö). 3.\tÜliõpilane on tutvunud teadusliku avastusprotsessi loogikaga (ajalooliste näidete varal) ning on teadlik teadustöödele esitatavatest kaasaegsetest nõuetest, sh ohutusnõuetest (kontrollivorm: kodutööd). 4.\tÜliõpilane on teadlik kaasaegsetest mehhanismidest, mis tagavad teadustööde kvaliteeti, ning nende võimalikest piirangutest (kontrollivorm: kodutöö). 5.\tÜliõpilane oskab lugeda, analüüsida, tutvustada, diskuteerida ja tagasisidestada teise autori poolt teostatud teadustööd viisil, mis vastab loodusteadusliku meetodi heale tavale (kontrollivorm: kodutöö, ettekanne, osalemine akadeemilises diskussioonis).  Aine 2. OSA 1.\tÜliõpilane tunneb peamisi keemiaalase teaduskirjanduse ning patendiinformatsiooni sisaldavaid andmebaase ning oskab neid kasutada vajaliku teadusliku info kogumiseks (kontrollivorm: kodutööd). 2.\tÜliõpilane oskab planeerida ning teostada eksperimentaalset tööd püstitatud hüpoteesi kontrollimiseks (kontrollivorm: osavõtt eksperimentaalprojektist valitud laboris mentori juhendamisel). 3.\tÜliõpilane oskab tehtud töö tulemusi analüüsida ning neid korrektselt esitada nii kirjalikus kui ka suulises vormis (kontrollivorm: kodutöö ja kirjalik aruanne). 4.\tÜliõpilane oskab tutvustada ja diskuteerida enda poolt teostatud teadustööd viisil, mis vastab loodusteadusliku meetodi heale tavale, ning tagasisidestada teiste esinejate töid (kontrollivorm: ettekanne, osalemine akadeemilises diskussioonis). Toimub 3. semestril (2018/2019 süg)\nAktiivsed mentorid: Kaido Viht, Erki Enkvist, Darja Lavõgina, Ago Rinken, Kaisa Mihklepp, Toonika Rinken, Jaak Nerut, Tavo Romann, Ave Sarapuu, Nadežda Kongi, Koit Herodes, Lauri Sikk"}