{"KURSUSE_NIMI": "Rakenduslik bioorgaaniline keemia", "KURSUSE_KOOD": "LTKT.10.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Bioorgaaniline keemia"], "SOOVITUSLIKUD_EELDUSAINED": ["Orgaaniline keemia I"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Üldistav kursus, mis käsitleb bioloogiliste objektidega seotud keemilisi reaktsioone ja protsesse. Võtab analüüsi alla erinevad aktuaalsed biokeemiaga seotud teemad ning püüab avada õppijate aktiivsel osalusel nende keemilise olemuse. Toob esile nende protsesside kirjeldamiseks ja uurimiseks vajalikud seosed teiste keemia ja füüsika kitsamate erialadega. Seminaride täpne temaatika otsustatakse vahetult semestri alguses, lähtudes parasjagu ühiskonnas päevakorras olevast teemadest, mis on seotud bioorgaanilise keemiagaObjectives/eesmärkid:  Süvendada  õppija oskusi rakendada keemilist lähenemist erinevate meid ümbritsevate igapäevaste looduslike nähtuste aga ka tööstuslike protsesside mõistmisel, uurimisel ja rakendamisel. Anda juurde teadmisi bioloogiliste protsesside keemia mõistmisel ning aidata õppijal rakendada omandatud teadmisi erinevate igapäevaeluga seotud probleemide analüüsil ja ülesannete lahendamisel ning teistele selgitamisel. Annab ülevaate biokeemiaga seotud tööstusest ja sealsetest uusimatest arengutest.Learning outcomes/õpiväljund:  Kursuse läbinu: o Omab süsteemset ülevaadet põhiliste biomolekulide struktuuridest ja oskab hinnata nende keemilisi omadusi. o Teab biomolekulide metabolismi keemilisi ja bioloogilisi põhiprintssipe ning oskab neid teadmisi rakendada biokeemiliste protsesside analüüsil ja kirjeldamisel. o Oskab rakendada bioorgaanilise keemia teadmisi ümbritsevas looduses, organismides, aga ka tööstuslikus tootmises toimuvate protsesside kirjeldamisel, analüüsil ja uurimisel. o Oskab esitada ja kaitsta oma analüüside ning uurimuste tulemusi nii erialaspetsialistidele kui ka laiemale publikule. o Omab ülevaadet uusimatest suundadest biokeemia ja biotehnoloogia rakendustest eri eluvaldkondades."}