{"KURSUSE_NIMI": "Keemilise analüüsi praktikum", "KURSUSE_KOOD": "LTKT.06.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Keemia alused", "Analüütilise keemia põhikursus", "Laboritöö praktikum", "Analüütilise keemia praktikum I"], "SOOVITUSLIKUD_EELDUSAINED": ["Tõenäosusteooria ja matemaatiline statistika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 60, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktilised tööd analüütilisest keemiast: kaalumine, lahuste valmistamine, levinumate analüüsil kasutatavate laborivahendite käsitsemine, proovi eeltöötlus, tiitrimeetria (ka mittevesilahustes), potentsiomeetria, kromatograafia, kromato-massispektromeetria, aatom- ja molekulspektroskoopia.\nAndmetöötlus (k.a. mõõtemääramatuse hindamine reaalselt kogutud andmetega) analüütilises keemias.\nIga töö sisaldab erinevaid etappe: etteantud andmete kohta arvutusfaili koostamine; suuline arutelu töö teooria ja rakenduste kohta; praktiline töö; arvutused reaalselt saadud andmetega tabelarvutusprogrammis ning andmete ja saadud tulemuste kriitiline hindamine.Objectives/eesmärkid:  Anda tudengile praktilised teadmised levinumate keemiliste analüüside kohta. Toetada õppijate suulise eneväljendusoskuse arengut. Õppija arendab keemiliste analüüside läbiviimisega vajalikke õpioskusi (vajalikud töövõtted ja andmetöötlusoskused).Learning outcomes/õpiväljund:  Pärast praktikumi kursuse läbimist tudeng - teab ja oskab suuliselt selgitada põhimõtteid ja rakendusi järgmiste analüüsimeetodite kohta: tiitrimeetria (ka mittevesilahustes), potentsiomeetria, kromatograafia (GC, LC), kromatomassispektromeetria (GSMS, LCMS), aatomemissioon- ja aatomabsorbtsioonspektroskoopia, molekulspektroskoopia; - teab keerulisemaid proovide ettevalmistamise põhitõdesid keemilises analüüsis; - rakendab selektiivsuse saavutamise põhimõtteid proovi ettevalmistuse korral; - teab põhilisi keemilise analüüsi määramatuse allikaid ja oskab hinnata konkreetse analüüsi juures nende kaalu, pakub võimalusi mõõtemääramatuse vähendamiseks; - oskab teostada proovi eeltöötluse ja viia iseseisvalt läbi keemilist analüüsi; - teab põhilisi keemilise analüüsi määramatuse allikaid ja oskab konkreetse analüüsi juures hinnata, millised neist on olulise kaaluga; - arvutab keemilise analüüsi tulemuse, hinnates kriitiliselt kogutud andmeid ning saadud tulemust, sealjuures kasutades sihtotstarbeliselt tabelarvutusprogrammi (nt MS Excel)."}