{"KURSUSE_NIMI": "Fluorestsentsispektroskoopia põhimõtted ja rakendused", "KURSUSE_KOOD": "LTKT.06.012", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 6, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 12}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Suuresti tänu heale selektiivsusele ja tundlikkusele on fluorestsentsspektroskoopia võimas tööriist, mida analüütilised keemikud kasutavad erinevates valdkondades. Fluorestsentsspektroskoopia tänapäevased rakendused hõlmavad keskkonna-, jätkusuutlikkuse- ja biotehnoloogiaalaseid analüüse. Antud kursuse raames käsitletakse fluorestsentsi põhialused, fotofüüsikaliste nähtusi fluorestsentsspektroskoopias, fluorestsentsi instrumente ja sensoreid ning fluorestsentsspektroskoopia uuemaid suundasid. Kursus keskendub fotofüüsikaliste efektide mõjule fluorestsentsandmetele ning nende mõjule mõõtmemääramatusele. Kursusel tutvustatakse uusi rakendusi mitmemõõtmelises fluorestsentsspektroskoopias koos kemomeetrilise analüüsiga, mis on seotud uudsete rakendustega keskkonna ja sellega seotud valdkondades Kursusega viiakse läbi seminari stiilis loengutena, õppimise tõhustamiseks kasutatakse aktiivõppe ja kriitilise mõtlemise strateegiaid. Samuti töötatakse välja praktiline laboritöö, mille läbi saavad tudengid praktilise kogemuse fluorestsents spektroskoopia alal.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade fluorestsents spektroskoopia tööpõhimõttest ja rakendusvõimalustest, õpetada vastavaid laboritöö võtteid ja andmetöötlust ning arendada tudengite kriitilist mõtlemist hindamaks fluorestsentsiandmete kvaliteeti.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:  --1-- saab aru fluorestsentsi põhialustest;  --2-- mõistab fluorestsentsspektroskoopia fotofüüsikalisi nähtusi;  --3-- teab põhilisi seadmete tüüpe ja andureid ning fluorestsentsspektroskoopia uusi suundi;  --4-- oskab ennustada fotofüüsikaliste efektide mõju fluorestsentsiandmetele;  --5-- omab ülevaadet mitmemõõtmelise fluorestsentsspektroskoopia uutest rakendustest koos kemomeetrilise analüüsiga;  --6-- oskab läbi viia lihtsaid katseid fluorestsentsspektroskoopias ning viia läbi saadud andmetega andmetöötlust; --7-- oskab kriitiliselt hinnata fluorestsentsispektroskoopia andmeid, nende kvaliteeti ja nende kasutatavust etteantud probleemide lahendamiseks."}