{"KURSUSE_NIMI": "Vesinikupõhised energiakandjad - tehnoloogia ja majandus", "KURSUSE_KOOD": "LTKT.02.017", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab ülevaate põhilistest vesinikenergeetika võimalustest jätkusuutliku lahendusena roheenergia salvestamisel. Kursuse raames selgitatakse, millised on vesinikenergeetika eelised ja põhilised kitsaskohad. Kursus annab ülevaate põhilistest vesiniku tootmise, salvestamise ja kasutamise võimalustest tehnilisel tasemel, kuid avab ka vesiniku kasutuselevõtu sotsiaalmajanduslikke aspekte, vaatleb tulevikustsenaariume ja prognoose. Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade vesinikenergeetika põhialustest nii tehnilisel kui ka sotsiaalmajanduslikul tasemel. Tutvutakse vesiniku tootmise ja salvestamise võtmetehnoloogiatega ning vesiniku kõige olulisemate rakendustega nii transpordi- kui tööstussektoris. Kursust viivad lisaks Tartu Ülikooli õppejõududele läbi tippspetsialistid vesinikenergeetikaga tegelevatest Eesti ettevõtetest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1.\tTeab, miks on vajalik üleminek jätkusuutlikele energialahendustele ja milliseid võimalusi pakub selles valdkonnas vesinikenergeetika rakendamine. \n2.\tTunneb põhilisi vesiniku tootmise tehnoloogiaid, teab nendes kasutatavaid põhilisi materjale, teab nende süsteemide efektiivsust ja jõudlust mõjutavaid tegureid.\n3.\tTunneb põhilisi vesiniku salvestamise võimalusi ja erinevate salvestusviiside eeliseid ja puudusi. \n4.\tTeab põhilisi vesiniku otseseid ja kaudseid rakendusvõimalusi nii transpordi- kui tööstussektoris (sünteesgaas, ammoniaak jne.). Teab nende rakenduste eeliseid ja ka nõrkusi. \n5.\tOn kursis erinevate vesinikenergeetika arenguprognoosidega ning  arengustsenaariumitega. \n6.\tOn kursis suure energiaettevõtte kaalutlustega vesinikenergeetika rakendamisel. \n"}