{"KURSUSE_NIMI": "Orgaanilise sünteesi eripraktikum", "KURSUSE_KOOD": "LTKT.09.003", "EAP": 9, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Orgaaniline keemia I", "Orgaanilise keemia praktikum"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 72, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 146, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktikumi käigus teostatakse üks mitmeetapiline süntees. Alustatakse sünteesi planeerimisest, teostatakse  lõpp-produktide (vajadusel lähteainete, vaheproduktide) puhastamine ja täielik struktuuranalüüs. Samuti kasutatakse otsinguid andmebaasides ja vajadusel kvantkeemilisi arvutusi ja spektrite simuleerimist. Koostatakse aruanne.Objectives/eesmärkid:  Anda üliõpilasele praktilised oskused kaasaegse orgaanilise sünteesi iseseisvaks planeerimiseks, teostamiseks ning ainete puhtuse ja struktuuri analüüsimiseks.Learning outcomes/õpiväljund:  Üliõpilased peavad oskama sünteesiskeemi keemiliselt ja kogu projekti tehniliselt ise planeerida. Nad peavad teadma retrosünteesi põhialuseid. Üliõpilased peavad tundma infootsingu ja sünteesimeetodite hindamise põhimõtteid. Üliõpilased peavad tundma ainete (lähteainete, produktide, lahustite) puhastamise meetodeid. Üliõpilased peavad teadma niiskuse- ja hapnikutundlike ainetega töötamise meetodeid,  jahutamise ja kuumutamise meetodeid. Üliõpilased peavad oskama iseseisvalt teostada sünteese, jälgima erinevate meetoditega nende kulgu ning võtma töö käigus vastu otsuseid. Üliõpilased peavad oskama teha eksperimendi käigus tähelepanekuid, mis võivad mõjutada tulemusi ning mida on tarvis tulevikus arvesse võtta. Üliõpilased peavad teadma meetodeid, millega määrata eraldatud produktide puhtust ja tõestada nende struktuuri. Üliõpilased peavad oskama oma eksperimendi käigust jooksvalt aru anda. Üliõpilased peavad oskama kirjutada nõuetele vastava aruande oma eksperimentaalse töö kohta, seda analüüsima ja esitama. Esimene kohtumine toimub kolmapäeval 18.09 kell 10.15 Chemicumis 3D tiiva auditooriumis 3070. Praktiliste tööde ajad lepitakse kokku individuaalselt juhendajatega ja teostatakse orgaanilise keemia õppetooli teaduslaborites ja õppelaboris."}