{"KURSUSE_NIMI": "Taimefüsioloogia", "KURSUSE_KOOD": "LTMR.07.001", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuses antakse ülevaade taimede veevahetusest, mineraaltoitumisest, fotosünteesist, hingamisest, kasvust ja arengust, nende protsesside omavahelistest suhetest ja seostest väliskeskkonnaga organismi tasandil.Objectives/eesmärkid:  Aine annab ülevaade taimede molekulaarbioloogiast. See sisaldab fotosünteesi ja selle kontseptsioonid, taimede primaar metablismi, vee vahetus, mineraalse toitumise, kasvu ja arengu, ning interaktsioonid ümbruskonnaga.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: *\toskab seostada taimede anatoomilise ja morfoloogilise ehituse ning keemilise koostise iseärasused kohastumusena taimes toimuvate protsesside läbiviimiseks; *\toskab seletada lähtuvalt veepotentsiaali mõistest ja taime anatoomiast vee omastamise, liikumise ja eraldumise mehhanisme, mis võimaldavad reguleerida veevahetust sõltuvalt keskkonnatingimustest; *\ton omandanud arusaamise kuidas C3, C4 ja CAM taimed rakendavad valguse energiat veest ja süsihappegaasist suhkrute tootmiseks. Teab fotosünteesi kohastumusi erinevatel keskkonnatingimustel; *\tteab, milliseid keemilisi elemente omastavad taimed mullast, kuidas toimub nende omastamine ja ainevahetusse lülitumine membraanitranspordi vahendusel; *\toskab seletada taimede anatoomilise ja morfoloogilise struktuuri teket seemnes peituvast embrüost ja taime kasvuainete osa selles, samuti valgusretseptorite fütokroomi krüptokroomi ja neist lähtuvate signaaliradade tähtsust kohastumisel väliskeskkonnale fotomorfogeneesis; *\ttunneb peamisi taimehormoone ja nende regulatsioonimehhanisme; *\tteab peamisi taimepatogeenide vastu rakendatavaid kaitsemehhanisme."}