{"KURSUSE_NIMI": "Mikrobioloogia", "KURSUSE_KOOD": "LTMR.03.002", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 136, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse järgmisi teemasid: mikrobioloogia ajalugu, hüpoteesid elu tekke ja arengu kohta Maal, arhed ja bakterid kui kaks prokarüootide domeeni, prokarüootide tänapäevane klassifikatsioon, eu- ja prokarüootse raku võrdlus, hüpoteese eukarüootse rakku tekke ja eellaste kohta, arhede erilisus, prokarüootse raku detailsem iseloomustamine: membraanid, kest ja kapsel, piilid ja viburid, rakusisesed organellid ja varuained, endospoorid; rakkude liikumine ja paljunemine; keskkonnatingimuste (temperatuur, pH, rõhk, kiirgus, hapnik) toime mikroobirakule; konservandid, steriliseerimine ja desinfitseerimine; mikroorganismid looduse aineringetes; mikroorganismid meie igapäevases elus; mikroorganismide toitumine, toitumistüübid, aine- ja energiavahetus, suhkrute aeroobse ja anaeroobse katabolismi rajad, kemolitotroofia, bakteriaalne fotosüntees, anaeroobne hingamine. Bakterite genoomid ja koosluste metgenoomid. Inimese mikrobioom, bakterhaigused ja nende tekitajad.Bakteriofaagid ja nende arengutsüklid.Objectives/eesmärkid:  Kursuse põhieesmargid on: 1) tutvustada mikrobioloogia ajalugu ja teooriaid elu tekke kohta Maal, 2) iseloomustada prokarüootide mitmekesisust Maal, 3) iseloomustada erinevatesse domeenidesse kuuluvaid prokarüoote raku ehituse, koostise, metabolismi jt omaduse alusel, 4) analüüsida mikroorganismide levikut looduses, nende rolli looduse aineringetes ja meie igapäevaelus ning keskkonnatingimuste toimet mikroorganismidele, 5) iseloomustada mikroorganismide toitumist, metabolismiradu ja energeetilist ainevahetust, 6) tutvustada bakteriofaage ja nende arengutsükleid, 7) tutvustada kaasaegset mikroobidele ja mikroobikoosluste iseloomustamist genoomide ja metagenoomide kaudu, 8) iseloomustada inimese mikrobioomi ja olulisimaid bakterhaiguste tekitajaid.Learning outcomes/õpiväljund:  Kursuse läbinud, peaks üliõpilastel olema ülevaade mikrobioloogiateaduse ajaloost ja tänapäevast. Nad peaksid tundma hüpoteese elu tekkest ja evolutsioneerumisest Maal, orienteeruma tänapäevaste mikroorganismide mitmekesisuses, teades eluslooduse domeene, olulisimaid hõimkondi, perekondi ja liike bakteritel ja arhedel, oskama nimetada erisusi pro- ja eukarüootsel rakul, tundma prokarüootse raku ehitust, paljunemist, liikumist ja puhkeseisundeid (nt endospoorid). Nad peaksid suutma ühendada mikrobioloogiakursusest saadud teadmisi igapäevaeluga. Üliõpilased peaksid orienteeruma mikroorganismide metabolismis, teades peamisi suhkrute katabolismi- ja käärimisradasid, toitumistüüpe, energia hankimise võimalusi. Läbinud kursuse, peaksid üliõpilased mõistma, kuidas genoomide ja metagenoomide kaudu saab iseloomustada mikoorganisme ja nende looduslikke kooslusi ning teadma bakterhaigusi põhjustavaid baktereid ning olulisimaid fakte inimese mikrobioomi kohta."}