{"KURSUSE_NIMI": "Mikroobigeneetika", "KURSUSE_KOOD": "LTMR.03.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Mikrobioloogia I", "Geneetika I", "Biokeemia I", "Geneetika II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 39, "practice": 0, "seminar": 0, "independent_work": 117, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb neljast mõttelisest osast:\n1) nädala alguses on kolm loengut, mil tudengid saavad teoreetilisi teadmisi. Iga loengu alguses saavad tudengid paberil loengu olulisemate teemade kohta küsimused. \n\n2) reedel arutavad tudengid nädala alguses saadud küsimusi. Selleks on vaja vastused ette valmistada ning mõelda, mida teema kohta küsida. Sellega kinnistatakse teoreetilised teadmised.\n\n3) iga tudeng saab koduseks ülesandeks konstrueerida reportersüsteem, mida kasutada laboratsoorseks tööks. Arvesse peab võtam süsteemi stabiilsust, reportersüsteemi töökindlust ning reportervalgu sobivust bakterile ning transporti, plasmiidi replikatsiooni ning stabiilsust. Sellega õpitakse teoreetiliste teadmiset rakendamist.\n\n4) tudeng teeb ettekande ühe artikli põhjal mikroobigeeneetikast. Teema valib tudeng etteantud artiklite hulgast.\n\nKursusel käsitletakse bakterite genoomi struktuuri, topoloogiat ning genoomi koosseisus olevaid erinevaid DNA-elemente, nagu plasmiidid, transponeeruvad elemendid, CRISPR-Cas süsteem, integronid ja intronid. Selgitatakse DNA-elementide tähtsust bakterite kohanemisel keskkonnatingimustega ja elementide funktsioneerimist. \nAntakse ülevaade bakterite kollektiivsest käitumisest ning Salmonella enterica näitel patogeensete bakterite virulentsusmehhanismidest, selleks vajalike protsesside nagu kinnitumine ning biofilmi moodustumine. \nLisaks ülevaade bakterite rakupinna omadustest, mis on vajalik nii kinnitumiseks, biofilmi moodustumiseks kui ka krooniliste infektsioonide tekkeks. Käsitletakse  bakterite peamisi transportsüsteeme ning vesikulatsiooni, mis on bakterite grupikäitumiseks olulised protsessid.\n\nNende teadmisete põhjal konstrieeritakse erinevad reportersüsteemid, mida kasutatakse geeniekspresiooni, valgu lokalilsatsiooni, genoomi muteerimiseks või muude protsesside uurimiseks bakteris.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade bakteri genoomi elementidest ning nende kasutatavusest molekulaarbioloogias. Kursuse käigus omandatud teoreetiliste teadmiste rakendamiseks konstrueerivad tudengid reportersüsteemi.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane oskab:  * kasutada teoreetilisi teadmisi bakteri genoomi ehitusest, elementidest, transpordist, geeni ekspressioonist ning rakendada neid reportersüteemi loomiseks uurimaks bakteri füsioloogiat,  * hinnata plasmiidide stabiilsust ning valida erinevaid plasmiide laboratoorseks tööks,  * rakendada fluroestseeruvaid valke uurimistöös, * kriitiliselt hinnata reportersüsteemide töökindlust."}