{"KURSUSE_NIMI": "Nukleiinhapete keemia", "KURSUSE_KOOD": "LTMR.05.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Molekulaarbioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 10, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 136, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse loengu osas antakse tudengitele ülevaade nukleiinhapetest, nende komponentidest, geomeetriast, keemilistest omadustest ja ologonikleotiidide keemilisest sünteesist.\nKursuse praktilises osas õpivad üliõpilased puhastama rakulüsaadist RNA-valk komplekse, kasutades selleks ultratsentrifuugimist läbi sahharoosi gradiendi. Õpivad puhastama RNA-valk kompleksist RNA-d. Õpivad teisendama nukleiinhappe optilist tihedust teisteks ühikuteks. Õpivad sünteesima RNA ahelalt DNA ahelat, DNA lahutamist Polüakrüülamiid geelis ja geelis sisalduva informatsiooni analüüsimist.\nNB! Kursuse praktiline osa toimub tavaliselt ühel nädalavahetusel (reede-pühapäev). Praktikumi täpne toimumise aeg lepitakse kokku esimeses loengus.Objectives/eesmärkid:  Kursuse läbinud tudengid: \nTunnevad nukleiinhapete struktuuri ja omadusi. \nTunnevad nukleiinhapete struktuurset dünaamikat ja struktuuri tagavate jõudude olemust. \nOskavad analüüsida in silico ja keemiliselt nukleiinhapete struktuuri.\nOskavad puhastada nukleiinhapeid ja läbi viia valitud RNA eksperimente\nOn võimelised teostama lihtsamaid kristallograafiliste koordinaatide analüüse.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1) Teab nukleiinhape komponente, nende struktuuri ja keemilisi omadusi 2) Tunneb DNA ja RNA stuktuuri, stabiilsust ja geomeetriat 3) On kursis oligonukleotiidide keemilise sünteesiga 4) Oskab kasutada spetsiifiliste molekulide puhastamiseks ultratsentrifuugimise meetodit 5) Suudab puhastada RNA-d RNA-valk kompleksidest 6) Tunneb nukleiinhappe põhilisi omadusi 7) Oskab teostada RNA keemilist modifitseerimist 8) Oskab kasutada Polüakrüülamiid geelelektroforeesi nukleiinhapete lahutamiseks ja oskab elektroforeesi tulemusi analüüdsida 9) Oskab kasutada programmi PyMOL kritallstruktuuri kordinaatide järgi molekulide visualiseerimiseks ja oskab lihtsamaid operatsioone kordinaatide analüüsimiseks Õppeaine toimub, kui ainele on registreerunud vähemalt 5 üliõpilast. Kursuse esimeses loengus antakse ülevaade kursuse läbimise tingimustest ja osalevate tudengite arv selgub enne teise loengu toimumist."}