{"KURSUSE_NIMI": "Geneetiliselt muundatud organismid ja aretustöö", "KURSUSE_KOOD": "LTMR.03.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käesoleva kursuse raames vaadeldakse mitmeit erinevaid probleeme, mis on seotud geneetiliselt muundatud organismide (GMO-de) loomisega ja nende kasutamisega nii teaduslikel esmärkidel kui ka tootmises. Antakse ülevaade erinevatest metoodikates, mida kasutatakse nii GM taimede, bakterite kui ka loomade konstrueerimisel/loomisel. Selgitatakse praeguseks loodud GM organismide kasutamisvõimalusi, nende eeliseid võrreldes tavaliste organismidega ja nende kasutamisega seotud võimalike ohtusid. Antakse põhjalik ülevaade GM taimedest, mida kasvatakse põldudel ja mida kasutatakse ka nii loomasööda kui toidu valmistamisel. Põhjalikumalt peatutakse herbitsiidi ja kahjurputukate suhtes resistentsete taime sortide konstrueerimisel, mis on tänapäeval enim kasvatatavad GM taimed. Samuti käsitletakse GM baktereid, mida kasutatkse nii toidulisandite kui ka ravimite tootmiseks. Tuuakse ära ka põhilised edusammud GM kalade saamisel. Lisaks kirjeldatakse ka põhilisi arengusuundi GM loomade konstrueerimisel. Selgitatkse, millised on võimalused kasutada GM loomi kui mudelorganisme haiguste ja nende ravi meetodite väljatöötamisel. Lõpuks käsitletakse ka seadusloomet, mis reguleerib GM organismide konstrueerimist, kasvatamist ja kasutamist (kaasaarvatud kasvatamist väjaspool vastavaid uurimis asutusi) nii Euroopa Liidu maades kui ka Eestis.Objectives/eesmärkid:  Käesoleva loengukursuse eesmärgiks on anda ülevaade GM organismide loomise ajaloost, meetoditest, kasutamise võimalustest, nendega seotud potentsiaalsetest ohtudest ümbritsevale keskkonnale ja organismidele rakendatavast aretustööst.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng: \n1. Orienteerub GM organisme puudutavas seadusandluses; \n2. Teab, millistel eesmärkidel kasutatakse GMO-sid; \n3. On kursis ohtudega, mida tuleb arvestada GMO-de kasutamisel; \n4. On kursis erinevate võimalustega, GMO-de loomisel; \n5. Omab ülevaadet GM taimedest, mida kasutatakse tänapäeva põllumajanduses; \n6. On kursis viimastest GMO suundadest."}