{"KURSUSE_NIMI": "Geneetika", "KURSUSE_KOOD": "LTMR.03.001", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 21, "practice": 0, "seminar": 17, "independent_work": 118, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse esimestes osades selgitatakse geneetika põhimõisteid ja rakkude jagunemise põhiprintsiipe. Järgnevas osas pühendutakse klassikalise geneetika seaduspärasuste tundmaõppimisele (tunnuste pärandumise põhiprintsiibid, mendelism ja mendelismi kromosoomne alus, kromosoomide arv ja muutumised, kromosoomide molekulaarne ehitus, geenide aheldatus, kvantitatiivsete tunnuste pärandumine). Kursuse teises pooles käsitletakse molekulaargeneetikat ja genoomikat. Käsitletakse geeniregulatsiooni pro- ja eukarüootidel, molekulaargeneetika meetodeid. Kursuse lõpposas käsitletakse inimesegeneetikat, komplekstunnuste avaldumist, käitumisgeneetikat. Kursuse lõpposadena käsitletakse populatsiooniogeneetikat ja evolutsioonilist geneetikat.Objectives/eesmärkid:  Eesmärk on tutvustada üliõpilastele geneetika aluspõhimõtteid ning põhiprotsesse ja nende rakendamist geenitehnoloogias. Loengukursuses antakse ülevaade geneetika põhitõdedest, klassikalisest geneetikast, molekulaargeneetikast. Puudutatakse ka inimesegeneetikat, genoomikat, komplekstunnuste pärandumist, populatsiooni ning evolutsioonigeneetikat. Loengutes lahendatakse probleeme ja mõtlemisülesandeid.Learning outcomes/õpiväljund:  Kursuse läbimisel peaks üliõpilane suutma: * Mõista ning selgitada klassikalise geneetika põhimõtteid; * Mõista ning selgitada molekulaargeneetika protsesse, sh geneetilise materjali sünteesi, jagunemist rakkude vahel, geenide avaldumist; * Kasutada geneetika valdkonnale spetsiifilist terminoloogiat, sh oskama leida vajalikke mõisteid geneetika sõnastikest; * Rakendada geneetika põhiteadmisi erinevates eluvaldkondades; * Rakendada geneetika põhiteadmisi igapäevaelu küsimustes."}