{"KURSUSE_NIMI": "Diskreetne matemaatika I", "KURSUSE_KOOD": "LTMS.00.019", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Matemaatiline maailmapilt"], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimine"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 74, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Predikaadid ja kvantorid. Tõesuspuud. Predikaatloogika põhisamaväärsused. Sekventsiaalne lausearvutus. Peano aksiomaatika.  Graafid.  Ahelad, tsüklid, sidusus.  Puud. Toespuud. Minimaalse kaaluga toespuud. Suunatud graafid. Lühima tee leidmise ülesanne.Objectives/eesmärkid:  Arendada struktuurse mõtlemise oskust ja abstraktsioonivõimet.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane:\n1. On omandanud süsteemse ja seostatud ülevaate peamistest matemaatikas ja informaatikas kasutatavatest diskreetsest struktuuridest ning vastavatest mõistetest, tulemustest ja meetoditest.\n2. Oskab ise konstrueerida matemaatilisi arutluskäike kursuse valdkondades ja neid selgelt väljendada, kasutades vastava valdkonna standardterminoloogiat ja -tähistusi.\n 3. Oskab väljendada (mh suuliselt ja kaaslastele) väiteid lausearvutuse ja predikaatarvutuse valemitega, teha kindlaks valemite\nomadusi (nt kehtestatavus, samaselt tõesus) ja nendevahelisi seoseid (nt samaväärsus, järeldumine), teisendada valemeid sobivale kujule ning seostada tulemusi esialgsete väidetega.\n4. Oskab rakendada väidete tõestamisel matemaatilist induktsiooni.\n5. Suudab selgitada (sh suuliselt ja kaaslastele) graafiteooria põhimõisteid ning neid näidetega illustreerida ja omavahel seostada,\noskab kasutada  olukorra modelleerimiseks graafe ja puid ning teha olukorra kohta järeldusi graafide ja puude põhiomaduste abil. Täpsem info hindamisviiside ja hinde kujunemise kohta on saadaval Moodle'is.\n\n1. Loengud on alates teisest semestri nädalast vabatahtlikud konsultatsioonid aine teoreetilise osa omandamise toetamiseks. Loenguid ega konsultatsioone ei salvestata.\n\n2. Praktikumid toimuvad auditoorsetena ja neid ei salvestata. Praktikumis osalemiseks on vajalik kaasa võtta digiseade, millega saab sooritada teste keskkonnas Moodle."}