{"KURSUSE_NIMI": "Põhjuslikud mudelid", "KURSUSE_KOOD": "LTMS.00.073", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Andmeanalüüs II"], "SOOVITUSLIKUD_EELDUSAINED": ["Maatriksid statistikas", "Üldistatud lineaarsed mudelid", "Mitmemõõtmeline analüüs"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 64, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate kaasaegsest põhjuslike mõjude hindamise metoodikast. Esmalt tutvutakse põhjuslike mõjude defineerimise viisidega nii kontrafaktuaalseid tunnuseid kasutades kui põhjuslike graafide (nn DAGide) abil ja selgitatakse põhjuslike mõjude hinnatavust erinevate uuringukavandite korral. Samuti tuleb juttu erinevatest nihkeallikatest, mille tõttu hinnatud parameetrid ei pruugi olla korrektsed hinnangud põhjusliku mõjule.  Järgnevalt tutvutakse lihtsamate võtetega põhjusliku mõju hindamiseks: pöördtõenäosuse-kaalud ja standardiseerimine. Edasi õpitakse kasutama erinevat tüüpi põhjuslikke mudeleid (marginaalsed struktuurimudelid, struktuurse keskmise mudelid ja G-hinnangud) ning tutvutakse ka topeltrobustse hindamise põhimõttega.  Lisaks tuleb juttu ka põhjuslikust masinõppest.  Õpitakse tundma ja erinevates olukordades kasutama ka instrumenttunnuste mudeleid (erijuhuna nn Mendeli randomiseerimine). Kursuse viimane osa on pühendatud struktuurivõrrandite mudelitele, mille abil hinnatakse latentseid tunnuseid sisaldavaid seosestruktuure. Pooled seminarid toimuvad arvutiklassis, kus õpime metoodikat rakendama tarkvara R abil.Objectives/eesmärkid:  Tutvustada varjatud (latentseid) tunnuseid sisaldavaid mudeleid ja põhjuslike seoste tuvastamiseks kasutatavaid statistikameetodeid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\n* teab, mis on põhjuslik seos ja kuidas seda saab matemaatiliselt defineerida, kasutades potentsiaalseid (kontrafaktuaalseid) tunnuseid;\n* teab, millised uuringukavandid võimaldavad põhjusliku mõju hindamist, mõistab mittevaadeldud segajate probleemi vaatlusuuringutes ning valikunihke olemust;\n* oskab kasutada teediagramme (ehk suunatud atsüklilisi graafe ehk DAGe) põhjusliku seosestruktuuri kirjeldamisel ja põhjusliku mõju hinnatavuse kontrollimisel, oskab eristada otsest ja kaudset põhjuslikku mõju;\n* oskab kasutada peamisi võtteid põhjusliku mõju hindamiseks vaadeldud segajate korral: pöördtõenäosuse-kaalude kasutamine ja standardiseerimine;\n* tunneb peamisi põhjusliku mudeli tüüpe vaadeldud segajate korral: marginaalsed struktuurimudelid, struktuurse keskmise mudelid ja G-hinnangufunktsioon, kalduvusskooride kasutamine;\n* Teab peamisi põhjusliku masinõppe põhimõtteid;\n* oskab kasutada instrumenttunnuse-mudeleid põhjusliku mõju hindamisel \n* oskab planeerida ja analüüsida sihtkatse matkimisel põhinevaid uurnguid;\n* oskab defineerida latentseid tunnuseid sisaldavaid põhjuslikke mudeleid \n* teab ja oskab kasutada kinnitavat faktoranalüüsi;\n* oskab kasutada üldist latentsete komponentidega struktuurivõrrandite mudelit kirjeldamaks põhjuslikke mõjusid varjatud tunnuste vahel."}