{"KURSUSE_NIMI": "Origami ja matemaatika: voltimise kunst ja teadus", "KURSUSE_KOOD": "LTMS.00.086", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus \"Origami ja matemaatika: voltimise kunst ja teadus\" tutvustab origamit kui interdistsiplinaarset tööriista, mis ühendab loovust, matemaatilisi kontseptsioone ja probleemilahendamise oskusi. Kursus uurib origami ajaloolist ja kultuurilist tausta, selle matemaatilisi aluseid, sealhulgas sümmeetriat, geomeetrilisi kujundeid ja algoritme, ning praktilist rakendust disainis, inseneriteadustes ja teadusuuringutes. Läbi praktiliste ülesannete ja loovprojekti saavad üliõpilased kogemuse voltimise protsesside mõistmiseks ja kasutamiseks nii esteetilistes kui ka funktsionaalsetes kontekstides. Kursuse eesmärk on arendada üliõpilaste ruumilist mõtlemist, analüüsioskusi ja loovat lähenemist, pakkudes võimalust uurida, kuidas kunst ja teadus saavad üksteist täiendada.Objectives/eesmärkid:  Kursuse \"Origami ja matemaatika: voltimise kunst ja teadus\" eesmärk on tutvustada origamit kui interdistsiplinaarset tööriista, mis ühendab loovmõtlemist, matemaatilisi kontseptsioone ja probleemilahendusoskusi. Seega püütakse arendada üliõpilaste ruumilise mõtlemise, loogilise arutlemise ja esteetilise tajumise oskust, pakkudes praktilisi oskusi voltimisprotsesside kaudu. Lisaks käsitleb kursus origami rakendusi erinevates valdkondades, sealhulgas disainis, inseneriteadustes ja hariduses, et näidata, kuidas voltimise kunsti valdamine võib olla samal ajal võimalus loovaks teadustööks.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: tunneb origami ajalugu, põhimõtteid ja rakendusi erinevates valdkondades, sealhulgas matemaatikas, disainis ja inseneriteadustes; analüüsib ja tõlgendab voltimise protsesse matemaatiliste ja geomeetriliste mõistete kaudu; kavandab ja loob origami mudeleid, kombineerides inseneeriast tuntud voltimisvõtteid ja loovmõtlemist; selgitab ja esitleb voltimise protsesse, osates luua algoritmilisi juhiseid ja juhendmaterjale; hindab origami tehnikaid jätkusuutlikkuse ja materjalikasutuse kontekstis; arendab probleemilahendamise ja interdistsiplinaarse mõtlemise oskusi, kasutades origamit kui praktilist tööriista; mõistab, kuidas voltimisprotsesse rakendatakse kaasaegsetes teadusuuringutes ja tehnoloogias."}