{"KURSUSE_NIMI": "Matemaatiline statistika (1. osa)", "KURSUSE_KOOD": "LTMS.00.056", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 16, "seminar": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "This course covers the basic concepts and techniques of probability and statistics, starting with probability theory and Bayes' theorem. Students will also learn about diagnostic tests and how to apply them. The course then delves into types of data, including numeric and non-numeric data, and explores main descriptive statistics such as mean, standard deviation, and quartiles. Students will also learn how to choose proper visualization depending on the type of data (histograms, bar charts, and box plots).\nThe course then investigates random variables and discrete and continuous distributions. Students will learn about binomial, Poisson and normal distributions along with standard deviation and standard error, sample mean, prediction interval, and confidence interval. Students will learn how to compare means and percentages, and will be introduced to statistical hypothesis testing, including test statistics and p-values. \nThe course will then explore two-sample t-tests, both paired and unpaired, and how to compare percentages in two populations. \nFinally, students will learn about the chi-square test, and measures of correlation. Throughout the course, students will engage in practical applications of these concepts to real-world problems, enabling them to apply basic statistical methods to analyze data and communicate their findings.\nObjectives/eesmärkid:  Develop practical skills in probability and statistics, preparing students for advanced courses. Enhance understanding of statistical terms in scientific literature and build critical reading, thinking, and basic statistical analysis abilities.Learning outcomes/õpiväljund:  After passing the course students will have basic understanding of probability and statistics and also have enhanced their proficiency in transferable skills. Learning outcomes related to the subject:\n-\tUnderstand the concept of probability and its applications.\n-\tExplain Bayes’ theorem and its role in diagnostic testing and apply Bayes rule to real life problems.\n-\tDifferentiate between numeric and non-numeric data.\n-\tUnderstand and calculate main descriptive statistics: (mean, standard deviation, minimum, maximum, median, quantiles)\n-\tChoose appropriate vizualisation based on the data type (pie chart, bar chart, histogram, boxplot, scatter plot)\n-\tUnderstand the concept of random variables.\n-\tUnderstand continuous distributions, particularly the normal distribution and its properties.\n-\tApply properties of normal distribution for real life problems. Interpret the parameters of the normal distribution (mean and standard deviation).\n-\tUnderstand discrete distributions such as binomial and Poisson and utilize their useful properties in the real life problems. \n-\tConstruct confidence intervals for proportions and means.\n-\tUnderstand the need for statistical testing.\n-\tFormulate hypotheses, choose and apply appropriate statistical test and interpreting results.\n-\tPerform hypothesis testing for single proportion and difference of two proportions.\n-\tPerform hypothesis testing of the mean: one-sample t-test, paired data and independent samples.\n-\tUnderstand the chi-square test and its applications for testing independence in two-way tables and testing goodness of fit.\n-\tUnderstand the concept of correlation and measure of correlation. Learning outcomes related to transferable skills: \n-\tDevelop effective communication skills by actively listening, expressing ideas clearly, and resolving conflicts within a group setting.\n-\tCultivate collaborative abilities, including team building, delegation, and understanding shared responsibilities.\n-\tEnhance problem-solving skills through brainstorming, analytical thinking, and adaptability when working with others.\n-\tLearn to allocate tasks efficiently, prioritize effectively, and meet deadlines as part of a team effort.\n-\tGain leadership experience by taking charge when needed and motivating fellow team members.\n-\tPractice positive social interactions within a collaborative context.\n-\tHone negotiation skills and influence others constructively during group decision-making."}