{"KURSUSE_NIMI": "Arvuteooria (2. osa)", "KURSUSE_KOOD": "LTMS.00.067", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Algebra I", "Arvuteooria (1. osa)"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 14, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Algjuured. Ruutjäägid. Gaussi ruutvastavusseadus. Arvuteooria rakendused.Objectives/eesmärkid:  Aine järgneb elementaarse arvuteooria põhikursusele \"Arvuteooria (1.osa)\". Eesmärk on anda põhiteadmised klassikalisest elementaarsest arvuteooriast ja mõnest rakenduste jaoks olulisemast arvuteooria valdkonnast. Käsitletakse algjuuri ja ruutjääke. Tutvustatakse arvuteooria rakendusi krüptograafias.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1. teab, mis on algjuur, oskab neid leida ning oskab tõestada nende kohta käivaid lihtsamaid tulemusi; 2. teab, mis on ruutjääk, Legendre'i sümbol ja Jacobi sümbol, oskab viimaste väärtusi arvutada ning oskab tõestada lihtsamaid tulemusi ruutjääkide kohta; 3. tunneb lihtsamaid arvuteooria rakendusi krüptograafias, sealhulgas algarvulisuse testimist, Diffie-Hellmani võtmevahetust ja RSA krüptosüsteemi. Alates 2018/19. õppeaastast ei ole enam võimalik eelmise aasta praktikumitulemusi üle kanda.\n\nKui õppetöö viiakse kaugõppele:\n\n1. Loengute asemel: iseseisev töö loengukonspektiga. \na) Õppejõud vastab loenguks eraldatud ajal tekkinud küsimustele ja viib läbi interaktiivse tunnikontrolli. \nb) Loengute materjal jagatakse kuulajate vahel, kes teevad sellest loenguks eraldatud ajal lühiettekande ja selgitavad õppejõule, kuidas konspektis olevaid lünki täita. Selle punkti täitmine on lisatingimus kontrolltöödele pääsemiseks. \nNB! Miniseminarid salvestatakse ja salvestusi hoitakse kuni semestri lõpuni.  \n\n2. Praktikumid viiakse läbi kaugõppena BBB keskkonnas. On soovitatav lahendustest vähemalt minimaalne esitlus teha. \n\n3. Kontrolltöö on auditoorne kui vähegi võimalik. Kui ei ole, siis muutub suuliseks ja viiakse läbi üle elektrooniliste kommunikatsioonikanalite."}