{"KURSUSE_NIMI": "Diskreetne matemaatika", "KURSUSE_KOOD": "LTMS.00.066", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Matemaatiline maailmapilt"], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimine"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lausearvutuse valemite normaalkujud. Predikaadid ja kvantorid. Tõesuspuud. Predikaatloogika põhisamaväärsused.    Graafid.  Ahelad, tsüklid, sidusus.  Puud. Toespuud. Minimaalse kaaluga toespuud. Suunatud graafid. Lühima tee leidmise ülesanne.Objectives/eesmärkid:  Anda informaatikas vajaminevad matemaatilised alusteadmised ning arendada struktuurse mõtlemise oskust ja abstraktsioonivõimet.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1. On omandanud süsteemse ja seostatud ülevaate peamistest informaatikas kasutatavatest diskreetsest struktuuridest ning vastavatest mõistetest, tulemustest ja meetoditest. 2. Oskab ise konstrueerida matemaatilisi arutluskäike kursuse valdkondades ja neid selgelt väljendada, kasutades vastava valdkonna standardterminoloogiat ja -tähistusi. 3.\tOskab väljendada väiteid lausearvutuse ja predikaatarvutuse valemitega, teha kindlaks valemite omadusi (nt kehtestatavus, samaselt tõesus) ja nendevahelisi seoseid (nt samaväärsus, järeldumine), teisendada valemeid sobivale kujule ning seostada tulemusi esialgsete väidetega. 4. Oskab rakendada väidete tõestamisel induktsiooni. 5. Suudab selgitada graafiteooria põhimõisteid ning neid näidetega illustreerida ja omavahel seostada, oskab kasutada  olukorra modelleerimiseks graafe ja puid ning teha olukorra kohta järeldusi graafide ja puude põhiomaduste abil. Täpsem info loengute, hindamisviiside ja hinde kujunemise kohta on saadaval Moodle'is.\n\n1. Praktikumid toimuvad auditoorsetena.\n\n2. Kontrolltööd toimuvad praktikumide tavatoimumistest erineval ajal."}