{"KURSUSE_NIMI": "Ühe muutuja matemaatiline analüüs", "KURSUSE_KOOD": "LTMS.00.022", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika I", "Matemaatiline maailmapilt"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus järgneb kõrgema matemaatika algkursusele \"Kõrgem matemaatika I\" ning käsitleb süvendatult järgmisi teemasid: reaalarvude teooria, arvjadad ja -read, pidevad ja katkevad funktsioonid, Riemanni integraal, funktsionaaljadad ja -read.Objectives/eesmärkid:  Aine \"Ühe muutuja matemaatiline analüüs\" eesmärk on süvendatult käsitleda järgmisi teemasid: reaalarvude teooria, arvjadad ja -read, pidevad ja katkevad funktsioonid, diferentseeruvad funktsioonid, Riemanni integraal, funktsionaaljadad ja -read. Kriitilise mõtlemise oskuse toetamine, matemaatilise suulise eneseväljendusoskuse arendamine. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes.  Toetada õppijat suuliseks eksamiks valmistumisel (suuline seminari ettekanne, vaheeksam, lõpueksam).Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1) tunneb reaalarvude hulga struktuuri; oskab leida reaalarvude hulkade rajasid; teab absoluutväärtuse omadusi, oskab neid tõestada; 2) teab ja oskab tõestada koonduvate jadade omadusi ning koonduvusteooria põhiprintsiipe; oskab rakendada ridade tähtsamaid koonduvustunnuseid;  3) teab funktsiooni piirväärtuse epsilon-delta-definitsiooni ja oskab selle abil uurida funktsioonide pidevust; oskab sõnastada ja tõestada lõigus pideva funktsiooni tähtsamaid omadusi; 4) oskab sõnastada ja tõestada diferentsiaalarvutuse põhiteoreeme;  5) oskab defineerida Riemanni integraali; oskab defineerida Darboux' summad ja sõnastada nende abil integreeruvuse kriteeriumi; oskab tõestada diferentsiaal- ja integraalarvutuse põhiteoreemi; teab päratute integraalide definitsioone ja oskab hinnata lihtsamate integraalide koonduvust; 6) teab funktsionaaljadade ja -ridade ühtlase koonduvuse definitsiooni; oskab Weierstrassi koonduvustunnuse abil ära tunda ühtlaselt koonduvaid funktsionaalridu; oskab leida astmerea koonduvuspiirkonda ning tõestada astmerea summa tähtsamaid omadusi. 7) valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid ning rakendab neid ülesannete lahendamisel; 8) uurib ja koostab loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames; 9) on arutlenud seminariettekandel, suulisel vaheeksamil ja suulisel lõpueksamil matemaatiliste kontseptsioonide olemuse, tõestuse ja näidete üle."}