{"KURSUSE_NIMI": "Statistiline andmeteadus", "KURSUSE_KOOD": "LTMS.00.025", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 10, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 30, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus koosneb kolmest moodulist:\nAndmete kirjeldamise, visualiseerimise ja analüüsi alused (baasmoodul) - 2 EAP\nStatistilised mudelid ja mitmemõõtmeline analüüs - 2 EAP\nKeerukate andmestruktuuride analüüs - 2 EAP\nSuurtes andmehulkades orienteerumine, andmetest vajaliku informatsiooni leidmine ja korrektsete järelduste tegemine on tänapäeva ühiskonnas hädavajalik oskus nii erialasel tööl, kui juhtivatel kohtadel, poliitikas ja ettevõtluses. \nKursuse esimeses moodulis antakse vajalikud teadmised esmase andmeanalüüsi läbiviimiseks, teine moodul annab teadmised ja oskused mitmemõõtmelise statistika põhiliste meetodite rakendamiseks. Kolmas moodul annab ülevaate spetsiifilistest andmetöötlusmeetoditest ning oskused olulisemate meetodite rakendamiseks.Objectives/eesmärkid:  Andmete kirjeldamise, visualiseerimise ja analüüsi alused (baasmoodul) - 2 EAP Kursuse baasmoodul annab süstemaatilise ülevaate andmetöötluse ja -analüüsi elementaarsetest põhimõtetest. Tutvutakse populaarse analüüsikeskkonnaga R (ja kasutajamooduliga RStudio) ning õpitakse seda vahendit kasutama andmete esmasel töötlusel ja visualiseerimisel. Mooduli läbimine võimaldab doktorantidel otstarbekalt planeerida uuringute läbiviimist ja hilisemat töötlemist ning tulemuste tõlgendamist. Samuti annab ta vajalikud eelteadmised selleks, et doktorant omandaks andmeanalüüsi raportite ja teadusartiklite kriitilise lugemise oskuse hindamaks uuringu ülesehituse korrektsust, andmete piisavust, analüüsi ja selle põhjal tehtud järelduste valiidsust.   Statistilised mudelid ja mitmemõõtmeline analüüs - 2 EAP Mooduli eesmärgiks on tutvustada põhilisi töövahendeid andmetes esinevate mustrite ja seaduspärade avastamisel, testimisel ja uurimisel. Mooduli läbinud doktorant tunneb statistilise mudeli mõistet, oskab kasutada tarkvara R lineaarsete ja logistiliste regressioonimudelite hindamisel ning oskab kasutada tuntumaid mitmemõõtmelise analüüsi meetodeid. Keerukate andmestruktuuride analüüs (2 EAP) Moodulis tutvustatakse keerukamaid erinevate valdkondade teadustöödes kasutatavaid kaasaegse statistilise andmeanalüüsi meetodeid, mille eesmärgiks on mitmemõõtmeliste andmestruktuuride uurimine, varjatud seosestruktuuride avastamine ja/või realistlike prognoosimudelite loomine. Samuti antakse ülevaade sellest, millise metoodika abil analüüsitakse erinevaid spetsiifilisi andmeformaate (kordusmõõtmised, kestusandmed, ruumiandmed, jne).Learning outcomes/õpiväljund:  Baasmooduli läbimise järel oskab doktorant läbi viia esmast andmeanalüüsi paketiga R. Ta oskab planeerida enda empiirilist uuringut ja läbi viia kogutud andmete esmast analüüsi. Oskab suhtuda kriitiliselt kirjanduses esinevate andmeanalüüsi meetodite kasutusse. Teise mooduli läbinud doktorant oskab rakendada mitmemõõtmelise analüüsi põhilisi meetodeid paketiga R ja teha saadud tulemustest korrektseid järeldusi. Kolmanda mooduli läbinu on saanud ülevaate kaasaegse andmeanalüüsi spetsiifilistest meetoditest. Ta tunneb kordusmõõtmiste analüüsi ning ruumi- ja kestusuuringute andmete analüüsi meetodeid ja oskab läbi viia vastavaid analüüse. The module gives an overview of some methods of complex statistical analysis. The students will learn to recognize the research questions where these methods are needed and to conduct an analysis using these methods in R. The contents of this module (selection of methods to be introduced) may vary from year to year."}