{"KURSUSE_NIMI": "Matemaatiline analüüs II", "KURSUSE_KOOD": "LTMS.00.070", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika I"], "SOOVITUSLIKUD_EELDUSAINED": ["Matemaatiline maailmapilt"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 36, "seminar": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus järgneb reaalmuutuja analüüsi kursusele \"Matemaatiline analüüs I\" ning käsitleb süvendatult järgmisi teemasid: algfunktsioon ja määramata integraal, Riemanni integraal, funktsionaaljadad ja -read.Objectives/eesmärkid:  Aine \"Matemaatiline analüüs II\" eesmärk on süvendatult käsitleda järgmisi teemasid: algfunktsioon, määramata integraal, Riemanni integraal, funktsionaaljadad ja -read.  Kriitilise mõtlemise oskuse toetamine ning matemaatilise suulise ja kirjaliku eneseväljendusoskuse arendamine.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1) oskab defineerida algfunktsiooni ja määramata integraali; oskab rakendada määramata integraalide tähtsamaid omadusi; 2) oskab defineerida Riemanni integraali; oskab defineerida Darboux' summad ja sõnastada nende abil integreeruvuse kriteeriumi; oskab tõestada diferentsiaal- ja integraalarvutuse põhiteoreemi; teab päratute integraalide definitsioone ja oskab hinnata lihtsamate integraalide koonduvust; 3) teab funktsionaaljadade ja -ridade ühtlase koonduvuse definitsiooni; oskab Weierstrassi koonduvustunnuse abil ära tunda ühtlaselt koonduvaid funktsionaalridu; oskab leida astmerea koonduvuspiirkonda ning tõestada astmerea summa tähtsamaid omadusi. 4) valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid ning oskab neid siis rakendada; 5) uurib ja koostab loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames; 6) on arendanud matemaatilist kirjalikku eneseväljendusoskust kontrolltöödes ja matemaatilist suulist eneseväljendusoskust praktikumides, loengutes ja eksamil."}