{"KURSUSE_NIMI": "Diferentsiaalvõrrandite numbriline lahendamine", "KURSUSE_KOOD": "LTMS.00.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimine", "Kõrgem matemaatika II", "Kõrgem matemaatika I"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 32, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Teaduses ja tööstuses laiemalt on protsesside ennustamiseks ja aine struktuuri uurimiseks väga levinud diferentsiaalvõrrandite kasutamine.\nDiferentsiaalvõrrandite täpne lahendamine on aga enamasti väga raske, süsteemide korral pigem isegi võimatu missioon.\nTeisalt on ligikaudne lahendamine arvuti abil suhteliselt lihtne ka keerulisemate võrrandite korral ja sellega saab hakkama iga tudeng isegi siis, kui puuduvad sügavad matemaatilised teadmised. \n\nKursuses käsitletakse klassikalisi numbrilisi meetodeid harilike ja osatuletistega diferentsiaalvõrrandite alg- ja rajatingimustega ülesannete lahendamiseks. Praktikumides ja kodustes ülesannetes tutvustatakse konkreetseid mudeleid reaalelu probleemide lahendamiseks.\n\nKasuks tuleb huvi programmeerimise vastu, kuid hakkama saab ka siis, kui see huvi just negatiivne ei ole.Objectives/eesmärkid:  Tutvustada diferentsiaalvõrrandite klassikalisi ligikaudseid lahendusmeetodeid ja vaadelda reaalelus tekkivaid lihtsamaid mudeleid. \nÕpime praktikumis kasutama loengus vaadeldud arvutusmeetodeid ja algoritme. Arvutipraktikumis  kasutame vabavaralist Python tarkvara ja selle pakette (oma kodutöid saab teha ka muus programmis), mis annab samal ajal võimaluse arendada\nprogrammeerimisoskusi endale kasulikus suunas.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. Oskab numbriliselt lahendada algtingimustega diferentsiaalvõrrandeid ja süsteeme, s.h. kasutada Runge-Kutta meetodeid, mitmesammulisi ilmutatud ja ilmutamata meetodeid.\n2. Teab, mis on diferentsiaalvõrrandi lahendamiseks kasutatava meetodi stabiilsus ja mittestabiilsus. Oskab arvutada ligikaudset sammul tekkivat viga ja analüüsida vigade edasi kandumise mõju.\n3. Oskab numbriliselt lahendada diferentsiaalvõrrandi rajaülesandeid, s.h. kasutada tulistamismeetodit, diferentsmeetodit, lõplike elementide meetodit.\n4. Tunneb olulisemaid matemaatilise füüsika võrrandite tüüpe (hüperboolset, paraboolset ja elliptilist tüüpi võrrandeid).\n5. Oskab numbriliselt lahendada osatuletistega võrrandeid ja süsteeme, s.h. kasutada diferentsmeetodit, lõplike elementide meetodit.\n6. Oskab arvuti abil kasutada lõplike elementide meetodit praktikas vaja minevate standardülesannete jaoks, s.h. oskab triangulatsiooni ka ristkülikust keerulisemate piirkondade jaoks."}