{"KURSUSE_NIMI": "Magistritöö", "KURSUSE_KOOD": "LTMS.00.014", "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Magistritööga saadakse teadmised ja oskused teaduslikel alustel õpetajatööks vajalike lisamaterjalide koostamiseks ning/või nende rakendamise tulemuslikkuse hindamiseks. Seejuures saadakse ülevaade haridusteaduslikest uurimismeetoditest ning nende rakendamise spetsiifikast koolimatemaatikas ning nende seostamise võimalustest õpetajatööga.Objectives/eesmärkid:  Eesmärk on suunata üliõpilane mingi tervikliku matemaatika didaktika või pedagoogikaalase probleemi uurimisele, vastava uurimistöö tulemuste vormistamisele ja esitlemisele.Learning outcomes/õpiväljund:  Õppeaine läbinu: 1. Oskab teaduslikul alusel koostada õppetööks vajalikke lisamaterjale ning hinnata nende rakendamise tulemuslikkust ainetundides. 2. Oskab leida ja analüüsida teaduslikku infot ning suudab sellest ja enda poolt kogutud andmetest sünteesida uusi teadmisi koolimatemaatikas ja -informaatikas ning oskab selle põhjal koostada õpetajatööks vajalikke materjale. 3. Omab ülevaadet hariduslikest uurimismeetoditest ja eripärast ning oskab neid rakendada magistritöö koostamisel. 4. Oskab rakendada omandatud teadmisi ja oskusi teadusprobleemide sõnastamisel, uuringute planeerimisel ja läbiviimisel, kogutud andmete põhjal järelduste tegemisel ning nende kirjalikul ja suulisel esitamisel koolimatemaatika valdkonnas. 5. Oskab uurimustulemusi kirjalikult vormistada eesti keeles ja esitada neid suuliselt nii haridusteadlastele kui ka laiemale kuulajaskonnale, valdab akadeemilist diskussiooni ning oskab argumenteeritult kaitsta oma seisukohti. 6. Tunneb teaduseetika üldprintsiipe ning oskab hinnata uuringute teaduslikku taset ja rakenduslikku väärtust õpetajatöös."}