{"KURSUSE_NIMI": "Kõrgem matemaatika", "KURSUSE_KOOD": "LTMS.00.003", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 30, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kõrgema matemaatika kursus, milles käsitletakse järgmisi teemasid: maatriksid, determinandid, lineaarvõrrandisüsteemid, funktsioonid ja nende graafikud, funktsiooni piirväärtus ja pidevus, funktsiooni tuletis ja diferentsiaal ning nende rakendused, määramata integraal, määratud integraal,  selle rakendusedObjectives/eesmärkid:  See kursus annab algteadmised kõrgemas matemaatikas. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane:\n- oskab lahendada lineaarseid võrrandisüsteeme.\n- teab funktsiooni mõistet, funktsioonide liigitust. Oskab ära tunda põhiliste elementaarfunktsioonide graafikuid.\n- oskab arvutada piirväärtust ja teab piirväärtuse põhiomadusi. Teab pideva funktsiooni mõistet.\n- teab tuletise ja diferentsiaali mõisteid; teab tuletise põhilisi omadusi ja oskab neid leida; teab tuletise ja diferentsiaali tähtsamaid rakendusi;\n- oskab uurida funktsiooni ja teab, mis on kasvavad/kahanevad, kumerad/nõgusad funktsioonid;\n- teab algfunktsiooni mõistet ja oskab leida määramata integraali lihtsamal juhul;\n- valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel. 1. Antud (kordus)kursuse korral eeldatakse, et kursusel osaleja on juba enne praktikumi tulles iseseisvalt korralikult läbi töötanud vastava praktikumi teema(d) nii kohustusliku kui soovitusliku ning muu lisaõppematerjalide põhjal, sest praktikumides teooriast eraldi ei räägita ning praktikumide lõpus toimuvad tunnikontrollide küsimused eeldavad antud praktikumiks vajaliku materjali eelnevat iseseisvat läbi töötamist.\n\n2. Eelsalvestatud loengud on Moodle'is, töötada läbi enne vastava teema praktikumi.\n\n3. Praktikumid toimuvad auditoorsetena.\n\n4. Kontrolltöö toimub praktikumide tavatoimumistest erineval ajal.\n\n5. Täpsem info hindamisviiside ja hinde kujunemise kohta on saadaval Moodle'is.\n\n6. Korraga ei saa kuulata seda kursust ja MTMM.00.340 Kõrgem matemaatika I 6 EAP kursust, sest see kursus on alamhulk nimetatud 6 EAP kursusest."}