{"KURSUSE_NIMI": "Globaalmuutused, looduskeskkond ja inimene", "KURSUSE_KOOD": "LTOM.01.012", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine raames käsitletakse põhjalikult kliimamuutuste, maakasutuse muutuste, invasiivsete liikide leviku, saastekoormuse ning ülemäärase ressursikasutuse mõju looduskeskkonnale ning seeläbi ka inimühiskondadele. Aine läbinud üliõpilased orienteeruvad globaalmuutuste valdkonnas, on teadlikud globaalmuutuste põhjustest ning globaalmuutuste leevendamiseks ja nendega kohanemiseks vajalikest tegevustest ja praktikatest, tunnevad ära globaalmuutustest tulenevaid tagajärgi looduskeskkonnale ja inimühiskondadele ning oskavad neid oma edaspidises elus arvesse võtta.Objectives/eesmärkid:  Aine eesmärgiks on anda värskeim ülevaade globaalmuutustest, sealhulgas kliima- ja elurikkuse kao kriisist. Aine keskendub suureskaalaliste keskkonnamuutuste, looduskeskkonna ja inimeste omavahelistele seostele. Oluline fookus on globaalmuutuste mõjul looduskeskkonna ja ökosüsteemide toimimisele ning nende poolt pakutavatele ökosüsteemiteenustele. Kursuse käigus arendatakse üldpädevustest teadusliku informatsiooni otsimist ja teksti kirjutamist, kriitilist mõtlemist, meeskonnatöö oskuseid, probleemilahenduse oskust ning eestikeelset väljendusoskust.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n1) teab globaalmuutuste olemust ning seda põhjustavaid tegureid;\n2) teab Maa süsteemide seisundi võtmeindikaatoreid;\n3) oskab hinnata kliimakriisi ja elurikkuse kao mõju looduskeskkonnale, ökosüsteemiteenustele ning inimühiskondadele;\n4) tunneb globaalmuutuste leevendamiseks vajalikke rahvusvahelisi leppeid ning orienteerub erinevates tegutsemisvõimalustes.\n5) oskab teaduslikku infot otsida, kirjutada akadeemilist teksti\n6) oskab kriitiliselt mõelda, lahendada probleemülesandeid\n7) oskab meeskonnas töötada ja suuliselt end väljendada. Arvestades globaalmuutuste pakilisust ning suurt ühiskondlikku mõju, on loengukursus iga osaleja maailmapilti oluliselt avardav. Oodatud on aktiivne kohalkäimine, iseseisvalt lisamaterjalidega tutvumine ning diskussioonis osalemine loengute ja seminaride raames. Vastutasuks saab orienteerumisvõime kliima- ja keskkonnaga seotud valdkondades ning hea arusaama globaalmuutuste mõjudest."}