{"KURSUSE_NIMI": "Geograafia, kommunikatsioon ja ruumiline mobiilsus", "KURSUSE_KOOD": "LTOM.02.050", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 4, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse raames tutvustatakse ruumilise mobiilsuse käsitlemise teoreetilisi ja metodoloogilisi aspekte ning selle seoseid info- ja kommunikatsioonitehnoloogia kasutusega. Vaadeldakse positsioneerimise uuringute ja asukohapõhiste teenuste rakendusi linnaplaneerimises, äris ja turismiuuringutes. Käsitletakse IKT-põhiste suurandmete kasutamise eetilisi küsimusi ning kultuurilist ja kontekstist tulenevaid erisusi.\n\nKursus koosneb 7 loengust (2x45 min), 2 praktikumist, 5 seminaritööst ja 5 seminarist. Iga loengu ja seminari kohta on Moodle'i keskkonda lisatud täiendav teksti- või slaidimaterjal.Objectives/eesmärkid:  Õppeaine eesmärgiks on tutvustada inimeste ruumilise mobiilsuse, infoühiskonna ja targa linna kaasaegseid teemasid ja uurimismeetodeid. Erilist tähelepanu pööratakse mobiiltelefonidel ja teistel IKT allikatel põhinevatele uurimismeetoditele ja rakendustele linnaplaneerimises. Käsitletakse IKT-põhiste suurandmete kasutamise eetilisi küsimusi ning kultuurilist ja kontekstist tulenevaid erisusi.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane - tunneb ruumilise mobiilsuse käsitlemise mõisteid ja kontseptsioone; - teab, kuidas on seotud ruumiline mobiilsus, inimeste tegevused ja sotsiaalne mobiilsus; - teab, kuidas info- ja kommunikatsioonitehnoloogia mõjutab ruumilist mobiilsust; - teab ruumilise mobiilsuse uurimise meetodeid; - tunneb passiivse mobiilpositsioneerimise andmeid ja teab kuidas neid kasutatakse; - tunneb nutitelefonipõhiseid aktiivse mobiilpositsioneerimise meetodeid ja teab kuidas neid kasutatakse; - oskab mobiilpositsioneerimise andmete abil inimeste ruumilist mobiilsust mõõta; - oskab andmeid kriitiliselt analüüsida ja tuua esile nendes esinevaid puudujääke; - tunneb infoühiskonna ja targa linna kontseptsioone; - tunneb sotsiaalmeedia andmeid ja nende kasutamise meetodeid; - oskab kasutada IKT põhiseid infoallikaid linnaruumi iseloomustamisel ja linnaplaneerimisel; - on teadlik IKT-põhiste suurandmete kasutamisega seotud eetilistest probleemidest; - mõistab, kuidas kultuur ja kontekst mõjutavad andmete kättesaadavust ja kasutust; - omab ülevaadet rahvusvahelistest initsiatiividest suurandmete kasutamisel; - omab oskust töötada rühmas ja teostatud tööde tulemusi arusaadavalt esitada."}