{"KURSUSE_NIMI": "Geoloogiline kaardistamine ning regionaal- ja struktuurigeoloogiline välipraktika", "KURSUSE_KOOD": "LTOM.03.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Välikursus toimub mõnes Eestist geoloogiliselt erinevas piirkonnas (viimasel kolmel aastal on läbivioimise paigaks olnud Tšehhi Vabariik). Kursuse käigus õpitakse tundma geoloogilise kaardistamise metoodikat komplitseeritud struktuuridega aladel. Tutvutakse vulkaaniliste, intrusiivsete ja moondekivimite lasumusvormidega, õpitakse kaardistama kurd- ja murrangstruktuure.Objectives/eesmärkid:  Aine eesmärgiks on:\n1) omandada geoloogilise kaardistamise välitöö oskused\n2) valmistada üliõpilasi ette töötamiseks Läänemere regiooni spetsiifiliselt lihtsatest geoloogilistest  tingimustest erinevas, tektooniliselt ja struktuurselt keerulises geoloogilises situatsioonis. Selle tagamiseks on vajalik praktiline kokkupuude ja kogemus Eesti geoloogilises ehituses puuduvate geoloogiliste nähtuste, kivimite ja setete ning tektooniliste struktuuridega, käsitletuna regionaalgeoloogilises ja geokronoloogilises kontekstis.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\n\n1) tunneb põhilisi geoloogilise kaardistamise välitöö võtteid\n2) oskab kirjeldada geoloogilisi läbilõikeid\n3) oskab koostada geoloogilisi kaarte lhtudes kogutud kaardistamise andmetest\n4) oskab mõtestada regionaalseid geostruktuure ja nende arengulugu laamtektoonilises ja stratigraafilis-geokronoloogilises kontekstis.\n5) tunneb tektooniliselt komplitseeritud piirkondadele iseloomulike geoloogiliste nähtuste ilminguid ja erinevaid avaldumisvorme ning nende dokumenteerimise  tüüpvõtteid. \n6) tunneb sette-, magma ja moondekivimite tektooniliselt mõjutatud   lasumisvorme, struktuure ja tekstuure ning metamorfismiga seotud muutusi. \n7) oskab seostada regionaalse geoloogia iseärasusi piirkondlike maavarailmingutega ning mõistab regionaalset keskkonnageoloogilist konteksti."}