{"KURSUSE_NIMI": "Ehitusgeoloogia projekt", "KURSUSE_KOOD": "LTOM.03.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine koosneb neljast eraldiseisvast moodulist: 1. loengud; 2. välitöö; 3. ehitusgeoloogilise uuringu aruande koostamine: 4. laboripraktikumid.\n1. Loengud. Teooria- ja külalisloengud. Teoorialoengutes käsitletakse insenergeoloogia uurimismeetodeid ning tähtsamaid pinnase füüsikalisi ja mehaanilisi omadusi. Külalisloengutes esinevad valdkonna praktikud.\n2. Välitöö. Külastatakse ehitusgeoloogia ettevõtte poolt läbi viidavat reaalset välitööd, kus tutvutakse peamiste uuringumeetoditega ja võetakse võimalusel pinnaseproove laboripraktikumide jaoks. Välitöö külastus kestab vähemalt neli tundi ja toimub tõenäoliselt väljaspool loenguaegu. Aeg lepitakse osalejatega eelnevalt kokku. Välitöö kohta koostatakse lühiraport.\n3. Ehitusgeoloogilise uuringu aruande koostamine. Etteantud andmete ja digitaalsetest andmebaasidest-rakendustest kogutud info põhjal koostatakse aruanne ning kantakse tähtsamad tulemused seminaris ette.\n4. Laboripraktikumid. Kolmes laboripraktikumis määratakse pinnaseomadusi ja lahendatakse vastavate omadustega seotud praktiline ülesanne.\nMoodulid toimuvad osaliselt paralleelselt. Suurema osa aine mahust moodustab iseseisev töö erialaspetsialistide juhendamisel. Praktika toimub ülikoolisiseses õppekeskkonnas, kuid üliõpilasel on täita tavapärasest erinev roll spetsialisti ja laborandina. Praktika käigus lahendavad üliõpilased reaalseid ehitusgeoloogia ülesandeid, järgides valdkonna regulatsioone ja standardeid. Kursuse tulemusena esitatakse ehitusgeoloogilise uuringu aruanne, välitööde raport ja laboripraktikumide põhjal lahendatud ülesanded, millele üliõpilane saab tagasidet, et võimaldada tal analüüsida saadud erialast kogemust.Objectives/eesmärkid:  1. Anda üliõpilasele teadmised geoloogilistest teguritest ja pinnaste-kivimite omadustest, mis mõjutavad ehitustegevust ja planeeringuid. 2. Anda üliõpilastele oskused teoreetiliste teadmiste rakendamiseks läbi praktiliste ehitusgeoloogilise uuringu aruande koostamise, laboripraktikumide sooritamise, välitöödel osalemise ning erialaste probleemülesannete lahendamise erialaspetsialistide juhendamisel.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. Tunneb ja oskab kirjeldada peamisi insenergeoloogilisi probleeme, uuringumeetodeid ja nende kasutusvõimalusi. Oskab teoreetilisi teadmisi rakendada, analüüsides ja lahendades konkreetsetes geoloogilistes ja hüdrogeoloogilistes tingimustes esinevaid insenergeoloogilisi probleeme. 2. Mõistab pinnase füüsikaliste ja mehaaniliste omaduste sisu ja omavahelisi seoseid, oskab projekteerimiseks vajalikke pinnaseomadusi väli- ja laborikatsete andmete põhjal arvutada. 3. Oskab otsida ja süstematiseerida vajalikku infot avalikest digitaalsetest ruumiandmete andmebaasidest ja rakendustest, kombineerida seda väli- ja laborikatsete tulemustega ja koostada konkreetse ala geotehniliste tingimuste mudelit. 4. Oskab joonestusprogrammi kasutades koostada digitaalseid uuringupunktide logisid, geoloogilisi profiile ning asendiplaani. 5. Oskab eelnevates punktides nimetatud informatsiooni põhjal koostada ülevaatliku aruande ja tähtsamad tulemused ette kanda. 6. Omab kokkupuudet ehitusgeoloogia praktilise väljundiga ja oskab esmast töökogemust analüüsida ja mõtestada. 7. Osaleb laboratoorsetes grupitöödes."}