{"KURSUSE_NIMI": "Ökoloogilise ruumianalüüsi praktikum", "KURSUSE_KOOD": "LTOM.01.007", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Geoinformaatika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 12, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilased läbivad individuaalselt või rühmatööna probleemõppe, kus tuleb kasutada ruumiliste andmete analüüsi ühe konkreetse ökoloogilise küsimuse lahendamiseks. Iseseisvalt leitakse probleemi lahendamiseks sobilik metoodika, andmete vajadus, lahenduskäik ja tarkvara. Eelistatakse vabavaralise tarkvara kasutamist (nt. QGIs, R paketid), aga ei piirata kursust konkreetse tarkvaraga. Juhendajad annavad alguses ja vajadusel ka hiljem vihjeid optimaalse lahenduse leidmiseks. Kursuse lõpus esitatakse vormistatud lahendus kirjalikult ja tutvustatakse seda teistele. Samuti kommenteeritakse teiste üliõpilaste lahendusi.Objectives/eesmärkid:  Praktikumi eesmärgiks on saada kogemusi ökoloogilisest andmeteadusest. Rühmatöö ning probleemõppe meetodil leitakse konkreetsetele ökoloogiliste küsimustele lahenduse, koondades vabalt kättesaadavaid andmestikke ning valides optimaalseima ruumiliste andmete tasuta tarkvara ja lahenduskäigu. Juhendaja tagasisidestab leitud lahenduskäike. Praktikumi käigus arendatakse üldpädevustest meeskonnatöö oskuseid, probleemilahenduse oskust ning eestikeelset väljendusoskust, kuna kursuse lõpus esitatud kirjalikku lahendust tutvustatakse ka teistele kursuse üliõpilastele.Learning outcomes/õpiväljund:  Aine läbinud tudeng (1) oskab kasutada taustinformatsiooni probleemülesande lahendamisel; (2) suudab leida sobiliku tarkvara küsimuse lahendamiseks ning viib iseseisvalt selle kasutamise oskused vajalikule tasemele; (3) on võimeline lähtuvalt probleemist valima sobiva ruumiliste andmeanalüüsi metoodika ning seda rakendama; (4) suudab oma tulemust esitleda ja lahenduskäiku põhjendada; (5) orienteerub ruumilise andmeanalüüsi tavalisemates metoodikates, mida ökoloogiliste probleemide puhul kasutatakse; (6) esitab kursuse lõpus eneseanalüüsi. Osalejate miinimumarv on 5."}