{"KURSUSE_NIMI": "Keskkonnakommunikatsioon", "KURSUSE_KOOD": "LTOM.04.016", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 15, "practice": 0, "seminar": 6, "independent_work": 57, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine raames käsitletakse efektiivse kommunikatsiooni teoreetilisi tööriistu ja praktilisi näiteid keskkonnavaldkonna kommunikatsioonist avalikus- ja erasektoris ning meedias. Rühmatöö käigus harjutavad üliõpilased ise läbi ühe olukorra, kus on vaja rakendada keskkonna-alast kommunikatsiooni. Aine läbinud üliõpilased orienteeruvad kommunikatsioonivaldkonnas, oskavad valida sobivad lähenemisviisid sõltuvalt auditooriumist, oskavad ära tunda olukordi, kus neid püütakse proovile panna ja reageerida vastavalt olukorrale.\n\nÕppeaine on mõeldud Bioloogia ja ökoinnovatsiooni magistriõppekava üliõpilastele, aga seda võivad huvi korral läbida ka teiste õppekavade ja õppeastmete üliõpilased. Õppeaine ei eelda spetsiifilisi teadmisi, aga vajalik on valmisolek aktiivseks seminarides osalemiseks ja rühmatööna päris elus ette tuleva keskkonnakommunikatsiooni teemalise olukorra lahendamiseks.Objectives/eesmärkid:  Kursuse eesmärk on anda alusteadmised kommunikatsiooni olulisusest ja eripäradest keskkonnavaldkonnas ning ülevaade tööriistadest, mis keskkonna-alases kommunikatsioonis abiks võivad olla.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. mõistab kommunikatsiooni olulisust keskkonnaprobleemide lahendamisel 2. tunneb keskkonnavaldkonna kommunikatsiooni eripärasid 3. mõistab auditooriumi tundmise olulisust ja oskab läbi mõelda strateegia efektiivseks kommunikatsiooniks sõltuvalt auditooriumist 4. oskab kirjeldada kompleksset keskkonnavaldkonnaga seotud teemat arusaadavalt, aga nii, et lihtsustamisega ei läheks tõde kaduma 5. oskab eristada head ja halba kommunikatsiooni, tunda ära demagoogiat ja infoallika kallutatust 6. oskab leida ühist keelt erinevalt mõtlevate osapooltega ning suhtuda sallivalt hoiakute ja väärtuste mitmekesisusse 7. julgeb väljendada ja kaitsta oma seisukohti 8. omab ülevaadet Eestis keskkonnakommunikatsiooniga tegelevatest asutustest/inimestest ning teab, kellelt vajadusel abi küsida"}