{"KURSUSE_NIMI": "Geoloogiline komplekspraktikum ja pinnakatte kaardistamine", "KURSUSE_KOOD": "LTOM.03.031", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Maateaduste alused I", "Maateaduste alused I välipraktikum"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 26, "individual_work": 0, "internship": 78}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktika käigus kirjeldatakse ja kaardistatakse Eesti ala iseloomulike geoloogiliste objektide ülikoolivälises töökeskkonnas erialaspetsialistide juhendamisel. Omandatakse praktilised oskused geoloogiliste välitööde meetodite osas nagu paljandite ja puursüdamike kirjeldamine, käsipuurimine. Õpitakse geoloogilise kaardistamise põhimõtteid ja proovimist. Rühmatööna leitakse lahendusi erinevatele reaalsetele erialalistele kompleks lähteülesannetele, koostatakse suuremõõtkavaline geoloogiline kaart uuritava piirkonna kohta ja esitatakse praktika aruanne. Praktka toimub Eesti Geoloogiateenistuse pinnakatte geoloogilise kaardistamise raames ning praktikakorraldust reguleeritakse vajadusel kahe- või kolmepoolsete lepingutega, mis sõlmitakse enne praktika toimumist ülikooli ning praktikapartneri (nt Eesti Geoloogiateenistus) vahel.Objectives/eesmärkid:  Aine eesmärk on anda sissejuhatus ja praktiline kogemus reaalses töökeskkonnas geoloogilistesse välitöömeetoditesse väljaspool ülikooli. Üliõpilased saavad praktilise kogemus põhilistest geoloogilise välitöö meetoditest nagu proovivõtmine, geoloogiline kaardistamine, kivimkehade ja paljandite kirjeldamine ning erialased oskused tegutsemiseks välitöö geoloogina, geoloogilise andmestiku koguja ja interpreteerijana. Aine annab erialased oskused välitöödel kvaliteetseima lahenduse leidmiseks ning etteantud erialspetsiifiliste ülesanne lahendamiseks.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Tudeng:\n1) tunneb peamisi geoloogiliste läbilõigete sh puursüdamike kirjeldamise reegleid ja meetodeid\n2) tunneb geoloogiliste läbilõigete litoloogilise rööbistamise meetodeid\n3) omandab praktilised oskused pinnakatte setete ja puursüdamike kirjeldamiseks ja geoloogiliKursuse läbinu\n1) tunneb peamisi geoloogiliste läbilõigete sh puursüdamike kirjeldamise reegleid ja meetodeid\n2) tunneb geoloogiliste läbilõigete litoloogilise rööbistamise meetodeid\n3) omandab praktilised oskused pinnakatte setete ja puursüdamike kirjeldamiseks ja geoloogiliste profiilide joonistamiseks\n4) omab töökogemust erialal ja oskab seda analüüsida ja mõtestada\nste profiilide joonistamiseks"}