{"KURSUSE_NIMI": "Looduse tundmise välipraktika", "KURSUSE_KOOD": "LTOM.05.019", "EAP": 4, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 20, "individual_work": 0, "internship": 84}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Välipraktikumis tehakse praktilisi töid Eesti looduse mitmekesisuse tundma õppimiseks: määratakse selgroogsete loomade (kalad, kahepaiksed, roomajad, linnud ning imetajad) liike ja tegevusjälgi. Määratakse selgrootute tähtsamaid rühmi (ussid, limused, lülijalgsed) ning õpitakse nende kogude koostamist. Herbariseeritakse ja määratakse taimi ja samblikke ning õpitakse tundma tähtsaamid seeneliike. Õpitakse eristama tähtsamaid looduslikke kooslusi ning tehakse kindlaks ökoloogilisi seoseid tähtsamates kooslustes. Oskab kriitiliselt analüüsida organismide ja koosluste sarnasusi ja erinevusi ning oskab näha nende bioloogilisi põhjuseid. Tunneb bioloogi elutse iseaürasusi väitingimustes ning on teadlik bioloogiaga seotud elukutsetest.Objectives/eesmärkid:  Õppeaine eesmärk süvendada gümnaasiumi õpetajate teadmisi ja oskusi seminaride ja praktikumide läbi viimiseks välitingimustes looduse tundmaõppimiseks. Õppeaines keskendutakse eelkõige põhikooli ja gümnaasiumi astme bioloogia ainekavaga seotud loodusobjektidele: selgroogsed, selgrootud, algloomad, taimed, samblad, vetikad, seened, ja samblikud. Lisaks tutvustakse tähtsamaid Eesti ökoloogilisi kooslusi (metsad, niidud ja sood) ning nendele iseloomulikke tunnuseid. Üldoskustest arendatakse kriitilist ja analüütilist mõtlemist, et  võrrelda organisme ja tuua välja nende erinevuse põhjuseid, Tutvustatakse bioloogiaga seotud elukutseid välitingimustes, et populariseerida seda eriala tulevase võimaliku elukutsena.Learning outcomes/õpiväljund:  1) tunneb põhikooli ja gümnaasiumi bioloogiakursustes käsitletavaid tähtsamaid taime, seene- ja loomaliike;\n2) oskab kasutada dihhotoomseid ja virtuaalseid määrajaid;\n3) oskab kasutada peamisi metoodikaid eluslooduse objektide uurimiseks;\n4) tunneb ära ja oskab iseloomustada tähtsamaid ökosüsteeme;\n5) mõistab loodusliku mitmekesisuse seotust ökosüsteemide jätkusuutlikkuse seisukohast lähtudes;\n6) oskab võrdlevalt analüüsida bioloogiliste organismide erinevusi ja tuua välja nende põhjuseid;\n7) tunneb bioloogilisi töömeetodeid välitingimustes ning on teadlik bioloogiaga seotud erialadest tulevase elukutsena."}