{"KURSUSE_NIMI": "Planeerimise projekt", "KURSUSE_KOOD": "LTOM.02.010", "EAP": 15, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 10, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 318, "individual_work": 14, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tudengid tutvuvad erinevate planeerimisteooriate ja meetoditega ning rakendavad neid teadmisi planeerimisprojektis grupitööna. Oluline osa grupitööst on õppida tegema koostööd ja osalema kommunikatsiooniprotsessis planeeringute koostamisel. Iga rühma planeerimisprojekti üldine teema on paika pandud õppejõudude poolt. Kursuse käigus tehakse välitöid ja toimub planeeringulahenduse avaliku arutelu simulatsioon, lõpus kaitstakse välja töötatud planeeringulahendust. Kursus on jaotatud kolme etappi (ruumilise planeerimise teoreetiline kontekst, analüüs, planeeringulahenduse ja -kaardi koostamine), mida annavad erinevad õppejõud. Statisilise analüüsi tulemusi õpitakse kasutama planeeringulahenduse põhjendusena.\n1. Planeerimise olemus Lääne maailma kontekstis.\nEsimeses etapis omandavad tudengid teadmisi planeerimise olemusest ja aktuaalsematest ruumilise planeerimise teemadest (nt jätkusuutlikkus, mobiilsus jm). Lisaks tutvutakse uurimisaluse piirkonna oluliste teemade, regulatsioonide ja planeeringutega. Töö käigus leitakse sobivad teoreetilised lähtekohad planeerimisprojekti lahendamiseks. Esimese etapi lõpuks sõnastatakse iga grupi/töörühma planeerimisprojekti peaeesmärk ja lähteülesanne.\n2. Statistiline analüüs.\nTeises etapis teostab iga grupp kvantitatiivse analüüsi, mis lähtub etteantud planeeringuprojekti teemast. Selleks kasutatakse statistilisi andmeanalüüsi meetodeid. Eesmärgiks on läbi viia empiiriline andmeanalüüs, et selle tulemusi rakendada planeerimisülesandes. Teise etapi lõpus esitavad tudengid enda analüüsi tulemusi.\n3. Planeeringulahenduse koostamine\nKolmandas etapis töötatakse välja planeeringulahendused ja poliitikasoovitused põhinedes planeerimisprojekti lähteülesandele ja teostatud analüüsile. Koostatakse planeeringukaart koos seletuskirjaga.\n\nNB! Eelnev kogemus GIS tarkvaraga (QGiS või ArcGIS) on vajalik.Objectives/eesmärkid:  Kursuse eesmärk on anda teadmisi, kuidas kasutada ruumiandmeid ja analüüsi ruumilisel planeerimisel. Kursuse käigus saadakse praktiline kogemus planeeringu koostamise protsessist ja valmib planeeringulahendus.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1) tunneb kaasaegse planeerimisteooria põhiseisukohti ja oskab neid analüüsida erinevatest kultuurikontekstidest lähtuvalt; 2) oskab kasutada erinevaid andmeallikaid sotsiaal-ruumiliste protsesside analüüsimiseks ja planeeringute koostamiseks; 3) omab ülevaadet põhilistest planeerimises rakendavatest kvantitatiivsetest ja kvalitatiivsetest meetoditest; 4) on omandanud teadusteksti kirjutamise oskused; 5) oskab valida ja rakendada planeeringute koostamiseks sobivaid GISi ja visualiseerimise vahendeid; 6) oskab välja töötada üldisema planeeringu lahendusi (seletuskirja ja kaarte) tuginedes analüüsile; 7) oskab koostada planeerimisdokumente ja planeeringukaarte; 8) saab aru kaasava planeerimise kontseptsioonist ja oskab valida sobivad kaasamismeetodid;  9) on omandanud oskused avaliku arutelu läbiviimiseks ja planeeringulahenduse avalikuks tutvustamiseks; 10) on kaasalöönud rahvusvahelise liikmeskonnaga grupitöös. Students who enrol to this course have to have previous experience with GIS softwares and making maps."}