{"KURSUSE_NIMI": "Ruumiandmed veebis", "KURSUSE_KOOD": "LTOM.02.071", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 28, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antakse ülevaade peamistest kontseptsioonidest ruumiandmete veebis esitamiseks, hõlmates nii ruumiandmete geoportaale, standardeid ja veebiteenuseid. Õpitakse kasutama veebiteenuseid töölaua GIS-keskkondades ja keskendutakse OGC standardite praktilisele rakendamisele.\nVarasem programmeerimiskogemus ei ole kohustuslik, kuid on soovitatav. Ilma eelneva koodikirjutamise kogemuseta tudengid peavad olema valmis pühendama märkimisväärselt lisatööd ülesannete täitmiseks ning soovitatavalt tutvuma Pythoni/programmeerimise põhialustega enne kursuse algust (lisainfo: alexander.kmoch@ut.ee). Ideaalis tuleks see kursus läbida koos kursusega LTOM.02.041.\nKursus annab oskuse ruumiandmete metaandmete haldamiseks, hõlmates kataloogiteenuseid ja metaandmete loomist rahvusvaheliste standardite alusel. Õpitakse kasutama GeoServerit ruumiandmete veebis avaldamiseks, kasutades WMS-funktsionaalsust ja kaartide kujundamist SLD-stiilide abil. Lisaks õpitakse andmemodelleerimise kontseptsioone, sealhulgas GML-i ja UML-i, rõhutades INSPIRE-ühilduvust ja XML-skeeme. Praktikumides õpitakse kontseptsioone rakendada rakendada WFS-teenust koos kohandatud GML-skeemiga.\nÕpitakse veebitehnoloogiate (HTML, CSS, JavaScript) aluseid, et seda hiljem kasutada andmete esitamiseks veebis. Praktiliste sessioonide käigus WMS, GeoJSON, REST API-d. Kursus lõpeb pilvepõhiste ruumiandmete kontseptsioonide tundma õppimisega: STAC (SpatioTemporal Asset Catalogs), kaasaegsete andmete otsingu- ja juurdepääsuvõimalustega ning serveripoolse WebGIS-i rakendamisega pygeoapi abil.\nOluline osa kursusest on veebikaardi loomise projekt, kus tudengid rakendavad oma kursuses omandatud teadmisi tervikliku veebipõhise ruumiandmete rakenduse arendamisel. Kursuse vältel pannakse rõhku arusaamisele traditsioonilistest ruumiandmete infrastruktuurist üleminekule kaasaegsete pilvepõhiste lähenemisteni, valmistades tudengeid ette nii olemasolevate kui uute ruumiandmete veebitehnoloogiate kasutamiseksObjectives/eesmärkid:  Anda põhjalik sissejuhatus kaasaegsetesse tehnoloogiatesse ruumiandmete hoidmiseks, esitamiseks ja leidmiseks veebis.  Tehnoloogiad hõlmavad traditsioonilisi ruumiandmete infrastruktuure (SDI, Spatial Data Infrastructure) kuni tänapäevaste veebikaardistamise ja pilvepõhiste ruumiandmete lahendusteni.  Arendada teoreetilist arusaama ja praktilisi oskusi veebipõhises ruumiandmete halduses, standardiseerimises, juurdepääsus, jagamises, visualiseerimises ja töötlemises. Anda ülevaade üleminekust traditsioonilistest ruumiandmete infrastruktuurist kaasaegsesse ruumiandmete ökosüsteemi.Learning outcomes/õpiväljund:  *\tDemonstreerib veebipõhiste ruumiandmete kontseptsioonide ja tehnoloogiate käsitlemise oskusi. Nad mõistavad ja rakendavad OGC (Open Geospatial Consortium)  veebiteenuseid ja standardeid ning pilvepõhiseid ruumiandmete tehnoloogiaid kaardistamiseks, visualiseerimiseks, andmekogumite avastamiseks ja jagamiseks. *\tOskab ruumiandmete metaandmeid hallata *\tTeab, milliseid tehnoloogiaid ja teenuseid kasutada erinevate juhtumite puhul nt ruumiandmete kuvamine veebis vs vektorandmete analüüs veebis  *\tOmab praktilisi oskusi nii ruumiandmete veebiteenuste tarbimisel kui ka pakkumisel ning oskab luua veebipõhiseid kaardirakendusi, mõistes samal ajal nende tehnoloogiate aluseks olevaid teoreetilisi raamistikke."}