{"KURSUSE_NIMI": "Juhendaja seminar", "KURSUSE_KOOD": "LTOM.00.002", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 36, "individual_work": 37, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Juhendaja suunamisel osaleb üliõpilane erialaga seonduvatel seminaridel, lisaks õpib üliõpilane andmebaasidest teaduslikku infot otsima, seda läbi töötama ning õigesti interpreteerima. \nÜliõpilane teeb loetud teaduskirjanduse põhjal suulise ettekande (andes sealhulgas loetule ka omapoolse hinnangu, vajadusel toob välja probleeme valmistanud kohad). \nJuhendaja ja õppetooli juht lepivad kokku kus, millal ja millise publiku ees ettekanne toimub (soovitavalt võiks ettekanne toimuda õppetooli seminaridel). Ettekande keel on eesti keel, põhjendatud juhtudel ka inglise keel (sellised erandid lepitakse kokku juhendaja ja õppetooli juhi vahel). \nÜliõpilane tutvub võimaluse korral ka teiste töörühma liikmete uurimisteemadega ja/või osaleb väiksemahulistes labori- või välitöödel eriala teadusmetoodikaga tutvumiseks.Objectives/eesmärkid:  Seminari eesmärk on tutvustada üliõpilastele aktuaalseid erialaga seonduvaid teadusteemasid ning arendada teadusliku teksti läbitöötamise oskusi. Õpitakse kasutama erinevaid andmebaase teaduskirjanduse leidmiseks ja infot õigesti interpreteerima. Arendatakse üliõpilaste ettekande tegemise ja suulise eneseväljenduse oskusi.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: - orienteerub üldjoontes oma erialaga seonduvates aktuaalsetes teemades; - oskab teadusandmebaasidest infot otsida; - eristab teadusartikli olulisemat sisu vähemolulisest; - väljendab ennast arusaadavalt eesti või inglise keeles nii kõnes kui kirjas, sh oskab ettekandeid teha; - suhtleb oma töörühmaliikmetega sh. võtab osa aruteludest ja praktilisest meeskonnatööst; - reflekteerib kursuse jooksul õpitut nii suulises kui kirjalikus vormis; - saab aru oma tugevustest ja nõrkustest ning oskab kujundada oma õpimotivatsiooni ja paremini planeerida bakalaureusetöö kirjutamist."}