{"KURSUSE_NIMI": "Teadusandmete haldus ja publitseerimine", "KURSUSE_KOOD": "LTOM.00.007", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Avatud teadus, avatud juurdepääs, teaduse avaandmed ja FAIR andmed\nTeadusandmete elutsükkel \nAndmehaldusplaan ja selle praktiline koostamine\nAndmerepositooriumid, avaandmete otsing\nAndmete haldamine PlutoF platvormil\nAndmete publitseerimine ja arhiveerimine\n\nKursuse teises osas keskendutakse praktilisele andmete haldamisele ja avaldamisele PlutoF platvormil (https://plutof.ut.ee). PlutoF on andmehaldussüsteem, mis on suunatud bioloogilistele andmetele ja hobiteadlaste loodud andmetele. Palun kontrollige, kas see kursuse osa on teile kasulik. Näiteks on teil juba andmeid bioloogilise mitmekesisuse kohta või soovite neid koguda kursuse jooksul. Samuti on teretulnud lihtsad linnuvaatlused. Seejärel logige sisse. Samuti on oluline mõista, et kursuse mõlemas osas saab osaleda eraldi. Lisaküsimuste korral pöörduge õppejõudude poole.Objectives/eesmärkid:  1. osa: Avatud teaduse mõistmine, avatud juurdepääs teaduspublikatsioonidele, teadusandmete haldamine läbi kogu teadusandmete elutsükli, andmehaldusplaani koostamine ja selle järgimine, avatud teadusandmete otsing ja kasutamine.  2. osa:  Doktorandi oma teadusandmed on avaldatud PlutoF platvormil, nendele on omistatud DOI, mis võimaldab andmete tsiteerimist Web of Science Data Citation Index'isLearning outcomes/õpiväljund:  Kursuse läbinud üliõpilane *\tteab, mis on avatud teadus ja avatud juurdepääs teaduspublikatsioonidele *\tomab teadmisi teaduse avaandmetest ja FAIR andmetest *\toskab oma andmeid hallata, publitseerida ja arhiveerida; *\ton võimeline leidma teadusandmeid kogu maailma andmerepositooriumidest, neid mõistma ning vajadusel taaskasutama ja tsiteerima; *\tteab, kuidas koostada andmehaldusplaani; *\toskab publitseerida ja hallata andmeid PlutoF platvormil. Second part of the course will focus on practical data management and publishing using PlutoF platform (https://plutof.ut.ee). PlutoF is a data management system which targets biological data and data generated by Citizen Scientists. Please check if this part of the course is useful for you. For example you have already biodiversity data or willing to gather such data during the course. Simple bird observations are welcome too. Then sign in. It is also important to understand that both parts of the course can be attended separately. If you have additional questions please contact teachers.\nAll course materials are in Estonian and in English, doctoral students can choose the communication language. This is an e-learning course; individual feedback is provided by tutors. Contact seminars and individual consultations can be held if necessary."}