{"KURSUSE_NIMI": "Loomuuringute eetika", "KURSUSE_KOOD": "LTOM.04.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 3, "colloquium": 0, "web_learning": 0, "independent_work": 75, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loomuuringute eetika on loodus- ja meditsiiniteaduste üheks nurgakiviks ja ilma sellealaste teadmisteta jääb ülikoolist saadav haridus selgelt poolikuks. Loomuuringute eetika on üks neist kriitilistest teemadest, mis on muutumas järjest aktuaalsemaks ja millega pea iga loodus- või meditsiiniuuringutega tegelev inimene oma erialases töös varem või hiljem kokku puutub. Loomade uurimise meetodite suhtes on erinevaid eetilisi seisukohti, kuid üldjuhul neist ei räägita. Seetõttu puudub üliõpilasel võimalus kaalutletud otsuseks, kas kasutada loomuuringutel meetodeid, mis eeldavad loomade tapmist (paraku üsna levinud praktika) või valida hoopis sellised meetodid, mis loomade tapmist ei nõua. Tegemist väga põhimõttelise otsusega, mis nõuab vastava temaatika head tundmist. Kuna üliõpilasel tuleb juba stuudiumi varases staadiumis teha oma valik, millise töörühmaga liituda ja milline uurimisteema valida, siis oleks hea, kui iga loodus- ja meditsiiniteaduste üliõpilane  omandaks võimalikult varakult vajalikud teadmised loomuuringute eetikast. Kursuse käigus tutvustatakse loomuuringute eetika sõlmprobleeme ja erinevaid meetodeid, mis võimaldavad loomuuringuid läbi viia ilma loomi tapmata - selliste meetodite hulk on viimastel aastatel oluliselt kasvanud ja nendega on võimalik asendada paljusid vanu meetodeid, mis on oma nii teaduslikust kui eetilisest seisukohast ära elanud. Kursusel omandatud teadmiste põhjal saab iga üliõpilane kujundada oma seisukoha ning vastavalt sellele teha oma valikud, milline uurimisteema ja meetodid valida. \nLoomuuringute eetika kursus annab vajalikud baasteadmised, mille põhjal üliõpilane saab teha kaalutletud otsuse, mis pikas perspektiivis on igaühe jaoks äärmiselt oluline. \nKursuse temaatika on põnev, praktiline ja arendav. Ja seda mitte ainult erialast haridust silmas pidades, vaid ka igaühe üldist vaimset arenguteed.Objectives/eesmärkid:  Loengud annavad ülevaate erinevatest seisukohtadest ja probleemidest loomuuringute eetika vallas. Tutvustatakse ka uuemaid mitte-letaalseid loomuuringute meetodeid ning käsitletakse Eesti ja Euroopa Liidu kehtivat seadusandlust. Seminarides toimuvad referaatide kuulamised ja arutelud, kus vaagitakse loomuuringutega seotud eri lähenemiste poolt- ja vastuargumente. Kursus sobib väga hästi ka arstiteaduskonna tudengitele, kuna muude oluliste teemade hulgas käsitletakse ka biomeditsiini valdkonna loomuuringute probleeme ning tuuakse näiteid alternatiivsetest meetoditest, millele üleminek näib olevat vältimatu, kui soovime võimalikult efektiivselt ja ohutult inimeste tervise kaitseks uusi ravimeetodeid välja töötadaLearning outcomes/õpiväljund:  Loengukursuse läbinud üliõpilane: 1) omandab loomuuringute eetika vajalikud baasteadmised; 2) teab erinevaid meetodeid, mis võimaldavad loomuuringuid läbi viia kas ilma loomi surmamata, kasutades alternatiivseid lähenemisi; 3) kujundab oma arvamuse loomuuringutel kasutatavate meetodite suhtes, oskab kriitiliselt hinnata erinevaid meetodeid ning on avatud uutele lähenemistele  \n . Õpe toimub valdavalt iseseisva tööna. Auditoorse õppena toimuvad vaid seminarid, milles kursusel osalejad teevad ettekande referaadi põhjal ja kus toimub arutelu. Kui epidemioloogiline olukord seminariks kokkusaamist ei võimalda, siis toimuvad seminaris interneti vahendusel. Seminaride arv sõltub kursusele registreerunute arvust. \nÕpe algab kohe semestri alguses. Kogu vajamineva info leiad kursuse Moodle lehelt. \n--------------------------------\nÜldine kursuse läbimise skeem on järgmine:\n1) Essee kirjutamine (2-3 lk)\n2) Panopto videoloengute 1-6 põhjal õppimine, millele järgneb kontrolltöö\n3) Referaadi kirjutamine (4-5 lk) ja seminaris selle põhjal ettekande tegemine\n4) Panopto videoloengute 7-9 põhjal õppimine\n5) Eksam"}