{"KURSUSE_NIMI": "Geoloogiline kaardistamine ning regionaal- ja struktuurigeoloogiline välipraktika", "KURSUSE_KOOD": "LTOM.03.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 65, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 91, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Välikursus toimub mõnes Eestist geoloogiliselt erinevas piirkonnas (viimasel kolmel aastal on läbivioimise paigaks olnud Tšehhi Vabariik). Kursuse käigus õpitakse tundma geoloogilise kaardistamise metoodikat komplitseeritud struktuuridega aladel. Tutvutakse vulkaaniliste, intrusiivsete ja moondekivimite lasumusvormidega, õpitakse kaardistama kurd- ja murrangstruktuure.Objectives/eesmärkid:  \"Aine eesmärgiks on:\n1) omandada geoloogilise kaardistamise välitöö oskused.\n2) valmistada üliõpilasi ette töötamiseks Läänemere regiooni spetisiifiliselt lihtsatest geoloogilistest  tingimustest erinevas, tektooniliselt ja struktuurselt keerulises geoloogilises situatsioonis. Selle tagamiseks on vajalik praktiline kokkupuude ja kogemus Eesti geoloogilises ehituses puuduvate geoloogiliste nähtuste, kivimite ja setete ning tektooniliste a struktuuridega, käsitletuna regionaalgeoloogilises ja geokronoloogilises kontekstis. Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Tudeng peab:\n1) tundma põhilisi geoloogilise kaardistamise välitöö võtteid\n2) oskama kirjeldada geoloogilisi läbilõikeid\n3) oskama koostada geoloogilisi kaarte, lähtudes kogutud kaardistamise andmetest\n4) oskama mõtestada regionaalseid geostruktuure ja nende arengulugu laamtektoonilises ja stratigraafilis-geokronoloogilises kontekstis.\n5) tundma tektooniliselt komplitseeritud piirkondadele iseloomulike geoloogiliste nähtuste ilminguid ja erinevaid avaldumisvorme ning nende dokumenteerimise  tüüpvõtteid\n6) tundma sette-, magma ja moondekivimite tektooniliselt mõjutatud lasumisvorme, struktuure ja tekstuure ning metamorfismiga seotud muutusi\n7) oskama seostada regionaalse geoloogia iseärasusi piirkondlike maavarailmingutega ning mõistma regionaalset keskkonnageoloogilist konteksti."}