{"KURSUSE_NIMI": "Ruumiandmete analüüs Pythoni ja R-iga", "KURSUSE_KOOD": "LTOM.02.041", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 54, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 102, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tutvustab Python- ja R-skriptimiskeskkondadega töötamise põhimõtteid, oskusi ja tööriistu. Kursus on jagatud kahte ossa: esimeses keskendutakse Pythonile ja teises R-ile.\nVarasem programmeerimiskogemus ei ole kohustuslik, kuid on väga soovitatav (eriti Pythonis). Ilma varasema koodikirjutamise kogemuseta tudengid peavad olema valmis panustama ülesannete täitmiseks märkimisväärselt lisatööd ning soovitatavalt tutvuma Pythoni põhialustega juba enne kursuse algust. Kui teil pole üldse varasemat koodikirjutamise kogemust, siis palun kontakteeruge enne kursust Alexander Kmochiga ( alexander.kmoch@ut.ee), kes saab soovitada materjale.\nPythoni osa algab keskkonna seadistamisega kasutades conda/mamba tööriistu, liikudes edasi keerukamate ruumiandmestruktuuride ja operatsioonidega shapely ja geopandas teekide abil. Tudengid õpivad töötama koordinaatsüsteemide ja transformeerimisega, ruumipäringute ja ümberklassifitseerimise meetoditega. Kursus jätkub keerukamate ruumianalüüsi meetoditega, sealhulgas punktimustrite ja  LiDAR-andmete töötlemine.\nLisaks pannakse rõhku rasterandmete käsitlemisele kasutades rasterio ja xarray teeke, ning ruumiandmete staatilisele visualiseerimisele matplotlibi abil ning interaktiivsele kaardistamisele foliumiga. Pythoni osa sisaldab ka lihtsamat geograafilist modelleerimist masinõppe (otsustusmets)  abil.\nR-i osa algab RStudio keskkonna installeerimise ja seadistamisega ning pakettide haldamise tutvustamisega. Kursus tutvustab R-i ruumianalüüsi ökosüsteemi, keskendudes vektorandmete töötlemisele ja kaardi kujundamise tööriistadele. Kursus hõlmab rasterandmete analüüsi ja ruumilist interpoleerimist. Erilist tähelepanu pööratakse mobiilsusanalüüsile, näidates R-i võimalusi GPS- ja mobiilsusandmete töötlemisel ja analüüsil.\nKogu kursuse vältel juhendatakse tudengeid kasutama versioonihaldust GitHubi abil ning looma analüüsi töövooge vastavalt FAIR põhimõtetele.Objectives/eesmärkid:  Pakkuda põhjalikku sissejuhatust ruumianalüüsi võimalustest kahes juhtivas teadusarvutuse keskkonnas (Python ja R). Anda peamised teoreetilised alused ja praktilised rakendused ruumianalüüsi meetoditest Pythoni ja R-iga, keskendudes töövoogudele automatiseerimisele ja korratavusele. Õpetada skriptimisoskuseid, et luua keerukaid automatiseeritud ruumianalüüsi töövooge, mis võimaldavad tõhusalt analüüsida väga suuri andmekogumeid ning muuta oma töö korratavaks.Learning outcomes/õpiväljund:  *\tTunneb Pythoni ja R-i skriptimiskeskkondade põhikontseptsioone ja tööriistu. *\tOskab kriitiliselt hinnata ja valida sobivaid meetodeid ning Pythoni ja R-i teeke teaduslikuks ja  rakenduslikuks ruumianalüüsiks. *\tOskab lahendada levinud ruumiandmetega seotud ülesandeid kasutades Pythonit ja R-i. *\tDemonstreerib pädevust korratavate ruumianalüüsi töövoogude väljatöötamises vastavalt FAIR põhimõtetele (leitavus, juurdepääsetavus, koostalitlusvõime ja taaskasutatavus) ning suudab luua selget dokumentatsiooni töövoogudest Pythoni ja R-i skriptimiskeskkondades."}