{"KURSUSE_NIMI": "Ökotehnoloogia rakendused", "KURSUSE_KOOD": "LTOM.02.072", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 4, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ökotehnoloogia (Ecotechnology, Ecological engineering) on selliste jätkusuutlike ökosüsteemide rajamine ja kujundamine, mis integreerivad inimühiskonda loodusega selliselt, et sellest on kasu mõlemale. \nKursuse ülesanne on anda ülevaade erinevatest ökotehnoloogiatest: põhiprintsiibid; ökoloogilise arhitektuuri, ehituse ning materjalide ja tehnoloogiate hindamise üldpõhimõtted \n(nt olelustsükli hindamine, säästlike ehitiste kavandamine, säästvad ehitusmaterjalid, looduslikud värvid, ehitistes energia-säästmise tehnoloogiad, ehitiste passiivne energia, passiivmajad, sisekliima); \nsäästvad veemajandus- ja puhastustehnoloogiad (nt rohelised infrastruktuurid, säästlikud drenaaisüsteemid, tehismärgalad); ökosüsteemide taastamine ja ökotehnoloogiad säästvas põllumajanduses.\nKursuse osana peavad tudengid kirjutama ja esitama teadustöödel põhineva aruande.Objectives/eesmärkid:  Käesoleva ainekursuse eesmärgiks on anda ülevaade ökotehnoloogiliste põhimõtete rakendamisest erinevates valdkondades. Kursus koosneb loengutest ja seminaridest.Learning outcomes/õpiväljund:  Üliõpilane: *\tTeab ökotehnoloogia põhiprintsiipe ja mõisteid. *\tEristab ja oskab kirjeldada ökotehnoloogilisi lahendusi reoveepuhastuses; sademeveekäitluses; energiatõhusas ehituses ja ehitusmaterjalides; hoone energiavajaduses ja -tõhususes; ökosüsteemide taastamises ning ökoloogilises põllumajanduses. *\tHindab tähtsust ja oskab rakendada keskkonnaprobleemide ennetamiseks ja lahendamiseks vajalikke ökotehnoloogilisi lahendusi ja meetmeid.  *\tAnalüüsib iseseisvalt ühe etteantud ökotehnoloogia valdkonna teadustöö tulemusi ja järeldusi ning koostab rühmatöö vormis läbi töötatud teadustööde põhjal raporti."}