{"KURSUSE_NIMI": "Liikuvusanalüüs planeerimises", "KURSUSE_KOOD": "LTOM.02.063", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Transpordigeograafia"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate liikuvuse ja transpordiplaneerimise olulisematest teemadest: ruumiline planeerimine versus transpordiplaneerimine, transpordigeograafia ja modelleerimine, liikuvus ja kättesaadavus jt. Antakse ülevaade säästlikest liikumisviisidest ja inimmõõtmemise linnaruumi planeerimisest. Liikuvuse ja transpordiplaneerimist käsitletakse seoses füüsilise ja sotsiaalse keskkonnaga ning hinnatakse mõjusid keskkonna ja inimese tervisele ning ebavõrdsusele.  \nKursuse käigus analüüsitakse liikuvusuuringuid, planeeringuid ja strateegiaid ning koostatakse rühmatööna liikuvusuuring ja liikuvuslahenduse plaan.Objectives/eesmärkid:  Kursuse eesmärk on omandada teadmisi liikuvuse ja transpordiplaneerimise olulisematest teemadest. Kursuse käigus arendatakse praktilisi oskuseid ruumiplaneeringute ja transpordipoliitika dokumentide analüüsi, liikumisandmete analüüsi ning liikuvuslahenduse plaani koostamise käigus.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:  - tunneb liikuvuse ja transpordiplaneerimise põhimõtteid nii kohalikul kui regionaalsel tasandil;  - mõistab kättesaadavuse, liikuvuse ja transpordi mõisteid, analüüsimeetodeid ja rolli ruumilises planeerimises;   - teab säästva liikuvuse ja inimmõõtmelise linnaruumi planeerimise põhimõtteid ja oskab neid rakendada konkreetses kontekstis;  - oskab seostada liikuvuse planeerimist keskkonnaseisundi, inimeste tervise ja heaolu ning sotsiaalse ebavõrdsuse küsimustega;  - oskab töötada planeerimisdokumentidega, on omandanud oskused liikuvuse planeeringute analüüsimisel ja koostamisel."}