{"KURSUSE_NIMI": "Selgrootute zooloogia välipraktikum", "KURSUSE_KOOD": "LTOM.04.010", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Selgrootute zooloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 42, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 10, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Välipraktikum süvendab ja laiendab loengutel ja praktikumides omandatud teadmisi selgrootutest loomadest otsese kontakti abil looduses ning tutvustab nende uurimise meetodeid. Seitsme päeva jooksul kogutakse peamiselt rühmatööna loodusest selgrootuid, omandatakse enam kasutatavad püügi- ja prepareerimistehnikad ning tutvustatakse loodusvaatlusandmebaaside kasutamist, peetakse ettekandeid liigirikkamatest putuka- ja limusterühmadest, koostatakse putukate ja limustekollektsioonid ning kollektsioonimäärajad ja testitakse omandatud teadmisi putukaseltside määramise võistlusel, viktoriinil ning arvestusel. Motivatsiooni suurendamiseks toimub kogu välipraktikum rühmatööna võistlusformaadis.Objectives/eesmärkid:  Välipraktika süvendab ja laiendab loengutes ja praktikumides omandatud teadmisi selgrootutest loomadest ning loob oskused selgrootute kogumiseks, prepareerimiseks ja määramiseks ning leiuandmete avaldamiseks. Täpsemalt on välipraktikumi eesmärkideks putukate suurrühmade (seltside) tundmaõppimine, putuka- ja limusteliikide määrama õppimine ja tavalisemate liikide tundmaõppimine, levinumate püügi- ja prepareerimismeetodite omandamine ning loodusvaatluste andmebaaside kasutama õppimine.Learning outcomes/õpiväljund:  a) Eestis esindatud putukaseltside morfoloogiliste ja ökoloogiliste eripärade tundmaõppimine: pärast praktikumi peaksid kursusel osalejad suutma määrata valdavat enamikku Eestis elavatest putukatest seltsini  ning omama ülevaadet seltside ökoloogiast; b) Eestis elavate putukaliikide ja (maismaa)teoliikide määrama õppimine ja (enda kollektsiooni näitel) ka mõnekümne liigi olulisemate eristustunnuste ja ökoloogia tundmaõppimine; c) Tavalisemate putukate püügimeetodite (võrgupüük, kahapüük) praktiline omandamine, putukate kogumis- ja prepareerimistehnikate ning putukakogu koostamise põhimõtete tundmaõppimine; d) Loodusvaatluste andmebaaside kasutamise ning andmete sisestamise tundmaõppimine PlutoF veebitöölaua (https://plutof.ut.ee/) näitel Kiri täpsema infoga saadetakse ning osalejate liitmine kursuse Moodle'iga toimub kevadsemestri alguses. Soovitame võimalusel juba enne seda ette võtta puukentsefaliidi vastane (esimene) vaktsineerimine (https://vaktsineeriapteegis.ee/puukentsefaliit) \n\nEnamik praktikumis tehtavatest töödest toimub 4-liikmelistes rühmades. Praktikumi jooksul korraldatakse mitmeid selgrootute kogumise ja määramisega ning nendega seotud informatsiooni kogumise ja ettekandmisega seotud võistlusi/vahearvestusi. Kokkuvõttes parima rühma liikmetele loetakse arvestus sooritatuks, teistel tuleb viimasel päeval sooritada (suuline) üldarvestus."}