{"KURSUSE_NIMI": "Andmebaasid geoloogias", "KURSUSE_KOOD": "LTOM.03.038", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Geoinformaatika"], "SOOVITUSLIKUD_EELDUSAINED": ["Geoloogiline 3D modelleerimine"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 24, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 48, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb kahest loengust ja praktikumidest. Kursust alustatakse loodusteaduse valdkonnas välitööde ja andmebaasidest kogutavate andmete ühtlustamise metoodikate tutvustamisega, antakse ülevaade heast andmete hoiustamise praktikast. Edasi liigutakse praktikumides Exceli kasutamise juurde, mille käigus õpitakse muuhulgas kasutama erinevate andmetabelite põhjal Pivot tabeleid ja graafikuid. Peale seda tehakse tutvust andmebaaside (SQL) teooriaga, peale mida omandatakse praktikumide käigus praktilised oskused nagu tabelite loomine, andmete andmebaasi importimine, SQL- päringute tegemine ja Postgres-i andmebaasis ruumiandmete haldamine. Lisaks tehakse tutvust tehisintellekti (ChatGPT) võimaluste kasutamisega andmebaasi struktuuri ja päringute koostamiseks, õpitakse hindama tehisintellekti poolt tehtud soovituste ja koostatud päringute korrektsust ning usaldusväärsust. Praktilised oskused kinnitatakse praktikumide käigus antud ülesannete lahendamise ja lõpuprojektina koostatud oma andmebaasi loomise käigus.Objectives/eesmärkid:  Kursuse üldeesmärk on tutvustada PostgresSQL andmebaasi (ja üldisemalt andmeanalüüsi) printsiipe ja meetodeid teoreetilises ja praktilises aspektis.Learning outcomes/õpiväljund:  Selle kursuse lõpetanu: *\toskab koguda ja hoiustada andmeid selliselt, et need oleks kasutatavad automaatseks töötlemiseks; *\toskab Excel programmis ühendada erinevaid andmetabeleid, luua Pivot tabeleid ja graafikuid; *\ton omandanud relatsiooniliste andmebaaside teooriaga seotud põhimõisteid; *\toskab luua PostgreSQL abil andmebaasi, luua tabeleid ja sisestada andmeid; *\tsuudab mõista ja lugeda teiste poolt arendatud andmebaaside skeeme; *\toskab koostada SQL-päringuid (k.a kasutada funktsioone, ühendada tabeleid ja luua alampäringuid, luua vaateid); *\tomab esmaseid teadmisi PostgreSQL abil ruumiandmete analüüsist; *\toskab kasutada andmebaasi loomiseks ja päringute koostamiseks tehisintellekti (ChatGPT) abi ja valideerida tehisintellekti poolt loodud lahendusi."}