{"KURSUSE_NIMI": "Bioloogia ning elustiku kaitse erialaseminar", "KURSUSE_KOOD": "LTOM.00.001", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aines käsitletakse probleemõppe metoodikal erinevaid õppekavaga seotud töörühmade uurimisvaldkondi ja arutletakse võimalike lahenduste ja tulemuste üle. Tudeng saab teadlikumaks iseenda huvidest ja oma õppimisvõimalustest ning teeb kursuse lõpuks erialavaliku.Objectives/eesmärkid:  Eriala sissejuhatava seminari eesmärgiks on aidata üliõpilasel teha oma eriala valik, pakkuda baasainetes õpitule rakendust ning motiveerida üliõpilasi interdistsiplinaarsete ülesannete lahendamise abil. Eriala valikut toetavad ühelt poolt lahendatavad ülesanded ja teiselt poolt seminarides toimuvad diskussioonid. Kursuse käigus saab tudeng teadlikumaks iseenda huvidest ja oma õppimis- ja karjäärivõimalustest. Seminari käigus arendatakse üldpädevustest meeskonnatöö oskuseid ja eestikeelset väljendusoskust.Learning outcomes/õpiväljund:  Tudeng, kes on läbinud aine: 1. Tunneb probleemõppe metoodikat; 2. Oskab kasutada taustinformatsiooni probleemülesande probleemi lahendamisel; 3. Analüüsib üht õppekava erialavalikut enda huvidest lähtuvalt ja teeb kursuse lõpus erialavaliku; 4. Töötab edukalt rühma koosesisus; 5. Suudab olla tolerantsem erinevate vaadete suhtes; 6. Suudab oma vaateid põhjendada ja kaitsta osaledes demokraatlikus diskussioonis; 7. Oskab õppekavas ära tunda interdistsiplinaarseid seoseid; 8. Orienteerub oma õppekavaga seotud erinevate töörühmade tegemistes, oskab selle alusel valida endale sobilik uurimisteema; on teadlik erinevatest karäärivalikutest; 9. Oskab keskkonnaga seotud probleemide aktuaalsuse põhjal langetada otsuseid tulevaste uuringute/töö vajalikkuses osas; 10. Suudab ette näha, vajadusel ennetada/lahendada väikeses töörühmas tekkivaid erimeelsusi; 11. Oskab planeerida oma aega; 12. Omandab oskused teaduslike ja olmetekstides kriitiliseks analüüsiks; 13. Oskab koostada ja esitleda teadusliku ettekande korrektselt ja arusaadavalt/on teadlik tüüpvigadest;  14. Suudab kriitiliselt analüüsida enda (ja ka teiste) ajaplaneerimist, puudujääke teabe otsimisel ja arengut probleemide lahendamisel. puudub"}