{"KURSUSE_NIMI": "Kestlikud linnapiirkonnad globaalmuutuste tingimustes", "KURSUSE_KOOD": "LTOM.02.066", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursuse raames käsitletakse linnapiirkondade ökoloogilise ja sotsiaalse kestlikkusega seotud tegureid globaalmuutuste kontekstis. Avatakse inimeste rolli linnade sotsio-ökoloogilistele süsteemidele ja elukeskkonna kujunemisele ning käsitletakse elukeskkonna kvaliteedi mõju inimese tervisele ja heaolule. Kursusel lõimitakse linnade kestlikkuse jaoks kriitilised klimaatilised, ökoloogilised, ühiskondlikud, individuaalsed ja tehiskeskkonnaga seotud tegurid ühte raamistikku. Läbivalt käsitletakse võimalikke ruumiloome lahendusi ja sekkumismeetmeid soovitud muutuste ellu kutsumiseks, tutvutakse kestlike linnade mudelitega, erinevate looduspõhiste ja tehnoloogiliste lahendustega, ressursside ringlust tagavate süsteemidega ja tegeletakse tulevikulinnade kontseptsioonidega. Kursust läbib rühmatöö rühmaliikmete poolt valitud näidisprobleemi analüüsimiseks ja sekkumiste planeerimiseks, mille käigus saab kursusel omandatud oskusi jooksvalt rakendada. Objectives/eesmärkid:  Ainekursuse eesmärk on avada linnapiirkondade kestlikkusega seotud probleemistik globaalmuutuste kontekstis, sidudes omavahel linnakeskkonna ökoloogilised, klimatoloogilised, sotsiaalsed, kultuurilised ja individuaalsed tegurid. Kursuse läbiv teema on tiheasustusalade jätkusuutlik planeerimine ja haldamine globaalmuutuste ajastul, mil peab tagama linnastunud piirkondade väljakutsete lahendamise kiirelt muutuvate keskkonnatingimuste ja ühiskondlike protsesside kontekstis. Kursus põimib erinevate teadusvaldkondade kaasaegsed teadustulemused interdistsiplinaarseks lähenemiseks aidates mõista, arvestada ja juhtida tiheasustusaladel 21. sajandil toimuvaid nähtusi. Ainekursuse raames käsitletakse uudseid kestliku linnaplaneerimisega seotud põhimõtteid ja praktikaid, mis arvestavad vajadusega reageerida paindlikult ühiskondlikele protsessidele (sh rändesurvele), tagada keskkonda arvestav säästlik ressursikasutus, kliimamuutuse leevendamine ja sellega kohanemine ning looduse hüvede (sh elurikkuse) soodustamine. Seejuures käsitleb kursus kestliku ruumiloome põhimõtteid, sekkumismeetmete kavandamist ja nende võimaliku mõju kriitilist hindamist.Learning outcomes/õpiväljund:  Ainekursuse läbinud tudeng:  mõistab kestlike linnapiirkondade kontseptsiooni, strateegilist raamistikku, komponente ja eelduseid; tunneb linnade füüsilise ja sotsiaalse keskkonnaga seotud tegureid (näiteks elurikkus, looduse hüved, kliima, saaste, rahvastikurühmade paiknemine, liikumistaristu, teenuste kättesaadavus) ja mõistab nende tegurite kujunemist, muutlikkust ning mõju inimeste tervisele ja heaolule; oskab asetada tiheasustusalade planeerimise ja haldamise globaalmuutuste konteksti ning arvestada muutuvate sotsiaalsete, klimaatiliste ning ökoloogiliste tingimuste mõjuga;  tunneb kestliku ruumiloome põhimõtteid ja oskab planeerida sekkumismeetmeid; oskab planeerimises põimida sotsiaalseid, tehnoloogilisi, ökoloogilisi ja looduspõhiseid lahendusi ning rakendada neid erinevate tiheasustusaladega seotud väljakutsete lahendamises; oskab sekkumiste planeerimisel kriitiliselt hinnata võimalikke kaasuvaid mõjusid ning arvestada ebakindlate kliima- ja rahvastikumuutuste kontekstiga."}