{"KURSUSE_NIMI": "Magistritöö loodusteaduslikus hariduses", "KURSUSE_KOOD": "LTOM.05.021", "EAP": 25, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 650, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Magistritöö koostamisega saadakse ülevaade kvalitatiivsetest ja kvantitatiivsetest uurimismeetoditest ning nende rakendamise spetsiifikast loodusteaduslikus hariduses ja sellega seotud haridustehnoloogias. Ühtlasi omandatakse uuringute planeerimise, läbiviimise ja tulemuste vormistamise ja esitamise oskused ning seostamise võimalused praktilise õpetajatööga. Aines omandatakse oskused teadusartikli koostamiseks.Objectives/eesmärkid:  Kujundada oskused iseseisvalt eristada ja ära tunda lahendamist vajavaid probleeme loodusteadusliku hariduse valdkonna piires ning pakkuda sisuliselt põhjendatud viise nende probleemide lahendamiseks; kujundada nii teadustööks kui erialaseks tegevuseks vajalikud teadusliku eneseväljenduse oskused; arendada oskust koostada teaduspublikatsioone.Learning outcomes/õpiväljund:  Õppeaine läbinu: 1. Omab ülevaadet kvalitatiivse ja kvantitatiivse uurimistöö meetoditest ja eripärast loodusteaduslikus hariduses ning oskab neid rakendada magistritöö koostamisel. 2. Oskab rakendada omandatud teadmisi ja oskusi teadusprobleemide sõnastamisel, uuringute planeerimisel ja läbiviimisel, kogutud andmete põhjal järelduste tegemisel ning nende kirjalikul ja suulisel esitamisel loodusteadusliku hariduse ja haridustehnoloogia valdkonnas. 3. Oskab uurimustulemusi kirjalikult vormistada eesti ja inglise keeles, esitada neid suuliselt nii haridusteadlastele kui ka laiemale kuulajaskonnale, valdab akadeemilist diskussiooni ning oskab argumenteeritult kaitsta oma seisukohti. 4. Oskab leida ja analüüsida teaduslikku infot ning suudab sellest ja enda poolt kogutud andmetest sünteesida uusi teadmisi loodusteaduslikus hariduses ning oskab selle põhjal koostada õpetajatöös vajalikke materjale. 5. Tunneb teaduseetika üldprintsiipe ning oskab hinnata uuringute teaduslikku taset ja rakenduslikku väärtust õpetajatöös. 6. Omab teaduslikku ettevalmistust õpingute jätkamiseks doktoriõppes. 7. Omab ettevalmistust teadusartikli koostamiseks. Magistritööde esitamise tähtaeg on 25.mai 2025 Regina Soobardile pdf-failina. Kaitsmised toimuvad 3. ja 4. juuni 2025 Vanemuise 46-108."}