{"KURSUSE_NIMI": "Biosüstemaatika ja elurikkuse informaatika", "KURSUSE_KOOD": "LTOM.01.009", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 22, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursuse esimeses osas käsitletakse biosüstemaatika aluseid ja näidatakse taksoni nimede olulisust eluslooduse kommunikatsioonis. Kursusel osalejad õpivad tundma kuidas toimub uute taksonite kirjeldamine, eluslooduse klassifikatsiooni koostamine ja milleks kasutatakse eluslooduse nomenklatuuri koodekseid. Kursuse teine osa käsitleb bioloogia andmete haldust. Biosüstemaatika osas saadud teadmised aitavad mõista eluslooduse klassifikatsioonide ja taksoni nimede rolli andmehalduses. Üliõpilased õpivad koostama projekti andmehaldusplaani, mis annab üldise raamistiku kuidas ja mis tüüpi andmeid projekti tarvis kogutakse. Teise etapina õpitakse andmete toimetamist ja jagamist teiste (harrastus)uurijatega. Sellele järgneb andmeanalüüsi etapp ning andmete publitseerimine masinloetava andmekogumina. Viimane on väga tähtis etapp kuna bioloogias hakkavad publitseeritud ja DOI (Digital Object Identifier) baasil tsiteeritavad andmekogumid mängima üha olulisemat rolli. Andmete elutspkli viimase etapina õpitakse andmekogumi arhiveerimist ning seda kuidas juba arhiveeritud andmekogumit edasi arendama hakata.Objectives/eesmärkid:  Kursuse eesmärgiks on anda tudengile põhiteadmised biosüstemaatikast ja bioloogia andmete haldusest. Tudengid omandavad oskused kuidas kasutada taksonite nimetamise süsteemi eluslooduse kommunikatsioonis ja andmehalduses. Kursus annab teadmised kuidas enda eluslooduse andmeid hallata kogu nende elutsükli vältel - andmehaldusplaanist kuni andmete publitseerimise ja arhiveerimiseni.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:\n1) on teadlik biosüstemaatika põhialustest\n2) oskab lugeda eluslooduse klassifikatsiooni\n3) mõistab taksoni nimede rolli eluslooduse kommunikatsioonis ja andmehalduses\n4) on teadlik avatud ja õiglaste teadusandmete olemusest\n5) tunneb teadusandmete elutsüklit\n6) oskab leida eluslooduse andmeid avatud repositooriumidest\n7) oskab eluslooduse andmeid hallata Plutof platvormil\n8) oskab oma eluslooduse andmeid publitseerida ja arhiveerida Plutof platvormil"}