{"KURSUSE_NIMI": "Ökosüsteem ja muld", "KURSUSE_KOOD": "LTOM.02.021", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Maastikul paiknevad sarnased mullad kõrvuti, moodustades maastikul mullastiku. Optimaalsed mõõtmed maastiku või mulla kui ökosüsteemi uuringuteks sõltuvad uurimisvaldkonnast. Maastikul on selleks maastikuprofiil, või muldade pidevrida (kateena). Mullaelustiku uuringuteks mullahorisont või mullatüsend kuni lähtekivimini. Mulla kui elukeskkonna põhiomadused sõltuvad peamiselt veerežiimist, mulla reaktsioonist (pH) ja redoksrežiimist. Neelamisnähtused ja mulla neelamismahutavus.\nMuld kui bioloogilise mitmekesisuse varamu. Mulla orgaanilise aine varud ja käive erinevates mullatüüpides: sisend- ja väljundvood. Toiduahelad mullas. Orgaanilise aine laguahelad ja seal osalevad organismid. Rhisosfäär kui elustiku \"mikrokosmos\". Erinevate taimeliikide mõju mulla orgaanilise aine käibele. Mullaelustiku uurimistasandid ja rakendatavad meetodid. Muldade mitmekesisus ja elurikkus. Süsiniku- lämmastikuringet reguleerivad mikroorganismid ja nende aktiivsused erinevates keskkonnaoludes ja mullatüüpides.\nMulla kui elusfääri kaitse. Euroopa Liidu (Soil Strategy) põhiteemad. Muldade saastekoormused. Saastunud muldade tervendamine. Globaalsete muutuste mõju mullastikule.Objectives/eesmärkid:  Oskus hinnata mulda kui elukeskkonda kompleksselt ja erinevates mastaapides (elupaik, kasvukohatüüp, maastik), arvestades nii mulla füüsikalisi, keemilisi ja bioloogilisi omadusi. Antakse oskused, mis aitavad hinnata muldade füüsikaliste ja keemiliste omaduste ning elusfääride vahelisi seoseid. Kujundatakse tervikpilt keskkonna omaduste ja bioloogiliste protsesside vahel mullas. Sellega luuakse eeldused muldade kui ka üldise keskkonnaseisundi objektiivseks hindamiseks.Learning outcomes/õpiväljund:  Luuakse erinevate muldade tervise ja suhtelise bioloogilise väärtuse hindamisvõimekus lähtuvalt kasutuseesmärgist ja majandusviisist. Osatakse valida ja hinnata analüütilisi tunnuseid, sobilike ning otstarbekaid uurimismeetodeid mullapõhiste ökosüsteemide seisundite hindamiseks. Tekib pädevus mullakaitse ja ökosüsteemide maa-aluse osa peateemadest ja valupunktidest lokaalsel, regionaalsel, kontinendi (Euroopa) ja globaalsel tasemel."}