{"KURSUSE_NIMI": "Rakendusklimatoloogia ja kliimamuutustega kohanemine", "KURSUSE_KOOD": "LTOM.02.062", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb mitmest iseseisvast blokist. Esimene on sünoptilise klimatoloogia plokk, mis annab ülevaate sünoptilise klimatoloogia arenemisloost, tutvustab peamisi atmosfääri tsirkulatsiooni klassifitseerimismeetodeid ja põhilisi tulemusi, mis on sünoptilise klimatoloogia meetoditega saavutatud.\nAgrometeoroloogia osas vaadeldakse kultuuride nõudlusi ilmastikutingimustele suvisel ja talvisel perioodil, ohtlikke ilmanähtusi, agrokliimaressursside jaotumist maakeral ja teisi seostuvaid valdkondi. \nKolmas aineplokk hõlmab kliima modelleerimise aluseid. Kursuse käigus tutvustatakse kliima modelleerimise põhialuseid, kaasa arvatud kliimasüsteemi peamiste komponentide kirjeldus ning olulisemate protsesside füüsikaline parametriseerimine, antakse ülevaade erinevatest kliimamudelitest ning käsitletakse nende peamisi rakendusvaldkondi, eelkõige kliimamudelite kasutamist globaalsete muutuste uurimisel. \nKursus lõpeb klimaatilise andmeanalüüsi plokiga, kus tutvustatakse ja kasutatakse keerulisemaid ruumilise ja ajalise muutlikkuse analüüsi statistilisi meetodeid (autokorrelatsioonianalüüs, spektraalanalüüs, peakomponentanalüüs), ning globaalse kliimamuutuse seminariga, kus arutatakse läbi kliima muutumisega seotud probleemid uusimate teadussaavutuste valgusel.Objectives/eesmärkid:  Anda detailne ülevaade ja praktilised oskused klimatoloogia erinevates valdkondades: sünoptiline klimatoloogia, agrometeoroloogia ja agroklimatoloogia, kliima modelleerimine, klimatoloogiline andmeanalüüs ja globaalne kliimamuutus.Learning outcomes/õpiväljund:  .Üliõpilane * teab sünoptilise klimatoloogia põhiterminoloogiat * oskab lugeda, aru saada ja analüüsida sünoptilisi kaarte * teab peamisi atmosfääri tsirkulatsiooni klassifikatsioone Euroopa jaoks * oskab kirjeldada erinevate tsirkulatsioonitüüpide mõju ilmastikule Euroopas * teab peamisi agrometeoroloogilisi näitajaid ja oskab neid arvutada * tunneb peamiste põllumajanduskultuuride nõudlusi ilmastiku ja kliima suhtes erinevatel taimekasvu etappidel * tunneb agrokliimatingimusi maakera erinevates piirkondades ja nendeks kohastunud kultuure * teab kliimasüsteemi komponente ja saab aru peamiste kliimat kujundavate tegurite toimest * saab aru tagasiside protsessidest kliimasüsteemis * saab üldjoontes aru kliima modelleerimise olemusest ja kasutusaladest * oskab eristada erinevat tüüpi kliimamudeleid, nende võimalusi ja väljundeid * teab globaalse ja regionaalse kliimamudeli peamisi osi * saab aru kliimamudeli horisontaalsest ja vertikaalsest lahutusest * oskab üldjoontes kirjeldada kliima muutuse stsenaariumi koostamist * teab globaalse kliima soojenemise võimalikke tagajärgi * tunneb klimaatilise andmetöötluse peamisi statistilisi meetodeid ja oskab neid kasutada"}