{"KURSUSE_NIMI": "Süsteemide modelleerimine (praktikum, MATLAB)", "KURSUSE_KOOD": "LTTI.00.010", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus analüütilisse modelleerimisse"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 30, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on jagatud kolmeks osaks\nI - süsteemibioloogia: õpetatakse biomolekulaarsete dünaamiliste süsteemide modelleerimise tänapäevaseid meetodeid. Simulatsioonide tulemuse analüüs ja interpreteerimine. Tuuakse näiteid sellest, kuidas dünaamilised matemaatilised mudelid suudavad anda selliseid uusi teadmisi bioloogilistest süsteemidest, mida ei ole võimalik saada vaid eksperimentaalse töö abil.\n II - Robootika: see osa kursusest annab ülevaate matemaatilise analüüsi meetoditest, mida kasutatakse robootikas. \nIII - Integreeritud lähenemine. Bioloogiliste ja füüsikaliste dünaamiliste süsteemide ühiste omaduste leidmine ja uurimine.Objectives/eesmärkid:  Kursuse peamine eesmärk on treenida üliõpilasi erinevate süsteemibioloogias ja inseneriteaduses kasutatavate arvutuslike meetodite alal. Nendeks on (i) suurte andmehulkade analüüs, (ii) võrgustike arendamine ja analüüs, (iii) harilike ja osaliste differentsiaalvõrrandite baasil loodud deterministlike dünamiliste mudelite rakendamine, (iv) stohhastiliste dünaamiliste mudelite rakendamine, (v) sissejuhatus robootika toolbox'i ja robotite liikumise simulatsioon.Learning outcomes/õpiväljund:  Kursuse raames sooritavad üliõpilased arvutusi ja numbrilisi simulatsioone MATLABil arvutiklassis ja teevad vastavasisulisi ülesandeid kodutööna.\nÜliõpilased saavad installeerida institutsionaalne MATLABi litsentsi enda sülearvutisse. Kuigi kursuse fookus on suunatud arvutuslikele meetoditele, saavad üliõpilased lisaks kogemusi töös eksperimentaalsete andmete erinevate tüüpide ja kogumitega, ning küsimustes, mida antud andmetega saab lahendada kasutades erinevaid arvutusmeetodeid."}