{"KURSUSE_NIMI": "Andmeteadus astronoomias", "KURSUSE_KOOD": "LTTO.00.028", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 20, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 114, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lühike sissejuhatus astronoomiasse. Vaatlusprojektid ja kosmosemissioonid, mis toodavad astronoomilisi andmeid. Astronoomiliste andmete pärimine andmebaasidest ja visualiseerimine. Erinevatest allikatest pärinevate andmete kombineerimine. Ruumiliste andmete statistiline analüüs. Aegridade analüüs. Vigade hindamise meetodid. Masinõppe rakendamine astronoomiliste probleemide lahendamisel.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada astronoomiliste andmete elutsüklit alates andmete kogumisest kuni avaldamiseni. Kursus annab ülevaate astronoomiliste andmete päringutest, erinevatest astronoomias kasutatavatest andmeteaduse meetoditest ning nende rakendamisest reaalsetele vaatlus- või simulatsiooni andmetele.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1. orienteerub astronoomilistes andmebaasides ning mõistab astronoomiliste andmete eripära; 2. oskab teha päringuid andmebaasidesse ning oskab kombineerida andmeid erinevatest andmebaasidest; 3. oskab visualiseerida astronoomilisi andmeid ning on võimeline tegema visuaalset analüüsi; 4. tunneb peamisi andmetöötluse meetodeid, mida kasutatakse astronoomiliste andmete analüüsil, näiteks regressioon, paariskorrelatsioonifunktsioon, objektide klassifitseerimine masinõppe abil, klastering analüüs, märgitud punktprotsessid; 5. oskab rakendada valitud andmetöötluse meetodeid reaalsete andmete analüüsimiseks; 6. oskab rakendada astronoomia-spetsiifilist tarkvara (nt. Astropy teegid, TOPCAT, Aladin); 7. mõistab vaatlusliku selektsiooni mõju ja tähtsust andmeanalüüsis; 8. tunneb meetodeid vigade hindamiseks (nt. bootstrap) ning oskab neid rakendada; 9. tunneb peamisi masinõppe algoritme ning oskab neid rakendada astronoomiliste probleemide lahendamisel."}