{"KURSUSE_NIMI": "Kosmosesüsteemid", "KURSUSE_KOOD": "LTTO.00.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Sissejuhatus kosmose avastamisse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "\"Kosmosesüsteemid\" on jätkukursus ainele LOTI.05.071 \"Kosmosetehnoloogia alused\", ning pakub tehniliselt veidi sügavamat ülevaadet satelliidi alamsüsteemidest ning nende tööpõhimõtetest.\n\nKursus on jagatud loenguteks ning seminarideks. Loengud annavad ülevaate satelliidi süsteemide arendamisest, kosmosekeskkonnast, orbiitidest, struktuuri arendamisest, soojusregulatsioonist, elektrilistest toitesüsteemidest, sidesüsteemidest, satelliidi asendi määramisest ja juhtimisest ning pardaarvutitest.\n\nSeminarides lahendame satelliitide alamsüsteemide arendamisega seotud ülesandeid:\n1. nõuete tuletamine satelliidi alamsüsteemidele, disainikriteeriumite leidmine ning disainiparameetrite varu arvestamine,\n2. lihtsa pardaarvuti arhitektuuri arendamine ja selle plokk-diagrammil kujutamine,\n3. lihtsa Kalman filtri ning PID kontrolleri implementeerimine,\n4. soojusregulatsiooni planeerimine satelliidi alamsüsteemile,Objectives/eesmärkid:  Koolitada tulevasi insenere ja teadlasi Eesti ettevõtetele ja teadusasutustele, mis on seotud satelliidi alamsüsteemide arendamisega.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng 1. omab ülevaadet tüüpilise satelliidi missioonifaasidest ja satelliidi alamsüsteemidest, 2. omab ülevaadet kosmosesüsteemi arendamisest, 3. omab ülevaadet erinevatest kosmosekeskkonna mõjudest satelliidi süsteemidele, 4. omab ülevaadet radioaktiivse kiirguse poolt põhjustatud nähtustest elektroonikas ja tarkvaras, 5. omab ülevaadet põhilistest orbiitidest ning orbitaalparameetritest, 6. omab ülevaadet struktuuri arendamise ja tootmise põhiprintsiipidest ning piirangutest satelliitide puhul, 7. omab ülevaadet vibratsiooni ja põrutuste mõjudest kosmosesüsteemidele ning vastavatest testprotseduuridest, 8. omab ülevaadet satelliitides tihti kasutatavate materjalide termilistest omadustest, 9. omab ülevaadet soojusregulatsioonimeetoditest ning nende piirangutest satelliitidel, 10. omab ülevaadet elektrilistest toitesüsteemidest ning elektrilise toite jaotussüsteemidest, 11. omab ülevaadet satelliidi sidesüsteemidest, 12. teab, mida tähendavad SNR, CW, FSK, PSK ning soojusmüra satelliidi sidesüsteemide puhul, 13. teab, kuidas väljendatakse satelliidi orientatsiooni kosmoses, ning kuidas seda arvutada, 14. omab ülevaadet anduritest ja aktuaatoritest satelliidi asendi määramiseks ja juhtimiseks, 15. oskab loetleda ning kirjeldada satelliidi pardaarvuti põhifunktsioonid, 16. omab ülevaadet lihtsamatest liiasuse / ülekatvuse meetoditest ning oskab põhjendada nende kasutust."}