{"KURSUSE_NIMI": "Andmeteadus kaugseires", "KURSUSE_KOOD": "LTTO.00.027", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 39, "practice": 0, "seminar": 13, "independent_work": 104, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse põhirõhk on rühmatööl, mille käigus üliõpilased saavad valida püstitatud probleemülesannete seast huvipakkuvaima ning hakkavad seda rühmasiseselt lahendama. Igal rühmal on juhendaja. Kursus toimub probleemipõhise õppe protsessina. Lisaks toimuvad loengud.Objectives/eesmärkid:  Ainekursus annab põhjalikud teadmised aktiivse ja passiivse kaugseire vahenditest ja meetoditest. Kursuse kuulaja omandab satelliidipiltide töötlemise ja analüüsi võtted. Õpitake kombineerima andmeid erinevatest andmebaasidest ning looma sünergiat erinevate andmetüüpide vahel.Learning outcomes/õpiväljund:  Peale kursuse lõppu:  - teab üliõpilane passiivse, radar-, lidarkaugseire põhimõtteid ja erinevaid rakendusvaldkondi; - on saanud ülevaate spektraalmõõtmistest (teab mõisteid: spektromeeter, kirkus, kiiritustihedus, peegeldustegur, atmosfäärikorrektsioon, kalibratsioon); - teab veekaugseire iseärasusi (bio-optiline modelleerimine, naabrusefekt) - teab taimkatte kaugseire iseärasusi (taimelehe optilised omadused, peegeldusteguri komponendid, lehtede kaldenurgad, erinevad indeksid). - leida, töödelda ja kasutada kaugseire ja vajadusel lisaandmeid, ning rakendada neid teadmisi erinevate looduskeskkonda iselmoomustavate näitajate hindamise, ajalis-ruumiliste muustuste tuvastamiseks. - mõistab kaugseire ja kontaktmõõtmiste käigus kogutud andmete erinevusi, oskab neid kombineerida ja kasutada ajalis-ruumilisteks analüüsideks ning toetamaks säästva arengu eesmärke (SDG) ja keskkonnapoliitika direktiive. -oskab planeerida ning läbi viia rühmatööd, jaotada ülesandeid rühmaliikmete vahel ning raporteerida tulemusi."}