{"KURSUSE_NIMI": "Tähesüsteemide ja galaktikate füüsika", "KURSUSE_KOOD": "LTTO.00.017", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 25, "practice": 0, "seminar": 7, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursuses kirjeldatakse galaktikate (ja üldisemalt tähesüs-teemide) ehituse kohta olemasolevaid vaatlusandmeid ja nende aluseks olevaid füüsikalisi protsesse. Kursus algab tähesüsteemi-de füüsika põhimõistete tutvustusega. Seejärel antakse lühiülevaade täheparvedest kui lihtsaimatest tähesüsteemidest. Järgneb stellaardünaamika põhialuste tutvustus koos näidetega esitatud materjali rakendustest täheparvede ehituse mõistmisel. Kursuse põhiosa moodustab galaktikate, nende erinevate tüüpide ja tüüpi-devaheliste erinevuste kirjeldus. Käsitletakse galaktikate uurimiseks kasutatavaid vaatlusmeetodeid, saadud tulemusi ja nende tulemuste mõistmist galaktikates tõenäoliselt toimivate füüsikalis-te protsesside kaudu. Materjali täiendab erinevatele galaktikatüü-pidele iseloomulike stellaardünaamiliste põhiprobleemide tutvustus. Kursuse lõpuosas käsitletakse aktiivseid galaktikatuumi, neis toimuvaid füüsikalisi protsesse ja galaktikate tekke teooriaid.Objectives/eesmärkid:  Õppeaine eesmärgiks on anda ülevaade täheparvede ja galaktikate ehitusest ja dünaamikast.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. tunneb tähesüsteemide füüsika ja stellaardünaamika põhimõisteid, 2. oskab eristada erinevaid tähesüsteemide tüüpe ja mõistab nendevahelisi erinevusi, 3. omab ettekujutust tähesüsteemide ehituse uurimiseks kasutatavatest vaatlusandmetest ja nende võimalustest, 4. oskab seostada põhilisi vaatlusandmeid tähesüsteemides tõenäoliselt toimuvate füüsikaliste protsessidega, 5. omab ettekujutust tänapäevastest ideedest galaktikate tekke ja arengu kohta. Toimub üle aasta"}