{"KURSUSE_NIMI": "Teoreetiline astrofüüsika", "KURSUSE_KOOD": "LTTO.00.015", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Aatomite ja molekulide spektroskoopia", "Füüsika praktikum III - optika", "Kvantmehaanika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursus baseerub teoreetilise füüsika arusaamadele. Kuna praktiliselt kogu info tähtede kohta me saame nende elektromagnetilise kiirguse analüüsist, siis me kirjeldame EM välja omadusi, samuti EM välja ning aine vastastikmõju. Sellega seoses peame me teadma, kuidas lahendada lihtsaimatel juhtudel kiirguslevi võrrandit tähtedes. \nTäheatmosfäärid on need piirkonnad, kus formeerub tähe pidev spekter, seepärast on loomulik, et me täheatmosfääride ehitust kirjeldame üksikasjalikumalt. Astrofüüsikud on näidanud, et tähe energia on pärit tähe tuumas toimuvatest termotuumareaktsioonidest ja seepärast vaatleme ka neid reaktsioone lähemalt. Me näitame, et tähed on tekkinud tähtedevahelise keskkonna tolmust ja gaasist, mis koosneb põhiliselt vesinikust. Järgmise sammuna käsitleme tähtede evolutsiooni pärast seda, kui nad on läbinud peajada faasi.\nKirjeldame mõningates pulsseeruvates muutlikes toimuvaid protsesse ja käsitleme tähtede kõdunud jäänuseid. Viimases peatükis vaatleme lähiskaksiktähti, milles toimuvad energiarikkad protsessid on oluliselt laiendanud meie arusaamu tähtede ehitusest.Objectives/eesmärkid:  Selle loengukursuse eesmärk on anda tänapäeva füüsika arusaamadele toetudes ülevaade sellest, kuidas tähed tekivad, evolutsioneeruvad ja surevad. Loomulikult saame me seda teha vaid koostades nendele arusaamadele vastavaid mudeleid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine läbinud üliõpilane:\n1. Tunneb kiirguslevi võrrandi lahendamise lihtsamaid meetodeid ja oskab neid kasutada;\n2. Teab tähtede atmosfääride modelleerimise põhitõdesid;\n3. Tunneb tähtede siseehituse kirjeldamiseks vajalikke võrrandeid ja oskab neid kasutada;\n4. Teab, kuidas tekivad tähed ja kuidas nad jõuavad vesiniku põletamise staadiumisse;\n5. Tunneb tähtede arengu peajada-järgset evolutsiooni;\n6. Teab pulsseeruvates tähtedes toimuvaid protsesse;\n7. Saab aru tähtede evolutsiooni lõppetappides toimuvatest protsessidest, mis viivad neutrontähtede ja mustade aukudeni;\n8. Teab lähiskaksikutega seotud probleeme, nagu protsessid, mis võivad viia supernoova plahvatusteni jne."}