{"KURSUSE_NIMI": "Globaalfüüsika", "KURSUSE_KOOD": "LTTO.00.025", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Füüsika ja tehnika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 34, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 44, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antakse ülevaade olulisematest geofüüsikalistest ja kosmilistest objektidest, nende uurimise füüsikalistest meetoditest, nende tekke ja arengu füüsikast. Detailsemalt käsitletakse Maa sisemuse, atmosfääri ja Maailmamere füüsikalisi omadusi ja keemilist koostist. \nKosmilistest objektidest vaadeldakse lähemalt Päikest ja Päikesesüsteemi komponente, käsitletakse tähtede parameetreid ja arengufaase, meie Galaktika, teiste galaktikate ning Universumi struktuuri ja arengut. Tutvustatakse kosmoloogia aluseid, tuuakse välja globaalfüüsika seosed teiste füüsikakursustega.Objectives/eesmärkid:  Tutvustada suuremastaabilisi (laboratoorsetes tingimustes mitte uuritavaid) füüsikalisi süsteeme ning nende kvalitatiivset ja kvanti-tatiivset kirjeldamist. Aidata üliõpilastel füüsika bakalaureuseõppe käigus omandatavaid teadmisi mõtestada globaalses kontekstisLearning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. Tunneb olulisemaid geofüüsikalisi ja kosmilisi uurimisobjekte, nende paigutust, mõõtmeid ning struktuuri; 2. Teab suurusjärguliselt nende objektide peamiste füüsikaliste parameetrite (tihedus, rõhk, temperatuur) tüüpilisi väärtusi; 3. Oskab kirjeldada mehaanilisi, soojuslikke, elektromagnetilisi ja keemilisi protsesse, milles need objektid osalevad; 4. Tunneb füüsikalisi meetodeid, mille vahendusel me saame infot nimetet objektide ja protsesside kohta ning modelleerime neid, oskab anda hinnanguid meetodite usaldatavusele; 5. Oskab kirjeldada globaalfüüsikaliste uurimisobjektide ajalist evolutsiooni ja teab nende olulisemaid arengufaase; 6. Suudab lahendada globaalfüüsikalisi objekte käsitlevaid arvutusülesandeid aine näidisülesannetega määratletud tasemel."}