{"KURSUSE_NIMI": "Praktiline FPGA disain", "KURSUSE_KOOD": "LTTO.00.034", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Digitaalne loogika", "Programmeerimine arvutitehnikutele"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 11, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 55, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ülevaade FPGA-st(Field Programmable Gate Array), rakendustest ja nende positsioonist digitaaldisaini maastikul. Objectives/eesmärkid:  Anda ülevaade FPGA(Field Programmable Gate Array) tehnoloogiatest, sealhulgas ajaloolisest kontekstist ja kaasaegsetest edusammudest.  Tutvustada FPGA jaoks olulist disaini töövoogu kontseptsioonist teostuseni. Õpetada IP-tuumade, piirangute ja simulatsiooni kasutamist FPGA disainis. Õpitakse paigutuse, marsruutimise ja ajastuse analüüsi mõju kohta digitaalses disainis.  Pakkuda praktilist kogemust FPGA-disaini tööstusharu standardsete tööriistadega. Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Disaini töövoog: saate aru FPGA-de põhilisest töövoost, sealhulgas kontseptuaalsest disainist, kodeerimisest, simulatsioonist, sünteesist, implementatsioonist ja testimisest. IP tuumad ja piirangud:\nÕpite IP-tuumasid tõhusalt kasutama FPGA projekteerimisel, sealhulgas parameetrite määramisel ja integreerimisel suurematesse süsteemidesse. \n\nSaate aru disainipiirangute (ajastus, ala, võimsus) tähtsusest ja nende rakendamisest FPGA disainis.  Simulatsioon ja kontrollimine:\nOmandate oskusi katsepinkide kirjutamises ja simulatsioonide tegemises, et kontrollida disaini õigsust. \n\n Õpite kasutama simulatsioonitööriistu disainiprobleemide tuvastamiseks ja parandamiseks enne sünteesi.  Paigutus ja marsruutimine:\nSaate aru paigutuse ja marsruudi mõjust digitaalse disaini jõudlusele ja usaldusväärsusele. \n\n Õpite analüüsima ja optimeerima paigutust ja marsruutimist, et olla vastavuses disainipiirangutele. Tööriistad ja tehnikad:\nÕpite kasutama tööstusstandardi tööriistu, nagu Xilinx Vivado, FPGA kujundamiseks. \nÕppige nende tööriistade abil teostama ajastusanalüüsi, võimsusanalüüsi ja muid kriitilisi disaini hindamisi "}