{"KURSUSE_NIMI": "Majandus- ja ettevõtluspedagoogika alused", "KURSUSE_KOOD": "MJCV.00.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 6, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1L.     Sissejuhatus majandus- ja ettevõtluspedagoogikasse, \n           majandus- ja ettevõtlushariduse   arengutendentsid.\n2L.     Majanduse ja ettevõtluse terminoloogia; väikeettevõtluse olemusest ja teooriatest;   \n           sotsiaalettevõtlus\n3-4 L. Äriplaani õpetamine kui meetod majandus- ja ettevõtlusõppes\n5L      Ärieetika põhialused\n6-7L  Innovatiivsed ja aktiivõppemeetodid majandus- ja ettevõtlusõppes: \n8L.    Koolituse/ tundide läbiviimise didaktika põhiprintsiibid. Konstruktiivne tagasisideObjectives/eesmärkid:  Kursuse eesmärgiks on tutvustada  majandus- ja ettevõtlushariduse arengut, ettevõtluse spetsiifikat ning majandus- ja ettevõtluspedagoogika olemust; anda ülevaade majanduse ja ettevõtluse põhiterminoloogiast; anda ülevaade väikeettevõtluse olemusest, teooriatest ning ettevõtluse alustamisest. Lisaks käsitletakse järgmisi teemasid: naisettevõtjad, pereettevõtted, sotsiaalettevõtlus ning ettevõtte säästev/jätkusuutlik areng; äriplaani õpetamist ja ärieetika põhiprintsiipe. Koolituste läbiviimise põhimõtteid ja innovaatilisi õppemeetodeid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: A TEADMISED, üliõpilasel:\n- on ülevaade majandus-ja ettevõtluspedagoogikast, võimalustest integreerida teadmisi oma õpetatavasse põhiainesse või rakendada koolitustel;\n- majanduse ja ettevõtluse terminoloogiast;\n- väikeettevõtluse olemusest, teooriatest;\n- ettevõtluse alustamisest;\n- äriplaani õpetamisest kui meetodist ja ärieetikast.\nB ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane:\n- oskab rakendada ja integreerida majandus- ja ettevõtluspedagoogika-alaseid teadmisi oma õpetatavas põhiaines/ koolitusel;\n- oskab kasutada majandus-ja ettevõtlusalast terminoloogiat;\n- oskab õpetada ja rakendada erinevaid innovaatilisi meetodeid äriplaani õpetamisel/koolitusel."}