{"KURSUSE_NIMI": "Projekti kirjutamise seminar", "KURSUSE_KOOD": "MJCV.00.001", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppija omandab kursuse jooksul projektide kavandamise ja juhtimisega seotud põhiteadmised ning praktilised oskused projektide kavandamiseks ja projektitaotluste koostamiseks. Aines käsitletakse projekti koostamise eeletapina probleemanalüüsi, ideede genereerimist. Õppijad saavad ülevaate Mittetulundusühenduste seadusest,  koostavad praktilise tööna MTÜ põhikirja või analüüsivad olemasolevat põhikirja. Õppe käigus saavad õppijad praktilise kogemuse meeskonnatööna ülesannete ja eesmärkide formuleerimisest, tegevuste, aja-, raha-, ja inimressursi planeerimisest. Õppijad saavad kogemuse, kuidas meeskonnatööna esitleda koostatud projektikavandit ning hinnata ja anda tagasisidet teiste projektikavandile. Kursus lõpeb arvestusega.Objectives/eesmärkid:  Õppijad omandavad projektide planeerimisega ja  juhtimise seotud põhiteadmised ning praktilised oskused projektide kavandamiseks, projektile rahastuse leidmiseks, projektitaotluste koostamiseks, projekti riskide hindamiseks ja projektikavandi kaitsmiseks meeskonnatööna. Õppijad saavad ülevaate Mittetulundusühenduste seadusest, omandavad MTÜ põhikirja koostamise või analüüsimise oskuse ning saavad teiste projektikavandite hindamise ja projektikavanditele tagasiside andmise kogemuse.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine läbinud üliõpilane:\noskab koguda ning analüüsida projekti kavandamiseks vajalikku taustainformatsiooni;\ntunneb projekti läbiviimiseks vajalikke protseduure ja nõudeid;\noskab määratleda ja analüüsida probleeme, seada strateegilisi eesmärke, teostada ja juhtida projekti planeerimist ning projekti tegevusi;\noskab koostada MTÜ põhikirja või analüüsida olemasolevat MTÜ põhikirja;\noskab koostada projekti eelarvet, teostada projekti finantsjuhtimist ning korraldada projekti aruandlust ja teostada projekti riskide hindamist, \noskab meeskonnatööna esitleda projektikavandit ning hinnata ja anda tagasisidet teisele projektikavandile."}