{"KURSUSE_NIMI": "Investeeringute analüüs", "KURSUSE_KOOD": "MJJV.10.044", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Finantsjuhtimine"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 16, "seminar": 4, "independent_work": 105, "individual_work": 1, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus hõlmab järgmisi teemasid: investeerimise alused, tootlus ja risk, võlakirjade ja aktsiate analüüs, investeerimisstrateegiad, finantsderivatiivid ning roheline (jätkusuutlik) investeerimine. Kursus koosneb interaktiivsete loengute sarjast, mis eeldab aktiivset osalemist, ning praktilistest sessioonidest arvutiklassis.Objectives/eesmärkid:  Ainekursuse eesmärgiks on anda süvendatud ülevaade praktikas laialdaselt kasutatavate ettevõtte rahanduse ning investeeringute analüüsi ja juhtimise kontseptsioonidest ja põhimõtetest.Learning outcomes/õpiväljund:  Kursus sisaldab mitmeid õpiväljundeid: - Kursuse edukal läbimisel omandavad üliõpilased teadmisi peamiste varaklasside (nagu aktsiad, võlakirjad, alternatiivsed investeeringud ja finantsderivatiivid) tootluse ja riski omadustest. \n- Tudengid mõistavad ka peamisi investeerimiskontseptsioone ning investeerimisanalüüsis kasutatavaid tööriistu ja mudeleid. \n- Tudengid saavad ülevaate asjakohasest finantsterminoloogiast. \n- Osalejad arendavad oskusi finantsteooriate ja -meetodite rakendamiseks praktikas, näiteks aktsiate ja võlakirjade analüüsimisel ning väärtpaberite tootluse ja riski hindamisel. \n- Kursusel osalejad omandavad praktilisi investeerimiskogemusi virtuaalses keskkonnas.\n- Üliõpilased on arendanud tabelarvutusprogrammi põhise finantsmodelleerimise oskust (MS Excel keskkonnas)\n- Kursuse lõpuks peaksid olema edasi arendatud ka meeskonnatöö ja organisatsioonilised oskused. Auditoorsed sessioonid salvestatakse ning salvestused on saadaval Moodle'is kuni kursuse lõpuni. Siiski õppejõud ei saa tagada salvestuste kvaliteeti ning osa materjalist võib osutuda puudulikuks. Seetõttu on üldine soovitus võimalusel sessioonides kohapeal osaleda."}