{"KURSUSE_NIMI": "Juhtimisarvestus", "KURSUSE_KOOD": "MJJV.09.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 22, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Finantsarvestuse ja juhtimisarvestuse erinevused. Juhtimis¬arvestuse valdkonnad. Kulude eesmärgid ja liigitamise alused. Arvestusinfo kasutamine otsustamisel. Omahinna kalkuleerimise traditsioonilised ja kaasaegsed meetodid. Firmasisene planeerimine. Ettevõttesisene aruandlus. Vastutuspõhine arvestus. Controlling. Tulemuslikkuse hindamine ja juhtimine. Tasakaalus tulemuskaart. Jätkusuutlikkuse aruandlus ja juhtimine. Finantsaruandluse analüüsi meetodid. Horisontaal- ja vertikaalanalüüs, suhtarvuanalüüs.Objectives/eesmärkid:  Eesmärgiks on käsitleda juhtimisarvestuse peamisi elemente ja meetodeid, vaadeldes ettevõttesisest kuluarvestust, planeerimist, aruandlust ja controllingut ning nende kasutust planeerimisel, kontrollil ja otsustamisel. Samuti vaadeldakse juhtimisarvestuse seoseid ettevõtte raamatupidamisaruandluse analüüsiga ja juhtimisarvestuse informatsiooni rolli aruandluse läbipaistvuse loomisel ja analüüsi läbiviimisel.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: 1)\ttunneb ettevõtte sisemise kuluarvestuse, planeerimise ja aruandluse põhimõtteid ja nende seoseid; 2)\ttunneb ettevõtte sisemise arvestussüsteemi eripärasid ja rolli ettevõtte finantstulemuste hindamisel ja analüüsil; 3)\ton suuteline määratlema ettevõtte kuluarvestussüsteemis kululiike, kulukohti ja kulukandjaid; 4)\toskab kasutada kuluinfot juhtimisotsuste tegemisel; 5)\tteab ja oskab kasutada omahinna kalkuleerimise erinevaid meetodeid; 6)\toskab rakendada teadmisi ettevõtte finantsplaanide koostamisel ja ettevõttesise aruandlussüsteemi kujundamisel; 7)     tunneb tulemuslikkuse hindamise (performance measurement) põhimõtteid ja meetodeid, sh. tasakaalus tulemuskaarti;   8)\tteab ja oskab kasutada finantsaruandluse analüüsi meetodeid; 9)     tunneb organisatsiooni jätkusuutlikkuse (sustainability) juhtimise põhimõtteid  10)\tmõistab juhtimisarvestuse rolli ettevõtte finantsseisundi kujunemisel ja analüüsimisel."}