{"KURSUSE_NIMI": "Organisatsioonikultuur ja muutuste juhtimine", "KURSUSE_KOOD": "MJJV.03.178", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kiirelt muutuv organisatsioonikeskkond esitab organisatsioonide kohenemisvõimele kõrgeid nõudeid. Organisatsioonide kohanemisvõimelisust analüüsitakse organisatsioonikultuuri ja muutuste juhtimise perspektiivist. Organisatsioonikultuuri seaduspärasuste tundmine võimaldab juhtida tarbijakesksust, kvaliteeti, töötajate motivatsiooni, meeskonnatööd jne. Aines käsitletakse, kuidas kujuneb organisatsioonikultuuri ning uuritakse selle suunamise võimalusi. Vaatluse alla võetakse muutuste mõjutegurid organisatsioonis ja muutuste juhtimise seaduspärasused. Ainekursuse vältel lahendatakse mitmesuguseid praktilisi ülesandeid, mis võimaldavad omandada organisatsioonikultuuri analüüsimise ja muutustega seotud meeskonnatöö korraldamise võtteid.Objectives/eesmärkid:  Aine üldeesmärkideks on luua võimalused  organisatsioonikultuuri tundma õppimiseks, võimaldamaks üliõpilasel analüüsida, mõista  ja lahendada olulisi küsimusi, mis mõjutavad  organisatsiooni muutusi ja nende juhtimist.Learning outcomes/õpiväljund:  Aine edukalt läbinud üliõpilane:\nMõistab organisatsioonikultuuri  ja muutuste juhtimise teoreetilisi ning praktilisi küsimusi nii töötaja kui juhi töö spetsiifikast lähtuvalt.\nTeab, kuidas analüüsida organisatsioonikultuure erinevatest vaatepunktidest.\nTeab milliseid organisatsioonikultuuri aspekte tuleb arvestada organisatsiooni konsulteerimisel.\nTeab, kuidas kujundada organisatsioonikultuuri ja juhtida muutusi.\nOmandab kogemused organisatsioonikultuuri analüüsimiseks ja hindamiseks.\nOmandab kogemused, kuidas teha koostööd organisatsiooni probleemide analüüsimisel."}