{"KURSUSE_NIMI": "Kulude juhtimine ja controlling", "KURSUSE_KOOD": "MJJV.09.045", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus hõlmab controllingu olemust, controllingusüsteemi komponente ja funktsioone ettevõtte planeerimise, infovarustuse ja kontrolli koordineerimise süsteemis. Käsitletakse kulude kujunemist ettevõtte tegevustsüklis, kulude mõjureid ja kulude juhtimise meetodeid ettevõttes. Käsitletakse ka tulemuslikkuse hindamise ja juhtimise meetodeid (sh tasakaalus tulemuskaart (balanced scorecard)). Eraldi käsitlemist leiavad sisemise arvestuse ja aruandlussüsteemi arengusuunad nii väliste kui ka siseste infotarbijate vajadustest lähtuvalt. Samuti käsitletakse controllingu kohta ettevõtte organisatsioonilises struktuuris.Objectives/eesmärkid:  Anda teadmisi kaasaegse kuluarvestuse ja kulude juhtimise rakenduslikest aspektidest ning ettevõttesisese aruandluse ja tulemuslikkuse hindamise ja tulemuslikkuse juhtimise metodoloogilistest ja metoodilistest alustest ettevõtte controllingusüsteemi raames.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1) teab controllingu olemust, eesmärke ja ülesanded ettevõtte infosüsteemide juhtimise ja finantsjuhtimise süsteemis 2) oskab analüüsida kulude kujunemise protsessi ettevõtte väärtusahelas; 3) teab peamisi kulude juhtimise meetodeid ettevõtte väärtusahela erinevates osades; 4) tunneb ettevõtte tegevuse tulemuslikkuse hindamise ja tulemuslikkuse juhtimise metoodilisi aluseid; 5) oskab analüüsida seoseid ettevõtte finantsiliste ja mittefinantsiliste näitajate vahel; 6) teab ettevõtte aruandluse peamisi arengusuundi; 7) oskab eristada operatiivse ja strateegilise controllingu eesmärke ja meetodeid; 8) teab controllingu rakendamise organisatsioonilisi aspekte ettevõttes."}