{"KURSUSE_NIMI": "Pangandus", "KURSUSE_KOOD": "MJJV.10.043", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 4, "seminar": 20, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengutes käsitletakse olulisemaid raha- ja panganduse kontseptsioone. Praktikumides rakendatakse teoreetilisi kontseptsioone konkreetsete situatsioonide analüüsimisel. Seminaridel kuulatakse ja arutatakse referaate.Objectives/eesmärkid:  Käsitleda rahateooriate põhiseisukohti raha ülesannete, kvaliteedi, raha liikide ja rahasüsteemide osas; rahapoliitika eesmärke ja meetodeid; kaasaegse panga tegevuse organiseerimist ja tehnoloogiaid; põhilisi pangateenuseid ja oskusi neid ise kasutada ja teisi nõustada.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbimisel üliõpilane mõistab raha kaasaegset rolli ning raha- ja krediidisüsteemide ülesehituse ja toimimise eripärasid, sh. Eesti raha- ja pangasüsteemi eripärasid. Üliõpilane oskab hinnata rahapoliitikas kasutavate vahendite sihtotstarbekust ja tulemuslikkust rahapoliitilistele teoreetilistele kontseptsioonidele tuginedes. Üliõpilane mõistab pankade rolli majanduses, omab ülevaadet kaasaegse panga toimimise finants-majanduslikest alustest ja olulisematest pangateenustest. Üliõpilane omab oskuse lugeda panga finantsaruandlust ja analüüsida panga tegevust tulususe, usaldatavuse, likviidsuse ja võetud finantsriskide seisukohalt; kasutada peamisi finantsriskide juhtimise meetodeid; võrrelda ja valida panga poolt pakutavaid baasteenuseid, lähtudes nende põhimõttelistest eripäradest ning kasutaja  vajadustest, sh.: krediitfinantseerimisskeeme, sularahata makseinstrumente, -viise ja maksekanaleid, säästutooteid, valuuta- ja teisi tuletistehinguid; teostada kliendi krediidivõime analüüsi teoreetilistele seisukohtadele ja pangandustavadele tuginedes."}