{"KURSUSE_NIMI": "Juhtimisarvestus", "KURSUSE_KOOD": "MJJV.09.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 22, "seminar": 4, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Finantsarvestuse ja juhtimisarvestuse erinevused. Juhtimis¬arvestuse valdkonnad. Kulude eesmärgid ja liigitamise alused. Arvestusinfo kasutamine otsustamisel. Omahinna kalkuleerimise traditsioonilised ja kaasaegsed meetodid. Firmasisene planeerimine. Ettevõttesisene aruandlus. Vastutuspõhine arvestus. Controlling. Tulemuslikkuse hindamine ja juhtimine. Tasakaalus tulemuskaart. Jätkusuutlikkuse aruandlus ja juhtimine. Finantsaruandluse analüüsi meetodid. Horisontaal- ja vertikaalanalüüs, suhtarvuanalüüs.Objectives/eesmärkid:  Eesmärgiks on käsitleda juhtimisarvestuse peamisi elemente ja meetodeid, vaadeldes ettevõttesisest kuluarvestust, planeerimist, aruandlust ja controllingut ning nende kasutust planeerimisel, kontrollil ja otsustamisel. Samuti vaadeldakse juhtimisarvestuse seoseid ettevõtte raamatupidamisaruandluse analüüsiga ja juhtimisarvestuse informatsiooni rolli aruandluse läbipaistvuse loomisel ja analüüsi läbiviimisel.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: mõistab juhtimisarvestuse rolli ettevõtte finantsseisundi kujunemisel ja analüüsimisel. oskab kasutada kuluinfot juhtimisotsuste tegemisel; oskab rakendada teadmisi ettevõtte finantsplaanide koostamisel ja ettevõttesise aruandlussüsteemi kujundamisel; tunneb tulemuslikkuse hindamise (performance measurement) põhimõtteid ja meetodeid, sh. tasakaalus tulemuskaarti;   teab ja oskab kasutada finantsaruandluse analüüsi meetodeid; Students are very welcome to the real classroom. \n In case of problems : All study materials will be uploaded to the Moodle, students have to upload their homeworks 1-5  and homework assignment to the Moodle.  \nAdditional information about online lectures, seminars and exam will be added to the Moodle."}