{"KURSUSE_NIMI": "Töösoorituse ja tulemuslikkuse juhtimine", "KURSUSE_KOOD": "MJJV.03.183", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus käsitletakse töötajate töösoorituse juhtimise, sh töösoorituse hindamise, töötasustamise (tulemustasustamise), motiveerimise ja arendamise teemasid. Keskendutakse töösoorituse juhtimise praktilistele küsimustele ning omandatakse teadmisi ja oskusi tagasisidestamisest ja grupi coachingust, mis on kasulikud nii enese kui teiste juhtimiseks tiimi ja  organisatsiooni arendamisest ja efektiivsusest lähtuvalt. Teoreetiliste ja praktiliste mudelite ja meetodite analüüsimisel käsitletakse nende seoseid juhtimise ja eestvedamisega.Objectives/eesmärkid:  Aine eesmärgiks on omandada teadmisi ja oskusi töötajate töösoorituse juhtimise (töösoorituse hindamise, töötasustamise ja arendamise) uuematest käsitlustest ning töö tulemuslikkuse tagasisidestamisest ja töötajate arendamisest. Aine raames omandatakse praktilised oskused grupicoachingu metoodika rakendamisel töötajate, tiimi ja organisatsiooni arendamisel.Learning outcomes/õpiväljund:  Mõistab ja oskab analüüsida töösoorituse juhtimise komponente ja kohta organisatsiooni arendamisel, nii töötaja kui juhi töö spetsiifikast ja organisatsiooni tulemuslikkusest lähtuvalt. Mõistab ja oskab rakendada töösoorituse arendamise ja tagasisidestamise meetodeid (sh grupicoachingut) nii töötaja kui juhi töö spetsiifikast lähtuvalt.  Oskab analüüsida töösoorituse juhtimist nii teoreetiliselt kui praktiliselt ning seostada seda organisatsiooni juhtimise ja eestvedamisega. Oskab analüüsida töösoorituse hindamise, töötasustamise ja motiveerimise teoreetilisi ja praktilisi küsimusi ning prognoosida töösoorituse juhtimise positiivseid ja negatiivseid tagajärgi organisatsioonis. Omandab grupi coachingu metoodika ning oskab seda loovalt kasutada tiimi ja grupi tööjuhtumite lahendamisel. Omandab praktilised oskused töösoorituse juhtimise valdkondades organisatsiooni, tiimi ja indiviidi tasandil."}