{"KURSUSE_NIMI": "Personali juhtimine ja organisatsioonikäitumine", "KURSUSE_KOOD": "MJJV.03.147", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 27, "independent_work": 125, "individual_work": 4, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine läbinud üliõpilane tunneb personali juhtimise ja organisatsioonikäitumise sisu ja mõistab kohta organisatsiooni (ettevõtte) tegevuse suunamisel,  nii töötaja kui juhi töö spetsiifikast lähtuvalt. Teab personali juhtimise eripärasid, sh personali planeerimise, kujundamise (värbamine, valik), rakendamise (hindamine, tasustamine) ning koolitamise ja arendamise valdkondades. Mõistab organisatsioonikäitumise põhiküsimusi, sh. indiviidi hoiakud, väärtused, motivatsioon, grupi/meeskonna toimimine, organisatsiooni sidustamine. On omandanud teadmised ning praktilised oskused inimressursi juhtimise ja organisatsioonikäitumise olulisemates küsimustes. On omandanud praktilised kogemused personali kujundamise ja rakendamise ning suunamise ja meeskonnatöö valdkondades. Oskab analüüsida personali juhtimise ja organisatsioonikäitumise probleeme ning prognoosida inimressursi juhtimise positiivseid ja negatiivseid tagajärgi.\nOskab hinnata inimkäitumise rolli ja arendamise võimalusi organisatsioonis.Objectives/eesmärkid:  Aine üldeesmärkideks on luua võimalused personali juhtimise ja organisatsioonikäitumise põhiteadmiste omandamiseks, kinnistamiseks ja praktiliste kogemuste saamiseks,  tagamaks pädevust inimressursi juhtimise ja organisatsioonikäitumise valdkondades.Learning outcomes/õpiväljund:  Mõistab inimressursi juhtimise ja organisatsioonikäitumise sisu ja kohta organisatsiooni (ettevõtte) tegevuse suunamisel, nii töötaja kui juhi töö spetsiifikast lähtuvalt. Teab personali juhtimise eripärasid, sh personali planeerimise, kujundamise (värbamine, valik), rakendamise (hindamine, tasustamine) ning koolitamise ja arendamise valdkondades. Mõistab organisatsioonikäitumise põhiküsimusi, sh. indiviidi hoiakud, väärtused, motivatsioon, grupi/meeskonna toimimine, organisatsiooni sidustamine. Oskab seostada inimressursi juhtimist ja organisatsioonikäitumist nii teoreetiliselt kui praktiliselt juhtimise kui tervikuga. Oskab personali kujundada (sh värvata ja valida) ning tulemuslikult juhtida (sh hinnata ja tasustada). Oskab hinnata inimkäitumise rolli ja arendamise võimalusi organisatsioonis. Omandab praktilisi oskusi personali kujundamise ja rakendamise valdkondades."}