{"KURSUSE_NIMI": "Välismajanduslik keskkond", "KURSUSE_KOOD": "MJRI.08.046", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ettevõtluse rahvusvahelise keskkonna kursuses keskendutakse põhiliselt järgnevaile teemaderingidele: \n1.Käsitletakse megatrendisid maailmamamajanduses (Aasia rolli muutus, keskklassi kasv, ressursside piiratus, elanikkonna vananemine, keskkonna probleemid jne.). Arutletakse selle üle, kuidas neid megatrende ära kasutada nii Eesti riigi ja ettevõtete poolt.\n2. Antakse ülevaade rahvusvahelise rahandusüsteemis arengutest ja sellest, kuidas Euroopa on jõudnud euro-ala loomiseni. Käsitletakse Euroopa integratsiooni temaatikat ja selle taustal Brexitit kui näidet,Euuropa riikide vastastikusest sõltuvusest.\n3.Tutvustatakse peamisi väliskaubanduspoliitika instrumente ja nende kasutamise reguleerimist Maailma Kaubandusorganisatsiooni raames. \n4. Selgitatakse välismaiste otseinvesteeringute mõistet, tekkepõhjuseid ja nendega kaasnevaid positiivseid ja negatiivseid ülekandeid sihtriigi majandusse.Objectives/eesmärkid:  Õppeaine üldeesmärgiks on anda üliõpilastele teadmised ettevõtlusele riigi välismajandussuhetega kujundatavast keskkonnastLearning outcomes/õpiväljund:  Aine läbinud üliõpilane:\n1) omab teadmisi rahvusvahelise majanduse põhialustest \n2) tunneb maailmamajanduse peamisi strateegilisi arengusuundasid\n3) suudab hinnata globaliseerumise protsessi mõju erinevatele majandusvaldkondadele\n4) tunneb rahvusvahelise kaubandus- ja rahasüsteemi toimimismehhanisme ja saab aru euro-ala toimimisloogikast\n4) oskab näha seoseid rahvusvahelise majanduse üldiste arengutendentside ja Eesti majanduse arengustrateegiate vahel\n5) tunneb välismajanduspoliitika põhiinstrumente ja maailma väliskaubanduspoliitika üldist korraldust ning oskab neid teadmisi kasutada oma ettevõtte tegevuses"}