{"KURSUSE_NIMI": "Statistilised ja ökonomeetrilised meetodid", "KURSUSE_KOOD": "MJRI.01.033", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 12, "seminar": 12, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines tutvustatakse empiirilise analüüsi korraldamise võtteid riigi ja ettevõtte tasandil ning saadakse teadmisi majandusprobleemide analüüsimisel kasutatavatest statistilistest meetoditest ja ökonomeetrilistest meetoditest, analüüsimeetodite valikust (kirjeldav statistika, indeksiteooria, hüpoteeside testimine, keskväärtuste võrdlemine, aegridade ja nähtustevaheliste seoste analüüs), tulemuste sisulisest tõlgendamisest ja vormistamisest. Õppeaines on võimalik saada teadmisi klassikalise ökonomeetrilise modelleerimise alustest, ühevõrrandilise regressioonimudeli hindamisest, analüüsimisest ning tulemuste sisulisest tõlgendamisest Ökonomeetrilise meetodite praktilise kasutamise oskuste süvendamiseks koostatakse ökonomeetriline projekt üliõpilaste poolt püstitatud sisuliste majandusprobleemide lahendamiseks.Objectives/eesmärkid:  Võimaldada üliõpilastel õppida püstitama uurimisprobleeme, millede lahendamisel saab kasutada statistilisi ja ökonomeetrilisi meetodeid ning omandada oskusi ja kogemusi statistiliste ja ökonomeetriliste meetodite kasutamiseks majandus- ja sotsiaalprotsesse iseloomustavate andmete analüüsimisel, püstitatud uurimisprobleemidele lahenduste leidmisel ning uurimistulemuste sisulisel tõlgendamisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Oskuse formuleerida probleeme, milledele lahenduste otsimisel saab kasutada statistilisi ja ökonomeetrilisi meetodeid.\nOskuse leida analüüsiks vajalikke ja sobivaid andmeid, neid süstematiseerida ja ette valmistada andmeid statistiliseks ja ökonomeetriliseks andmeanalüüsiks.\nTeadmised ja oskused olulisematest statistilistest ja ökonomeetrilistest andmeanalüüsi meetoditest, nende rakendamist ning tulemuste sisulisest tõlgendamisest.\nOskuse sisuliselt tõlgendada statistilise ja ökonomeetrilise analüüsi tulemusi, neid üldistada ning analüüsida tulemuste vastavust püstitatud uurimisküsimustele."}