{"KURSUSE_NIMI": "Praktika majanduses", "KURSUSE_KOOD": "MJRI.02.074", "EAP": 6, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 152, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üliõpilane võib praktika sooritada erinevates ettevõtetes ja organisatsioonides (ministeeriumid, ametid, kohalikud omavalitsused, pangad, ülikoolid; OÜ, MTÜ jt.), luua oma ettevõtte, osaleda uurimisgruppide töös või osaleda projektide elluviimisel. Praktika liigi valib üliõpilane  vastavalt oma arenguvajadustele ja lähtuvalt õppekava praktika eesmärgist. Praktika juhendajateks on ülikooli poolt praktika koordinaator ja ettevõtte poolne juhendaja. \nPool aastat enne praktikat toimub eelseminar, kus informeeritakse üliõpilast ja antakse suund.\nMajandusteaduskonnal on praktika ettevalmistamiseks kasutusel praktikaveeb - https://sisu.ut.ee/praktikamajanduses/avaleht ja praktika.ut.ee ning praktikale minekul juba Moodle kursus.\nPraktika jooksul peab üliõpilane lähtuma Moodle`s püstitatud ülesannetest.\nÜlesanded on: 1. Püstitama eesmärgi ja ülesanded; 2. Sõlmima lepingu; 3. Eneseanalüüs; 4. Tagasiside juhendajalt; 5. Lõpuseminar ja hinnang praktika protsessile. \nPraktika üheks oluliseks väljundiks on üliõpilase eneseanalüüs, mille käigus ta toob välja õpitu, oma tugevused ja nõrkused. Praktikajuhendaja (organisatsioonipoolse) tagasiside tema tegevusele on ka praktika kohustuslik osa.  Praktika lõpeb lõpuseminariga, kus toimub praktikal saadud kogemuse jagamine (osalevad kõik üliõpilased) ning antakse tagasiside ülikoolile praktika protsessist.Objectives/eesmärkid:  Praktika eesmärk on õpitud teoreetiliste ja praktiliste majandusalaste teadmiste rakendamine töökeskkonnas.Learning outcomes/õpiväljund:  Praktika läbinud üliõpilane: - rakendab õpitud majandusalaseid teadmisi ja oskusi töökeskkonnas ning hindab nende saavutamist; - mõistab lähtuvalt juhendaja(te) tagasisidest arendamist vajavaid teadmisi ja oskusi; - analüüsib teaduspõhiselt praktikabaasis sooritatavat ülesannet; - analüüsib praktika eesmärgist ja ülesannetest lähtuvalt enda kogemust, kogemusest õpitut ning planeerib edasised arenguvajadused."}