{"KURSUSE_NIMI": "Majanduspoliitika", "KURSUSE_KOOD": "MJRI.03.091", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 6, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 114, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse majanduspoliitika eesmärke ja vahendeid teooria erinevate suundade seisukohalt. Normatiivse lähenemise raames tuginetakse turutõrgete teooriale ja otsitakse vastust küsimusele - kuidas peaks majanduspoliitikat ühiskonna huvides tegema. Positivistlikku suunda käsitletakse poliitika majandusliku teooria (Public Choice) alusel, mis otsib vastust küsimusele - kuidas majanduspoliitikat tegelikult tehakse. Käsitletakse ka nn demokraatliku majanduspoliitika teooriat, mis püüab integreerida positivistlikku ja normatiivset suunda ning avada teadusliku poliitikanõustamise probleeme ja võimalusi.Objectives/eesmärkid:  Tutvustada üliõpilastele riigi majandusse sekkumise üldisi põhjuseid, selle konkreetseid eesmärke ja vahendeid nii normatiivse kui ka positivistliku teooria  seisukohalt.Learning outcomes/õpiväljund:  Üliõpilased oskavad eristada majanduspoliitika praktikat ja teooriat ning nende põhisuundi, sh majanduspoliitika makro- ja mikrotasandit, korra-, struktuuri- ja protsessipoliitikat ning majanduspoliitika teooria normatiivset ja positivistlikku suunda;\ntunnevad majanduspoliitika võimalikke eesmärke ning nende vahekorra ja valiku probleeme; tunnevad riigi majanduspoliitika põhilisi finants- ja õiguslikke instrumente, sh avaliku sektori rolli; eristavad turutõrkeid, nendega kaasnevaid võimalikke heaolukadusid ning majanduspoliitilisi vastumeetmeid; mõistavad riigitõrgete tekke põhjuseid ning nende tagajärgi; oskavad hinnata majanduspoliitiliste meetmete staatilist ja dünaamilist efektiivsust; oskavad seletada reaalset poliitikat kui erinevate poliitikasubjektide koostegevuse tulemust ning seostada riigitõrgete probleemi ühiskondlike ja poliitiliste institutsioonidega."}