{"KURSUSE_NIMI": "Arukad transpordisüsteemid", "KURSUSE_KOOD": "MTAT.08.040", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines käsitletakse muuhulgas järgmisi teemasid:\n*Sissejuhatus arukatesse transpordisüsteemidesse\n*Avanseeritud transpordihalduse süsteemid\n*Avanseeritud reisi-informatsiooni süsteemid\n*Turvalisus ja avanseeritud juhi-abi süsteemid\n*ITS keskkonna-aspektid\n*Kommunikatsioonitehnoloogia ja selle rakendamine ITS-s\n*ITS standardid ja arhitektuur\n*ITS telekommunikatsioon\n*Mobiilsed rakendused\n*ITS ja turvalisus\n*ITS reeglistike temaatika\n*Karjäär ITS vallasObjectives/eesmärkid:  Aine eesmärgiks on heita valgust info- ja kommunikatsioonitehnoloogia kasutamise tähtsusele transpordi vallas läbi arukate transpordisüsteemide (ITS - Intelligent Transportation Systems). Kursusel tutvustatakse süsteemide integreerimise ja tehnoloogiakasutuse  põhikontseptsioone ja printsiipe rakendatuna arukates transpordisüsteemides. Lisaks katab kursus võtmetehnoloogiaid nii seires, kommunikatsioonis ja andmehalduse vallas kui ka tehnoloogiaid süsteemide hindamisel, sealhulgas automaatset sõidukite positsioneerimist ja tuvastust, dünaamilisi juhtimissüsteeme, reisi-info süsteeme ning juhtumite avastamissüsteeme. Lisaks annab kursus ülevaate ITS teenustest ja lahendustest, sealhulhas majanduslikest, sotsiaalsetest ja keskkonna-alastest aspektidest ITS realisatsioonides.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng:\n*omab head arusaama ITS rollist ning olukordadest, kus vastavad tehnoloogilised lahendused on õnsuudab mõelda kriitiliselt hinnates ITS rakendustes realiseeritud teholoogiaid\n*on arendanud välja võime hinnata tehnoloogiliste lahenduste kasutatavust transpordiprobleemide lahendamisel\n*oskab hinnata sotsiaalseid ja keskkonna mõjusid uute ITS tehnoloogiate kasutamisel\n*oskab planeerida, kujundada ja hallata ITS projekti realisatsiooni\n*suudab uurida ITS rakandusi globaalsel tasemel"}