{"KURSUSE_NIMI": "Nõuete analüüs", "KURSUSE_KOOD": "MTAT.03.306", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Tarkvaratehnika"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel kaetavad teemad sisaldavad: nõuete määratlemist, nõuete analüüsi raamistikke, süsteemi ja konteksti piire, eesmärksuunatud modelleerimist, stsenaariumi analüüsi, lahendussuunatud nõudeid, nõuete dokumenteerimist, nõuete välja toomist, nõuete läbi rääkimist, nõuete kontrolli (alused, valideerimisvõtted, kontrollimine prototüpeerimise vahendusel), nõuete haldust (jälitatavus, prioriteetide seadmine ja muudatuste haldamine).Objectives/eesmärkid:  Kursus annab tudengitele ülevaate nõuete analüüsi alustest, põhimõtetest ja võtetest. Kursuses vaadeldakse enimlevinud lähenemisi nõuete analüüsile ning nende tehiseid nagu eesmärgid, stsenaariumid ja lahendussuunatud nõuded. Kursus tutvustab suuremaid nõuete analüüsiga seotud tegevusi nagu nõuete dokumenteerimine, nõuete välja toomine, nõuete läbi rääkimine ja nõuete haldamine. Kursus keskendub ka nõuete kontrollimisele võttes arvesse erinevaid võtteid, kaasa arvatud kontroll prototüpeerimise vahendusel.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane on võimeline: 1) Välja tooma, läbi rääkima ja dokumenteerima tarkvara nõudeid. 2) Looma olulisemaid nõuete tehiseid ning kasutama neid tarkvaraarendusprojektides. 3) Seletama nõuete analüüsiga seotud mõisteid, teooriaid ja parimaid praktikaid. 4) Rakendama nõueteanalüüsi võtteid mitmetes tarkvaraarenduse elutsüklites rõhuga prototüpeerimissuunatud projektidel. 5) Haldama tarkvara nõudeid, prioriteete, neid jälitama ja nende arengut kontrollima. The course will consist of 16 lessons, each lesson will include a lecture and a practical work session."}