{"KURSUSE_NIMI": "Hariduslikud programmeerimiskeeled", "KURSUSE_KOOD": "MTAT.03.299", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Programmeerimise alused"], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 12, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Programmeerimiskeskkond Scratch. Teised hariduslikud  programmeerimiskeeled. Mobiiliäpi loomine. Erinevatele vanuseastmetele programmeerimise õpetamise iseärasused.\nErinevate võimaluste kasutamine õpilastele antud huvitavate ülesannete lahendamisel (näiteks mängude programmeerimisel).\nScratchi-põhise õppe planeerimine ja läbiviimine huvi- ja koolitundides. Teiste üliõpilastega programmeerimise algõppe teemadel mõtete vahetamine.Objectives/eesmärkid:  Kursuse eesmärgiks on anda osalejatele ülevaade erinevatest hariduslikest programmeerimiskeeltest ja valmistada neid ette nende keelte kasutamiseks õpetamisel erinevates õppeastmetes.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane - tunneb rõõmu programmeerimisega tegelemisest; - oskab kasutada programmeerimiskeskkonna Scratch kõiki võimalusi; - tunneb vähemalt kahe teise haridusliku programmeerimiskeele (nt. Logo, Alice, Kodu Game Lab) põhivõimalusi;  - oskab kasutada hariduslike programmeerimiskeelte erinevaid võimalusi õpilastele huvitavate ülesannete (näiteks mängude programmeerimise) pakkumiseks;  - oskab luua lihtsat mobiiliäppi (nt. MIT AppInventoriga); - oskab planeerida ja läbi viia hariduslike programmeerimiskeelte baasil õpet huvi- ja koolitundides;  - oskab kasutada ja koostada õppetöös erinevatele vanuseastmetele programmeerimisalaseid koolimaterjale; - oskab kirjeldada programmeerimisalaseid mänge ja arvutiklassiväliseid programmeerimistegevusi; - oskab teha esitlusi hariduslike programmeerimiskeelte alaste teaduslike artiklite sisu põhjal; - on valmis teiste õpetajatega programmeerimise algõppe teemadel mõtteid vahetama. vt http://moodle.ut.ee"}