{"KURSUSE_NIMI": "Mõõt ja Lebesgue'i integraal", "KURSUSE_KOOD": "MTMM.00.014", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Matemaatiline analüüs III"], "SOOVITUSLIKUD_EELDUSAINED": ["Funktsionaalanalüüs I"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Mõõdu- ja integraaliteooria traditsiooniline ülikoolikursus. Teemad: mõõduga ruumid, mõiste \"peaaegu kõikjal\", Lebesgue`i mõõdud, mõõtuvad funktsioonid, Lebesgue`i integraal ja põhiteoreemid, mõõtuvate funktsioonide koonduvustüübid, korrutismõõdud.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvumine mõõdu- ja integraaliteooria põhimõistete ja -teoreemidega.Learning outcomes/õpiväljund:  Selle kursuse edukalt läbinud üliõpilane: \n1. oskab manipuleerida kaasaegse mõõduteooria põhimõistetega: sigma-algebrad, Boreli hulgad,  mõõdud, mõõdu täielikkus ja regulaarsus, \"peaaegu kõikjal\", mõõtuvad funktsioonid, Lebesgue'i integral;\n2. valdab Caratheodory-Hahni protseduuri mõõdu jätkamiseks algebralt selle algebra poolt genereeritud sigma-algebrale ning teab, kuidas selle protseduuri abil saadakse Lebesgue-Stieltjes'i mõõdud reaalsirgel; \n3. mõistab ruume Lp(µ), 1p;\n4. teab Lebesgue'i ja Riemanni mõttes integreeruvuse vahekorda;\n5. tunneb mõõtuvate funktsioonide erinevate koonduvustüüpide vahekordi;\n6. oskab sõnastada ja tõestada sissejuhatava mõõdu- ja integraaliteooria keskseid teoreeme: Caratheodory teoreemi, \nmonotoonse koonduvuse teoreemi, Fatou' lemmat,  Lebesgue'i domineeritud koonduvuse teoreemi, Jegorovi teoreemi;\n7. teab, kuidas genereeritakse korrutis-sigma-algebra ja\n (Caratheodory-Hahni protseduuri abil) defineeritakse korrutismõõt ning kuidas on defineeritud Lebesgue mõõt ruumis Rm; oskab rakendada Fubini-Tonelli teoreeme."}