{"KURSUSE_NIMI": "Baasid Banachi ruumides", "KURSUSE_KOOD": "MTMM.00.078", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Funktsionaalanalüüs I"], "SOOVITUSLIKUD_EELDUSAINED": ["Funktsionaalanalüüs II"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Algebraline baas on kasulik lõplikumõõtmelistes ruumides: jadad koonduvad neis ruumides parajasti siis, kui koonduvad nende koordinaadid. Lõpmatumõõtmelistes Banachi ruumides on algebraline baas üsna kasutu: nendes ruumides leidub alati koonduvaid jadasid, mille koordinaadid ei koondu. Lõpmatumõõtmelises Banachi ruumis on baas vähemalt sama kasulik kui algebraline baas lõplikumõõtmelises ruumis. Käsitletakse järgmiseid teemasid. Algebraline baas ja baas. Näited (ka lainekesed). Baasiprobleem ja auhind - elav hani - selle lahendajale. Banachi ruumide isomorfism. Baasi kriteerium. Baaside stabiilsus. Baaside olulisemaid omadusi. Ridade koonduvustüübid. Tingimatud baasid. Rakendused Banachi ruumide struktuuri uurimisse. Jamesi ruum. Baasiga alamruumi olemasolu. Tingimatu baasiga alamruumi probleem ja Fieldsi preemia (1998) selle lahenduse eest. Schauderi lahutused. Aproksimatsiooniomadused.Objectives/eesmärkid:  Valikaine matemaatika erialal. Eesmärgiks on anda üliõpilastele alusteadmised ja -oskused Banachi ruumide baaside teoorias. Baaside teooria leiab rakendamist funktsionaalanalüüsis, funktsiooniteoorias, arvutusmatemaatikas, diferentsiaal- ja integraalvõrrandite teoorias jm.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilased on omandanud alusteadmised ja -oskused Banachi ruumide baaside teoorias. Seejuures tunnevad nad järgmiseid põhimõisteid ja oskavad tõestada nende kohta käivaid põhitulemusi. Algebraline baas ja baas. Näited (ka lainekesed). Baasiprobleem ja auhind - elav hani - selle lahendajale. Banachi ruumide isomorfism. Baasi kriteerium. Baaside stabiilsus. Baaside olulisemaid omadusi. Ridade koonduvustüübid. Tingimatud baasid. Rakendused Banachi ruumide struktuuri uurimisse. Jamesi ruum. Baasiga alamruumi olemasolu. Tingimatu baasiga alamruumi probleem ja Fieldsi preemia (1998) selle lahenduse eest."}