{"KURSUSE_NIMI": "Matemaatiline modelleerimine", "KURSUSE_KOOD": "MTMM.00.326", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 50, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Modelleerimise printsiibid. Funktsioonide lähendamise mudelid. Lineaarne planeerimine. Optimiseerimine. Dünaamiliste protsesside modelleerimine. Füüsikaseadustel põhinevad mudelid. Diferentsiaalvõrranditel põhinevad mudelid. Juhuslikkusele tuginevad mudelid. Diferentsiaalvõrrandite süsteemidel põhinevad mudelid.Objectives/eesmärkid:  Sellel kursusel õpivad üliõpilased tundma matemaatilise modelleerimise protsessi. Eesmärk on arendada tudengite erinevate protsesside seostamise oskust ja seoseanalüüsi. Modelleerimise printsiipide tundmaõppimine ja rakendamine lihtsamate protsesside korral. Rõhk on mudeli konstrueerimisel, et anda üliõpilastele vastav loovusvilumus ja kogemus seosest reaalse maailma ja teoreetilise matemaatilise käsitluse vahel. Arendatakse uurimistöö, avaliku esinemise ja tulemuste vormistamise ning esitamise kogemusi, matemaatilise suulise eneseväljenduse oskust. On arendanud oma ajaplaneerimise ja ülesandespetsiifilisi oskusi seoses projektitöö koostamisega.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane tunneb modelleerimise printsiipe, oskab koostada lihtsamaid funktsioonide lähendamise, lineaarse planeerimise, optimiseerimise, füüsikaseadustel ja diferentsiaalvõrrandite süsteemidel põhinevaid mudeleid. Samuti juhuslikkusel põhinevaid mudeleid. Oskab vormistada modelleerimise tulemusi ja neid esitada. Üliõpilane oskab iseisesvalt jagada projekti koostamise tegevused väiksemateks etappideks ja planeerib aega erinevateks tegevusteks. Rakendab modelleerimise meetodeid ja aines õpitud teadmisi projektitöö probleemi lahendamisel, selgitab projekti ettekande käigus sõnastatud probleemi ja selle lahendusi. Kursust ei saa kuulata, kui on juba kuulatud kursus MTMM.00.250 Matemaatilise modelleerimise alused 3EAP, kuna see on esimene pool käesolevast kursusest."}