{"KURSUSE_NIMI": "Kompleksmuutuja funktsioonide teooria", "KURSUSE_KOOD": "MTMM.00.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Ühe muutuja matemaatiline analüüs", "Kõrgem matemaatika II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kompleksmuutuja funktsioonide teooria traditsiooniline ülikoolikursus. Käsitletakse kompleksmuutuja funktsioonide diferentseerimist ja integreerimist. Tõestatakse Cauchy teoreem ja Cauchy valem regulaarse funktsiooni esitamiseks tema rajaväärtuste kaudu. Uuritakse diferentseeruvate funktsioonide arendamist Taylori ja Laurent`i ritta. Käsitletakse resiidide teooriat ning piirkondade konformset kujutamist. Vaadeldakse funktsiooni Fourier' ja Laplace'i teisendust.Objectives/eesmärkid:  Tutvumine kompleksmuutuja funktsioonide diferentsiaal- ja integraalarvutuse ning analüütiliste funktsioonide omadustega.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1. tunneb kompleksmuutuja elementaarfunktsioone ja nende omadusi; 2. oskab leida kompleksmuutuja funktsiooni piirväärtust, tuletist ja integraali; 3. teab Cauchy teoreemi, Cauchy valemit ja Cauchy tüüpi integraali omadusi; 4. oskab arendada funktsioone astmeritta ning leida astmerea koonduvuspiirkonda; 5. oskab funktsioone arendada Laurent'i  ritta etteantud piirkonnas; 6. oskab leida resiide ning kasutada resiidide teooriat intregraalide arvutamisel; 7. oskab kasutada Rouche teoreemi analüütilise funktsiooni nullkohtade arvu leidmiseks etteantud piirkonnas; 8. teab harmooniliste funktsioonide põhiomadusi, oskab leida etteantud harmoonilisele funktsioonile kaasharmoonilist funktsiooni; 9. tunneb konformse kujutuse põhiomadusi ning oskab lihtsamaid piirkondi (ringi, pooltasandit, riba ja sektorit) kujutada konformselt ühikringiks. 10. oskab leida funktsiooni Fourier' ja Laplace'i teisendusi ja pöördteisendusi."}