{"KURSUSE_NIMI": "Mittekorrektsed ülesanded", "KURSUSE_KOOD": "MTMM.00.210", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Funktsionaalanalüüs I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 64, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Vaadeldakse ebastabiilseid ülesandeid, kus väiksed ebatäpsused andmetes viivad suurele veale lahendis. Käsitletakse spetsiaalseid regularisatsioonimeetodeid nende ülesannete lahendamiseks. Põhjalikumalt vaadeldakse regularisatsiooniparameetri valiku probleeme.Objectives/eesmärkid:  Mittekorrektsete ülesannete ja nende lahendusmeetodite tutvustamine.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1.\tteab mittekorrektse ülesande mõistet; 2.\toskab hinnata operaatorvõrrandi lahendi viga ligikaudse vabaliikme korral; 3.\tteab mõisteid Hilberti ruum ja lineaarne, pidev, kompaktne, enesekaasne operaator; 4.\toskab näidata järgmiste ülesannete mittekorrektsust: esimest liiki integraalvõrrandid, nõrga konditsiooniga maatriksiga lineaarsed võrrandisüsteemid, diferentseerimisülesanne, Fourier ridade summeerimine, Dirichlet ülesanne lainevõrrandi jaoks, analüütilise jätkamise ülesanne, Cauchy ülesanne Laplace võrrandi jaoks, soojusjuhtivuse pöördülesanne. 5.\tteab regulariseerimismeetodi ja iseregulariseerimise mõistet ja näiteid; 6.\tteab iseregulariseerimise tingimusi järgmistes projektsioonimeetodites: Galjorkini meetod, vähimruutude meetod, vähima vea meetod; 7.\tteab järgmisi regularisatsioonimeetodeid: Lavrentjevi ja Tihonovi meetod, ilmutatud ja ilmutamata iteratsioonimeetodid, Cauchy ülesande meetod, spektraallõike meetod; teab vastavaid koonduvusteoreeme ja veahinnanguid; 8.\tteab regulariseerimisparameetri valikuks hälbeprintsiipi, modifitseeritud hälbeprintsiipi ja monotoonse vea reeglit, vastavaid koonduvusteoreeme ja veahinnanguid. Kursust ei saa kuulata, kui on juba kuulatud kursus MTMM.00.217 Sissejuhatus mittekorrektsetesse ülesannetesse 3EAP, kuna see on esimene pool käesolevast kursusest."}