{"KURSUSE_NIMI": "Kõrgem matemaatika I", "KURSUSE_KOOD": "MTMM.00.340", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kõrgema matemaatika kursus, milles käsitletakse järgmisi teemasid: maatriksid, determinandid, lineaarvõrrandisüsteemid, funktsioonid, funktsiooni piirväärtus ja pidevus, jadad, funktsiooni tuletis ja diferentsiaal, määramata integraal, määratud integraal, päratud integraalid, lineaarsed I järku diferentsiaalvõrrandid, vektorid ruumis, skalaarkorrutis, vektorkorrutis, sirgeda ja tasandid ruumis, kompleksarvud.Objectives/eesmärkid:  See kursus annab algteadmised kõrgemas matemaatikas. Kursusel on rakenduslik tähtsus loodusteadustes. Õppija arendab arvude ja arvutamisega seotud õpioskusi õpitavate teemade ja ülesandetüüpide lõikes.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane: 1. Teab maatriksi, pöördmaatriksi mõistet ja oskab teostada tehteid maatriksitega ning leida pöördmaatriksit. Oskab arvutada n-ndat järku determinanti, teab determinantide põhiomadusi. 2. Oskab lahendada lineaarseid võrrandisüsteeme. Teab Gaussi meetodit. 3. Teab funktsiooni mõistet, funktsioonide liigitust. Oskab ära tunda põhiliste elementaarfunktsioonide  graafikuid. 4. Oskab arvutada piirväärtust ja teab piirväärtuse põhiomadusi. Teab pideva funktsiooni mõistet. 5. Teab tuletise ja diferentsiaali mõisteid; teab tuletise põhilisi omadusi ja oskab neid leida; teab tuletise ja diferentsiaali tähtsamaid rakendusi; 6. Teab L'Hospitali reeglit ja oskab seda rakendada; 7. Oskab uurida funktsiooni ja teab, mis on kasvavad/kahanevad, kumerad/nõgusad funktsioonid; 8. Teab algfunktsiooni mõistet ja oskab leida määramata integraali lihtsamal juhul; 9. Oskab lahendada I järku lineaarseid diferentsiaalvõrrandeid. 10. Teab, mis on Riemanni summa ja määratud integraal ning oskab neid arvutada. 11. Tunneb määratud integraali rakendusi. 12. Teab päratu integraali mõistet ja oskab neid leida. 13. Oskab leida ruumivektorite skalaarkorrutist, vektorkorrutist, segakorrutist ning teab nende rakendusi. 14. Oskab koostada sirgete ja tasandite võrrandeid ruumis ning leida nende vastastikust asendit. 15. Teab, mis on kompleksarv, selle algebraline, geomeetriline, trigonomeetriline kuju, oskab teostada tehteid kompleksarvudega, teab Euleri valemit. 16. Valib ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid (valemid) ning rakendab neid ülesannete lahendamisel. 1. Antud kursuse korral eeldatakse, et kursusel osaleja on juba enne praktikumi tulles iseseisvalt korralikult läbi töötanud vastava praktikumi teema(d) nii kohustusliku kui soovitusliku ning muu lisaõppematerjalide põhjal, sest praktikumides teooriast eraldi ei räägita ning praktikumide lõpus toimuvad tunnikontrollide küsimused eeldavad antud praktikumiks vajaliku materjali eelnevat iseseisvat läbi töötamist.\n\n2. Eelsalvestatud loengud on Moodle'is, töötada läbi enne vastava teema praktikumi.\n\n3. Praktikumid toimuvad auditoorsetena.\n\n4. Kontrolltööd toimuvad vajadusel (nt ruumi puudumisel) praktikumide tavatoimumistest erineval ajal.\n\n5. Täpsem info hindamisviiside ja hinde kujunemise kohta on saadaval Moodle'is."}