{"KURSUSE_NIMI": "Geomeetria süvendusseminar", "KURSUSE_KOOD": "MTMM.00.142", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 17, "practice": 4, "seminar": 19, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Süstematiseeritakse, ühtlustatakse ja süvendatakse sünteetilise geomeetria-alaseid teadmisi. Planimeetrias tutvutakse punktide kollineaarsuse ja tsüklilisuse ning sirgete konkurentsuse tõestamise meetoditega. Stereomeetrias pööratakse põhitähelepanu kehade ja tasandite lõigete konstrueerimisele.Objectives/eesmärkid:  Süstematiseerida, ühtlustada ja süvendada tulevase matemaatikaõpetaja sünteetilise geomeetria-alaseid teadmisi.Learning outcomes/õpiväljund:  Kursuse läbinu: 1. tunneb klassikaliste konstruktsioonülesannete aluseid ja lubatavaid põhivõtteid; 2. oskab sooritada sirkli ja joonlauaga põhikonstruktsioone (nurga ülekanne ja poolitamine, paralleelid, keskristsirge, lõigu jaotamine antud suhtes, algebraliste avaldistena antud lõigud, ringjooned ja hulknurgad); 3. tunneb kuldlõike mõistet, oskab jaotada lõiku kuldses suhtes ja rakendada seda kõõl- ja puutujahulknurkade konstrueerimisel; 4. oskab konstrueerida ruumilise kujundi tasapinnalist lõiget;  5. teab joonnurkade, kahetahuliste ja mitmetahuliste nurkade mõisteid ning oskab lahendada ülesandeid nende nurkade leidmisele; 6. teab hulktahukate ja pöördkehade liigitamise aluseid ning oskab lahendada nende kujunditega seotud raskemaid ülesandeid; 7. teab põhikonstruktsioonide sooritamiseks ja stereomeetria ülesannete lahendamiseks vajalikke geomeetrilisi põhiseoseid ja oskab neid tuletada. Aines \"Geomeetria süvendusseminar\" toimub reedene õppetöö auditoorses vormis, väljaspool reedet toimub õppetöö Zoomi vahendusel. Soovitatav on omada isiklikke joonestusvahendeid (joonlaud, sirkel, pliiats, kustutuskumm)."}