{"KURSUSE_NIMI": "Diferentsiaalgeomeetria", "KURSUSE_KOOD": "MTMM.00.060", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Diferentsiaalvõrrandid", "Analüütiline geomeetria"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Diferentsiaalgeomeetria kursus on jaotatud kolmeks osaks.  Esimese osa põhimõisted on hüperpinna mõiste ja vektorvälja mõiste. Hüperpind defineeritakse sileda funktsiooni tasemepinna mõiste abil. Esimeses osas vaadeldakse järgmisi struktuure: vektorvälja  integraaljoon ja tema olemasolu, sile vektorväli hüperpinnal, hüperpinna puutujaruum ja orientatsioon, Gaussi kujutus, vektorvälja hüperpinnal kovariantne tuletis, geodeetiline joon hüperpinnal, paralleelvektorväli hüperpinnal ja paralleelülekanne, Weingarteni kujutus, hüperpinna normaalkõverus ja Gaussi kõverus. Teises osas käsitletakse diferentsiaalvorme n-mõõtmelises ruumis R~n. Vaadeldakse diferentsiaalvormide väliskorrutist, välisdiferentseerimist, integreerimist ja diferentsiaalvormi väärtust vektorväljal. Näidatakse seost vektoranalüüsiga. Kolmanda osa põhiobjekt on parameetriline pind. Tõestatakse, et esimeses osas käsitletud hüperpinna mõiste on lokaalselt ekvivalentne parametriseeritud  pinna mõistega (lokaalsed koordinaadid). Vaadeldakse järgmisi struktuure: esimene fundamentaalvorm, minimaalpind, pinna pindala ja ruumala, eksponentsiaalkujutus, Gauss-Bonnet teoreem.Objectives/eesmärkid:  Antud loengute kursuse eesmärk on anda üliõpilastele ettekujutus sellest, millised geomeetriliste objektide uurimismeetodid tekivad diferentsiaal- ja integraalarvutuse baasil. Geomeetria seisukohalt on loengute põhiobjekt hüperpind ja tema uurimismeetodid tuginevad vektorvälja mõistele. Hüperpind on funktsiooni tasemepind ja antud loengute kursuses teda vaadeldakse mistahes dimensiooniga ruumis. Pinna selline käsitlus, kus pind on teatud võrrandi lahendite punktihulk, on väga lähedane teoreetilisele füüsikale ja seetõttu antud loengute kursus võib huvi pakkuda ka füüsika-keemiateaduskonna üliõpilastele.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane:\n1. teab parameetrilise joone ja regulaarse pinna mõisteid;\n2. oskab leida joone kiirusvektorit, kiirendusvektorit, kaarepikkust,\nkõverust ja väänet;\n3. teab, mis on joone loomulik parameeter ja oskab leida joone\nparameetrilist võrrandit, kui parameetriks on           loomulik parameeter;\n4. teab Frenet-Setter-Bartelsi valemeid ja oskab kasutada liikuva reeperi\nmeetodit;\n5. teab, mis on vektorväli ja oskab arvutada vektorvälja kovariantset\ntuletist;\n6. teab, mis on diferentsiaalvorm kolmemõõtmelises ruumis ja oskab arvutada\ndiferentsiaalvormide väliskorrutist ja välisdiferentsiaali;\n7. teab, mis on Weingarteni operaator, ja selle omadusi;\n8. oskab leida regulaarse pinna peakõverust, keskmist kõverust ja Gausi\nkõverust;\n9. teab geodeetilise joone võrrandit ja oskab leida geodeetilist joont\npinnal;\n10. tunneb Gauss-Bonnet teoreemi ja oskab arvutada pinna Euleri\nkarakteristikut."}