{"KURSUSE_NIMI": "Funktsionaalanalüüs I", "KURSUSE_KOOD": "MTMM.00.095", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Hulgateooria ja matemaatiline loogika", "Kõrgem matemaatika II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 40, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Funktsionaalanalüüsi traditsioonilise ülikoolikursuse esimene osa. Teemad: meetrilised ruumid (koonduvus, näited (ka normeeritud ruum), struktuur), täielikud meetrilised ruumid (näited (ka Banachi ruum), põhiteoreemid), pidevad operaatorid (põhimõisted, Banachi püsipunkti printsiip), kompaktsus (klassikaliste matemaatilise analüüsi teoreemide üldistused, kompaktsuse kriteeriumid), sissejuhatus topoloogilistesse ruumidesse, read normeeritud ruumides, pidevate lineaarsete operaatorite ruum, lõplikumõõtmelised normeeritud ruumid.Objectives/eesmärkid:  Kohustuslik aine matemaatika erialal. Sobib valikaineks matemaatilise statistika ja arvutiteaduse erialal ning õpetajakoolituses. Matemaatika eriala magistriõppe eeldusaine. Eesmärgiks on anda üliõpilastele alusteadmised ja -oskused funktsionaalanalüüsi alal. Kriitilise mõtlemise oskuse toetamine, matemaatilise suulise eneseväljendusoskuse arendamine. Toetada õppijat suuliseks eksamiks valmistumisel. Funktsionaalanalüüs on intensiivselt arenev fundamentaalne matemaatikaharu, mis leiab rakendamist arvutusmatemaatikas, diferentsiaal- ja integraalvõrrandite teoorias, teoreetilises füüsikas, tõenäosusteoorias jm.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilased on omandanud alusteadmised ja -oskused funktsionaalanalüüsi alal. Seejuures tunnevad nad järgmiseid põhimõisteid ja oskavad tõestada nende kohta käivaid põhitulemusi: meetrilised ruumid (koonduvus, näited), täielikud meetrilised ruumid, pidevad operaatorid, kompaktsus, read normeeritud ruumides, pidevate lineaarsete operaatorite ruum, lõplikumõõtmelised normeeritud ruumid. Üliõpilased valivad ülesannete lahendamiseks sobivad matemaatilised kontseptsioonid ning rakendavad neid ülesannete lahendamisel; uurivad ja koostavad loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames; on arutlenud suulisel lõpueksamil matemaatiliste kontseptsioonide olemuse, tõestuse ja näidete üle. ."}