{"KURSUSE_NIMI": "Kõrgem matemaatika II", "KURSUSE_KOOD": "MTMM.00.341", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõrgem matemaatika I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Vektorruumid, vektorite lineaarne sõltumatus. \nArvread, astmeread ja Fourier' read. \nMitme muutuja funktsioonide diferentsiaal- ja integraalarvutus. Kordsed integraalid. Mitme muutuja funktsioonide ekstreemumite leidmine, optimiseerimine. Harilikud diferentsiaalvõrrandid, osatuletistega diferentsiaalvõrrandid.Objectives/eesmärkid:  Vektorruumi, alamruumi ja vektorite lineaarse sõltuvuse mõistete omandamine. Mitme muutuja funktsioonide diferentsiaal- ja integraalarvutuse aluste omandamine. Diferentsiaalvõrrandite lahendusoskuse omandamine. Üliõpilaste matemaatilise mõtlemisoskuse arendamine.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Selle kursuse läbinud üliõpilane:\n1. Oskab defineerida vektorruumi, vektorruumi alamruumi ja vektorite lineaarset sõltuvust ning lahendada vastavaid ülesandeid.\n2. Oskab defineerida arvrida ja astmerida ning lahendada ülesandeid arvridade koondumise kohta.\n3. Oskab defineerida ja leida osatuletisi ja täisdiferentsiaali mitme muutuja funktsioonile.\n4. Oskab defineerida ja leida kahe- ja kolmekordseid integraale, teab põhilisi kordsete integraalide rakendusi.\n5. Oskab defineerida ja leida kahe muutuja funktsiooni ekstreemumeid, tunneb Lagrange'i meetodit.\n6. Teab hariliku diferentsiaalvõrrandi mõistet, oskab defineerida ja lahendada eralduvate muutujatega võrrandit, homogeenset ja eksaktset võrrandit, lineaarset esimest ja teist järku diferentsiaalvõrrandit. \n7. Teab osatuletistega diferentsiaalvõrrandi mõistet, oskab lahendada lihtsamaid osatuletistega diferentsiaalvõrrandeid. Aine loengud toimuvad auditoorselt. Loengutele lisaks on eelsalvestatud videod loengus käsitletavate teemade kohta."}