{"KURSUSE_NIMI": "Matemaatiline maailmapilt", "KURSUSE_KOOD": "MTMM.00.342", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 64, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lausearvutuse põhimõisted: loogilised tehted, samaselt tõesed valemid, samaväärsed valemid, valemite järeldumine, täielik disjunktiivne normaalkuju. Hulgateooria põhimõisted: hulk, tehted hulkadega, seosed, ekvivalentsusseosed ja klassijaotused, hulga võimsus, järjestatud hulgad. Funktsiooni injektiivsus, sürjektiivsus, bijektiivsus. Arvuteooria põhimõisted: jaguvus, jäägiga jaguvus, aritmeetika põhiteoreem, algarvude hulga lõpmatus.Objectives/eesmärkid:  Üliõpilastele esmaste teadmiste andmine kaasaegse matemaatika üldistest mõistetest, nende kasutamisharjumuste treenimine. Kriitilise mõtlemise oskuse toetamine, matemaatilise suulise eneseväljendusoskuse arendamine.Learning outcomes/õpiväljund:  Peale kursuse läbimist üliõpilane 1. tunneb põhilisi lausearvutuse, hulgateooria ja arvuteooria mõisteid 2. oskab neid kasutada lihtsamate ülesannete lahendamisel 3. on ette valmistunud nende mõistete kasutamiseks teistes õppeainetes 4. oskab seostada lausearvutuse tehteid loomuliku keele lausetega 5. on tutvunud erinevate tõestusmeetoditega 6. tunneb põhilisi funktsioonide ja seostega seotud mõisteid ja oskab neid kasutada ülesannete lahendamisel 7. tunneb hulkade võimsusega seotud mõisteid, oskab määrata lihtsamate hulkade võimsuseid 8. uurib ja koostab loogilisi arutelusid kursuse käigus õpitud matemaatiliste kontseptsioonide raames 9. on arutlenud suulisel vaheeksamil ja lõpueksami suulises osas matemaatilise kontseptsiooni olemuse, tõestuse ja näidete üle This English syllabus is choosable only for students of non-Estonian curricula, who do not speak Estonian. All Estonian-speaking students should choose Estonian syllabus of the same course."}