{"KURSUSE_NIMI": "Topoloogilised vektorruumid", "KURSUSE_KOOD": "MTMM.00.074", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 156, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb topoloogiliste vektorruumide üldisi omadusi, kusjuures põhitähelepanu on pööratud lokaalselt kumeratele ruumidele. Vaadeldakse nende topologiseerimist poolnormide abil. Tõestatakse üldisel kujul Hahn-Banachi teoreem, millest saadakse järeldustena rida teoreeme hulkade eraldatavusest lokaalselt kumeras ruumis. Suure osa kursusest moodustab duaalsuseteooria. Käsitletakse ühtlase koonduvuse topoloogiaid, mille tähtsamad erijuhud on Mackey topoloogia ja tugev topoloogia. Viimasega seoses vaadeldakse tünniruume, nende erijuhuna F-ruume. Tõestatakse rida klassikaliste teoreemide üldistusi (ühtlase tõkestatuse printsiip, lahtise kujutuse printsiip, teoreem kinnisest graafikust).Objectives/eesmärkid:  Eesmärgiks on anda sissejuhatus topoloogiliste vektorruumide teooriasse ja tutvustada üliõpilasi selle teooria tähtsamate uurimismeetoditega.Learning outcomes/õpiväljund:  Selle kursuse läbinud üliõpilane 1) oskab defineerida topoloogilist vektorruumi (TVR),  teab tõkestatud ja kompaktsete alamhulkade omadusi  TVR-s; oskab kirjeldada metriseeruvaid TVR-e;  2) teab kumerate ja absoluutselt kumerate hulkade ning poolnormide omadusi TVR-s; teab Hahn-Banachi teoreemi ja kumerate hulkade tähtsamaid eraldamisteoreeme; 3) oskab kirjeldab lokaalselt kumeraid topoloogiaid vektorruumis nulliümbruste prebaasi ja poolnormide süsteemi abil);  teab Kolmogorovi teoreemi LKR-i  normeeruvusest; oskab tõestada, et eralduva LKR-i kaasruum eraldab punktid selles ruumis; 4) teab antud duaalse paari puhul määratud nõrga topoloogia omadusi; teab teoreemi bipolaarist ja polaartopoloogiate mõistet; teab Mackey-Arensi teoreemi tugevaimast antud duaalsusega kooskõlas olevast polaartopoloogiast ja Mackey teoreemi tõkestatud hulkadest; 5) teab tünniruumi mõistet ja nende ruumide tähtsamaid omadusi; teab lahtise kujutuse printsiipi, teoreemi kinnisest graafikust ja ühtlase tõkestatuse printsiipi F-ruumide kontekstis. Võimalikud seminariteemad: \na) 1. Meetriseeruvad TVR-d (4.1). 2. Lõplikumõõtmelised TVR-d (4.2)\nb) 1. Poolnormid ja Minkowski funktsionaalid (5.2). 2. Hahn-Banachi teoreem (6.1, 6.2)\nc) 1. Eraldamisteoreemid (6.3). 2. Lokaalselt kumer ruum (7.1)\nd) 1. Polaarid. Teoreem bipolaarist (8.3). 2. Võrdpidevad hulgad ja polaartopoloogiad (9.1)\ne) 1. Mackey topoloogia (9.2). 2. Mackey teoreem tõkestatud hulkadest (9.3)\nf) 1. Tugev topoloogia ja tünniruum. Ühtlase tõkestatusse printsiip (10.1). 2. F-ruum. Lahtise kujutuse printsiip (10.2)\ng) 1. Teoreem kinnisest graafikust (10.3)"}