{"KURSUSE_NIMI": "Statistiline andmeteadus ja visualiseerimine", "KURSUSE_KOOD": "MTMS.01.100", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Rakendustarkvara: R", "Tõenäosusteooria ja statistika II"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 18, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Rakenduslik statistikaaine, kus õpitakse andmeanalüüsi automatiseerima ning analüüsitulemusi visualiseerima. \nÕppeaines kasutatakse probleemipüstitusena erinevaid päriselulisi andmestikke. Et püstitatud küsimustele vastust leida, rakendatakse sobivaid statistilisi meetodeid. Saadud tulemuste teistele kommunikeerimiseks illustreeritakse neid sobivate joonistega.Objectives/eesmärkid:  Õppeaine eesmärgid on järgnevad:  * Tutvustada üliõpilastele, milliseid huvitavaid probleeme saab statistika abil lahendada erinevates valdkondades (näiteks bioteadustes ja majanduses), ning harjutada nende lahendamist. * Õppida visualiseerimismeetodeid andmetest ülevaate saamiseks, tulemuste tõlgendamiseks ja nende sisu edasi andmiseks.  * Tutvustada tarkvara R võimalusi reprodutseeritava analüüsi läbiviimiseks ning tulemuste visualiseerimiseks.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane:\n* on kokku puutunud reaalsete probleemidega, mille lahendamiseks tuleb rakendada statistilisi meetodeid; \n* on kursuse käigus kinnistanud eelnevalt õpitud statistika põhiteadmisi; \n* oskab rakendada sobivat analüüsimeetodit, mille abil vastata püstitatud küsimusele;\n* teab, mis on reprodutseeritav analüüs, miks see on tähtis ja oskab kasutada vahendeid, mis aitavad analüüsi hõlpsasti reprodutseeritavaks teha (knitr, markdown);\n* oskab visualiseerida analüüsi tulemusi efektiivselt (muuhulgas oskab kasutada paketti ggplot2 staatiliste graafikute tegemiseks ning paketti shiny interaktiivsuse lisamiseks).\n* oskab valida tulemuste visualiseerimiseks sobiva lahenduse ja põhjendab seda Loengute asemel on ette nähtud iganädalane iseseisev töö. See võib sisaldada mõne artikliga tutvumist, veebiloengu vaatamist vms. Arutelu iseseisvalt õpitu kohta ning praktikumid toimuvad klassiruumis."}