{"KURSUSE_NIMI": "Valikuuringute teooria I", "KURSUSE_KOOD": "MTMS.01.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Tõenäosusteooria ja statistika II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 28, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selles aines tutvutakse põhiliste tõenäosuslike valikumeetoditega. Koos tõestustega antakse tulemused (hinnangud, nende dispersioonid ja dispersioonihinnagud) üldkogumi ja osakogumi kogusumma ning keskmise ja osakaalu hindamiseks. Neid tulemusi vaadeldakse nii üldjuhul kui ka konkreetsete valikudisainide korral. Samuti käsitletakse suhte hindamist ning andmekadu. Arvutipraktikumide eesmärgiks on loengute materjali rakendamine praktilistes ülesannetes (selleks kasutatakse hüpoteetilise küla StatVillage andmeid).Objectives/eesmärkid:  Aine eesmärgiks on - anda ülevaate valikuuringute valdkonna põhimeetoditest ja printsiipidest; - tutvustada erinevaid valimi võtmise viise ja nende tõenäosuslikku olemust;  - anda oskus üldkogumi põhiparameetrite hindamiseks disaini-põhiste hinnangute abil.Learning outcomes/õpiväljund:  Aine läbinud  üliõpilane  - mõistab tõenäosusliku valiku olemust ja tunneb erinevaid valimi võtmise viise (lihtne juhuvalik tagasipanekuga ja tagasipanekuta, ebavõrdsete tõenäosustega valik, süstemaatiline valik, kiht- ja klastervalik, kaheastmeline valik); - teab disainipõhist nihketa hinnangut kogusumma ja keskväärtuse hindamiseks üldjuhul koos hinnangu omadustega ja oskab seda rakendada konkreetse valimidisaini korral; - on võimeline rakendama üldiseid tulemusi osakogumi kogusumma ja osakaalu hindamisel; - teab suhtetüüpi hinnangut ja selle omadusi; - tunneb üldiseid meetodeid kao kompenseerimiseks andmetes; - oskab rakendada õpitut reaalsete andmete korral vastava tarkvara abil"}