{"KURSUSE_NIMI": "Üldistatud lineaarsed mudelid", "KURSUSE_KOOD": "MTMS.01.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Tõenäosusteooria ja statistika II"], "SOOVITUSLIKUD_EELDUSAINED": ["Matemaatiline statistika I", "Andmeanalüüs II", "Lineaarsed mudelid", "Matemaatiline statistika II", "Maatriksid statistikas"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 34, "practice": 30, "seminar": 0, "independent_work": 92, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Üldistatud lineaarne mudel on klassikalise lineaarse regressiooni paindlik üldistus, kus uuritav tunnus ei pea tingimata olema normaaljaotusega. Jaotuste eksponentsiaalse pere defineerimisega koondatakse ühe nimetuse alla lai klass mudeleid, mille jaoks on välja töötatud  ühtlustatud lähenemine suurima tõepära meetodi hinnangute leidmiseks.\n\nÜldistatud lineaarseid mudeleid võib nimetada \"kõige arenenumaks lihtsate mudelite klassiks\": nad on palju keerukamad tavalisest lineaarse regressiooni mudelist, aga säilitavad siiski tõlgendatavuse. Tõlgendatavus on üldistatud lineaarsete mudelite põhieelis veel keerukamate mudelite klasside ees ja seetõttu on nad heaks võrdlusaluseks paljudele masinõppe mudelitele, mille prognoosivõime võib olla parem, aga mille tõlgendamine ei ole enam ei lihtne ega selge.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada ja selgitada üldistatud lineaarsete mudelite teoreetilisi aluseid (eksponentsiaalne pere ja sellesse kuuluvad jaotused, seosefunktsioon ja vastavusfunktsioon, suurima tõepära hinnang, Fisheri skoorid, jpm) ja anda reaaleluliste näitete lahendamisega osalejatele praktilist kogemust. Praktilise osa eesmärk sisaldab endas kahte statistilise modelleerimise põhiaspekti. * Tehniline aspekt: osalejad õpivad (üldistatud lineaarseid) mudeleid andmetele rakendama, mudelite vahel valima, diagnostikat tegema ja kõige eelmainitu matemaatilist tausta; * Tõlgendamise aspekt (äriline aspekt): statistilise modelleerimise protsess ei lõpe parima mudeli valikuga, seda mudelit peab oskama kriitiliselt hinnata, tõlgendada, tulemusi kommunikeerida ja selle põhjal järeldusi teha.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane  - tunneb eksponentsiaalse jaotuste pere jaotusi ning nende jaotuste põhiomadusi, oskab neid jaotusi modelleerimisel kasutada  - oskab vastavalt uuritava tunnuse jaotusele määrata üldistatud lineaarse mudeli kuju (seose- või vastavusfunktsiooni abil)  - oskab hinnata mudeli sobivust ja lahendada sellega seonduvaid probleeme (ülehajuvus jms)  - oskab vastavalt probleemile valida sobiva mudelite klassi, hinnata mudelite parameetreid, kriitiliselt tõlgendada tulemusi ja analüüsida seost praktikaga"}