{"KURSUSE_NIMI": "Sisemeditsiini praktika", "KURSUSE_KOOD": "MV00.00.003", "EAP": 12, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 312}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sisemeditsiini praktika kestab 8 nädalat, mida võib sooritada ühes või erinevates sisehaiguste osakondades. Sisemeditsiini praktika raames saab tudeng arstiabina tegeleda arstile vajalike praktiliste oskuste õppimise ja täiendamisega ning lihtsamate protseduuride läbiviimisega. Juhendaja abil saab harjutada haige uurimist, diagnoosi tegemist, raviplaani koostamist, haige pika-aegse käsitluse koostamist, haigusjuhu andmete dokumenteerimist ning kolleegidele haigusjuhu ettekandmist. Praktikant võtab osa osakonnas ja kliinikus toimuvatest seminaridest, konverentsidest. Praktika käigus tuleb täita praktikapäevikut ja teha sisehaigete kohta epikriisid.\nÜliõpilasel on kohustus lahendada sisemeditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust. Küsimuste lahendamist kontrollitakse semestri lõpus.Objectives/eesmärkid:  Sisemeditsiini praktika üldiseks eesmärgiks on stuudiumi jooksul omandatud teoreetiliste teadmiste integreerimine praktilisse meditsiini arstiabi praktika raames, millega saab alustada pärast 5. kursuse kohustuslike kliiniliste õppeainete läbimist. Sisemeditsiini praktika peamisteks eesmärkideks on: -\tsisemeditsiini-alaste teadmiste täiendamine, sisemeditsiini-alase terminoloogia kasutuse arendamine ning meditsiinilise dokumenteerimisoskuste õppimine; -\tsisehaige objektiivse uurimise ja lihtsamate uuringute läbiviimise oskuste täiendamine ning haige kliinilise seisundi dünaamilise jälgimisoskuse õppimine;  -\tsagedasemate sisehaiguste diagnoosimise algoritmide ja võimalustega tutvumine ning individuaalsete  haigete korral erinevate uuringute ratsionaalse valiku tegemise õppimine;  -\tsagedasemate sisehaiguste kaasaegsete ravijuhendite ja praktilise käsitlusega tutvumine ja nende kohandamise õppimine konkreetsetel haigetel; -\thaigete monitooringu järjepidevuse tagamise õppimine ja suhtlemisoskuste arendamine kolleegidega.Learning outcomes/õpiväljund:  Praktikal osalenud üliõpilane: -\ton võimeline sisehaiget uurima, määrama ratsionaalselt diferentsiaaldiagnostilisi uuringuid individuaalsele haigele ja hindama uuringute tulemusi ning tegema lihtsamaid uuringuid; -\ton õppinud tundma sagedasemate sisehaiguste käsitlust, meditsiiniterminoloogiat ja lõpliku kliinilise diagnoosi formuleerimist; -\ton tutvunud sisehaiguste ravijuhenditega ning suudab määrata ravi sisehaigele kasutades vajadusel kirjandust; -\tsuudab ette kanda haige käsitlust kolleegidele kasutades vajalikku meditsiiniterminoloogiat, dokumenteerida haigusjuhu andmeid ja vormistada haigusjuhu kohta epikriisi."}