{"KURSUSE_NIMI": "Erakorralise meditsiini praktika", "KURSUSE_KOOD": "MV00.00.006", "EAP": 12, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 312}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "EM praktika põhitähelepanu on pööratud erakorraliste seisundite esmasele diagnostikale ja ravile erakorralise meditsiini osakonnas. Osalemise eelduseks on arstiõppe viie esimese kursuse läbimine. Üliõpilased õpivad tundma erakorralise meditsiini organisatsiooni ja patsientide tiraaži põhimõtteid, omandavad kliinilise kogemuse ja praktilised oskused erakorraliste haigete esmasel haiglakäsitlusel. \nÜliõpilasel on kohustus lahendada erakorralise meditsiini tsükli jooksul minimaalselt 100 AMBOSSi õppeplatvormi vastava eriala küsimust. Küsimuste lahendamist kontrollitakse semestri lõpus.Objectives/eesmärkid:  Erakorralise meditsiini praktika eesmärk on omandada praktilised oskused ja teadmised erakorraliste haigete esmasel käsitlemisel erakorralise meditsiini osakonnas. Õpitakse tundma erakorralise meditsiini korraldust, sh haigete tiraaži põhimõtteid, omandatakse praktilist kogemust erinevate erakorraliste seisundite diferentsiaaldiagnostikas ja esmases ravis. Omandatakse erakorralise kirurgilise haige (sh raske trauma) ja kriitiliste seisundite esmase käsitluse põhimõtted.Learning outcomes/õpiväljund:  EM praktika läbinud üliõpilane -\torienteerub erakorralise meditsiini korralduses, tunneb erakorralise meditsiini osakonna haigete tiraaži põhimõtteid ja oskab määrata tiraaži kategooria -\toskab koguda haiguse, trauma ja mürgistuse anamneesi, teostada patsiendi objektiivse uurimise ja hinnata patsiendi elulisi näitajaid -\toskab teostada lihtsamaid kliinilisi protseduure ja uuringuid ning tõlgendada nende tulemusi (vt. praktilised oskused kliinilise praktika päevikus) -\ttunneb kriitilises seisus patsiendi esmase käsitluse põhimõtteid (kliiniline surm, raske trauma, eluohtlik südame rütmihäire, äge koronaarsündroom,  äge hingamispuudulikkus, äge neerupuudulikkus, kooma ja šokk) -\tteab, kuidas täita arstliku dokumentatsiooni erakorralise meditsiini osakonnas"}