{"KURSUSE_NIMI": "Patoloogiline anatoomia", "KURSUSE_KOOD": "MVBS.10.001", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Meditsiiniline biokeemia", "Inimese füsioloogia", "Meditsiiniline mikrobioloogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 20, "independent_work": 104, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab olulisematest haiguslikest protsessidest ja haiguslikest muutustest teoreetilise ja praktilise baasteabe, mis on vajalik kõigi kliiniliste distsipliinide järgnevaks omandamiseks. Aines õpitakse üldpatoloogiliste protsesside (rakukahjustus, adaptatsioon, paranemisprotsessid, põletik, vereringehäired) ja kasvajate patogeneesi ja morfoloogia põhialuseid ning nende praktilist tähendust levinumate haiguste korral, sealhulgas südame-veresoonkonnahaigused, põletikud ja kasvajalised haigused.\nTeoreetilisi teadmisi õpitakse rühmatöö seminarides ja iseseivalt õpiku ning Moodle õppeinfosüsteemi baasil konspektide, videoloengute ja enesetestide abil. Mikroskoopiliste muutuste õppimine toimub digitaalsete histopreparaatide alusel, mis on kättesaadavad Moodle süsteemis koos õppevideotega teemade kaupa grupeeritud andmebaasidena. Praktikumides toimub iseseisvalt omandatud teabe kinnistamine ja seostamine haigusprotsessidega ning kliiniliste tähendustega.  Makroskoopiliste muutuste põhiline õpe toimub praktikumides natiivsete preparaatide alusel. Teoreetiliseks kordamiseks on Moodles loodud makropreparaatide kirjelduste andmebaas. Praktikumides ja seminarides harjutatakse suuliste vastuste ja grupitegevustena juhupõhiste patomorfoloogiliste muutuste kirjeldamist, analüüsi ja integreerimist diagnoosihüpoteeside püstitamisse.\nPraktikumides ja seminarides osalemine on kohustuslik. Üliõpilased peavad tähtajaks olema sooritanud kõik testid, arvestused ja praktilised ülesanded.Objectives/eesmärkid:  Patoloogilise anatoomia õppeaine eesmärgiks on anda integreeritud teoreetilisi ja praktilisi teadmisi haiguste põhjustest (etioloogiast), nende toimel haiguse kujunemist (patogeneesist) ning haiguseprotsessis tekkivatest struktuurilistest (patomorfoloogilistest) muutustest organismais ja organites. Õppimise käigus saab üliõpilane ülevaate haigustunnuste uurimisest, tulemuste interpreteerimisest, mõistab seoseid haiguslike muutuste ja kliiniliste avalduste vahel, kujundades seoselist arstlikku mõtlemist. Õppeaine annab 4.-5.õppeaasta kliinilisteks tsükliteks vajalikud teadmised patoloogilisest anatoomiast ja on osaks ettevalmistusest tööks üldarstina.Learning outcomes/õpiväljund:  Õppeaine läbinu vähemalt miinimumhindele teab patoanatoomias kasutatavaid mõisteid, definitsioone ja olulisemaid diagnoose; oskab luua seoseid makro- ja mikroskoopiliste patomorfoloogiliste muutuste ja nende tekkemehhanismide ning kliiniliste sümptomite ja organismi talituslike tagajärgede vahel;  formuleerib loogiliselt haiguste patogeneetilisi põhjendusi; suudab eristada levinumatele haigustele iseloomulikke patomorfoloogilisi muutusi normist ja püstitada diagnoosihüpoteese; omab meeskonnatöökogemust; on kohaemisvõimeline ja valmis ennast edasi arendama."}