{"KURSUSE_NIMI": "Seedetraktihaiguste puhune toitmine", "KURSUSE_KOOD": "MVCM.13.006", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 30, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kasutatakse erinevaid õpetamismeetodeid.. Mitu korda nädalas oodatakse üliõpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmete kallal. Üliõpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühma liikmetena. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitmisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Nagu varemgi, testitakse õppijaid mitteametlikult lühikeste interaktiivsete viktoriinidega.  Seedetrakti normaalne töö on normaalse toitmise jaoks hädavajalik. Haigus mõjutab tarbimist, seedimist, imendumist ja võib põhjustada ebanormaalseid kaotusi. Kõik need on kaetud. Samuti õpetatakse seedetrakti peamisi haigusi.Objectives/eesmärkid:  Eesmärk on, et üliõpilane saaks kindlalt aru seedetrakti normaalsest toimimisest ja sellest, kuidas haigus põhjustab toitumisprobleeme. Üliõpilasel aidatakse mõista ja põhjendada enteraalse toitmise ülimuslikkust, kuid ta suudab ennustada, millal on parenteraalne toitmine vajalik. Analüüsides väga erinevaid seedetrakti haigusi, näeb õpilane enamikku võimalustest, kuidas häiritud funktsioon põhjustab vale toitumist.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane:  * mõistab seedimise ja imendumise füsioloogiat * oskab neid teadmisi rakendada seedetrakti haiguste patofüsioloogia mõistmisel * mõistab enteraalse toitumise paremuse teaduslikku alust * teab lühikese soole sündroomi tagajärgi ja selle toitumise juhtimist * tunneb kõigi peamiste soole- ja kõhunäärmehaiguste korral vajalikke toitmisalaseid sekkumisi"}