{"KURSUSE_NIMI": "Hüpermetabolismiga seotud seisundid", "KURSUSE_KOOD": "MVCM.13.008", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 30, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Iga õppepäev sisaldab erinevaid õpetamismeetodeid. Mitu korda nädalas oodatakse üliõpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmetega. Üliõpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühmaga. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitumisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Nagu varemgi, testitakse õppijaid mitteametlikult lühikeste interaktiivsete viktoriinidega. See moodul hõlmab enamiku hingamisteede ja neuroloogiliste haiguste toitumist. Nad on rühmitatud, kuna nendes tingimustes esineb sageli hüpermetabolismi, kuid kursusematerjal hõlmab ka neid haigusi, kus hüpermetabolism pole peamine omadus.Objectives/eesmärkid:  Eesmärk on, et õpilane mõistaks selgelt hüpermetabolismi ja selle esinemist. Oluline on mõista, kuidas see muudab energiavajaduse standardsed ennustavad võrrandid kehtetuks ja kuidas leida alternatiivseid lahendusi. Üliõpilasel aidatakse rakendada arusaama kalorimeetriast ja töötada välja asjakohased toitumiskavad mõjutatud patsientidele. Üliõpilane saab ka teiste hingamisteede ja neuroloogiliste seisundite ning nende toitumisalase juhtimise alase koolituse.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: * mõistab hüpermetabolismiga seotud patofüsioloogiat * oskab neid teadmisi rakendada hingamisteede ja neuroloogiliste haiguste ning raskete põletushaavade patofüsioloogia mõistmisel * mõistab nende patsientide energiavajaduse hindamise raskuste aluseks olevat teadust * tunneb vajalikke toitumisalaseid sekkumisi"}