{"KURSUSE_NIMI": "Laborimeditsiin", "KURSUSE_KOOD": "MVCM.13.015", "EAP": 8, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 42, "practice": 4, "seminar": 54, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Laborimeditsiin õppeaine (8 EAP) koosneb järgmistest alamoodulitest: kvaliteet ja metroloogia (1 EAP), kliiniline keemia (2 EAP), mikrobioloogia ja viroloogia (2 EAP), molekulaarsed ja rakubioloogilised meetodid laborimeditsiinis (2 EAP), eripatoloogia (1 EAP). \nÕppeaine annab põhilise ülevaate tänapäevase haiglalabori  kvaliteedi põhimõtetest, alamoodulite valdkonnas  tehtavatest analüüsidest ja metoodikatest. Lisaks metoodikatele saavad üliõpilased vajaliku ülevaate teguritest mis võivad mõjutada analüüsimeetodeid ja analüüsitulemust.Objectives/eesmärkid:  Üliõpilane omandab algteadmised ja esmased praktilisi oskuseid haiglate laboris kasutusel olevatest analüüsimeetoditest, nende kvaliteedikontrolli võimalustest, sagedasematest preanalüütilistest ja analüütilistest teguritest, mis võivad mõjutada tulemust ning andmekaitse ja meditsiinilabori eetika printsiipidest.Learning outcomes/õpiväljund:  1.\tTeab olulisemaid kliinilises laboris kasutatavaid analüüsimeetodeid ja nende asutamisvajadust\n2.\tTeab olulisemaid tegureid mis mõjutavad analüüsiprotsessi ja analüüsitulemust\n3.\tOskab kirjeldada ja võrrelda erinevaid analüüsimeetodeid\n4.\tViib läbi erinevate meetodite võrdlust ja verifitseerib meetodeid\n5.\tTeab valideerimise aluseid\n6.\tTunneb laboratooriumite tööprotsesside korralduse aluseid ja riskihindamist laboris.\n7.\tTõlgendab kvaliteedikontrolli tulemusi ja teab analüüsi mõõtetulemuste tõlgendamise aluseid.\n8.\tSuudab ette kanda ja oskab edasi anda omandatud teadmisi teistele laboritöötajatele.\n9.     Teab erialasõnavara ning oskab ennast väljendada erialalises keeles.\n10.   Teab andmekaitse ja meditsiinilabori eetika põhiprintsiipe. \n11.   Oskab teha meeskonnatööd. Arvestuse saamiseks on vajalik osalemine kõigis loengutes, seminarides/praktikumides, tuleb sooritada moodli keskkonnas kohustuslikud enesetestid ja  iseseisvad kodutööd vastavalt seatud lävenditele."}