{"KURSUSE_NIMI": "Metaboolne sündroom ja rasvumine, sport ja toitumine ja anorexia nervosa", "KURSUSE_KOOD": "MVCM.13.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 30, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kasutatakse erinevaid õpetamismeetodeid. Mitu korda nädalas oodatakse õpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmetega. Õpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühmaga. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitmisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Nagu varemgi, testitakse õppijaid mitteametlikult lühikeste interaktiivsete viktoriinidega.  Metaboolne sündroom, rasvumine ja diabeet on rahvusvahelises epideemias koos. Selles moodulis võetakse arvesse nende mõju kliinilisele toitumisele. Samuti käsitletakse spordimeditsiini eripära tippsportlastele.Objectives/eesmärkid:  Eesmärk on, et üliõpilane mõistaks selgelt metaboolset sündroomi ja rasvumist. Nende tähtsust peaaegu kõigis mittenakkushaiguste aspektides tõstetakse esile ja asetatakse rahvatervise perspektiivi. Moodul kasutab toitumianalüüsi spordis, et rõhutada nii normaalse anabolismiga füüsilise tegevuse kui ka spetsiifiliste toitumisalaste probleemide tähtsust tippsportlastele. Anorexia nervosa ja muude söömishäiretega õpilaste uuringu eesmärk on suurendada usaldust selle kompleksiga patsientide ravis ja näidata nende haiguste olemust, kus ülekaalus on puhas nälgimine.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: * tunneb rasvumise alatoitumise probleeme * mõistab metaboolse sündroomi patofüsioloogiat * suudab neid teadmisi rakendada nende patsientide jaoks sobiva dieedi väljatöötamisel * tunneb kõrgetasemelise spordi toitumisalaseid väljakutseid * on teadlik toitumissoovituste juhtimisest toiduallergia ja anorexia nervosa korral"}