{"KURSUSE_NIMI": "Nutraceutics, kodune kunstlik toitmine, toitmisalase abi rahalised aspektid", "KURSUSE_KOOD": "MVCM.13.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 30, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kasutatakse erinevaid õpetamismeetodeid. Mitu korda nädalas oodatakse üliõpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmetega. Üliõpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühmaga. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitmisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Nagu varemgi, testitakse õppijaid mitteametlikult lühikeste interaktiivsete viktoriinidega. Selle mooduli põhirõhk on toitmisalase toetuse korraldamisel. Seetõttu sisaldab see vajalikku planeerimist kunstliku toitmise korraldamiseks patsiendi kodus. Samuti tutvustatakse toitmise ja toitmisalase toetuse finantsaspekte.Objectives/eesmärkid:  Eesmärk on, et üliõpilane mõistaks nutraceutics mõistet ja oleks teadlik nende potentsiaalist (positiivsest ja negatiivsest). Eesmärk on, et üliõpilane peaks olema võimeline edukate toitumisalaste tugiteenuste pakkumise kommenteerijana tegutsema nii institutsioonides kui ka kogukonnas laiemalt. On hädavajalik, et see hõlmaks mõningate finantsalaste teadmiste arendamist, kuna see on nii sageli oluline ravivõimalusi piirav tegur.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: * mõistab nutraceuticals (toitained, mida kasutatakse justkui uimastitena) aluseks olevat loogikat ja oskab määrata uute näitajate väärtust * on kursis koduse enteraalse toitmise ja koduse parenteraalse toitmise plaanide koostamisega * oskab tulevaste patsientide jaoks sellises planeerimises aktiivselt osaleda * omab erinevate toitesegude kulude ülevaadet ja oskab koostada kliinilise praktika jaoks vajalikke kalkulatsioone"}