{"KURSUSE_NIMI": "Laserravi dermatoloogias. Põhiülevaade", "KURSUSE_KOOD": "MVCM.07.005", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 1, "colloquium": 0, "web_learning": 0, "independent_work": 15, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praegu on lasermeditsiini vallas üks kiiremini kasvavaid valdkondi lasertehnoloogia dermatovenereoloogias. Nahaarsti käes olev laser võimaldab teha nii täpseid manipulatsioone, mida varem teha ei saanud. See seisnes selektiivse fototermolüüsi teooria väljatöötamises, põhinedes laservalguse energia selektiivsel neeldumisel rakkude poolt, mis viib bioloogiliste koekomponentide hävimiseni, kahjustamata ümbritsevaid struktuure. Soovitud efekti saavutamiseks peab arst õigesti valima sobiva valguse lainepikkuse, kokkupuute kestuse ja piisava kiirguse intensiivsuse. Kvalifitseeritud dermatoveneroloogi ettevalmistamine on võimatu ilma mitmete kaasaegsete tehnikate, sealhulgas lasertehnoloogia põhitõdede valdamiseta. Kuigi laseri kasutamisega dermatoloogias on suurepäraseid tulemusi saavutatud, on see spetsiaalne ravimeetod pidevas arengus. Praeguseks on väljatöötamisel uued seadmed erinevate haiguste raviks, samas kui juba kasutusel olevad laserid on muutunud turvalisemaks, efektiivsemaks ja kasulikuks ka paljude muude häirete ravis. Aine läbimisel õpitakse erinevaid tehnikaid kasutades lasereid dermatoloogias. Selle aine eesmärk on tõsta dermatoveneroloogide erialase ettevalmistuse taset Eestis.Objectives/eesmärkid:  Anda õpilastele ajakohast teavet laserite kasutamise võimaluste kohta dermatoloogias, laserkiirguse mõju põhimõtetest bioloogilistele kudedele. Anda praktiline ülevaade enamlevinud dermatoloogilistest laserprotseduuridest, analüüsides näidete abil laserravi võimalusi nahaarsti igapäevatöö osana. Tutvustada tudengitele erinevate nahakasvajate, veresoonte väärarengute, pigmenteerunud, armide lasereemaldamise võimalusi, samuti terapeutilisi laserprotseduure dermatoloogias.Learning outcomes/õpiväljund:  Kursuse tulemusena saavad õpilased aru lasermeditsiini rollist dermatoloogilises praktikas, laserkiirguse ja bioloogiliste kudede vastasmõju olemusest, omavad ettekujutust peamistest laserprotseduuridest, mida kasutatakse veresoonte väärarengute, nahakasvajate korrigeerimiseks ja raviks, pigmendihäirete, naha armistumise, tätoveeringute ja kunstpigmendi eemaldamiseks, juuksehaiguste raviks ning samuti muudest laserravi protseduuridest dermatoloogias. Kõik loengud toimuvad MOODLEs- BBB-s. Viimane kohtumine toimub auditooriumis.\nProbleemide ja küsimuste korral palun võtta ühendust nahahaiguste õppetooli sekretäri Imbi Jaks'iga (e-mail: imbi.jaks@ut.ee; Raja 31, II korrus, A korpus, ruum A2066)"}