{"KURSUSE_NIMI": "Häirunud vedelikutasakaaluga seotud haigused", "KURSUSE_KOOD": "MVCM.13.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 30, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kasutatakse erinevaid õpetamismeetodeid. Mitu korda nädalas oodatakse õpilastelt tööd ettevalmistatud kliinilise juhtumi materjali ja kliiniliste andmetega. Õpilastelt oodatakse oma järelduste esitamist individuaalselt ja ka oma rühmaga. Praktiliste näidete põhjal annab kursus seega ülevaate, kuidas kliinilised toitmisspetsialistid saavad oma teadmisi kasutades ja rakendades kaasa aidata raviskeemide optimeerimisele. Nagu varemgi, testitakse õppijaid mitteametlikult lühikeste interaktiivsete viktoriinidega. Siin õpetatakse vedeliku tasakaalu põhimõtteid. Kaalutakse maksa- ja neerupuudulikkusega seotud seisundeid. Uurida nende mõju toitumisseisundile ja alatoitumise mõju haigustele.Objectives/eesmärkid:  Moodul põhineb varasemate moodulite sisu tundmisele. Üliõpilased saavad teada häirunud vedelikutasakaalu mõjudest ja alkoholi metaboolsest mõjust. Käsitletakse eelkõige neeru- ja maksahaigusega kaasnevaid toitumisraskusi ning üliõpilastega töötatakse välja praktilised lahendused.Learning outcomes/õpiväljund:  Mooduli läbinud üliõpilane:                                                                                                                                                                                                                                                                                                                                                                     * teab alkoholi mõju ainevahetusele ja toitumisele tervena ja haiguste korral * mõistab maksa- ja neeruhaiguste toitumisalaseid tagajärgi * mõistab häirunud vedelikutasakaalu toitumisalaseid tagajärgi haiguste korral  * suudab välja töötada maksa- ja neeruhaigusega patsientidele sobiva     toitumisreiimi"}