{"KURSUSE_NIMI": "Kroonilised haigused II (seedetrakti, hingamisteede, reumatoloogilised ja psühhiaatrilised haigused)", "KURSUSE_KOOD": "MVFA.00.055", "EAP": 10, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 260, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline apteeker saab kaasa aidata seedetrakti, hingamisteede, reumatoloogiliste ja psühhiaatriliste haigustega patsientide raviskeemide optimeerimisele. Kodutööna lahendavad õpilased kliinilisi juhtumeid patsiendi raviskeemi optimeerimise kohta. Veebiseminaril toimub arutelu kliiniliste juhtumite põhjal. Astma, kroonilise obstruktiivse kopsuhaiguse, reumatoidartriidi, osteoartriidi, podagra, hüperurikeemia, depressiooni, skisofreenia, unetuse, ärevuse ja narkomaania, seedetrakti ülaosa haiguste (düspepsia, GERD, verejooksud), põletikulise soolehaiguse, maksahaiguse ja ravimitest põhjustatud haiguste ravi maksahaigus kaetakse.Objectives/eesmärkid:  Õppeaine eesmärk on anda ülevaade levinuimatest hingamisteede, reumatoloogilistest ja psühhiaatrilistest haigustest ning arutleda ravimite manustamise iseärasuste ja kliinilise apteekri rolli üle nende haigustega patsientide raviskeemide optimeerimisel.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:  * tunneb kliinilise farmaatsia praktiseerimise põhimõtteid seedetrakti, hingamisteede, reumatoloogiliste ja psühhiaatriliste haigustega patsientide ravis  * oskab märgata ja analüüsida farmakoteraapia kitsaskohti kliinilise proviisori vaatenurgast. * tunneb aines käsitletavate haiguste farmakoteraapia põhimõtteid ning teab nende haiguste ravimite kasutamise ja valiku põhimõtteid * omab kliinilisele apteekrile vajalikke teadmisi ravimite valiku ja doseerimise kohta  * omab teadmisi, kuidas nõustada arste, õdesid ja patsiente aines käsitletavate haiguste farmakoteraapias."}