{"KURSUSE_NIMI": "Sissejuhatus kliinilisse farmaatsiasse", "KURSUSE_KOOD": "MVFA.00.049", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine annab praktiliste näidete varal ülevaate, mida teeb kliiniline proviisor ja mis on kliinilise proviisori unikaalne roll ravimeeskonnas, kuidas kliiniline proviisort öötab ja millisied abivahendeid oma töös kasutab. Õppijad toovad kursuse foorumis välja situatsiooni oma tööelust, kus kliinilise farmaatsia-alaseid teadmisi on tulnud rakendada ja milliseid teadmisi oleks olnud vaja juurde, et olukorda edukalt lahendada.                                                                                    Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline proviisor saab panustada raviskeemide optimeerimisse, kasutades ja rakendades teadminsi farmakokineetikast ning farmakodünaamikast. Õppijad lahendavad kodutööna näidisülesande patsiendi raviskeemi optimeerimise kohta. Õppeaine annab praktiliste näidete põhjal ülevaate, kuidas kliiniline proviisor saab panustadaneerufunktsiooni häirega patsientide raviskeemide optimeerimisse. Veebiseminarides toimub situatsioonülesannete ja näidishaigusjuhtude  põhjal arutelu.Objectives/eesmärkid:  Õppeaine eesmärk on anda ülevaade kliinilisest farmaatsiast ja kliinilise proviisori rollist ravimeeskonnas. Õpetada tudengeid süstemaatiliselt lahendama farmakoteraapia probleemsituatsioone, kasutades meditsiinilisi andmebaase. Eesmärk on harjutada enimlevinud haiguste ravis esinevate farmakoteraapia-alastele küsimustele tõenduspõhiste lahenduste leidmist ning patsientide ravi individualiseerimist.                                                       Õppeaine annab ülevaate farmakokineetika ja farmakodünaamika põhimõtetest ning annab sissejuhatuse kliinilise farmakokineetika põhimõtetesse ning nende põhimõtete rakendamisse. Õppeaine annab teadmised ja oskused, kuidas tuvastada ja lahedada farmakokineetika-alaseid küsimusi raviskeemides ning teha kindlaks haiguste ja terviseseisundi ning teiste ravimite mõju farmakokineetikale ning seega ravivastuse muutumisele.                                                                                    Õppeaine eesmärk on anda ülevaade olulisematest laborianalüüsidest, mis mõjutavad ravimite annustamist või ravimite valikut. Lisaks on eesmärgiks tutvustada enamlevinud neeruhaigusi, ravimite mõju neerufunktsioonile ning raviskeemide optimeerimist neeruhaigusega patsientidel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\nAine läbinud üliõpilane:                                                                                                                         \n* tunneb kliinilise farmaatsia praktiseerimise põhimõtteid \n* omab kliinilise proviisori jaoks vajalikke teadmisi ravimite farmakokineetikast ja farmakodünaamikast, laborimeditsiinist, neerufunktsiooni mõjust ravimite annustamisele ja valikule\n* omab kliinilise proviisori jaoks vajalikke teadmisi ravimite valikust ja annustamisest eakatele ja lastele\n* märkab ja analüüsib farmakoteraapia kitsaskohti kliinilise proviisori vaatepunktist                \n* teab ravimikasutuse optimeerimise põhimõtteid\n* oskab hinnata raviskeemide kitsaskohti ja teha ettepanekuid raviskeemide optimeerimiseks.                                                                                                                                                  * teab kliinilise farmakokineetika ning farmakodünaamika põhimõtteid                                          \n* teab laborimeditsiini üldpõhimõtteid\n* oskab interpreteerida olulisemaid laborianalüüse ja teha soovitusi raviskeemide muutmiseks lähtudes laborianalüüside abil tuvastatud terviseseisundi muutusest\n* mõistab ravimite kasutamise mõju laborianalüüsidele\n* oskab farmakokineetika- ja farmakodünaamika alaseid teadmisi kasutada patsiendi ravimikasutuse optimeerimisel.                                                                                                                       \n* tunneb  sagedasemaid neeruhaigusi, ravimite mõju neerufunktsioonile\n* oskab interpreteerida neerufunktsiooni analüüse ja optimeerida raviskeeme lähtuvalt neerufunktsioonist"}