{"KURSUSE_NIMI": "Õendusjuhtimine", "KURSUSE_KOOD": "MVPT.02.015", "EAP": 7, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Tervishoiu kvaliteet ja patsiendiohutus", "Personalijuhtimise alused õendusjuhtidele", "Terviseökonoomika alused õendusjuhtidele", "Tööõiguse alused õendusjuhtidele"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 19, "practice": 0, "seminar": 25, "independent_work": 138, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tervisesüsteemi aktuaalsed teemad ja väljakutsed, mida vaadeldakse õendusabi korraldamise aspektist. Juhtimise ja eestvedamise teooriad ning organisatsiooni juhtimistasandid ja funktsioonid. Õendusjuhtide pädevusmudelite ja eetikakoodeksi analüüs ning arutelud. Organisatsiooni arendamine: operatiivne ja strateegiline planeerimine, õendusabi osutamise mudelid. Ressursside ja protsesside haldamine: koosseisude planeerimine, meeskonna kujundamine, muutuste juhtimine. Kvaliteedijuhtimine. Probleemsete olukordade lahendamise strateegiad läbi praktiliste harjutuste, konfliktidega toime tulemine. Õendusjuhtimise arengusuunad ning juhi strateegiline tööriist - tõenduspõhine juhtimisplaan, selle kavandamine ja hindamine kursuse eksamitööna. Karjäärivõimalused õendusjuhtimises, sissejuhatus erialapraktikasse.Objectives/eesmärkid:  Kujundada teadmised tervishoiuasutuse toimimisest ja juhtimisest, kujundada valmidus korraldada ja arendada õendusabi ning tegutseda õendusjuhtimises.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - tunneb tervisesüsteemi ja selle korraldust, ning analüüsib seda õendusjuhtimise eesmärkidest lähtuvalt; - teab, kasutab ja reflekteerib õendusabi planeerimise, organiseerimise, eestvedamise ja järelevalve teooriaid, tõenduspõhised mudeleid ja meetodeid; - mõistab ressursside ja protsesside tõenduspõhise juhtimise olulisust õendusabi jätkusuutlikkuse tagamiseks; - analüüsib õendusjuhtimise erinevaid aspekte ja arengusuundi ning oskab nende üle arutleda; - oskab analüüsida enesearengu ja karjääriplaneerimise olulisust õendusjuhtimises lähtuvalt õendusjuhi pädevusmudelitest ning eetika koodeksist; - eesmärgistab ja planeerib õendusabi, rakendades teadmisi organisatsiooni toimimisest, ressursside ja muutuste juhtimisest ning eestvedamisest. NB! KURSUSE TEEMAD JA TEEMADE LÄBIMISE JÄRJEKORD NING ÕPPETÖÖ ÕPPEVORM VÕIB SÕLTUVALT KURSUSEL OSALEJATE VAJADUSTEST MUUTUDA KA KURSUSE KÄIGUS!\n\n\nÕppejõudude kontaktandmed:\n* Ere Uibu - ere.uibu@ut.ee\n* Anja Terkamo-Moisio - anja.terkamo-moisio@helsinki.fi (Helsinki Ülikool)\n* Helle Peterson - helle.peterson@ut.ee\n* Marrit Kanna (õppeassistent) - marrit.kanna@ut.ee"}