{"KURSUSE_NIMI": "Simuleeritud patsient II: protokollid", "KURSUSE_KOOD": "MVPT.01.015", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 34, "individual_work": 0, "internship": 18}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õpe selles aines on moodulipõhine ja üsna eriilmeline alustades patsiendikesksete suhtlemisvõtete meenutamisest ja süvendamisest ning lõpetades konkreetseks patsiendi rolliks vajalike oskuste õppega. Sinna vahele jääb veel nii meediku kui ka patsiendi vestluse süsteemse mõtestamise ja analüüsi ning tagasisidestamise õppimine selleks loodud tõenduspõhise meetodi - MITI (The Motivational Interviewing Treatment Integrity Code) alusel. MITI on sisuliselt nõustaja räägitud jutu kodeerimise süsteem, mis aitab SP rollis olles ära süstematiseerida ja tagasisideme jaoks lahti mõtestada meediku rollis olija patsiendikeskseid suhtlemise võtteid.\n\nKolm suuremat teemamoodlit on: MI-st lähtuvate patsiendikesksete suhtlemis- ja nõustamisoskuste meelde tuletamine ja arendamine; MITI meetodis orienteerumine; ning vähemalt kahe SP rolli protokollipõhine omandamine. Valdavalt toimub õpe seminari vormis läbi miniloengute ning väikestes rühmades harjutamiste ja arutelude. Aine põhisooritus on SP'i rollis aines Patsiendikeskne suhtlemine osalemine.Objectives/eesmärkid:  Aine eesmärgiks on valmistada ette meditsiinivaldkonnas läbiviidavasse õppetöösse kaasatavaid standardiseeritud patsiente. Aine on ennekõike suunatud arstiteaduskonna Patsiendikeskse suhtlemise aine läbinud õppijatele, aga ka teiste erialade, sh psühholoogia Suhtlemise aluste kursuse läbinud õppijatele.Learning outcomes/õpiväljund:  *\ttunneb motiveeriva intervjueerimise (MI) vaimsust ja protsesse;  *\tteab, kuidas jagada infot MI-le kohasel viisil ning oskab eristada sobivaid ja mittesobivaid patsiendikeskseid suhtlemis- ja nõustamisoskusi ja neid tagasisidestada MITI-st lähtuvalt; *\tsaab aru motivatsiooni, ambivalentsuse, muutuse- ja samaksjäämisjutu, parandamisrefleksi ning ebakõla olemusest ning meediku rollist nende kujunemisel; *\toskab eritada standardiseeritud patsiendi rollis muutusejuttu ja samaksjäämisjuttu lähtuvalt nõustaja tegevusest ning MITI loogikast; *\tmõistab standardiseeritud patsiendi rolli olemust ja rollipiire ning lähtub standardiseeritud patsiendi rollis etteantud protokollist; *\toskab anda toetavat tagasisidet lähtuvalt standardiseeritud patsiendi protokollist. Pane palun tähele, et SP rolli täitmine toimub sügissemestril, kuid selleks et seda rolli täita, on vaja läbida eelnev väljaõpe, mille sobitame augusti kuu sisse võimalikult vahetult enne õppetöö algust seega palun ole valmis leidma aega  2-3 päeva ulatuses."}