{"KURSUSE_NIMI": "Õenduse didaktika", "KURSUSE_KOOD": "MVPT.02.016", "EAP": 7, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Õenduspedagoogika"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 15, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 139, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õendushariduse arengusuunad ja korraldus. Õppeaine kavandamine: ainekava ja iseseisva töö juhendi koostamine. Õpitulemuste hindamine: hindamise viisid, kriteeriumid ja vahendid. Õpetamise kvaliteedi ning tulemuslikkuse analüüs ja hindamine. Tagasiside kavandamine õppijale ja õppejõule. Õppejõu erialane areng, selle toetamine ja hindamine õpimapi abil. Õppejõu eetika, tööülesanded ning koostöö haridusorganisatsoonis. Rahvusvaheline arendus- ja koostöö, selle tähendus õpetamise kvaliteedile ning õppejõu professionaalsele arengule. Ainekursusel käsitlevad teemad toetuvad WHO (2016) dokumendile \"Nurse Educator Core Comptences\".Objectives/eesmärkid:  Kujundada teadmised õendushariduse korraldusest ja arengusuundadest. Kujundada arusaam õpetamise kvaliteedi mõjust õenduspraktikale ja selle kvaliteedile. Kujundada valmidus õppeprotsessi elluviimiseks alates planeerimisest kuni hindamiseni ning valmidus isiklikuks erialaseks arenguks.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - teab õendushariduse korraldust ja arengusuundi; - mõistab õppekava loomise ja arendamise põhimõtteid; - oskab analüüsida hindamismudelite ja -meetodite kasutamist õenduspedagoogikas;  - mõistab tõenduspõhise õpetamise mõju õppekvaliteedile ja õenduspraktikale; - mõistab refleksiooni olemust ja vajalikkust erialases arengus; - oskab koostada ainekava. Loengutes ja seminarides osalemine (sh Moodle keskkonna toimuvad e-loengud ja veebiseminarid) on kohustuslik ning puudumine on aktsepteeritud vaid mõjuva põhjusega. Puudumise korral tuleb käsitletud teemad iseseisvalt läbi töötada ning vajaduse korral koostada õppejõu antud juhiste põhjal iseseisev töö, mis kokkuleppel õppejõuga esitatakse ühe nädala jooksul seminari toimumise päevast.\n\nNB! KURSUSE TEEMADE LÄBIMISE JÄRJEKORD JA VORM VÕIB SÕLTUVALT KURSUSEL OSALEJATE ÕPIVAJADUSTEST MUUTUDA KA KURSUSE KÄIGUS!\n\nÕppejõudude kontaktandmed:\nTaivi Mutso (vastutav õppejõud) - taivi.mutso@ut.ee\nHeli-Kaja Kübarsepp - heli-kaja.kubarsepp@ut.ee\nEre Uibu - ere.uibu@ut.ee\nJanne Kommusaar - janne.kommusaar@ut.ee"}