{"KURSUSE_NIMI": "Teadustöö metodoloogilised alused", "KURSUSE_KOOD": "MVPT.02.006", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 13, "practice": 3, "seminar": 23, "colloquium": 0, "web_learning": 0, "independent_work": 91, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kirjalike ülesannete kaudu õpitakse rakendama teadusliku uurimistöö (sh teaduskeelele) põhimõtteid oma magistritöö planeerimisel ja saavutatakse arusaamine uurimistöö protsessist, etappidest ning uurimistöö tüüpidest. Seminari aruteludes omandatakse arusaam uuritavate või uuritava materjali valiku printsiipidest lähtuvalt uurimisplaanist ning uurimistöö usaldusväärsuse tagamise põhimõtetest. Praktikumides harjutatakse kirjandusallikate otsingut teadusandmebaasides. Harjutatakse kirjandusallikate kriitilist hindamist kontroll-lehtede alusel ja oma hinnangute argumenteerimist seminaris. Individuaalselt koostatakse kirjanduse ülevaade planeeritud magistritöö teemal. Praktiliste kirjalike tööde kaudu harjutatakse uurimistöö planeerimist, uurimiskavandi koostamist ja selle kriitilist hindamist vastastiktagasiside kaudu. Valmistatakse ette dokumendid uurimistöö kooskõlastuste taotlemiseks.Objectives/eesmärkid:  Süvendada teadmisi teadustöö põhimõtetest, nõuetest ja etappidest ning peamistest uurimistöö tüüpidest õendusteaduses. Praktiliste kirjalike ülesannete kaudu arendada teaduskirjanduse otsimise, kirjanduse kriitilise hindamise ja enda uurimistööks kasutamise oskusi; planeerida ja koostada uurimiskava ning seda kriitiliselt hinnata. Süvendada teadmisi ja arendada praktilisi oskusi, mis on vajalikud uurimistöö kooskõlastuste saamiseks uurimiskeskkonnast ning inimuuringute eetika komiteelt.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - teab teadustöö etappe ja nõudeid, peamisi õendusteaduses kasutatavaid uurimistöö tüüpe ning neist lähtuvaid üldisi uuritavate / uuritava materjali valiku põhimõtteid; - oskab rakendada teadustöö põhimõtteid uurimisteema taustraamistiku koostamisel; - oskab välja selgitada uurimistöö rakenduslikud, filosoofilised ja teoreetilised probleemid;  - oskab sõnastada uurimisprobleemi ja püstitada uurimistöö eesmärki; - oskab planeerida, koostada ja kriitiliselt hinnata uurimiskavandit;  - teab digitaalsete andmete kogumise, haldamise ja kaitse põhimõtteid,  - mõistab inimuuringute eetika põhimõtteid; - oskab koostada uurimistöö avaldust kooskõlastuste taotlemiseks. Kui üliõpilane puudub auditoorsest õppetööst, tuleb tal:\n* kooskõlastatult õppejõuga auditoorselt käsitletud teemad iseseisvalt läbi töötada ning vajadusel esitada täiendav iseseisev töö.\n* lõpuseminaridest puudumise tõttu kuulmata jäänud kirjanduse ülevaated tuleb iseseisvalt läbi töötada ja kirjutada vähemalt kahe ülevaate kohta analüüsiv essee, milles on toodud ettepanekud tööde arendamiseks. Essee tuleb saata õppejõu e-posti aadressile ühe nädala jooksul vastava seminari toimumise päevast.\n\nNB! Kõigi uurimismetoodika õppeainete õppematerjalid on kättesaadavad Moodle-s kogu magistriõpingute ajal. Moodle-isse sisenemiseks ei pea olema registreerunud õppeainele ÕIS-is. Õppeaine nimi Moodle-is on \"Uurimismetoodika õendusteaduses\".\n\nNB! KURSUSE TEEMADE LÄBIMISE JÄRJEKORD JA VORM VÕIB SÕLTUVALT KURSUSEL OSALEJATE ÕPIVAJADUSTEST MUUTUDA KA KURSUSE KÄIGUS!\n\nÕppejõudude kontaktandmed:\n* anja.terkamo-moisio@uef.fi\n* ere.uibu@ut.ee*"}