{"KURSUSE_NIMI": "Patsiendikesksus ja kliiniline tervisedendus", "KURSUSE_KOOD": "MVPT.02.011", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 3, "practice": 0, "seminar": 17, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tervishoiuteenuste kvaliteet ja patsiendikeskne tervishoid: mõisted ja põhimõtted. Kliiniline tervisedendus, tervist edendavate haiglate terviseteenuste standardid 2 ja 3: patsientide toetamine, informeerimine ja sekkumine/võimestamine. Tervishoiuteenuste kasutajatelt tagasiside kogumine ja analüüsimine ning arendustegevuse kavandamine teenuse parendamiseks koostöös meeskonnaga.Objectives/eesmärkid:  Kujundada arusaam patsiendikeskse tervishoiu põhimõtetest ja tulemuslikkusest ning arendada oskusi, sh koostööoskusi tervishoiuteenuste patsiendikesksuse hindamiseks ja patsiendikesksete teenuste kavandamiseks.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - mõistab patsiendikeskse tervishoiu ja kliinilise tervisedenduse põhimõtteid, võimalusi ning olulisust; - oskab nii iseseisvalt kui ka koostöös kaasõppijatega analüüsida ja kriitiliselt hinnata tervishoiuteenuseid, lähtudes patsiendikesksuse ja kliinilise tervisedenduse põhimõtetest;  - oskab meeskonnas töötades planeerida kvaliteediprogrammi/tegevuskava tervishoiuteenuste arendamiseks. If a student is absent from the first seminars, a reflection task from Moodle (assignment No. 4) has to be done as a supplementary task. It consists of submitting an essay summarising all case analyses (5) (according to the general assessment criteria).\n\nNB! \n* The course is in English when at least 4 foreign students participate.\n* The forms of learning and teaching can be changed during the course depending on the learning needs of participating students.\n\nLecturers' e-mail:\n- ere.uibu@ut.ee\n- kaja.polluste@ut.ee\n- signe.asi@ut.ee"}