{"KURSUSE_NIMI": "Õenduspedagoogika", "KURSUSE_KOOD": "MVPT.02.013", "EAP": 7, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 4, "seminar": 29, "colloquium": 0, "web_learning": 0, "independent_work": 133, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppimise ja õpetamise psühholoogilised alused. Õpiteooriad, õpetamise mudelid. Tänapäevane õpikäsitus ja pedagoogika arengusuunad. Pedagoogika ja patsiendiõpetuse eesmärgid. Patsiendiõpetuse teoreetilised lähtekohad. Pedagoogiliste meetodite rakendamine õenduses. Õppimine ja õpetamine õdede õppes: õppetöö eesmärgistamine ja planeerimine, õppeprotsess. Õppetöö vaatlemine ja analüüsimine. Õppetöö praktiline planeerimine: tunnimudeli konstrueerimine ja esitlemine.Objectives/eesmärkid:  Kujundada arusaam õppimise ja õpetamise printsiipidest ning õppeprotsessi juhtimisest. Kujundada oskus rakendada pedagoogika ja patsiendiõpetuse põhimõtteid õenduse eri valdkondades.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - mõistab õppimise ja õpetamise käsitusi ja põhimõtteid; - mõistab õppimise ja õpetamise eesmärke lähtuvalt õpiteooriatest ja õppimise psühholoogilistest alustest; - mõistab pedagoogika põhimõtteid ning oskab neid rakendada õenduse eri valdkondades; - oskab analüüsida õppetöö ülesehitust ning koostada tunnimudelit. Loengutes ja seminarides osalemine on kohustuslik ning puudumine on aktsepteeritud vaid mõjuva põhjusega. Puudumisest tuleb anda teada õppetööd läbiviivale õppejõule ja vastutavale õppejõule enne planeeritud auditoorset kohtumist. Puudumise korral tuleb käsitletud teemad iseseisvalt läbi töötada. Seminarist puudumise korral koostada õppejõu antud juhiste põhjal iseseisev töö, mis esitatakse ühe nädala jooksul puudumise päevast.\n\nKirjalike tööde puhul ei ole lubatud kasutada tekstirobotit (nt. ChatGPT). Tekstiroboti loodud teksti esitamine enda nime all on akadeemiline\npetturlus.\n\n\nNB! KURSUSE TEEMADE LÄBIMISE JÄRJEKORD JA VORM VÕIB SÕLTUVALT KURSUSEL OSALEJATE ÕPIVAJADUSTEST MUUTUDA KA KURSUSE KÄIGUS!\n\nÕppejõudude kontaktandmed:\ntaivi.mutso@ut.ee\nheli-kaja.kubarsepp@ut.ee"}