{"KURSUSE_NIMI": "Teadustöö metodoloogilised alused", "KURSUSE_KOOD": "MVPT.02.006", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 6, "seminar": 18, "independent_work": 96, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kirjalike ülesannete kaudu õpitakse rakendama teadusliku uurimistöö (sh teaduskeelele) põhimõtteid oma magistritöö planeerimisel ja saavutatakse arusaamine uurimistöö protsessist, etappidest ning uurimistöö tüüpidest. Seminari aruteludes omandatakse arusaam uuritavate või uuritava materjali valiku printsiipidest lähtuvalt uurimisplaanist ning uurimistöö usaldusväärsuse tagamise põhimõtetest. Praktikumides harjutatakse kirjandusallikate otsingut teadusandmebaasides. Harjutatakse kirjandusallikate kriitilist hindamist kontroll-lehtede alusel ja oma hinnangute argumenteerimist seminaris. Individuaalselt koostatakse kirjanduse ülevaade planeeritud magistritöö teemal. Praktiliste kirjalike tööde kaudu harjutatakse uurimistöö planeerimist, uurimiskavandi koostamist ja selle kriitilist hindamist vastastikuse tagasiside kaudu. Saadakse valmidus dokumentide ettevalmistamisest uurimistöö kooskõlastuste taotlemiseks.Objectives/eesmärkid:  Süvendada teadmisi teadustöö põhimõtetest, nõuetest ja etappidest ning peamistest uurimistöö tüüpidest õendusteaduses. Praktiliste kirjalike ülesannete kaudu arendada teaduskirjanduse otsimise, kirjanduse kriitilise hindamise ja enda uurimistööks kasutamise oskusi; planeerida ja koostada uurimiskava ning seda kriitiliselt hinnata. Süvendada teadmisi ja arendada praktilisi oskusi, mis on vajalikud uurimistöö kooskõlastuste saamiseks uurimiskeskkonnast ning inimuuringute eetika komiteelt.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - teab teadustöö etappe ja nõudeid, peamisi õendusteaduses kasutatavaid uurimistöö tüüpe ning neist lähtuvaid üldisi uuritavate / uuritava materjali valiku põhimõtteid; - rakendab saadud teadmisi teadustöö tegemisest oma uurimisteema taustraamistiku koostamisel; - selgitab välja oma uurimistöö rakenduslikud, filosoofilised ja teoreetilised probleemid; - sõnastab uurimisprobleemi ja püstitab uurimistöö eesmärgi oma planeeritavale uurimistööle; - oskab planeerida, koostada ja kriitiliselt hinnata uurimiskavandit; - teab digitaalsete andmete kogumise, haldamise ja kaitse põhimõtteid, - mõistab inimuuringute eetika põhimõtteid; - oskab koostada uurimistöö avaldust kooskõlastuste taotlemiseks. General principles:\nIf the student is absent from online lectures and seminars related to the lesson plan, he must independently work through the topics discussed, and, if necessary, submit additional independent work.\n\n* THE SEQUENCE AND FORM OF COURSE TOPICS MAY CHANGE DURING THE COURSE, AS IT DEPENDS ON THE LEARNING NEEDS OF THE PARTICIPANTS IN THE COURSE!\n\n\nResponsible lecturer contact: ere.uibu@ut.ee"}