{"KURSUSE_NIMI": "Erialapraktika", "KURSUSE_KOOD": "MVPT.02.017", "EAP": 4, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Tööõiguse alused õendusjuhtidele", "Personalijuhtimise alused õendusjuhtidele", "Kommunikatsioonijuhtimine õendusjuhtimises ja -hariduses", "Terviseökonoomika alused õendusjuhtidele", "Meditsiiniõiguse alused õendusjuhtidele", "Õendusjuhtimine"], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 40, "individual_work": 0, "internship": 59}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tutvumine õppeasutusega: tervishoiukõrgkool kui sotsiaalne institutsioon, töökoht, õpikeskkond. Õppetöö teostamine ja hindamine juhendaja järelevalve all ja iseseisvalt. Tutvumine tervishoiuasutusega. Õendusjuhi tegevuse vaatlemine ja analüüs. Õendusjuhi tööülesannete täitmine juhendaja abiga ja iseseisvalt ning tegevuse hindamine. Töövarjupäev sotsiaaltöötajaga. Võimaluse korral osalemine tervishoiu- ja/või haridusasutuse arendustegevuses. Erialase arengu refleksioon.Objectives/eesmärkid:  Kujundada valmidus planeerida, ellu viia ja hinnata õppeprotsessi; kujundada valmidus korraldada ja arendada tõenduspõhist õendusabi.Learning outcomes/õpiväljund:  Erialapraktika läbinud üliõpilane: - oskab analüüsida ja hinnata õendusõppejõudude ülesandeid tervishoiu- ja haridussüsteemis ning teha ettepanekuid nende professionaalse arengu toetamiseks;  - oskab planeerida, teostada ja hinnata pedagoogilist tegevust nii kõrgkoolis kui ka haiglas; - oskab analüüsida organisatsiooni- ja juhtimisteooriate alusel tervishoiuasutust kui töö-, ravi- ja hoolduskeskkonda;  - oskab analüüsida õendusjuhtimist ja seda mõjutavaid aspekte;  - oskab kriitiliselt hinnata õendusabi korraldamise ja arendamise vajadusi ning teha parendusettepanekuid;  - oskab hinnata oma valmidust ja arenguvajadusi töötamaks õendusõppejõu ja/või õendusjuhina. NB! ChatGPT või muu tehisintellektil põhineva tarkvara kasutamine ei ole kursusel lubatud!\n\nErialapraktika 2. osa (praktika tervishoiuasutuses) koordinaator\nEre Uibu, õendusteaduse nooremlektor\nE-post: ere.uibu@ut.ee"}