{"KURSUSE_NIMI": "Kestlik areng hambaravis", "KURSUSE_KOOD": "MVST.00.014", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 3, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kestlik hambaravi on tänapäeva tervishoiu oluline osa, mis keskendub keskkonnasäästlikkuse ja ühiskondliku vastutuse integreerimisele hambaravi praktikas. Kursuse eesmärk on anda ülevaade kestliku hambaravi põhimõtetest, sealhulgas energia- ja ressursitõhususest, jäätmete ning süsiniku jalajälje vähendamise võimalustest hambaravikliinikutes.\nKursus hõlmab teemasid, nagu hambaravi süsiniku jalajälje hindamine, materjalide elutsükli analüüs, jäätmekäitlus, patsiendi ja personali keskkonnateadlikkuse suurendamine ning roheliste algatuste elluviimine igapäevases töös. Osalejad saavad teadmisi ja praktilisi tööriistu, kuidas rakendada oma igapäevapraktikas keskkonnasäästlikke meetodeid, vähendades samal ajal kulusid ja tõstes kliiniku mainet.\nKursus valmistab hambaarste ja hambaravi spetsialistid ette teadlike ja vastutustundlike otsuste tegemiseks, et saaksite vähendada oma praktika keskkonnamõju ja panustada kestlikumasse tervishoidu.Objectives/eesmärkid:  Kestlik hambaravi on tänapäeva tervishoiu oluline osa, mis keskendub keskkonnasäästlikkuse ja ühiskondliku vastutuse integreerimisele hambaravi praktikas. Kursuse eesmärk on anda ülevaade kestliku hambaravi põhimõtetest, sealhulgas energia- ja ressursitõhususest, jäätmete ning süsiniku jalajälje vähendamise võimalustest hambaravikliinikutes. Kursus hõlmab teemasid, nagu hambaravi süsiniku jalajälje hindamine, materjalide elutsükli analüüs, jäätmekäitlus, patsiendi ja personali keskkonnateadlikkuse suurendamine ning roheliste algatuste elluviimine igapäevases töös. Osalejad saavad teadmisi ja praktilisi tööriistu, kuidas rakendada oma igapäevapraktikas keskkonnasäästlikke meetodeid, vähendades samal ajal kulusid ja tõstes kliiniku mainet. Kursus valmistab hambaarste ja hambaravi spetsialistid ette teadlike ja vastutustundlike otsuste tegemiseks, et saaksite vähendada oma praktika keskkonnamõju ja panustada kestlikumasse tervishoidu.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:\n- mõistab kestliku arengu eesmärkide olulisust\n- on teadlik hambaravi valdkonnas kestliku arengu põhimõtetest\n- teab, kust leida tõenduspõhist tervise- ja keskkonnainfot ning oskab seda kriitiliselt hinnata\n- oskab muuta oma tegevusi keskkonna- ja tervisesõbralikumaks ning vastutustundlikumaks"}