{"KURSUSE_NIMI": "Hambaarsti integreeritud praktikum II", "KURSUSE_KOOD": "MVST.00.002", "EAP": 16, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Suu- ja hambahaigused II", "Ortodontia", "Ortopeediline stomatoloogia II", "Laste kirurgiline stomatoloogia", "Suu- ja näolõualuukirurgia II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 192, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 206, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine sisaldab loenguid ja praktikume. Üliõpilaste praktilise töö käigus toimub suu- ja hambahaiguste kompleksne ravi kogu semestri jooksul, töötades paaris kaasüliõpilasega. Üliõpilane arendab edasi oma diagnostika, ravi planeerimise ja teostamise oskusi osutades patsiendile hambaravi, suukirurgia ja hammaste proteesimise raviteenuseid. Üliõpilane teeb iseseisvalt kliinilist tööd, analüüsib igat oma raviplaani ja raviprotseduuri praktikat juhendava õppejõuga, tagasisidestatud protseduurid kannab oma e-portfoliosse.Objectives/eesmärkid:  Aine on rõhuga kliiniliste oskuste arendamisele. Õpitakse diagnoosima ja ravima suu- ja hambahaigusi ja hambutust; teostama järjest keerukamaid suukirurgia, parodondi haiguste, kaariese ja juureravi ning hammaste proteesimise protseduure; käsitlema patsienti suu- ja hambahaiguste aspektist terviklikult, osates planeerida ja teostada tõenduspõhist kompleksravi komplitseeritud juhtudel integreerides ja rakendades erinevates ainetes õpitut.Learning outcomes/õpiväljund:  Üliõpilane \n- oskab diagnoosida ja ravida suu limaskesta ja parodondi haigusi, koostada raviplaani ja teostada restauratiivse hambaravi erinevaid protseduure, seades esikohale patsiendi vajadused\n- tunneb hambaarsti eetikanõudeid\n- oskab professionaalselt suhelda patsientide ja meditsiinipersonaliga\n- koostab interdistsiplinaarse raviplaani tundes erinevate patoloogiatega haigete ravivõimalusi\n- oskab teostada põhilisi suukirurgilisi protseduure \n- tunneb hambaproteeside valmistamisega seotud täiendavaid ja kaasaegseid diagnostilisi võimalusi, materjale, konstruktsioone \n- tunneb hambaproteeside biomehaanilist olemust \n- tunneb implantatsioonravi võimalusi ja riske\n- täidab ravitöö mahu osas ettenähtud miinimumnõudeid"}