{"KURSUSE_NIMI": "Digitaalne hambaravi", "KURSUSE_KOOD": "MVST.00.013", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Põhimõisted ja roll: Sissejuhatus digitaalse hambaravi alustesse ja selle rolli mõistmine hambaravi kontekstis.\nDiagnostika ja ravi: Digitaalsete diagnostikameetodite selgitamine, nende olulisuse analüüs ning praktiline kogemus digitaalse raviplaneerimisega.\nTehnoloogilised oskused: Praktilised oskused, sealhulgas digitaalsete skaneerimisseadmete kasutamine, radioloogiliste piltide analüüs ja patsiendihaldustarkvara rakendamine.\nKriitiline mõtlemine: Hindamine digitaaltehnoloogiate mõjust hambaravis, probleemide lahendamine digitaalsete lahendustega praktikas.\nEetika ja professionaalsus: Eetiliste põhimõtete järgimine digitaalse hambaravi praktikas ja vastavus seaduslikele nõuetele patsiendiandmete kaitseks.\nSuhtlusoskus: Selge ja veenev esitus digitaalsete hambaravi kontseptsioonide ja lahenduste kohta, efektiivne suhtlus digitaalse hambaravi meeskonnas ja patsientidega.Objectives/eesmärkid:  Õppeaine eesmärk on tutvustada üliõpilastele digitaaltehnoloogiate rolli hambaravis, hõlmates diagnostikat, ravi ja patsiendihaldust.Learning outcomes/õpiväljund:  Edukalt aine läbinud tudengil on:\n\tTeoreetilised teadmised:\n- selgitab digitaalse hambaravi põhimõisteid ja selle rolli hambaravis\n- kirjeldab digitaaltehnoloogiate arengut hambaravi kontekstis\n- analüüsib digitaalsete diagnostikameetodite olulisust ja nende kasutamist hambaravis\n\tPraktilised oskused:\n- opereerib digitaalseid skaneerimisseadmeid ja töötleb saadud andmeid\n- analüüsib digitaalse radioloogia pilte ja teeb diagnostilisi järeldusi\n\tTehnoloogilised pädevused:\n- kasutab patsiendihaldus tarkvara (EHL) ja informaatikasüsteeme patsiendiandmete haldamiseks ja ravi planeerimiseks\n- omad arusaamu teiste hambaravitarkvarade töö põhimõtetest\n\tKriitiline mõtlemine ja probleemilahendus:\n- hindab digitaaltehnoloogiate eeliseid ja väljakutseid hambaravi valdkonnas\n- lahendab probleeme, kasutades digitaalseid lahendusi hambaravi praktilistes olukordades\n\tEetiline ja professionaalne käitumine:\n- järgib eetilisi põhimõtteid digitaalse hambaravi rakendamisel\n- mõistab ja järgib seadusandlikke nõudeid digitaalsete patsiendiandmete kaitseks\n\tSuhtlusoskus:\n- esitab selgelt ja veenvalt digitaalse hambaravi kontseptsioone ja lahendusi\n- osaleb tõhusalt digitaalse hambaravi meeskonnatöös ja suhtluses patsientidega"}