{"KURSUSE_NIMI": "Suuradioloogia I", "KURSUSE_KOOD": "MVST.00.009", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 5, "practice": 5, "seminar": 3, "colloquium": 0, "web_learning": 0, "independent_work": 13, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus sisaldab loenguid ja praktikume ning kodutööd\n1. Röntgenkiirguse saamise põhimõte, kujutise tekkimine (loengute materjalis)\n(Radioloogias on loeng Röntgenoloogia alused ja põhiprintsiibid)\n2. Kiirguskaitse (artikkel)\n3. Intraoraalsed võtted (loeng)\n3.1. Bitewing\n3.2. Periapikaalne võte\n3.3. Paralleeltehnika ja nurgapoolitustehnika.\n4. Ekstraoraalsed röntgenülesvõtted (loeng)\n 4.1. Panoraamülesvõtted\n4.2. Koonuskimp kompuutertomograafia (CBCT)\n5. Vähemkasutatavad röntgenülesvõtted hambaravis\n5.1. Tsefalogramm, Oklusaalne, Lateraalne põiki võte \n5.2. Kolju külgülesvõte\n6. Röntgenuuringu kirjeldamise alused\n7. Praktikum\n8. Kodused ülesanded\n9. TestObjectives/eesmärkid:  1. Anda põhiteadmisi suuradioloogia füüsikalistest alustest ja hambaravis kasutatava röntgendiagnostilise aparatuuri tööpõhimõtetest. \n2. Jagada teadmisi, mis aitavad patsiendile selgitada radioloogilise uuringu protseduuri olemust informeeritud nõusoleku saamiseks. \n3. Õpetada röntgenkiirguse ohutut kasutamist hambaarsti igapäevatöös.  \n4. Selgitada hambaravis kasutatavate röntgenoloogiliste uuringute määramise põhimõtteid ja õpetada röntgenanatoomiat.\n5. Jagada juhiseid röntgenülesvõtete kvaliteedi hindamiseks s.h õpetada ära tundma peamisi vigu.\n6. Praktiseerida röntgenuuringute tulemi kirjeldamist ja patoloogiate diagnoosimist.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1. Omab teoreetilisi teadmisi suuradioloogia üldpõhimõtetest ja kiirgusohutusest. 2. Omab teoreetilisi teadmisi hambaravis kasutatava röntgendiagnostilise aparatuuri tööpõhimõtetest. 3. Oskab  teha suusiseseid ja panoraam röntgenülesvõtteid. 4. Teab röntgenülesvõtete näidustusi ja vastunäidustusi. 5. Oskab hinnata röntgenülesvõtte kvaliteeti ja kirjeldada uuringu tulemit. 6. Tunneb röntgenanatoomiat ja oskab diagnoosida röntgenülesvõttel sagedamini esinevaid patoloogiaid. Igal rühmal toimub kaks praktikumi, mille täpsed ajad selguvad jooksvalt vastavalt kliinikumi juhataja töögraafikule. I praktikumi kestus on 45 minutit, II praktikumi kestus on 1,5 tundi."}