{"KURSUSE_NIMI": "Põhiõigused kriminaalmenetluses", "KURSUSE_KOOD": "OIAO.01.057", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Süüteomenetlus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Käesolev kursus keskendub küsimustele, millised on kõige olulisemad (põhi)õigused kriminaalmenetluses ning mida teha, kui neid on rikutud. Selleks arutleme esmalt kriminaalmenetluse olemuse üle ning käime läbi kõik kriminaalmenetluse etapid (kohtueelses menetluses ja kohtumenetluses), kus konkreetsed (põhi)õigused eelkõige päevakorda tulevad - jälitustegevus, ülekuulamine, vahistamine, süüdistuse esitamise üle otsustamine ja tõendite esitamine kohtuistungil. Jooksvalt proovime leida vastust ka küsimusele, millised (põhi)õiguste rikkumised on niivõrd rasked/olulised, et tingivad tõendite kasutamise keelu. Seega pöörame kursuse jooksul tähelepanu nii meid huvitavate (põhi)õiguste sisule kui ka sellele, kuidas tagada, et neid õigusi praktikas ka järgitaks. Kahtlustatavate ja süüdistatavate õigused sisustame kursusel Euroopa Inimõiguste Konventsiooni ja Euroopa Inimõiguste Kohtu praktikast, Eesti õigusaktidest ning Euroopa Liidu õigusaktidest lähtudes.Objectives/eesmärkid:  Õppeaine annab ülevaate sellest, millist rolli mängivad Euroopa Inimõiguste Kohtu praktika kohaselt kahtlustatava ja süüdistatava õigused kriminaalmenetluses ühelt poolt isikule süüdistuse esitamise aspektist ja teiselt poolt tema kaitsmise seisukohast ning millised on (peaksid olema) tagajärjed, kui isiku vastavaid õiguseid on rikutud.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - teab, millised on võistleva ja inkvisitsioonilise menetluse tunnused ning millist rolli mängivad nendes menetlustes kohus, prokuratuur ja kaitsja; - nimetab Packeri mudelite tunnused ning oskab tänapäeva kriminaalmenetluses näha Packeri mudelite ilminguid; - analüüsib, millised on nõuded kohtunikule, prokurörile ja kaitsjale kriminaalmenetluses; - analüüsib, millised on kahtlustatavate ja süüdistatavate (põhi)õigused, mis tõusetuvad järgmistes menetlusetappides: jälitustegevus, ülekuulamine, kinnipidamine ja vahistamine, otsus esitada süüdistus ja kohtumenetlus; - annab hinnagu, millised võiksid ja peaksid olema kahtlustatavate ja süüdistatavate (põhi)õiguste rikkumise tagajärjed kriminaalmenetluses."}