{"KURSUSE_NIMI": "Sissejuhatus erialainfootsingusse", "KURSUSE_KOOD": "OIAO.06.051", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel käsitletakse järgmisi teemasid:\nÜlevaade Tartu Ülikoolile raamatukogu kaudu avatud teadusandmebaasidest.\nInfootsingu põhimõtted ja strateegia. Päringu koostamine, võtmesõnaotsing, märksõnaotsing, otsingutulemuste hindamine ja korrastamine.\nOtsing erinevates andmebaasides (EBSCO Discovery,  Web of Science, Scopus, kirjastuste e-ajakirjade andmebaasid, e-raamatute andmebaas ebrary. Viidete haldurid (Zotero, Mendeley, EndnoteWeb).\nTeadusinfo otsing Internetis.  Google Scholar. Avatud juurdepääsuga teadusajakirjad. Avatud arhiivid e. repositooriumid.\nMis on teaduse toorandmed ning avaandmed. Milles seisneb teadusandmete haldamine. Andmete elutsükkel ning andmehaldusplaan. Avaandmete repositooriumid. Andmekogu püsiidentifikaator, DataCite, DOIObjectives/eesmärkid:  Kursuse eesmärgiks on arendada õppijate teadmisi ja praktilisi oskusi erialase teadusinformatsiooni ja teaduse toorandmete leidmiseks ja haldamiseks.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased: - tunnevad infootsingu põhimõtteid ja täppisotsingu tehnikaid ning rakendavad neid efektiivselt erinevates otsingukeskkondades leidmaks oma uurimistöö jaoks vajalikke allikaid; - tunnevad ja oskavad tulemuslikult kasutada olulisi oma eriala ja multidistsiplinaarseid TÜ raamatukogu vahendusel kättesaadavaid teadusinfo andmebaase; - tunnevad teadusinfo otsingukeskkondi internetis (Google Scholar, BASE, OAIster) ja oskavad leida avatud juurdepääsuga teadusinformatsiooni internetist; - oskavad kasutada ühte enda valitud viidete haldurit viidete haldamiseks, tekstisiseseks viitamiseks ja bibliograafia vormistamiseks; - teavad, mis on teaduse toorandmed ning miks on andmehaldus vajalik;  - oskavad leida ja kasutada avaandmete repositooriume;  - teavad, mis on andmete püsiidentifikaator ning kuidas saada DataCite DOI oma andmekogule."}