{"KURSUSE_NIMI": "Kriminaalpoliitika", "KURSUSE_KOOD": "OIAO.01.042", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Karistusõigus", "Süüteomenetlus"], "SOOVITUSLIKUD_EELDUSAINED": ["Sanktsiooniõigus"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaines käsitletakse kriminaalpoliitika mõistet, kriminaalpoliitiliste otsuste aluseks olevaid teoreetilisi ja praktilisi lähtekohti ning EL rolli kriminaalpoliitika mõjutajana.Objectives/eesmärkid:  Õppeaine: - annab ülevaade kriminaalpoliitika mõistest ning seostest teiste poliitikavaldkondade ja õigusharudega; - tutvustab kriminaalpoliitiliste otsuste aluseks olevaid teoreetilisi lähtekohti, seda nii karistusõiguse, kriminaalmenetluse kui kriminaalmenetluse välise kuriteoennetuse valdkonnas; - tutvustab kriminaalpoliitika kujundamise ja elluviimisega seonduvaid teoreetilisi ja praktilisi probleeme Eestis ja väljaspool; - selgitab, kuidas mõjutab EL oma liikmesriikide kriminaalpoliitika kujundamist.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: -\tteab kriminaalpoliitika põhimõisteid ja seoseid teiste poliitikavaldkondade ja õigusharudega; -\tmõistab ja annab hinnangu erinevatele kriminaliseerimise põhimõtetele; -\tarutleb, miks teatud sotsiaalsed probleemid pälvivad kriminaaljustiitssüsteemi tähelepanu rohkem kui teised; -\tarutleb, millised on kriminaalpoliitika kujundamise ja elluviimisega seonduvad teoreetilised ja praktilised probleemid Eestis ja väljaspool; -\tmõistab käesoleva aja kontrollikultuuri (culture of control) olemust ning selle mõju kuritegevuse vastasele võitlusele ja ennetusele;  -\tanalüüsib EL rolli kriminaalpoliitika kujundajana; -\tleiab teoreetilisest jm kirjandusest juhtumeid, mis on pälvinud või võiks pälvida kriminaaljustiitssüsteemi tähelepanu (nt vihakõne) ning analüüsib nende juhtumite (osalise) kriminaliseerimise poolt- ja vastuargumente. NB! Aine toimub üle aasta."}