{"KURSUSE_NIMI": "Rahvusvahelise õiguse ajalugu ja teooria", "KURSUSE_KOOD": "OIAO.07.064", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Rahvusvaheline õigus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 142, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aines toimuvate seminaride jooksul käsitletakse erinevaid rahvusvahelise õiguse ajalugu ja filosoofiat puudutavaid tekste, millest inspireerituna kirjutab tudeng lõpuks essee.\nTegemist on teoreetilise suunitlusega seminariga, mille eesmärgiks on aidata paremini mõista rahvusvahelise õiguse olemust ja kaasaegseid suunitlusi rahvusvahelise õiguse teoorias, metodoloogias ning filosoofias. Käsitletakse ka rahvusvahelise õiguse ajaloo probleeme. Seminar on eelkõige mõeldud neile tudengitele, kes soovivad süvendatult tegeleda rahvusvahelise õiguse probleemidega ning vajavad magistri- või doktoritöö kirjutamiseks tugevat üldteoreetilist ettevalmistust.Objectives/eesmärkid:  Õppeaine eesmärk on tutvustada üliõpilastele rahvusvahelise õiguse (ja selle teaduse) ajaloolist kujunemislugu, samuti selle distsipliini filosoofilisi ja metodoloogilisi põhiprobleeme. Kursuse eesmärk on anda tudengitele võimalikult laiapõhjaline ja maailmas konkurentsivõimeline teadmine rahvusvahelise õiguse teooriast ja ajaloost.Learning outcomes/õpiväljund:  Õppeaine läbimisel peaks üliõpilane orienteeruma rahvusvahelise õiguse üldistes; küsimustes ja mõistma paremini, mis on rahvusvahelise õiguse debattide, lahenduste ning üksikprobleemide \"taga\". ... 8.11 seminar questions: How does Onuma see the 'treaties' that European powers concluded with the Africans in the later 19th century? What was the main importance of the China-Japan peace treaty of 1895 in the history of international law? What does Onuma mean when he criticizes the Eurocentrism of the history writing of international law?\n\nBakalaureuseastmes lubatud üksnes 3.aasta üliõpilastele, registreerimiseks palun saata e-mail merike.vellend@ut.ee.\nÜleülikoolilisi doktorante registreerib ainele Katri Holst (katri.holst@ut.ee)."}