{"KURSUSE_NIMI": "Privaatsus ja andmekaitse", "KURSUSE_KOOD": "OIAO.05.070", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Bakalaureuseeksam"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 40, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Sissejuhatus ainesse, Euroopa andmekaitse õiguse taust ja kontekst, vahetegu privaatsuse ja andmekaitse vahel, võrdlus teiste privaatsuse- ja andmekaitse režiimidega;\n2. Andmekaitse terminoloogia ning peamised printsiibid Euroopa andmekaitse õiguses;\n3. Euroopa andmekaitse reeglid;\n4. Andmesubjekti õigused ja nende jõustamine;\n5. Andmete piiriülese edastuse reeglid ning kontserni sise-eeskirjad;\n6. Andmekaitse reeglite kohaldatavus ja tehnoloogia;\n7. Ettevalmistus eksamiks.\n\n8. Eksam (2,5 h)Objectives/eesmärkid:  Kursuse eesmärk on anda põhjalik ülevaade Euroopas kehtivast privaatsuse ja isikuandmete kaitse alastest kontseptsioonidest, printsiipidest ja regulatsioonist. Tudengitele tutvustatakse kehtivat seadusandlust, Euroopa Liidu Kohtu ja Euroopa Inimõiguste Kohtu praktikat ning vastava valdkonna viimaseid arenguid. Seminarides õpivad tudengid lahendama kaetud valdkondadega seotud praktilisi küsimusi.Learning outcomes/õpiväljund:  Kursuse lõpuks on aine läbinud üliõpilastel teadmised: 1. õigusalastest mõistetest ning terminitest privaatsuse ja andmekaitse vallas, nende jõustamismehhanismidest ja Euroopa Liidu Kohtu ja Euroopa Inimõiguste Kohtu privaatsuse ja andmekaitsealasest kohtupraktikast; 2. andmete piiriülesest liikumisest; 3. mõningatest tehnoloogia arengutest andmekaitse vallas; 4. kuidas analüüsida juriidilisi küsimusi, mis puudutavad privaatust ja andmekaitset. Tudengitel on esmane ülevaade nende valdkondade majanduslikest, poliitilistest ja sotsiaalsetest mõjudest."}