{"KURSUSE_NIMI": "Inimõigused võrdlevast perspektiivist", "KURSUSE_KOOD": "OIAO.07.092", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Rahvusvaheline õigus", "Sissejuhatus inimõigustesse"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine pakub võimalust mõista ja analüüsida inimõigusi erinevates jurisdiktsioonides võrdlevalt. Õppeaine raames keskendutakse peamiselt Euroopa ja rahvusvahelise õiguse inimõigusalasele praktikale ning siseriiklikule kohtupraktikale Euroopas ja Põhja-Ameerikas. Teemakäsitlus algab teoreetiliste lähtekohtade analüüsiga ning võrdleva meetodi tutvustamisega ning jätkub üksikute inimõiguste (nt vähemuste õigused, sõnavabadus, eraelu kaitse ning soolise ja usulise diskrimineerimise keeld) põhjalikuma käsitlusega, et mõista teooria, õiguslike mõistete ja praktika omavahelisi seoseid ning hinnata inimõiguste kaitse vahendite effektiivsust ning võrdleva meetodi kasulikkust ja piiratust õigusmõistmisel. Konreetsed teemad võivad olenevalt aktuaalsusest aastate lõikes varieeruda.Objectives/eesmärkid:  Õppeaine eesmärk on anda üliõpilastele: - teadmised ja oskused analüüsida võrdlevalt keerulisi/vastuolulisi inimõigustesse puutuvaid küsimusi nii teoorias kui praktikas. - oskused näha inimõigustesse puutuvaid õiguslikke küsimusi ja kohtulahendeid laiemas rahvusvahelises ja  iseriiklikus kontekstis - oskused kasutada võrdlevat meetodit kaasuste analüüsis - oskus kirjutada konverentsi abstrakti, ettekannet, esineda ettekandega, olla moderaator ja disskutantLearning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - oskab tuvastada ja analüüsida põhiprobleeme inimõiguste teoorias ja praktikas. - oskab analüüsida, miks on erinevates jurisdiktsioonides erinev lähenemine teatud inimõigustele - omab häid teadmisi õppeaines käsitletud inimõigustest - mõistab nii õiguslike vahendite potentsiaali kui ka piiratust inimõiguste kaitsel - mõistab võrdleva meetodi potentsiaali ja piiratust inimõiguste kaitsel - osakb esineda konverentsil, olla moderaator ja diskussant -on edendanud oma akadeemilse kirjutamise ja analüüsi oskust inimõiguste alal For successful participation in this course it is recommended to have basic knowledge of international and regional human rights law and system of protection. The course is best suited for students who have previously attended the course on public international law or other courses that included a section on international or constitutional human rights protection. In this regard the course is best suited for foreign/visiting and University of Tartu 3rd year BA, MA and doctoral students. The course is open for non-lawyers. When in doubt about your abilities to take this course discuss it with your teacher."}