{"KURSUSE_NIMI": "Haldusõigus", "KURSUSE_KOOD": "OIAO.05.039", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Riigiõigus"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines käsitletakse haldusõiguse üldosa probleeme: haldusõiguse eset, haldusõiguse mõistet, põhiseaduslikke printsiipe ja põhimõisteid, allikaid, haldusorganisatsiooni, haldustegevuse vorme, haldusmenetlust, haldussundi, halduse kontrolli ja õiguskaitsevahendeid halduse õigusvastase tegevuse vastu.Objectives/eesmärkid:  Õppeaine eesmärgiks on õpetada haldusõiguse üldosa teoreetilisi alusteadmisi, selgitada haldusõiguse eset, põhiseaduslikke printsiipe ja põhimõisteid. Anda ülevaade haldusõiguse allikatest s.h rahvusvahelise õiguse ja Euroopa Liidu õiguse kohast haldusõiguse allikate süsteemis, haldusorganisatsioonist, haldustoimingutest ja nende vormidest. Selgitada haldusmenetluse põhimõtteid, halduskontrolli olemust ning õiguskaitsevahendeid halduse õigusvastase tegevuse vastu. Õpetada haldusõiguse üldossa kuuluvate praktiliste kaasuste lahendamise metoodikat.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane peab olema võimeline: 1)\tselgitama haldusõiguse põhiseaduslikke printsiipe ja põhimõisteid; 2)\tmõistma haldusõiguse üldosa ja eriosa seoseid ning kohaldamise spetsiifikat; 3)\trakendama erinevaid tõlgendamismeetodeid haldusõigusnormi sisu ja eesmärkide selgitamiseks; 4)\ttundma haldusorganisatsiooni ja selle funktsioneerimise põhimõtteid; 5)\toskama eristada erinevaid haldustegevuse vorme ja teadma neile esitatavaid nõudeid; 6)\tteadma haldusmenetluse põhimõtteid ja menetlust; 7)\tselgitama haldussunni (haldustäite) olemust ja selle rakendamise põhimõtteid; 8)\tselgitama halduskontrolli olemust ja vajalikkust; 9)\tomama ülevaadet õiguskaitsevahenditest avaliku halduse tegevuse vastu ja nende aluseks olevatest materiaalõiguslikest nõuetest (riigivastutusnõuded) 10)\tkasutama õiguskirjandust ja kohtupraktikat kaasuste lahendamisel 11)\tesitama haldusõiguse üldosa õppekaasuse analüüsi ja lahenduskäigu vastavalt etteantud metoodikale."}