{"KURSUSE_NIMI": "Juristi kutse-eetika", "KURSUSE_KOOD": "OIAO.05.056", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse raames õpetatakse juristi kutsetegevuse eetilisi aluseid. Tulenevalt konkreetse juristi elukutse (kohtuniku, advokaadi, prokuröri) spetsiifilisest rollist ja funktsioonist ühiskonnas tutvustakse kutse-eetika tähendust ja osa õigusemõistmise protsessi ja ühiskonna eesmärkide saavutamisel.Objectives/eesmärkid:  Omandada teadmised juristi tegevuse eri rollidest ja kutse-eetilisest käitumisest. Kursuse raames saadakse ülevaade kutse-eetika rollist ning üld- ja spetsiifilistest nõuetest kutsepraktikas. Tulenevalt juristi tegevuse spetsiifilisest rollist ja funktsioonist ühiskonnas tutvustakse kutse-eetika tähendust ja osa õigusemõistmise protsessi eesmärkide saavutamisel. Kursuse raames peatutakse juristi erinevate kutsetegevuste nõuetel nii avalikus kui erasektoris (kohtunik, prokurör, notar, advokaat, vastavusametnik, jurist avalikus teenistuses).Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane:\n1. omab põhiteadmisi kutse-eetika põhimõtetest ja erinevustest võrreldes tavamoraaliga;\n2. selgitab kutse-eetika erisusi erinevates õiguskordades;\n3. omab põhiteadmisi juristi kutse-eetika spetsiifikast;\n4. on kujundanud isikliku arusaamise ja ettekujutuse juristi kutse-eetika kesksetest mõistetest - sõltumatus, autonoomia, lojaalsus, privaatsuse kaitse, konfidentsiaalsus, huvide konflikt jm\n5. omab teadmisi juristi erinevate kutsepraktikate eetilistest printsiipidest.\n6. on kujundanud isiklikud põhimõtted juristi elukutsele esitatavatest käitumisreeglitest - suhtlemine kliendiga, suhtlemine teiste protsessiosalistega, enesetaandamine menetlusest jm.\n7. omab teadliku karjäärivaliku tegemiseks vajalikke kutse-eetika alaseid teadmisi."}