{"KURSUSE_NIMI": "Euroopa Liidu õiguse erikursus", "KURSUSE_KOOD": "OIAO.07.106", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Euroopa Liidu õigus", "Haldusõigus", "Riigivastutus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus keskendub Euroopa Liidu materiaalõigusele ja selle rakendamisele liikmesriikide, eriti Eesti õigussüsteemis. Seminarivormis toimuvad arutelud ja kirjalikud tööd hõlmavad ELi siseturu põhivaldkondi, sealhulgas kaupade ja isikute vaba liikumist, konkurentsiõigust ja diskrimineerimisõigust. Kursus annab põhjaliku ülevaate ELi seadusandlikust raamistikust, Euroopa Kohtu praktika olulisematest lahenditest ning õigusaktide rakendamise tingimustest. Õppetöö käigus arendatakse üliõpilaste õigusliku põhjendamise, probleemide lahendamise, uurimistöö ja argumenteerimise oskusi, pöörates erilist tähelepanu ELi ja riiklike õigusnormide koosmõjule. Kursuse eesmärk on luua tugev alus ELi materiaalõiguse mõistmiseks ja selle praktiliseks rakendamiseks.Objectives/eesmärkid:  Süvendada teadmisi ELi materiaalõigusest: Anda üliõpilastele põhjalik ülevaade ELi materiaalõiguse peamistest valdkondadest, sealhulgas kaupade ja isikute vaba liikumine, konkurentsiõigus ning diskrimineerimisõigus. Analüüsida ELi õiguslikku raamistikku: Uurida materiaalõigust kujundavaid seadusandlikke sätteid ja kohtupraktikat, keskendudes olulistele õiguslikele arengutele ja kohtulahendite tõlgendamisele. Tugevdada praktilise rakendamise oskusi: Arendada oskust rakendada ELi materiaalõigust reaalsetes ja hüpoteetilistes olukordades, edendada analüütilisust ja probleemide lahendamise oskust. Analüüsida EL õiguse rakendamist Eestis: Uurida, kuidas ELi materiaalõigust rakendatakse Eesti õigussüsteemis, analüüsides väljakutseid ja edusamme ELi kohustuste täitmisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\nÕppeaine läbinud õppija:\nÕppeaine läbinud õppija:\nKursuse edukal läbimisel üliõpilane:\nAnalüüsib ELi materiaalõiguse põhilisi valdkondi ja eripärasid, sealhulgas kaupade ja isikute vaba liikumist, konkurentsiõigust ja diskrimineerimisõigust.\nHindab ELi materiaalõiguse rakendamise tingimusi liikmesriikide, eriti Eesti õigussüsteemis, ning tuvastab rakendamise edukad praktikad ja väljakutsed.\nArendab õigusliku põhjendamise ja suulise ning kirjaliku argumentatsiooni oskusi ELi õiguse raamistikus, tõlgendades seadusandlikke sätteid ja rakendades põhimõtteid, mis tulenevad asutamislepingutest, määrustest, direktiividest ja Euroopa Kohtu kohtupraktikast.\nArendab õigusliku uurimistöö ja digioskusi, töötades ELi õigusmaterjalide ja -andmebaasidega, nagu EUR-Lex, Euroopa Kohtu kohtupraktika andmebaas ja Euroopa Komisjoni dokumendid.\nLahendab praktilisi ja hüpoteetilisi probleeme, rakendades ELi materiaalõigust ja riiklike õigusnorme, et pakkuda asjakohaseid ja põhjendatud lahendusi."}