{"KURSUSE_NIMI": "Sissejuhatus õigusesse: riigiteadlastele", "KURSUSE_KOOD": "OIAO.07.090", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õiguse entsüklopeedias käsitletakse riigi ja õiguse tekkimist ja mõistet, õigusnormide ja õiguskorra struktuuri, õiguse süsteemi, õiguse realiseerimist ja õiguse tõlgendamist ning õiguse efektiivsusega seonduvaid küsimusi.\nRiigiõiguses tegeletakse põhiseadusest tuleneva riigi süsteemiga, sh võimude lahususega, põhiõiguste tähenduse ja rakendamisega, samuti sellega, kuidas saab algatada põhiseaduslikkuse järelevalve kohtumenetluse ja kuidas see toimub.\nHaldusõiguse osas leiavad käsitlemist haldusõiguse põhialused. Samuti tutvustatakse haldusmenetluse ja halduskohtumenetluse põhimõtteid ja kohtupraktikat.\nRahvusvahelise õiguse osas leivad käsitlemist rahvusvahelise õiguse allikad ja põhiprintsiibid, rahvusvahelise õiguse subjektid, peamised teoreetilised koolkonnad, rahvusvahelise vastutuse põhimõtted ja ÜRO toimimine. Lühidalt peatutakse rahvusvahelistel inimõigustel.Objectives/eesmärkid:  Kursuse aineks on käsitlus õigusest kui sotsiaalsest instituudist. Kursus hõlmab õiguse entsüklopeedia, riigiõiguse, haldusõiguse ja rahvusvahelise õiguse valdkondi.\nÕppeaine üldeesmärgiks on anda baasteadmised mandri-euroopalikku õiguskultuuri kuuluva õiguse põhimõistetest ning riigi ja õiguse toimimise aluspõhimõtetest.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane omab teadmisi: -\tmandri-euroopaliku ja Eesti õiguskultuuri olemusest; -\tõiguse kujunemisest; -\tEesti jaoks oluliste õigusnormide ja õiguskordade olemusest ning struktuurist; -\tõiguse rakendamisest kui riiklik-võimualasest tegevusest. Aine läbinu: -\ttunneb õiguse funktsioneerimise põhimõtteid; -\ttunneb vaadeldud õigusdistsipliinide põhimõisteid; -\tmõistab õigusvaldkondade omavahelisi seoseid; -\tmõistab anda hinnangu õiguse rakendamise üldprintsiipidele; -\toskab leida ja orienteerub valdkondade peamistes õigusallikates."}