{"KURSUSE_NIMI": "Rahvusvaheline pangandus ja finantsteenused", "KURSUSE_KOOD": "OIEO.06.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ainekursusel käsitletakse panganduse ja rahanduse erinevaid aspekte rahvusvahelises kontekstis, sealhulgas erasektori ja riigi poolt laenude andmist, hoiustamist ja välisarveldusi ning piirüleseid finantstehinguid. Tudengid omandavad mh teadmisi tehingute osapooltega seotud riskidest ja riskide vähendamise mehhanisme. Ainekursusel käsitletakse ka rahvusvaheliste tehingute regulatiivseid probleeme (vastavuskontroll).Objectives/eesmärkid:  Kursus annab ülevaate rahvusvahelise panganduse ja rahanduse põhialustest.  Kursus hõlmab rahvusvahelise panganduse ja rahanduse aluseks olevaid teooriaid ja poliitikaid. Kursuse raames käsitletakse eri liiki finantstehingute omadusi, tehingute riskikategooriaid ja -positsioone ning võimalikke mehhanisme nende riskide vähendamiseks. Ainekursus sisaldab ka arutelusid rahvusvaheliste tehingute näitel.Learning outcomes/õpiväljund:  Üliõpilased - omandavad põhiteadmised erinevat tüüpi rahvusvahelistest tehingutest, nii era- kui ka valitsuse rahastatud tehingutest - mõistavad, miks kliendid ja finantsasutused tegelevad rahvusvahelise finantseerimisega, - omandavad teadmisi kursusel käsitletavate tehingutüüpide peamiste omaduste kohta, - mõistavad tehingutega seotud riske ja regulatiivseid probleeme. The course will be taught by Professor David Zarski who has 40 years of experience as an Illinois-licensed attorney and compliance officer in bank and other financial institution regulation and transactions, deposit products, payment systems and GPR cards, consumer credit and mortgage programs, and commercial financing arrangements and lending. He has represented and advised banks, thrifts, state-licensed lenders, debt collectors, fintech companies, and service providers."}