{"KURSUSE_NIMI": "Konkurentsiõigus ja tururegulatsioon digimajanduses", "KURSUSE_KOOD": "OIEO.06.095", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Bakalaureuseeksam"], "SOOVITUSLIKUD_EELDUSAINED": ["Konkurentsiõigus", "Euroopa Liidu õigus"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Konkurentsiõigus ja turu regulatsioon digitaalmajanduses hõlmab kaht õppeteemat: esiteks üldine materiaalne konkurentsiõigus digitaalmajanduses (st ELTL artiklid 101 ja 102, koondumiste määrusel põhinev koondumiste kontroll); teiseks digiteenuste õigusakti (DSA) ja digiturgude õigusakti (DMA) algatused, mis käsitlevad turu reguleerimise eeskirjade loomist digiturgude jaoks. \n\nSee kursus hõlmab konkurentsiõiguse ja turu reguleerimise erinevaid aspekte digitaalsetel turgudel, sealhulgas: \nI. Põhiline konkurentsiõigus digitaalajastul\n1. Ettevõtja mõiste ja turu määratlus, konglomeraaditurud digitaalsetel turgudel; \n2. ELTL artikli 101 eri aspektid ja hindamine digitaalturgudel; \n3. ELTL toimimise lepingu artikli 102 eri aspektid ja hindamine digitaalturgudel; \n4. Ühinemiste kontroll digitaalturgudel (sealhulgas vertikaalne ja konglomeraatne mõju), probleemid praeguste eeskirjadega. \n\nII. Turu reguleerimine digitaalmajanduse jaoks\n5. Ülevaade juba olemasolevatest eeskirjadest (nt ettevõtjatevaheline määrus); \n6. Digiteenuste õigusakti (DSA) ja digiturgude õigusakti (DMA) käsitlevad algatused.Objectives/eesmärkid:  Sellel kursusel tutvustatakse osalejatele Euroopa Liidu konkurentsiõiguse norme, mis on spetsialiseerunud Euroopa Komisjoni praktikale, Euroopa Liidu kohtute praktikale ning mõne liikmesriigi hiljutisemale ja asjakohasemale kohtupraktikale seoses digitaalsete turgudega. See hõlmab platvormimajandust, tarkvara litsentsimist, isikuandmete ja tehisintellektiga seotud vahendite kasutamist äritavades jne. Lisaks suunatakse kursus Euroopa Liidu tulevastesse seadusandlikesse algatustesse, mis on seotud digiülemineku algatusega, sealhulgas õigusaktide ettepanekutesse digiteenuste õigusakti (DSA) ja digiturgude õigusakti (DMA) kohta, rõhuasetusega nende õigusaktide osal turu reguleerimisel. Konkurentsiõigusega seotud väga erinevaid probleeme analüüsitakse koos erinevate õigusteemadega, et anda õpilastele tegelik probleemide lahendamise oskus ja laiem arusaam konkurentsieeskirjade toimimisest digitaalsetel turgudel.Learning outcomes/õpiväljund:  Üliõpilane: \n\n*õpib kohaldama konkurentsi käsitlevaid esmaseid ja teiseseid õigusakte, sealhulgas mittesiduvaid õigusakte. \n\n*õpib mõtlema turu määratluse kontseptsiooni ja teadma, kuidas määratleda nii asjaomane kaubaturg kui ka turu geograafiline ulatus (pidades silmas digitaalsete turgude määratlemise põhiloogikat); \n\n*õpib mõistma Euroopa Liidu konkurentsiõiguse põhielemente ja kriteeriume, teadma turgu valitseva seisundi ja kartellide vahelist erinevust ning mõistma tingimusi koondumiste kontrollimiseks digitaalsetel turgudel; \n\n*saab ülevaate uusimatest turu reguleerimise suundadest Euroopa Liidus, kaasa arvatud hiljutine seadusandlus (DSA ja DMA);\n \n*õpib analüüsima ja lahendama probleeme, kohaldades kohtupraktika põhimõtteid ja muid kursuse käigus saadud materjale ja teadmisi."}