{"KURSUSE_NIMI": "Intellektuaalsel omandil baseeruva ettevõtte elutsükli õiguslikud aspektid", "KURSUSE_KOOD": "OIEO.06.081", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Bakalaureuseeksam"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 38, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 108, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tegemist on erinevaid õigusvaldkondi hõlmava koondainega, mis käsitleb järgmiseid teemasid:\n1. IO-l baseeruvate ettevõtete elutsüklite ülevaade, innovatsioon ning erinevad ärimudelid\n2. IO-l baseeriva ettevõtte asutamine ning struktureerimine\n3. Peamised lepingulised suhted ettevõttes, kui eesmärgiks IO adekvaatne kaitse (asutajad, töötajad, alltöövõtjad)\n4. Risikikapitali kaasamine erinevates faasides, läbirääkimised\n5. Avalikud toetused, fondid\n6. IT ettevõte ja nn targad töösuhted: välistööjõu kaasamine, tööjõu motiveerimine, migratsiooniküsimused, optsioonid\n7. Ettevõtte IO strateegia kujundamine\n8. Maksuõiguslikud nüansid IO-l baseeruvas ettevõttes\n9. Raamatupidamine ja finantsarvestus seoses immateriaalse varaga\n10. Maksejõuetusõigus ning IO õigused.Objectives/eesmärkid:  Aine eesmärk on koolitada osalejaid olema valmis nõustama intellektuaalsel omandil baseeruvaid ettevõtteid nende ettevõtete erinevates arengufaasides. Aine raames avatakse intellektuaalse omandi probleemistiku nüansirikkus lõimituna erinevate õigusvaldkondadega, andes võimaluse omandada reaalse elu probleemide lahendamise oskust. \n\nIntellektuaalsel omandil (IO) baseeruvate ettevõtete elutsükkel koosneb tavaliselt järgmistest etappidest: seemne faas, stardifaas, kasvufaas, stabiliseerumine, laienemisfaas, küpsusfaas, väljumine. Antud kursus koolitab osalejaid olema valmis taoliseid IO-l baseeruvaid ettevõtteid nõustama lähtuvalt nimetatud etappide eripäradest.Learning outcomes/õpiväljund:  Kursuse läbinu: * mõistab erinevaid õiguslikke riske, mis taolistel ettevõtetel erinevates arengufaasides esineda võivad, ning oskab kujundada vajaliku tegevusstrateegia. * mõistab seoseid IO-l baseeruva ettevõtte elutsükli ning erinevate õiguse valdkondade vahel, * oskab hinnata ja luua juriidilisi strateegiaid, millega toetab ettevõtet erinevates arengufaasides."}