{"KURSUSE_NIMI": "Tehisintellekt ja õigus", "KURSUSE_KOOD": "OIEO.06.091", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Bakalaureuseeksam"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate eetilistest ja õiguslikest väljakutsetest tehisintellekti süsteemide ja (tarkade) robotite kasutamisest kehtivas (Euroopa) õigusnormistikus ning (tulevikus) kehtivatest võimalustest nende tehnoloogiate kasutamist reguleerida.Objectives/eesmärkid:  Kiire areng tehisintellekti (TI) ja robootika valdkonnas (mis tihti töötab teatud vormis TI tehnoloogial) esitab väljakutseid traditsioonilisele õiguse valdkonnale. TI süsteemid on laialdaselt kasutusel, võtmaks vastu otsuseid, mille kaugele ulatuvad tulemid avaldavad mõju indiviididele ja ühiskonnale.\nAinekursus uurib võimalusi, aga ka väljakutseid, mida TI süsteemid esitavad praegu kehtivale (Euroopa) õiguskorrale.\nLisaks annab see ülevaate mitmest võtmetähtsusega initsiatiivist eetika ja õigusregulatsioonide osas rahvusvahelisel ja Euroopa tasemel.Learning outcomes/õpiväljund:  Tudengid, kes läbivad õppeaine, on omandanud teadmised ja arusaamise:  - viimase aja tehnoloogia arengutest TI ja robootika valdkonnas; - aktuaalsematest eetilistest ja õiguslikest küsimuskohtadest, mis on tekkinud TI süsteemide ja (tarkade) robotite kasutamisega; - kohaldatavast õigusnormistikust, kontseptsioonidest, printsiipidest ning TI süsteemidele ja robootikale kohaldatavatest Euroopa õigusraamistiku regulatsioonidest ning Euroopa Kohtu ja Euroopa Inimõiguste Kohtu viimasest kohtupraktikast; - võtmetähtsusega eetika ja regulatsioonide initsiatiividest rahvusvahelisel ja Euroopa tasandil; - kuidas analüüsida tehnisintellekti ja robootikat puudutavaid õiguslikke küsimusi, saades sealjuures aru nende süsteemide kasutamise majanduslikest, poliitilistest ja sotsiaalsetest mõjuteguritest."}