{"KURSUSE_NIMI": "Lepingute koostamine", "KURSUSE_KOOD": "OIEO.06.098", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Asjaõigus", "Tsiviilõiguse üldosa", "Lepinguõigus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine raames tehakse esmalt sissejuhatus lepingute eripäradesse erinevates jurisdiktsioonides (sh common law, civil law riigid; Lääne- ja Ida-Euroopa; Põhjamaad), tutvustatakse lepingute ülesehitust ja peamisi osi, tüüptingimuste kasutamist, vormi ja allkirjastamist, mudeldokumentide kasutamist, läbirääkimiste taktikat, tehniliste lahenduste kasutamist ning peatutakse levinud vigadel lepingute koostamisel.\n\nSeejärel õpitakse lepingute koostamist M&A tehingu ja startup-ettevõttesse tehtava riskikapitaliinvesteeringu näitel. Selleks antakse ülevaade tehingu protsessist ja tehingu elluviimiseks vajalikest lepingutest, õpitakse koostama konfidentsiaaluslepingut (NDA), kavatsuste protokolli (LOI) ja Term Sheet-i, osa müügilepingut (SPA), investeerimislepingut (IA / SA), osanike vahelist lepingut (SHA) ning põhikirja (AOA).\n\nViimastes seminarides antakse ülevaade kinnisasjadega seotud lepingute sõlmimisest, õpitakse koostama üürilepingut, hüpoteegi seadmise lepingut ning muid asjaõiguslepinguid, ehitus- ja projekteerimislepingut, laenu- ja tagatislepinguid.Objectives/eesmärkid:  Õppeaine eesmärgiks on teadmiste omandamine lepingute koostamise põhialustest, -võimalustes ja -ohtudest. Lepingute koostamisel omandavad üliõpilased võla-, asja- ja ühinguõiguse praktilised rakendamisoskused.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: \n-\tteab lepingute koostamise põhialuseid, võimalusi ja ohtusid;\n-\tteab lepingute koostamise õiguslikke probleeme;\n-\tteab lepinguõiguslikke, asjaõiguslikke ja ühinguõiguslikke vahendeid poolte huvide realiseerimiseks ja kaitsmiseks;\n-\tkoostab lihtsamaid võla-, asja - ja ühinguõiguslikke lepinguid;\n-\ttunneb lepingute koostamisel ja allkirjastamisel kasutatavaid tehnilisi lahendusi."}