{"KURSUSE_NIMI": "Teadus- ja hariduspoliitika Euroopa Liidus", "KURSUSE_KOOD": "P2EC.00.247", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tutvustab EL-i ja Eesti haridus- ja teaduspoliitikate otsustusprotsesse ja väljundeid ning käsitleb haridussüsteemi erinevate tasandite hiljutisi ja käimasolevaid reforme. Kursusel lähenetakse õppimisele, õpetamisele ja teadusele erinevatest vaatenurkadest, käsitletakse trende ja tagajärgi tulevase tööturu ja riikliku võimekuse kontekstis nii EL-is kui selle liikmesriikides. Kursus on üles ehitatud ühendades diskussioonid, praktilised auditoorsed harjutused ja iseseisva töö. Kursuse märksõnad: võtmepädevused, hindamine, õppimise tüübid, elukestev õppimine, hariduslik mitmekesisus, teadusinnovatsioon, haridusreformid ja ühiskond, tuleviku tööturg, innovatsioon ja loovus, noored ja haridus, kodanikuaktiivsus.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvuda ja analüüsida EL-i haridus- ja teaduspoliitikat üldiselt ning selle toetavat ja osaliselt suunavat rolli liikmesriikide haridus- ja teaduspoliitika kujundamises. Kursusel käsitletakse EL-i haridus- ja teaduspoliitikat läbi kesksete võtmepädevuste, kodakondsuskäsitluste ja normide (sh Euroopa väärtuste), meetmeteks olevate standardite ja heade praktikate, Euroopa haridus- ja teadusruumi, valdkondlike tegevuskavade, arengukavade, raamprogrammide ja missioonide valdkondade põhjal ning seoses tõstatatud väljakutsetega, mis ootavad ees tööturul ja on vajalikud laiemalt kaasaegses maailmas toimetulekuks. Kursusel analüüsitakse EL-i seisukohti, programme ja meetmeid võrdluses liikmesriikide prorgrammide ja nende rakendustega.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - nimetab EL võtmepädevusi ja mõistab nende sisu ja oluliste pädevuste rolli erinevate poliitikate arendamisega seotud valdkondades, nagu ühiskondlikud muutused, kommunikatsioon, isiklik areng, tööturg, kriisid ja reformid, väärtused ja mitmekesisus; - orienteerub oluliste EL-i hariduspoliitikate seas, mõistab suhteid EL-i, riiklike, regionaalsete ja kohalike poliitikate vahel ja analüüsib kriitiliselt Eesti haridusreformide tausta, kasutades EL-i ametlikke andmebaase, meediatekste, teadusartikleid; - demosntreerib praktilisi oskusi, mis on olulised poliitikate ja raportite väljatöötamiseks, rakendamiseks ja tagasisidestamiseks; - demonstreerib ettevõtlikke ja eksperimentaalseid oskusi, mida on arendanud haridusreformide analüüsi ja harjutuste käigus; - on arendanud grupis töötades oma suhtlemisoskust. Võtmepädevused: mõtestamise võime, sotsiaalne intellekt, uudne ja adaptiivne mõtlemine, kultuuride vaheline pädevus, uue meedia kirjaoskus, transidistsiplinaarsus, kognitiivsete protsesside juhtimine."}