{"KURSUSE_NIMI": "EL regionaal- ja ühtekuuluvuspoliitika", "KURSUSE_KOOD": "P2EC.00.209", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse keskseteks teemadeks on: perifeeria olemus seoses keskustega; perifeeria majanduslik konkurentsivõime - pikaajalised trendid ja kriisi mõjud; perifeeria võrgustavas majanduses - globaliseerumine ja tootmisahelad;  perifeeriate ühenduvus - transport, IT; rajasõltuvus ja sotsiaalne innovatsioon; perifeerne identiteet ja kultuur arengutegurina; avaliku võimu ja poliitikate roll arengu suunamisel - institutsioonid, poliitikameetmed ja isiksused; riikide haldus-territoriaalne korraldus ja regioonide autonoomia; strateegiline planeerimine ja arendustegevuse teadmistepõhisus.\n\nMeetodid, mida õpitakse: kvantitatiivne andmeanalüüs, indikaatorid ja indeksid, võrdlev territoriaalanalüüs, dokumendianalüüs, intervjuu, espertmeetodid, hindamismeetodid.\n\nKursuse märksõnad: perifeeria, sotsiaal-majanduslik areng, regionaalne geograafia, regionaalsed poliitikad, poliitikate sekkumise hindamine.Objectives/eesmärkid:  Aine eesmärgiks on suurendada teadmisi regionaalsete arengueristuste olemusest ja põhjustest, ebaühtlasest regionaalarengust ning EL regionaalpoliitikast, samuti arendada oskusi teadmistepõhiste arenduspoliitikate välja töötamisel.Learning outcomes/õpiväljund:  Kursuse lõpuks üliõpilane:\n-\tMõistab regionaalse arengu olemust ja nimetab arengu tegureid, perifeeria ja keskuste omavahelisi seoseid\n-\tNimetab olulisemaid EL, riiklikke, regionaalseid ja kohalikke poliitikaid, mis kujundavad regioonide arengut\n-\tDefineerib strateegilise planeerimise ja ruumiplaneerimise põhimõtetest\n-\tKasutab rahvusvahelisi võrdlevaid andmebaase territoriaalsete üksuste iseloomustamisel ja tüpologiseerimisel\n-\tViib iseseisvalt läbi dokumendianalüüsi, sõnastab uurimiseesmärke ja tulemusi ning neid kaitseb\n-\tKoostab intervjuukava, teostab intervjuusid ning analüüsib kriitiliselt intervjuude vastuseid ühendatuna dokumendianalüüsiga\n\n-\tRakendab teadmisi poliitikavalikute eelhindamisest\n\n\nVõtmepädevused: mõtestamise võime, sotsiaalne intellekt, uudne ja kohanemisvõimeline mõtlemine."}