{"KURSUSE_NIMI": "Võim rahvusvahelises poliitikas", "KURSUSE_KOOD": "P2EC.00.213", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 14, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "The course will examine a broad number of theoretical and empirical understandings of power in the international system.Objectives/eesmärkid:  Power is a multidimensional and a relational concept. In the discipline of International Relations (IR), power is ubiquitous: indeed, the very nature of international politics has been described as 'power politics' (Morgenthau 1948). Realists have used power as a central concept for explaining actor interests and outcomes, analysing it mainly through military and material indicators or some composite index involving GDP. As well as covering realist interpretations and the military aspects of power, this course will seek to grant insight into the radical, constructivist, and liberal theories of power in IR. Power, its origins and dynamics, represents one of the most pertinent concepts in world politics, in discussing the various forms of power (e.g., material/hard; ideational/soft power; 'power to'; 'power from; 'power over'; power as a relation and as practice), this course will simultaneously seek to examine the wielding of power in different empirical scenarios within the international system.Learning outcomes/õpiväljund:  By the end of this course: 1. Students will have broadened their theoretical understanding of power in International Relations to include realist, liberal, contructivist and radical perspectives;  2. Students will be able to put military power into context as an important aspect that shapes international politics, while also understanding that military power is just one of many important varieties of power determining relations between states;   3. Students will have gained a detailed understanding of the concepts of power beyond the mainstream IR theories such as hegemony and structural power; 4. Students will have attained important insights into how power is wielded at different levels of the international system such as within the European Union, between the members of the United Nations Security Council, by middle powers seeking to shape international order through multilateralism, and by revolutionary political organizations;  5. Students will have furthered their analytical skills in writing an argumentative scholarly research paper answering a question that deals with an important aspect of power in the international system."}