{"KURSUSE_NIMI": "EL Eestis ja Eesti EL-is", "KURSUSE_KOOD": "P2EC.00.246", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "The course \"EU in Estonia and Estonia in the EU\" discusses and critically contextualizes how Estonia and the EU are mutually affected and transformed by each other. It is a bridge between specific policy cases and the practical and applied dimension of Europeanization. The learning process works intersectionally by exposing students to different instances of top-down and bottom-up changes induced by Estonia's membership in the EU. In this case, the policy analysis approach is used, together with contributions from policy makers and experts, under the coordination of the lecturer responsible for the course. While, following an introductory sessions, the seven meetings of the courses focus on individal cases, practical and analytical knowledge are combined and tested during every meeting.Objectives/eesmärkid:  The objective of the course is to provide students with an overview of Estonia's role in the construction of the European Union and advancement of the process of European integration as well as impact of the EU on Estonia's political and socio-economic change. The course very directly relates to the dimension of europeanization, both in its top-down and bottom-up perspectives. While this dimension is only marginally introduced theoretically and conceptually, its practical evaluation is key to the logic of the course which looks at practical and relevant case studies. Experts and policy makers are directly involved in the teaching activities.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Upon completion of the course, students will be able to: \n\n- practically understand the implications of Europeanization in Estonia \n\n- critically assess the idea of differentiated integration and its practical implications in the Estonian context \n\n- describe and contextualize Estonia's role and input in the process of European integration \n\n- practically understand the connection between national and supranational decision-making in the Estonian context \n\n- apply specialized concepts and terminology related to the study of policies and policy-making correctly and appropriately;"}