{"KURSUSE_NIMI": "Euroopa Liidu poliitika kujundamine", "KURSUSE_KOOD": "P2EC.00.248", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on praktilise suunitlusega. Rõhuasetus on järgmistel küsimustel: kuidas ja kui hästi Euroopa Liidu poliitiline ja valitsemissüsteem toimib ning millised on võimalused süsteemi toimimist paremaks muuta? Ainekursus koosneb loengutest ja seminaridest, mis jagunevad seitsme õppesessiooni vahel, ja iseseisvast tööst. Teadmiste kinnistamisele aitavad kaasa veebipõhised lühitestid; samuti tuleb osalejatel koostada kirjalik analüüs, pidada lühike suuline ettekanne ning sooritada kirjalik lõppeksam.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade Euroopa Liidu peamistest institutsioonidest - nende ülesehitusest, ülesannetest, toimimisest ja mõjust - ja poliitikakujundamise ning otsustetegemise protsessist. Samuti käsitleb kursus EL-i poliitikate elluviimist keerulises mitmetasandilises valitsemissüsteemis. Käsitleme ka küsimust, kuidas ja milliste kriteeriumite alusel Euroopa Liidu poliitilise ja valitsemissüsteemi toimimist võiks hinnata ning arutame erinevaid ettepanekuid liidu institutsioonide ja poliitikakujundamise protsessi reformimiseks.Learning outcomes/õpiväljund:  Olles kursuse läbinud, peaksid Sa:\n\n* oskama kirjeldada Euroopa Liidu viie peamise institutsiooni ülesehitust, rolli, ülesandeid, kujunemislugu, toimimist ja mõju;\n\n\n* suutma selgitada ja põhjendada, kuidas ja milliste kriteeriumite alusel Euroopa Liidu poliitilise ja valitsemissüsteemi toimimist võiks hinnata;\n* tundma peamisi mõisteid ja termineid, mida kasutatakse Euroopa Liidu institutsioonide ning poliitikakujundamise teemalises kirjanduses ja aruteludes;\n* oskama kirjeldada poliitikakujundamise protsessi Euroopa Liidus ning teadma, milline on peamiste institutsioonide, liikmesriikide, huvigruppide ja kodanike roll selles;\n* teadma, kuidas toimub õigusaktide vastuvõtmine seadusandliku tavamenetluse raames; olema kursis teiste peamiste EL-i otsustusmehhanismidega;\n* suutma selgitada, kuidas Euroopa Liidu poliitikaid rakendatakse ja mitmel tasandil ellu viiakse; tundma ja nimetama mitmetasandilise valitsemise probleeme ja kitsaskohti;\n* teadma, millised on peamised ettepanekud Euroopa Liidu institutsioonide ja poliitikakujundamise protsessi reformimiseks ning oskama neid ettepanekuid kriitiliselt hinnata."}