{"KURSUSE_NIMI": "Sotsiaalteaduslik metodoloogia", "KURSUSE_KOOD": "P2EC.00.072", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursus koosneb seitsmest õppesessioonist (loengud ja seminarid, COVID-piirangute korral: interaktiivsed vebinarid) ja iseseisvast tööst kirjanduse ja materjalidega. Aine annab laiapõhjalise ülevaate sotsiaalteadusliku uurimistöö ülesehitamisest ja läbiviimisest ning valmistab osalejaid ette magistritöö koostamiseks. Alustame küsimusest, mis on teadus ja millistele kriteeriumitele 'hea' teadus peaks vastama. Arutleme selle üle, kas ja kuidas erinevad üksteisest loodus- ja sotsiaalteadused. Keskendume teadustöö ülesehitusele: mis on teooria, hüpotees, mõisted, muutujad, analüüsiühik ja -tasand ning kuidas neid elemente oma töös õigesti kasutada? Selgitame, mis on juhtumiuuringu, võrdlev uurimuse, ning kvantitatiivse analüüsi erinevused ja millal kasutada üht või teist lähenemist. Käsitleme muutujate operatsionaliseerimist ning tutvume andmestike ning peamiste andmekogumismeetodite ja põhimõtetega (sh eetikaküsimused).  Kursus annab ülevaate peamistest kvalitatiivsetest ja kvantitatiivsetest uurimismeetoditest koos juhistega, kust leida täiendavat infot. Tutvustatakse sotsiaalteadusliku uurimuse üldloogikat, põhikomponente ning kvaliteedikriteeriume, samuti uuringu kavandamise ja teostamise etappe. Ainekursuse läbimiseks tuleb sooritada viis lühikest veebitesti, koostada teadusartikli analüüs ning oma magistritöö kavand.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade sotsiaalteaduste olemusest ning peamistest andmekogumise ja -analüüsi meetoditest ning tõsta seeläbi magistrantide võimekust sotsiaalteaduslikke uuringuid mõista, neid läbi viia ja neid kriitiliselt hinnata. Kursus valmistab magistrante ette magistritöö kirjutamiseks.Learning outcomes/õpiväljund:  Olles kursuse läbinud, peaksid Sa:  * teadma, mis on loodusteaduste ja sotsiaalteaduste ühised tunnused ning erinevused; omama seisukohta sotsiaalteaduste teaduslikkuse küsimuses ja suutma seda kaitsta; * teadma, millised on sotsiaalteadusi suunavad huvid ning tegema vahet akadeemiliste ja rakenduslike sotsiaalteaduslike uuringute eesmärkides; * mõistma, mis on teooria, hüpotees, uurimisküsimus, muutujad, andmed ja andmeanalüüs, tulemused ja järeldused, oskama selgitada, kuidas need omavahel seotud on,  ning oskama neid oma teadustöös õigesti kasutada; * oskama selgitada kvalitatiivsete ja kvantitatiivsete uurimismeetodite erinevusi, peamisi eeliseid ja puudusi; oskama valida sobiva meetodi tulenevalt uurimisülesande laadist ja andmete iseloomust; * omama ülevaadet uurimisprotsessi etappidest, oskama teadusartiklit/magistritööd/uuringuraportit õigesti üles ehitada, teadvustama olulisemaid teadustöö põhimõtteid ja norme, sh eetikaga seonduvaid; * oskama senisest paremini mõista ja hinnata sotsiaalteaduslikke artikleid ja uuringuraporteid; * tundma end senisest märksa kindlamalt sotsiaalteadusliku uurimistöö tegemisel, saadud tulemuste esitlemisel ja argumenteeritud kaitsmisel."}