{"KURSUSE_NIMI": "Windows administreerimine", "KURSUSE_KOOD": "P2NC.01.089", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 6, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 74, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines käsitletakse Windows-tööjaamade peamisi haldamise tegevusi: Windows operatsioonisüsteemi (hulgi)paigaldus, uuendamine, migreerimine. Võrguühenduste, tulemüüri seadistamine ja põhilisi töövahendeid. Käsitletakse Windows Server operatsioonisüsteemil baseeruvate serverite paigaldus, haldamine, turvamine ning veaotsing.Objectives/eesmärkid:  Õppeaine eesmärgiks on tutvustada õppijale Windows operatsioonisüsteemiga tööjaamade haldamise vahendeid ja peamisi töövõtteid ning arendada seeläbi tööjaamade haldamise põhioskuseid ja -teadmisi, tutvustada Windows Server operatsioonisüsteemil baseeruvate serverite paigaldust, haldamist ja turvamist, õppeaine arendab õppija administreerimisoskuseid ning teadmisi serveritel kasutatavatest operatsioonisüsteemidest.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: \n\nloob tagavarakoopiaid ning teostab lihtsamatel juhtudel riknenud andmete taastamist tagavarakoopiate abiga.  \n\nseadistab Windows tööjaamade põhiparameetreid (võrguühendused, tulemüür, ligipääsuõigused, uuendused).  \n\nteab ja kasutab Windows-tööjaamade peamisi paigaldusmeetodeid. \n\n paigaldab Windows Server tarkvaratoote.  \n\nselgitab Windows Serveri peamiseid rolle ning nende ülesandeid.  \n\npaigaldab Windows Server'ile AD DS, DHCP, DNS ning failiserveri rolle ning neid lihtsamatel juhtudel seadistada. \n\noskab hallata kasutajaid ning kasutajate gruppe ning rakendada grupipoliitikaid.  \n\nteostab lihtsamatel juhtudel tagavarakoopiaid ning taastab tagavarakoopiate abil riknenud andmeid taastada. Hilinenud tööde esitamise eest ei ole võimalik saada maksimaalne (max) punktide arv (vt. hindamismeetodid ja -kriteeriumid). Sel juhul õppejõud otsustab iseseisvalt millised punktid saab õppija."}