{"KURSUSE_NIMI": "Sissejuhatus koolieelsesse pedagoogikasse", "KURSUSE_KOOD": "P2NC.00.089", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 15, "practice": 0, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Alushariduse korraldus Eestis. Ülevaade lasteaedade kujunemisloost ja pedagoogilistest lähenemisviisidest Eestis ja Euroopas. Eelkoolipedagoogika ja alushariduse põhimõisted, printsiibid ja tähendus. Lapsest lähtuv õppimine, õpetamine ja õpikeskkonna loomine. Koolieelse lasteasutuse riiklik õppekava, lasteaia õppekava koostamise põhimõtted ja rühma dokumentatsioon. Üldõpetuse tähendus, õppe- ja kasvatustegevuse valdkondade ja tegevuste lõiming. Didaktika tähendus ja printsiibid eelkoolipedagoogikas. Õppetegevuste eesmärgistamise põhimõtted. Õppe- ja kasvatusmeetodid, laste tunnustamine ja lastele tagasiside andmine. Pedagoogiline dokumenteerimine - lapse õppimise nähtavaks tegemine lapsele ja täiskasvanutele. Õppekasvatustegevuse analüüs ja hindamine erinevaid osapooli kaasates: meeskonna ja laste tagasiside kasutamise võimalused. Koolieelse lasteasutuse õpetaja roll ja ülesanded lasteasutuses, pedagoogi kutse-eetika.Objectives/eesmärkid:  Luua võimalused koolieelse pedagoogika teoreetiliste aluste mõistmiseks, toetada üliõpilaste oskuste kujunemist õppekasvatustegevuse kavandamiseks, analüüsimiseks ja läbiviimiseks koolieelses lasteasutuses.Learning outcomes/õpiväljund:  Üliõpilane 1)\torienteerub alushariduse pedagoogilistes suundumustes ja eelkooliealise lapse kasvatamise ning õpetamise põhialustes;  2)\ttunneb alusharidust reguleerivat seadusandlust ja sellest tulenevat tegevuse korraldust lasteaias;  3)\ttunneb lasteaia õppe- ja kasvatustegevuse kavandamise, läbiviimise, analüüsimise aluseid ning oskab sellele tuginedes lapse individuaalsusest lähtuvalt kavandada lapsekeskset tegevust;  4)\tteab õpetaja ülesandeid ja kutse-eetikat ning suudab reflekteerida enda tegevust alushariduse pedagoogina ja kavandada enda erialast arengut. 5)\tsuudab meeskonnatööna koostada ja esitada ettekannet kasutades selleks infotehnoloogilisi pädevusi."}