{"KURSUSE_NIMI": "Suhtlemispsühholoogia", "KURSUSE_KOOD": "P2NC.00.085", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 4, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1) Suhtlemise mõiste ja olemus. Suhtlemisvahendid, suhtlemisoskused (kontakti loomine, kuulamine, enesekehtestamine, eneseväljendamine, konfliktijuhtimine).\n2) Sotsiaalne taju - isikutaju, isikutaju vead.\n3) Sotsiaalne interaktsioon - suhtlejate vastastikmõju, grupiprotsessid, koostöö.\n4) Inimestevahelised sotsiaalsed suhted ja isiksuslikud seosed, suhtlemise individuaalsed iseärasused.\nSuhtlemise eripära meeskonnas ja rühmas.\n5) Suhtlemissituatsioonid ja -ülesanded. Enda suhtlemiskompetentsuse arendamine ja analüüs.Objectives/eesmärkid:  Kursuse eesmärgiks on: - anda ülevaade suhtlemise põhitõdedest; - anda meetodid oma kommunikatsioonioskuste pidevaks jälgimiseks ning arendamiseks; - kujundada valmisolekut töös ette tulevateks erinevateks suhtlusolukordadeks; - kujundada harjumust järgida head suhtlemistava; kujundada oskust jagada ja vastu võtta erinevat tagasisidet.Learning outcomes/õpiväljund:  - oskab aktiivselt kuulata, küsitleda, ennast kehtestada ning tuleb toime konflikti- ning läbirääkimisolukordadega; - oskab analüüsida oma suhtlemisoskusi ning tuleb toime enda treenimisega; - teab häid suhtlemistavasid; - tajub ja oskab anda erinevat tüüpi tagasisidet, olla motiveeriv vestluspartner; - omab ülevaadet töös ette tulevatest erinevatest suhtlusolukordadest ning oskab rakendada erinevaid kommunikatiivseid pädevusi vastavalt vajadusele; - oskab märgata ja kujundada lastes ja noortes suhtlemisoskusi ning harjumusi järgida head suhtlemistava; - oskab arvestada erinevate sihtgruppide kommunikatiivsete vajadustega; - on motiveeritud oma kommunikatsioonialast pädevust pidevalt kriitiliselt analüüsima ja elukestvalt harjutama."}