{"KURSUSE_NIMI": "Tervis ja heaolu koolieelses lasteasutuses", "KURSUSE_KOOD": "P2NC.01.142", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tervis ja tervise erinevad kontseptsioonid. Tervisedenduse ja -kasvatuse mõiste, põhimõtted, tegevused ja mõju. Ülevaade inimesest kui tervikorganismist. Lapse tervist mõjutavad tegurid koolieelses eas, sh koolieelses lasteasutuses. Terve psühhosotsiaalne ja füüsiline kasvukeskkond ja selle kujundamine koolieelses lasteasutuses. Tervist edendava haridusasutuse põhimõtted ja tegevusvaldkonnad. Tervise ja heaoluga seotud uuringud, seadusandlus ja statistika. Tervislik eluviis ja selle kujundamise võimalused läbi õppe- ja kasvatustegevuse.Objectives/eesmärkid:  Anda tervisedenduse ja -kasvatuse baasteadmised ja oskused, et käsitleda tervise sh turvalisuse ja heaolu teemasid süsteemselt koolieelses lasteasutuses.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane: 1.\torienteerub tervise erinevates kontseptsioonides 2.\tmõistab tervisedenduse ja tervisekasvatuse olemust, tegevuse eesmärke ning nende mõju indiviidi ja organisatsiooni heaolule 3.\toskab planeerida lapse tervisliku arengu toetamiseks tõenduspõhiseid tegevusi ning mõistab nende mõju 4.\tteab lapse tervist mõjutavaid tegureid koolieelses eas ja lasteasutuses ning oskab neid seostada lapse tervise ja heaoluga 5.\tteab ja oskab kujundada tervet psühhosotsiaalset ja füüsilist kasvukeskkonda koolieelses lasteasutuses 6.\ttunneb tervist edendava lasteasutuse põhimõtteid ja tegevusvaldkondi 7.\torienteerub tervise ja heaoluga seotud uuringutes, seadusandluses ja statistikas 8.\toskab riikliku õppekava eesmärkidest lähtuvalt kavandada õppe- ja kasvatustegevusi tervise ja turvalisuse teemadel kasutades lõimitud ja lapsekeskseid tegevusi"}