{"KURSUSE_NIMI": "Inimõigused ja haridus", "KURSUSE_KOOD": "P2OG.02.219", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "The course will enable students to understand what are the necessary knowledges, skills and attitudes to act as human rights educators. The course relies on the definition of human rights education as encompassing \"education, training, awareness raising, information, practices and activities which aim - by equipping learners with knowledge, skills and understanding and developing their attitudes and behaviour - to empower learners to contribute to the building and defence of a universal culture of human rights in society, with a view to the promotion and protection of human rights and fundamental freedoms\" (Council of Europe's Charter on Education for Democratic Citizenship and Human Rights Education, 2010).\n\nStudents who complete this course will be able to apply the learning content within the practice module P2OG.02.216 and practice teaching human rights.Objectives/eesmärkid:  To provide a broad understanding of human rights education, its political development in the last decades, its pedagogical principles, the methodology for teaching human rights and to enable students to design educational activities and take action for human rights.Learning outcomes/õpiväljund:  The student who has passed this course is able to: *\tUnderstand what is human rights education and its development in the last decades *\tUnderstand the pedagogical principles for human rights education *\tShow awareness for the methodology to be used for different learning contexts for human rights learning *\tIs able to design human rights education activities *      Understands what is human rights activism and to design plans of action for human rights."}