{"KURSUSE_NIMI": "Bakalaureuseeksam", "KURSUSE_KOOD": "P2OG.00.007", "EAP": 6, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 148, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Bakalaureuseeksamil peab üliõpilane lahendama kolm kaasusülesannet, mis on järgmistest õigusvaldkondadest: tsiviilõigus (tsiviilõiguse üldosa, võlaõiguse üldosa, lepinguõigus, lepinguväliste võlasuhete õigus ja asjaõigus), avalik õigus (haldusõigus) ning karistusõigus.Objectives/eesmärkid:  Bakalaureuseeksami üldine eesmärk on kontrollida õppekava moodulite üld- ja õpieesmärkide saavutamist bakalaureuseastme alusteadmiste ulatuses läbi kaasusülesannete lahendamise karistus-, haldus- ja tsiviilõiguses.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Bakalaureuseeksami positiivsele hindele sooritanud üliõpilane:\n- omab alusteadmisi era- ja avaliku, Euroopa Liidu ja rahvusvahelise õiguse valdkonnas ulatuses, mis võimaldavad süvendatult õppida erialaaineid magistriastmes;\n- tunneb õigusvaldkondade omavahelisi seoseid ning mõistab nende toimimist praktikas;\n- tunneb olulisemaid õigusaktet, teab nende eesmärke ning kohaldamispõhimõtteid;\n- oskab kasutada omandatud teoreetilisi teadmisi praktiliste vaidluste ja õiguslike probleemide lahendamisel;\n- valdab õiguse terminoloogiat, oskab esitada ja analüüsida õiguslikke probleeme;\n- valdab õiguskeelt, oskab oma seisukohti väljendada ning argumenteerida;\n- oskab töötada allikmaterjalidega, tunneb kohtupraktikat ning oskab seda kasutada õigusprobleemide lahendamisel;\n- valdab kaasuste lahendamise metoodikat. NB! ÕIS võimaldab registreerida üksnes ühele eksamikuupäevale!\n\nAktusel saavad lõpudiplomi üliõpilased, kes on sooritavad eksami positiivsele tulemusele esimesel eksamiajal. Teisel eksamiajal positiivselt lõpetavad üliõpilased saavad diplomi õppeosakonnast hiljem."}