{"KURSUSE_NIMI": "Rooma eraõigus", "KURSUSE_KOOD": "P2OG.01.026", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Õiguse ja õigusmõtte ajalugu"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antakse ülevaade Vana-Roomas 8. sajandist e.Kr. kuni 6.sajandini p.Kr. kehtinud õigussüsteemi ühest osast--eraõigusest, mille alusel kujunes välja hilisem tsiviilõiguslik traditsioon. Käsitletakse kõiki põhilisi Rooma eraõiguse valdkondi: isikuõigust, perekonna- ja protsessiõigust, asja-, võla - ja pärimisõigust võrdlevalt tänapäeva Eesti ja muude Rooma õigusel põhinevate õigussüsteemidega. Selgitatakse erinevate eraõiguse süsteemide põhimõtteid ja käsitletakse mõistete kujunemislugu ning tähendusmuutusi erinevates õigussüsteemides.Objectives/eesmärkid:  Õppeaine läbinud üliõpilasel on ülevaade Kontinentaal-Euroopa õigussüsteemide, k.a. Eesti õiguse aluseks oleva Rooma õiguse ühest osast - eraõigusest - ning selle põhimõistetest, struktuurist ning toimimisalustest võrdlevalt tänapäevaga. Üliõpilane on tutvunud eraõiguse põhimõistete ning nende tekke/tekkepõhjustega Roomas ning õppinud kaasuse lahendamist.Learning outcomes/õpiväljund:  Õppekava edukal läbimisel peab üliõpilane oskama:\n* selgitada Rooma eraõiguse (ja Eesti kehtiva eraõiguse) põhimõistete sisu;\n* eraõiguse põhimõtteid ning toimimisaluseid;\n* orienteeruda Rooma eraõiguse süsteemis Gaiuse Institutsioonide alusel;\n* aru saada normist, selle kuuluvusest teatud valdkonda;\n* paigutada normi vastava eraõiguse instituudi konteksti.\n* ühtlasi olema võimeline üldistatult võrdlema Rooma norme tänapäevastega (kasutades EV seadusi) ning arutlema eraõiguse instituutide tekke/tekkimispõhjuste/vajaduste üle;\n* lahendada õigusliku probleemiga kaasust Rooma õiguse allikate alusel ja argumenteerida allikate pinnalt;\n* olema omandanud algtasemel ja oskama praktiliselt rakendada üliõpilastööde viitamise ja teadusliku käsitluse põhireegleid;\n* mõistma rühmatöö koostamise ja vormistamise, ajaplaneerimise ja tulemuste suulise esitamise põhimõtteid."}