{"KURSUSE_NIMI": "Kaasuste lahendamise eriseminar eraõiguses", "KURSUSE_KOOD": "P2OG.01.106", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Tsiviilõiguse üldosa", "Võlaõiguse üldosa", "Asjaõigus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Käsitletakse olulisemaid võla- ja asjaõiguse instituute nagu lepingueelsed läbirääkimised, lepingutest tulenevad nõuded, lepinguvälise kahju hüvitamine, alusetu rikastumine ning olulisemad asjaõiguslikud nõuded. Uuritakse ning lahendatakse komplekskaasusi (individuaalselt ja rühmatööna), mis eeldavad teadmisi ülalnimetatud instituutide ning nende omavaheliste seoste kohta.Objectives/eesmärkid:  Aine üldeesmärgiks on anda ülevaade olulisemate tsiviilõiguse instituutide omavahelistest seostest praktiliste kaasuste näitel ning omandada esmased teadmised nimetatud tsiviilõiguse instituutidega seotud praktiliste kaasuste lahendamiseks. Ainekursus toetab valmistumist bakalaureuseeksamiks.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine õpieesmärgiks on omandada oskused praktiliste kaasuste lahendamiseks võla- ja asjaõiguse olulisemates valdkondades, eelkõige lepingueelsete läbirääkimiste, lepingute, lepinguvälise kahju, alusetu rikastumise ning olulisemate asjaõiguslike instituutide üle toimuvates vaidlustes, mille erinevad elemendid on seotud erinevate ülalnimetatud võla- ja asjaõiguse instituutidega ning mille lahendamiseks on vajalik tunda vastavate instituutide omavahelisi seoseid.\n\nPärast kursuse lõppu üliõpilane:\n - on omandanud põhiliste tsiviilõiguse instituutidega seotud komplekskaasuste lahendamiseks vajalikud teadmised;\n - suudab eristada erinevaid tsiviilõiguslikke instituute; \n - mõistab seoseid erinevate tsiviilõiguslike instituutide vahel; \n - suudab iseseisvalt lahendada lihtsamaid komplekskaasusi; \n - kasutab kaasuste lahendamisel õiguskirjandust ja kohtupraktikat."}