{"KURSUSE_NIMI": "Andmekaitse", "KURSUSE_KOOD": "P2OG.01.061", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "1.\tAndmekaitseõiguse kujunemine. Andmekaitsealased õigusaktid ELs. (videoloeng, iseseisev õpe)\n2.\tIKÜM esemeline/territoriaalne kohaldamisala. One-shop mehhanism. Kolmandatesse riikidesse andmete edastamine.\nIKSi ja IKÜMi kohaldamisala Eestis.\n3.\tAndmekaitse põhimõisted\n4.\tAndmekaitse põhimõtted ning töötlemise õiguslikud alused.\n5.\tNõusolek, õigustatud huvi; vastuväited; kustutamisnõue\n6.\tVäljendusvabadus vs eraelu puutumatus\n7.\tEriliiki isikuandmed. Nõuded siseriiklikule regulatsioonile. Eriliiki isikuandmed töösuhetes.\n8.\tAvaliku sektori andmetöötlus (automaatsed haldusaktid, proaktiivsed teenused, riigi andmekogud); IKÜM art 23 alusel piirangute kehtestamine\n9.\tAndmekaitsetingimused. Andmesubjekti õigus tutvuda enda kohta käivate andmetega.\n10.\tAndmeturveObjectives/eesmärkid:  Anda andmekaitseõiguse baasteadmised ning juhtida tähelepanu praktikas eksisteerivatele kitsaskohtadele. Kursusel käsitletakse teooriat käsikäes praktiliste kaasuste ja näidetega. Kursuse läbimine annab õpilasele vajaliku baasi edasiseks süvendatud uurimistööks või andmekaitsespetsialisti väljaõppeks. Kuivõrd isikuandmed on kõikjal, on andmekaitseõiguse baasteadmised kasulikud pea igas valdkonnas, ent kindlasti vajalikud tulevases õigusloometöös ning avaliku sektori andmetöötluse korraldamisel.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: -\ttunneb andmekaitset reguleerivaid õigusakte, ja EL andmekaitseõiguse mõisteid, põhimõtteid ja isikuandmete töötlemise põhilisi reegleid ning oskab IKÜMit ning isikuandmete kaitse seadust rakendada kaasuste lahendamisel.  -\tmõistab andmekaitse seost põhiõigustega ning põhiõiguse riive tingimusi. -\tOskab leida ja kasutada teemakohaseid materjale."}