{"KURSUSE_NIMI": "Keskkonnaõigus", "KURSUSE_KOOD": "P2OG.02.168", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Haldusprotsess"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Keskkonnaõiguse loengute ja seminaride raames käsitletakse keskkonnaõiguse kujunemist, keskkonnakaitse eesmärke ja keskkonnaväärtusi, keskkonnaõiguse põhimõisteid ja põhimõtteid, keskkonnaalase regulatsiooni tasandeid, keskkonnaõiguse reguleerimisvahendeid, keskkonnaalaseid õigusi ja kohustusi, keskkonnaalaste normide täitmise jälgimist ja kontrolli, keskkonnavastutust ning keskkonnaõiguse eriosa olulisemate valdkondade regulatsiooni põhialuseid. Ainekursus hõlmab Euroopa Inimõiguste Kohtu, Euroopa Liidu Kohtu ja Eesti vastava kohtupraktika tundmaõppimist.Objectives/eesmärkid:  Keskkonnaõiguse õppeaine eesmärk on õpetada keskkonnaõiguse teoreetilisi põhialuseid, selgitada keskkonnaõiguse põhimõisteid, põhimõtteid ning keskkonnaalaste õiguste ja kohustuste süsteemi. Samuti anda ülevaade keskkonnaõiguse reguleerimisvahenditest ja keskkonnahäiringute õigusliku kontrolli olulisematest tasanditest.Learning outcomes/õpiväljund:  Kursuse lõpuks üliõpilane: 1. Selgitab keskkonnaõiguse põhimõistete ja olulisemate põhimõtete sisu ning  kasutab neid keskkonnaõiguslike probleemide lahendamisel. 2. Eristab keskkonnaõiguse regulatsiooni erinevaid tasandeid (rahvusvaheline, EL, siseriiklik), seostab neid omavahel ja oskab valida keskkonnaõigusliku probleemi lahendamiseks sobiva tasandi õigusakti. 3. Teeb vahet keskkonnaõiguse reguleerimisvahenditel ning oskab hinnata erinevate reguleerimisvahendite õigusliku režiimi kohaldatavust konkreetsetele elulistele asjaoludele.    \n 4. Tunneb keskkonnahäiringute kontrolli õiguslike vahendite süsteemi ja mõistab selle toimimist. 5. Omab ülevaadet keskkonnaõiguse eriosa olulisemate valdkondade regulatsiooni põhialustest. 6.\tOskab hinnata meeskonnatöö rolli ülesannete lahendamisel ning enda osatähtsust meeskonnatöös (võtmepädevused). "}