{"KURSUSE_NIMI": "Rahvusvaheliste institutsioonide õigus", "KURSUSE_KOOD": "P2OG.02.197", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kuna suur osa rahvusvahelisest õigusest on kirjutatud rahvusvaheliste organisatsioonide poolt või nende egiidi all, on oluline tunda ka nende organisatsioonide ja institutsioonide õiguslikku raamistikku, nende pädevusi ning nende toimimist, aga ka nende panust rahvusvahelise õiguse arengusse. Kursuse käigus antakse ülevaade rahvusvaheliste institutsioonide õigusest, so nende ülesehitusest, nende õigustest ja kohustustest, nende õigusloome pädevusest, neile antud privileegidest ja immuniteetidest ning nende rahvusvahelisest vastutusest. Lisaks teoreetilisele ülevaatele analüüsitakse kursuse käigus ka rahvusvaheliste kohtute otsuseid ning asjassepuutuvate rahvusvaheliste komisjonide arutelusid ja aruandeid.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade rahvusvahelisetest institutsioonidest, nende õiguslikust ja materiaalsest toimimisest, nende tegevust reguleerivatest reeglitest ja õigusaktidest ning rahvusvaheliste organisatsioonide vastutusest. Kursus arendab üliõpilase teadmisi rahvusvaheliste institutsioonide õiguslikust regulatsioonist, samuti nende panusest rahvusvahelisse õigusesse ja selle arendamisse.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane: -\tNimetab rahvusvaheliste institutsioonide õiguse aluspõhimõtteid -\tMääratleb rahvusvaheliste institutsioonide õigusvõime peamisi allikaid -\tSelgitab rahvusvaheliste institutsioonide ja nende osalisriikide omavahelisi suhteid -\tKirjeldab rahvusvaheliste institutsioonide õigusloome protsesse -\tVõrdleb erinevate rahvusvaheliste institutsioonide volitusi -\tLahendab rahvusvaheliste institutsioonide õigusliku vastutusega seotud hüpoteetilisi kaasuseid \"As to the core idea of the examination process:\n1. Exam will consist of 3 analytical questions (there will be a word limit set, to prevnt it from extrapolating into a longish opinion piece).\n2. First question will address one of the fundamental aspects of the law (e.g. legal personality, inherent powers, responsibility, etc). Second question will ask for comparative approach towards a particular aspect of functioning of the organisations (e.g. immunities, legal/administrative actions, financing, etc.) Third question will be of a practical nature - you will be given a short scenario (bundle of facts) and asked to provide advice pertaining to the facts at hand. (In a nutshell, last question is a very robust simulation of a day-to-day work of a legal adviser. No real time to get your ducks in a row. Quick, short and straight to the point. You are expected to be brief and precise. It is not a place to \"shine bright like a diamond\". It's more of a \"row, row, row, your boat\" kind of a thing.)\n3. As I already pointed out in the beginning on the course - this is the \"big leagues\". So I will compose the questions in a way that I will not really need to observe you online while you answer them (just like the classic \"takeaway\" exam). Point being, it's all in the argumentation and details. Descriptive generalisations will do you no good. \nAs always, any suspicion of plagiarism or other mischievous deeds will lead to penalties. \nI know these are tough and demanding times, but I am sure you will do just fine. You have the materials. Refresh you memory and stay healthy.\nMore details coming soon!\nAleksandr Popov\""}