{"KURSUSE_NIMI": "Rahvusvaheliste institutsioonide õigus", "KURSUSE_KOOD": "P2OG.02.197", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kuna suur osa rahvusvahelisest õigusest on kirjutatud rahvusvaheliste organisatsioonide poolt või nende egiidi all, on oluline tunda ka nende organisatsioonide ja institutsioonide õiguslikku raamistikku, nende pädevusi ning nende toimimist, aga ka nende panust rahvusvahelise õiguse arengusse. Kursuse käigus antakse ülevaade rahvusvaheliste institutsioonide õigusest, so nende ülesehitusest, nende õigustest ja kohustustest, nende õigusloome pädevusest, neile antud privileegidest ja immuniteetidest ning nende rahvusvahelisest vastutusest. Lisaks teoreetilisele ülevaatele analüüsitakse kursuse käigus ka rahvusvaheliste kohtute otsuseid ning asjassepuutuvate rahvusvaheliste komisjonide arutelusid ja aruandeid.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade rahvusvahelisetest institutsioonidest, nende õiguslikust ja materiaalsest toimimisest, nende tegevust reguleerivatest reeglitest ja õigusaktidest ning rahvusvaheliste organisatsioonide vastutusest. Kursus arendab üliõpilase teadmisi rahvusvaheliste institutsioonide õiguslikust regulatsioonist, samuti nende panusest rahvusvahelisse õigusesse ja selle arendamisse.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane: -\tNimetab rahvusvaheliste institutsioonide õiguse aluspõhimõtteid -\tMääratleb rahvusvaheliste institutsioonide õigusvõime peamisi allikaid -\tSelgitab rahvusvaheliste institutsioonide ja nende osalisriikide omavahelisi suhteid -\tKirjeldab rahvusvaheliste institutsioonide õigusloome protsesse -\tVõrdleb erinevate rahvusvaheliste institutsioonide volitusi -\tLahendab rahvusvaheliste institutsioonide õigusliku vastutusega seotud hüpoteetilisi kaasuseid"}