{"KURSUSE_NIMI": "Andmekaitse", "KURSUSE_KOOD": "P2OG.01.133", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "independent_work": 140, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus keskendub Euroopa Liidu ja rahvusvahelise isikuandmete kaitse õigusraamistiku süstemaatilisele käsitlemisele, hõlmates GDPR-i ning rahvusvaheliste konventsioonide ja lepingute rakendamist. Kursus arendab analüüsi- ja kriitilise mõtlemise oskusi, mis võimaldavad osalejatel lahendada isikuandmete kaitse küsimusi laiemas globaalses õiguskontekstis. Fookus on sektoriülesetel ja tehnoloogiapõhistel väljakutsetel, valmistades osalejaid ette isikuandmete kaitse regulatsioonide rakendamiseks piiriülestes ja mitmekesistes õiguskeskkondades. Kursusel rõhutatakse nii teoreetilist arusaamist kui ka praktilisi oskusi, sealhulgas juhtumianalüüsi ja õigusalaste uurimismeetodite rakendamist.Objectives/eesmärkid:  \nAnda põhjalikud teadmised Euroopa Liidu ja rahvusvahelise isikuandmete kaitse õiguslikest raamistikest, keskendudes isikuandmete kaitse üldmäärusele (GDPR), teistele asjakohastele õigusaktidele ning Euroopa Liidu Kohtu praktikale. Arendada oskust analüüsida ja rakendada isikuandmete kaitse meetmeid vastavalt parimatele rahvusvahelistele tavadele, Euroopa Liidu regulatiivsetele nõuetele ning kohtupraktikale, tagades andmesubjektide õiguste kaitse. Arendada kriitilist mõtlemist ja praktilisi oskusi isikuandmete kaitsega seotud juriidiliste ja praktiliste probleemide lahendamisel, tuginedes Euroopa Liidu ja rahvusvahelisele kohtupraktikale ning õigusaktidele nii avalikus kui erasektoris. Kujundada teadlikkust ja oskust edendada eetilisi ning vastutustundlikke andmetöötluspraktikaid, võttes arvesse isikuandmete kaitse põhimõtteid, Euroopa Liidu kohtupraktikat ning eetilisi dilemmasid.Learning outcomes/õpiväljund:  Õppeaine läbinud tudeng: Mõistab EL-i ja rahvusvahelise isikuandmete kaitse õigusliku regulatsiooni aluseid, sealhulgas GDPR-i põhimõtteid ja rahvusvaheliste konventsioonide rakendusmehhanisme. Oskab analüüsida ja kriitiliselt hinnata EL-i ja rahvusvahelisi isikuandmete kaitse õigusakte ja kohtupraktikat nii EL-i kui ka globaalses kontekstis. On valmis rakendama isikuandmete kaitse regulatsioone rahvusvahelistes ja piiriülestes olukordades, võttes arvesse eri jurisdiktsioonide eripärasid ja tehnoloogiliste uuenduste mõju. Oskab kasutada õigusalaseid uurimismeetodeid ja tööriistu rahvusvahelise isikuandmete kaitse probleemide lahendamiseks, sealhulgas andmetöötluse praktikaid ja juhtumianalüüsi rahvusvahelises keskkonnas."}