{"KURSUSE_NIMI": "Intellektuaalne omand", "KURSUSE_KOOD": "P2OG.01.134", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatus majandusteooriasse", "Võlaõiguse üldosa"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aines tutvustatakse intellektuaalse omandi kui õiguse olemust ja selle kaitse tähtsust, sh käsitledes erinevaid intellektuaalse omandi liike - autoriõigust, naaberõigusi, tööstusomandit (patendi-, kaubamärgi-, kasuliku mudeli ja tööstusdisainilahenduseõigust). Aine raamides käsitletakse intellektuaalse omandi kaitse teoreetilisi lähtepunkte, mis on aluseks vastava kaitse kehtestamisel Eestis. Käsitlemist leiavad ka olulisemad teemakohased välislepingud. Lahendatakse intellektuaalse omandi valdkonda puudutavaid kaasuseid.Objectives/eesmärkid:  \n\nTeoreetiliste teadmiste andmine intellektuaalse omandi õiguse olemusest ja kaitse tähtsusest: Kursuse eesmärgiks on tutvustada õppijatele intellektuaalse omandi õiguse põhimõisteid, olemust ja seda, kuidas ja miks see õigusvaldkond kujuneb ühiskonnas oluliseks. See hõlmab intellektuaalse omandi kaitse aluspõhimõtteid ja selle seost innovatsiooni ning loovuse edendamisega.\n\n Intellektuaalse omandi kaitse teoreetiliste lähtepunktide käsitlemine, arvestades Eesti ja EL-i õigusraamistikku: Kursusel käsitletakse, millised teoreetilised lähtepunktid on intellektuaalse omandi kaitse kehtestamise aluseks Eestis, sealhulgas kuidas rahvuslik õigusraamistik integreerub ja suhestub EL õigusega. Olulisemate intellektuaalse omandi kaitset puudutavate välislepingute tutvustamine: Kursusel antakse ülevaade peamistest rahvusvahelistest lepingutest, mis mõjutavad Eesti intellektuaalse omandi kaitse raamistikku, aidates mõista Eesti õiguse kontekstis laiemat rahvusvahelist koostööd ja normide ühtlustamist selles valdkonnas. Praktiliste oskuste arendamine intellektuaalse omandi valdkonnas esinevate kaasuste lahendamiseks: Lisaks teoreetilistele alustele keskendub kursus praktiliste oskuste arendamisele, pakkudes õppijatele võimalust lahendada konkreetseid kaasuseid, mis puudutavad intellektuaalse omandi õiguse eri aspekte. See hõlmab õigusanalüüsi, probleemide tuvastamist ja lahendusstrateegiate väljatöötamist reaalsetes või hüpoteetilistes olukordades. Praktiliste oskuste arendamine intellektuaalse omandi valdkonna lepingute koostamiseks: Kursuse eesmärk on parandada praktilisi oskusi, mis on seotud intellektuaalse omandiga seotud lepingute koostamisega, keskendudes lepingute koostamisele, läbirääkimistele ja rakendamisele, mis kaitsevad intellektuaalse omandi õigusi. See hõlmab õiguslike nõuete, klauslite ja sätete mõistmist, mis on olulised tõhusate intellektuaalse omandi lepingute jaoks, mis on kohandatud osapoolte konkreetsete vajaduste ja kontekstidega.Learning outcomes/õpiväljund:  1. Intellektuaalse omandi kui õiguse teoreetiliste aluste tundmine lähtudes Eesti ja Euroopa Liidu õigusaktidest, rahvusvahelistest lepingutest ning õiguspraktikast. 2. Praktilised oskused intellektuaalse omandi valdkonna kaasuste lahendamiseks. 3. Praktilised oskused intellektuaalse omandi valdkonna lepingute sõlmimiseks."}