{"KURSUSE_NIMI": "Vaidluste rahvusvaheline lahendamine", "KURSUSE_KOOD": "P2OG.02.196", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Rahvusvahelise õigusmõistmise süsteemi tähtsus on oluliselt tõusnud viimastel aastakümnetel. Riigid pöörduvad üha tihedamini omavaheliste vaidluste lahendamiseks rahvusvaheliste kohtute poole ja aktsepteerivad üha rohkem etteulatuvalt nende jurisdiktsiooni. Samas on juurde tulnud ka kohtuid ja tribunale, kus menetluse osapoolteks saavad olla ka füüsilised ja juriidilised isikud, kas hageja, kostja või süüdistatuna. Õppeaine uurib rahvusvahelisi kohtuid ja tribunale ajaloolisest, poliitilisest ja õiguslikust vaatenurgast. Fookus on ennekõike riikidevaheliste vaidluste lahendamisel, kuid õppeaine käsitleb ka investeerimisvaidlusi ja kriminaalmenetlust. Alustuseks selgitatakse vaidluste rahumeelse lahendamise õiguslikku raamistikku. Seejärel võetakse vaatluse alla valitud rahvusvahelised kohtud ja tribunalid, et selgitada nende olemasolu põhjuseid ning uurida loomise ja toimimise detaile. Käsitlemist leiavad sellised teemad nagu jurisdiktsioon, vastuvõetavas, ajutised meetmed, kohalduv õigus, menetlus, otsuse vastuvõtmise protsess, lahendite täideviimine jms.Objectives/eesmärkid:  Anda ülevaade rahvusvahelise õigusmõistmise süsteemi alustest ning olulisemate kohtute ja tribunalide rollist, pädevusest, toimimisest ja tulemustest (edusammud ja läbikukkumised)Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: -- selgitab ja võrdleb erinevaid rahumeelse vaidluste lahendamise meetodeid -- mõistab rahvusvaheliste kohtute ja tribunalide rolli rahvusvahelises õigussüsteemis -- tunneb rahvusvahelistes kohtutes ja tribunalides toimuvat menetlust -- teab valitud oluliste kaasuste sisu ja mõju -- tuvastab kaasaegseid arenguid ja väljakutseid rahvusvahelises õigusmõistmise süsteemis"}