{"KURSUSE_NIMI": "Prantsuse õiguskeel (B2-C1)", "KURSUSE_KOOD": "P2OG.04.037", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Prantsuse keele kesktase (A2-B1)"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on mõeldud neile tudengitele, kel olemas algteadmised prantsuse keelest, sh teatud elementaarne eneseväljendussoskus. Eesmärgiks on prantsuse õiguskeele omandamine ja\nlihvimine, mis on relevantne tööks juriidiliste tekstidega ning rahvusvahelistes institutsioonides. Prantsuse keel on EL-i teise keelena eelduseks edukale karjäärile Euroopa institutsioonides, aga tema oskus annab selge eelise ka globaalsetes rahvusvahelistes institutsioonides töötamiseks. Tudengid peaksid teadvustama, et kursus puudutab prantsuse õiguskeelt, kuid pole samas puhtalt õiguse kursus, vaid on ikkagi eelkõige keelekursus. Kursuse läbimisel tuleb kasuks inglise keele oskus.\n\nKursus toimub online (Zoom'i kaudu) ja on avatud Tartu ja Tallinna Õigusteaduskonna tudengitele.Objectives/eesmärkid:  Kursus seab eesmärgiks prantsuse õiguse terminoloogia (nii kirjalikus kui ka suulises vormis) tundmaõppimise ja tutvustab olulisemaid juriidilisi mõisteid nii Prantsuse era- ja avalikus õiguses kui ka Euroopa õiguses.Learning outcomes/õpiväljund:  Kursuse lõpuks peab üliõpilane olema võimeline: -\taru saama juriidilise sisuga olevast tekstist või kõnest prantsuse keeles; -       kasutama korrektselt loengus käsitletud erinevate õigusharudega seotud prantsuse sõnavara; -       moodustama juriidilise sisuga lauseid prantsuse keeles; -       määrama, kas teatud prantsuskeelsed tekstid õiguslikes küsimustes on õiged või valed ja põhjendama oma vastust (tundma ära juriidilise sisuga prantsuskeelseid tekste ja otsustama, kas esitatud väide on tõene või väär) -       väljendama suuliselt ja kirjalikult oma mõtteid juriidilises valdkonnas prantsuse keeles."}