{"KURSUSE_NIMI": "Euroopa Liidu õigus", "KURSUSE_KOOD": "P2OG.02.209", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 116, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "The basic course discusses the creation, legal nature and legal foundations of the EU, the interactions of the EU with international and regional organizations, relationship between the EU law and national law, institutions of the EU and the representation of Estonia therein, the decision making and law making procedures of the EU and Estonia's participation thereof, the implementation of the EU law in Member States including Estonia and the problems that might arise, the responsibility of a Member State in case of being in breach with the EU law, the judicial system of the EU and actions and procedure in the European Court of Justice, the fundamental rights and freedoms in the EU law, the general principles of EU law.Objectives/eesmärkid:  The aim of the course on EU law is to introduce the fundamental principles of the European Union, the institutional structure and the fundamental treaties of the EU, the legal drafting procedure and the judicial system of the EU, the relationship between national law and EU law. The course deals to a large extent with the case law of the Court of Justice of the EU (COJEU) as the precedents have an essential role in the EU law. The aim of the course is to create an understanding of the EU law as a dynamic process and the natural belonging of the EU law into the national legal system.Learning outcomes/õpiväljund:  The student who has passed the course is able to: - Explain the central principles of European Union Law - Describe the sources of European Union law - Understand the relation between European Union and national legal systems - Identify the subjects of European Union Law - Find and apply the substantial regulation of the main branches of European Union law - Solve hypothetical cases  of EU law  - Identify collisions between the national and the EU law and find the best way to solve the problem - Understand and distinguish between different actions in the COJEU incl. preliminary rulings, judicial review of EU acts (action to annul and others), infringement procedure. Able to pick the right action in order to solve the practical case. Understand the procedural aspects and interpretation methods of the COJEU - By passing the course the students will build up a ground for working with the acquis and an understanding of the legal nature of the EU. They also expand the sense of orientation in the information about the EU and the legal literature about EU, especially in the sources of the EU law."}