{"KURSUSE_NIMI": "Lepinguvälised võlasuhted", "KURSUSE_KOOD": "P2OG.01.109", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Tsiviilõiguse üldosa", "Võlaõiguse üldosa", "Lepinguõigus"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines käsitletakse erinevaid lepinguväliseid võlasuhteid süstemaatilisel alusel ja lähtudes  tsiviilõiguse regulatsioonist. Antakse ülevaade  vastutusõpetuse olulisematest õigusteoreetilistest koolkondadest.  Põhitähelepanu on lepingulise ja lepinguvälise vastutuse vahelise jaotuse selgitamisel ning sisu analüüsimisel, samuti aluseta rikastumise institutsiooni ja teiste lepinguväliste võlasuhete erijuhtude uurimisel. \nÕppekursuse käigus viiakse läbi mitmeid seminare ja praktikume, mille eesmärgiks on õigusteoreetiliste seisukohtade ühendamine praktiliste oskustega.Objectives/eesmärkid:  Õppeaines käsitletakse erinevaid lepinguväliseid võlasuhteid süstemaatilisel alusel ja lähtudes  tsiviilõiguse regulatsioonist. Antakse ülevaade  vastutusõpetuse olulisematest õigusteoreetilistest koolkondadest.  Põhitähelepanu on lepingulise ja lepinguvälise vastutuse vahelise jaotuse selgitamisel ning sisu analüüsimisel, samuti aluseta rikastumise institutsiooni ja teiste lepinguväliste võlasuhete erijuhtude uurimisel. \nÕppekursuse käigus viiakse läbi mitmeid seminare ja praktikume, mille eesmärgiks on õigusteoreetiliste seisukohtade ühendamine praktiliste oskustega.Learning outcomes/õpiväljund:  1. üliõpilane tunneb lepinguväliste võlasuhete põhiinstituute ja üldpõhimõtteid;\n\n2. üliõpilane mõistab lepinguväliste võlasuhete põhiinstituutide omavahelisi seoseid ning nende seoseid teiste õigusvaldkondadega; \n\n3. üliõpilane mõistab võlaõiguse üldosa seoseid lepinguväliste võlasuhete õigusega ja oskab neid teadmisi rakendada praktiliste kaasuste lahendamisel;\n\n4. üliõpilane oskab lahendada lepinguväliste võlasuhetega seonduvaid praktilisi kaasusi, kohaldades asjakohaseid õigusnorme ja järgides eraõiguse kaasuste lahendamise metoodikat; \n\n5. üliõpilane teab Eesti õiguskirjanduses ja kohtupraktikas lepinguväliste võlasuhetega seoses avaldatud olulisemaid seisukohti ja oskab neid rakendada praktiliste kaasuste lahendamisel;\n\n6. üliõpilane oskab tõhusalt planeerida grupitööd ja töötada tulemuslikult meeskonnas õiguslike probleemide lahendamisel"}