{"KURSUSE_NIMI": "Rahvusvaheline mereõigus", "KURSUSE_KOOD": "P2OG.02.202", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 12, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaines käsitletakse esmalt peamisi õigusallikaid ja osapooli rahvusvahelises mereõiguses ning selle valdkonna ajaloolist arengut. Seejärel keskendutakse merevöönditele: sisevetele, territoriaalmerele, arhipelaagivetele, kontrollvööndile, majandusvööndile, mandrilavale, avamerele ja süvamerepõhjale. Selle käigus pööratakse erilist rõhku välisriikide laevade ja lennukite läbipääsuõigustele, väinadele (rõhuasetus Arktika ja Läänemere väinadel), merepiiride delimiteerimisele, teaduslikele mereuuringutele, merekeskkonna kaitsele (rõhuasetus Põhja-Jäämerel ja Läänemerel), merendusjulgeolekuõigusele, inimõiguste kaitsele merel ning vaidluste lahendamisele. Olulisel kohal on riikide praktika ja Rahvusvahelise Kohtu ning Rahvusvahelise Mereõiguse Kohtu kohtupraktika uurimine.Objectives/eesmärkid:  Pakkuda süvendatud teadmisi rahvusvahelise mereõiguse arengust, sisust ja rakendamisest  ÜRO mereõiguse konventsiooni õigusraamistikus ning kujundada oskust lahendada praktilisi mereõiguslikke probleeme.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane:\n- teab rahvusvahelise mereõiguse põhimõisteid;\n- mõistab merevööndite õiguslikke raamistikke ja loob nendevahelisi seoseid;\n- oskab lahendada elulisi mereõiguslikke probleeme;\n- teab võrrelda siseriiklikku ja rahvusvahelist mereõigust ning hinnata nendevahelist kooskõla;\n- oskab leida ja seostada rahvusvahelise mereõiguse alast kirjandust. Teretulnud on tudengid ka väljaspoolt magistriprogrammi International Law and Human Rights, eeskätt mereõiguse vallas uurimis- või magistritöid kirjutavad üliõpilased."}