{"KURSUSE_NIMI": "Heaolu- ja terviseturism", "KURSUSE_KOOD": "P2PC.00.517", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Heaolu- ja terviseturismi definitsioonid. Vaba aeg, elustiil ja turism. Heaolu- ja terviseturismi tüpoloogiad. Heaolu- ja terviseturistide motivatsioonid ja profiilid. Heaolu- ja terviseturismi geograafia: riiklikud ja piirkondlikud arengusuunad. Tootearendus heaolu- ja terviseturismi valdkonnas. Parim praktika.\r\nTegevuskorralduse ja juhtimisega seotud küsimused heaolu- ja terviseturismi valdkonnas – juhtumiuuringud. Heaolu- ja terviseturismi turundus. Heaolu- ja terviseturismikeskuste juhtimise korraldamine (nt spaad, hotellid, meditatsioonikeskused). Spaaturism (nt päevaspaad, tervise- ja veekeskused, spaahotellid) – juhtumiuuringud. Holistlik turism (nt jooga, meditatsioon) – juhtumiuuringud. Tööheaolu (nt spaareisid, stressi juhtimine, isiklik nõustamine) – juhtumiuuringud. Raviturism (nt ravispaad, kirurgia) – juhtumiuuringud. Heaolu- ja terviseturismi tulevik.Objectives/eesmärkid:  Käesolev kursus keskendub tänapäeval olulise ja kasvava majandussektori, heaolu- ja terviseturismi arengule, juhtimisele ja turundusele. Kursus uurib seda mitmekülgset turismisektorit käivitavaid jõude, turistide vajadustele vastavate toodete väljatöötamist ning sellise arendustegevusega seotud juhtimisküsimusi. Kursus võimaldab üliõpilastel arendada kriitilise mõtlemise ja analüüsivõimet ning ainega seotud teoreetiliste allikatega töötamise oskust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab heaolu- ja terviseturismi tunnuseid ja nende keerukust (tooteid, teenuseid, geograafilisi ja kultuurilisi iseärasusi); 2) teab põhjuseid, miks ja kuhu inimesed heaolu ja tervise eesmärgil reisivad; 3) tunneb heaolu- ja terviseturismi turgu; 4) oskab analüüsida heaolu- ja terviseturismi turusuundumusi; 5) teab, kuidas turustada heaolu- ja terviseturismi; 6) oskab välja töötada tooteid heaolu- ja terviseturismi heaks; 7) oskab korraldada heaolu- ja terviseturismi keskuste juhtimist."}