{"KURSUSE_NIMI": "Ettevõtluspraktika", "KURSUSE_KOOD": "P2PC.03.047", "EAP": 9, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Tutvumispraktika"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 160}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Praktika koosneb kolmest etapist: \nEttevalmistav: õpieesmärgid 1, 2, 3.\nPraktika organisatsioonis: õpieesmärgid 4, 5, 6, 7.\nHinnang praktikale: õpieesmärgid 8, 9, 10.Objectives/eesmärkid:  Ettevõtluspraktikaga taotletakse, et õppija oskab kirjeldada, analüüsida ja hinnata kolledžis omandatud teadmiste baasil praktikakoha funktsioneerimise põhiprintsiipe, ettevõtluskeskkonda, strateegiate rakendamist, erinevate struktuuriüksuste töökorraldust, suhteid teiste organisatsioonidega ja erinevate huvigruppidega. Taotletakse, et praktikakohas saadud kogemuste kaudu mõistab üliõpilane sotsiaalettevõtluse ja ettevõttemajanduse sisu ja olulisemaid probleeme.Learning outcomes/õpiväljund:  Praktika läbinud õppija: 1) mõistab ja oskab sõnastada praktika-asutuse missiooni ning ülesandeid, teab selle kujunemise lugu, oskab püstitada isiklikke eesmärke praktikale; 2) tunneb asutuse tegevust sätestavat dokumenti ja arengukava ning praktikandi asutusepoolse juhendaja ametijuhendit; 3) tunneb asutuse tööd tutvustavaid materjale: ajaleheartiklid, trükised, kodulehekülge, sihtgruppi illustr. statistikat jms; 4) tunneb asutuse struktuuri, kliente, partnereid, finantseerimist sh teab teenuse hinda tarbijatele; 5) tunneb personali motiveerimis- ja koolitussüsteemi; 6) oskab analüüsida teenuse osutamise/juhtimise protsessi ning tulemuse kvaliteeti, teab kaebuste/protestide menetlemise korda; 7) oskab kirjeldada ühte oma praktikapäeva; 8) oskab hinnata oma teoreetilise ettevalmistuse sobivust antud praktilise soorituse edukaks läbimiseks; 9) oskab sõnastada ettepanekud praktikakoha töö paremaks korraldamiseks, näha ja nimetada kiiduväärset; 10) oskab hinnata tulemi vastavust püstitatud eesmärkidele. Sihtrühm SRSÕ2"}