{"KURSUSE_NIMI": "Klienditöö praktika", "KURSUSE_KOOD": "P2PC.03.031", "EAP": 9, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Tutvumispraktika", "Ettevõtluspraktika"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Sotsiaalteenust pakkuva asutuse struktuur, protsessid ja töökorraldus. Organisatsiooni tööprotsesside kriitiline analüüsimine. Klienditöö protsess ja põhiprintsiibid sotsiaalteenust pakkuvas asutuses. Klienditeooria. Klienditöö eetilised standardid. Sotsiaaltöötajale esitatavad nõuded, töösoorituse kontrolli- ja hindamisprintsiibid praktikaasutuses. Tööülesannete  kohusetundlik täitmine ja vastutamine oma töö eest. Organisatsiooni teenindusnõuete ja -standardite järgimine. Professionaalne eneserefleksioon klienditöös. Iseseisva- ja meeskonnatöö ning suhtlus-ja klienditööoskuste arendamine.Objectives/eesmärkid:  Praktika läbinu süvendab klienditöö alaseid baasteadmisi, saab ülevaate sotsiaalteenust pakkuva organisatsiooni tööprintsiipidest ning omandab praktilise kogemuse järgmistes valdkondades: kontakti loomine kliendiga, lähteinfo kogumine kliendi ja tema keskkonna kohta, kliendi hindamine, kliendi probleemide analüüs, sekkumiskava koostamine, töö kliendi vastupanuga, kliendi toetamine.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) oskab kirjeldada organisatsiooni töökorraldust,  struktuuri ning nimetada antud organisatsioonis klienditööd reguleerivaid seadusandlikke regulatsioone; 2) oskab analüüsida klienditöö protsessi etappe; 3) oskab analüüsida  klienditöö spetsialisti põhifunktsioone ning -rolle antud organisatsioonis; 4) analüüsida klienditöö spetsialistile esitatavaid nõudeid, töösoorituse kontrolli- ja hindamisprintsiipe; 5) oskab viia läbi kliendi ja tema keskkonna hindamist, dokumenteerida ja analüüsida vähemalt ühte praktika käigus lahendatud juhtumit; 6) oskab rakendada eneserefleksiooni klienditöö protsessi analüüsil; 7) oskab kasutada korrektset eesti keelset erialalist terminoloogiat; 8) rakendab eesmärkide seadmiselt SMART mudelit; 9) oskab leida ja kasutada asjakohaseid teabeallikaid."}