{"KURSUSE_NIMI": "Teenuste disain", "KURSUSE_KOOD": "P2PC.00.679", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Mõisted: disain ja selle liigid, toode/teenus sarnasused/erinevused disaini kontekstis. Teenuste pakkumise protsessi visualiseerimine (klienditeekond, teenindusplaan). Loov mõtlemine versus lineaarne/loogiline mõtlemine.  Tootearenduse protsessi etapid. Teenusedisaini mõiste, loova mõtlemise printsiibid ja tehnikad. Teenuste disaini mudelid ja seonduvad meetodid/tehnikad.  Kliendivajaduste identifitseerimine ja lähteülesande koostamine teenuse loomiseks/arendamiseks. Lähteülesandest lähtuvalt töö planeerimine ja meeskonnaliikmete komplekteerimine. Teenuse testimine ja lõpliku lahenduse valik ning juurutamine. Loovus, innovatsioon ja vigadest õppimine teenuste pakkumise protsessis. Asukoht, nõudlus ja tagasiside teenuste kvaliteedi kohta.Objectives/eesmärkid:  Aine eesmärk on, et tudeng teaks loovmõtlemise, disainijuhtimise ja teenuste disaini seoseid ning teenuste disainimise protsessi etappe ning oskaks kasutada seonduvaid meetodeid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab loovmõtlemise olemust ja erinevust analüütilisest loogikast; 2) teab teenuste disaini protsessi kirjeldavaid mudeleid ning teenusedisaini protsessi etappides rakendatavaid meetodeid; 3) teab teenuste pakkumise protsessi visualiseerimise põhimeetodeid (klienditeekond ja teenindusplaan jmt); 4) teab koostöö põhimõtteid disainerite, klientide ja teiste huvigruppidega uue teenuse loomisel või olemasoleva parendamisel; 5) oskab koostada olemasoleva teenuse klienditeekonna ja teenindusplaani; 6) oskab teostada olemasoleva teenuse ja selle pakkumise keskkonna analüüsi kasutades teenuste disaini meetodeid; 7) oskab kaasata kliente teenuste arendamise protsessi ja juhtide grupiprotsesse teenuste arendusprojektis. Sihtrühm TDJ1, PBE2"}