{"KURSUSE_NIMI": "Disainijuhtimine", "KURSUSE_KOOD": "P2PC.00.676", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 16, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "ÜLDTEEMAD: Disaini rakendused ühiskonnas ja ettevõttes. Disaini liigid ja ajalooline areng. Disaineri töö olemus ja rollid. Disaini protsess, projektid ja disaineri oskused. Disainile omane mõtteviis (design thinking). \nJUHTIMINE: Disain juhtimise kontekstis. Disainijuhtimine suur- ja väikeettevõttes. Finantsid ja väärtuse mõõtmine disainis. Disaini suhe brändiloomesse ja innovatsiooni. Disainijuhtimine ja innovatsioon: organisatsiooni strateegilisel, taktikalisel ja operatiivsel tasandil. \nPROTSESS: Disainiaudit. Disainiteenuse sisse ostmine ja lähteülesande koostamine. Koostöö korraldamine teenuse/tootearenduse meeskonnas. Disainiprojekti juhtimine ja hindamine.\nMEETODID: Kasutajakeskne lähenemine. Disainiuuring. Prototüpeerimine. Koostöö kasutajaga (co-creation, open innovation) jt meetodid. Universaaldisain.Objectives/eesmärkid:  1. Anda teadmised disainmõtlemisest, teenusedisainiprotsessist ja disainiprojekti juhtimisest. 2. Arendada disainiprojektide raames koostööoskusi ja mõista koosloomet. 3. Mõista kasutajakesksete teenuste loogikat. 4. Rakendada magistriopingute käigus omandatud teoreetilisi teadmisi praktikaorganisatsioonis.Learning outcomes/õpiväljund:  Aine läbimise järel õppija: 1) teab disainivaldkonna terminoloogiat, disaini tüüpe ja koostöö põhimõtteid disaineritega; 2) mõistab disainijuhtimise ja disainiauditi vajalikkust ja protsessi ning oskab koostada disainiauditit; 3) kasutab disainmõtlemisele omaseid põhimõtteid, mõtteviisi ning meetodeid teenusedisaini projekte läbi viies; 4) oskab koostada disainiprojekti lähteülesannet (design brief); 5) oskab kaasa rääkida disainiprotsessis ning presenteerida disainiprojekti tulemusi. Sihtrühm TDJ1, PBE2"}