{"KURSUSE_NIMI": "Turismi soome keel", "KURSUSE_KOOD": "P2PC.02.155", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Viisakusväljendid, isikuandmed, telefonile vastamine. Kriitilisemad eksitussõnad. Ajamäärused, pühad ja tähtpäevad. Reisitransport, orienteerumine ja tee juhatamine sise- ning linnaruumis. Majutusettevõtete tüübid, teenused, kvaliteedisüsteemid. Majutusettevõtte personal. Majutusettevõtte osakonnad ja ruumijaotus. Hotellituba, selle sisustus ja seadmed. Vastuvõtuosakonna töö, broneeringud, kliendi vastuvõtmine hotellis. Toitlustusettevõtete tüübid ja teenused. Menüü, toiduained, joogid, levinumad toiduallergiad. Ülevaade soome verbisüsteemist. Ülevaade soome käändesüsteemist.Objectives/eesmärkid:  Õpetusega taotletakse, et õppija omandab ja süvendab turismitööks vajalikke teadmisi enese väljendamiseks soome keeles. Õppija mõistab tavakõnet ja saab aru turismialastest tekstidest. Oskab ettevalmistuseta vestelda turismiga seonduvatel teemadel, koostada tekste ja ametialaseid kirju. Õppija tähtsustab korrektse keelekasutuse vajalikkust ametialases suhtluses.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab erinevate turismivaldkondade ja turismikorraldusega seotud sõnavara soome keeles; 2) teab soome keele grammatika olulisemaid komponente; 3) oskab kasutada küllaldast sõnavara, et end väljendada tavalisemates töösituatsioonides, sh isikuandmete küsimine, majutuse broneerimine, majutusettevõtte teenuste tutvustamine, tee juhatamine, kaebuste lahendamine, teenindamine toitlustusasutuses, arve esitamine jms; 4) oskab kasutada igapäevatööga seotud sagedasemaid vorme grammatiliselt üsna veatult; 5) oskab vastata otsestele, selgetele küsimustele olme-, päeva- ning turismiteemadel; 6) mõistab selgesõnalist faktilist ja erialast informatsiooni; kuuldule adekvaatselt reageerida; 7) oskab suhelda teenindus- ja müügisituatsioonides; 8) oskab lugeda ja koostada ametialaseid kirju ning dokumente; 9) oskab kasutada tööks vajalikku kirjandust (sõnaraamatud, ajakirjandus, Internet jm); 10) oskab koostada ja esitada lühikest soomekeelset ettekannet oma erialaga seotud teemadel; 11) oskab täita konkreetset ülesannet ja leida vajalikku informatsiooni eri tüüpi allikatest. Sihtrühm THSÕ1"}