{"KURSUSE_NIMI": "Kultuurikorralduse praktika", "KURSUSE_KOOD": "P2VK.05.226", "EAP": 15, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 12, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 300}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kultuurikorralduse 15 EAP analüüsi-ja korralduspraktika toimub kultuuriorganisatsioonis. Vähemalt 4 (nelja) nädala jooksul peab üliõpilane töötama organisatsioonis, vaatlema,  analüüsima ning võtma osa organisatsiooni igapäevatööst. \nKorraldustöö praktika väljundina peab toimuma kultuurisündmus, mille ettevalmistamises ning läbiviimises üliõpilane osaleb. Üldiseks eesmärgiks on rakendada praktikasse üliõpilase poolt omandatud teoreetilisi teadmisi nii kultuuriorganisatsiooni tegevuse analüüsi kui praktilise korraldustöö alalt ning kinnistada neid. Soovitavalt peaks praktika olema seotud üliõpilase spetsialiseerumisvaldkonnaga.\nKorraldustöö praktika sooritamine võib toimuda ühes või mitmes asutuses, sõltuvalt organisatsiooni suurusest ja töö mahukusest. Konkreetse projekti maht hinnatakse ning lepitakse kokku tudengi ja praktika juhendajate poolt.\nPraktika lahutamatuks osaks on vahekokkuvõtted ja aruandlus praktika kestel. Samuti aruande vormistamine ja komisjoni ees kaitsmine praktika lõppedes.Objectives/eesmärkid:  Rakendada omandatud kultuurikorralduse teoreetilisi teadmisi praktikas.Learning outcomes/õpiväljund:  1. Õppeaine läbides on tudeng rakendanud praktikasse omandatud teoreetilisi teadmisi nii kultuuriorganisatsiooni tegevuse analüüsi kui praktilise korraldustöö alalt ning kinnistanud neid. 2. Tudeng oskab paigutada organisatsiooni seda ümbritsevasse kultuurikeskkonda ning analüüsida organisatsiooni tähtsust, ohtusid, võimalusi ja hetkeolukorda antud situatsioonis. 3.Tudeng on omandanud üldised teadmised kultuurisündmuse korraldamisega seotud põhiaspektidest: sihtrühma määratlemine, rahastuse leidmine ja eelarve koostamine, sündmusest teavitamine, sündmuse läbiviimine, aruandlus ja kokkuvõtted. Konsultatsiooniajad (praktikakoha leidmine, analüüsi koostamine) kokkuleppel õppejõuga.\n\nVÕTA-ga seoses:\nPraktika arvestamiseks on vajalik esitada praktikaaruanne, mis vastab praktika juhendis esitatud nõudmistele.\nLisainfo: Jorma Sarv jorma.sarv@ut.ee"}