{"KURSUSE_NIMI": "Rahvalaul", "KURSUSE_KOOD": "P2VK.02.684", "EAP": 1.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 23, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Loengud regilaulu keele eripärast (murdekeel ja arhaismid); regilaulu kui suulisel teel levinud poeetilise teksti ehitus- ja kujundusvõtetest; regivärsi kujunemisest ja muutumisest läbi aja, regilaulu eri liikide ja piirkondade tekstidele iseloomulikest tunnustest. Loengute üheks osaks on pidev poeetiliste tunnuste analüüsimine ja tekstide tõlkimine-tõlgendamine. Ühtlasi tutvutakse tekstide usundi- ja reaalelulise taustaga, suulisele kultuurile omasest mõtlemise ja eneseväljendusega.\nLoengud regilaulude muusikalisest stiilist ja esitusest. Muusikalist stiili vaadeldakse lähtudes regilaulude liikidest ja esitusolukordadest, paralleelselt muusikalise väljendusega jälgitakse esituse kehalisi ja ruumilisi aspekte. Tutvutakse piirkondlike allstiilidega, samuti väljapaistvate esitajate väljendusstiili individuaalse eripäraga. Loengute üheks osaks on näidete analüüsimine ja laulmine, jäljendades stiili ja rekonstrueerides laulude tegelikule esituskontekstile omast kõlapilti.\nLoengud uuema rahvalaulu ja rahvakoraali tunnustest ja esitusstiilidest.\nPraktiline laulude õppimine ja esitamine, kus rakendatakse kõiki loengutes omandatud teadmisi: tõlgitakse-tõlgendatakse tekste ja püütakse mõtestada nende esituskonteksti, lauldakse eri viise eri stiilides, teadvustatakse hääle intensiivsuse, tämbri, rütmi, artikuleerimise, viisivarieerimise, kehalise väljenduse jm võimalusi ja õpitakse neid kasutama.Objectives/eesmärkid:  Õpetada tudengeid mõistma regilaulu ja üldisemalt, suulise poeesia eripära, ära tundma ja analüüsima regilaulutekstidele omaseid tunnuseid ning nende piirkondlikke ja stiilikihistustele iseloomulikke erijooni. Kujundada regilaulutekstide iseseisev analüüsi- ja interpreteerimisoskus. Tutvustada ja õpetada analüüsima regiviisi kui suulise muusikakultuuri üht osa; eesti regilaulule iseloomulikke muusikalisi tunnuseid, nende piirkondlikke ja liigilisi eripärasid. Kujundada teadmist regilaulutekstide ja -viiside seotusest esitusega, selle ruumilise ja kehalise küljega, laulmisolukordade ja -kohtadega. Õpetada regilaule stiilitundlikult esitama.\nTutvustada uuema rahvalaulu ja rahvakoraali traditsioone ja ajaloolisi kihistusi. \nAnda teoreetiline alus ja praktilised oskused rahvalaulude ajastuteadlikuks interpreteerimiseks.Learning outcomes/õpiväljund:  *tunneb rahvalaulude ajaloolisi kihistusi;\n*tunnetab rahvalaulude muusikaliste stiilide erinevust liigiti ja piirkonniti;\n*oskab tõlkida ja tõlgendada rahvalaulude tekstide sisu;\n*oskab analüüsida, kontekstiteadlikult ja loominguliselt jäljendada lauljate esitusstiili."}