{"KURSUSE_NIMI": "Muusikatehnoloogia alused", "KURSUSE_KOOD": "P2VK.02.650", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine annab ülevaate helitehnika kasutamisest nii kontsertsituatsioonis kui helistuudios. Käsitletakse heli tekke ja levimisega seonduvat, tutvutakse erinevate akustiliste keskkondadega. Tutvutakse helindamiseks ning salvestamiseks vajalike seadmetega ja viiakse läbi praktilised tööd nagu akustiliste instrumentide salvestus, kontserdi helindamine, materjali kokkumäng.\nAine annab ülevaate MIDI töötamisest, võimalustest, terminoloogiast jne. Õpitakse tundma arvutiprogrammi \"Sibelius\" üldisi põhimõtteid, nootide ja teiste muusikaliste väljendusvahendite sisestamist, küljendamist, navigeerimist, väljundite koostamist nii partiidena kui ka partituurina paberkandjal etteantud formaadis, elektroonilisel kujul ning publitseerimist internetti.\nÕppeaine tutvustab uute vahendite (tahvelarvutid) kasutamist nii helisalvestusel kui videode tegemisel, õpetab looma internetis levitamiseks sobilikke formaate ja materjale, tutvustab intellektuaalse omandi kaitse ja autoriõiguse aluseid.Objectives/eesmärkid:  Õppeaine eesmärgiks on:  *\tanda algteadmised heli olemusest, akustilise keskkonna mõjust helikvaliteedile; *\tanda ülevaade helitrakti komponentidest, heli edastamise põhimõttest ja vajalikest komponentidest; *\tanda algteadmised ja praktilised oskused lava kontserttehnika ning  helistuudio tehniliste võimaluste kasutamiseks;  *\tanda ülevaade tänapäevase tehnoloogia ja muusika seostest ning arvuti kasutamisest muusikas; *\tanda ülevaade tänapäeva muusika- ja multimeediakanalite formaatidest ja väljunditest, nendesse sisu loomisest ning intellektuaalse omandi kaitsest.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: *\tmõistab heli ja akustilise keskkonna põhiparameetrite olemust; *\ttunneb helitrakti ehitust, oskab analüüsida selles toimuvaid protsesse ja rakendada erinevaid protseduure soovitud lõpptulemuse saamiseks; *\ttunneb ja oskab kasutada hääle ja instrumentide võimendamiseks vajaminevat helitehnikat ning suudab kirjeldada ja planeerida kontserdiks vajaliku helitehnika koguse ning vajalikud komponendid; *\ttunneb ja oskab hinnata helistuudio tehnilisi võimalusi erinevate salvestuste planeerimiseks ja läbiviimiseks; *\ttunneb noodistusprogrammi Sibelius võimalusi; *\ttunneb ja teab VST- ja midi-instrumentide helitekitamise põhimõtteid; *\tsuudab kasutada midi-sekventserit GM-formaadis muusika loomiseks ja programmi Sibelius midi-loo noodipildi väljastamiseks ja publitseerimiseks; *\ttunneb tahvelarvuti võimalusi heli ja pildi salvestamiseks ja järeltöötlemiseks ning internetikeskkonda \"üles panemiseks\"; *\ttunneb ja suudab kasutada ainega seotud spetsiifilist terminoloogiat"}