{"KURSUSE_NIMI": "Loovus- ja tegevusõppe alused", "KURSUSE_KOOD": "P2VK.05.385", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 32, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 38, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel keskendutakse loovus- ja tegevusõppe korraldusele ning enamlevinud vormidele (õuesõpe, seiklus- ja loovtegevused, mängud, simulatsioonid, loovusülesanded jne). \nÕppetöös rakendatakse loenguid, seminare ning praktikume, mis annavad ülevaate spetsialiseerumismoodulite ainetest. Tegevusõppe osa toimub väljasõidu ja õuesõppe vormis.\nLäbivateks teemadeks on huvijuhi ja noorsootöötaja kutsetööks sobivad, mitteformaalses õppes rakendatavad meetodid.\nAine on kohustuslik üliõpilastele, kes soovivad läbida loovus- või tegevusõppe spetsialiseerumist.Objectives/eesmärkid:  1.\tAnda ülevaade  -\tloovus- ja tegevusõppe olemusest, põhimõtetest ja korraldamise protsessist (eesmärgistamine, grupiprotsessi juhtimine, emotsionaalne ja füüsiline turvalisus, tagasisidestamine) -\tpädevustest, mis on vajalikud loovuse teadlikuks rakendamiseks kasvatuses ja hariduses  -\tõpikeskkonna loomise vahenditest ja eesmärkidest  2.\tanda esmased oskused  -\tloovuse avaldumist toetavate tehnikate rakendamiseks erinevatel tasanditel (üksikisik, õpikeskkond, töökeskkond)  -\ttegevuse tulemusena tekkivate seoste üldistamiseksLearning outcomes/õpiväljund:  Õppeaine läbinud tudeng  -\tmõistab loovus- ja tegevusõppe olemust  -\tomab ülevaadet loovus- ja tegevusõppe meetoditest -\tteab arendavate ja toetavate õpikeskkondade loomise põhimõtteid; -\tteab loova eneseväljendamise kunstivahendeid: visuaalsed (kujund, värv), auditiivsed (heli, muusika), kinesteetilised (liikumine, tants) jmt -\tteab tegevuste kaudu õppimise etappe -\tmõistab sihtrühma vajaduste kaardistamise ja tegevuse struktureerimise otstarvet -\toskab kirjeldada isiklikke tugevusi ja arenguvajadusi loovus- ja tegevusõppe korraldamisel"}