{"KURSUSE_NIMI": "Muusika kriitika", "KURSUSE_KOOD": "P2VK.02.510", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Muusikakriitika erinevad avaldumisvormid läbi ajaloo. Käsitleme erinevaid arvustamisvorme ja -stiile, arvustaja ülesannet, sellega seotud vastutust ja võimalusi ning objektiivsuse küsimust. Kogeme praktilise kirjutamise kaudu, kuidas sünnib tekst, mis võib olla kirjutaja taust, inspiratsioon ja motivatsioon ning mis rolli mängib sealjuures teksti toimetamine ja avaldamiseks vormistamine. Võtame eeskuju ka kogenud arvustajatelt minevikust ja tänapäeval. Käsitleme muusikakorraldaja, muusiku ja ajakirjanduse omavahelist suhtlemist, võimalusi ja probleeme.\n\nKursus sisaldab ka tekstianalüüsi ja toimetamisega seotuid praktilisi ülesandeid. Kursusele kutsutakse võimaluse korral ka eesti muusikaajakirjanduse toimetajaid ja kogenuid kriitikuid tutvustama enda tööd.Objectives/eesmärkid:  Arendada tudengite kriitilist, analüüsivat ja uuele avatud mõtlemist. Võimaldada neil leida oma stiil ja omandada praktilised kogemused. Õppida teistelt kriitikutelt (minevikust ja tänapäeval) ja reflekteerida enda kirjutamisprotsessi.Learning outcomes/õpiväljund:  I Tudengid orienteeruvad esmaselt muusikakriitika alal: tutvutakse (muusika)kriitika erinevate avaldumisvormidega läbi ülevaate tekstide (sekundaar- ja teaduslik, sh leksikonitüüpi kirjandus)\nII Essee kirjutamine valitud muusikaspetsiifilisel teemal\nIII Tudengid suudavad analüüsida erinevaid kriitikateksti tüüpe\nIV Tudengid omandavad enesekogemust: kuidas toimib kirjutamisprotsess, tudengid leiavad oma stiili ja julgust kirjutada\nV Korraldamine, avalikud suhted ja kriitika: Tudengid mängivad läbi muusika-/kunstiteose esitaja/looja - korraldaja/kuraatori - kriitiku/vastuvõtja kolmnurka"}