{"KURSUSE_NIMI": "Läbirääkimise tehnika", "KURSUSE_KOOD": "P2VK.05.217", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Läbirääkimis- ja suhtlemisoskuste arendamine.\nKursus annab teadmisi läbirääkimiste pidamiseks vajalikest oskustest, samuti osapoolte strateegilistest ja taktikalistest valikutest läbirääkimiste olukorras. Kursusel analüüsitakse erinevaid läbirääkimiste situatsioone.Objectives/eesmärkid:  Tudengid saavad kursuse käigus teoreetilisi ja praktilisi teadmisi läbirääkimiste protsessist ja läbirääkimistega kaasnevatest probleemidest.\nPõhjalikult käsitletakse konflikti lahendamise viit põhimudelit: võitlev, koostöö, alistuv, tegevusetus ja kompromiss. \nKonkreetsete näidete abil seletatakse lahti pehme ja jäiga läbirääkija tugevused ning nõrkused. Analüüsitakse liitvate ja jaotavate läbirääkimiste olemust, kuidas kaasata kolmandat osapoolt ning moodustada koalitsiooni. Kasutada enda ja teise osapoole ressursse.\nAine käsitlus on kompleksne: suulise eneseväljendamise ja suhtlemise e kommunikatsiooni põhialuseid ja läbirääkimiste teooriad ja praktikad.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:\n-\ton teadlik läbirääkimiste algusest ja teeb eeltööd;\n-\toskab ennast jälgida, kontrollib ja suunab teadlikult oma emotsioone, sõnakasutust, verbaalset ja mitteverbaalset keelt; \n-\tteab läbirääkimiste protsessis peituvaid võimalusi ja kuidas ühelt läbirääkimisstiililt teisele üle minna;\n-\ton teadlik mõjuvõimu, eetika ja kultuurierinevuste mõjust läbirääkimistel;\n-\ttöötab lepingutega tähelepanelikult ja on teadlik lepingutega kaasnevatest lõksudest, õigustest ja kohustustest;\n-\toskab oma teadmisi rakendada nii professionaalsetes kui ka tavaelu situatsioonides."}