{"KURSUSE_NIMI": "Intellektuaalne omand", "KURSUSE_KOOD": "P2VK.05.059", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Õiguse alused"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 21, "practice": 0, "seminar": 4, "independent_work": 53, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine käsitleb intellektuaalse omandi kaitse põhialuseid ning õiguslikke aspekte. Vaadeldakse erinevaid intellektuaalse omandi liike nagu autoriõigus, autoriõigusega kaasnevad õigused ja tööstusomand (kaubamärk, patent, kasulik mudel, ja tööstusdisainilahendus). Kuigi põhirõhk on autoriõigusel ja autoriõigusega kaasnevatel õigustel, peatutakse lühidalt ka tööstusomandi eri liikidel. Autoriõiguse ja kaasnevate õiguste vallas on läbitavateks teemadeks autoriõiguse olemus ning ajalooline areng, kes on autor on ning mis on teos ja millised õigused tekivad autoril teose suhtes. Käsitlust leiavad ka teemad nagu, kes on isikud, kellele võib kuuluda autoriõigus, milline on autoriõiguste ajaline kehtivus ja millised on erinevad teoste kasutamise viisid (õiguste loovutamine, litsentsi andmine, OA, creative commons jms). Olulisel kohal on samuti autoriõiguse ja autoriõigusega kaasnevate õiguste kaitse ning õiguste kollektiivne teostamine, KEOde olemus ning Eestis tegutsevad KEOd. Käsitlemist leiab ka intellektuaalse omandi ja uute tehnoloogiate temaatika.Objectives/eesmärkid:  Kursuse üldeesmärgiks on anda ülevaade intellektuaalse omandi olemusest, erinevatest liikidest ja allikatest. Põhirõhk on autoriõigusel ja autoriõigusega kaasnevatel õigustel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine läbinud õppija:\n\nTunneb intellektuaalse omandi peamisi liike ja mõisteid ning oskab neid seostada erialalise tegevuse praktiliste tahkudega.\n\nTunneb erinevat liiki teoste kasutamisega seonduvaid autoriõiguse ja kaasnevate õiguste alaseid nõudeid ning teab, kuidas neid praktikas täita."}