{"KURSUSE_NIMI": "Organisatsioonijuhtimine", "KURSUSE_KOOD": "P2VK.05.326", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Organisatsiooniõpetus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 46, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppekursus annab üliõpilasele teadmisi organisatsiooni juhtimisest ja juhirolli tähtsusest. Õpitakse tundma juhtimise teoreetilisi käsitlusi, juhi rolle, liigitusi, omadusi, juhtimisstiile, oskusi ning meeskonnatööd. Käsitlust leiavad juhtimise klassikalised funktsioonid: planeerimine ,organiseerimine, eestvedamine, kontrollimine ja tähelepanu saab pööratud ka kvaliteedi juhtimisele, kommunikatsioonile, konfliktijuhtimisele ning enesekehtestamisele. Üliõpilane saab ülevaate rahvusvahelisest juhtimisest, juhtimiseetikast ja juhtimisest tänapäeval - kiirete muudatuste ajal. Lisaks teoreetiliste teadmiste omandamisele teostab üliõpilane 1 intervjuu tegevjuhiga, töötab iseseisvalt läbi etteantud erialase kirjanduse ja osaleb seminaril ning enesekehtestamise praktikumis.Objectives/eesmärkid:  Anda õpilastele teoreetilised teadmised juhtimisest, seostades ja ilmestades neid rakenduslike lähenemistega konkreetsete juhtimiskaasuste, teaduskirjanduse ning aravamusartiklite toel erinevatel juhtimisalastel teemadel.Learning outcomes/õpiväljund:  Üliõpilane: -  omab teadmisi valitud juhtimise teoreetilistest käsitlustest; -          orienteerub juhtimisotsuseid vajavates olukordades ning seostab nendega asjakohaseid oskusi ja teadmisi, sh enesejuhtimist -          oskab mõtestada juhi hoiakute mõju meeskonnale -          oskab hinnata motivatsiooni olulisust seoses juhtimise valitud funktsioonidega; -          seostab väärtuspõhise juhtimise kommunikatsiooni ja konfliktijuhtimisega; -          mõistab juhtimiseetika ja sotsiaalse vastutuse olulisust. Kontaktid: \n\nJoonas Tartu, kontakt: tartujoonas@gmail.com)\n\nLühikirjeldus:\nLähtepunkt on, et organisatsioon ei ole vaid klassikaline selgelt struktureeritud ning hierargiline asutus või ettevõte, vaid mistahes ühise eesmärgi nimel tegutsev kooslus. Samuti, et juht pole ainult suure organisatsiooni tippjuht, vaid me kõik erinevaid rolle ja ülesandeid täites. \nKursus annab üliõpilasele teadmisi organisatsiooni juhtimisest. Õpitakse tundma juhtimise teoreetilisi käsitlusi, juhtimise funktsioone, juhi rolle, vajalikke oskuseid ja juhtimisstiile. Käsitlust leiavad juhtimise klassikalised funktsioonid: planeerimine, organiseerimine (sh meeskonnad), eestvedamine ning kontrollimine. Otsustusprotsess ja juhtimist mõjutavad tegurid. Tähelepanu saavad eestvedamine, kommunikatsioon, konfliktide lahendamine, motiveerimine. Tutvutakse juhtimiseetikaga. Samuti muutuste, innovatsiooni ja kriisijuhtimisega. Vaadeldakse, milline on vastutustundliku juhtimise olemus."}