{"KURSUSE_NIMI": "Joonistamine I", "KURSUSE_KOOD": "P2VK.04.192", "EAP": 1.5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 24, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 15, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Temaatiline kava sõltub õppegrupi tasemest, oskustest. Esmane algõpe:\n-\ttöövahendid, nende õiged kasutusvõtted,\n-\tformaadi valik, kujundi paigutus paberil, pildipinna kasutamine,\n-\t3D maailma kahemõõtmelisena kujutamise võimalused - joon, pind, struktuur, tekstuur,\n-\tsilmapiir, algteadmised elementaarsest perspektiivist,\n-\tkonstruktsioon, ülesehitus, mahud jne.Objectives/eesmärkid:  Anda erialaseks tööks vajalik joonistusoskus, oma ideede veenva kujutamise oskus, Anda piisavalt juhendeid iseseisva tööga toimetulekuks, tekitada harjumus oma töö analüüsimiseks,  arendada loovust joonistamisele omaste võimaluste ja vahenditega.Learning outcomes/õpiväljund:  Kursuse lõpetanu:\n-   Oskab näha ja kujutada kompositsioonilist tervikut,\n-   Omab algteadmisi konstruktsioonist ja proportsioonidest,\n-   Valdab mingil määral elementaarset perspektiivi\n-   Oskab kasutada joonistuse põhielemente - joont ja pinda, struktuuri, rütmi, hele-tumedust, kontrasti,\n-   On saanud harjumuse analüüsida oma töid,\n-   Tuleb toime iseseisva töö ülesannetega,\n-   Saab hakkama oma tööde eksponeerimisega. Kõik töövahendid (sh. joonistuspaber A2) peavad olema tunni alguseks kaasas.\nJOONISTUSVAHENDID MÜÜGIL\nViljandis on kunstitarbed (paber, joonistusvahendid)\nmüügil Centrumis, II korrusel kirjatarvete poes.\nTallinnas G-galerii kunstitarvete kaupluses Vabaduse väljak 6 ning kaupluses Vunder, Pirni t. 5.\nSoodsa hinnaga joonistuspaber müügil kaupluses Zelluloos, Narva mnt. Tallinna Ülikooli vastas.\nThe students must be equipped with all resources for carrying out the assignment (including A2 size drawing paper) at the beginning of the class.\nTHE DRAWING TOOLS CAN BE BOUGHT:\nin Viljandi, art supplies (paper, drawing equipment) are sold at Centrum, in the stationery shop on the 2nd floor;\nin Tallinn, at the art supply shop of G-galerii at Vabaduse väljak 6 and in Vunder shop at 5 Pirni Street;\ndrawing paper at a discount price is sold at Zelluloos shop opposite Tallinn University."}