{"KURSUSE_NIMI": "Kiviehitus", "KURSUSE_KOOD": "P2VK.01.047", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 24}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kivi kasutamine Eesti maaehituspärandis. Esemete ja tööriistade arengu seosed. Kiviehituse tulek talurahvaehitusse, põhilised kasutusvaldkonnad, tehnikad ja levik. Rakendusliku ja esteetilise põimumine ja areng: vorm, figuraalelemendid, kirjad ja märgid, ornament. Piirkondlikud eripärad. Ohvrikivid, mälestuskivid ja hauakivid. Rahvuslik raiddekoor maakirikutes. Kiviristid. 18.saj. päikesekellad. Kiviaiad, piirikivid, nurgakivid, sillutised. \nLooduslikud kivimaterjalid: kivimite klassifikatsioon, koostis, omadused ja kasutusalad, levik ja kättesaadavus. Traditsioonilised tehiskivimaterjalid: keraamilised materjalid, omadused ja kasutusala, päritolu ja tootmine.\nKivi töötlemise vahendid, nende liigitus ja hooldus. Kivi töötlemise tehnikad, ohutus ja ergonoomika. Töökoht ja töökoha ettevalmistamine.\nTraditsiooniliste kivikonstruktsioonide seisukorra hindamine ja renoveerimine: sekkumisvajaduse tuvastamine ja hindamine, sekkumismeetme valimine. Konserveerimine, kogu konstruktsiooni uuendamine, osaline uuendamine. Krohvi ja muude viimistluspindade parandamine. Kiviosade ühendamine palkseinaga. \nVundamentide korrastamine. Põhja- ja pinnavee ärajuhtimine (maapinna vormimine, pinnase vahetamine, drenaa). Pinnase läbikülmumise tõkestamine. Sokli õgvendamine. Vundamendikivide vahetamine. Vundamendi renoveerimine järgides ehitusnorme ja head ehitustava. Muinsuskaitse erinõuded. \nHarjutamine kogenud meistrite käe all.Objectives/eesmärkid:  Anda põhiteadmised ja oskused traditsioonilisest kiviehitusest ning vastavatest töövahenditest.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane -  tunneb ja oskab nimetada loodusliku kivi kasutusvaldkondi traditsioonilises ehituses ja maastikuehituses; -  tunneb ja oskab nimetada loodusliku kivi kasutuse kujunduslikke, tehnilisi ja piirkondlikke eripärasid Eesti maaehituspärandis; - oskab ligikaudselt dateerida traditsioonilisi kivist ehitisi või nende osi ning inimtekkelisi maastikumärke; - tunneb Eesti kiviehituspärandis leiduvate rahvakunsti taustaga kirjade, märkide ja ornamendimotiivide päritolu ning tähendust; - tunneb, oskab nimetada ja eristab tööpõhimõtte alusel olulisemaid traditsioonilisi ja kaasaegseid kivitööriistu ja -vahendeid ning masinaid ja seadmeid; - oskab hinnata ajaloolise kivihoone või -detaili valmistamiseks kasutatud tööriistu ja valmistustehnikat vaatluse põhjal; - oskab olulisemaid traditsioonilisi ja tänapäevaseid kivitööriistu ja -vahendeid ning masinaid ja seadmeid ohutult, ratsionaalselt ja ergonoomiliselt kasutada, korrasolekut kontrollida ja hooldada; - oskab korraldada nõuetekohaselt oma töökohta, valida materjale ja töövahendeid;  - tunneb töötervishoiu ja tööohutusnõudeid kivi töötlemisel nii käsitööriistade kui masinate ja seadmetega; - tunneb palkhoone kiviosade parandamise ja palkseinaga ühendamise põhimõtteid; - oskab hinnata traditsiooniliste kivikonstruktsioonide seisukorda; - arvestada muinsuskaitse nõuete ja hea tavaga traditsiooniliste kiviehitiste renoveerimisel; - kasutada vastavat õppe- ja teatmekirjandust."}