{"KURSUSE_NIMI": "Laagripraktika", "KURSUSE_KOOD": "P2VK.05.142", "EAP": 3, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 14, "individual_work": 2, "internship": 56}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Vaatluspraktika\n1.\tlaagri struktuur ja laagripersonal töö ja eesmärgid; kasvataja tööülesanded laagris;\n2.\tkirjeldada ja analüüsida laagri kodukorda (nii personalile kui ka lastele); laagriprogrammi (laagritegevuse eesmärgistatus, päevaplaan, nädalakava planeerimine, tegevuste ettevalmistamine ja teostamine); turvalisuse tagamise võimalused. \nKasvatuspraktika\n3.\tkasvataja tööülesanded laagris;  suhtlemine lastega ja nendele arengutingimuste loomine; \n4.\tsündmuste korraldamine, päevaplaani koostamist; tegevuste analüüs\n5.\tOhutuse tagamine sündmustel ja igapäevases töös lastega; probleemsituatsioonid ja nende lahendusvõimalused. \nPraktikandi eneserefleksioon\n6.\tkogemuste analüüs, oma panuse ja isikliku arengu hindamine\n7.\tsaadud tagasiside analüüs ja hindamineObjectives/eesmärkid:  Osakutse kompetentside rakendamine. Kogemuse saamine laagritööst laste ja noortega vaatlus-, kasvatus- ja korraldustöö vormis. Osalemine kasvataja ülesannetes 6-ööpäevases projekt- või noortelaagris, mis annab võimaluse integreerida teoreetiliselt omandatud teadmised praktilisse tegevusse. Iseenda tugevuste ja nõrkuste tundmaõppimine. Tegutsemis- ja analüüsioskuste arendamine.Learning outcomes/õpiväljund:  Praktika läbinud üliõpilane \noskab \n- märgata laagritegevuste struktuuri, eesmärgipärasust ja vastavust seadusandlusele, \n- koostada ja kohanada laagriprogrammi vastavalt olukorrale (laagri ja keskkonna spetsiifika, ilmastik, laste vanuse ja käitumise eripärad), \n- viia läbi ühistegevusi ja tegevusi väikese (kuni 24in.) laste/noorte grupiga,\n- suhelda laagri igapäevaelus ja muudes ühistegevustes laagrilistega ja meeskonna liikmetega,\n- hinnata laagrisituatsioonist tulenevaid ohte ja neid ennetada,\n- mõistab enda kui kasvataja olulist rolli laagrisituatsioonis;\n- suudab analüüsida oma tugevusi ja nõrkus ning oma tööd laagrisistuatsioonis ja sellest õppida."}