{"KURSUSE_NIMI": "Metsabioloogia ja dendroloogia", "KURSUSE_KOOD": "P2VK.01.109", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "DENDROLOOGIA. Puittaimede rühmad (puu, põõsas, liaan). Puittaimede bioloogia ja fenoloogia. Keskkonnategurite mõju ja puittaimede jagunemine valguse, temperatuuri ja niiskuse nõuete ning kõrguse ja vanuse järgi. Taksonoomilised üksused. Kodumaiste ja tähtsamate võõrpuuliikide süstemaatika, morfoloogia, geograafiline levik ja levik kultuuris, fenoloogia, omadused ja nõudlused, kasvatamine ja kasutamine.\nMETSABIOLOOGIA. Sissejuhatus. Eesti metsad, nende liigiline koosseis, juurdekasv, vanus. Muutused metsades ja metsanduses viimase 50 aasta jooksul. Maailma ja Euroopa metsaressurss.\nMetsa mõiste. Puistu mõiste. Metsakategooriad. Puistu koostisosad. Metsanduslikud terminid. Puude diferentseerumine ja puistute isehõrenemine, kasvuklassid. \nMets ja keskkond: mets ja valgus, mets ja temperatuur, mets ja vesi, mets ja atmosfäär, mets ja muld. Mets ja alustaimestik. Puht- ja segapuistute metsakasvatuslik iseloomustus. \nPuuliikide vaheldus. Vahelduse peamised suunad ja põhjused. Metsa kasvukohatüübid. Mõiste ja klassifitseerimise alused (E. Lõhmuse järgi). \nMetsakaitse. Puu- ja puidumädanikku tekitavate seente tundmine. Seemnete, viljade, okaste, lehtede ja võrsete haigused, mittemädanikulised tüvehaigused. Olulisemad putukkahjurid (üraskid, männikärsakad). Uluki- ja ilmastikukahjustused metsas.Objectives/eesmärkid:  Anda ülevaade kodumaistest puistaimedest ja Eestis levinumatest võõrpuistaimedest ning metsabioloogia alustest.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel üliõpilane -      tunneb ja eristab puittaimede rühmi; -      tunneb põhiliste keskkonnategurite ja puittaimede arengu vahelisi seosed; -      oskab looduses ära tunda peamised kodumaised ja tähtsamad võõrmaised puu- ja põõsaliigid; -      tunneb kodumaiste ja tähtsamate võõrpuuliikide kasvatamise ja kasutamise keskseid eripärasid; -      \ttunneb Eesti metsade liigilist koosseisu; -      \ttunneb metsanduslikke põhimõisteid; -      \ttunneb puuliikide vahelduse peamisi suundi ja põhjuseid; -      \ttunneb ja oskab nimetada peamisi metsakasvukohatüüpe; -      \ttunneb metsakaitse üldaluseid, peamisi metsakahjustuste tüüpe ja metsa kahjustajaid."}