{"KURSUSE_NIMI": "Tervis ja heaolu koolis", "KURSUSE_KOOD": "SHHI.02.030", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 28, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tervis ja tervise erinevad kontseptsioonid. Tervisedenduse ja -kasvatuse mõiste, põhimõtted, tegevused ja mõju. Ülevaade inimesest kui tervikorganismist. Õpilase tervist mõjutavad tegurid koolieas, sh koolis. Terve psühhosotsiaalne ja füüsiline kasvukeskkond ja selle kujundamine koolis. Tervist edendava haridusasutuse põhimõtted ja tegevusvaldkonnad. Tervise ja heaoluga seotud uuringud, seadusandlus ja statistika. Tervislik eluviis ja selle kujundamise võimalused läbi õppe- ja kasvatustegevuse.Objectives/eesmärkid:  Anda tervisedenduse ja tervisekasvatuslikud baasteadmised ja oskused, et õpetada kaasaegsete arusaamade kohaselt erinevaid terviseteemasid koolis.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane: orienteerub tervise erinevates kontseptsioonides ning teab õpilase tervist mõjutavaid tegureid ja oskab neid seostada õpilase tervise ja heaoluga suudab analüüsida erinevaid tervisega seotud aspekte ning võtta vastu tervisele kasulikke otsuseid mõistab tervisedenduse  ja tervisekasvatuse olemust,  tegevuse eesmärke  ning nende mõju indiviidi ja organisatsiooni heaolule tunneb tervist edendava kooli põhimõtteid ja tegevusvaldkondi ning oskab kujundada tervet psühhosotsiaalset ja füüsilist keskkonda koolis oskab kasutada ja hinnata kaasaegset tervisealast informatsiooni ja seda vajadusel rakendada igapäevases töös koolis oskab suunata õpilasi põhjendatud tervisealaste valikute tegemisel valdab õpetamise viise, millega koolis lähtuvalt riikliku õppekava eesmärkidest saab lõimitult õpetada terviseteemasid erinevas vanuses õpilastele  orienteerub tervise ja heaoluga seotud uuringutes, seadusandluses ja statistikas teab ja tunneb inimese erinevaid elundkondi ja tähtsamaid elundeid ning nende ülesandeid"}