{"KURSUSE_NIMI": "Õppimise neurokognitiivsed aspektid", "KURSUSE_KOOD": "SHHI.03.056", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "\"Õppimise neurokognitiivsed aspektid\" on ainekursus, mis keskendub afektiivsete ja kognitiivsete protsesside nagu taju, keel/kõne, mälu, tähelepanu/teadvus, mõtlemine ja emotsioonid ning motivatsioonid kirjeldamisele närvisüsteemi erinevatel tasemetel (närviringetest ajuosadeni). Antakse edasi uuem teadmine, mida neuroteaduslikud uuringud loomadel ja inimestel taju, õppimise, mälu, tähelepanu ja mõtlemise kohta on leidnud. Tulemusi selgitatakse inimkäitumise võtmes. Kursuses käsitletakse erinevat tüüpi õppimise- ja mälusüsteeme, mida võrreldakse ning kirjeldatakse nende protsesside aluseks olevaid molekulaarseid ja süsteemseid mehhanisme. Räägitakse ka sellest, milliseid puudujääke võib ette tulla tajus, õppimises ja teistes kognitiivsetes funktsioonides, kui nimetatud toimimismehhanismid kahjustatud saavad.  Õppijaid julgustatakse kasutama teadmisi õpilaste õppimise toetamisel ning enda õppimise, mälu ja tähelepanu tõhustamisel.Objectives/eesmärkid:  - Selgitada närvisüsteemi organisatsiooni ja tegevust tasemel, mis võimaldab süvendatud arusaama kognitiivsete funktsioonide toimimisest. - Anda ülevaade infotöötluse, õppimise ja mälu molekulaarse-, raku- ja süsteemse taseme käsitlustest.  - Selgitada õppimise kognitiivseid, afektiivseid ja motoorseid aspekte hariduslike erivajaduste kontekstis.Learning outcomes/õpiväljund:  1.\tKirjeldab närvisüsteemi osalust afektiivsete ja kognitiivsete funktsioonide toimimisel. \n2.\tTeab ja eristab erinevaid õppimise, mälu ja tähelepanu liike ning ajupiirkondi, mis nende protsesside eest vastutavad.\n3.\tMõistab, kuidas toimub tänapäevane uurimistöö afektiivsete ja kognitiivsete funktsioonide valdkonnas.\n4.\tOskab hinnata oma õpiprotsessi ning mõistab kuidas edendada õppimist, tähelepanu ja mälu erinevates tingimustes."}