{"KURSUSE_NIMI": "Inglise keele praktiline grammatika I ja II kooliastme õpetajale (II)", "KURSUSE_KOOD": "SHHI.02.008", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Inglise keele praktiline grammatika I ja II kooliastme õpetajale (I)"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Edasijõudnute (advanced) grammatikakursus, mille käigus käsitletakse keerulisemaid grammatikastruktuure ja lauseõpetust (modaalverbid, tingimuslaused, erinevat liiki kõrvallaused, artikli kasutamine, kaudne kõne, partitsiip, infitiiv ja gerundium jne.) See on kursuse Praktiline grammatika I järg, mis valmistab üliõpialased ette õpetama grammatikat II kooliastmes. Käsitletavad grammatika teemad arendavad üliõpilaste keelelist kompetentsust ja valmistavad nad ette õpetama keerukamaid keelestruktuure ja analüüsima I ja II kooliastme õpilaste keelekasutust grammatika õpetamise seisukohast. Üliõpilased koostavad ise õpitavate teemade piires õpiülesandeid ning rakendavad ja analüüsivad neid seminarides. Üliõpilased arendavad grammatika alaseid teadmisi erinevates situatsioonides, rollimängudes ja lühiesinemistes. Keelestruktuure õpitakse eesmärgiga omandada korrektne keelekasutus ja oskus valida grammatika õpetamiseks ja II kooliastmes sobivad õpetamisvõtted ning oskus tegelda õpilaste vigadega.Objectives/eesmärkid:  Süvendada üliõpilaste grammatikaalaseid teadmisi ja arendada nende rakendamisoskust I ja II kooliastmes. Kinnistada olulisemaid keelestruktuure praktilise keelekasutuse seisukohast lähtudes.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:\n*\tteab grammatikareegleid läbivõetud teemade piires; \n*\toskab moodustada ja korrektselt kasutada keerulisemaid keelestruktuure;\n*\ttunneb I ja II kooliastmes grammatika õpetamise erinevaid võtteid ja oskab nende hulgast antud kooliastmetele sobivad valida.\n*\toskab koostada ja leida konkreetse grammatika teema kohta ülesandeid; katsetada mõne võtte tõhusust kaasüliõpilaste peal ja nii enda kui kaasüliõpilaste grammatika õpetamise võtte tõhusust hinnata;\n*\toskab koostada miniettekandeid konkreetsete grammatika teemade kohta.\n*\ttunneb grammatika termineid;\n*\tteab grammatikareegleid läbivõetud teemade piires;\n*\toskab moodustada ja korrektselt kasutada  olulisemaid keelestruktuure."}