{"KURSUSE_NIMI": "Psüühika põhifunktsioonid", "KURSUSE_KOOD": "SHPH.00.038", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse eesmärk on anda süstemaatiline lühiülevaade psüühikast. Lähtuvalt eeldusest, et aju ja selles tekkiva psüühika evolutsiooniline otstarve on informatsiooni töötlemine käitumise juhtimiseks, vaatleb kursus peamisi selle pealisülesande täitmiseks vajalikke psüühika funktsioone.\n1) Info vastuvõtmine - kuidas meeled ammutavad keskkonnast informatsiooni, mille põhjal luuakse tajus terviklik reaalsuse kuvand.\n2) Info representeerimine - kuidas teave võib olla esindatud erinevat tüüpi märkidena (representatsioonid), mis võimaldavad seda paindlikult töödelda (keel).\n3) Info talletamine - kuidas teabe talletamine ja taaskasutamine (mälu) võimaldab käitumist muuta keskkonnale vastavaks (õppimine).\n4) Info integreerimine - kuidas erineva päritolu ja vormiga info üheaegne esindatus töömälus ja väljaspool seda võimaldab luua uut teavet (mõtlemine).\n5) Käitumise juhtimine - kuidas psüühika suhestub keskonnaga keha ja tegevuse kaudu, mille esindused ajus on üks töödeldava info liik.\n6) Eesmärgipärasus - kuidas käitumise kasulikkuse tagamiseks (motivatsioon) tõlgendab psüühika infot organismi eesmärkidest lähtuvalt (emotsioonid).\nNB! Hindelised õpitegevused algavad juba septembris.Objectives/eesmärkid:  Anda struktureeritud lühiülevaade psüühika peamistest funktsioonidest.Learning outcomes/õpiväljund:  - Oskus analüüsida psüühikat informatsiooni töötlemise ja käitumise juhtimise süsteemina. - Esmane ettekujutus, milliseid ülesandeid ja kuidas täidavad meeled ja tajumine; representatsioonid ja keel; mälu ja õppimine; töömälu ja mõtlemine; keha ja tegevus; ning motivatsioon ja emotsioonid. - oskab iseseisvalt lugeda akadeemilisi tekste ja teab, millised on efektiivsed infotöötlemise viisid (töömälu ja mõtlemise teemaplokk) - teab, millised on efektiivsed, pikaajalist mäletamist toetavad õppimisviisid ja millised ei ole (mälu ja õppimise teemaplokk) - oskab oma aega õppimisele planeerida"}