{"KURSUSE_NIMI": "Simulatsiooniseminar rahu ja konfliktiuuringutes", "KURSUSE_KOOD": "SHRG.03.020", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 10, "independent_work": 64, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb loengutest ja seminaridest. Algselt on loengud konfliktilahendustest ning vahendusest ja läbirääkimistest. Loengutele järgnevad seminarid. Kolm simulatsiooniseminari on sissejuhatava ja kokkuvõtvate seminaride vahel. Igaks seminariks peavad tudengid lugema kursusematerjale, seminariks ette valmistama ning aruteludes aktiivselt osalema. \nLoengutes käsitletakse vahenduse ja läbirääkimiste tehnikaid. Kursus annab juurde kursusele \"Conflict Management and Resolution\" kuna lisa teemasid ning süvaanalüüsi.Objectives/eesmärkid:  Kursus on valikaine, mille peamine eesmärk on täiendada kohustuslikke kursusi rahvusvahelisele konfliktile uue vaatenurga andmisega. Kursuse konkreetne eesmärk on uurida nii riikidevaheliste kui siseriiklike konfliktide rahuläbirääkimiste otsusetegemiste dünaamikat ja komplekssust. Kursuse käigus käsitletakse simulatsioonin abil konfliktipoolte ning väliste toimijate erinevaid strateegiaid vahenduse käigus. Tudengid kasutavad oma teadmisi ainest \"Conflict Management and Resolution\" ning kombineerivad neid läbirääkimistel vajalike praktiliste oskustega. Neid oskusi kursuse käigus õpitakse ning neid on võimalik kohaldada ka väljaspool kursust.Learning outcomes/õpiväljund:  Kursuse läbides tudengid: 1. Kinnistavad eelnevates kursustes õpitud teoreetilised teadmised; 2. On valmis kasutama mainitud teoreetilisi teadmisi ja kriitilist mõtlemist konfliktilahendusest praktilistes olukordades ning siduma õpitud läbirääkimisoskused nende olukordadega; 3. Saavad aru konfliktidega seotud läbirääkimiste keerukusest; 4. Oskavad erinevaid strateegiaid ja valikuid kohaldada igale võimalikule konfliktiolukorrale; 5. Oskavad arvestada erinevaid konfliktitaustu (kultuur, etnilisus, sugu, ajalugu, majandus), kuna need võivad omada mõju lahendusele Classroom etiquette:\nPlease come to class on time and well prepared. While in class, turn off mobile phones. Laptops are allowed in class but please refrain from using them on non-related issues. Reading news, playing games, messaging and using social media etc are not allowed. Students who systematically keep engaged in these activities are asked to leave the classroom and their status will be considered to be 'absent' (see above).\nPlagiarism is not tolerated. All written work for this course should include proper citations in a standard citation format. If unsure how to quote, ask for help. \"I wasn't sure how to cite a source, so I left out the reference,\" is not an acceptable defence for plagiarism."}