{"KURSUSE_NIMI": "Inimõigused", "KURSUSE_KOOD": "SHRG.00.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 7, "colloquium": 0, "web_learning": 0, "independent_work": 143, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursuse näol pole tegemist puhtalt juriidilise käsitlusega, inimõigustele heidetakse pilk rahvusvaheliste suhete perspektiivist. Lisaks ülevaatele inimõigusi puudutavatest olulisematest õigusaktidest ja rahvusvahelistest lepingutest ning nende kaitsest eeskätt rahvusvahelisel tasandil, pööratakse tähelepanu inimõiguste ajaloolisele kujunemisele ja nende mõjule rahvusvahelistes suhetes. Kursuses käsitletakse ÜRO kui suurima rahvusvahelise organisatsiooni rolli inimõiguste kaitsel ning vaadeldakse ka regionaalseid organisatsioone. Rahvusvaheliste suhete uurimise seisukohalt on oluliseks tuvastada peamiste rahvusvaheliste suhete teooriate seisukohad inimõiguste küsimuses ning leida nende sarnasusi ja erinevusi. Välispoliitilises praktikas toimuv võetakse kokku riikide praktikat uurides. Samuti vaadeldakse inimõigusi eriolukordades nagu relvastatud konflikt.Objectives/eesmärkid:  - Tutvustada inimõigusi kui uurimisvaldkonda rahvusvahelistes suhetes;\n- Läbi töötada inimõiguste olulisemad alusdokumendid;\n- Lahti mõtestada inimõiguste rolli olulisemates rahvusvaheliste suhete teooriates;\n- Õpetada analüüsima inimõiguste rolli rahvusvahelistes suhetes praktiliselt.Learning outcomes/õpiväljund:  Aine edukal läbimisel üliõpilane: - Orienteerub rahvusvaheliste inimõiguste juriidilistes alustes; - Seostab rahvusvahelise poliitika probleeme ning inimõigusi; - Analüüsib inimõiguste osa riikide käitumises; - Analüüsib inimõiguste osa rahvusvaheliste suhete teoorias. Kursuse eetika\nMõned reeglid, mille järgimisel kursuse läbimisel probleeme tekkida ei tohiks:\nPuudumised ja hilinemised tuleb ette teatada.\nTööde õigeaegne esitamine. Töödel on täpsed tähtajad ning tööd tuleb selleks ajaks esitada. Tööde tegemiseks on antud piisavalt palju aega. Hilinenud töid vastu ei võeta!\nTöödel tuleb kindlasti ära märkida autor ja töö pealkiri. Kui on küsimusi, siis ka see palun maili pealkirjas ära tuua (nt 'küsimus kodutööst', mitte lihtsalt 'kodutöö').\nKogu info kodutööde tähtaegade ja loengute-seminaride toimumise osas on saadaval Moodles. Kui ei ole, siis on üliõpilasel õigus pretensioonideks.\nPlagieerimine ei ole tolereeritav. Töödes kasutatud allikad tuleb viidata."}