{"KURSUSE_NIMI": "E-valitsemine", "KURSUSE_KOOD": "SHRG.02.024", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 13, "colloquium": 0, "web_learning": 0, "independent_work": 143, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus hõlmab e-demokraatia normatiivseid väljakutseid ning e-valitsuse praktilisi valdkondi. Esile tõstetakse näiteid Eestist ja teistest maailma riikidest.Objectives/eesmärkid:  Aine annab ülevaate demokraatia arengu peamistest suundadest: elektroonilisest demokraatiast ja kaasaegsest juhtimisesest e-valitsuseni. Eesmärk on tutvustada kaasaegseid trende, mis muutuvad oluliseks demokraatia ja valitsemise jaoks tulevaste aastakümnete jooksul. Aine keskendub e-valitsuse lahendustele ja rakendustele, nt pilvepõhised teenused, ennustusteenused, blokkide loomine, e-hääletamine, smuti hõlmab teenuste normatiivseid väljakutseid.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased (1) mõistavad elektroonilise demokraatia olulisi normatiivseid ja empiirilisi mõõtmeid, (2) omavad ülevaadet võtmetähtsusega elektroonilistest vahenditest poliitilise osaluse ja kaasamise jaoks, (3) nimetavad ja kasutavad e-valitsuse olulisi struktuure ja platvorme, (4) kirjeldavad, kuidas e-demokraatiat ja e-valitsust saab tänapäeval rakendada juhtimises. This course will provide an overview of one of the key trends in democratic development - electronic democracy - and its counterpart in modern governance - electronic government. The objective will be to expose students to the latest trends that will be important for democracy and governance over the coming decades.\n\nThe course is explicitly focused on e-government solutions and applications such as cloud based services, predictive services, blockchain, e-voting but nevertheless covering also the normative challenges that these present. It will examine both scholarly research on these two phenomena as well as case studies on how they have been applied. Examples from Estonia and from other countries from around the world will be highlighted."}