{"KURSUSE_NIMI": "Eesti keele suuline ja kirjalik väljendusõpetus", "KURSUSE_KOOD": "SHRG.00.031", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 18, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuses tutvustatakse erinevaid suulise ja kirjaliku eneseväljenduse eripärasid ja liike. Kirjalik eneseväljendus keskendub eelkõigile teaduslikule tekstile. Suuline eneseväljendus tegeleb nii individuaalse avaliku kõne kui ka avaliku väitlusega (parlamentaarne väitlusformaat). Kursuse käigus õpivad tudengid teksti (nii suulise kui ka kirjaliku) koostamist ja struktureerimist. Samuti õpetatakse argumenteerimist ning vastuargumenteerimist. Kursus õpetab ka demagoogiavõtete äratundmist ning annab soovitusi, kuidas nendega tegeleda. Lisaks antakse soovitusi, kuidas muuta oma esinemine mõjusamaks, mida silmas pidada keha- ja parakeele kasutamisel (mitteverbaalne eneseväljendus). Tudengid teevad mitu kodutööd, mille käigus nad õpivad koostama hästi argumenteeritud ja loogilist kirjalikku teksti, lisaks on kursusesse integreeritud videotreening ning miniväitlusturniir.Objectives/eesmärkid:  - arendada kirjaliku väljenduse oskust, eelkõige töötamist teadusliku tekstiga; - arendada suulise väljenduse oskusi, sh arenda nii individuaalse kõne kui ka väitlusoskusi - anda ülevaade olulisematest keelehooldeallikatest ja õpetada nende kasutamist.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane: - oskab koostada sisukat ja hästi struktureeritud motivatsioonikirja; - suudab analüüsida teaduslikku teksti ning koostada selle põhjal kirjalik kokkuvõte; - oskab hinnata kaastudengite poolt koostatud akadeemilise teksti kvaliteeti ning seda vajadusel redigeerida; - oskab oma mõtteid väljendada õigekeelselt, ühemõtteliselt ja sobiva stiiliga; - omab avaliku kõne koostamiseks vajalikke alusteadmisi (sh mitteverbaalne eneseväljendus) ning suudab iseseisvalt kõnega esineda;  - oskab välja töötada argumentatsiooni oma seisukoha kaitseks ning on suuteline seda tegema elavas debatis; - tunneb ära ja oskab sobivalt reageerida demagoogiavõtetele; - oskab kriitiliselt hinnata oma suulise ja kirjaliku väljenduse oskust ning suudab leida lahendusi sellega seotud võimalikele probleemidele. Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}