{"KURSUSE_NIMI": "Religioon ja poliitika", "KURSUSE_KOOD": "SHRG.02.002", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 4, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Religioon ja poliitika on üldise akadeemilise uurimise objektina interdistsiplinaarne on juba definitsiooni poolest. Sellel kursusel lähenetakse religiooni ja poliitika uurimisele sotsiaalteaduslikust, täpsemalt võrdleva poliitika ja rahvusvaheliste suhete, vaatenurgast. Kursus on organiseeritud kahes osas. Esimeses käsitletakse analüütilisi vahendeid, võtmemõistete kontseptualiseerimist, tüpoloogiaid, kategooriad ja teoreetilisi lähenemisi, mida kasutatakse nii võrdlevas poliitikas kui rahvusvahelistes suhetes religiooni ja poliitika uurimisel. \nKursuse teises pooles uuritakse religiooni ja poliitika suhteid Lääne- ja Ida-Euroopas ning võrdlevalt ka traditsiooniliselt luterlikes, katoliiklikes ja õigeusklikes kultuurides, Lähis-idas, Põhja- ja Lõuna Ameerikas ning Aasias.Objectives/eesmärkid:  1. arendada tudengites võimet uurida ja mõtestada religiooni ja poliitikat sotsiaalteaduslikult (iseäranis võrdleva poliitika ja rahvusvaheliste suhete lähenemiste kohaselt)   2. tutvustada tudengitele peamisi religiooni ja poliitika uurimisel kasutatavaid lähenemisi ja mõisteid, mudeleid ja teooriaid  3. anda ülevaade peamistest religiooni ja poliitika kokkupuute punktidest ja arengusuundadest tänapäeva maailmas  4. tuua näited sellest, kuidas erinevad ühiskondlikud, poliitilised ja usulised ühendused ja institutsioonid on kasutanud religiooni erinevatel (ja tihti vastandlikel) poliitilistel eesmärkidelLearning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane: 1. tunneb peamisi kaasaegse sotsiaalteadusliku religiooni ja poliitika uurimisega seotud akadeemilisi debatte   2. oskab analüüsida religiooni ja poliitikaga seotud teemasid, valdkondi ja aspekte sotsiaalteaduslikust lähenemisest lähtudes ning tunneb keskseid mõisteid ja teooriaid, analüütilisi lähenemisi, tüpoloogiaid ja kategooriaid, mida kasutatakse võrdleva poliitika ja rahvusvaheliste suhete lähenemiste puhul  3. omab arusaamist peamistest (alateema)valdkondadest, kus religioon ja rahvuslik politiika ning religioon ja rahvusvaheline poliitika kokku puutuvad 4. omab arusaamist sellest, kuidas mõjutab religiooni ja poliitika suhteid kultuuriline, konfessionaalne, ajalooline, majanduslik ja poliitiline kontekst. 5. oskab tuvastada sarnasusi ja erinevusi viisides, kuidas erinevad usulised toimijad suhestuvad riigi ja kultuurkogukonna, poliitiliste protsesside ja avaliku poliitika tulemitega.   6. oskab iseseisvalt ja sotsiaalteadusliku lähenemise kohaselt religiooni ja poliitikat uurida 7. oskab religiooni ja poliitikaga seotud küsimuste ja probleemidega seotud arutelusid mõista ning neisse aruteludesse ka iseseisvalt panustada."}