{"KURSUSE_NIMI": "Riik ja ühiskond", "KURSUSE_KOOD": "SHRG.00.029", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab ülevaate ühiskonna moderniseerumisest, selle kontseptsiooni kriitilisest kasutamisest ning tänapäeva ühiskonna väljakutsetest. Samuti tutvustab kursus ühiskonna struktuuri, selle jagunemist ja kihistumist ning sellest tulenevaid võimusuhteid, nii normatiivsel kui ka institutsionaalsel plaanis. Kursuse käigus võrreldakse erinevaid poliitilisi süsteeme, keskendudes demokraatliku õigusriigi funktsioneerimisele. Olulist tähelepanu pööratakse aktiivse kodaniku kasvatamisele läbi kodanikuühiskonna toimimise tutvustamise ning selles osalemise võimaluste hindamise. Samuti mõtestatakse lahti inimõigustega seotud temaatikat. Lisaks siseriiklikule mõõtmele, annab kursus ka üldise arusaama üleilmastumisprotsessist, selle tähtsusest ning sellega seotud probleemidest, lisaks tutvustatakse selles kontekstis tänaseid rahvusvahelisi suheteid. Kursus on üles ehitatud õppemeetoditele, mis eeldab tudengite aktiivset kaasamist.Objectives/eesmärkid:  Kursuse eesmärgiks on parandada (tulevaste) ühiskonnaõpetuse õpetajate arusaamist ühiskonnas toimivatest sotsiaalsetest ja poliitilistest protsessidest, riigi funktsioneerimisest ning aluspõhimõttest riikide omavahelistes suhetes. Samuti on kursuse eesmärgiks tutvustada eelnevalt mainitud teemasid läbi kaasavate õppe- ja õpetamismeetodite, mida on võimalik tulevastel õpetajatel rakendada tulevikus klassiruumis.Learning outcomes/õpiväljund:  Kursuse lõpetamisel tudeng: - mõistab ja suudab lahti seletada tänase ühiskonna ülesehitust, selle kujunemist ning funktsioneerimist, sh suudab lahti mõtestada sotsiaalseid identiteete; - mõistab ja suudab lahti seletada riigisiseseid poliitilisi protsesse ning erinevate ühiskonna gruppide omavahelisi suhteid; - mõistab erinevate poliitiliste režiimide eripärasid, tunneb demokraatia toimemehhanisme, sh inimõiguste rolli nendes; - mõistab ja suudab lahti seletada kodanikuühiskonna toimimist, selle vajalikkust ning suhtlemist riiklike institutsioonidega; - mõistab ja suudab lahti seletada riikidevahelisi suhteid (sh tunneb peamisi rahvusvahelisi organisatsioone) ja globaalseid protsesse; - oskab rakendada erinevaid kaasavaid õppemeetodeid, mis võimaldab suurendada õpilaste arusaama ühiskonna ja riigi toimimisprotsessidest ning riikidevahelistest suhetest; - oskab õpetamisprotsessi kaasata eripalgelisi õppematerjale sh meediat, audio-visuaalset materjali, juhtumianalüüse jt."}