{"KURSUSE_NIMI": "EL rahvusvahelises poliitikas", "KURSUSE_KOOD": "SHRG.03.029", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 2, "seminar": 16, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "The course will consist primarily of interactive lectures based on the academic literature which will serve as the basis for structured discussions, designed to help the students both internalize the information and develop a more critical approach. Each class will begin with the instructor introducing and giving an overview of the most significant concepts, theoretical approaches and aspects of the featured theme. The second part of the class will feature a student presentation based on the assigned readings. The presentation(s) will serve as a lead-in to subsequent general class discussion. The discussion will centre on debating a specific proposition or analyzing a specific case in depth. Students are expected to prepare for each class by reading the assigned articles or book chapters and take an active part in the classroom discussion.Objectives/eesmärkid:  This course examines the international relations of the European Union (EU) and explores the EU's quest to become a 'global actor'. The course is in five parts or blocs. The first bloc analyzes the foundations and history of this political project. It examines the main goals of EU foreign policy and key events of crisis when these have failed to be realised. Part two deals with the actors who shape the EU's external relations - the various European institutions and the foreign ministries of the member states - as well as with how policies are crafted and implemented. The third bloc looks at the evolution of and the successes and failures of the EU's Common Foreign and Security Policy and the EU's Common Foreign and Security Policy. Part four examines the other EU's external actions, trade policy, development cooperation, and how the EU has dealt with its own Neighbourhood. The fifth, and final, bloc scrutinizes the EU's attempt to join the ranks of the global powers through various 'strategic partnerships', and the tensions that have defined these political associations. Specifically, the EU's relationship with the US, Russia, China and the United Nations, as well as other multilateral organizations, will be assessed. The overall objective of the course is to critically evaluate the EU's politics on the global stage in terms of what it reveals about the conduct of international relations in the 21st Century.Learning outcomes/õpiväljund:  Upon completing the course, students should be able to: 1. Understand the EU's identity as a 'global actor' from different theoretical perspectives; 2. Understand and explain key events of crisis in EU foreign policy in the 21st Century; 3. Understand and explain the tensions in the EU's relationships with other global powers;   4. Possess the skills necessary for conducting independent foreign policy analysis."}