{"KURSUSE_NIMI": "Kvalitatiivne analüüs", "KURSUSE_KOOD": "SHRG.00.016", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 2, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengute, seminaride ja praktiliste kodutööde käigus õpivad kursusel osalejad mõistma kvalitatiivse uurimistöö tugevusi ja nõrkusi võrreldes kvantitatiivsete meetoditega. Tudengid omandavad teadmised kvalitatiivse uuringu kavandamise põhiettappidest ning võimalikest uuringu tüüpidest. Kursuse raames õpitakse kasutama erinevaid andemete kogumise ja analüüsi võtteid, sealhulgas läbi viima intervjuusid, fookusgruppe, vaatlust, sisu- ja diskursuseanalüüsi. Samuti tulevad arutlusele sellised teemad nagu kvalitatiivsete uuringute usaldusväärsuse hindamine ning eetika uurimistöös inimsubjektidega.Objectives/eesmärkid:  Kursuse eesmärgiks on anda sissejuhatav ülevaade kvalitatiivsetest uurimismeetoditest sotsiaalteadustes. Antud kursus selgitab kvalitatiivse uurimisviisi teadusfilosoofilisi lähtekohti, annab ülevaate kvalitatiivsetest uurimisstrateegiatest ning tutvustab kvalitatiivsete meetodite kasutamise tehnilisi võtteid.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilased: - mõistavad kvalitatiivsete meetodite seoseid neile omaste uurimisparadigmadega - oskavad nimetada kvalitatiivsete ja kvantitatiivsete uurimiviiside tugevusi ja nõrkusi - tunnevad peamisi kvalitatiivseid uurimisstrateegiaid ning oskavad neid rakendada uuringu kavandamiseks - on omandanud teadmised peamistest kvalitatiivsetest andmekogumisvõtetest ning oskavad neid rakendada - on omandanud teadmised kvalitatiivse andmeanalüüsi läbiviimiseks ning oskavad neid rakendada - mõistavad valiidsuse, reliaabluse ja üldistatavuse mõisteid kvalitatiivses uurimistraditsioonis ning oskavad anda hinnangut kvalitatiivse uuringu usaldusväärsusele Jooksev informatsioon aine korralduse kohta on Moodles. \nKõik detailsed juhendid, õpijuhised ja materjalid on õppijale kättesaadavad Moodles.\nÕpe toimub auditoorselt; vajadusel pandeemia leviku peatamiseks seatud piirangute tekkimisel veebiplatvormi Zoom vahendusel."}