{"KURSUSE_NIMI": "Ukraina riik ja rahvas lävepakul", "KURSUSE_KOOD": "SHRG.00.039", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus koosneb interaktiivsetest loengutest ja seminaridest, mille eesmärk on anda multidistsiplinaarne sissejuhatus Ukraina uuringutesse ja Ukraina hiljutistesse sotsiaalpoliitilistesse muutustesse, keskendudes eelkõige Ukraina vastupanuvõimele Venemaa sissetungi vastu võitlemisel ja tulevikuväljavaadetele.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada Ukraina riiki ja ühiskonda läbi erinevate vaatenurkade (ajalooline, poliitiline, sotsioloogiline, kultuuri-, meedia- ja digiuuringud) ja uurida Ukraina vastupanuvõimet Venemaa sissetungi vastu võitlemisel ning arutleda Ukraina rolli üle tänapäeva Euroopas ja maailmas.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel peaks üliõpilane suutma järgmist: * mõista ja selgitada tänapäeva Ukraina sotsiaalpoliitilist olukorda ning selle ajaloolisi ja institutsionaalseid eeldusi; * analüüsida hiljutisi arenguid Ukrainas ajalooliste, poliitiliste, sotsioloogiliste ja muude vaatenurkade kaudu; * hinnata kriitiliselt erinevaid diskursusi Ukrainast, selle ajaloost, kultuurist, ühiskonnast, poliitikast jne ning mõista nende tagamaid; * võrrelda Ukraina juhtumit teiste riikide arengutega; * kirjeldada Ukraina asukohta Euroopa ja ülemaailmsetes rahvusvahelistes struktuurides; * viia läbi sõltumatut akadeemilist, rakenduslikku või poliitilist uuringut Ukraina kohta. About prerequisite knowledge:\nThe course will provide necessary background material to all course participants. Beyond that, participants should possess basic skills of intelligent online communication and familiarity with digital tools for online information searching and learning. Participants should be able to work independently as well as to work in teams and engage in polite and tolerant discussions.\n\nStudents of this course are expected to be aware of and follow UT rules regarding plagiarism (see, \nhttps://sotsiaalteadused.ut.ee/en/academic-fraud and Study Regulations on the same webpage).\n\nCompentences required: communication, IT skills, information management, time management and planning skills, problem-solving, critical thinking, teamwork, intercultural communication skills."}