{"KURSUSE_NIMI": "Kommunikatsiooniassistendi praktika", "KURSUSE_KOOD": "SHUH.03.006", "EAP": 8, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatus kvantitatiivsetesse meetoditesse", "Kommunikatsioonijuhtimise alused ja praktikad", "Praktiline kommunikatsioonitöö II"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 188, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kolmandal kursusel õppiv ajakirjanduse ja kommunikatsiooni bakalaureuseõppe kommunikatsioonisuuna valinud tudeng saab vähemalt kolmenädalase kommunikatsiooniassistendi praktika käigus esmase töökogemuse, õpib lähemalt tundma ühe organisatsiooni kommunikatsioonikorraldust, harjutab lihtsamate kommunikatsioonianalüüsi meetodite rakendamist, praktiseerib analüüsile tuginedes kommunikatsiooniprobleemide lahendamist ning reflekteerib oma erialast arengut.Objectives/eesmärkid:  Kommunikatsiooniassistendi praktika eesmärk on: * omandada turvalises keskkonnas esmane kommunikatsiooniassistendi kogemus * tutvuda lähemalt ühe organisatsiooni kommunikatsioonikorraldusega * rakendada lihtsamad kommunikatsiooni analüüsivõtteid * harjutada analüüsile tuginedes kommunikatsiooniprobleemide lahendamist * õppida reflekteerima oma erialast arengutLearning outcomes/õpiväljund:  Õppeaine edukal läbimisel üliõpilane: * omab esmast töökogemust kommunikatsiooniassistendina * omab organisatsiooni kommunikatsioonikorraldust analüüsi kogemust * suudab rakendada lihtsamaid kommunikatsiooni analüüsivõtteid * suudab kommunikatsiooniprobleemide lahendamisel vajadusel rakendada erinevaid analüüsivõtteid * oskab reflekteerida oma erialast arengut * Praktikajuhend, kaaskiri ja VÕTA töökogemuse refleksiooni juhised on ÕISis õppematerjalide hulgas.\n* Praktika on kommunikatsioonisuuna valinud bakalaureusetudengile kohustuslik. Iseseisvalt valitud praktikaorganisatsioon annab tudengile sageli esimese erialase töökogemuse, võimaldab kätt proovida mitmekesistes erialastes tegevustes ja õpetab analüüsima kommunikatsiooni rolli organisatsiooni toimimises.\n* Kommunikatsiooniassistendi praktikale saab tudeng minna pärast teist õppeaastat, kui on läbitud ka toetavad eeldusained (organisatsioonikommunikatsiooni alused, meedia ja kommunikatsiooni uurimismeetodid ja praktiline suhtekorraldus). Tudeng võib praktikal käia ka varem, selliseid omal käel saadavaid praktikaid ei pea ülikooliga ametlikult siduma. Praktika kestus on soovituslikult umbes üks kuu, minimaalselt kolm nädalat. Praktika aeg võib olla omal soovil valitud, nii suvisel kui talvisel ajal, kuid soovitame vältida juulikuist puhkuste perioodi.\n* Praktikaorganisatsiooni otsib tudeng ise, eelduseks on erialase juhendaja olemasolu (turundus, kommunikatsioon, meediasuhted). Praktikaorganisatsioon tuleb enne praktikale siirdumist kooskõlastada ülikoolipoolse juhendajaga.\n* Praktikal tuleb tudengil panna end proovile võimalikult mitmekesiste erialaste ülesannete täitmisel, teha organisatsiooni analüüsi hõlbustavaid märkmeid, analüüsida mõne huvirühma poolset kogemust organisatsiooniga suhtlemisest. Organisatsioonipoolne juhendaja hindab tudengi pädevusi, meeskonnatööoskusi ja isikuomadusi, kirjutades tudengile tagasiside."}