{"KURSUSE_NIMI": "Infosüsteemid", "KURSUSE_KOOD": "SHUH.04.013", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 28, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Infosüsteemid (globaalses) maailmas.\n2. Infosüsteemid organisatsioonis. Organisatsiooni analüüs ja toimimsprotsessid, põhi- tugifunktsioonid. \n3. Tehnoloogiline infrastruktuur organisatsioonis ja infosüsteemide korralduses.\n4. Sotsiaalsed, eetilised ja turvalisusega seotud aspektid.\n5. Infosüsteemide arendus ja juurutusprojekt, rahvusvaheline dimensioon.\n6. Avaliku ja erasektori infosüsteemid, andmebaasid.\n7. Infosüsteemid teadmusjuhtimises ja otsustusprotsessides.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade infosüsteemide rollist kaasaegses organisatsioonis. Tutvustatakse infosüsteemide tüüpe, arendust ja haldust.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - tunneb ja oskab kasutada infosüsteemide ja andmebaasidega seotud põhimõisteid - teab infosüsteemide rolli kaasaegses organisatsioonis - oskab nimetada põhilisi probleeme seoses infosüsteemide eetilisuse ja privaatsusküsimustega - oskab pakkuda lahendusi andmete kaitsmiseks - teab, miks on andmete haldamine kaasaegses organisatsioonis keeruline ja samas oluline - teab organisatsiooni põhiprotsesse toetavate infosüsteemide põhilisi tüüpe ja nende üldist toimimisloogikat - teab organisatsiooni tugiprotsesse toetavate infosüsteemide põhilisi tüüpe ja nende üldist toimimisloogikat - analüüsib infosüsteemide tüüpide peamisi funktsioone ja oskab määratleda infosüteemide eesmärke - teab avaliku sektori infosüsteemide õigulikke ja talituslikke eripärasid - teab, mis on organisatsiooni IT infrastruktuur, oskab kirjeldada selle toimimist ja haldust - tunneb infosüsteemide elukäiku ja oskab seda näidete varal analüüsida - tunneb infosüsteemi arendusprojekti läbiviimist: projekti etappe ning etappidega seotud tegevusi ja rolle. Aine seminaride teemad ning teemade järgnevust võib kursuse jooksul vastavalt vajadusele ka veidi muutuda."}