{"KURSUSE_NIMI": "Infoõiguse alused", "KURSUSE_KOOD": "SHZU.01.013", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Kommunikatsiooni eetika", "Ajakirjanduse ja kommunikatsiooni eetika"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse esimeses loengus saavad üliõpilased ülevaate subjektiivsete õiguste tähendusest ning aines õpetatavate põhikontseptsioonide ühiskondlikust tähtsusest ja rollist informatsiooniliste põhiõiguste raames. Samuti tutvustatakse esimeses loengus aine korraldust ning aine läbimiseks vajalike ülesannete sisu. Sellele järgneb loeng \"õiguse spikker mittejuristidele\" ehk põgus ülevaade õigusharude ja -süsteemi toimimisest, Eestis kehtiva õiguse allikatest ning õigusterminoloogia leidmiseks ja mõistmiseks vajalikest tööriistadest.\n\nAine tuuma moodustavad neli teemaplokki: 1) avalik teave, 2) ajakirjanduslikud eriõigused, 3) isikuandmete kaitse ning 4) väljendusvabaduse ja au teotamise probleemide regulatsioon.\n\nIgas teemaplokis toimub temaatiline loeng, lahendatakse üks kursuseülene ja kaks individuaalset ülesannet ning arutatakse õpitut loengule ja ülesannetele järgnevas seminaris.Objectives/eesmärkid:  Kursuse üks eesmärk on anda ülevaade meedia õiguslikust regulatsioonist ja vastavasisuliste subjektiivsete õiguste rollist, lähtudes seejuures eelkõige peamistest informatsioonilistest põhiõigustest: õigus informatsioonilisele enesemääramisele (õigus eraelu puutumatusele ja isikuandmete kaitse), õigus infot jagada (väljendusvabadus) ja saada (avalik teave). Teine eesmärk on õpetada praktilisi võtteid, kuidas eespool kirjeldatud õiguste vahel tekkivaid potentsiaalseid konflikte ära tunda, analüüsida ja võimalusel vältida.Learning outcomes/õpiväljund:  A. Teadmised. Üliõpilane omandab teadmised sõnavabaduse teoreetilistest alustest, avalikku kommunikatsiooni reguleerivatest printsiipidest ning õiguslikest vahenditest ja ühiskonnas toimivatest kontrollisüsteemidest.\n\nB. Erialased oskused ja pädevused. Üliõpilane omandab oskuse aines tutvustatud õiguslike küsimuste raames tuvastada ja kasutada omavahel põrkuvaid põhiõigusi hõlmavate juhtumite mõtestamiseks vajalikke põhimõtteid. Oskab üldjoontes ette näha võimalikku konflikti väljendusvabaduse ja teiste õiguste vahel.\n\nC. Üldpädevused. Üliõpilane arendab erinevat tüüpi tekstidest arusaamist, allikakasutusoskust ja kriitilist eneserefleksiooni oskust oma teadmiste ulatuses. Üliõpilane arendab kirjalikku kaalutlusoskust erialaselt vajalike põhimõtete analüüsimisel."}