{"KURSUSE_NIMI": "Bakalaureusetöö", "KURSUSE_KOOD": "SHZU.00.024", "EAP": 10, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Seminaritöö", "Teadustöö alused", "Sissejuhatus kvantitatiivsetesse meetoditesse", "Sissejuhatus kvalitatiivsetesse meetoditesse"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 238, "individual_work": 10, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Bakalaureusetöö kirjutatakse seminaritöö edasiarendusena. Seminaritöö bakalaureusetööks edasi arendamise kohta saab tudeng soovituse seminaritöö hindamisel.\n\nBakalaureusetöö on akadeemiline uurimuslik kirjatöö, mida tehakse individuaalselt eriala õppejõu juhendamisel ligikaudu 260 töötunni ulatuses, mis hõlmab tutvumist teoreetilise kirjandusega ja vastaval teemal tehtud uuringutega, teoreetilistele ja empiirilistele lähtekohtadele tuginevat töö eesmärgi ja uurimisküsimuste püstitamist, sobiva uurimismeetodi valikut ning töö eesmärkide realiseerimist. Töö kaitstakse suuliselt erialakomisjoni ees.Objectives/eesmärkid:  Bakalaureusetöö eesmärgiks on võimaldada üliõpilasel kinnistada ja demonstreerida õpingute jooksul omandatud erialaste teadmiste, oskuste, väärtuste ja kogemuste rakendamise oskust uurimisprobleemi iseseisval lahendamisel ning kontrollida lõpetaja vastavust talle omistatava peaeriala nõuetele. Bakalaureusetöö eesmärgiks on kasutada õppeaja jooksul omandatud teoreetilisi ja metoodilisi teadmisi konkreetse teoreetilise, empiirilise või praktilise probleemi analüüsiks ja lahendamiseks.Learning outcomes/õpiväljund:  - Oskab rakendada õpingute jooksul omandatud teadmisi konkreetsete praktiliste probleemide lahendamisel või praktiliste projektide realiseerimisel - Oskab otsida ja kasutada teoreetilist kirjandust erinevat tüüpi probleemide lahendamisel - Oskab püstitata uurimisülesannet ja valida selle lahendamiseks sobiva meetodi - Oskab lugeda, analüüsida ja sünteesida erinevat tüüpi andmestike - Oskab arutleda antud teoreetilise või praktilise probleemi lahenduse üle."}