{"KURSUSE_NIMI": "Kliinilise psühholoogia praktika", "KURSUSE_KOOD": "SOPH.00.408", "EAP": 6, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Individuaalse uurimise ja hindamise meetodid", "Kliinilise psühholoogia eriseminar", "Kliinilise psühholoogia teooriad ja meetodid", "Laste psüühikahäired", "Individuaalse uurimise ja hindamise meetodid kliinilises psühholoogias", "Sissejuhatus kognitiiv-käitumisteraapiasse", "Juhtumianalüüsi alused kliinilises psühholoogias"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 10, "independent_work": 26, "individual_work": 0, "internship": 120}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on mõeldud toetama üliõpilaste praktiliste oskuste arendamist kliinilise psühholoogi juhendamisel. Kursus koosneb kliinilisest praktikast raviasutuses ja regulaarsetest seminaridest, kus praktikant saab võimaluse arutada oma töös ette tulevaid sisulisi, metoodilisi, ja eetilisi probleeme. Samuti analüüsida kliinilisi juhtumeid ja esitatud haiguslugude raporteid. Praktika toimub 2-3 päeva nädalas kohapealsetele juhendajatele sobivatel päevadel  ja õppetöö graafikut arvestades, kogukestusega 120 ak tundi (=90 tundi)Objectives/eesmärkid:  Anda ülevaade baasilistest oskustest tööks psüühikahäiretega patsientidega ja omandada mõned praktilised oskused kliinilise psühholoogi töös.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Üliõpilane omab ülevaadet kliinilise psühholoogi tööst (kliinilise intervjuu planeerimine ja läbiviimine, andmete kogumine, analüüsimine ja tõlgendamine, juhtumi kontseptualiseerimine, juhtumipõhise tegevuse/sekkumise kavandamine). On kursis kliinilise psühholoogi töös kasutatavate hindamismeetodite ja nende rakendamisvõimalustega. Oskab mõnda nendest meetoditest iseseisvalt rakendada ja teha selle põhjal uuringu kokkuvõtet. On praktika kogemuse põhjal võimeline hindama oma üldist kliinilist käitumist, hinnanguoskusi, ravi planeerimist ja kutse-eetikat."}