{"KURSUSE_NIMI": "Inimene ja organisatsioon", "KURSUSE_KOOD": "SOPH.00.526", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine annab tervikliku ülevaate inimkäitumisest organisatsioonis. Käsitletavad teemad: juhtimine ja eestvedamine; organisatsioonide arendamine, muudatuste juhtimine, organisatsioonikultuur, ja selle seos töötajate vaimse tervisega; töörahulolu ja motivatsiooni toetamine; individuaalsed erinevused ja rühmad organisatsioonis. Pöörame tähelepanu teooria ja juhtimispraktika seostele.Objectives/eesmärkid:  Õppeaine eesmärk on anda ülevaade inimkäitumisest organisatsioonis, mõtestada käitumise ja organisatsiooni tulemuslikkuse seosesid ning organisatsiooni sise- ja väliskeskkonna mõju käitumisele.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Teadmised: süsteemsed teadmised inimkäitumise ja organisatsiooni seostest, sh organisatsioonipsühholoogia põhimõistetest ja olulisematest valdkondadest ning organisatsioonipsühholoogia rakendamisest.\nMõtlemisoskus: oskus kriitiliselt analüüsida organisatsioonipsühholoogia infoallikaid ja uurimistulemusi ning mitmekülgselt ja argumenteeritult analüüsida organisatsioonis toimuvaid käitumisega seotud olukordi ja leida neile lahendusi.\nVäljendusoskus: oskus suuliselt ja kirjalikult argumenteeritult käsitleda organisatsioonis toimuvat käitumist.\nInformatsiooni kogumise ja kasutamise oskus: oskus leida, analüüsida ja kasutada asjakohast informatsiooni käitumise kohta organisatsioonis.\nHoiakud:\nteadlikkus ja soov järgida eetilisi printsiipe organisatsioonides tegutsedes, sh täites juhtimisega seotud rolle;\nsoov kriitiliselt analüüsida organisatsiooni eesmärke ning eetiliselt kasutada psühholoogiaalaseid teadmisi organisatsiooni eesmärkide saavutamiseks. Loenguteemade õppimiseks on soovitav kavandada kokku ~48 tundi iseseisvat tööd, st iga paarisloengu kohta 12 tundi. Seda aega tuleks kasutada teema läbimõtlemiseks loenguslaidide, õpikupeatükkide, teaduspõhiste muude allikate (artiklid, taskuhäälingud) ning ülevaadete abil. Seminaride ettevalmistamiseks, arutatu analüüsimiseks ja õppimise reflekteerimiseks võiks planeerida ~12 tundi. Allika ülevaatele on soovitav kavandada ~24 ja esseele ~40 tundi. Kontrolltööks võiks valmistuda ~8 tundi.\nKontaktõpe aitab kaasa õppimisele, kuid selles osalemine ei ole kohustuslik. Lisaks loengutele on aines kaks online veebiseminari. Seminarid toimuvad rühmades, kummalegi rühmale on üks kahetunnine ja üks neljatunnine seminar. Tutvu täpsemate õpijuhistega Moodles."}