{"KURSUSE_NIMI": "Konstruktivistlik teooria ja meetod", "KURSUSE_KOOD": "SORG.04.026", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Rahvusvahelised suhted"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 6, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selle interaktiivse kursuse raames annatakse ülevaade erinevatest konstruktivistlikest ja poststrukturalistlikest käsitlustest poliitilises teoorias, tutvustatakse tudengitele nende põhilisi mõisteid; analüüsitakse kriitiliselt erinevate konstruktivistlike lähenemiste tugevusi ja puuduseid ning näidatakse konstruktivistliku teooria ja meetodi rakendusvõimalusi praktilise uurimistöö tegemisel. Kursus keskendub sellele diskursuse analüüsi meetodile, mis on kõige laiemalt kasutamisel konstruktivistlike sotsiaalteadlaste seas.Objectives/eesmärkid:  Kursuse eesmärgiks on hinnata kriitiliselt konstruktivistliku teooria tugevusi ja puuduseid ning võimaldada tudengitel konstruktivistlikku meetodit õppida ja oma uurimistöös kasutada.Learning outcomes/õpiväljund:  Kursuse lõpuks peaksid üliõpilased: 1) mõistma poliitilises teoorias põhilisi eeldusi ja loogikat konstruktivistlikest ja poststrukturalistlikest käsitlustest; 2) mõistma ratsionalistlike ja konstruktivistlike meetodite erinevusi, nende tugevusi ja piiranguid; 3) suutma neid teadmisi ja oskusi kasutada oma uurimistöös; 4) sügavalt mõistma diskursuse analüüsi põhimõtteid ja erinevaid suundumusi ning suutma diskursuse analüüsi kasutada oma uurimistöös. Students in this class are expected to know and follow the University rules regarding plagiarism  (see the file 'What is plagiarism and how to avoid it', uploaded with the rest of the course materials in Moodle). Offenders will be punished according to these rules. Please refer to the University of Tartu Guidelines for using AI chatbots and familiarise yourself with what is considered academic fraud."}