{"KURSUSE_NIMI": "Julgeolekupoliitika", "KURSUSE_KOOD": "SORG.04.010", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 11, "practice": 0, "seminar": 5, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Magistriõppe üliõpilastele suunatud kursus analüüsib julgeoleku kui rahvusvaheliste suhete distsipliini ühe keskseima mõiste ajalugu ning vaatleb julgeoleku-uuringute akadeemilise välja kujunemist kitsalt strateegilistest uuringutest kompleksse ja avara sotsiaalse ja poliitilise analüüsi allvaldkonnaks. Kursuse raames analüüsitakse, kuidas 'julgeolek' asetub teiste rahvusvaheliste suhete kesksete mõistete (nagu 'võim' ja 'suveräänsus') ja sõlmküsimuste (nagu sõda ja jõu kasutamine rahvusvahelises poliitikas) suhtes erinevate traditsiooniliste ja kriitiliste käsitluste taustal.Objectives/eesmärkid:  Kursus annab põhjaliku ülevaate julgeoleku-uuringute (Security Studies) kujunemisest akadeemilise väljana traditsioonilistest strateegilistest uuringutest (Strategic Studies) kaasaegsete kriitiliste käsitlusteni. Eesmärgiks on analüüsida olulisemaid julgeolekuteooriaid, kontseptsioone ja debatte, rõhuasetusega kaasaegsetel kriitilistel julgeolekukäsitlustel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse lõpuks peaksid osalejad:\n\n1) suutma kirjeldada, eristada, arvustada ja rakendada peamisi traditsioonilisi ja kriitilisi lähenemisi julgeoleku analüüsimisel;\n2) oskama suhestada kaasaegseid julgeolekupoliitika teooria arenguid varasemate julgeolekupoliitiliste argumentatsioonidega;\n3) valdama teoreetiliste tekstide kriitilise lugemise ja analüüsi oskust praktiliste uurimisküsimuste lahendamisel.\n\nKursus arendab:\n\n1) akadeemilise eneseväljenduse ja debateerimise oskust seminaride kaudu;\n2) akadeemilise kirjutamise oskust uurimistöö kirjutamise kaudu;\n3) julgeolekuprobleemide teoreetilise mõtestamise ning praktiliste lahendustega seostamise oskust."}