{"KURSUSE_NIMI": "Venemaa välispoliitika", "KURSUSE_KOOD": "SORG.04.031", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 10, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus vaatleb tänapäeva Venemaa välispoliitikat ning poliitikategemise mehhanisme. Esmalt käsitletakse Venemaa välispoliitika analüüsimise teoreetilisi seisukohti,  keskendutakse välispoliitika aluseks olevatele ametlikele doktriinidele, institutsioonidele ja mehhanismidele. Kursuse teises osa koosneb viimase 10-15 aasta erinevatele juhtumiuuringutele.Objectives/eesmärkid:  Kursuse eesmärgiks on anda üliõpilastele piisavad teoreetilised ja empiirilised teadmised Venemaa välispoliitika analüüsimiseks. Kursuse käigus käsitletakse küsimusi nagu rahvuslik identiteet ning välispoliitika kujundamise kontseptuaalsed ja institutsionaalsed alused, ja keskendutakse valitud välispoliitika aspektidele viimase 10-15 aasta jooksul.Learning outcomes/õpiväljund:  Kursuse läbinu: - oskab kirjeldada, analüüsida ja hinnata tänapäeva Venemaa välispoliitika ajaloolist ja ideoloogilist tausta; - mõistab suhet Venemaa välispoliitika ja identiteedipoliitika vahel; - oskab analüüsida peamisi tegureid, otsusetegemise mustreid ja poliitikaküsimusi Venemaa välispoliitikas; - oskab kasutada kõige olulisemaid allikad Venemaa välispoliitika analüüsimiseks; - suudab kriitiliselt hinnata tänaseid välispoliitilisi sündmusi ja seisukohti nii Venemaal kui väljaspool. Students in this class are expected to know and follow the University rules regarding plagiarism  (see, in particular, Procedure for processing cases of academic fraud in the Faculty of Social Sciences at http://sotsiaalteadused.ut.ee/ and the file 'What is plagiarism and how to avoid it', uploaded with the rest of the course materials in Moodle). Offenders will be punished according to these rules. Students in this class are expected to know and follow the University rules regarding plagiarism  (see the file 'What is plagiarism and how to avoid it', uploaded with the rest of the course materials in Moodle). Offenders will be punished according to these rules. Please refer to the University of Tartu Guidelines for using AI chatbots and familiarise yourself with what is considered academic fraud."}