{"KURSUSE_NIMI": "Rahvusvaheline poliitökonoomia", "KURSUSE_KOOD": "SORG.00.064", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Rahvusvahelised suhted"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 10, "independent_work": 116, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuses käsitletakse rahvusvahelise majanduse ja poliitika kokkupuutepunktide peamistes uurimisvaldkondades – kaubandus, areng, energia, finants, keskkond. Käsitletakse peamisi rahvusvahelise poliitökonoomia teooriaid ja kontseptsioone ning ka alternatiivseid käsitlusi ja teoreetilist kriitikat.Objectives/eesmärkid:  Õppeaine eesmärgiks on anda tudengitele teadmised rahvusvahelise poliitökonoomia ainest, terminoloogiast, teooriatest ja peamistest valdkondadest ning oskuse analüüsida maailmamajandust nendest kontseptsioonidest lähtuvalt.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: tunneb rahvusvahelise poliitökonoomia kui teadusharu piire ja aine peamist terminoloogiat orienteerub peamistes toimijates, muutujates ja probleemvaldkondades tunneb rahvusvahelise poliitökonoomia teooriad oskab otsida ja leida seoseid poliitiliste ja majanduslike muutujate vahel ning analüüsida, kuidas need omavahel seotud on ja üksteist mõjutavad; oskab teoreetilisi lähenemisi kriitiliselt hinnata ning empiiriliselt kontrollida; on kursuse käigus arendanud erinevaid oskuseid – meeskonnatöö, suuline ja kirjalik väljendusoskus, andmete otsimine ja kasutamine, mida kursuses erinevate ülesannete lahendamisel vaja läheb. Mõned reeglid, mille järgimisel kursuse läbimisel probleeme tekkida ei tohiks:\n* Tööde õigeaegne esitamine. Töödele on täpsed tähtajad ning tööd tuleb selleks ajaks esitada.\nKuna tööde tegemiseks saab piisava aja, siis hilinenud töid vastu ei võeta!\n* Tekstirobotite kasutamine kirjalike tööde kirjutamisel ei ole lubatud!\n* Kuna õppejõud ei ole üliõpilase sekretär, siis arvepidamine, millal seminarid toimuvad,millises rühmas üliõpilane on ning millisest seminarist on puudutud, lasub üliõpilasel. Kõik info on saadaval Moodle's. Kui ei ole, siis on üliõpilasel õigus pretensioonideks.\n* Plagieerimine ei ole tolereeritav. Töödes kasutatud allikad tuleb viidata.\n* Võimaliku pandeemia (või mõne muu eriolukorra) korral võib kursuse korraldusse tekkida muudatusi, millest teavitatakse jooksvalt.\n* Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}