{"KURSUSE_NIMI": "Läänemere regioon rahvusvahelistes suhetes", "KURSUSE_KOOD": "SORG.04.015", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 2, "seminar": 10, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antud kursus analüüsib Läänemere piirkonda tervikliku regioonina tänastes rahvusvahelistes suhetes. Kursus annab üldisema arusaama Läänemere regioonist ja kuidas erinevad riigid (Eesti, Leedu, Läti, Norra, Poola, Rootsi, Saksamaa, Soome, Taani ja Venemaa) selles regioonis positsioneeruvad, kuidas nad aitavad kaasa regionaalsele koostööle ja kuidas Läänemere regioon mõjutab nende välispoliitilisi otsuseid. Kuigi kursus keskendub peamiselt Läänemere regioonile Euroopa kontekstis, proovib kursus hinnata ka Läänemere maade rolli globaalses kontekstis ning vaadata nende riikide sisemisi mõjureid välispoliitilistes otsustes.\nKursus on jagatud viieks teemaplokiks. Semester algab Läänemere maade välispoliitikate võrdleva ülevaatega. Järgnevates plokkides analüüsitakse erinevaid teemasid tervikliku regiooni kontekstis. Teine plokk keskendub regionaalsele koostööle nii Läänemere piirkonnas kui ka sellega lähedalt seotud Arktikas. Kursuse kolmas plokk tegeleb Läänemere regiooni julgeolekustruktuuriga. Julgeolekut vaadatakse nii traditsioonilise sõjalise julgeoleku tähenduses kui ka laiendatud ühiskondliku julgeoleku mõõtmest lähtudes. Kursuse neljas plokk keskendub Läänemere maade rollile maailmas (arengukoostöö, keskkonnakaitse, rahuvalve jms). Iga plokk jaguneb interaktiivseteks loenguteks ning seminariks, mille lõppedes tuleb koostada teemat reflekteeriv lühianalüüs. Kursuse viimases plokis toimub üks julgeolekukriisi teemaline simulatsiooniharjutus, kus tudengid peavad esindama mõnda riiki Läänemere regioonis. Simulatsiooniharjutuse lõpus peavad tudengid koostama eneserefleksiooni. Kursus lõpeb eksamiga.Objectives/eesmärkid:  Kursuse eesmärgiks on analüüsida ja mõista peamisi küsimusi ja probleeme, millega Läänemeremaad tänasel päeval tegelevad. Konkreetsemalt on kursuse eesmärkideks: - anda ülevaade Läänemere geopoliitilisest positsioonist ja nende riikide omavahelistest suhetest; - analüüsida regionaalset koostöövõrgustikku ja piiriülest koostööd Läänemere regioonis ja Arktikas; - analüüsida Läänemere ruumi julgeolekualast mõõdet; - analüüsida Läänemere maade rolli maailmapoliitikas - rakendada teoreetilisi käsitlusi analüüsimaks Läänemere regiooni riikide jaoks olulisi välispoliitilisi teemasid; - anda võimalus toime tulla julgeolekukriisis ja hinnata oma võimekust selles hakkama saada.Learning outcomes/õpiväljund:  Kursuse lõppedes tudeng: - defineerib Läänemere maade peamised välispoliitilised prioriteedid ning hindab nende elluviimist; - tunneb regionaalseid koostööinstitutsioone Läänemere regioonis ja Arktikas ning hindab nende efektiivsust; - analüüsib ja hindab Läänemere regiooni julgeolekustruktuuri, lähtudes julgeoleku laiapõhjalisest definitsioonist; - analüüsib ja hindab Läänemere maade rolli maailmapoliitikas; - haldab eskaleeruvat julgeolekukriisi ning analüüsib oma tegevust selles kriisis."}