{"KURSUSE_NIMI": "Välispoliitika analüüs", "KURSUSE_KOOD": "SORG.04.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 11, "practice": 3, "seminar": 1, "independent_work": 141, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Andmaks kõige parem ülevaade erinevatest mõjudest välispoliitika otsustusprotsessides, jagatakse kursus kaheks osaks. Kursuse esimeses pooles uuritakse peamisi tegureid, mis mõjutavad välispoliitika otsustusprotsesse. Erilist tähelepanu pööratakse  välistele, kohalikele, ametlikele ja kontseptuaalsetele faktoritele, mis kujundavad välispoliitikat. Kursuse teises pooles  uuritakse välispoliitika dünaamikat mõjutavate mudelite, tugevaid ja nõrku külgi.Objectives/eesmärkid:  Kursuse raames uuritakse peamisi teooriaid ja kontseptsioone, mida kasutatakse erinevates välispoliitika analüüsides. Loengute raames vaadeldakse, kuidas käituvad ja tegutsevad välispoliitika juhid ja diplomaadid ebakindlates ja julgeolekuprobleemsetes olukordades ning rahvusvahelistes kriisides.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Pärast edukat kursuse lõpetamist, üliõpilased:\n- on saanud põhjalikud teadmised peamistest teguritest, mis kujundavad välispoliitika muutuseid; \n- on saanud põhjalikud teadmised erinevatest lähenemisviisidest, mida kohaldatakse välispoliitikat kajastatavates väljaannetes; \n- on saanud põhjalikud teadmised välispoliitika ja rahvusvaheliste suhete teooria suhtest;\n- on õppinud rakendama praktiliselt erinevaid mudelid, mida kasutatakse välispoliitika otsustusprotsessides;\n- on täiendanud uurimustööde ja esseede kirjutamise oskuseid. All papers must be submitted using the page of the course in Moodle.\n\nStudents in this course are expected to know and follow the University rules regarding plagiarism (see, in particular, Procedure for processing cases of academic fraud in the Faculty of Social Sciences at http://sotsiaalteadused.ut.ee/ and the file 'What is plagiarism and how to avoid it', uploaded with the rest of the course materials in Moodle). No plagiarism will be tolerated thus offenders punished."}