{"KURSUSE_NIMI": "Läänemere regiooni poliitilised arengud", "KURSUSE_KOOD": "SORG.03.032", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Läänemere regioon elik Põhja-Euroopa ei ole väga tihedalt asustatud piirkond, kuid siia kuulub kümme erinevat riiki, millel on oma unikaalne poliitiline süsteem. Nendes süsteemides on küll palju sarnaseid elemente, kuid ka mitmed olulised erinevused. Kõik peale ühe on liberaalsed demokraatiad. Venemaa poliitiline eliit on proovinud oma riigis valitsevat režiimi nimetada küll suveräänseks demokraatiaks, mis sisuliselt toimib autoritaarse režiimina, mida kaunistab demokraatia üksnes sildina. Poola, Eesti, Läti ja Leedu on teinud läbi keeruka siirdeprotsessi viimase ligemale 30 aasta jooksul ning nende poliitilised süsteemid kuuluvad samasse gruppi pikaajaliste demokraatiatega Põhjamaades ning ka Saksamaal. Viimastel aastatel on Poolas võimule tulnud valitsus viinud ellu rida reforme, mis on tõstatanud küsimus, kas Poola siiski kuulub liberaalsete demokraatiate hulka. Kuigi Saksamaa ja Venemaa on mõlemad föderaalriigid, siis föderatsioon toimib kardinaalselt erinevatel põhimõtetel. See kursus keskendubki nendele sarnasustele ja erinevustele Läänemeremaades, mõistmaks kuidas poliitilised süsteemid nendes riikides toimivad. \nKursuse käigus analüüsitakse järgmiseid teemasid ja küsimusi: Läänemere riikide poliitilised süsteemid: poliitilise süsteemi definitsioonid, poliitilised institutsioonid ja nende suhted, konstitutsioonid, seadusandja ja selle roll, seadusandva ja täidesaatva võimu suhted, peamised poliitilised tegijad nagu parteid ja huvigrupid, nende mõju poliitilisele süsteemile, kodanikuõigused ja -vabadused, sotsiaalne usaldus ja tolerants vähemuste suhtes, sooline võrdõiguslikkus, sotsiaalne lõimumine.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada Läänemere regiooni poliitiliste süsteemide eripärasid ning sarnasusi. Kursus annab ülevaate Läänemeremaade nii poliitilistest institutsioonidest, erakondade dünaamikast ja valimistulemustest kui ka nende ühiskondade sotsiaalsest integreeritusest ja kodanikeõigustest.\nKursus tervikuna proovib vastata peamistele küsimustele, mis on olulised käsitlemaks kõiki regiooni riike: kui demokraatlikud on süsteemid ning millised on võtmetähendusega näitajad, mis aitavad mõista Läänemere regiooni poliitiliste süsteemide demokraatlikku iseloomu.Learning outcomes/õpiväljund:  Kursuse lõpetanud tudeng: - võrdleb erinevaid poliitilisi süsteeme Läänemere regioonis ning nende kujunemist nii ajaloolisest kui ka teoreetilisest perspektiivist;  - võrdleb ning hindab erinevaid poliitiste institutsioonide kooslusi Läänemeremaades; - tunneb peamisi erakondi Läänemere regioonis ja nende ajaloolist kujunemist; - tunneb ja võrdleb peamisi valimistrende (alates 1990-ndatest) Läänemere regiooni riikides; - hindab ühiskondlikku terviklikkust (sh etnilised vähemused, sooline tasakaal) erinevates Läänemeremaades ning nende kujunemist mõjutavaid faktoreid; - määratleb selge sotsio-poliitilise uurimisküsimuse ning uurib seda võrdlevas perspektiivis (vähemalt kaks Läänemere regiooni riiki), tuginedes akadeemilistele allikatele."}