{"KURSUSE_NIMI": "Avalik haldus", "KURSUSE_KOOD": "SORG.00.005", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus juhatab kuulaja sisse avaliku halduse paeluvasse ja pidevalt muutuvasse maailma. „Avaliku haldus“ annab ülevaate, miks ja millistel alustel kujunes üldse avalik sektor, kuivõrd erinev on avalik haldus erinevates  riikides ning kui mitmetahuline on see valdkond isegi nii väikeses riigis nagu Eesti. Kursuse jooksul räägitakse nii  avaliku halduse eeldustest kui tutvustatakse tudengitele avaliku haldust oma igapäevastes toimingutes. Kuidas  juhtida avalikke organisatsioone ja millest lähtuvalt otsustada poliitikate elluviimisel? Kuidas tagada avaliku sektori  läbipaistvus ning kuhu suunduvad reformid? Kuivõrd erinev on haldusjuhtimine personalijuhtimisest? Lisaks  käsitletakse halduspoliitika kujundamist, sektorite vahelist koostööd, regionaalset ja kohalikku valitsemist, makse ja  riigieelarvet ning avalikku teenistust. Kursus keskendub avaliku halduse kui  meid ümbritseva igapäevaelu paremale mõistmisele ning annab hea aluse avaliku sektori tundmaõppimiseks.  \n\nKursusel võivad osaleda kõikide teaduskondade üliõpilased. Eeldusained puuduvad.  Objectives/eesmärkid:  Antud kursus juhatab kuulaja sisse avaliku halduse paeluvasse ja pidevalt muutuvasse maailma. Kursus annab ülevaate nii sellest, milleks meil üldse on nt ministeeriumid ja erinevad avalikud ametid, kui ka sellest, milline on avaliku sektori tegutsemise baasloogika. Loengute jooksul räägitakse nii avaliku halduse eeldustest kui erinevate riikide kogemustest, nii haldus- kui personalijuhtimisest, nii bürokraatiast kui korruptsioonis, nii haldusreformidest kui maksudest, nii koostööst kui otsustamisest. Kursus keskendub eelkõige avaliku halduse kui praktilise valdkonnaga seonduvatele teemadele ja probleemidele. Kursus annab hea eelduse mõistmaks paremini ükskõik millise avaliku sektori töökoha laiemat keskkonda.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Erialased teadmised ja oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tmõista avaliku halduse olemust ja analüüsida vajadust avaliku sektori järele; \n-\thoomata avaliku ja erasfääri fundamentaalseid erinevusi ning sellest johtuvaid erinevaid tegutsemispõhimõtteid;\n-\tmõista avaliku halduse seoseid seda ümbritseva poliitilise ning sotsiaal-majandusliku keskkonnaga;\n-\torienteeruda avaliku haldusega seotud praktilistes valdkondades ja on teadlik nende peamistest probleemidest ja põhiküsimustest;\n-\thinnata kriitiliselt hetke diskussioone halduskorralduse ja võimalike reformide üle;\n-\tarendada võrdlevat analüüsi avalike organisatsioonide haldusülesannete ja funktsioonide suhtes.\n\nÜlekantavad oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tanda operatiivselt ja konstruktiivselt tagasisidet nii loengutele kui lugemismaterjalidele;\n-\treflekteerida jooksvalt oma õpikogemust ja seostada seda ümbritsevate sündmustega;\n-\tesineda avaliku loenguga võõra auditooriumi ees (lisavaliku võimalus). Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}