{"KURSUSE_NIMI": "Projektijuhtimine", "KURSUSE_KOOD": "SORG.01.040", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 15, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 63, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse käigus antakse ülevaade projektijuhtimise teooriast ja meetoditest ning nende teadmiste alusel koostavad tudengid iseseisvalt projekti. Muuhulgas tutvustab kursus nõudeid, millele edukas projekt vastama peab. Eraldi pööratakse tähelepanu projekti aruandlusele ja hindamisele. Kursusel on suur praktiline väärtus.Objectives/eesmärkid:  Kursuse peaeesmärgiks on võimaldada osalejatel omandada nii teoreetilisi teadmisi kui praktilisi oskusi erinevatest projektide arendamise ja juhtimisega seotud aspektidest. Kursuse käigus seletatakse lahti projekti mõiste ning selgitatakse, kuidas planeerida projekti tegevusi ja ressursse. Tutvustatakse projektitsükli erinevaid faase ning antakse ülevaade projektide arendamisest. Õpetatakse, kuidas koostada tööde graafikut ja eelarvet. Kursus selgitab, kellest koosneb projekti inimressurss ning milline on projektijuhi roll projekti juhtimisel. Kirjeldatakse võtteid, millega tagada hea meeskonna valik ning kuidas hinnata projekti tulemusi. Kursus on koostatud erinevaid juhtimispõhimõtteid arvestades ning annab hea ülevaate erinevatest projektijuhtimises kasutatavatest tehnikatest.Learning outcomes/õpiväljund:  Aine edukal läbimisel üliõpilane:\r - Omandab sügavamad teadmised projektijuhtimise alustalade kohta.\r - Mõistab projektijuhtimise põhimõtteid ja suudab neid analüüsida konkreetses kontekstis rakendatavuse seisukohast lähtuvalt.\r - On saanud piisava ettevalmistuse, et iseseisvalt projekte kirjutada, ellu viia ja teostatud tegevuste kohta aru anda.\r - Oskab erinevaid projekte hinnata.\r - Koostab edukalt projekti eelarvet ja töögraafikut. \r - Põhjendab konkreetse projekti olulisust ja vajalikkust nii rahastajatele kui huvitatud osapooltele. Format of the lectures - in class learning, participation is required. \nAll necessary information will be communicated via emails and through Moodle, so please check them regularly and provide correct emails in the study information system!\nMore information about the course, all study materials and assignments (instructions, templates, submission forms and deadlines) will be available in Moodle."}