{"KURSUSE_NIMI": "Sissejuhatus hälbiva käitumise sotsioloogiasse", "KURSUSE_KOOD": "SOSS.04.155", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 60, "individual_work": 2, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on ette nähtud \"Ühiskond ja sotsiaalse heaolu\" õppekava üliõpilastele, kuid soovitatav ka teistele sotsiaalteadustest huvitatud õppijatele. Kursuse raames käsitletakse mõisteid sotsiaalne norm ja sotsiaalne hälbivus, hälbivuse olulisemaid sotsioloogilisi teooriad ning ühiskondliku reaktsiooni hälbivusele ning hälbiva käitumise erinevaid viise.Objectives/eesmärkid:  Kursuse raames tutvuvad üliõpilased hälbekäitumise sotsioloogia arengu olulisemate etappidega ning põhiliste hälbivat käitumist seletatavate sotsioloogiliste teooriatega. Peale teoreetilisi loenguid tutvustatakse Eestis kasutatavate meetmeid kuritegevuse ja hälbiva käitumise vähendamiseks. Kursust külastavad praktikud-eksperdid, planeeritakse ka külaskäike erinevatesse asutustesse (konkreetsed asutused selguvad hiljem).Learning outcomes/õpiväljund:  Kursuse raames õpivad üliõpilased tundma deviantsust seletavaid sotsioloogilisi teooriaid ning erinevaid rakendusmeetmeid hälbiva käitumise vähendamiseks. Kursuse lõpuks üliõpilane  -\tteab, missugused on põhilised hälbivat käitumist seletavad teooriad -\tteab teooriate lähtekohti, argumente ja nende puuduseid -\toskab teooriaid hinnata ja omavahel võrrelda  -\toskab vajadusel valida teatud hälbiva käitumise nähtuse uurimiseks sobivat teooriat -\toskab professionaalsel tasandil arutada teemal sotsiaalne norm ja hälbivus  -\toskab kasutada erialast keelt -\tsuhtub hälbiva käitumise nähtustesse professionaalse mõistmise ja vastutustundega. Ainekavas võivad tekida muutused, millest teavitakse üliõpilasi esimesel võimalusel."}