{"KURSUSE_NIMI": "Fookus-grupp", "KURSUSE_KOOD": "SOZU.04.059", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 4, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 2, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Loeng. Fookusgrupp: kujunemislugu; erinevus individuaalintervjuust; eri vormid. Grupi valimi strateegiad ja värbamine. Grupi kava koostamine, erinevad stimulatsioonivõtted. Modereerimine. Grupi tulemuste analüüs ja nende vormistamine.\n2. Seminarid (vastavalt osalejate arvule). Fookus-gruppide kavade (I iseseisev töö) analüüs ja parandamine.\n3. Grupi praktikumid (vastavalt osalejate arvule). Grupi modereerimine 1-2 magistrandi poolt. Teised osalevad grupi liikmetena. Metoodiline analüüs videosalvestuse põhjal peale gruppi.\n4. Seminarid ((vastavalt osalejate arvule). Läbiviidud gruppide metoodiline eneseanalüüs (II iseseisev töö) transkriptsioonide põhjal ning  põhitulemuste esmane analüüs (III iseseisev töö).Objectives/eesmärkid:  Annab teadmised ja oskused fookusgrupi kasutamiseks erinevate kommunikatsiooniprobleemide lahendamiseks. Kursuse jooksul viivad magistrandid iseseisvalt läbi ühe fookusgrupi tehes läbi kõik uuringuprojekti etapid (eesmärgisead ja sihtrühma, kava koostamine, värbamine, modereerimine, transkriptsioon, analüüs, esialgne tulemuste esitlus). Magistrandid saavad praktikumide käigus ka grupivestluse kui andmekogumismeetodi eripära tunnetuse grupis osaleja seiskohalt.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud omandavad teadmised ja põhioskused fookusgrupi metoodika planeerimiseks ja rakendamiseks avaliku, äri- ja mittetulundussektori kommunikatsiooniprobleemide lahendamiseks.  Üliõpilased omandavad : 1.Teadmised grupiintervjuu metoodilise eripära ja kasutusvõimaluste kohta 2. Oskused kasutada  kvalitatiivseid küsitlemistehnikaid, koostada grupi kava ja valimi strateegiat 3. Põhisokused fookusgrupi praktiliseks korraldamiseks ja modereerimiseks 4.Oskused enda metoodiliseks eneseanalüüsiks, baasoskused uurimisaruande koostamiseks. Selles õppeaines ei ole paindõpet"}