{"KURSUSE_NIMI": "Haridusteooria", "KURSUSE_KOOD": "SVHI.01.109", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Teoreetilise haridusalase arutluse algus ja areng Lääne kultuuriruumis; vastandlikud käsitused.\nHaridusteaduse kui iseseisva teadusdistsipliini kujunemine ja areng. Üldpedagoogika. Herbart. Eetika ja psühholoogia omavaheline suhe hariduseesmärkide, hariduse sisu ja meetodite määratlemisel. \nInglise keeleruumi, Mandri-Euroopa ja Põhjamaade traditsioonide erinevused haridusteaduse, üldpedagoogika ja haridusteooria määratlemisel.\nPraktilised näited ja arutelu teooria ja praktika suhte üle kaasaegses haridusdiskursuses. \nIseseisev töö arvestuseks.Objectives/eesmärkid:  Eesmärkideks on: - võimaldada osalejatel omandada arusaam haridus- ja kasvatuspraktika ning valdkondliku teooria omavahelisest suhtest ja selle suhte erinevatest käsitlustest;  - võimaldada osalejatel omandada teadmised ja arusaam haridusteadusest ja üldpedagoogikast (Allgemeine Pädagogik) kui iseseisvast teadusdistsipliinist, selle arengust, olulisusest ja erinevatest käsitlustest;   - arendada osalejates võimet eristada, mõista, arendada ja kriitiliselt hinnata eripäraselt hariduslikku komponenti suulises ja kirjalikus vormis; - arendada osalejates võimet eristada, mõista ja kriitiliselt hinnata vastava haridusliku probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ainest.Learning outcomes/õpiväljund:  Kursuse läbinu: - mõistab ja eristab ühelt poolt praktika- ja kogemuspõhist ning teiselt poolt teaduslik-teoreetilist tasandit haridusalases arutelus; suudab suulises ja kirjalikus vormis teadlikult liikuda nende tasandite vahel; - tunneb haridusteaduse ja üldpedagoogika väljakujunemise põhjusi, arenguloo peajooni ning peamisi eripärasid Mandri-Euroopa, ingliskeelses ning Põhjamaade kultuuriruumis; mõistab ja rakendab teadlikult nende kultuuriruumide eripäradest tulenevaid teoreetilisi ja mõistelisi erinevusi hariduses;    - eristab, mõistab, arendab ja suudab kriitiliselt hinnata eripäraselt haridusliku komponendi olemasolu, ulatust ja kvaliteeti suulises ja kirjalikus teadusloomes; - mõistab, arendab ja suudab kriitiliselt hinnata vastava haridusalase probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ain"}