{"KURSUSE_NIMI": "Sotsiaal-emotsionaalsete pädevuste arendamine", "KURSUSE_KOOD": "SVHI.00.019", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 0, "seminar": 12, "independent_work": 120, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Teemad:\nTurvaline klassikeskkond, suhted klassis (õpilaste vahelised, õpetaja-õpilased), struktuur klassiruumis, klassikultuur). Aju areng, täidesaatvad funktsioonid, eneseregulatsioonioskused (baasilised ja valdkonna-spetsiifilised). Baasilised eneseregulatsioonioskused: (pidurdus, tähelepanu, ümberlülitus, töömälu). Spetsiifilised enesregulatsioonioskused: emotsiooni regulatsioon, sotsiaalsed oskused. Eneseregulatsiooni oskuste märkamine ja toetamine klassiruumis. Õpetajate endi eneseregulatsioonioskused, vastutus. Käitumise tugikava, tagasiside roll positiivse käitumise kinnistamisel. Eneseregulatsioonioskuste toetamise üldine ja spetsiifiline mõju, universaalselt kujundatud õppimine, lapse vajaduste märkamine ja toetamine.Objectives/eesmärkid:  Arendada õpetajate õppeprotsessi juhtimise ja struktureerimise oskusi erinevas vanuses ja erinevate arenguliste vajadustega õpilastega. \nToetada arusaama emotsionaalselt ja sotsiaalselt turvalise klassikliima kujundamise olulisusest ja arendada oskusi turvalise klassikliima kujundamiseks.  \nToetada õpetajate enesetõhusa hoiaku kujunemist erituge vajavate õpilaste toetamisel klassikeskkonnas.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: \"Aine läbinud õppija:\n- loob vaimselt ja emotsionaalselt turvalise, arengut ja loovust toetava koostöise ning üksteist arvestava õpikeskkonna, lähtudes erinevate õppijate vajadustest.\n- mõtestab ja toetab õpilaste eneseregulatsiooni-oskuste arengut klassikontekstis.\n- põhjendab, kuidas eneseregulatsiooni-oskuste toetamine ja turvalise klassikeskkonna kujundamine mõjutab kõigi, sealjuures erituge vajavate õpilaste heaolu ja akadeemilisi tulemusi. \n- on ellu viinud sekkumistegevusi ühe õpilase toetamiseks ja tõenduspõhiselt analüüsinud oma tegevuse mõju. \""}