{"KURSUSE_NIMI": "Lõpueksam", "KURSUSE_KOOD": "SVHI.00.022", "EAP": 15, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lõpueksam on kahest osast koosnev komplekseksam. Esiteks tuleb koostada vanemõpetaja, tase 7 portfoolio ja teiseks läbi viia tegevusuuring ja selle tulemusi avalikult kaitsta. Portfoolio koostatakse vastavalt õpetajate kutse andja juhistele. Selle koostamist toetatakse lõpueksami seminaris. Tegevusuuringus käsitletakse õppija töökohal olulist probleemi, mis kooskõlastatakse ja arutatakse läbi juhendava õppejõuga. Tegevusuuring koostatakse vastavalt Haridusteaduste instituudis kehtivatele nõuetele. Tegevusuuringu läbiviimise metoodika omandamist toetatakse tõenduspõhise praktika uurimise ja arendamise õppeaines.Objectives/eesmärkid:  Õppeaine eesmärkideks on:\n- võimaldada õppijal teadmiste ning oskuste süvendamist kaasava hariduse valdkonna tegevusuuringu kavandamisest ja läbiviimisest;\n- võimaldada õppijal omandada vilumused teoreetiliste teadmiste ja isiklike kogemuste teadlikuks analüüsimiseks ning rakendamiseks praktikas.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppija oskab läbi viia haridusvaldkonnas tegevusuuringut (6 EAP) ning analüüsida selle tulemusi; õppija oskab läbi viia eneseanalüüsi oma professionaalse arengu kontekstis, koostades selleks portfoolio (9 EAP).\n\nLõpueksami läbinud üliõpilane:\n- oskab püstitada kaasva haridusega seotud uurimisküsimusi ning valida tegevusuuringu läbiviimiseks sobiva uurimisstrateegia;\n- oskab leida ja kriitiliselt analüüsida teaduslikku infot;\n- oskab rakendada sobivaid andmekogumis- ja andmeanalüüsi viise uurimisprobleemile lahenduse leidmiseks;\n- oskab loogiliselt ja otstarbekalt struktureeritud tegevusuuringus ning eneseanalüüsis oma mõtteid arusaadavalt ning argumenteeritult sõnastada;\n- oskab oma tööd analüüsida ja vaneõpetaja kompetentse tõendada;\n- reflekteerib oma professionaalset arengut, kogudes oma tegevuse kohta tagasisidet;\n- on suuteline esitama ja kaitsma akadeemilises diskussioonis oma vanemõpetaja portfoolios esitatud seisukohti."}