{"KURSUSE_NIMI": "Õpiabi praktikum logopeedidele", "KURSUSE_KOOD": "SVHI.03.038", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Eesti keele õpe erivajadustega lastele I", "Matemaatika õpe erivajadustega lastele I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 16, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õpitakse uurima ja hindama õpilaste kirjaliku kõne oskusi ning märkama seoseid matemaatiliste oskuste kujunemisega.\nÕpitakse kirjaliku kõne kujundamiseks ja korrigeerimiseks sobiva harjutusmaterjali valimist ja/või koostamist, töövõtete valimist ja järjestamist ning planeeritud tegevuste vormistamist tunnikonspektina.\nÜliõpilased harjutavad auditooriumis erimetoodiliste töövõtete rakendamist, õppeülesannete ning tunnietappide ettevalmistamist ja läbiviimist.\n\nAnalüüsitakse juhtumeid (õpilaste kirjeldused ja kirjalikud tööd).\nVaadeldakse ja analüüsitakse lugemis- ja kirjutamisraskustega õpilaste õpiabitunde tavakoolis.Objectives/eesmärkid:  Teoreetiliste teadmiste seostamine ja kinnistamine õpiraskustega õpilaste kirjaliku kõne (lugemis- ja kirjutamisoskus) arengu  hindamise ja toetamise võimalustest üldhariduskoolis. Kirjaliku kõne arengut toetavate õppe- ja arendustegevuste planeerimise ja läbiviimise harjutamine praktikumides.Learning outcomes/õpiväljund:  1.\tÜliõpilane oskab hinnata õpilaste kirjaliku kõne arengut.\n2.\tÜliõpilane mõistab keelelise arengu (sh suulise ja kirjaliku kõne mõistmise) seost matemaatiliste oskuste kujunemisega.\n3.\tÜliõpilane oskab planeerida õppe- ja arendustegevusi ning koostada või valida sobivaid õppematerjale õpilase kirjaliku kõne arengu toetamiseks.\n4.\tÜliõpilane oskab kasutada erimetoodilisi töövõtteid  kirjaliku kõne osaoskuste arendamiseks õppejõu juhendamisel."}