{"KURSUSE_NIMI": "Haridustehnoloogiaga tinkerdamine", "KURSUSE_KOOD": "SVHI.06.030", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tehnoloogiat käsitletakse tavaliselt selle tootjate vaatepunktist, kuid olulisus ja praktiline tähendus, mille tehnoloogia ajapikku omandab, tuleneb paljuski hoopis viisist, kuidas inimesed ja kogukonnad tehnoloogiat pidevalt kasutavad ja sellele uusi kasutusotstarbeid ja -võimalusi nuputavad, mis ei olnud algselt tootjate poolt ette nähtud. Sellises loovas kasutuses (ingl k tinkering) peitub hariduse jaoks kasutamata potentsiaal, mida antud kursuse jooksul uuritakse.\nKursus koosneb kolmest osast. Esimene osa on sissejuhatus, kus tutvustatakse alternatiivset, loova kasutuse mõistel (tinkering) põhinevat lähenemisviisi tehnoloogiale ning laotakse teoreetiline aluspõhi järgmise kahe osa tegevustele.\nKursuse teises osas viivad üliõpilased läbi etnograafilise uurimuse, mille põhieesmärk on lasta neil rakendada etnograafilisi \"tööriistu\", omandamaks vahetuid teadmisi loova kasutuse praktilisest tähendusest hariduses. Kursuse esimeses osas käsitletud teooria leiab teises osas praktilise rakenduse.\nKolmandas osas esitletakse etnograafilise uurimuse käigus leitut ja õpitut.Objectives/eesmärkid:  Kursuse peamine eesmärk on anda üliõpilastele ülevaade alternatiivsest lähenemisviisist tehnoloogiale, mis põhineb tehnoloogia looval kasutusel (ingl k tinkering), ning lasta neil seda ka vahetult kogeda. Täpsemalt on kursuse eesmärkideks (1) tutvustada ingliskeelset mõistet tinkering kui alternatiivset lähenemisviisi tehnoloogiale hariduses; (2) uurida tehnoloogia loova kasutuse laiemat tähendust meie kaasaegses ühiskonnas; (3) selgitada välja, sõnastada ning esitada tehnoloogia loova kasutuse peamised rakendusalad hariduses; (4) anda üliõpilastele vahetu kogemus, kuidas oma igapäevaelus ja töökohas tehnoloogiat loovalt kasutada ning mis on seesuguse loova kasutuse olemus ja praktiline tähendus.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: (1)\ttunneb tehnoloogia loova kasutuse mõistet (tinkering) kui alternatiivset lähenemisviisi tehnoloogiale hariduses; (2)\tmõistab tehnoloogia loova kasutuse laiemat tähendust meie kaasaegses ühiskonnas; (3)\toskab selgitada välja, sõnastada ning esitada tehnoloogia loova kasutuse peamised rakendusalad hariduses; (4)\ton omandanud vahetu kogemuse, kuidas oma igapäevaelus ja töökohas tehnoloogiat loovalt kasutada ning mis on loova kasutuse olemus ja praktiline tähendus; (5)\ton omandanud vahetu kogemuse, kuidas hariduses tehnoloogiale alternatiivselt läheneda, tuginedes loova kasutuse (tinkering) mõistele."}