{"KURSUSE_NIMI": "Kahe aine õpetaja põhipraktika", "KURSUSE_KOOD": "SVHI.01.020", "EAP": 5.5, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 137, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine algab avaseminariga, mille toimumisaja leiab ÕISist. \nPõhipraktikat sooritatakse kahes eriala aines (1. osa - aine, 2. osa - 2. aine ) korraga või ka eraldi semestritel kestvusega kokku minimaalselt 10 nädalat. Eeldusainetena peavad olema läbitud vastavad ainedidiktikad. \nPraktika toimub üliõpilasele individuaalse kava alusel, mis kooskõlastatakse TÜ põhikooli mitme aine õppekava põhipraktika vastutava õppejõu, eriala ainedidaktikute ja koolipoolsete juhendajatega. Kahe eriala aine kohta tuleb kokku läbi viia ca 24-30 ainetundi.\nNB! Sotsiaalpedagoogika praktika mahtu arvestatakse eraldi, vt täpsemalt pedagoogilise praktika juhendist.Objectives/eesmärkid:  Õppeainel on kolm üldeesmärki, mis saavutatakse, tuginedes läbitud ülikooliõpingutele ja koos pideva pedagoogilise praktikaga: 1) toetada üliõpilase kujunemist õpetajaks, luues võimalused eelnevalt läbitud õpingute terviklikuks seostamiseks praktilise õpetamistegevusega õppeasutuses; 2) luua võimalused õppe- ja kasvatustöö kui terviku tundmaõppimiseks ja läbiviimiseks kompaktse õppeperioodi vältel; 3) võimaldada ainedidaktiliste põhimõtete rakendamist, praktiseerida ainete ja didaktika alaseid teadmisi ja oskusi ja omandada kogemusi nende ainete õpetamiseks koolis  vastavalt riiklikule õppekavale.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: 1) oskab kavandada, ette valmistada, läbi viia, analüüsida ja hinnata oma õppe- ja kasvatustöö alaseid tegevusi; 2) oskab õpet kavandades ja läbi viies ning õppijaid toetades arvestada nende eripära, eelteadmiste, vajaduste (sh erivajaduste) ning huvidega; 3) kavandab õpet süsteemselt, tõenduspõhiselt ja loovalt, lähtudes riiklikest alusdokumentidest, õppeasutuse, haridusastme ja/või õppeaine eripärast ning õppijate vajadustest ja huvidest; 4) integreerib tulemuslikult ülikooliõpingutes omandatud teadmisi, oskusi ja hoiakuid."}