{"KURSUSE_NIMI": "Tehnoloogia transformatiivne kasutamine hariduses", "KURSUSE_KOOD": "SVHI.06.027", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 7, "practice": 6, "seminar": 11, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse esimeses pooles tutvustatakse üiõpilastele haridustehnoloogia teemat, antakse ülevaade uuematest IKT-trendidest hariduses, mõningatest haridustehnoloogia käsitustest ning tuuakse näiteid digitehnoloogia kasutamise kohta hariduses.\nSelle alusel viiakse läbi grupivestlused, mis toimuvad osaliselt suvise kontaktõppesessiooni ajal ja osaliselt e-õppe vormis esimese semestri alguses: üliõpilased arutavad õppejõududega oma tulevasi projekte, mille teemaks on digitehnoloogia kasutamise uurimine oma töökohas.\nKursuse teises pooles viivad üliõpilased oma projekte ellu - peamine eesmärk on anda üliõpilastele võimalus püüda digitehnoloogia abiga lahendada mõni probleem oma töökohas või uurida digitehnoloogia kasutamise alternatiivseid võimalusi.\nKursuse viimases osas esitlevad üliõpilased oma projekte ja reflekteerivad selle üle, kuidas digitehnoloogiat eesmärgipärasel ja mõtestatud viisil kasutada.Objectives/eesmärkid:  Kursus annab üliõpilastele võimaluse uurida, kuidas digitehnoloogiat hariduses eesmärgipäraselt ja mõtestatult kasutada. Kursuse eesmärgid on järgmised: 1) anda ülevaade e-õppest ja õpet toetavatest tehnoloogilistest vahenditest, 2) uurida, kuidas digitehnoloogiat eesmärgipäraselt ja mõtestatult hariduspraktikasse lõimida, 3) oskus ära tunda, kuidas digitehnoloogiat hariduspraktikas eesmärgipäraselt ja mõtestatult kasutada, 4) anda üliõpilastele võimalus reflekteerida digitehnoloogia kasutamise üle hariduses.Learning outcomes/õpiväljund:  Pärast kursuse läbimist on üliõpilasel 1) ülevaade tehnoloogia kasutamisest hariduses, 2) oskus uurida, kuidas tehnoloogiat hariduses eesmärgipäraselt ja mõtestatult kasutada, 3) oskus ära tunda, kuidas tehnoloogiat hariduses, kuidas tehnoloogiat hariduses eesmärgipäraselt ja mõtestatult kasutada, 4) oskus reflekteerida tehnoloogia kasutuse üle hariduses."}