{"KURSUSE_NIMI": "Logopeedia praktika haridusasutuses", "KURSUSE_KOOD": "SVHI.03.024", "EAP": 10, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Kõne uurimise seminar", "Kõne sujuvuse puuded", "Laste keelepuuded", "Kõnearenduse praktikum", "Neelamise füsioloogia ja teraapia", "Erivajadustega laste õpetamine lasteaias"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 150, "individual_work": 0, "internship": 100}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tutvumine haridussüsteemis (sh nõustamiskeskuses) töötavate logopeedide töökorraldusega, logopeedi tööülesannete täitmine lasteaias, koolis ja/või nõustamiskeskuses. Logopeedia harule.Objectives/eesmärkid:  Rakendada teoeetilistes kursustes saadud teadmisi praktilises logopeedi töös lasteaias, koolis ja/ või nõustamiskeskuses.Learning outcomes/õpiväljund:  1. Üliõpilane hindab erinevas vanuses laste tunnetustegevust, kõne-, keele- ja suhtlusoskusi:  - valib hinnatavate laste vanusest ja arengu tasemest lähtuvalt sobivad hindamismeetodid ning valib ja/või koostab uurimisvõtted ja materjali; - analüüsib lapse arengu hindamise käigus saadud tulemusi, koostab lapse arengutaseme kirjelduse ning püstitab kõnediagnoosi ja seab arenduseesmärgid.  2. Üliõpilane vaatleb ja viib läbi või assisteerib lapsevanemate, õpetajate ja/või teiste spetsialistide nõustamist ning analüüsib enda tegevust.  3. Üliõpilane osaleb individuaalse õppekava/arenduskava väljatöötamisel, võrgustikutöös või muul viisil meeskonnatöös ning analüüsib enda tegevust. 4. Üliõpilane planeerib logopeedilist tööd ja viib läbi individuaal- ja rühmatunde kommunikatsioonipuuetega lastega, analüüsib läbiviidud tegevusi.  5. Üliõpilane koostab ja/või täidab logopeedi tööks vajalikku dokumentatsiooni. 6. Üliõpilane analüüsib enda pädevusi ja arenguvajadusi logopeedina töötamiseks haridussüsteemis."}