{"KURSUSE_NIMI": "Õpiraskustega õpilaste kaasamine õppetöös", "KURSUSE_KOOD": "SVHI.00.018", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "I osa:\nÕpiraskuste olemus ja põhjused. Üldised (sh kerge intellektipuue) ja spetsiifilised õpiraskused (düsleksia, düsgraafia ja düskalkuulia). Õpioskuste hindamine ja arengu toetamine klassis.\nKirjutamis-, lugemis- ja matemaatikaoskuse hindamine ja arengu toetamine. Tekstide mõistmise ja tekstiloome (jutustamisoskuse) toetamine.\nÕppe individualiseerimine, õppematerjali valik, koostamine ja kohandamine, õpikeskkonna kohandamine.\nAktiivsus- ja tähelepanuraskustega õppija toetamine klassis.\nAutismispektri häirega õppijate toetamine klassis.\nII osa:\nIndividuaalse õppekava koostamine ja rakendamine.\nIndividuaalse arengu jälgimise kaardi täitmine.\nVõrgustikutöö võimalused tuge vajava õppija õppe kavandamisel (sh abiõpetaja, tugiisiku). Lapsevanemate ja kolleegide nõustamine ning juhendamine õppija toetamisel õpiprotsessis.Objectives/eesmärkid:  Selle kursuse eesmärk on tõsta õpetajate teadlikkust tuge vajavate õppijate märkamisel, toetada kompetentsust õpi-, lugemis-, kirjutamis- ja matemaatikaoskuste hindamisel ja õpilaste toetamisel õppetöös.Learning outcomes/õpiväljund:  Aine läbinud õppija (I osa): - teab enamlevinud õpiraskuste põhjuseid ja omab ülevaadet üldistest ja spetsiifilistest õpiraskustest; - teab õpiraskustega laste kognitiivseid eripärasid ja nende mõju õppimisele; - selgitab välja ja kirjeldab tuge vajava õppija õpioskusi; - kasutab õppetöö läbiviimisel erinevaid vahendeid, meetodeid ja töövõtteid tuge vajava õppija toetamiseks; - valib, koostab või kohandab sobilikke õppematerjale koostöös kolleegiga; -teab autismispektri häire tunnuseid; teab kuidas autistlike joontega lapsi õppetöös toetada (metoodikad, strateegiad). -teab aktiivsus- ja tähelepanuhäire tunnuseid; teab, kuidas toetada aktiivsus- ja tähelepanu raskustega last klassis.  -pakub saavutatavaid õpiülesandeid ja edukogemust õppeprotsessis; (II osa) - viib läbi õppija arengut toetavaid tegevusi individuaalselt või rühmas;  - analüüsib iseenda ja kolleegide poolt läbiviidud õpiprotsessi; - koostab lähtuvalt õppija tasemest ja vajadustest individuaalse õppekava (IÕK); - täidab individuaalse arengu jälgimise kaarti; - oskab hinnata rakendatud tugimeetmete tõhusust ja teha ettepanekuid õppekorralduse muutmiseks lähtuvalt tuge vajavate õppijate vajadustest."}