{"KURSUSE_NIMI": "Kõrgema taseme õppeülesannete kavandamine", "KURSUSE_KOOD": "SVHI.06.034", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse sisu põhineb peamiselt van Merriënboori ja Kirchneri 4CID mudelil.\nKursus on jagatud nelja temaatilisse plokki. Iga plokk hõlmab ühte kindlat teemat.\n1. plokk keskendub õppemudeli mõistele ja tutvustab kümneastmelist disainimudelit, mis on kursusel käsiteldav õppemudel.\n2. plokis hakkame tegelema kümneastmelise disainimudeliga. Keskendume sellele, kuidas määratleda, mis on keeruline ülesanne. Seejärel käsitleme mõisteid \"keerukas oskus\" ja \"keerukuse elemendid\".\n3. plokk keskendub \"ülesannete klasside\" ja \"õppeülesannete\" määratlemisele.\n4. plokk keskendub sellele, kuidas pakkuda keeruliste õppeülesannete jaoks õiget tüüpi tuge.Objectives/eesmärkid:  Kursuse üldeesmärk on anda ülevaade keerukate õpiülesannete kavandamise protsessist, pöörates tähelepanu selle kõikidele etappidele, nimelt vajaduste analüüsile, kavandamisele, arendusele, rakendamisele ja hindamisele. Samuti on tudengitel võimalus välja töötada konkreetsed juhised, juhendmaterjalid, hindamine ning neid hiljem rakendada ja hinnata. Kursuse eesmärk on ka julgustada tudengeid võtma vastutust individuaalsete panuste eest, juhtima disainiprotsessi ja meeskonnaliikmeid ning tegema koostööd sidusrühmadega.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1. on omandanud ülevaate (teaduslikud vaatenurgad/kriteeriumid ja tavad) keeruliste õppeülesannete projekteerimisprotsessist - vajaduste analüüs, kavandamine, arendus, rakendamine ja hindamine.\n2. oskab omandatud teadmisi rakendada vajaduste analüüsi läbiviimiseks, et selgitada välja arendatava õppeülesande vajalikkus ja nõudmised.\n3. oskab omandatud teadmisi ja vajaduste hindamist rakendada kohandatud juhiste, juhendmaterjalide ja hinnangute kavandi väljatöötamiseks sidusa ja autentse õppeülesande jaoks.\n4. on võimeline välja töötama konkreetseid juhendeid, juhendmaterjale, hinnanguid ja neid ellu viima, pakkudes tudengitele ja õpetajatele mõeldud käsiraamatuid.\n5. on võimeline hindama õppetundide sarja kvaliteeti ja praktilist kasutamist ning pakkuma parendusettepanekuid (vajaduste analüüs, muster, väljatöötatud materjalid ja teostus).\n6. on võimeline edukalt osalema disainimeeskonnas, võttes vastutuse individuaalsete panuste eest, juhtides disainiprotsessi ja meeskonnaliikmeid ning tehes koostööd huvirühmadega."}