{"KURSUSE_NIMI": "Andekus ja topelt-erilisus kaasava hariduse kontekstis", "KURSUSE_KOOD": "SVHI.00.036", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab ülevaate andekuse ja topelt-erilisuse kaasaegsetest käsitlustest, tänapäevastest kontseptualiseerimise viisidest, samuti kognitiivsetest ja isiksuslikest eripäradest ning vajadustest. Käsitletakse õppija individuaalsust ja võimeid arvestava õppe kohandamise meetodeid ja tutvustatakse parimaid praktikaid.   Oluline osa on  juhtumite põhisel aktiivselt iseseisval ja grupitööl.  Väikestes gruppides töötades on üliõpilaste ülesandeks analüüsida konkreetsetel näidetel põhinevate juhtumite puhul rakendatavaid õppe kohandamise vajadusi ja viise, sj silmas pidades motivatsiooni toetamist  ja alasoorituse vältimist.  Seminarides toimuvad arutelud grupitööde põhjal, toetudes kursusel käsitletud teoreetilistele ja tõenduspõhistele teadmistele. Kursuse lõpetamiseks on vaja esitada rühmatööna või soovi korral individuaalselt oma igapäevatööst ja kaasava hariduse kontekstis lähtuv  andeka või topelt-erilise õppija toetamise strateegia kirjeldus ja/või diferentseerimist võimaldavad ülesanded ning sooritada teoreetiliste teadmiste arvestuslik töö.Objectives/eesmärkid:  Aine eesmärgiks on anda ülevaade andekusega ja topelt-erilisusesega seonduvatest spetsiifilistest eripäradest, vajadustest ning niisuguste õppijate toetamisest kaasava hariduse kontekstis.Learning outcomes/õpiväljund:  Kursuse läbinud tunnevad nii andekuse kui ka topelt-erilisuse - põhilisi kaasaegseid käsitlusi, erivorme ja -liike - põhilisi andekusega seonduvaid spetsiifilisi kognitiivseid ja isiksuslikke eripärasid    - õppe kohandamisega seotud strateegiaid ja efektiivseid meetodeid  Üliõpilased ilmutavad oskust rakendada omandatud teadmisi praktikas ning reflekteerida oma tegevust tõenduspõhiste teooriate ja praktikate valguses."}