{"KURSUSE_NIMI": "Globaalsed trendid haridus- ja kasvatusteadustes", "KURSUSE_KOOD": "SVHI.01.098", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Globaalne trend kui ühtaegu nii tulevikku suunatud kui minevikku mõtestav mõiste haridusteadustes. Pedagoogika ajaloo uurimise mõtte selgitamine tänapäevaste ja uudsete haridusideede rakendamise seisukohalt. Rahvusvahelises hariduspraktikas juurdunud nähtuste ja võimalike muutuste erinevad käsitlused ning nende ühisosa. Haridusteaduste arenguloos toimunud olulisemate muutuste sisu, eesmärgid ja vastuolud.Objectives/eesmärkid:  Õppeaine eesmärgiks on teadvustada üliõpilasi globaalsetest trendidest haridus- ja kasvautsuteadustes, samas ühtaegu innustada neid kriitiliselt analüüsima rahvusvahelistumist ja trendi kui mõisteid ja praktikaid, mida tuleb arvestada, ent mitte kriitikavabalt neile järgneda. Püsivuse ja muutumise suhe haridus- ja kasvatusteadustes ning haridus- ja kasvatuspraktikas on keeruline kompleks, mille puhul alustav ja arenev praktik vajab eelteadmisi püsivuse ja muutuvuse suhetest valdkonna teadustöös ja praktikas.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: \n- omab esmast ülevaadet paradigma ja selle muutumise mõistest haridus- ja kasvatusteadustes, suudab eristada retoorika muutumist ja sisulisi muutusi hariduspraktikas ja -teoorias;\n- omab esmast ülevaadet haridusteaduste kui iseseisva distsipliini arenguloo käigus toimunud ja toimuvatest peamistest murrangutest;\n- omab esmast ülevaadet Lääne kultuuriruumi hariduspraktika arenguloo käigus toimunud ja toimuvatest peamistest murrangutest;\n- suudab oma teadus-, õppe- ja arendustegevuses tasakaalustatult arvestada ja rakendada traditsioone ja püsiväärtusi ning uuenduslikkust/innovaatilisust;\n- mõistab, eristab ja suudab tasakaalustatult arvesse võtta globaalset, regionaalset ja eesti rahvuslikku tasandit oma teadus-, õppe- ja arendustegevuses."}