{"KURSUSE_NIMI": "Professionaalse õpikogukonna (õpetajate õpigrupi) juhtimine", "KURSUSE_KOOD": "SVHI.01.028", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine läbimise käigus võimaldatakse üliõpilastel omandada ülevaade õpikogukonna metoodikast. Kogu õpe on üles ehitatud sellisel moel, et käsitletava teema mõnede aspektidega tutvumise järel proovitakse need kohe õpikogukonna vormis järgi. Iga järgneva kohtumise esimene pool on senitehtud analüüs ja refleksioon. Käsitletakse järgmisi teemasid: Õpikogukond, professionaalne õpikogukond/õpetajate õpigrupp. Haridusuuenduste rakendamine, selle erinevad meetodid, õpikogukonna eelised. Õpikogukonna moodustamine, grupiprotsessid ja nende juhtimine, grupi faasid, vastupanu. Professionaalse õpikogukonna kommunikatsioonikultuur (jagamise eetika, küsimise eetika, kuulamise eetika, õppimise eetika). Professionaalse õpikogukonna liikmed oma tegevuse uurijatena. Enese- ja kaaslase hindamine, tagasiside ja edasiside, eneseregulatsioon. Koolikogukonna põhise võrgustiku kujunemine, professionaalse õpikogukonna/ õpigrupi roll võrgustikus. Digivõimaluste kasutamine võrgustikutöös.Objectives/eesmärkid:  Õppeaine eesmärgid on: - toetada õpetaja kui liidri ja teadliku haridusuuenduse rakendaja rolli omandamist, kes väärtustab kollektiivset reflekteerivat õppimist nii klassiruumi kui kogu õppeasutuse tasandil ning suudab kolleegide õpigruppi (professionaalset õpikogukonda) käivitada ja eest vedada; - toetada eneseanalüüsioskuse ja uurimispädevuse kasvu; - rikastada õppemetoodilist pagasit täiskasvanuõppe ja elukestva professionaalse arengu raames.Learning outcomes/õpiväljund:  Õppeaine edukalt läbinud üliõpilane: - väärtustab oma liidrirolli nii õppeprotsessi juhtija ja kavandaja kui ka enda ja kolleegide professionaalse arengu suunajana; - teadvustab, milliseid nõudmisi uus õpikäsitus seab õpetaja pädevusele; - tunneb värskemaid uuringuid ja teoreetilisi käsitlusi õpetaja professionaalsest arengust, võrgustikes õppimise ning eneserefleksiooni rollist; - oskab kasutada õpikogukonna meetodi võimalusi kooli õppe kavandamisel, koolikultuuri kujundamisel, õpilaste õpi- ning koostööoskuste arengu toetamisel, õpetajate koostöö tõhustamisel, õpetajate individuaalsete arengueesmärkide ja kooli kui terviku arengueesmärkide seadmisel ja saavutamisel; - valdab erinevaid analüüsi-, eestvedamise ja muutuste juhtimise ning grupitöö meetodeid, mida kogukonnatöös rakendada; - oskab koordineerida koolipõhise õpikogukonna tegevust vastavalt kooli eesmärkidele; - oskab kavandada ja läbi viia tulevaste õpigruppide juhtide koolitust oma koolis/lasteaias/piirkonnas; - leida ja värvata haridusuuenduse rakendamiseks sobivate omadustega õpetajaid; - analüüsida ja toetada õpigruppide tööd."}