{"KURSUSE_NIMI": "Digitaalne kirjaoskus", "KURSUSE_KOOD": "SVHI.06.035", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus on jagatud nelja temaatilise plokki. Iga plokk hõlmab ühte kindlat teemat.\n1. plokk - AI ühiskonnas. Digitaalne kirjaoskus hõlmab võimet navigeerida maailmas, mida mõjutavad AI meetodid ja tööriistad, kus AI vahendab erinevaid tegevusi, mis mõjutavad teabeotsingut, suhtlust, otsuste tegemist jne. Selles plokis käsitleme kolme peamist küsimust: Mis on AI? Milliseid tegevusi AI tööriistad ja tehnikad teie elus mõjutavad? Mis on AI tööriistade ja tehnikate taga?\n2. plokk - teabe otsing ja hindamine. Selles plokis kutsutakse teid otsima teavet stsenaariumide kohta, mida teiega lähemal ajal jagatakse. Rühmatööna palutakse teil kirjeldada, kuidas te teavet otsisite ja kas teil tekkis teabeotsingu tegemisel raskusi või vaidlusi.\n3. plokk - digitaalne kirjaoskus (DL) postdigitaalsel ajastul. Uurime postdigitaalsuse kontseptsiooni, mis viitab sellele, et digitaaltehnoloogia on meie ellu niivõrd integreeritud, et see pole enam eraldiseisev mõiste, vaid pigem meie igapäevaste tegevuste lahutamatu osa. Keskendutakse kolmele põhiteemale: kriitiline DL (mis on seotud ka eelmise ploks teabeotsinguga), terviklik lähenemine DL-ile, mis vaatleb DL-i kultuurilisi, ühiskondlikke ja eetilisi aspekte, ning digitaalne heaolu.\n4. plokk - sisu loomine keskendub sisu arendamisele ja/või kohandamisele, digitaalsete ressursside integreerimisele õpetamisesse ja õppimisse ning autoriõiguse reeglitele ja litsentsidele.Objectives/eesmärkid:  Kursusel antakse ülevaade digitaalse kirjaoskuse komponentidest ja parendusvõimalustest õppimise ja õpetamise kontekstis.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: (1) omab üldist ülevaadet digitaalsest kirjaoskusest (sh info- ja andmepädevus, suhtlemine ja koostöö, digitaalse sisu loomine, ohutus); (2) oskab rakendada info- ja andmepädevuse, suhtlemise ja koostöö, digitaalse sisu loomise, ohutusega seotud oskusi ja teadmisi; (3) oskab luua digitaalset sisu, mis järgib digipedagoogika kontseptsiooni ning autoriõiguse reegleid ja litsentse; (4) saab aru tehisintellekti mõistest ja selle tähendusest seoses tehisintellekti kirjaoskusega."}