{"KURSUSE_NIMI": "Õppimise toetamine ja juhtimine", "KURSUSE_KOOD": "SVHI.01.039", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine läbimise vältel süvendatakse teadmisi ja oskusi õppimise toetamisest ja juhtimisest. Tutvutakse õppe kavandamise ja hindamise kaasaegsete seisukohtadega (eesmärgistamine erinevatele riiklikele ja koolipõhistele alusdokumentidele tuginedes), õppijat kaasavate õppemeetodite valiku ja rakendamise ning õpitulemuste kontrollimise ja tagasiside funktsioonide ning meetoditega koolis (sh info- ja kommunikatsioonitehnoloogia roll ja võimalused õppeprotsessi mitmekesistamisel, hindamisel ja tagasisidestamisel). Samuti viiakse ennast kurssi õppijat toetava õpikeskkonna kujundamise ja õppija motiveerimise põhialustega. Saadakse ülevaade õpetaja juhendamisstiilidest ja analüüsitakse selle mõju õppimist toetavale õpikeskkonnale, aga ka õppeprotsessi juhi rolli õppimist toetava keskkonna loomisel.Objectives/eesmärkid:  Õppeaine eesmärkideks on:\n- kujundada ja süvendada üliõpilaste arusaama õppimiseks vajalike tingimuste loomisest (õppimist toetava keskkonna loomisest);\n- võimaldada oskuste omandamist õppe kavandamisel ja läbiviimisel (sh hindamisel ning tagasisidestamisel) kaasavaid õppemeetodeid, sh IKT võimalusi, rakendades;\n- toetada suutlikkust analüüsida õppe kavandamise ja hindamise alast tegevust õppeprotsessi juhina.Learning outcomes/õpiväljund:  Õppeaine edukalt läbinud üliõpilane: - oskab kirjeldada õppe kavandamise ja läbiviimise üldpõhimõtteid (tuginedes teoreetilistele lähtekohtadele/õppimisteooriatele) ja kavandada õpet (eesmärgistamisest õpitulemuste kontrollimise ja tagasisidestamiseni), lähtudes riiklikest ja koolisisestest alusdokumentidest ning õppija vajadustest ja huvidest; - oskab õpet kavandades valida õppijat kaasavaid õppemeetodeid, sh rakenda IKT võimalusi (kõigis õppetöö kavandamise ja läbiviimise etappides); - oskab analüüsida õpetaja juhendamisstiilide mõju õppimist toetavale õpikeskkonnale ja kujundada õppimist toetava turvalise õpikeskkonna; - reflekteerib õppe kavandamist ja hindamisalast tegevust ning enda kui õppeprotsessi juhi rolli õppimist toetava keskkonna loomisel."}