{"KURSUSE_NIMI": "Hariduslike erivajadustega õpilane vanemas kooliastmes", "KURSUSE_KOOD": "SVHI.03.002", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Arengupsühholoogia"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "\"Hariduslike erivajadustega õpilane vanemas kooliastmes\" on ainekursus, milles tutvustatakse hariduslike erivajadustega õppijatega seotud taustateadmisi ja õpetamise viise. Rõhuasetus on põhikooli vanemas astmes ja gümnaasiumis õppivate hariduslike erivajadustega, andekate ja/või erineva keele ja kultuuritaustaga õpilaste hariduslike ja sotsiaalsete vajaduste mõistmisel ning nendega tegelemisel. Kursusel tutvustatakse ka tehnoloogia osa hariduslike erivajadustega  õppijate õppimise toetamisel ning antakse ülevaade tehnoloogiliste vahendite  valiku põhimõtetest erinevate hariduslike erivajaduste korral. Kaasava hariduse tähenduslikkuse suurendamise vajadusest ajendatuna rõhutatakse koostööd õpetajate, eripedagoogide ning teiste (tugi-)spetsialistide vahel.Objectives/eesmärkid:  Aine eesmärgiks on käsitleda õppijate individuaalsust arvestava õpikeskkonna kujundamist kaasava õppe kontekstis erinevate hariduslike erivajadustega (HEV) õpilaste, sealhulgas  andekate, mitmese HEVi ning ka erineva keele-ja kultuuritaustaga õpilaste jaoks põhikooli kolmandas astmes ja gümnaasiumis.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane  - on tuttav õpikäsitusega, mis toetab iga õppija individuaalset ja sotsiaalset arengut põhikooli vanemas ja gümnaasiumiastmel; - teab ja mõistab erinevaid hariduslikke erivajadusi, mis on seotud üldise või spetsiifilise õpiraskusega, vaimse tervise häiretega, andekusega ning erineva kultuuri/keele taustaga; - teab, kuidas kohandada õpikeskkonda, õppekava ja digitaalset õppevara erinevate hariduslike erivajadustega ning andekate õppijate jaoks vanemas kooliastmes."}