{"KURSUSE_NIMI": "Karjääriplaneerimine ja karjääriteenused", "KURSUSE_KOOD": "SVHI.01.044", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine koosneb kahest paralleelselt toimuvast moodulist.  Esimene neist on üldmoodul, kus antakse ülevaade karjääri kujundamise teoreetilistest seisukohtadest, seaduspärasustest, nüüdisaegsetest lähenemisviisidest. Karjääriõpe riiklikus õppekavas ja karjääriõpetus koolis. Karjääriõppe alased metoodiliste materjalid ja nende koostamine. Karjääriõppe kvaliteedi hindamine ja hindamiskriteeriumid, hindamisvahendid, nende koostamine ja järelduste tegemine. Karjääriteenuste korraldus üldhariduskoolides, kutsekoolis, ülikoolis jt sotsiaalsetes kontekstides. Karjäärialane nõustamine. Karjääriotsuste tegemine. Rahvusvaheline mobiilsus. Tööturu protsessid ja prognoosid. Haridus- ja koolitusvõimalused ning seosed tööturuga ning elukestev õpe. Kogu õpe toetub eneserefleksioonile seoses karjäärialasele enesetundmisele ja oma võimaluste tundmisele karjääriplaneerimise ja -otsustamise kontekstis. Teise mooduli põhisuks on karjäärikujundamise rahvusvahelised aspektid. Haridus- kui tööturusektori pakutavate karjääriteenuste süsteem Eestis ja arengusuund mujal maailmas. Moodul on rahvusvahelise õppimise keskkond (Shared understanding of guidance in international context), mis ühendab Eesti, Läti ja Soome üliõpilasi.Objectives/eesmärkid:  Õppeaine eesmärk on edastada teoreetilisi teadmisi karjääri kujundamise seaduspärasustest ja toetada oskuste omandamist karjäärikujundamiseks haridusasutuses läbi enesehindamise.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - tunneb olulisemaid karjääri kujundamise teoreetilisi seisukohti ja arengutendentse ning omab eeldusi neid karjäärisuunitlustöö praktikas rakendada; - orienteerub karjäärikujundamise rahvusvahelistes aspektides omades ülevaadet Eesti, Läti ja Soome karjääriplaneerimise süsteemist; - omab teoreetilist ja metoodilist ettevalmistust karjääriõppe läbiviimiseks haridusasutuses (s h koolis); - omab eeldusi karjääriplaneerimise hindamiseks ja selle kohta tagasiside kogumiseks läbi eneserefleksiooni; - omab ülevaadet karjääriteenuste süsteemist, töö erinevatest käsitlustest ja tööturu protsessidest hinnates töömaailma võimalusi; - tunneb karjääriinfoga töötamise põhimõtteid ning oskab kasutada karjääriinfo allikaid ja keskkondi; - teab ja tunneb tööturu protsesse ning haridus- ja koolitusvõimalusi seoses tööturuga toetudes eneserefleksioonile seoses karjäärialase planeerimise ja otsustamisega."}