{"KURSUSE_NIMI": "Haridusteooria", "KURSUSE_KOOD": "SVHI.02.016", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 28, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Teoreetilise haridusalase arutluse algus ja areng Lääne kultuuriruumis; vastandlikud käsitused: sofistid, Platon Isokrates. Liberaalne haridus, Paideia. \nHaridusteaduse kui iseseisva teadusdistsipliini kujunemine ja areng. Üldpedagoogika. Herbart. Eetika ja psühholoogia omavaheline suhe hariduseesmärkide ja vahendite määratlemisel. \nInglise keeleruumi, Mandri-Euroopa ja Põhjamaade traditsioonide erinevused haridusteaduse, üldpedagoogika ja haridusteooria määratlemisel. Käsitus haridusteadustest kui alusdistsipliinide kombinatsioonist vastandina käsitusele haridusteadusest kui iseseisvast terviklikust teadusdistsipliinist. Eri lähenemised üldpedagoogika ja pedagoogika aladistsipliinide vahelistele suhetele. \nPraktilised näited ja arutelu teooria ja praktika suhte, haridusteaduse osakaalu ning üldpedagoogilise ja valdkonnaspetsiifilise suhtest kaasaegses publitseeritud teadusloomes.Objectives/eesmärkid:  Eesmärkideks on: - võimaldada osalejatel omandada arusaam haridus- ja kasvatuspraktika ning valdkondliku teooria omavahelisest suhtest ja selle suhte erinevatest käsitlustest;  - võimaldada osalejatel omandada teadmised ja arusaam haridusteadusest ja üldpedagoogikast (Allgemeine Pädagogik) kui iseseisvast teadusdistsipliinist, selle arengust, olulisusest ja erinevatest käsitlustest;   - arendada osalejates võimet eristada, mõista, arendada ja kriitiliselt hinnata eripäraselt hariduslikku komponenti suulises ja kirjalikus teadusloomes, sealhulgas oma doktoritöös; - arendada osalejates võimet eristada, mõista, arendada ja kriitiliselt hinnata vastava haridusteadusliku probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ainest.Learning outcomes/õpiväljund:  Kursuse läbinu: - mõistab ja eristab ühelt poolt praktika- ja kogemuspõhist ning teiselt poolt teaduslik-teoreetilist tasandit haridusalases arutelus; suudab suulises ja kirjalikus teadusloomes, sealhulgas oma doktoritöös, teadlikult liikuda nende tasandite vahel; - tunneb haridusteaduse ja üldpedagoogika kui iseseisva teadusdistsipliini väljakujunemise põhjusi, arenguloo peajooni, haridusteaduse kui teadusdistsipliini identiteedi probleeme ning peamisi eripärasid Mandri-Euroopa, ingliskeelses ning Põhjamaade kultuuriruumis; mõistab ja rakendab teadlikult nende kultuuriruumide eripäradest tulenevaid teoreetilisi ja mõistelisi erinevusi haridusalases teadusloomes, sealhulgas oma doktoritöös;    - eristab, mõistab, arendab ja suudab kriitiliselt hinnata eripäraselt haridusliku komponendi olemasolu, ulatust ja kvaliteeti suulises ja kirjalikus teadusloomes, sealhulgas oma doktoritöös tervikuna ja selle osades; - mõistab, arendab ja suudab kriitiliselt hinnata vastava haridusteadusliku probleemi ja teemavaldkonna üldisuse astet, eristades üldpedagoogilist ning valdkonnaspetsiifilist ainest; - suudab analüüsida, arendada ja kriitiliselt hinnata oma teadusloome, sealhulgas doktoritöö sisu selle laiemas teoreetilises, ajaloolises, kultuuriruumilises ja üldpedagooglises kontekstis."}