{"KURSUSE_NIMI": "Õppiva organisatsiooni kultuuri loomine ja juhtimine kogukonna kontekstis", "KURSUSE_KOOD": "SVHI.01.041", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 16, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppeaine läbimise käigus antakse ülevaade organisatsiooni eestvedamisest, eestvedamisstiilidest, mõjuvõimust, koostööl põhinevast eestvedamisest ja grupicoachingust õppiva organisatsiooni tingimustes. Grupicoachingu metoodika omandamine ja  eksperimendi läbi viimine haridusasutuses ning sellele vastava organisatsioonikultuuri  kujundamine.  Coachingu ideedel põhinevate tehnikate omandamine: teineteise kuulamine, argumenteerimine, enesekehtestamine jt. Konfliktide juhtimine haridusasutuses. Objectives/eesmärkid:  Õppeaine eesmärkideks on:\nOmandada pädevused õppiva organisatsiooni määratlemise, kujundamise ja analüüsimise kohta haridusasutuses. Õppiva organisatsiooni eestvedamise, loovate arutelude ning haridusasutuse ja töötajate arendamise ja seda mõjutavate tegurite analüüsi ja sünteesi oskuste omandamine. Grupicoachingu metoodika omandamine ja GC eksperimendi läbi viimine.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Õppeaine edukalt läbinud üliõpilane:\nSuudab mõista ning loovalt analüüsida ja rakendada õppiva organisatsiooni põhitegevusi haridusasutuses.\nOskab kaardistada õppiva organisatsiooni juhi/liidri pädevusi ning neid analüüsida haridusasutuse eestvedamisel kooskõlas oma kogemustega.\nKoostöise organisatsioonikultuuri ja konfliktide juhtimise alaste teadmiste mõistmine ja loov rakendamine haridusasutuses.\nEestvedamise ja mõjutamise tehnikate omandamine, analüüsimine ja loov rakendamise haridusasutuse tegevuse suunamisel.\nGrupicoachingu metoodika omandamine ja GC eksperimendi läbi viimine tööjuhtumite lahendamisel haridusasutustes. Töötajate arendamine GC käigus. Koostöö arendamise ning juhtimis- ja diskussioonioskuste omandamine."}