{"KURSUSE_NIMI": "Lastega filosofeerimine", "KURSUSE_KOOD": "SVHI.01.011", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 10, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 134, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Laste ja noortega filosofeerimine ei tähenda filosoofia ajaloo ega filosoofide mõtete teoreetilist käsitlemist. Laste ja noortega filosofeerimine on praktiline tegevus ja siin aines saab omandada praktilised oskused arutelu juhtimiseks.\nKursus annab ülevaate laste ja noortega filosofeerimise meetodi olemusest, eesmärkidest ja arutelu kui protsessi läbiviimise põhimõtetest, arvestades õppekavade (koolieelse lasteasutuse riiklik õppekava, põhikooli riiklik õppekava) eesmärke ja nüüdisaegset mitmekultuurilist õpikeskkonda. Praktilised oskused omandatakse siin aines kogemusõppe kaudu.\nKäsitletavad teemad:\n*\tlaste ja noortega filosofeerimise olemus ja tähtsus õppekava eesmärkide elluviimisel ning läbivate teemade ja lõimuvate tegevuste rakendamisel õppetegevuses;\n*\tlaste ja noortega filosofeerimine mujal maailmas;\n*\teelharjutused ja nende tähtsus;\n*\ttekstide valimise põhimõtted; \n*\tarutelu ülesehitus;\n*\tfilosoofiline küsimus;\n*\ttemaatiliste küsimuste esitamine;\n*\tküsimuste liigid arutelu protsessi juhtimisel, \n*\tküsimistehnika arutelu juhtimiseks ja suunamiseks;\n*\ttegevused enne filosoofiliste arutelude sisseviimist;\n*\tfilosoofilise arutelu käivitamine;\n*\tarutelu juhi hoiak ja tegevused\n*\tfilosoofilise arutelu juhtimine;\n*\tarutelu reeglid/kokkuvõtted\n*\tarutelu aktiveerivad ja suunavad tehnikad, meta-arutelu;\n*\tarutelu lõpetamine ja hinnangu andmine.Objectives/eesmärkid:  Anda osalejatele teadmisi ja oskusi, kuidas juhatada sisse, suunata ja lõpetada 3-16 aastaste õpilaste ühisarutelusid laste ja noortega filosofeerimise meetodile toetudes.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud üliõpilane: \n*\tmõistab laste ja noortega filosofeerimise meetodi olemust, põhimõtteid ja eesmärke; \n*\tteab, milliseid õppekava (koolieelse lasteasutuse riiklik õppekava või põhikooli riiklik õppekava) eesmärke aitab ellu viia lastega filosofeerimise meetodi rakendamine;\n*\toskab luua ainetevahelisi seoseid ja leida lõimuvaid teemasid õppetegevuses lähtuvalt lastega filosofeerimise meetodi temaatikast ja eesmärkidest;\n*\tomab teadmisi ja oskusi aruteluks sobiva atmosfääri kujundamisest;\n*\tteab põhilisi arutelu/filosofeerimisprotsessi juhtimise tehnikaid;\n*\ton harjutanud arutelu suunavate küsimuste koostamist;\n*\tmõistab filosofeerimise eelharjutuste tähtsust ja oskab neid rakendada;\n*\toskab kavandada, läbi viia, lõpetada ja analüüsida ühisarutelu või filosofeerimisprotsessi."}