{"KURSUSE_NIMI": "Kvalitatiivsed uurimismeetodid haridusteaduses", "KURSUSE_KOOD": "SVHI.01.010", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 6, "seminar": 23, "colloquium": 0, "web_learning": 0, "independent_work": 101, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Uurimisküsimus. \nUurimisteema paiknemine laiemas uurimisvaldkonnas. Uurimisküsimuse relevantsus ja täpsus. Uurimisküsimuse metoodiline funktsionaalsus.\n2. Sissejuhatus erinevatesse uurimistraditsioonidesse. \nJuhtumiuuring, põhistatud teooriat loov uuring, fenomenoloogiline uuring, etnograafiline uuring ja biograafiline uuring. \n3. Andmekogumismeetodid ja -protseduur. \nUurija roll kvalitatiivses uuringus. Andmekogumismeetodid (vaatlus, intervjuu, dokumendianalüüs). Triangulatsioon. Loomulik keskkond vs tehiskeskkond.\n4. Andemanalüüs. \nSisuanalüüs ja temaatiline analüüs. Põhistatud teooria loomine. Arvutipõhiste andmeanalüüsi programmide tutvustamine  ATLAS.ti ja NVivo. Andmeanalüüsi kvaliteet: Triangulatsioon. Kodeerijate vaheline reliaablus. Kvalitatiivse uurimuse audit.\n5. Kvalitatiivse uuringu sh tulemuste esitlemine teadusartiklis.Objectives/eesmärkid:  Võimaldada üliõpilastel omandada teadmised haridusteaduste valdkonnas enamkasutatavatest kvalitatiivsetest uurimis- ja analüüsimeetoditest ning saada kogemusi nende praktiliseks kasutamiseks.Learning outcomes/õpiväljund:  Kursuse läbimise tulemusel doktorant:  -\tteab enamlevinud uurimistraditsioone haridusteaduslikus uurimistöös;  -\tteab uurimisküsimuse põhifunktsioone ja oskab nendest lähtuvalt püstitada uurimisküsimusi; -\toskab kavandada haridusteaduslikku kvalitatiivset uurimust, koguda ja hankida andmeid, analüüsida nende kvaliteeti, valida andmeanalüüsi meetodit; -\toskab analüüsida ja tõlgendada kvalitatiivseid andmeid lähtudes püstitatud haridusteaduslikest eesmärkidest ja esitleda tulemusi; -\toskab analüüsida ja kirjutada kvalitatiivsel andmeanalüüsil põhinevaid haridusteaduslikke artikleid; -\toskab esitleda kvalitatiivsel andmeanalüüsil tuginevaid tulemusi nii teadusettekannetes kui ka praktikutele."}