{"KURSUSE_NIMI": "Erasmus+ projekti koostamine ja läbiviimine koolieelses lasteasutuses", "KURSUSE_KOOD": "SVHI.02.030", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 16, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Ülevaade Erasmus+ programmist ja üliõpilaste ning üldhariduse valdkona töötajate õpirände projektidest, Erasmus + kvaliteedistandardist, aluspõhimõtetest ja programmijuhendist. Erasmus+ projekti ettevalmistamine lähtudes iseendast, sh võõrkeele õppimise vajadusest, ja koolieelse lasteasutuse arenguvajadustest. Sihtriigi teadlik valimine lähtudes Euroopa Liidu riikide alushariduse ja alusharidussüsteemide erisustest. Projekti juhtimisvõtted, sh projekti liigendamine, ressursside kavandamine, riskide määratlemine ja maandamine. Erasmus+ projekti koostamine ja taotlemine. Projekti koostamis- ja läbiviimisprotsessi kvaliteedi ning tulemuste hindamine. Projekti tulemuste kasutamine iseenda, koolieelse lasteasutuse ja laste alushariduse arenduses.Objectives/eesmärkid:  Kujundada üliõpilastes valmisolek Erasmus+ üliõpilaste ja üldhariduse valdkonna töötajate projektide koostamiseks ja läbiviimiseks, sh projekti ettevalmistamiseks, taotlemiseks, võõrkeelte õppimiseks, projekti kvaliteedi tagamiseks ja hindamiseks ning projekti tulemuste kasutamiseks ja jagamiseks alushariduse arenduses.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: 1. mõistab Erasmus+ programmi kvaliteedistandardit ja aluspõhimõtteid ning arvestab nendega projekti koostamisel ja läbiviimisel; 2. planeerib iseendast, sh võõrkeele õppimise vajadusest, ja koolieelse lasteasutuse arenguvajadustest lähtudes teadlikult projekti; 3. teab ja oskab kasutada projekti koostamiseks ja läbiviimiseks sobivaid projekti juhtimisvõtteid; 4. oskab tagada ja hinnata projekti kvaliteeti; 5. kasutab projekti tulemusi iseenda, koolieelse lasteasutuse ja laste alushariduse arenduses; 6. suudab koostada ja taotleda Erasmus+ projekti."}