{"KURSUSE_NIMI": "Erialase praktikakogukonna loomine", "KURSUSE_KOOD": "SVHI.06.040", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus viiakse täies mahus läbi veebikeskkonnas ja kursuse materjale jagatakse MS Teamsis. Kursus pakub võimalust omandada kogemusi selles, kuidas mõista ja luua praktikakogukondi ning soodustada nende jätkusuutlikku arengut. Kursusel osalejad tutvuvad praktikakogukonna mõistega, saavad teada, millist kasu sellised kogukonnad tuua võivad ning kuidas neid oma organisatsioonis märgata ning luua. Kursusel käsitletakse ka sellised teemasid nagu koostöö, teadmiste jagamine, uute oskuste arendamine. Kõik need on tõhusaks praktikakogukondades osalemiseks olulised teemad. Kursuse lõpuks on osalejad teadlikud, kuidas praktikakogukonnad soodustavad organisatsioonisisest õppimist ja arengut, ja kuidas soodustada tulemuste parandamiseks ja eesmärkide saavutamiseks nende jätkusuutlikku ja tõhusat arengut.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada praktikakogukonna mõistet ja anda tudengitele võimalus uurida, kuidas oma organisatsioonis luua haridustehnoloogia ümber üksteiselt õppimise kogemus ja harjumus. Tuginedes eelnevatele teadmistele tehnoloogia kasutamise erinevatest aspektidest, on tudengitel võimalus katsetada praktikakogukondade loomist ja nendes tegutsemist.  Konkreetsemalt on kursuse eesmärgid: -\tsaada ülevaade praktikakogukondade peamistest alussammastest; -\tpraktiseerida tehnoloogiakesksete teadmiste vahendamist; -\tuurida võimalusi uute oskuste kujundamiseks.Learning outcomes/õpiväljund:  Kursuse läbinu a) on teadlik praktikakogukonna mõistest ja teab, mis on praktikakogukonnad, kuidas need toimivad ja millist kasu need tuua võivad; b) oskab märgata ja luua praktikakogukondi; c) oskab soodustada koos teistega töötamist ning grupis teadmiste ja ideede jagamist; d) on teadlik, kuidas soodustada praktikakogukondades osalemise ning teadmiste ja oskuste jagamise kaudu elukestva õppe harjumuste tekkimist."}