{"KURSUSE_NIMI": "Ülddidaktika ja kasvatustöö alused", "KURSUSE_KOOD": "SVHI.01.079", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Didaktika olemus. Õppimiskäsitlused ja õpistrateegiad. \nÕppeprotsess ja seda mõjutavad tegurid. \nÕppetöö vormid ja meetodid; aktiivse õppimise viisid.\nÕppetöö planeerimine, õppetunni ülesehitus; tunni eesmärgistamine, õppemeetodite valiku alused, läbiviimine, tagasisidestamine.\nÕpetaja roll õppimist soodustava õpikeskkonna loomisel; distsipliin. Õpetaja ja õpilaste interaktsioon õppeprotsessis.\nÕppetegevuse analüüs.\nDokumentatsioon koolis ja õpetaja professioon.Objectives/eesmärkid:  Anda ülevaade õppimise ja õpetamise olemusest. Tutvustada õppetöö eesmärgistamise ja õppematerjali planeerimise, õppetunni ülesehituse ja läbiviimise ning tagasisidestamise põhimõtteid ja viise. Tutvustada erinevaid õpetamismeetodeid ja analüüsida nende kasutamist. Tutvustada õppimist toetava õpikeskkonna loomise võimalusi ja õppedistsipliini olemust ning sekkumisstrateegiaid. Valmistada üliõpilast ette praktikaks koolis.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:\nTulevasel õpetajal kujunevad teadmised ülddidaktika alustest ning esmased oskused õppetegevuse planeerimiseks, läbiviimiseks, analüüsimiseks ja arendamiseks.\nKursuse eduka läbimise tulemusena üliõpilane:\n*Selgitab õppetöö eesmärgistamise ja planeerimise põhimõtteid ning rakendab neid tunnikava ja minitunni kavandamisel ja läbiviimisel.\n*Kirjeldab õppetunni ülesehituse ja läbiviimise ning tagasisidestamise põhimõtteid ja viise ning on harjutanud nende rakendamist.\n*Kirjeldab erinevaid õpetamismeetodeid ja nende kasutusvõimalusi.\n*Kirjeldab õpetaja rolli õpikeskkonna loomisel ja toob näiteid, kuidas õpetaja saab luua õppimist toetava vaimse ja füüsilise õpikeskkonna.\n*Selgitab ennetavaid tegevusi klassis sotsiaalse korra saavutamiseks ja toob näiteid sekkumise strateegiatest distsipliiniprobleemide korral.\n*Analüüsib õppetundi.\n*Omab ülevaadet koolis õpetaja poolt täidetavast peamisest dokumentatsioonist (oskab nimetada ja kirjeldada lühidalt sisu ja otstarvet)."}