{"KURSUSE_NIMI": "ELi majanduslik valitsemine", "KURSUSE_KOOD": "SVJS.00.047", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 4, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 128, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Alates euro kasutuselevõtust 1990. aastate lõpus on ELi majandus- ja rahaliit (EMU) kujutanud endast teravat sümmeetriat täielikult integreeritud \"raha\" ja ainult osaliselt integreeritud \"majanduse\" haru vahel. Majandus- ja rahaliidu ebatäielikkust paljastas täielikult 2010. aasta riigivõlakriis, mis tõi kaasa makromajandusliku, fiskaal- (aga ka sotsiaalse) juhtimisraamistiku, uued finantsabi fondid ning märkimisväärsed edusammud finants- ja kapitaliturgude koordineerimisel. Siiski on Covid-19 kriis ja ELi reageeringud sellele - andes Euroopa Komisjonile tõhusad volitused fiskaal- ja võlgade tõstmiseks - tähistanud suurt edasiminekut ELi majanduse juhtimises, kaotades tõhusalt pikaajalise asümmeetria raha- ja eelarvevaldkonna vahel. Sellegipoolest on praegusel hetkel raske ennustada, kas ja mil määral COVID-i järgsed kokkulepped kestavad.\n\n \n\nVaadeldes kõige olulisemaid arenguid ELi majanduse juhtimises ja poliitikas alates Maastrichti lepingust (1992) kuni Covid-19 kriisini (2020), näitab see MA kursus, kuidas ELi poliitika on visiooniliste ideede ja jõu tulemus. -ühelt poolt mäng ning teiselt poolt funktsionaalsed vajadused ja globaalsed arengud. Andes põhjaliku pildi sellest, kuidas erinevad ELi majanduspoliitikad on viimase kolme aastakümne jooksul muutunud - ja mida on juhtinud - erinevad riiklikud ja riigiülesed osalejad ja institutsioonid, pakub kursus huvi mitte ainult ELi poliitika ja rahvusvaheliste suhete eriala üliõpilastele vaid ka tulevastele poliitikakujundajatele. Lisaks on kursus kasulik abijuhend kvalitatiivse (politoloogia) metoodika rakendamisel EL-i poliitika ja integratsiooni uurimisel.Objectives/eesmärkid:  Selle kursuse eesmärk on anda ELi poliitika ja rahvusvaheliste suhete üliõpilastele, aga ka tulevastele poliitikakujundajatele teadmisi ELi majandusjuhtimise ja selle taga oleva poliitika kohta. Konkreetselt keskendudes eelarve-, majandus- ja sotsiaalpoliitika juhtimisele ajaloolises perspektiivis, on kursuse eesmärk saada põhjalik mõistmine pidevalt muutuvatest poliitilistest tegevuskavadest ja ELi valitsemisviisidest. See näitab, kuidas ELi poliitika on ühelt poolt visiooniliste ideede ja võimumängu ning teiselt poolt funktsionaalsete vajaduste ja globaalsete arengute tulemus. Lisaks annab see põhiteadmised sotsiaalteaduste uurimismeetoditest, keskendudes elementidele, mis on poliitikapraktika jaoks kõige olulisemad.Learning outcomes/õpiväljund:  Kursuse läbimisel saab õpilane: - näidata teadmisi ja kriitiliselt hinnata praegusi arenguid ELi raha-, fiskaal-, majandus- ja sotsiaalpoliitika valdkondades - hinnata ELi sotsiaal-majandusliku juhtimise arengut ajaloolises kontekstis - mõista ELi majanduspoliitika juhtimisviise  - hinnata erinevate EL institutsioonide rolli EL sotsiaal-majandusliku juhtimisprotsessi toimimises - rakendada teadmisi põhiliste kvalitatiivsete uurimismeetodite ja uurimistöö kavandamise kohta sotsiaalteadustes, - teostada väikesemahulist aluspoliitikale suunatud uurimistööd, s.o asjakohaste uurimisküsimuste sõnastamist, EL ametlike dokumentide ja õigustekstide leidmist ja kasutamist, dokumendi- ja sisuanalüüsi Võtmepädevused: mõtete kujundamine, kultuuridevaheline pädevus, transdistsiplinaarsus, disaini mõtteviis, kognitiivse koormuse juhtimine Out of 14 sessions, 12 sessions consist of a lecture followed by a discussion. 2 sessions are fully devoted to student presentations.\n\nAll reading materials will be provided in the Moodle."}