{"KURSUSE_NIMI": "Kvantitatiivsed meetodid II", "KURSUSE_KOOD": "SVJS.00.035", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus eeldab, et osalejatel on juba olemas põhiteadmised sellest, kuidas kasutada R-i ja kuidas teha põhilisi statistilisi analüüse (tasemel, mida kaeti aines Kvantitatiivsed meetodid I). Kursuse sisu on struktureeritud ümber seminaride, mida tutvustavad õpieesmärkidega seotud teemasid ning kus me harjutame koos läbi nende meetodite üldise loogika ning nende rakendamise R-s. \n\nEsimesed sessioonid on keskendunud sellele, kuidas kasutada R-i andmete töötlemiseks ja haldamiseks. Me heidame pilgu teatud andmetüüpidele ja R-i koodile, mida läheb mõnevõrra kaugemale päris esmastest teadmistest sellest, mis oli R-ga alustava kasutaja jaoks vajalik. Me keskendume muuhulhgas ka tekstilistele andmetele ning sellele, kuidas tekste statistiliseks analüüsiks ette valmistada. Samuti vaatame, kuidas automaatselt alla laadida veebilehekülgede tekstilist või numbrilist sisu. \n\nSealt liigume edasi juba tuttava regressioonimudeli juurde ning vaatame, kuidas seda laiendada teatud kontekstidesse, kus lihtsat OLS-i rakendada ei saa. Uurime, kuidas saab analüüside seoseid muutujate vahel kasutades selleks faktoranalüüsi ja peakomponentide analüüsi. Kolmas osa kursusest lõpeb lühikese sissejuhatusega sellest, kuidas rakendada lihtsat masinõppemudelit R-s. \n\nViimane osa kursusest keskendub tekstianalüüsi mudelitele. Me vaatame seda, kuidas tuvastada tekstidest emotsioone, kuidas paigutada tekste teatud dimensioonidele (skaleerimine) nagu näiteks ideoloogilised dimensioonid ning kuidas kasutada masinõppemeetodeid selleks, et tuvastada tekstidest nendes esinevaid teemasid. \n\nKursuse iga osa juurde kuuluvad vastavad kodutööd ning kursus lõpeb sellega, et kõik osalejad valmistavad ette analüüsiplaani, mis kasutab mõningaid kursuse jooksul tutvustatud meetodeid.Objectives/eesmärkid:  Kursuse eesmärgiks on anda osalejatele praktilised ja laiapõjalisemad oskused R-i kasutamisel andmete haldamiseks ja analüüsiksl. Tegemist on jätkukursusega ainele Kvantitatiivsed meetodid I (SHRG.03.024) ning kususel on kaks peamist eesmärki:  - laiendada osalejate teadmisi R-st andmete töötlemisel ja haldamisel ning - laiendada osalejate teadmisi keerukamatest statistilise analüüsi meetoditest, eriti tekstianalüüsi meetodietst.Learning outcomes/õpiväljund:  Kursuse lõppedes on osalejad omandanud teadmised sellest, kuidas kasutada R-i: - andmete haldamiseks; - tekstiliste andmete töötlemiseks; - internetist andmekaevandamiseks; - keerukamatest regressioonianalüüsideks ja faktoranalüüsiks; - tekstiandmete analüüsiks, muuhulgas järgnevaks:     - meelestatuse analüüs;     - tekstide skaleerimine;     - teemade modelleerimine. A laptop is required to participate in the seminars (with R and RStudio installed). Any laptop that runs Mac OS, Windows 10 or Linux (e.g. Ubuntu) is suitable. Laptops running ChromeOS are not suitable."}