{"KURSUSE_NIMI": "Julgeoleku väljakutsed Aasia Vaikse ookeani regioonis", "KURSUSE_KOOD": "SVJS.00.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 4, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursus koosneb kahest osast. Esimene osa annab ülevaate piirkondliku julgeoleku põhilistest mõistetest ning seejärel uurib suundumusi, mis kujundavad julgeolekuolukorra Ida-Aasias. Antakse ülevaate Hiina geopoliitikast ja hiinlaste arusaamast maailmakorrast; Jaapani julgeolekupoliitika arengutest Külma Sõja ajal ja pärast seda; pingetest Taiwani väinas ja julgeolekuolukorrast Korea poolsaarel. Teine osa uurib julgeolekustamise probleeme Kagu-Aasias. Keskpunktiks on ASEAN-i turbluentne integratsioonipoliitika. Uuritakse julgeoleku väljakutseid teatud Kagu-Aasia riikide nõrkuste tulenevalt, nt terrorism, kodusõda ja sõjaline osalus; pinged pakutud ASEAN demokratiseerimise ümber; ASEANi integratsiooniprotsessi võrdlus teiste piirkondlike organisatsioonidega ja ASEANi koht laiemas Aasia-Vaikse ookeani julgeolekukorras.Objectives/eesmärkid:  Kursuse eesmärk on analüüsida peamisi julgeoleku väljakutseid Aasia-Vaikse ookeani regiooni rahvusvaheliste suhete kujundamisel. Aine koosneb kahest osast. Selle esimene osa uurib Hiina tõusu mõju majanduslikule ja poliitilisele võimule Ida-Aasia julgeoleku maastikul ning Jaapani julgeolekupoliitika ja Korea poolsaare julgeolekukorra arenemise suunad. Teise osa hindab piirkondliku integratsioonipoliitikat ja julgeolekut ASEAN riikides.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Aine läbides üliõpilane:\n-\tVõrdleb ja vastandab piirkonna erinevaid rahvusvaheliste suhete kujundamise tegureid\n-\tAnalüüsib Hiina võimutõusu dünaamikat Ida-Aasia piirkonnas ning tegureid, mis kujundavad Hiina teravdatud suhted naabririikidega sh Jaapan, taiwan ja Lõuna-Korea; samuti analüüsib keerulist julgeolekuolukorra Korea poolsaarel;\n-\tEristab julgeoleku ja integratsiooni poliitikad, mis määratlevad globaalse tähtsusega piirkondliku organisatsiooni (ASEAN) kujunemist;\n-\tPõhjalikult defineerib ASEAN-i rahvusvaheliste suhete positsioone ja potentsiaali laiemas Aasia kontekstis, Hiinas, EL-s ja USA-s;\n-\tKirjutab akadeemilist teadustööd kriitiliselt ja argumenteeritult Aasia-Vaikse ookeani regiooni julgeoleku teemadel. Recommended course to be passed before attending this course is International Relations.\n\nThis course will be based mostly on lectures. Each lecture and seminar will encourage an active learning environment integrating student questioning, discussions and debates. As assessments, students will be requested to submit one short policy paper and to participate in group work in order to attain the final grade.\n\nAdditional information can be requested from Prof Eiki Berg, eiki.berg@ut.ee."}