{"KURSUSE_NIMI": "Poliitikateooria klassikud", "KURSUSE_KOOD": "SVJS.00.095", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 11, "practice": 1, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate Euroopa tähtsamate poliitikafilosoofide ideedest. Käsitletakse valikut järgmistest autoritest: Sokrates, Platon, Aristoteles, Machiavelli, Hobbes, Locke, Montesquieu, Rousseau, Kant, Wollstonecraft, Burke, Herder, Hegel, Mill, Marx.Objectives/eesmärkid:  Kursuse eesmärkideks on: - anda alusteadmised Euroopa tähtsamate poliitikafilosoofide peamistest ideedest Sokratesest Marxini; - õpetada üliõpilasi analüüsima poliitikafilosoofilisi tekste, määratlema autori ees seisvat põhiprobleemi, rekonstrueerima argumentatsiooni ning seda kriitiliselt hindama; - õpetada üliõpilasi analüüsima autorite ja nende tekstide seoseid ajaloolise kontekstiga; - suurendada üliõpilaste teadlikkust meie praeguste kesksete poliitiliste mõistete ajaloolisest päritolust ja komplekssest kujunemisloost; - õpetada üliõpilasi poliitikateooria probleemide üle arutlema ning oma normatiivseid seisukohti põhjendama.Learning outcomes/õpiväljund:  Õppeaine edukalt sooritanud üliõpilane: 1) omab ülevaadet Euroopa tähtsamate poliitiliste filosoofide peamistest ideedest; 2) oskab analüüsida poliitikafilosoofilisi tekste, määratledes autori eesmärgid ning lahendused; 3) omab teadmisi poliitikateooria klassikaliste tekstide seostest ajaloolise kontekstiga; 4) teab poliitikateooria põhimõistete erinevaid tõlgendusviise erinevates teooriates, oskab võrrelda ja analüüsida nende tähendust eri kontekstides; 5) oskab arutleda poliitikateoreetiliste probleemide üle ning oma normatiivseid poliitika-alaseid vaateid põhjendada. Kursusel osalejate arv on piiratud, eelisjärjekorras võetakse vastu Riigiteaduste instituudi üliõpilased.\n\nJälgime epidemioloogilist situatsiooni ning kui ülikooli üldine poliitika ette näeb, oleme valmis õppetöö kolima veebi.\n\nKui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}