{"KURSUSE_NIMI": "Sissejuhatus riigiteaduste erialasse", "KURSUSE_KOOD": "SVJS.00.077", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine tutvustab riigi- ja poliitikateadusi lähtuvalt kolmest erialast - võrdlev poliitika, avalik haldus ja rahvusvahelised suhted. Aine on korraldatud kolmes alaosas:\n1) riigiteadus kui õpe (õpirada) käsitleb enesestjuhitud kaalutletud valikuid õpingute ajalisel ja sisulisel planeerimisel lähtuvalt informatsioonist õppekorralduse ja õppekava kohta, lähtuvalt andmetest varasemate tudengite valikutest ning lähtuvalt õppematerjalidest kolme riigiteaduste eriala kohta;\n2) riigiteadus kui teadus (teadusrada) tutvustab teadusprojekte, teaduskarjääri võimalusi ja tudengite võimalusi neis projektides ka õpingute käigus osaleda lähtuvalt projektidest ja teadlastest Johan Skytte Poliitikauuringute Instituudis ning lähtuvalt õppematerjalidest kolme riigiteaduste eriala teadusuuringute kohta;\n3) riigiteadus kui amet (karjäärirada) käsitleb teemat \"erialased töökohad\" põhinedes näidetel ja andmetel sellest, millised on olnud hiljutiste vilistlaste (lõpetanud õppekava 2 kuni 5 aastat varem) töö- ja karjäärialased kaalutlused ja valikud.Objectives/eesmärkid:  Riigiteaduste eriala tutvustav kursus toetab üliõpilase enesejuhtimisoskusi, tutvustab riigiteaduste õppekava läbimise valikuid ja võimalusi. Annab ülevaate riigiteadustega seotud teadustöödest, teaduskarjäärivõimalustest ning eriala karjäärivõimalustest pärast ülikooli lõpetamist. Õppeaine eesmärgiks on tutvustada riigiteaduste esmakursuslastele riigiteaduste eriala distsipliine - avalik haldus, võrdlev poliitika ja rahvusvahelised suhted - kolmest tahust lähtuvalt - riigiteadus kui õpe (õpirada); riigiteadus kui teadus (teadusrada); riigiteadus kui amet (karjäärirada). Kõigis kolmes tahus tuginetakse akadeemilistele õppematerjalidele ning käsitletakse ka varasemate tudengite (sh ka tänaste vilistlaste ja õppejõudude) valikuid ja kaalutlusi. Olles informeeritud varasemate tudengite valikutest ja kaalutlustest saavad riigiteaduste esmakursuslased langetada informeeritumaid enesest-juhitud valikuid nii oma õppe-, teadus- kui karjääritrajektooris.Learning outcomes/õpiväljund:  Ainekursuse läbinud üliõpilane: - on informeeritud ja teadlik valikutest ja kaalutlustest, mida riigiteaduste tudengid teevad kolmes mõõtmes - riigiteadused kui õpe, riigiteadused kui teadus, riigiteadused kui amet; - oskab langetada enesest-lähtuvaid informeeritud valikuid kolmes mõõtmes - riigiteadused kui õpe, riigiteadused kui teadus, riigiteadused kui amet; - oskab iseseisvalt ja endast lähtuvalt planeerida oma riigiteaduste õpinguid ja töö-alast karjääri."}