{"KURSUSE_NIMI": "Digipädev mina", "KURSUSE_KOOD": "SVJS.00.083", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tänapäeva kiiresti arenevas digimaailmas on digipädevus rohkem kui lihtsalt kasulik oskus – see on hädavajalik, et edukalt toime tulla nii õpingutes, tööelus kui ka igapäevases suhtluses. Kursus „Digipädev mina“ annab sulle praktilised oskused ja teadmised, mis aitavad sul enesekindlamalt ja teadlikumalt tegutseda digitaalses keskkonnas.\n\nÕppetöö keskmes on praktilised harjutused, grupitööd ja arutelud, mis loovad võimaluse kogemuste vahetamiseks ja õpitu rakendamiseks reaalses elus. Samuti saad väärtuslikke näpunäiteid erinevate valdkondade spetsialistidelt ja külalislektoritelt.\n\nKursuse läbinuna oskad:\n- targalt ja enesekindlalt liikuda digimaailmas;\n- kasutada digivahendeid ja -teenuseid igapäevaelus ja õppetöös;\n- olla teadlik ja vastutustundlik digikodanik;\n- parandada oma töö- ja karjäärivõimalusi läbi digipädevuste arendamise.\n\nLisaks saad praktilise tööriistakasti, mis aitab sul tõhusamalt infot leida, hallata ja esitleda. Kursus on avatud kõigile teaduskondade ja õppeastmete üliõpilastele ning eelnevad teadmised pole vajalikud – piisab uudishimust ja soovist digimaailmas paremini orienteeruda.\nObjectives/eesmärkid:  Aine \"Digipädev mina\" eesmärk on arendada õpilaste oskust kasutada digitehnoloogiat teadlikult, turvaliselt ja tõhusalt nii õppimises kui ka igapäevaelus. Kursuse käigus omandavad õpilased teadmisi digiturvalisusest, infootsingust ja andmete süstematiseerimisest, õpivad looma ja jagama digitaalset sisu ning kasutama tehisintellekti info genereerimiseks. Samuti pööratakse tähelepanu sotsiaalmeedia teadlikule kasutamisele, digitaalsetele õigustele ning digitervise ja digiarstiabi olulisusele. Õpilasi julgustatakse olema aktiivsed ja vastutustundlikud digikodanikud, kes oskavad hallata ja kaitsta oma isiklikku teavet. Kursuse lõppeesmärk on anda tudengitele vajalikud teadmised ja oskused, et nad saaksid enesekindlamalt tegutseda tänapäeva digimaailmas.Learning outcomes/õpiväljund:  Spetsiifilised teadmised ja oskused. Õppeaine edukalt läbinud üliõpilane oskab: -\tkoostada esinduslikku CV-d ja kaaskirja, kasutada efektiivselt interneti avaandmeid ning visualiseerida sobivalt andmeid ; -\tkoostada sotsiaalmeedia jaoks visuaalset materjali, õppida kasutama Chat GPT-d lisainfo loomiseks ning viia läbi veebiküsitlusi; -\tkasutada vastavalt vajadustele silmaliigutuste mõõtmist, ehitada digitaalset kaksikut ning orienteeruda digitaalses arstiabis;  -\tosata hallata oma digiprügi ja vastutada oma digiturvalisuse eest; -\tolla kaasatud digitaalselt aktiivse kodanikuna ühiskondlikes protsessides ning orienteeruda digitaalses õigusruumis; Ülekantavad oskused. Õppeaine edukalt läbinud üliõpilane oskab: - kasutada kursuselt omandatud tööriistakasti, et olla digipädevam kodanik; -\tplaneerida oskuslikult oma aega ning seostada õpitavaid oskuseid karjäärivalikutega; -\treflekteerida ja analüüsida nii isiklikku kui erialast arengut. 1. Kodutööd\n\nPeale igat kohtumist esitavad tudengid ühe kodutöö. Kokku tuleb esitada kursuse jooksul 15 kodutööd. Kursuse läbimiseks peab vähemalt 12 kodutööd olema arvestatud. Kodutööd on järgmised:\n\n1.\t(Europass) CV ja kaaskirja koostamine\n2.\tDigiturvalisuse testi läbimine\n3.\tVeebiküsitluse koostamine\n4. Avaandmete ja statistika analüüs\n5.\tSotsiaalmeedia postituse koostamine\n6.\tCHAT GPT abil info genereerimine\n7. Info süstematiseerimine ja visuaalselt esitlemine\n8. Andmete visualiseerimine\n9. Digitaalne panustamine avaliku poliitika kujundamisesse\n10. Silmaliigutuste mõõtmine ja nende tulemuste kasutamine\n11. Digitaalses õigusruumis kaasuse lahendamine\n12. Digiarhiividest info otsimine \n13. Digitervise ja digiarstiabi analüüs\n14. Digitaalse kaksiku ehitamine\n15. Digiprügi koristamine\n\n"}