{"KURSUSE_NIMI": "Sõda ja rahu rahvusvahelistes suhetes", "KURSUSE_KOOD": "SVJS.00.074", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse põhieesmärk on anda õpilastele teoreetiline taust erinevate konfliktide ja rahuprotsesside juhtumite analüüsimiseks ning on seega üles ehitatud küsimuste ümber, mille eesmärk on ergutada nii teoreetilisi arutelusid kui ka poliitilisi debatte. Kursus on seega üles ehitatud nende kahe eesmärgi ümber. Kursuse eesmärk on anda teadmisi erinevatest lähenemistest konfliktide mõistmiseks ja rahu kontseptualiseerimiseks rahvusvahelistes suhetes. Lisaks on kursuse eesmärk selgitada erinevaid konfliktide ja rahuprotsesside juhtumeid ning rahvusvaheliste ja piirkondlike organisatsioonide kaasamist. Õppides selle kursuse lõpus nii rahvusvaheliste suhete teooriat kui praktikaid, on üliõpilased omandanud teadmised erinevate teooriate ja kontseptsioonide rakendatavuse ja asjakohasuse kohta sõja ja rahu mõistmisel rahvusvahelistes suhetes.Objectives/eesmärkid:  Kursuse põhieesmärk on anda õpilastele teoreetiline taust erinevate konfliktide ja rahuprotsesside juhtumite analüüsimiseks ning on seega üles ehitatud küsimuste ümber, mille eesmärk on ergutada nii teoreetilisi arutelusid kui ka poliitilisi debatte. Kursus on seega üles ehitatud nende kahe eesmärgi ümber. Kursuse eesmärk on anda teadmisi erinevatest lähenemistest konfliktide mõistmiseks ja rahu kontseptualiseerimiseks rahvusvahelistes suhetes. Lisaks on kursuse eesmärk selgitada erinevaid konfliktide ja rahuprotsesside juhtumeid ning rahvusvaheliste ja piirkondlike organisatsioonide kaasamist. Õppides selle kursuse lõpus nii rahvusvaheliste suhete teooriat kui praktikaid, on üliõpilased omandanud teadmised erinevate teooriate ja kontseptsioonide rakendatavuse ja asjakohasuse kohta sõja ja rahu mõistmisel rahvusvahelistes suhetes.Learning outcomes/õpiväljund:  1) mõistab riikidevaheliste ja riikidevaheliste konfliktide eristamist rahvusvahelistes suhetes; 2) uurida ja analüüsida erinevaid sõja põhjuseid ja rahutingimusi; 3) analüüsida kriitiliselt kaasaegsete konfliktide olemust; 4) Kasutada teoreetilisi teadmisi erinevate konfliktide ja rahulepingute juhtumite uurimisel. 5) Teha kindlaks poliitilised arutelud konfliktide lahendamise ja rahutagamise tänapäevaste tavade üle ning viisid, kuidas neid on akadeemilises kirjanduses käsitletud."}