{"KURSUSE_NIMI": "Poliitikaanalüüs ja mõjude hindamine", "KURSUSE_KOOD": "SVJS.00.089", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on kontseptuaalselt jagatud kahte ossa:\n1) mõjuhindamise teooria, eeldused ja meetodid ning põhjuslikkus;\n2) meetodite rakendamine tegelike mõjuhinnangute näidetel, nende läbiviimine ja tulemuste mõtestamine.\n\nKursus koosneb interaktiivsetest loengutest. Loengu esimeses osas sõnastatakse esmalt probleem ja tuuakse tegelik näide mõjuhinnangu läbiviimisest. Loengu teises osas võetakse käsile praktiline ülesanne, mida lahendatakse loengu näites analoogselt tudengite poolse diskussiooni läbi. Diskussiooni sisuks on praktilise ülesande lahendamiseks vajalike analüütiliste sammude läbikäimine. Valitud teemade kohta viiakse osades loengutes koos tudengitega läbi andmete põhine reaalne mõjuhinnang ning selle tulemuste tõlgendamine.Objectives/eesmärkid:  Mõju hindamise eesmärk on vähendada otsustusprotsessides olemuslikult esinevaid riske ning hinnata tehtud otsuste tagajärgi. Vajadus selle järele on universaalne, kuid rõhutatult tugev poliitikate kujundamisel, äriliste otsuste vastuvõtmisel ning nende tegevuste hilisemal ümberhindamisel tekkinud info valguses. Näiteks seadusloomes on mõju hinnang lausa kohustuslik element iga õigusakti vastuvõtmise protsessis. Samuti on poliitikaanalüüs pärast ellurakendamist oluline avalike resursside mõistliku kasutamise tagamiseks.\n\nKursuse eesmärk on tutvustada praktiliste näidete abil mõju hindamise läbiviimist nii enne kui pärast otsuste vastuvõtmist. Tutvustatakse erinevaid formaliseeritud ja mitteformaliseeritud viise kuidas mõjusid hinnatakse, ja mil viisil leitakse erinevaid poliitika mõjude näitajaid.\nTutvustakse ja rakendatakse ex ante ja ex post mõju hindamise meetodeid. Samuti turuanalüüsi meetodeid, õigusaktide ja regulatsioonide oodatava mõjude hindamise viise ning lühidalt vaadatakse millised poliitikaanalüüsi disainide puhul on mõistlik mis sorti meetodeid rakendada.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng: 1) eristab mõju hindamiseks vajalikke analüütilisi etappe; 2) tunneb mõju hindamise tuntumaid teoreetilisi aluseid ning rakenduslikke meetoteid; 3) hindab kvantitatiivselt ja kvalitatiivselt ning tõenduspõhiselt konkreetse poliitika või ärilise otsuse eeldatavat mõju enne rakendamist ja tegelikku mõju pärast rakendust; 4) leiab mõõdikuid ja oskab nende abil mõju hinnata; 5) hindab, missuguse struktuuriga andmestikke on vaja mõju hindamiseks; 6) teab ja rakendab kvalitatiivseid mõju hindamise viise."}