{"KURSUSE_NIMI": "ELi laienemine ja Euroopa väljakutsed", "KURSUSE_KOOD": "SVJS.00.024", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 2, "independent_work": 144, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus keskendub üleminekuprotsessidele, moderniseerumise ajaloole, globaliseerumisele, piirkondade jaotamisele, mis on seotud ELi laienemisprotsessi ja naabruspoliitikaga. Kursus kajastab konkureeriva regionalismi väljakutseid Euroopa ja Euraasia kontekstis. Kursus vältel vaadeldakse  praeguste ja tulevaste kandidaatriikide kui ka naaberriikide väljavaateid, probleeme ja väljakutseid.Objectives/eesmärkid:  Kursuse eesmärk on anda õpilastele konkreetne arusaam Euroopa Liidu laienemisprotsessidest ja sellega seotud väljakutsetest. Kursus arendab kontseptuaalseid, analüütilisi ja teoreetilisi teadmisi, et tudengid oskaksid kriitiliselt hinnata euroopastumisprotsessi olemus ning regionaalsust Euroopas ja Euraasias. Kursuse vältel vaadeldakse laienemisprotsessi ajalooliste arengute ja sellega seotud teoreetiliste küsimuste üle. Kirjeldatakse ka regionaalsust ja sellega seotud väljakutseid. \nBrexit-i teemal peetav arutelu kajastab euroopastumise vastaseid mõõtmeid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse lõpuks oskab tudeng:\n- rakendada illiberalismi teooriaid ja kontseptsioone\n- lugeda kriitiliselt Euroopa ja Euraasia ideoloogiliste ja poliitiliste arengutega seotud tekste\n- teha kindlaks ja hinnata vastastikust mõju territoriaalse konteksti ja europariseerumisprotsessi rollis\n- välispoliitiliste tagajärgede problematiseerimist\n- hinnata kriitiliselt arenguid kandidaatriikides, partnerriikides ja laiemas Euroopas This course is developed and implemented with the support of the Jean Monnet Module \"Neighbourhood Enlargement and Regionalism in Europe\" (NearEU). The project has received funding from the European Union's Erasmus+ Jean Monnet programme under Grant Agreement 620279-EPP-1-2020-1-EE-EPPJMO-MODULE."}