{"KURSUSE_NIMI": "Rahvusvahelised suhted", "KURSUSE_KOOD": "SVJS.00.092", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 114, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusega antakse üliõpilastele vajalikud teadmised rahvusvaheliste suhete olulistest toimijatest ning nende tegevustest probleemidega, mis on rahvusvahelisel areenil aktuaalsed. Kursuses käsitletakse olulisi toimijaid nagu riik ja rahvusvahelised organisatsioonid ning nende tegevusi peamiste rahvusvahelise elu valdkondades ja globaalprobleemide lahendamisel.Objectives/eesmärkid:  Õppeaine eesmärgiks on anda tudengitele baasteadmised rahvusvaheliste suhete teadusainest: distsipliini piirid, terminoloogia, toimijad, peamised uurimisalad.Learning outcomes/õpiväljund:  Kursuse läbides tudeng: 1. teab rahvusvaheliste suhete kui teadusdistsipliini uurimisobjekte, muutujaid ja piire; 2. tunneb erialast terminoloogiat; 3. orienteerub rahvusvaheliste suhete peamistes valdkondades ning globaalsetes probleemides; 4. tunneb peamisi toimijaid ja nendega seotud kontseptsioone; 5. oskab toimijate empiirilise käitumise siduda kontseptsioonidega; Kursuse käigus arenevad tudengil erinevad oskused - meeskonnatöö, suuline ja kirjalik väljendusoskus, andmete otsimine ja kasutamine, mida kursuses erinevate ülesannete lahendamisel vaja läheb. Kursuse eetika\nMõned reeglid, mille järgimisel kursuse läbimisel probleeme tekkida ei tohiks:\n* Tööde õigeaegne esitamine. Töödele on täpsed tähtajad ning tööd tuleb selleks ajaks esitada. Kuna tööde tegemiseks saab piisava aja, siis hilinenud töid vastu ei võeta!\n* Tekstirobotite kasutamine kirjalike tööde kirjutamisel ei ole lubatud!\n* Puudumistest tuleb ette teatada. Haigus või töö- või õppealane põhjus annavad võimaluse kiri saata. Erakorraliste juhtumitega tegeletakse individuaalselt.\n* Kuna õppejõud ei ole üliõpilase sekretär, siis arvepidamine, millal seminarid toimuvad, millises rühmas üliõpilane on ning millisest seminarist on puudutud, lasub üliõpilasel. Kõik info on saadaval Moodle's. Kui ei ole, siis on üliõpilasel õigus pretensioonideks.\n* Plagieerimine ei ole tolereeritav. Töödes kasutatud allikad tuleb viidata.\n* Võimaliku pandeemia (või mõne muu eriolukorra) korral võib kursuse korraldusse tekkida muudatusi, millest teavitatakse jooksvalt.\n* Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust"}