{"KURSUSE_NIMI": "Riigihangete korraldamine", "KURSUSE_KOOD": "SVJS.00.079", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab põhjaliku ja praktilise oskuste pagasi töötamaks Eesti riigihangete maastikul ning viima oskuslikult läbi riigihankeid. Antud kursusel läheneme detailselt just riigihangete korraldamise praktilisele poolele. Kohtumised toimuvad veebi teel igal nädalal neljapäeviti kell 16.15. Kursusel räägime sellest, kuidas planeerida ning korraldada riigihankeid nii, et need oleksid vastavuses seadustega. Olulisi praktilisi nõuandeid õpetavad riigihangete valdkonna eksperdid ning oskuslikud praktikud. Vastame koos küsimustele, kuidas planeerida ja korraldada riigihanget nii, et see ei läheks vastuollu seaduste ja heade tavadega? Mis on riigihanke planeerimise juures kõige olulisem silmas pidada? Millele peaks tuginema riigihanke koostamisel?Objectives/eesmärkid:  Antud kursus annab põhjalikud ja praktilised teadmised sellest, kuidas korraldada riigihankeid ning mida silmas pidada hangete läbiviimisel. Samuti pannakse rõhku riigihangetega kaasnevatele kitsaskohtadele ning detailidele, mida peaks iga hankija teadma ning praktikas ka rakendama.Learning outcomes/õpiväljund:  Erialased teadmised ja oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tmõista riigihanke korraldust Eestis;\n-\tkorraldada iseseisvalt riigihanget ning koostada sellega kaasnevaid dokumente;\n-\tleida riigihanke jaoks sobivad tarnijad;\n-\torienteeruda Eesti riigihangete valdkonnas ning tunneb riigihangete e-keskkonda;\n-\tKriitiliselt hinnata riigihankele kandideerivate ettevõtete tingimusi ning nende sobivust;\n-\tomab head ülevaadet hankeasjade planeerimisest ja korraldamisest;\n-\torienteeruda riigihangete registris ja vastavates avalikes dokumentides;\n-\ttunneb põhjalikult riigihangete korraldamise eesmärke, protsesse ja tingimusi;\nÜlekantavad oskused. Õppeaine edukalt läbinud üliõpilane oskab:\n-\tanalüüsida varasemalt tehtud riigihangete kitsaskohti;\n-\tkasutada töös vajaminevaid digivahendeid ja e-keskkondi;\n-\tteha grupis tööd ning vajadusel seda ka juhtida;\n-\tsõnastada organisatsiooni/ettevõtte vajadusi ning neid analüüsida;\n-\treflekteerida ja hinnata oma õpikogemust ning praktiliste oskuste kasutamisvõimet."}