{"KURSUSE_NIMI": "Poliitika kujundamine ja elluviimine", "KURSUSE_KOOD": "SVJS.00.088", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Antud kursus tutvustab tudengitele avaliku poliitika kujundamise protsessi. Kursus lähtub oma ülesehituses avaliku poliitika astmelisest mudelist ning käsitleb tsükli kõiki etappe, sh. päevakorra kujunemine, poliitikaanalüüs, poliitikate disain, elluviimine ja hindamine. Kursus ei keskendu ühelegi konkreetsele valdkonnapoliitikale, vaid annab üldised teadmised avaliku poliitika mõistmiseks ja uurimiseks mistahes harupoliitika valdkonnas. Tudengitel on võimalus siduda kursuse käigus omandatud materjal neile huvipakkuva valdkonnapoliitika analüüsimiseks semestri jooksul esitatavate kodutööde käigus. Lisaks loengutele on aine struktuuri integreeritud tudengite poliitikakujundamise projektide valmimist toetavad praktikumid, mis arendavad osaliste teadmisi ja oskusi poliitikaanalüüsi meetodite, poliitikapaberite kirjutamise ja huvikaitse strateegiate vallas.Objectives/eesmärkid:  Kursuse eesmärgiks on anda süsteemne ülevaade avaliku poliitika kujundamise protsessist sh. päevakorra kujunemisest, poliitikaanalüüsist, poliitikate disainist, elluviimisest ja hindamisest. Tudengid omandavad baasteadmised poliitikaanalüüsi planeerimisest ja elluviimisest, poliitikapaberite kirjutamisest ja huvikaitsest.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1. mõistab avaliku poliitika tsükli erinevaid etappe ja nende omavahelisi seoseid; 2. oskab planeerida ja kirjutada poliitikanaalüüse; 3. eristab poliitikapaberite kirjutamise erinevaid anreid ja oskab koostada positsioonipabereid; 4. tunneb enamlevinud poliitikakujundamise teooriaid ja rakendab neid talle huvipakkuva valdkonnapoliitika uurimiseks."}