{"KURSUSE_NIMI": "Illiberaalne pööre Euroopas ja Venemaal", "KURSUSE_KOOD": "SVJS.00.023", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse eesmärk on luua uusi võrdlevaid teadmisi konsolideerimise ja levitamise kohta ELis, aga ka laiemalt Euroopas ja Venemaal. Kursuse teises pooles on tudengitel  võimaluse tutvuda konkreetsete riiklike ja piirkondlike juhtumitega, puutudes kokku võrdleva ülevaadetega ajaloolistest arengutest. Kursuse toimumise jooksul uuritakse põhjalikult ka euroopastumise mõõdet ja vastastikust mõju mandri tasandil.Objectives/eesmärkid:  Kursus uurib illiberaalse dünaamika tekkimist ja levikut riiklikul tasandil - režiimitüüpide, ideoloogiate ja väärtuste osas - ning laiemat mõju rahvusvahelisele korrale. Lisaks teoreetilisele raamistikule keskendub kursus dünaamikale ELi erinevates piirkondades (Lääne-Euroopa, Kesk- ja Ida-Euroopa, Lõuna- ja Põhja-Euroopa). Lisaks vaadeldakse kandidaatriikide, ELi naabrusriikide ja Venemaa kogemusi. Samuti käsitletakse Euroopa ja Venemaa vastastikust mõju ning illiberalismi välispoliitilist prognoosi.Learning outcomes/õpiväljund:  Kursuse lõpuks oskab tudeng:\n- rakendada illiberalismi teooriaid ja kontseptsioone\n- lugege kriitiliselt Euroopa ja Euraasia ideoloogilisi ja poliitilisi arenguid\n- tõlgendada vastastikust mõju territoriaalses kontekstis ja euroopastumisprotsessi rolli\n- mõista sise- ja välispoliitika mõjusid\n- mõista kriitiliselt tagajärgi ELi naaberriikidele This course is developed and implemented with the support of the Jean Monnet Module \"Neighbourhood Enlargement and Regionalism in Europe\" (NearEU). The project has received funding from the European Union's Erasmus+ Jean Monnet programme under Grant Agreement 620279-EPP-1-2020-1-EE-EPPJMO-MODULE."}