{"KURSUSE_NIMI": "Sissejuhatus Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringutesse", "KURSUSE_KOOD": "SVJS.00.006", "EAP": 12, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 3, "practice": 0, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 283, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Selle kursuse eesmärk on selgitada õppekavas fookuses olevate piirkonnauuringute probleeme, teemasid ja ulatust, aidates seeläbi üliõpilastel koostada selgelt fokusseeritud lõputöö kavand. Ühelt poolt keskendub kursus selle laialdase geograafilise ruumi ajalukku, regioonide kujunemisse, poliitikatesse ja pöördelistesse sotsiaalmajanduslikesse muutustesse, uurides kriitiliselt regioonide muutuvaid seoseid ja nende omavahelisi läbipõimumisi, nende konstrueeritud tähendusi ja ideoloogilisi põhjendatusi. See lähenemine võimaldab üliõpilastel küsimuse alla seada selle mitmekesise ja keerulise piirkonna homogeniseerimist, tunnustades samal ajal selles elavate erinevate rahvaste subjektsust. Teisalt tutvustab kursus üliõpilastele piirkonnauuringutega seotud uurimisvaldkondade põhimõisteid.\nKursus jaguneb kaheks osaks. Esialgu tegelevad üliõpilased iseseisvalt e-õppematerjalidega, mis tutvustavad ajaloolisi või kaasaegseid arenguid õppekavaga seotud regioonides. Seejärel koostavad nad koostöös digitaalse esitluse, mis analüüsib ja võrdleb spetsiifilisi arenguid erinevates regionaalsetes kontekstides. Neid ettekandeid arutatakse seejärel iganädalastel seminaridel. Kursuse teises pooles vaatavad üliõpilased iseseisvalt videoloenguid, mis tutvustavad piirkonnauuringutega seotud peamisi mõisteid ja teooriaid. Nendest materjalidest lähtudes sõnastavad üliõpilased uurimisprobleemi, mida seejärel arutatakse iganädalastel seminaridel. Kursus kulmineerub suulise eksamiga, kus üliõpilased näitavad oma arusaamist regioonide peamistest ajaloolistest ja tänapäevastest dünaamikatest, rakendades selleks oma analüüsioskusi. Kursuse lõppülesanne on esitada lõputöökavand, mis on kooskõlas üliõpilaste kolmanda semestri mobiilsusega.Objectives/eesmärkid:  Kursuse eesmärkideks on luua üldine arusaam peamistest ajaloolistest ja tänapäevastest arengutest geograafilises ruumis, millega Kesk- ja Ida-Euroopa, Venemaa ja Euraasia uuringute õppekava tegeleb ning tutvustada erinevaid sotsiaalteaduslikke distsipliine nende uurimiseks, et iseseisvalt välja töötada oma lõputöö uurimisplaan. Selle üldise eesmärgi saavutamiseks arendatakse kursusel erinevaid oskusi, mis on vajalikud õppekava läbimiseks. Nendest olulisemad on:  - võrdlev analüüsi oskus, et kõrvutada ja võrrelda erinevaid regioone, mis on õppekava uurimisfookuses; - sünteesimisoskus, et lahti mõtestada õppekava uurimisfookuses olevates regioonides toimunud ja toimuvaid ühiskondlikke arenguid; - oskus sõnastada uurimisprobleem, et selle baasilt iseseisvalt välja töötada uurimiskava; - vastastikuse õppimise ja konstruktiivse tagasisidestamise oskus, et toetada iseseisvat õppimist; - oskus luua akadeemiliselt pädevat digitaalset ühisloomet, et seeläbi tugevdada vastastikuse õppimise oskust; - õppegrupi meeskonnatööoskused, et seeläbi luua ja tugevdada nende õppegrupi ühine identiteet.Learning outcomes/õpiväljund:  Kursuse lõpetamisel tudeng - analüüsib kriitiliselt õppekava regioonide ajalugu, sealhulgas erinevate piirkondade kujunemisi, poliitikaid ja sotsiaalmajanduslikke arenguid; - loob mõistetavaid seoseid ajalooliste protsesside ja kaasaegsete sotsio-poliitiliste arengute vahel, sh rahvusvahelistes suhetes regioonides, mis on õppekava uurimisfookuses; - mõistab ja arendab diskussiooni põhiterminitega, mis on seotud politoloogia, rahvusvaheliste suhete, sotsioloogia, antropoloogia ja kulturoloogiaga; - rakendab neid põhitermineid terviklikus analüüsis seoses õppeaine fookuses olevate regioonidega; - arendab iseseisva uurimiskava, mis tugineb vähemalt ühele õppekava alusdistsipliinile ja on seotud ühe õppekava fookuses oleva regiooniga."}