{"KURSUSE_NIMI": "Statistilise analüüsi alused", "KURSUSE_KOOD": "SVJS.00.038", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 16, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 128, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus keskendub statistilise analüüsi algteadmiste tutvustamisele ning statistilise tarkvara R kasutamise baasokuste loomisele. Kursus on praktilise suunitlusega ning enamus käsitletud teemasid on orienteeritud konkreetsete statistilise analüüsiga seotud ülesannete ja toiminugte teostamisele R-is. Kursus algab statistilise analüüsi põhimõistete ning andmetüüpide ja struktuuride tutvustamisest. Põhirõhk on just sotsiaalteadustes ja eriti politoloogias põhiliselt kasutusel olevatel analüüsitüüpidel. Tutvume hüpoteeside statistilise testimise põhiloogikaga. Seejärel tutvustatakse R-i, kuna tegemist on kaasaja andmeanalüüsis kõige enam kasutatava ja tööturul hinnatud analüüsitarkvaraga. Kursuse põhiosas vaatame, kuidas R-i on võimalik kasutada, et hinnata seoseid erinevatel skaaladel mõõdetud muutujate vahel ning kuidas on võimalik R-is teostada põhilist regressioonianalüüsi. Käsitleme ka andmete visuaalse kuvamise põhilisi tehnikaid R-is.Objectives/eesmärkid:  Kursuse eesmärkideks on: - sotsiaalteadustes rakendatava statistilise analüüsi aluspõhimõtete tutvustamine; - põhiliste statistilise analüüsi meetodite tutvustamine; - statistilise tarkvara R kasutamise aluste õpetamine; - õpitud meetodite rakendamine konkreetse uurimisülesande lahendamiseks.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane omab baasteadmisi statistilise analüüsi teostamiseks ja mõistmiseks sotsiaalteadustes ning oskab seda teha kasutades statistilise analüüsi tarkvara R. Ta on tuttav statistilise analüüsi põhimõistete ja mudelitega, oskab analüüsiks vajalikke andmeid hinnata, ette valmistada ja valida vastavalt andmetele sobiv mudel. Ta on võimeline oma analüüsi tulemusi tõlgendama ja esitama ning oma andmetest esmaseid jooniseid looma. Kui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}