{"KURSUSE_NIMI": "Rahvusvaheline julgeolek", "KURSUSE_KOOD": "SVJS.00.044", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 4, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "\"Rahvusvahelise julgeoleku\" kursus tutvustab rahvusvaheliste suhete üliõpilastele julgeoleku-uuringute alavaldkonda. Kursus teeb sissejuhatuse mõnedesse kõige pakilisematesse julgeolekuprobleemidesse, mis iseloomustavad tänapäeva julgeolekukeskkonda, võtmekontseptsioonidesse, samuti julgeoleku-uuringute valdkonna kesksetesse teemadesse.\nPuuduliku julgeoleku probleem ja riikide vajadus tagada oma julgeolek anarhilises keskkonnas on üks põhilisemaid väljakutseid, millega riigid silmitsi seisavad, ning see on üks rahvusvahelise poliitika põhilisemaid ja püsivamaid tunnuseid. Seetõttu on riikliku ja rahvusvahelise julgeoleku kaalutlused maailmapoliitika uurimise keskmes ja julgeoleku tagamine on nii teadusuuringute kui ka poliitika seisukohast tähelepanu vääriv teema.\nSelle taustal on kursuse eesmärk võimaldada üliõpilastel orienteeruda praegustes rahvusvahelise julgeoleku alastes aruteludes. Selleks tutvustatakse esiteks mõningaid kõige pakilisemaid julgeolekuprobleeme, mis iseloomustavad tänapäeva julgeolekukeskkonda, ja teiseks antakse üliõpilastele analüütilised vahendid, et nad saaksid kriitiliselt tegeleda nende julgeolekuprobleemidega ja laiemate julgeolekupoliitikaga seotud debattidega.Objectives/eesmärkid:  Kursuse eesmärk on tutvustada üliõpilastele julgeoleku-uuringute valdkonda. Selleks käsitletakse rahvusvahelise julgeoleku uurimise põhimõisteid, tänapäeva julgeolekukeskkonda iseloomustavaid keskseid küsimusi ja julgeolekuprobleeme ning rahvusvahelise julgeolekuga seotud peamisi debatte.Learning outcomes/õpiväljund:  Kursuse läbinud: - on tuttavad kaasaegse julgeolekukeskkonna peamiste tunnustega; - oskavad nimetada, kirjeldada ja rakendada julgeoleku-uuringute valdkonna keskseid mõisteid; - tunnevad ja oskavad hinnata julgeoleku-uuringute valdkonna keskseid debatte/ argumente; - oskavad rakendada julgeoleku-uuringute valdkonna põhimõisteid, et analüüsida kriitiliselt praeguseid julgeolekuprobleeme. Kursus toimub Moodle'is, mis on ka peamine kommunikatsioonikanal. Kursuse õppejõuga saab kontakteeruda ka e-kirja teel (thomas.linsenmaier@ut.ee)"}