{"KURSUSE_NIMI": "Globaalne poliitika ja maailma kord", "KURSUSE_KOOD": "SVJS.00.104", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 32, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Globaalne poliitika ja maailmakord uurib globaalpoliitikat kujundavaid tegureid, sealhulgas jõuvahekordi, regioonide mõju, liite ning väljakutseid nagu küberturvalisus ja demokraatia. Kursus ühendab teooria ja päriselulised näited, et aidata osalejatel mõista ja ennustada ülemaailmseid trende.Objectives/eesmärkid:  See kursus uurib globaalse poliitika kujundavaid tegureid ja maailmakorra uusi tekkivaid struktuure. Selle eesmärk on anda põhjalik ülevaade keerulistest suhetest suurjõudude, regiooniüleste liitude ja väikeriikide vahel tänases geopoliitilises olukorras. Osalejad analüüsivad olulisi küsimusi, sealhulgas digitaalse ühiskonna rolli, demokraatlike süsteemide vastupidavust populismi ja valeinfo tingimustes, samuti pikaajaliste liitude ja uute julgeolekuohtude mõju. Uurides nii teoreetilist raamistikku kui ka tegelikke juhtumeid, annab see kursus õpilastele analüütilised oskuse tõlgendamaks praeguseid globaalseid muutusi ja oskused kujutada ette tulevikku globaalse koostöö ja valitsemise kontekstis.Learning outcomes/õpiväljund:  Kursuse lõppedes suudab üliõpilane: * analüüsida globaalse poliitika peamisi teoreetilisi raamistikke ja rakendada neid kaasaegsete geopoliitiliste probleemide kontekstis. * hinnata kriitiliselt piirkondlike ja globaalsete liitude rolli ning nende mõju maailmakorrale ja julgeolekule. * hinnata digitaalse ülemineku ja valeinfo mõju valitsemisele, demokraatiale ja rahvusvahelistele suhetele. * tõlgendada väikeriikide ja suurriikide strateegiaid globaalsete väljakutsete lahendamisel ja poliitika mõjutamisel mitmekülgse maailmakorra kontekstis."}