{"KURSUSE_NIMI": "Rahvusvaheline kord", "KURSUSE_KOOD": "SVJS.00.091", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Rahvusvahelised suhted"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 118, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tugineb suunamooduli rahvusvaheliste suhete sissejuhatavale ainele ning selles antakse täpsemad teadmised rahvusvaheliste suhete süsteemsetest käsitlustest, nende rakendamisest maailma poliitilises ajaloos ning rahvusvaheliste suhete teooriatest. Objectives/eesmärkid:  Õppeaine eesmärgiks on anda tudengitele teadmised rahvusvaheliste suhete süsteemsest käsitlusest ning oskused analüüsida rahvusvahelisi sündmusi nendest käsitlustest lähtuvalt.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel üliõpilane: 1. mõistab rahvusvaheliste süsteemide toimimise põhimõtteid nii rahvusvahelistes sõjalis-poliitilistes, majanduslikes ja sotsio-kultuurilistes suhetes, samuti looduskeskkonna mõju rahvusvahelistele suhetele; 2. tõlgendab rahvusvahelise poliitika sündmusi erinevatel analüüsitasanditel; 3. seostab teoreetilisi tõlgendusi ja tegelikku maailmapoliitikat; 4. hindab maailmapoliitika arengusuundi; 5. tunneb rahvusvaheliste organisatsioonide rolle ja funktsioone rahvusvaheliste suhete süsteemis. Kursuse käigus arenevad tudengil erinevad oskused - meeskonnatöö, suuline ja kirjalik väljendusoskus, andmete otsimine ja kasutamine, mida kursuses erinevate ülesannete lahendamisel vaja läheb. Kursuse eetika\nMõned reeglid, mille järgimisel kursuse läbimisel probleeme tekkida ei tohiks:\nPuudumised ja hilinemised tuleb ette teatada.\nTööde õigeaegne esitamine. Töödele on täpsed tähtajad ning tööd tuleb selleks ajaks esitada. Kuna tööde tegemiseks saab piisava aja, siis hilinenud töid vastu ei võeta!\nTöödel tuleb kindlasti ära märkida autor, õppeaine, töö liik ja number (nt 3.kodutöö) ja pealkiri. \nTekstirobotite kasutamine kirjalike tööde kirjutamisel ei ole lubatud!\nKui tudengil tekib aine kohta küsimusi ning küsimused esitatakse meilitsi, siis see palun meili pealkirjas ära tuua (nt 'küsimus kodutööst', mitte lihtsalt 'kodutöö').\nKuna õppejõud ei ole üliõpilase sekretär, siis arvepidamine, millal seminarid toimuvad, millises rühmas üliõpilane on ning millisest seminarist on puudutud, lasub üliõpilasel. Samuti peab üliõpilane teadma tööde esitamise tähtaegasid. Kõik info on saadaval Moodles. Kui ei ole, siis on üliõpilasel õigus pretensioonideks.\nPlagieerimine ei ole tolereeritav. Töödes kasutatud allikad tuleb viidata.\nLisaülesandeid ei saa! Kui tudeng leiab, et parema hinde saamiseks võiks teha lisatööd, siis seda võimalust ei ole.\nKui teil üliõpilasena on vajadus õppetöös kohanduste saamiseks, konsulteerige infoga leheküljel https://ut.ee/et/sisu/erivajadustega-uliopilaste-noustamine ja pöörduge erivajadustega üliõpilaste nõustaja poole nii vara kui võimalik ning tungivalt soovitavalt enne semestri algust."}