{"KURSUSE_NIMI": "Kaasaegse pangandusettevõtte toimimine LHV Panga näitel", "KURSUSE_KOOD": "SVMJ.06.010", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 8, "independent_work": 50, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kaasaegne pangandus on keeruline ja mitmetahuline valdkond. Panga juhtimisel on väga suur roll finantsvälistel aspektidel, nagu nt õigus, infotehnoloogia ja küberturvalisus, turundus ja suhtlus. Aine on üles ehitatud LHV Panga juhtide külalisloengutele, mille raames käsitletakse tänapäeva panga tegevusega seotud iseärasusi. Õppeaine väärtus seisneb selles, et panga juhtimist käsitletakse ettevõttepõhisest vaatest ning erialaseid teadmisi mitteomavale osalejale hoomataval tasemel. Praktikute külalisloenguid tasakaalustatakse rahandusteoreetilise käsitlusega, mille loovad TÜ majandusteaduskonna õppejõud (jooksvalt koos LHV külalislektorite etteastega).\nKursuse raames selgitatakse, millised on panga funktsioonid ja roll majandussüsteemis, milles seisnevad panga finantsjuhtimise eripärad, milliseid teenuseid pank pakub. Samuti antakse ülevaade õiguslikest, infoturbe ja turunduslikest aspektidest, mis on lahutamatud osad tänapäeva panga tegevusest.Objectives/eesmärkid:  Aine eesmärgiks on LHV panga näitel anda ülevaade kaasaegse pangandusettevõtte toimimisest, tema poolt pakutavatest teenustest ning panga juhtimisega seotud valdkonnaspetsiifilistest aspektidest.Learning outcomes/õpiväljund:  Aine läbinud õppija: * mõistab panga rolli riigi finantssüsteemis ning tänapäeva panga funktsioone; * teab, milliseid teenuseid pank pakub nii era- kui ka juriidilistele isikutele; * mõistab pangandusettevõtte tegevust mõjutavaid väliskeskkonna tegureid; * mõistab pangandusettevõtte erinevate tegevusvaldkondade ja funktsioonide olulisust ning nendevahelisi seoseid;  * valdab pangandusvaldkonnas kasutuses olevaid põhimõisteid ja -termineid; * oskab lahendada lihtsamaid teemakohaseid ülesandeid ja probleeme. Esialgsete plaanide kohaselt toimub õppetöö auditooriumis koos loengute otseülekandmisega läbi veebi. NB! Loengud pole järelvaadatavad!"}