{"KURSUSE_NIMI": "Innovatsioon avalikus sektoris ja majanduspoliitika kujundamises", "KURSUSE_KOOD": "SVMJ.08.004", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 88, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Innovatsioonipoliitika kursus on suurepärane võimalus tutvustada tudengitele innovatsiooniteooriat avaliku sektori kontekstis, avades seeläbi poliitikakujundamise telgitaguseid ning võimalusi (ja ka piire) nii vertikaalseks kui ka valdkondade ja sektorite üleseks tegutsemiseks.\n\nSageli ongi valik riikide käes olevate erinevate mehhanismide vahel täis vastuolulisi argumente, mistõttu arutletaksegi kursusel avaliku-, era- ja kolmanda sektori rollide ning koostöömudelite üle poliitikate mõjususe suurendamisel. Teemaks võetakse nii eksperimentaalne majanduspoliitika kui ka võimalused ja viisid, kuidas saab riik oma innovatsioonipoliitika abil ettevõtete konkurentsivõimet suurendada ning ka iseenda protsesse ja teenuseid ajakohastada.\n\nKursus koosneb 16 akadeemilisest tunnist, mis jagunevad nelja keskse teema vahel. Alustuseks leiavad käsitlemist trendid ja nö ausad faktid, mis loovad konteksti nii majanduspoliitikale kui ka innovatsioonile avalikus sektoris. Järgmiseks võetakse ette innovatsiooniteooria, selle olemus ja innovatsioonijuhtimine era-, avalikus ning vabasektoris. Loengutsükli kolmas osa keskendub konkreetsemalt innovatsioonipoliitikale ja innovatsioonisüsteemidele ning nendega seotud tehnikatele majanduspoliitika kujundamisel. Õppeaine neljandas osas on fookuse all ettevõtlikkus, selle võimalikkus, seda soodustavad ja takistavad tegurid ning muutuste juhtimine laiemalt avalikus sektoris.Objectives/eesmärkid:  Kursuse eesmärgiks on süvendada strateegilise juhtimise tudengite teadmisi erinevatest innovatsiooni- ja majanduspoliitika aspektidest, mis mõjutavad nii majanduse konkurentsivõimet kui ka avaliku sektori enda uuendusmeelsust.Learning outcomes/õpiväljund:  Aine eduka sooritamise tulemusena üliõpilane: 1. Mõistab ja analüüsib erinevate avaliku sektori asutuste, organisatsioonide, munitsipaal- või riigiettevõtete innovatsioonivõimekust ning haruspetsiifikat ja pakub lahendusi konkreetse asutuse, riigiettevõtte või valdkonna innovatsioonivõimekuse arendamiseks; 2. Mõistab majandus ja riigijuhtimise tuumikprobleeme ning nende komplekssust, analüüsib ja pakub välja lahendusi innovatsiooni- ja eksperimentaalse majanduspoliitika tööriistakastist. \"Innovatsioon avalikus sektoris ja majanduspoliitika kujundamises\" (4 EAP), loengud 2025 kevadel:\n(1) Trendid ja faktid, mis loovad konteksti nii majanduspoliitikale kui ka innovatsioonile avalikus sektoris (4h)\n(2) Innovatsiooni olemus ja juhtimine era-, avalikus ja vabasektoris (4h)\n(3) Innovatsiooni- ja majanduspoliitika kujundamise tehnikatest teoorias ning praktikas (4h)\n(4) Ettevõtlikkusest, eestvedamisest ja storytellingust muutuste juhtimise kontekstis avalikus sektoris (4h)"}