{"KURSUSE_NIMI": "Teadmuspõhine iduettevõtlus", "KURSUSE_KOOD": "SVMJ.02.005", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "independent_work": 54, "individual_work": 24, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus pakub süsteemset ülevaadet teadmuspõhisest ettevõtlusest, ettevõtlusprotsessist, aitab mõista teadmuspõhise ettevõtte ülesehitust; kuidas luua edukat teadmuspõhist start-up ettevõtet.\nÜliõpilastele tutvustatakse teadmuspõhise ettevõtluse põhimõtteid: ettevõtlusprotsess, ärivõimalused, riskikapital ja tootearendus, ärimudelid, teadmiste edasiandmine ja rahvusvahelistumine, intellektuaalomandi roll, teadmispõhiste ettevõtete edulood.\nKursus keskendub sellele, kuidas luua ja arendada teadmuspõhise start-up projekti ideed; kuidas leida ideede allikaid; kuidas muuta idee ärivõimaluseks, konkreetseteks eesmärkideks ja ärimudeliks; kuidas ideed kaitsta; kuidas leida rahastust jne\nKursus sisaldab selliseid tegevusi nagu: meeskonnatöö, töö kirjandusega, kodutööd, testid, video tegemine jms.Objectives/eesmärkid:  Kursuse eesmärgiks on anda ülevaade teadmuspõhise sektori äriprotsessidest ja -võimalustest, sealhulgas: ülevaade tehnoloogiapõhisest ettevõtlusest, turusuundumused; ärivõimalused; riskikapital ja tootearendus; ärimudelid; teadmiste edasiandmine ja rahvusvahelistumine; intellektuaalomandi roll ja kaitse jne.Learning outcomes/õpiväljund:  A. TEADMISED, üliõpilasel on: Teadmuspõhise ettevõtluse eripärade ja väljakutsete, ettevõtlusprotsessi, teadmuse rolli ettevõtlusprotsessis, ettevõtlusprotsessi tunnused haridussektoris mõistmine. Teadmuspõhise ettevõtte käivitamise protsesside mõistmine, juhtimis- ja tugiprotsesside konkreetsed aspektid, strateegilised variandid ja kasvuteed. B. ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane: Mõistab ja oskab praktikas kasutada teadmuspõhise ettevõtlussektori põhikontseptsioone, terminoloogiat, juhtimis- ja tugiprotsessi konkreetseid aspekte. C. VÕTMEOSKUSED JA PÄDEVUSED, üliõpilane: Oskab analüüsida ja kujundada teadmuspõhist ettevõtlusprotsessi, strateegiat ja ärimudeleid."}