{"KURSUSE_NIMI": "Põhjuse ja tagajärje seosed", "KURSUSE_KOOD": "SVMJ.04.018", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab sissejuhatuse järgmistesse meetoditesse: Rubini mudel; Diferents-diferents hindamine; Tõenäosuspõhine sobitamine; Regressiooni kohandamise (RA), tõenäosuslik pöörd-kaalumine (IPW) and (IPWRA); regressioonikatkestuse meetod; muud hindamis- ja poliitikaanalüüsi meetodid. Peamiselt käsitletakse aines järelhindamiseks rakendatavaid meetodeid, näiteks kontrollitud eksperimendid, pool eksperimentaalsed lähenemised (DiD, RDD, instrumentaalmuutuja), paneel- ja ristandmete regressioonid. Kursuse käigus tutvume nõuetega poliitikakujundamise jaoks kehtivate nõuetega mõjude hindamiseks. Kursuse lõpuks disainivad üliõpilased ise vastavalt uurimisküsimusele parima võimaliku lähenemise mõjude hindamiseks koostades uuringuplaani.Objectives/eesmärkid:  Kursuse põhiliseks eesmärgiks on tutvustada üliõpilastele ja õpetada neid rakendama enim kasutatavaid meetodeid sotsiaalsete fenomenide põhjuslike seoste mõõtmiseks.Learning outcomes/õpiväljund:  Üliõpilased õpivad järgmiste meetodite põhilisi teoreetilisi aluseid ja põhilisi tehnilisi aspekte: Rubini mudel; diferents-diferents hindamine; tõenäosuspõhine sobitamine; regressiooni kohandamise (RA), tõenäosuslik pöörd-kaalumine (IPW) ja (IPWRA); regressioonikatkestuse meetod; muud hindamis- ja poliitikaanalüüsi meetodid. Aine läbinud üliõpilased: *\tTeavad mõjuhindamise peamisi eeldusi uuringute disainimiseks ning rakendamiseks. *\tTunnevad Eesti poliitikakujundamisel kehtivaid nõudeid mõjude hindamiseks. *\tOskavad valida ülaltoodud meetoditest kõige sobivama konkreetse andmestiku ja uurimisküsimuse jaoks. *\tOn võimelised kirjutama koodi Stata tarkvarapaketis genereerimaks kirjeldavaid statistikuid, hindamaks ökonomeetrilisi mudeleid, testimaks hüpoteese. *\tOn arendanud oma oskusi interpreteerimaks statistikuid, ökonomeetrilise mudeli hindamise tulemusi, hüpoteeside testimise tulemusi. *\tTeavad, mis on levinumad probleemid eel- ja järelhindamisel ning mis meetodid võimalikud on.  *\tOskavad kriitiliselt hinnata mõjusid hindavaid uuringuid. *\tOn arendanud oma kriitilist mõtlemist läbi teadusartiklite lugemise ja hindamise."}