{"KURSUSE_NIMI": "Tehnoloogiaettevõtluse baaskursus", "KURSUSE_KOOD": "SVMJ.02.012", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 20, "seminar": 0, "independent_work": 112, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "* Sissejuhatus. Enesereflektsioon - mina ettevõtjana. Ettevõtlusvõimalus, ärikontseptsioon ja strateegia.\n* Firmade ja sektori äri- ja tehnoloogiainfo hankimine. Erinevad ettevõtlusvormid.\n* Ettevõtlusprotsess. \n* Teadmus- ja tehnoloogiasiire, akadeemiline ettevõtlus. \n* Finantsprognooside koostamine. \n* Tehnoloogiafirmade rahvusvahelistumine ja ärimudelid. \n* Tehnoloogiaettevõtluse kogemus ja parim praktika ettevõtja pilgu läbi.\n* Tehnoloogiaettevõtluse kaasused konkreetsete firmade ja ettevõtjate näitel. \n* Oma idee arendamine ja testimine.\nTestitavad moodulid  plokiahela koolituspiloodi jaoks: \nMoodul 0. Digioskuste koolitus (eelteadmised);\nI moodul. Ärimudeli lõuend (BMC);\nII moodul. Kas plokiahel on sobilik? Plokiahela mõju äri jaoks;\nIII moodul. Milline plokiahel ja millised komponendid. Plokiahela tüübid ja komponendid;\nIV moodul. Kas ehitada või taaskasutada? Kasvatage oma plokiahela võimekust;\nV moodul. MVP-st rakendamiseni. V a) Usaldusväärsusega arvestamine. Plokiahel, privaatsus, konfidentsiaalsus ja usaldusväärsus. V b) Infrastruktuuri võimalused ja tõkked. Plokiahela tehnoloogiate integreerimine (valikuline).Objectives/eesmärkid:  Anda ülevaade ettevõtlusprotsessist ja ettevõtlusvõimalustest erinevates tehnoloogiasektorites, sealhulgas ülevaade kaasaegsest teadmus- ja tehnoloogiapõhisest ettevõtlusest (ettevõtte olemusest), ärimudelitest, sektoraalsetest erinevustest, tehnoloogia- ja teadmussiirdest ja rahvusvahelistumisest, eripäradest võrreldes teiste traditsiooniliste ettevõtluse valdkondadega, tehnoloogiaettevõtete rahastamisest, intellektuaalomandi rollist, tootearendusest jne. \"Tehnoloogiaettevõtluse baaskursus\" tõstab kõrghariduse kvaliteeti, tuues ettevõtlusõppesse ja -tugitegevustesse uue komponendi: plokiahela tehnoloogiad. Kursusel testitakse projekti Blockchain Enabling Growth in New Enterprises digitaalseid koolitusmooduleid  Võimaldades tehnoloogia magistriõppe üliõpilastel testida ja saada sellel teemal ainulaadset pilootkoolitust, saavad tehnoloogiaüliõpilased, tulevased alustavad ettevõtjad plokiahela kasutamiseks oskuseid, mida nad vajavad oma ettevõtte kasvatamiseks . \nOma kogemusi vahendavad erinevates tehnoloogiasektorites tegutsevad ettevõtjad ja teadusasutuste töötajad. Kursus optimeeritakse selle läbimiseks digitaalselt, sh  arvutites, tahvelarvutites ja mobiilseadmetes. See kasutab  ära interaktiivsuse ja isikupärastamise kõrget taset, mida tänapäevane digiõpe pakub.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: A. TEADMISED, üliõpilasel on: \nTehnoloogiapõhise ettevõtluse eripärade ja väljakutsete, ettevõtlusprotsessi, teadmuse rolli ettevõtlusprotsessis. Tehnoloogiapõhise ettevõtte käivitamise protsesside mõistmine, juhtimis- ja tugiprotsesside konkreetsed aspektid, strateegilised variandid ja kasvuteed.       \nOskus sõnastada ja arutleda plokiahelate ja detsentraliseerimise rolli üle konkreetsel kasutusjuhul. \n            \nB. ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane: \nMõistab ja oskab praktikas kasutada teadmuspõhise ettevõtlussektori põhikontseptsioone, terminoloogiat, juhtimis- ja tugiprotsessi konkreetseid aspekte.      \nOskab osalejate ja vajaliku detsentraliseerituse taseme põhjal valida vajaliku plokiahela võrgu tüübi.  Oskab tuvastada võimalikke plokiahela tehnoloogiaid või võrgustikke, hinnates nende omadusi, küpsusastet ja muid võimalikke kasutusjuhtumiga seotud riske.\n                                 \nC. VÕTMEOSKUSED JA PÄDEVUSED, üliõpilane: \nOskab analüüsida ja kujundada tehnoloogiapõhist ettevõtlusprotsessi, strateegiat ja ärimudeleid.\nSuudab nõuete põhjal teha otsuse plokiahela rakenduse komponentide taaskasutamise või ehitamise kohta. Oskab hinnata plokiahela lahenduse usaldusväärsust, sh seda, kuidas see vastab privaatsuse ja konfidentsiaalsuse, kasutusjuhtumi ja ärimudeli nõuetele."}