{"KURSUSE_NIMI": "Magistritöö", "KURSUSE_KOOD": "SVMJ.00.017", "EAP": 30, "KURSUSE_TYYP": "Kaitsmisega lõppev aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Magistriseminar"], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 780, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Magistritöö on iseseisev uurimistöö, mille tudeng kirjutab koostöös oma juhendaja või juhendajatega magistritõppekava edukaks lõpetamiseks. Magistritöö teema peab olema seotud õppekava teemadega. Tudeng kaitseb magistritöö komisjoni ees. Magistritöö kaitsmisele eelneb eelkaitsmine.\nMagistritöö koostatakse vastavalt Tartu Ülikoolis kehtivatele nõuetele.Objectives/eesmärkid:  Magistritöö eesmärgiks on valmistada tudeng ette akadeemiliseks karjääriks. Eesmärk on demonstreerida tudengi võimekust läbi viia individuaalset uurimistööd lähtudes õppekava teemadest ja teadustöö põhimõtetest. Magistritöö eesmärk on arendada tudengi võimekust püstitada teaduslikust huvist ja vajadusest lähtuv uurimisküsimus, positsioneerida uurimisteema akadeemilise kirjanduse raames, arendada andmete kogumise ja kriitilise analüüsimise oskust ja akadeemilise kirjutamise oskust.Learning outcomes/õpiväljund:  Kaitstud magistritöö tõendab, et tudeng on suuteline - looma realistliku uurimiskava oma uurimistöö teemal; - koguma, organiseerima ja läbi töötama töö teema seotud akadeemilist kirjandust; - määratlema ja koguma uurimisandmeid (nt originaalkeelsed allikad, memuaarid, intervjuud, meediatekstid, arhiivimaterjalid, valitsusdokumendid); - mõistma ja välja valima sobiliku metodoloogia oma uurimistöö jaoks; - rakendama oma uurimistöös korrektselt neid meetodeid (nt. ajalooline analüüs, kontentanalüüs, diskursuseanalüüs, küsimustikud, intervjuud, osalusvaatlus); - organiseerima oma andmestikku ja analüüsima oma uuringutulemusi; - kokku kirjutama originaalsed uurimistulemused, presenteerides selgelt metodoloogiat ja sellekohast tulemuste analüüsi akadeemilisele ja erialasele auditooriumile; - olema enesekriitiline oma tulemuste analüüsimisel ja uurimistöö piirangute hindamisel. A Master's Thesis can be admitted to final defense:\n- if the supervisor of the thesis agrees that the thesis is ready to defend\n- if there is no plagiarism according to the rules of UT on academic fraud"}