{"KURSUSE_NIMI": "Andmed ja tõenäosused", "KURSUSE_KOOD": "SVMJ.04.016", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 18, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 112, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Käsitletakse statistika üldteooria põhimõisteid ja -meetodeid.\nTutvustatakse valimvaatluse aluseid.\nUuritakse majandus- ja sotsiaalelu protsesside ja nähtuste statistilise üldistamise ning analüüsimise erinevaid meetodeid.\nKäsitletavad meetodid:\nAndmete ja meetodite tüübid;\nKirjeldav statistika;\nHüpoteeside testimine ja tulemuste laiendamine üldkogumile;\nKeskväärtuste võrdlemine, dispersioonanalüüs jm mitteparameetrilised testid keskmiste võrdlemiseks;\nNähtustevaheliste seoste analüüs, parameetrilised ja mitteparameetrilised testid.Objectives/eesmärkid:  Kursus annab teadmisi kuidas defineerida ja lahendada uurimisküsimusi, mida saab lahendada kasutades statistilist analüüsi. Kursus annab oskusi ja kogemusi majandus- ja sotsiaalprotsesside statistiliseks analüüsiks. Käsitletakse peamisi statistilise analüüsi samme nagu uurimisprobleemi defineerimine, andmeanalüüs ja tulemuste tõlgendamine.Learning outcomes/õpiväljund:  Kursus annab üliõpilasele: Oskuse formuleerida probleeme, milledele lahenduste otsimisel saab kasutada parameetrilisi ja mitteparameetrilisi statistilisi meetodeid. Teadmised olulisematest parameetrilistest ja mitteparameetrilistest andmeanalüüsi meetoditest, nende rakendamist ning tulemuste sisulisest tõlgendamisest. Oskuse ja esmased kogemused läbi viia parameetrilist ja mitteparameetrilist andmeanalüüsi ning tulemuste sisulise tõlgendamise kohta. Oskuse sisuliselt tõlgendada statistilise analüüsi tulemusi, neid üldistada ning analüüsida tulemuste vastavust püstitatud uurimisküsimustele. Õppetöö viiakse läbi nii auditoorselt kui e-õppena. E-õppe platvormidena kasutatakse Moodle ja BigBlueButton keskkonda."}