{"KURSUSE_NIMI": "Tehnoloogia kommertsialiseerimine ja akadeemiline ettevõtlus (seminar)", "KURSUSE_KOOD": "SVMJ.02.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 0, "seminar": 0, "independent_work": 138, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sissejuhatus. Teadmus- ja tehnoloogiasiire, T&A kommertsialiseerimine ja akadeemiline ettevõtlus.\nFirmade ja sektori äri- ja tehnoloogiainfo hankimine ja teostatavus-tasuvusuuringud.\nEttevõtlus- ja innovatsiooniprotsess.\nTehnoloogiafirmade rahvusvahelistumine ja ärimudelid.\nTehnoloogia-ettevõtjate kogemuste tutvustus. \nTehnoloogiaettevõtluse kaasused.Objectives/eesmärkid:  Aine eesmärgiks on anda ülevaade T&A projekti teostatavus-tasuvus-analüüsi (TTA) metoodikast ja kommertsialiseerimisest tehnoloogiasektoris, sealhulgas ülevaade kaasaegsest teadmus- ja tehnoloogiapõhisest akadeemilisest ettevõtlusest, ärimudelitest, sektoraalsetest erinevustest, teadmussiirdest ja rahvusvahelistumisest, tehnoloogiaettevõtete rahastamisest, intellektuaalomandi rollist, tootearendusest, jne. Oma kogemusi vahendavad tehnoloogiasektoris tegutsevad (akadeemilised) ettevõtjad, teadlased ja tehnosiirde eksperdid.Learning outcomes/õpiväljund:  A. TEADMISED\nÜliõpilasel on:\n- arusaamine T&A projektide sotsiaalmajanduslikust potentsiaalist, akadeemilise (tehnoloogia)ettevõtluse eripäradest ja väljakutsetest, teadmus- ja tehnosiirdest, spin-off ettevõtlusprotsessist, T&A koostööst ettevõtetega; \n- ülevaade tehnoloogiaettevõtete arengu sektoraalsetest seaduspärasustest, ettevõtete olukorrast maailmas ja Eestis, trendidest turul; \n- ülevaade ärivõimalustest Eestis ja globaalselt.\n\t\nB. ERIALASED OSKUSED JA PÄDEVUSED\nÜliõpilane orienteerub T&A ning tehnoloogiaprojektide TTAs, tehnoloogiaettevõtte ärikontseptsioonides, T&A kommertsialiseerimises, oskusteabe kaitses ja valdkonna põhimõistetes \n\nC. VÕTMEOSKUSED JA PÄDEVUSED\nÜliõpilane:\n- oskab analüüsida ja kujundada T&A projekti sotsiaal-majanduslikku tasuvust läbi teadmussiirde ja spin-off ettevõtluse protsessi;\n- oskab analüüsida ja kujundada ettevõtte strateegiat ja äriplaani ning ärimudelit tehnoloogia ettevõttes."}