{"KURSUSE_NIMI": "Ettevõtte kasvustrateegiad", "KURSUSE_KOOD": "SVMJ.03.006", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kuna kasv on tänases ärikeskkonnas peaaegu nõue, siis on vaja mõista kasumliku kasvu strateegilisi aluseid. Kursus ühendab kontseptsioonid majandusteadusest, strateegiast ja juhtimisest ettevõtete praktiliste näidetega, illustreerimaks seda, miks mõned ettevõtted kasvavad edukalt ja teised mitte. Näited ja kaasused pärinevad stabiilselt tegutsevatest ettevõtetest (mitte start-up'dest) ja turuliidritest, kes püüavad oma tegevust laiendada. Kursus algab ettevõtte elutsükli teooria ja kasvu tähenduse lahti mõtestamisega. Kasvustrateegiatest käsitleme kasvu läbi skaleerimise, kasvu läbi uuele turule sisenemise (sh rahvusvahelistumine) ja kasvu läbi strateegilise partnerluse ning omandamise. Igal strateegial on omad ohud ning nendega toimetulek on kursuse läbiv teema.Objectives/eesmärkid:  Kursuse eesmärk on anda üliõpilastele teadmised ja oskused mõistmaks, miks mõned ettevõtted kasvavad ja kuidas kasv saavutatakse. Käsitletakse kasvu eri vorme ning protsessi ning nende juhtimist, andes sellekohase põhjaliku teoreetilise tausta. Lisaks annab kursus analüüsi- ja toimetulekumudelid kasvuga seotud probleemides.Learning outcomes/õpiväljund:  Peale kursuse läbimist üliõpilane:  * teab kasvava ja mittekasvava ettevõtte tunnuseid;  * suudab kriitiliselt analüüsida keerulisi kasvuga seotud situatsioone ettevõtte arengus;  * oskab hinnata strateegiliste ressursside ja võimekuste vajadust kasvu tagamiseks;  * omab ülevaadet eri kasvustrateegiatest ning oskab kriitiliselt hinnata nende sobivust konkreetse ettevõtte kontekstis;  * suudab analüüsida ja prognoosida kasvust tingitud probleeme;  * oskab analüüsida, hinnata ja soovitada konkreetseid tegevusi ettevõttele, et see kasvataks oma väärtust ning väldiks tüüpilisi kasvust tingitud probleeme."}