{"KURSUSE_NIMI": "Rahvusvaheline ja ärilt-ärile turundus", "KURSUSE_KOOD": "SVMJ.07.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 2, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 120, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine käigus tuuakse esmalt välja välisturule sisenemise põhjused ja võimalused. Tähelepanu pööratakse nii sihtriigi valikuga seonduvale probleemide ringile kui ka rahvusvahelisele turule sisenemise erinevatele meetoditele (eksportimine, investeerimine, lepingulised meetodid) ja rahvusvahelisel turul tegutsemise strateegiatele. Seejärel käsitletakse turundusmeetmestiku kohandamisega seonduvaid teemasid arvestades riikide majanduslike, poliitiliste ja kultuuriliste erinevustega. Tähelepanu pööratakse ka ärilt-ärile turunduse eripäradele. Kursuse raames kasutatakse rohkesti näidete analüüsi, millega püütakse arendada rahvusvahelises turunduses vajalikke oskusi.Objectives/eesmärkid:  Annab võimaluse teadmiste omandamiseks rahvusvahelise turunduse põhialustest ja aitab kujundada oskused tegutsemiseks välisturgudel.Learning outcomes/õpiväljund:  Kursuse edukalt läbinu: \n* omab ülevaadet rahvusvahelise turunduse peamistest teooriatest ja printsiipidest;  \n* tunneb välisturgudele sisenemise ja tegutsemise erinevaid meetodeid; \n* mõistab turundusmeetmestiku kasutamise iseärasusi erineva sotsiaal-kultuurilise taustaga riikides nii ärilt-kliendile kui ka ärilt-ärile suunal; \n* oskab teha välisturgude võrdlevanalüüsi, koostada välisturule sisenemise kava ning on suuteline kokku panema turundusmeetmestiku erinevates sotsiaal-kultuurilise taustaga riikides toodete või teenuste turundamiseks;\n* oskab turundusmeetmestikku rakendada nii ärilt-kliendile kui ka ärilt-ärile suunal; \n* oskab kriitiliselt analüüsida rahvusvahelise turundusega seotud olukordi ning valida sobivaid meetmeid probleemide lahendamiseks; \n* suudab pidada rahvusvahelisi äriläbirääkimisi."}