{"KURSUSE_NIMI": "Ettevõtlusprojektid I", "KURSUSE_KOOD": "SVMJ.02.016", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 13, "practice": 0, "seminar": 23, "independent_work": 120, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Käsitletavad teemad: võimaluste äratundmine; ettevõtlusprotsess; uued ärimudelid; ringmajandus; kaugtöö; ettevõtlusprojekti planeerimine ja juhtimine individuaalselt, case-study'na ja/või tiimitööna; ärianalüüs, organisatsioonisisene ettevõtlus, tootearenduse algtõed, jätkusuutlik ettevõtlus, ettevõtte toimimise protsess, digitaalsete keskkondade kasutamine õpetamisel. Oskab kasutada digitaalseid ettevõtluse õppematerjale. Objectives/eesmärkid:  Aine eesmärgiks on anda ülevaade ettevõtlusprotsessist ja ettevõtlusvõimalustest erinevates sektoris, ärimudelitest, sektoraalsetest erinevustest, teadmussiirdest ja rahvusvahelistumisest, eripäradest võrreldes teiste traditsiooniliste ettevõtluse valdkondadega, tehnoloogiaettevõtete rahastamisest, intellektuaalomandi rollist, tootearendusest. Oma kogemusi vahendavad tegutsevad ettevõtjad.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse edukalt läbinu: \n* omab ülevaadet ettevõtlusest kui interdistsiplinaarsest õpetusest ja sotsiaalsest nähtusest ühiskonnas;  \n* mõistab ettevõtluse põhikontseptsioone;  \n* saab aru ettevõtlusprotsessist, ettevõtja strateegilistest valikutest, ja selle erinevatest rakendustest, ettevõtte vormidest, alustava ettevõtte käivitamisest ja rahastamisest, kasvuorientatsiooniga VKE juhtimisest, ettevõtluse rakendusest (suur)ettevõttes ja avalikus ning mittetulundussektoris;  \n* saab aru äri ja VKE analüüsi ning planeerimise, turunduse, juhtimisarvestuse ja rahastamise rollist ettevõtluses;  \n* oskab analüüsida kaasaegseid ettevõtlusprotsesse ja nende juhtimise spetsiifikat ettevõttes/organisatsioonis/ühiskonnas;  \n* oskab analüüsida ettevõtluskeskkonda ja kavandada ettevõttele sobivaid ärimudeleid ja ettevõtte (juriidilist) vormi;   \n* oskab analüüsida ettevõtlusprotsessi ja kujundada strateegiat ning ärimudeli ja äriplaani teadmus- ja tehnoloogiaettevõttes."}