{"KURSUSE_NIMI": "Tehnoloogiaettevõtlus", "KURSUSE_KOOD": "SVMJ.02.004", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 116, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Sissejuhatus. Ettevõtlusvõimalus, ärikontseptsioon ja strateegia.\nEttevõtete ja sektori äri- ja tehnoloogiainfo hankimine.\nEttevõtlusprotsess.\nTeadmus- ja tehnoloogiasiire, akadeemiline ettevõtlus.\nTehnoloogiafirmade rahvusvahelistumine ja ärimudelid.\nTehnoloogiaettevõtluse kogemus ja parim praktika ettevõtja pilgu läbi.\nTehnoloogiaettevõtluse kaasused konkreetsete firmade ja ettevõtjate näitel.\n\nARVESTUSObjectives/eesmärkid:  Aine eesmärgiks on anda ülevaade ettevõtlusprotsessist ja ettevõtlusvõimalustest tehnoloogiasektoris, sealhulgas ülevaade kaasaegsest teadmus- ja tehnoloogiapõhisest ettevõtlusest, ärimudelitest, sektoraalsetest erinevustest, teadmussiirdest ja rahvusvahelistumisest, eripäradest võrreldes teiste traditsiooniliste ettevõtluse valdkondadega, tehnoloogiaettevõtete rahastamisest, intellektuaalomandi rollist, tootearendusest jne. Oma kogemusi vahendavad tehnoloogiasektoris tegutsevad ettevõtjad.Learning outcomes/õpiväljund:  A. TEADMISED, üliõpilasel on: Arusaamine tehnoloogiaettevõtluse eripäradest ja väljakutsetest, ettevõtlusprotsessist, tehnoloogia rollist ettevõtlusprotsessis.  Ülevaade tehnoloogiaettevõtete arengu seaduspärasustest, ettevõtete olukorrast maailmas ja Eestis, trendidest turul. Ülevaade ärivõimalustest: Eestis ja globaalselt.  Arusaamine tehnoloogiaettevõtte käivitamisest,  rahastamisest, juhtimis- ja tugiprotsesside eripäradest, strateegilistest valikutest ja kasvuvõimalustest. B. ERIALASED OSKUSED JA PÄDEVUSED, üliõpilane: Orienteerub tehnoloogiaettevõtte ärikontseptsioonides ja valdkonna põhimõistetes  C. VÕTMEOSKUSED JA PÄDEVUSED, üliõpilane: Oskab analüüsida ja kujundada tehnoloogia- ja teadmuspõhist ettevõtlusprotsessi ja ettevõtte strateegiat ning ärimudelit tehnoloogia-ettevõttes."}