{"KURSUSE_NIMI": "Riskide juhtimine", "KURSUSE_KOOD": "SVMJ.06.015", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kogenud praktikud:  käsitlevad riskide liike ja nende juhtimise protsessi: riskide tuvastamist, -hindamist ning haldamist. Sealhulgas käsitletakse peamisi küberturvalisuse raamistikke ja mõisteid. Uuritakse kuidas toimib riskijuhtimise protsess ettevõttes ja milline on siseaudiitori roll selles. Käsitletakse maksukorralduse ja -poliitika liike ja põhimõtteid, ning maksusüsteemide erinevusi ja sarnasusi Eesti vs. teiste riikide vahel. Analüüsitakse rohepöörde ja talendisõjaga kaasnevaid riske ja nende maandamise võimalusi.Objectives/eesmärkid:  Aine eesmärgiks on koostöös audiitor- ja nõustamisfirmadega anda õppijatele süsteemne ja praktiline ülevaate  riskijuhtimise valdkondadest:  arvestussüsteemi korraldamine ja andmete avalikustamine, küberriskid,  piiriülese tegevuse juriidilised riskid,  rahvusvahelise talendisõja ja rohepöörde riskid, sotsiaalsete riskide juhtimine ja aruandlus. Fookuses on riskide tuvastamise ning maandamise võimalused.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse edukalt läbinu: \n* teab äririskide juhtimise eesmärke, protsessi ja põhimõtteid;  \n* mõistab, kuidas tuvastatakse riskid ja kuidas on siseaudiitor seotud riskide juhtimisega;\n* teab, kuidas ja millised olulisemad küberturvalisuse aspektid mõjutavad ettevõtte tegevust (sh finantsjuhtimist).\n* teab erinevusi ja sarnasusi Eesti vs. teiste riikide maksusüsteemide vahel; mõistab välistööjõuga kaasnevaid maksuriske ja -erinevusi;\n* teab ESG kontseptsiooni ning EL-i regulatsioone ja muudatusi ja oskab nendega arvestada;\n* teab, milliste juriidiliste vaidlustega võib (finants)juht kokku puutuda; \n* teab, miks on talendirisk äririskidest tõusnud esikohale ja teab viise nende teadlikuks juhtimiseks;\n* mõistab andmekaitset ja compliance'it üldiselt; \n* on teadlik riskijuhtimise tegevuse eetilistest aspektidest, võimalustest, piirangutest; Õppetöö on planeeritud veebiloengutena ning ühe kontaktseminari sessioonina Tartus, kus üliõpilased lahendavad  elulisi kaasuseid riskide juhtimise teemadel."}