{"KURSUSE_NIMI": "Creative Destruction Lab praktikaklass iduettevõttega", "KURSUSE_KOOD": "SVMJ.00.032", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 60, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 0, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Creative Destruction Lab praktikaklass iduettevõttega on tehnoloogilise innovatsiooni kommertsialiseerimise praktiline läbi tegemine. Üliõpilased, kel on piisav teoreetiline ettevalmistus iduettevõte strateegiast, skaleerimisest ja rahastamisest, rakendavad seda konkreetse CDL programmis osaleva iduettevõtte jaoks. Üliõpilane on pidevas kontaktis nii ettevõttega (kuigi see pole klassikaline praktika), mentoritega kui ka investoritega. Üliõpilane lahendab vastavalt konkreetse iduettevõtte ees seisvatele väljakutsetele järgmisi ülesandeid:\n1. selgitada välja, kas ja kuivõrd luuakse klientidele väärtust,\n2. kuidas väärtuse loomine pöörata rahaks,\n3. mis on eksperimenteerimise roll iduettevõtluses,\n4. mille poolest on kasvuettevõtte rahastamine eriline,\n5. kuidas määratleda turu suurust ja uue toote potentsiaali,\n6. kuidas arvutada ettevõtte väärtust,\n7. kuidas piloteerida, testida ja juhtida varaseid kliendikontakte,\n8. millised hinnastamise mudelid ja strateegiad eksisteerivad ning kuidas nende vahel valida.\n\nKursusel osalevale üliõpilasele on seatud kõrged ootused, sest programmis arendatakse reaalset iduettevõtet, kes ootab ja vajab tegelikku abi, ning peale kursuse läbimist peaks üliõpilane olema iseseisvalt valmis osalema iduettevõtluse ökosüsteemis. Igaks kohtumiseks eeldatakse põhjalikku ettevalmistust, ülesanne defineeritakse ettevõtte ja mentorite poolt. Aasta jooksul külastavad programmis osalejaid tuntud riskikapitalistid ja iduettevõtete loojad.Objectives/eesmärkid:  Creative Destruction Lab praktikaklass iduettevõttega on 6 EAP-ne ettevõtlusalane kursus kahes osas, kus üliõpilased töötavad Creative Destruction Lab (CDL) Eesti meeskonnaga digitaalse ühiskonna iduettevõtte arendamise eesmärgil. Kursuse läbimine annab üliõpilasele ettevalmistuse edaspidi iseseisvalt iduettevõtluses osalemiseks, sest läbitakse praktiliselt ettevõtte loomise, rahastamise ja juhtimise etapid koos programmi hoolikalt valitud ambitsioonika iduettevõtte, rahvusvaheliste rahastajate ja mentoritega.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Peale kursuse läbimist üliõpilane oskab\n- koostada turuanalüüsi,\n- formuleerida ja kommunikeerida väärtuspakkumist ning äriplaani,\n- koostada tootearendusplaani koos ellu viimiseks vajalike organisatsiooniliste elementidega."}