{"KURSUSE_NIMI": "Läänemere regiooni majanduskeskkond", "KURSUSE_KOOD": "SVMJ.05.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursuse annab ülevaate majanduskeskkonna teoreetilisest käsitlusest, lähtudes Läänemere regiooni riikide eripärast. \nMajanduskeskkonna olemust selgitatakse erinevate komponentide lõikes nagu etttevõtte tegevuse eesmärk, ühiskonna majandusressursid (näit. loodusvarad, tööjõud jne), tegevusvaldkonnad (näit. tööstus, IT ),  konkurentsivõime,  regulatiivne keskkond,  väliskaubandus ja -investeeringud, infrastruktuur, enegeetika jm. \n\nKursuse raames selgitatakse regiooni riikide majanduses toimunud struktuurseid muutusi erinevates majandussektorites ning selgitatakse majandusintegratsiooni erinevaid aspekte (väliskaubandus, investeeringud, energiasektor, infrastruktuur jm). \nSamuti analüüsitakse erinevate riikide majanduspoliitikaid (rahapoliitika, fiskaalpoliitika, energiapoliitika, tööhõivepoliitika, sotsiaalpoliitika, jm).\nKursus käsitleb ka regionaalset koostööd Euroopa Liidu Läänemere strateegia raames.Objectives/eesmärkid:  Ettevõtted ei tegutse vaakumis, vaid teatud majandustingimuste raamistikus. Sellised majandustingimused (mikro- ja makromajanduslikud, sotsiaalsed ja tehnoloogilised jm) moodustavad tervikliku äritegevuse raamistiku, mida nimetame üldistatult majanduskeskkonnaks.  Kursusel on kaks omavahel seotud eesmärki.  1)\tanda teoreetiline ülevaade  majanduskeskkonna olemusest ja   selle komponentidest Läänemere regioonis Kursus paneb aluse ettevõtluskeskkonna kui terviku mõistmisele  ja toob esile selle  seosed erinevate majandusdistsipliinidega.  2)\tselgitada majanduskeskkonna spetsiifikat Läänemere regiooni näitel.  Regiooni riike (10 riiki) käsitletakse kui ühtset majandusruumi.  See tuleneb praktilisest vajadusest anda tudengitele esmane süsteemne teave erinevate regiooni riikide  majanduskeskkonnast. Suurem osa programmi läbinuid tudengeid asub tööle regiooni riikides. Paljude välistudengitel puudub eelnevalt igasugune süstematiseeritud teave piirkonna eripära ja  majanduskeskkonna kohta. Kursusel on ka otsene praktiline eesmärk tudengite ettevalmistamisel töötamiseks regiooni riikides.Learning outcomes/õpiväljund:  Kursuse läbinud tudengid peavad omandama tervikliku arusaama  majanduskeskkonna olemusest ning  oskama välja tuua Läänemere regiooni riikide majanduskeskkonna eripära.  . \n\nAine läbinud üliõpilane:\n1) tunneb majanduskeskkonna teoreetilise käsitlusega seotud peamisi mõisteid;\n2) kasutab statistilisi andmeid ning iseloomustab ja üldistab nende alusel regiooni majandusprotsesse;  \n3) selgitab Läänemere  majandusregiooni kui terviku kujunemise mehhanisme ja arengut;  \n4) tunneb Läänemere regiooni riikide majanduste struktuuri, üldisi arengutrende  ja riikide majanduspoliitikat;\n5) oskab selgitada regiooni riikide majanduspoliitilisi valikuid (näiteks fiskaal- või rahapoliitika) ja seostab vastava teoreetilise  käsitlusega; \n6) oskab analüüsida riikide majanduslikku konkurentsivõimet ja selle komponente;"}