{"KURSUSE_NIMI": "Regressioonid ja hüpoteeside testimine", "KURSUSE_KOOD": "SVMJ.04.017", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 10, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Regressioonimudelite kasutamine sotsiaalmajanduslikke protsesse iseloomustavate andmete analüüsimisel ja uurimishüpoteeside testimisel. Õppeaine läbimise käigus tuleb koostada  empiiriline projekt ning diskuteerida probleemiseadeid ja uurimistulemusi. Projekti koostamise käigus omandatakse teadmisi, oskusi ja  kogemusi sobivate probleemiseadete ja uurimishüpoteeside püstitamiseks, vajalike andmete kogumiseks ja  süstematiseerimiseks, regressioonimudelite hindamiseks ja statistiliseks analüüsiks ning regressioonianalüüsi tulemuste sisuliseks tõlgendamiseks ja diskuteerimiseks. Omandatakse ka oskusi ja kogemusi sobiva arvutitarkvara kasutamiseksObjectives/eesmärkid:  Omandada esmased teadmised ja oskused, mis võimaldavad kasutada regressioonanalüüsi meetodeid majandus- ja sotsiaalprotsesse iseloomustavate andmete analüüsimisel,  uurimishüpoteeside formuleerimisel ja testimisel ning analüüsitulemuste sisulisel tõlgendamisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija on: Teadmised regressioonimudelite formuleerimiseks, hindamiseks ja regressioonianalüüsi tulemuste sisuliseks tõlgendamiseks ning uurimishüpoteeside testimiseks.  Oskus formuleerida ja diskuteerida uurimishüpoteese, millede testimisel saab kasutada regressioonanalüüsi. Oskus leida ja kasutada regressioonanalüüsi läbiviimiseks vajalikke andmeid. Teadmised ja oskused hinnata ja analüüsida regressioonimudeleid kasutades selleks sobivat tarkvara.  Oskused ja esmased kogemused  regressioonianalüüsi kasutamiseks empiiriliste projektide  tegemisel ning uurimistulemuste diskuteerimisel."}