{"KURSUSE_NIMI": "Tulevikumõtlemine ja tulevikustsenaariumite arendamine", "KURSUSE_KOOD": "SVMJ.04.031", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Tulevikumõtlemise kursus annab põhjaliku ülevaate erinevate strateegiate ja metoodikate kohta tulevikutrendides ja määramatustes navigeerimiseks. Kursus hõlmab tulevikutrendide analüüsimist, nõrkade ja tugevate tulevikusignaalide märkamist, kognitiivsete eelarvamuste ületamist ning alternatiivsete vaatenurkade kujundamist stsenaariumite planeerimise kaudu. Õpitavaid teemasid aitavad kinnistada koostööpõhised tulevikuharjutused ja praktiline kursuse projekt.Objectives/eesmärkid:  Selle kursuse eesmärk on varustada õppijaid teadmiste, tööriistade ja metoodikatega tulevikumõtlemise suunal, kujundamaks proaktiivset valmisolekut tuleviku suunal alternatiivide stiilis \"mis siis kui..?\" mõtlemise läbi.Learning outcomes/õpiväljund:  Kursuse lõpuks:\n1. Suudavad õppijad osavalt töötada erinevate allikatega, kriitiliselt hinnata erinevate allikate usaldusväärsust, oskavad koostada kirjanduse ülevaateid, ning näitavad vilumust automatiseeritud viitamistarkvara kasutamisel.\n2. Omavad õppijad põhjalikku ülevaadet tulevikuga seotud põhikontseptsioonidest ja metoodikatest, võimaldades neil analüüsida ja tõlgendada tulevikutrende, signaale ning tuvastada kriitilisi määramatusi.\n3. Omandatakse praktilised oskused erinevate tööriistade ja tehnikate kasutamisel tulevikku suunatud mõtlemiseks, sealhulgas stsenaariumite planeerimiseks.\n4. Kujundatakse kriitilise mõtlemise ja strateegilise tulevikumõtlemise võimekust, võimaldades õppijatel hinnata uute tehnoloogiate, sotsiaalsete muutuste ja globaalsete sündmuste potentsiaalseid mõjusid erinevatele sektoritele.\n5. Läbi kursuse projekti ja erinevate harjutuste rakendatakse omandatud teadmisi ja oskusi reaalsetes stsenaariumides ning arendatakse tõhusaid suhtlusstrateegiaid tulevikuprognooside edastamiseks erinevatele osapooltele."}