{"KURSUSE_NIMI": "Privaatsus ja andmekaitse - eetilised, õiguslikud ja IT aspektid", "KURSUSE_KOOD": "SVMJ.08.027", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 4, "seminar": 32, "independent_work": 108, "individual_work": 12, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tutvustab erinevaid digitaliseerimisega seonduvaid regulatsioonistrateegiaid, teooriaid, instrumente, institutsioone ja protsesse. Digitaliseerimise ja küberturvalisusega seotud küsimusi vaadeldakse läbi erinevate huvi(gruppi)de, initsiatiivide ja eesmärkide. Samuti uuritakse regulatsiooniteooria arengut ja erinevate regulatsioonimudelite ja -vahendite kasutamist seoses digitaliseerimise ja innovatsiooniga kaasnevate probleemide ja võimalustega. Objectives/eesmärkid:  Digitaalne transformatsioon, andmemajandus ja küberohud on arenenud infoühiskondades tekitanud vajaduse uute ja senisest tõhusamate regulatsioonimudelite järele. Samas on kasvamas innovatsiooni, andmetöötluse ja info- ja kommunikatsiooni tehnoloogia kasutamisega seonduvad erimeelsused eri maailmavaadetega ja eri arengutasemega, aga ka majanduslikult konkureerivate riikide vahel. Aine eesmärgiks on toetada strateegilist ja laiapõhjalist lähenemist digireguleerimisele.Learning outcomes/õpiväljund:  Kursuse edukalt läbinu:  *\tomab ülevaadet digiregulatsiooni peamistest valdkondadest ja arenguetappidest; *\ttunneb kaasaegseid regulatsiooniteooriaid ja oskab neid rakendada digitaliseerimise, andmemajanduse ja küberjulgeolekuga seonduvatele probleemidele; *\tomab ettevalmistust regulatsioonivõimaluste tuvastamiseks ja erinevate regulatsioonieelistuste vahel ühisosa leidmiseks. Individual lessons take place on weeks 29, 31 and 33 (Thursdays 12:15-13:45) on zoom. These will be open to pre-registered students and will cover additional topics like legal drafting, selected court cases related to digital regulation and comparative regulation looking into how other countries deal with digitalization and cybersecurity in their domestic law. Individual lessons also have Q&A sessions that can be used for consultation and feedback purposes."}