{"KURSUSE_NIMI": "Praktiline internetiturundus", "KURSUSE_KOOD": "SVMJ.09.009", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 18, "practice": 0, "seminar": 0, "independent_work": 60, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine läbinud tudeng omandab teadmised peamistest praktilistest meetoditest, mida kasutatakse tänapäeva internetiturunduses. Läbitavate teemade hulka kuuluvad veebilehe disain, otsingumootori turundus, sotsiaalmeedia turundus, e-kirja turundus ja veebikeskne sisuloome. Aine rõhuasetus on rohkem sotsiaalmeedia turunduse kasutamisel, pidades silmas asjaolu, et just see on kriitilise tähtsusega tänases internetiturunduse strateegias.Objectives/eesmärkid:  Tudeng omandab põhiteadmised tänapäeva internetiturunduse enim kasutatud kontseptsioonidest ja tööriistadest.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: - teab ja oskab välja tuua mis on kõige olulisemad internetiturunduse strateegia komponendid, - oskab luua kvaliteetset veebilehte ja hinnata teisi veebilehti, - teab \"funnel theory\" rakendamise pritsiipe internetiturunduse strateegias, - oskab rakendada otsingumootori turunduse peamiseid põhimõtteid, - mõistab kuidas kasutada sotsiaalmeedia ökosüsteeme, - oskab luua sotsiaalmeedia kampaaniaid ja neid ellu viia. The course will start on the 1st of March and run until the end of April. The course consists of video lectures and is therefore a fully online course. A new video lecture will be uploaded to Moodle every week. Some longer videos will also be available in a more comfortable shorter video, that adds up to the longer lecture. You can view these lecture at any time you wish. So you are not confined to a specific day or time. The only limiting factor is the tests You need to take a Moodle test for every topic. These tests have to be taken on each of the respective weeks when that topic video lecture is made public. So you need to look at the lecture videos every week and take one test, but the day and time you do it, on that week is up to you."}