{"KURSUSE_NIMI": "Infosüsteemid ettevõtjale", "KURSUSE_KOOD": "SVNC.00.097", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "1. Infosüsteemid (globaalses) maailmas.\n2. Infosüsteemid organisatsioonis. Organisatsiooni analüüs ja toimimsprotsessid, põhi- tugifunktsioonid.\n3. Tehnoloogiline infrastruktuur organisatsioonis ja infosüsteemide korralduses.\n4. Sotsiaalsed, eetilised ja turvalisusega seotud aspektid.\n5. Infosüsteemide arendus ja juurutusprojekt, rahvusvaheline dimensioon.\n6. Avaliku ja erasektori infosüsteemid, andmebaasid.\n7. Infosüsteemid otsustusprotsessides.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade infosüsteemide rollist kaasaegses organisatsioonis. Tutvustatakse infosüsteemide tüüpe, arendust ja haldust.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane:\n- tunneb ja oskab kasutada infosüsteemide ja andmebaasidega seotud põhimõisteid\n- teab infosüsteemide rolli kaasaegses organisatsioonis\n- oskab nimetada põhilisi probleeme seoses infosüsteemide eetilisuse ja privaatsusküsimustega\n- oskab pakkuda lahendusi andmete kaitsmiseks\n- teab, miks on andmete haldamine kaasaegses organisatsioonis keeruline ja samas oluline\n- teab organisatsiooni põhiprotsesse toetavate infosüsteemide põhilisi tüüpe ja nende üldist toimimisloogikat\n- teab organisatsiooni tugiprotsesse toetavate infosüsteemide põhilisi tüüpe ja nende üldist toimimisloogikat\n- analüüsib infosüsteemide tüüpide peamisi funktsioone ja oskab määratleda infosüteemide eesmärke\n- teab avaliku sektori infosüsteemide õigulikke ja talituslikke eripärasid\n- teab, mis on organisatsiooni IT infrastruktuur, oskab kirjeldada selle toimimist ja haldust\n- tunneb infosüsteemide elukäiku ja oskab seda näidete varal analüüsida\n- tunneb infosüsteemi arendusprojekti läbiviimist: projekti etappe ning etappidega seotud tegevusi ja rolle."}