{"KURSUSE_NIMI": "Eesti keele tüvitekstid", "KURSUSE_KOOD": "SVNC.00.113", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 5, "practice": 0, "seminar": 40, "colloquium": 0, "web_learning": 0, "independent_work": 33, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kultuuri tundmine tüvitekstide kaudu on oluline inimese tunnetuslikus arengus ning tema maailmapildi kujunemises. Kultuuri tundmine tüvitekste mõistes on tähtis inimese sotsialiseerumisel, tema kujunemisel ühiskonna tegusaks liikmeks. Kultuuri peamine kandja on keel, mida on vaja pidevalt arendada, sest sotsiaalne kirjaoskus tähendab kriitilist ja teadlikku toimimist keele toel nii isiklikus kui avalikus sfääris, erinevatel kultuurimaastikel.\nErinevatest kultuuriruumidest inimestele on omased kindlad arusaamad kultuurist ja selle traditsioonidest. Seepärast on vaja õpetada erinevatest kultuuritavadest arusaamist.\nKultuuri õpetamisel on vaja integreeritud lähenemist õppeainesse, mis hõlmaks keelt, kirjandust, kujutavat kunsti, muusikat, käsitööd, sporti jne. Kultuuriloo tüvitekstide  kaudu on vaja kasvatada säästlikku ja austavat suhtumist kultuuriväärtustesse ning see hõlbustab erinevast rahvusest eestimaalaste üksteisemõistmist.Objectives/eesmärkid:  1) anda ülevaade  tuntumatest eesti kultuurisündmustest ja kirjandusteostest läbi aegade ning nende seostest maailmakultuuriga; 2) tutvustada eestlaste tuntumaid tüvitekste, analüüsida populaarseid kirjandusteoseid, filme, teatritükke, laule jne;  3) arendada mõtlemisvõimet tekstianalüüsi kaudu, suhtlusoskust, enesetunnetust ja identiteeti; 4) anda teadmised Eesti piirkondlikest kultuurierinevustest, millega peab arvestama õppides, suheldes ja tegutsedes.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) väärtustab eesti kirjandust ja rahvuskultuuri,\n2) tajub Eesti kultuuriloo tundmist oma identiteedi olulise osana, on kujunenud teadlikuks kultuurikasutajaks;\n3) on omandanud põhiteadmised eesti kirjanduse ja kultuuri erinevate valdkondade tüvitekstide päritolu ja kasutusvõimaluste kohta; oskab analüüsida tekste\n4) arendab oma oskusi nii kultuuri vastuvõtja, kaitsja, vahendaja, looja kui salvestajana;\n5) suhtub tolerantselt teistest kultuuridest pärit inimestesse ja toetab neid eesti/oma kultuuritraditsioonide mõistmisel;\n6) oskab luua kontakte ning suhelda teistest kultuuriruumidest pärit inimestega, tuginedes eesti tüvitekstidele. Suhtlemine ja koostöö kursusekaaslastega toimub Moodle'i foorumis kirjaliku väljendusoskuse arendamiseks.\nJulgustan kõiki rohkem foorumis suhtlema, et olla üksteisele toeks. Jagatud mure on pool muret.\nTehke koostööd, andke üksteisele nõu kodutööde tegemiseks, jagage huvitavat infot eri teemade, loetud teoste, tele- ja raadiosaadete, videote, artiklite kohta.\nRääkige oma avastustest  ja probleemidest kodutööde tegemisel, arutlege päevauudiste teemadel, avaldage oma arvamust - see annab võimaluse suhelda eesti keeles ning arendab teie suhtlemisoskust. \nÜritustel osalemine:\nOsavõtt kolledi üritustest (konverentsi korraldamine, kuulamine, ettekande tegemine; kirjandusklubi kohtumisel kaasalöömine, õppekäikudest osavõtt jne) kompenseerib kohustusliku ülesande.\nKuhu minna?\nKirjandusklubi kohtumised kirjanike, kultuuritegelastega kord kuus-jälgige kolledi kodulehel olevat reklaami.\nEmakeelepäev 14.03. Täpsem info on kolledi kodulehel.\nKonkursil osalmise võimalus:\nHansenist Tammsaareni võistulugemine Ida-Virumaal - esitada peast  5min pikkune katkend Tammsaare teosest/saab osaleda ka kuulajana või korraldajana."}