{"KURSUSE_NIMI": "Strateegiline juhtimine ja ettevõtte IT strateegia", "KURSUSE_KOOD": "SVNC.00.266", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 20, "independent_work": 132, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Strateegilise juhtimise olemus, ajalooline areng ja arengu mõjurid ja põhimõtted. Strateegilise juhtimise terminid ja definitsioonid. Strateegiline juhtimise organisatsiooni IT-s. Organisatsiooni sise- ja väliskeskkond, potentsiaali ja mõjude analüüs. Strateegiline planeerimine ja analüüs organisatsiooni tasandil. Organisatsiooni strateegia juurutamine. Erinevate juhtimistasandite töötajate ja koostööpartnerite roll strateegilise planeerimise protsessis. Strateegiad organisatsiooni funktsionaal- ja äritasandil, sh organisatsiooni IT valdkonnas. Strateegilise arengu mudelid. Tasakaalus tulemuskaart. IT strateegia eripära. Strateegiate elluviimine ja kontroll. Juhtumite analüüs.Objectives/eesmärkid:  Aine läbinud üliõpilane on omandanud teadmised strateegilise juhtimise teooria ning oskab analüüsida organisatsiooni mõjutavaid tegureid ja planeerida tegevusi strateegilise juhtimise põhimõtetest lähtuvalt. Samuti tunneb üliõpilane IT strateegia kujundamise põhimõtteid ja ning oskab tagada selle toel ettevõtte eesmärkide saavutamise.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: Kursuse läbinud õppija:\nteab\n* strateegilise juhtimise mõtteviisi olemust ja vajalikkust organisatsioonis ning seonduvat terminoloogiat\n* organisatsiooni ja selle keskkonna strateegilise analüüsimise protsessi ja seonduvaid mudeleid/tööriistu\n* organisatsiooni äritasandi ja funktsionaaltasandi strateegiate seost konkurentsieelisega\n* millised on konkurentiseelise sõnastamise peamised võimalused/suunad\n* IKT strateegia kujundamise eripära\nOmandab baasoskused, et\n* kaardistada organisatsiooni äri- ja IKT mudelit ning seostada see väärtuspakkumisega kliendile\n* planeerida organisatsiooni tegevust ja seda teotavate IT komplekslahenduste rakendamist tegevust lühi- ja pikaajalises perspektiivis ning näha ette potentsiaalseid probleeme strateegilise planeerimise puudumisel"}