{"KURSUSE_NIMI": "Kultuuridevaheline suhtlemine ja mitmekultuuriline haridus", "KURSUSE_KOOD": "SVNC.00.048", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 22, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ülevaade kultuuridevahelise suhtluse ajaloost ja teoreetilistest käsitlustest, mitmekultuurilisest ühiskonnast ja selle arengust Eestis. Ülevaade multikultuurilise hariduse ideede arengust ja tänasest problemaatikast Eestis ja muus maailmas. Käsitletakse vähemusrahvuste hariduse mudeleid ning erinevaid adaptatsiooniprogramme mitmekeelse hariduse korraldamisel. Tutvustatakse peamisi strateegiaid, mis tagavad valmisoleku töötamaks multikultuurilises keskkonnas.Objectives/eesmärkid:  Kursuse eesmärgid on arendada üliõpilastel teadmisi ja pädevust kultuuridevahelise suhtlemise valdkonnas, aidata üliõpilastel aru saada multikultuursusest maailmast, anda ülevaade multikultuurilise hariduse ideede arengust ja tänasest problemaatikast Eestis ja mujal maailmas.Learning outcomes/õpiväljund:  Üliõpilane 1) omab teoreetilisi teadmisi kultuuridevahelise suhtlemise valdkonnast;  2) teadvustab kultuuri mõju suhtlemisele ja käitumisele ning tajub ennast kultuuridevahelise suhtlejana; 3) oskab märgata etnotsentrismi ilminguid oma käitumises, mõtteviisis ja hinnangutes; 4) oskab kasutada kultuuridevahelise suhtluse teoreetilist materjali konkreetsete situatsioonide analüüsimisel; 5) analüüsib multikultuurilise ühiskonna probleeme Eestis; 6) teab haridussüsteemi reformide kogemusest Euroopas, sh ka Eestis; 7) võib korraldada ja hinnata haridusprotsesside interkultuurilisust; 8) oskab valida hariduse mudeleid ja õppevõtteid sõltuvalt konkreetsest keelelisest ja kultuurilisest situatsioonist; 9) oskab määratleda õpetaja kohta bilingvaalse hariduse juhtimisel ja tolerantsuse kasvatamisel; 10) teab mitmekultuurilise õppekeskkonna iseärasusi kasvatustöös ja oskab nendega arvestada."}