{"KURSUSE_NIMI": "Tervisekäitumine", "KURSUSE_KOOD": "SVNC.00.191", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel tutvustatakse erinevaid tervisekäitumise teooriaid ja nõustamise erinevaid tasandeid. \nKäsitletakse erinevaid tervise determinante (nt GMO-toit, E-ained, energiajoogid, veganlus, tasakaalus \nmikrobioota, jooga, shindo, Aleksander tehnika, nõelravi, loodusravi).\nTutvustatakse keskkonna, eakaaslaste ning ühiskonna rolli tervise kujunemisel. \nTehakse sotsiaalsete toimetulekuoskuste harjutusi ning praktilisi harjutusi õpetaja tervise taastamiseks.\nTutvustatakse noorte uuema aja terviseriske (nt nabarõngad, keeleneedid, vesipiip, tätoveeringud).\nArendatakse esmaabi oskusi üksikjuhtumite näitel.\nKäsitletakse koolistressi põhjuseid ja erinevaid abi võimalusi.Objectives/eesmärkid:  Õpetajate ja lasteaiaõpetajate tervisekasvatuslike baasteadmiste ja oskuste laiendamine, et teadlikult  lahendada erinevaid tervisega seotud probleeme koolieelses lasteasutuses ja koolis.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane:\n1.  orienteerub erinevates tervise kontseptsioonides ja tervisekäitumise teooriates ning teab erinevaid tervise determinante (mõjureid);\n2. suudab analüüsida erinevaid tervisemõjureid ning võtta vastu tervisele kasulikke igapäevaseid otsuseid;\n3. oskab analüüsida ja suunata oma käitumisharjumusi nii, et vaimne, füüsiline, emotsionaalne ja sotsiaalne tervis oleks tasakaalus;\n4. orienteerub tervise, tervisekäitumise  ja heaoluga seotud erinevates allikates;\n5. oskab suunata lasteaiaealisi lapsi ja õpilasi põhjendatud tervisealaste valikute tegemisel;\n6. mõistab tervisedenduse, tervisekasvatuse ja heaolutunde väärtust;\n7. oskab kasutada ja hinnata kaasaegset tervisealast informatsiooni ja seda vajadusel rakendada igapäevases töös lasteaias ja koolis;\n8. suudab lasteaiaealistele lastele ja õpilastele selgitada riskikäitumise tervisemõjusid."}