{"KURSUSE_NIMI": "Tervisemõjurid", "KURSUSE_KOOD": "SVNC.00.241", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel käsitletakse vaimse tervise esmaabi ja vaimse tervise edendamise erinevaid praktikaid (teadveloleku harjutused, lõõgastustehnikad jms).\nTutvustatakse ergonoomilist töökeskkonda ja erinevaid ergonoomilisi vahendeid (tasakaalumatti, istumispalli, pukktooli, tasakaalupatja jms). \nKäsitletakse erinevaid töökeskkonna ohutegureid: füüsikalisi, keemilisi, bioloogilisi, füsioloogilisi ja psühholoogilisi. Tehakse töökeskkonna riskianalüüs.\nTutvustatakse geen-, kromosoom- ja genoomhaigusi, geeniteraapiat ja geenivaramut. \nKäsitletakse viirusi, baktereid ja seeni tervise mõjutajana.\nTutvustatakse keskkonna mõju (õhk, toit, vesi, müra, vibratsioon ja kiirgus) inimese tervisele.\nUuritakse kosmeetilist keemiat ja kodukeemiat ning levinumate ohtlike materjalide mõju.Objectives/eesmärkid:  Aine eesmärgiks on õpetajate ja lasteaiaõpetajate tervisealaste teadmiste ja oskuste laiendamine, et haridustöötajana teadlikult  lahendada erinevaid tervisemõjuritega seotud probleeme.Learning outcomes/õpiväljund:  Õppekava läbinud üliõpilane\n1. suudab analüüsida erinevaid tervisemõjureid ning võtta vastu tervisele kasulikke igapäevaseid otsuseid\n2. orienteerub erinevates vaimse tervise edendamise praktikates ning oskab anda vaimse tervise esmaabi\n3. oskab analüüsida töökeskkonna ohutegureid, teostada töökeskkonna riskianalüüsi ning suunata oma käitumisharjumusi nii, et töökeskkond oleks riskivaba\n4. väärtustab ergonoomilist töökeskkonda ja ergonoomilisi vahendeid\n5. orienteerub levinumates viiruste, bakterite ja seente poolt põhjustatud haigustes\n6. tunneb levinumaid geen-, kromosoom- ja genoomhaigusi\n7. oskab analüüsida kodukeemiat, kosmeetilist keemiat ja erinevaid levinumaid ohtlikke materjale\n8. mõistab keskkonna mõju inimese tervisele"}