{"KURSUSE_NIMI": "Vene vähemus Eestis", "KURSUSE_KOOD": "SVNC.00.281", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "täiendusõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Peamised teemad aruteluks: (1) sissejuhatus kursusse ja venekeelse vähemuse ajalooline väljakujunemine Eestis, (2) sotsiaalmajanduslik olukord: tööturu olukord, võrdsus ja võrdne kohtlemine, (3) poliitiline olukord: poliitiline ja ühiskondlik osalus, kodakondsus ja usaldus institutsioonide vastu, (4) kultuuriaspektid: kultuur, identiteet ja eri rahvusest inimeste vahelised kontaktid, eesti keelele üleminek koolis, de facto kakskeelsus, (6) etnopoliitiline režiim: poliitilised instrumendid ja integratsioonipoliitika.Objectives/eesmärkid:  Kursuse eesmärk on anda sügavam mõistmine Eestis elavatest vene keelt kõnelevatest elanikest: kuidas see etniline vähemusgrupp Eestisse tekkis; mis on nende praegune seaduslik, poliitiline ja sotsiaalmajanduslik status; mis hoiakud selles grupis valitsevad/prevaleerivad; kuidas need hoiakud on läbi aegade muutunud. Kursus käsitleb venekeelse elanikkonna identiteedi konstrueerimisega seotud väljakutseid Eesti kontekstis (vs enamusgrupp), Eesti valitsuse poliitilisi tegevusi/otsuseid, mis on suunatud just sellele sihtrühmale ja vaatleb, milliseid poliitilisi meetmeid on kasutatud integratsiooni, hariduse ja eesti keele õppe edendamiseks. Samuti vaadeldakse, kuidas see grupp (eestivenelased) on tulnud toime erinevate \"kriisidega\" - pronkssõduri teisaldamine 2007. aastal, globaalne majanduskriis, sõda Ukrainas (k.a. Krimmi annekteerimine 2014. aastal) ja koroonapandeemia.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng:  -\tteab Eestis elava venekeelse vähemuse tekkimise ajalugu  -\ttunneb venekeelse vähemuse sotsiaalmajanduslikku, poliitilist ja kultuurilist olukorda Eestis -\toskab välja tuua venekeelse vähemuse ees seisvad väljakutsed, probleemsed kohad ja kordaminekud -\tmõistab Eestis valitsevat integratsioonipoliitikat"}