{"KURSUSE_NIMI": "Läänemere regiooni riikide majanduskeskkond ja majanduspoliitika", "KURSUSE_KOOD": "SVNC.00.091", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 4, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Läänemere piirkonna majanduskoostöö mõjutab Eesti majandust arendavalt, laiapõhjaliselt ja sügavuti, pakkudes ettevõtetele laiemat turgu, võimaluste rohket arenguperspektiivi ja konkurentsivõime tugevnemist.    \nLäänemere regionaalset majanduskeskkonda iseloomustavad eelkõige uute tehnoloogiate laialdane kasutamine, toodete ja teenuste kõrge kvaliteet, tarbija kõrge keskkonnateadlikkus ning väljakujunenud turvaline ärikeskkond. Samas seisab see silmitsi paljude väljakutsetega sh konkurentsivõime langus reas sektorites, osakaalu vähenemine maailma majanduses ja kaubanduses.\nKursus annab põhjaliku ülevaate regiooni majanduskeskkonnast, regionaalsest koostööst, riikide ärikliimast ja pakub ideid Eesti firmade äritegevuse arendamiseks.\nKursusest osavõtjatele pakutakse mitmeid kasulikke infoallikaid nii Läänemere majanduse makroandmete, statistika kui ka ettevõtetele ärikontaktide leidmiseks.Objectives/eesmärkid:  Kursuse eesmärgiks on tutvustada Läänemere regiooni riikide koostööd, majanduskeskkonda\nning analüüsida  meie ettevõtjate ärivõimalusi ja praktilist suhtlemist. \nLearning outcomes/õpiväljund:  Kursuse läbinud üliõpilane  \n•\tteab Läänemere piirkondliku koostöö peamisi suundi ja formaate; \n•\tmõistab majandusregiooni kui terviku kujunemise põhjusi ja arengutingimusi;\n\n tunneb Läänemere regiooni riikide majandusstruktuuri ja nende üldist majanduspoliitikat, oskab leida ja analüüsida vajalikku statistikat; omab ettekujutust piirkonna riikide üldisest ärikliimast; • evib ülevaadet Eesti majandusdiplomaatide tegevusest ja nende teenustest ettevõtjatele;\n• kuuleb erinevate ettevõtetega seotud kasulikust kogemustest tegevusest Läänemere piirkonna riikides • on kursis regiooni riikides partneritega suhtluse eripäradest, sh Saksamaa ja Läti kui kaks näiteriiki."}