{"KURSUSE_NIMI": "Õppekeskkond ja õppevara", "KURSUSE_KOOD": "SVNC.00.135", "EAP": 2, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 4, "seminar": 8, "independent_work": 40, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus on üles ehitud kombineeritud õppe põhiselt. Osa õppest toimub e-õppena Moodle keskkonnas ja seda toetavad kontakttunnid. Kursuse Moodle keskkond on üles ehitatud nii, et üliõpilasel on võimalik saada ülevaade traditsioonilise ja nüüdisaegse õppekeskkonna tunnustest, mis toetavad avatud, koostöist ja enesejuhitud õppimist. Tähelepanu pööratakse järgmistele teemadele: avatud õpikeskkond, avatud ruum, mobiilsed ruumilahendused, virtuaalmaailm kui õpikeskkond (sh vajalikud tingimused koostöiseks õppimiseks), koolivälised õppekeskkonnad. Kursuse auditoorne töö toimub seminarides ja praktikumides. Praktikumis suunatakse üliõpilasi leidma ja hindama etteantud hindamiskriteeriumite alusel leitud erialast õpivara. Samuti õpitakse kasutama nüüdisaegset õpikäsitust toetava õppevara loomiseks sobivaid võimalusi. Kursuse käigus tuleb üliõpilastel luua üks õppevaraline lahendus ja sooritada käsitletud teemasid kokkuvõttev Moodle testiga.Objectives/eesmärkid:  Õppeaine eesmärk on toetada üliõpilase kujunemist õpetajaks, kes kujundab turvalise ja kõigi õppijate kaasamist toetava igaühele eduelamust pakkuva õppekeskkonna, lõimides seejuures loovalt traditsioonilise ja kaasaegse õppevara ja -vahendid, sh IKT põhised.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: 1)\tteab nüüdisaegse ja traditsioonilise õppekeskkonna tunnuseid ja oskab neid kirjeldada; 2)\toskab analüüsida, mil määral on õppekeskkond avatud, enesejuhtimist ja koostöisust toetav; 3)\toskab leida oma eriala õpetamisega seotud õpivara ja on suuteline välja tooma leitud õpivara tugevaid ning nõrku külgi; 4)\toskab luua oma eriala õppimist ja õpetamist toetava õppevaralise lahenduse, mis on kooskõlas nüüdisaegse õpikäsitusega."}