{"KURSUSE_NIMI": "Teabeotsingud ja äriuuringute metoodikad", "KURSUSE_KOOD": "SVNC.00.265", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 8, "seminar": 0, "independent_work": 66, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppija omandab baasteadmised ning praktilised oskused uurimistöö (sh lõputöö) sisuliseks planeerimiseks, läbiviimiseks, andmete kogumiseks ja analüüsimiseks ning selle korrektselt ning nõuetekohaselt vormistamiseks. Kursuse läbimisel õppija teab teaduslikele uurimistöödele esitatavaid nõudeid uuringu ettevalmistamise ja teostamise kohta, samuti erinevaid uurimismeetodeid.\nKursuse läbimisel õppija oskab töötada andmekogudega, planeerida ja teostada uuringu läbiviimist ning andmete kogumist ja analüüsimist, tõlgendada, esitada ja esitleda andmeid nii kirjalikult kui ka suuliselt.Objectives/eesmärkid:  Ainekursuse eesmärk on anda üliõpilasele oskused teabeotsinguteks ning iseseisva uurimistöö tegemiseks ettevõtluse valdkonnas. Kursuse esimene osa käsitleb teabeotsinguid, teine ettevõtete uuringute läbiviimiseks vajalikku. Õpitakse tegema tööd andmebaaside ja teaduskirjandusega, planeerima ja läbi viima uuringut ning kindlusama selle usaldusväärsust. Omandatakse teadmised andmete kogumise ja analüüsimise meetodite kotha.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane tunneb: * teadustööks vajalike andmebaaside liike, elektroonilisi infoallikaid ja nendega töötamise põhimõtteid ja võtteid * teadusfilosoofia ja -metodoloogia alustõdesid, sh eetika- ja andmekaits nõudeid * sotsiaalvaldkonna, sh rakendusliku äriuuringu kavandamise ning andmete kogumise ja analüsimise meetodeid bakalaureuse tasandil  Kursuse läbinu õppija oskab: * töötada erinevate andmekogudega * mõista ja hinnata teiste poolt läbiviidud uuringute tulemusi ning kasutada neid korrektselt * kavandada äriuuringut ning teha strateegilisi valikuid selle läbiviimiseks, sh sõnastada probleemi, eesmärki, valida andmete kogumise ja analüüsimise meetodid, kindlustama uuringu representatiivsus ja valiidsus * õlgendada, esitada ja esitleda andmeid nii kirjalikult ja suuliselt * kasutada asjakohast sõnavara ja teabeallikaid"}