{"KURSUSE_NIMI": "Kaasaegne vene kirjandus ja filmikunst vene keele võõrkeelena õppes", "KURSUSE_KOOD": "SVNC.00.132", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 6, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate kaasaegse kirjanduse arengutendentsidest, anritest ja raamatutüüpidest; vene filmikunsti ajaloost, vene tuntud lavastajate loomingust, kuulsate mängufilmide ja multifilmide eripärast ja vene filmide retseptsioonist Venemaal ja välismaal. Käsitletakse ja analüüsitakse tänapäeva vene autorite loomingut (sealhulgas lastekirjanike teoseid) ning vaadeldakse vene filmide kasutamise võimalusi vene keele tundides välismaalastele.Objectives/eesmärkid:  Anda ülevaade kaasaegse vene kirjanduse (sealhulgas lastekirjanduse) arengutendentsidest, õpetada mõistma ja analüüsima kaasaegse ilukirjanduse teoseid, probleeme ja ideid. Tutvustada vene filmikunsti ajalugu tuntud lavastajate kaudu, vaadelda märgilisi filme ja nende kasutamise võimalusi vene keele võõrkeelena tundides.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane:  1) teab kaasaegse vene kirjanduse ja lastekirjanduse autoreid, teoseid, anre, stiile; 2) tunneb kaasaegse kirjanduse arengutendentse ja nende teoreetilisi käsitlusi; 3) oskab iseseisvalt analüüsida kirjandusteost ning seostada kirjandusliku kontekstiga; 4) valib nüüdisaegse vene kirjanduse tekste ja koostab ülesandeid ning loob neist süsteemi, lähtudes muukeelsete või kakskeelsete õpilaste keeleoskuse tasemest ja individuaalsetest vajadustest; 5) tunneb kuulsate klassikaliste ja kaasaegsete vene filmide loomise konteksti ja vaatlejate retseptsiooni eripära; 6) oskab analüüsida mängufilmide ja multifilmide tekste; 7) näeb võimalusi kasutada vene filme välismaalaste vene keele osaoskuste ja sotsiaalkultuurilise kompetentside arendamiseks.\n"}