{"KURSUSE_NIMI": "Kõnearendus koolieelses eas", "KURSUSE_KOOD": "SVNC.00.154", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 0, "seminar": 14, "independent_work": 86, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Lapse kõne arengu põhietapid ja nende iseloomustus. Lapse kõne arengu seosed teiste arenguvaldkondadega. Kõne arendamise põhimõtted, ülesanded ja meetodid lasteaias  Lapse kõne jälgimine ja arendamine läbi suhtlemise ja mängu. Kõne arengut toetav lapsest lähtuv mängu- ja õpikeskkond. Ettevalmistus lugemiseks ja kirjutamiseks. Objectives/eesmärkid:  Tutvustada üliõpilastele laste kõne arengu seaduspärasusi, kõne arengu sisu ja metoodikat koolieelsetes lasteasutustes.Learning outcomes/õpiväljund:  1) omab teadmisi õpetatavast ainevaldkonnast, laste kõne arengu seaduspärasustest, kõne arengu sisu valiku põhialustest ja õpetamise põhimõtetest ning metoodikast;  2) oskab arvestada õppe kavandamisel riikliku ning õppeasutuse õppekava ja arengukava eesmärke, koostada ainekava või tegevuskava;  3) oskab seada õppele, ainekursusele ja tunnile selgeid eesmärke ning määratleda õpitulemused, arvestades läbivaid teemasid;  4) oskab kasutada õppe eesmärgile, õppijate eale ja võimetele sobivaid rühmapõhiseid ja individuaalseid õppemeetodeid ja -vorme;  5) oskab valida õppijate arengule ja oodatavatele õpitulemustele vastavaid hindamismeetodeid. Kohustuslikud õppematerjalid: \nHallap, M., Padrik, M. (2008). Lapse kõne arendamine. Praktilisi soovitusi kõnelise suhtlemise kujundamisel. Tartu: TÜ Kirjastus.\nÕppimine ja õpetamine koolieelses eas. (2008). Toim. Kikas, E. Tartu: TÜ Kirjastus. Lk 39-52; lk 276-302. \nSarapuu, K., Hallap, M. (2021). Aitame lapse rääkima. Tartu: Studium. \nKoolieelse lasteasutuse riiklik õppekava (2008).  RTI, 11.06.2008, 23, 152\nÕppe- ja kasvatustegevuste valdkonnad. (2009).Koost. Kulderknup, E. Tallinn: Riikliku Eksami- ja Kvalifikatsioonikeskus. Lk 26-65.\nLapse arengu hindamine ja toetamine. (2009). Koost. Kulderknup, E. Tallinn: Riikliku Eksami- ja Kvalifikatsioonikeskus."}