{"KURSUSE_NIMI": "Rahvusvaheline arbitraaž", "KURSUSE_KOOD": "SVOI.04.007", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Tsiviilõiguse üldosa", "Võlaõiguse üldosa", "Lepinguõigus"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 18, "colloquium": 0, "web_learning": 0, "independent_work": 138, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Rahvusvahelise arbitraažimenetluse näol tegemist on ühe komplekssema, samas universaalsema vaidluste lahendamise meetodiga. Seminar sisaldab järgmisi rahvusvahelise arbitraažimenetluse aspekte:\n\n1.\tRahvusvaheline arbitraaž vaidluse lahendamise viisina, sh selle erinevus teistest vaidluste lahendamise meetoditest (kui ka seos nendega) ning eelised ja puudused\n2.\tRahvusvahelise arbitraažimenetluse erinevad vormid \n2.1.\tKommerts- või investeerimisarbitraaž\n2.2.\tInstitutsionaalne või ad hoc arbitraaž\n2.3.\tMuud vormid\n3.\tRahvusvahelise arbitraaži olulisemad institutsioonid ja nende reeglid\n4.\tArbitraažikokkulepe kommerts- ja investeerimisvaidlustes\n5.\tRahvusvahelise arbitraaži õiguslik raamistik (sh lex arbitri põhimõte, New Yorgi Konventsioon, menetlusõiguslikud reeglistikud, IBA Rules on the Taking of Evidence in International Arbitration) \n6.\tKohtu ning poolte ja nende esindajate roll menetluses\n7.\tEksperdid, tunnistajad\n8.\tArbitraažimenetluse etapid\n9.\tMenetlusdokumendid ja nende koostamine\n10.\tMenetlusstrateegia\n11.\tRistküsitlus\n12.\tArbitraažimenetluse istung\n13.\tArbitraažiotsuse tunnustamine ja täitmineObjectives/eesmärkid:  Aine eesmärgiks on anda osalejatele teoreetilised teadmised rahvusvahelisest arbitraažimenetluse põhiprintsiipidest ning rahvusvahelise arbitraažimenetluse erinevusest teistest vaidluste lahendamise meetoditest (sh kohtumenetlus, lepitusmenetlus, kokkuleppemenetlus). Lisaks on aine eesmärgiks rahvusvahelise arbitraaži praktiliste kogemuste omandamine (dokumentide kooostamine ja simulatsioon arbitraažimenetlus).Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: *\tteab ja oskab selgitada rahvusvahelise arbitraaži olemust, selle ülesehitust, õiguslikku raamistikku ning erinevust teistest vaidluse lahendamise meetoditest;\n*\tteab arbitraažiotsuste tunnustamise ja täitmise põhimõtteid;\n*\ttunneb arbitraažimenetluses menetlusdokumentide koostamise põhimõtteid ja oskab neid praktikas rakendada;\n*\ttunneb ristküsitluse põhiprintsiipe ja tehnikaid ning oskab neid praktikas rakendada."}