{"KURSUSE_NIMI": "Tervisliku tuleviku visionaliseerimine", "KURSUSE_KOOD": "SVPC.03.059", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 100, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Vananev ühiskond. Oodatav ja tervena elatud eluiga. Terviseandmete kogumine. Heaolu mõisted ja mudelid. Vanemate inimeste funktsionaalsed võimed. Tervisekäitumine. Ealisus. Disainmõtlemise rakendusvõimalused. Tervena vananemise tulevikutrendid.Objectives/eesmärkid:  Kursuse eesmärk on mõista vananeva ühiskonna väljakutseid ja võimalusi; saada aru, kuidas tervena vananemine puudutab iga ühiskonnakihti ning suuta avastada tervena vananemise ja teenuste disaini mudelitel põhinevaid lahendusvariante.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab vananeva ühiskonna üldnumbreid (ülemaailmne ja oma riik): oodatav eluiga, rahvastiku demograafia, vanadussõltuvus; 2) teab oodatava eluea ja tervena elatud eluea erinevust ning mõistab, kuidas on oodatava eluea ebavõrdsus seotud tervisealase ebavõrdsusega ja ebavõrdsusega sissetulekute jaotuses; 3) teab peamisi institutsioone, mis koguvad asjakohaseid andmeid vanemate inimeste terviseseisundi, tervisekäitumise ja sotsiaal-majandusliku olukorra kohta; 4) on võimeline uurima oma riigi spetsiifilist (vananemisega seotud) statistikat; 5) teab tervena vananemise ja heaolu/heaolu mõisteid ja mudeleid, mis hõlmavad kogu elukäiku + mõistab, miks kasutatakse erinevat terminoloogiat; 6) mõistab, et tervena vananemine puudutab ühiskonna kõiki tasandeid; 7) mõistab mõjuteed, mis hõlmab järkjärgulist lähenemisviisi, et määrata kindlaks prioriteedid, teadusuuringud, teadmised vananemise ja tervise jaoks; 8) oskab tuvastada häid juhtumeid, keskendudes vanemate inimeste funktsionaalsetele võimetele; 9) saab aru tervisekäitumise muutmise põhitõdedest (ja käitumise muutmise tehnikatest); 10) mõistab ealisuse olemust, ulatust, mõju ja määrajaid; 11) mõistab disainmõtlemise rakendusvõimalusi isikukesksete heaoluteenuste arendamisel; 12) analüüsib tervena vananemise ja heaoluga seotud tulevikutrende."}