{"KURSUSE_NIMI": "Klienditöö meetodid", "KURSUSE_KOOD": "SVPC.03.004", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Sissejuhatus sotsiaaltöösse"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Inimeste ja süsteemidega töötamiseks vajalikud baasteadmised sotsiaaltöös ja rehabilitatsioonis. Praktilised harjutused järgmistes valdkondades: kontakti loomine kliendiga, lähteinfo kogumine kliendi ja tema keskkonna kohta, kliendi hindamine, kliendi probleemide analüüs, muutuse ettevalmistamine ning kliendi toetamine muutuse protsessis, eneserefleksioon.\nKäsitletakse järgmisi teemasid:\n1. Klienditöö taustsüsteem ja põhimõisted (süsteemiteooria ja süsteemid sotsiaaltöös Pincus ja Minahani alusel, biopsühhosotsiaalne lähenemine, toimetulek ja selle eeltingimused, muutuse olemus ja etapid Prochaska ja DiClemente alusel).\n2. Klienditöö protsess ja põhiprintsiibid.\n3. Sekkumise tasemed ja viisid sotsiaaltöös.\n4. Andmete kogumine. Probleemianalüüsi teostamine. Töökokkuleppe sõlmimine. Eesmärgistamine. Töö vastupanuga. Kliendi tugevuste esiletoomine. Riskihindamine ja juhtimine sotsiaaltöös ja rehabilitatsioonis.\n5. Läbipõlemissündroom ja selle ennetamise viisid.Objectives/eesmärkid:  Kursuse eesmärk on kujundada inimeste ja süsteemidega töötamiseks vajalikud baasteadmised sotsiaaltöös ja rehabilitatsioonis ning anda võimalus praktilise kogemuse omandamiseks järgmistes valdkondades: kontakti loomine kliendiga, lähteinfo kogumine kliendi ja tema keskkonna kohta, kliendi hindamine, kliendi probleemide analüüs, muutuse ettevalmistamine ning kliendi toetamine muutuse protsessis, eneserefleksioon.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) rakendab klienditöö aluseks olevaid teoreetilisi kontseptsioone ja põhimõisteid; 2) hindab erinevaid sekkumise tasemeid ning peamisi sekkumisviise sotsiaaltöös ja rehabilitatsioonis; 3) rakendab sotsiaaltöötaja põhirolle klienditöö erinevatel tasemetel; 4) analüüsib klienditöö protsessi mõjutavaid tegureid erinevatel klienditöö tasanditel; 5) rakendab kliendi toetamist muutuse ettevalmistamise ja läbiviimise protsessis; 6) analüüsib läbipõlemise tundemärke ja selle ennetamise viise; 7) reflekteerib ennast klienditöö protsessis. Sihtrühm SRSÕ2"}