{"KURSUSE_NIMI": "Disainmõtlemise alused", "KURSUSE_KOOD": "SVPC.01.060", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 8, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 130, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sissejuhatus disaini; disainiprotsessi olemus ja meetodid, disainmõtlemise põhimõtted; meeskondade moodustamine, lähteülesende konkretiseerimine, ajakava ja tööplaani koostamine; klienditeekond, keskkonna analüüs, sihtrühmauuringud; huvigruppide kaart, persoona koostamine; afiinsusdiagramm; info sünteesimine, persoona elustiili analüüs; segmenteerimine; protoüüpimise olemus ja prototüüpide versioonid. Loovmeetodid; prototüüpide testimine ja muutmine; ärimudel, teenindusplaan, organisatsiooni ettevalmistamine prototüübi pakkumiseks massidele (finantsid, personal, turundus, protsessid jne.); ärimudeli/tegevusmudeli analüüs.Objectives/eesmärkid:  Anda ülevaade disaini arengust ning mõjust ühiskonna ning ettevõtluse arengule. Arendada oskusi, kasutada disainmõtlemise ja -juhtimise võtteid organisatsiooni arendamisel ning disainida praktiliselt toote- või teenuse prototüüp. Aine raames rakendavad tudengid disainiprotsessi kohta omandatud teadmisi, lahendades konkreetseid ülikooli välistelt organisatsioonidelt tulnud praktilisi ülesandeid või valides ise disainiprojekti lähteülesandeks väljakutse. Praktiliste ülesannete lahendamine toimub nii ülikoolis kui ülikoolivälistes organisatsioonides.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab disainivaldkonna termineid;  2) oskab disainiprojekti juhtimisel kasutada disainmõtlemise põhimõtteid (kaasamine, teenuse terviklikkus jmt);  3) teab disaini seoseid organisatsiooni tegevusmudeli ning strateegilise juhtimisega; 4) oskab analüüsida organisatsiooni väärtuspakkumist kliendi seisukohast ning koostada tüüpkliendi profiili (persoonat); 5) teab (teenuse)disaini protsessi etappe ning oskab planeerida teenusearendusprojekti ajakava ning koostada lähteülesannet;  6) oskab valida erinevate (teenuse)disaini meetodite vahel ning kasutada tüüpilisemaid (teenuste)disaini meetodeid/tööriistu disainiprotsessis; 7) töötab välja lähteülesande põhjal disainilahenduse.  Sihtrühm: Magistriprogrammide \"Muutuste juhtimine ühiskonnas\" ning \"Kogukondade arendamine ja sotsiaalne heaolu\" 2. aasta tudengid"}