{"KURSUSE_NIMI": "Sotsiaaltöö tervishoius", "KURSUSE_KOOD": "SVPC.03.007", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kaasaegsed tervishoiu sotsiaaltöö teoreetilised suunad ja sekkumismeetodid. Sotsiaaltöö erinevates tervishoiu valdkondades nagu esmatasandi meditsiin, aktiivravi, taastusravi, hooldusravi, palliatiivne ravi ja tervisekeskused. Tervishoiu sotsiaaltöös kasutatavad kliendi vajaduste hindamispõhimõtted, hindamismeetodid ning hindamisvahendid, mis on kasutatavad vastavalt töös laste, täiskasvanute, eakatega või terminaalselt haigetega. Erinevad tervishoiu sotsiaaltöö põhimõtted ja enim toetust leidnud teoreetilised lähenemised selles töövaldkonnas. Tervishoiu korraldus Eestis, multi/interdistsiplinaarsete meeskondade töökorraldus, sotsiaaltöötaja roll tervishoiu teenuste osutamisel. Võrgustikutöö interdistsiplinaarses meeskonnas tervishoiusfääris.Objectives/eesmärkid:  Loengukursuse eesmärk on anda osalejatele ülevaade kaasaaegse tervishoiu sotsiaaltöö interventsioonimeetoditest, praktilise töö aluseks olevatest teoreetilistest käsitlustest; arendada kursuslaste oskusi kliendi psühhosotsiaalsete, sotsiaalmajanduslike ja sotsiokultuuriliste vajaduste hindamiseks tervishoiu valdkonnas ning interdistsiplinaarses meeskonnas.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab sotsiaaltöö teoreetilisi käsitlusi, praktilise töö eripärasid ning eetilisi aspekte tervishoiu ja vaimse tervishoiu erinevates valdkondades; 2) teab koostöö võimalusi meditsiinispetsialistide ja meditsiini siduserialade spetsialistidega ning oskab neid rakendada;  3) omab oskusi töötada laste, noorte, täiskasvanute ja peredega erinevates tervishoiu valdkondades nagu esmatasandi tervishoid, aktiivravi, taastusravi, hooldusravi ning vaimne tervishoid;  4) teab kliendi psühhosotsiaalsete vajaduste hindamise viise ja interventsioonivõimalusi tervishoiu sotsiaaltöö valdkonnas. Sihtrühm SRSÕ2"}