{"KURSUSE_NIMI": "Ressursimajanduse alused", "KURSUSE_KOOD": "SVPC.00.066", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 12, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "LOODUSTEADUSLIKULT: mis on loodusressurss, kuidas selle suurust/väärtust hinnata, mil viisil ja mahus on kliima ja looduskeskkond laiemalt muutumas, millised on keskkonnategurite vastasmõjud võimalike tagajärgedena ressursimajandusele? \n\nSOTSIAALTEADUSLIKULT: mis on ökosüsteemi teenused, milliseid ühiskondlikke, sotsiaal-majanduslikke ja kultuurilisi muutusi ressursside majandamine erinevates ühiskondlikes kontekstides ja ärimudelites esile kutsub? \n\nSEADUSANDLUS JA VALITSEMINE: loodusressursside majandamise aluspõhimõtted ja sellel baseeruv seadusandlus, mida tähendab ressursimajandusele Euroopa roheline kokkulepe ja kliimapoliitika, kuidas käib seonduv seadusloome ning kuidas viiakse poliitikat ellu?\n\nTEHNOLOOGIAD JA INNOVATSIOON: kuidas vähendada inimese jalajälge loodusele? Millised on leevendamismeetmed kasvuhoonegaaside heite vähendamiseks ja ressursikahju vältimiseks? Mida uut pakub innovatsioon ja kuidas minna kaasa uue kliimaneutraalsuse (madalsüsinikuheitelise) majandusmudeliga? \n\nMUUTUSTEGA KOHANEMINE: kuidas (riski)ühiskond, kogukond, inimene ja ettevõte suudab tõsta kohanemisvõimet muutuvas ümbruskonnas (kliima, ressurss, haldus jm)?Objectives/eesmärkid:  Anda multidistsiplinaarne ülevaade loodusressursside majandamisest pidades silmas kliimamuutusi, keskkonna taluvusläve, inimese sotsiaalmajanduslikke ja kultuurilisi vajadusi ning poliitika suundumusi ja seadusandluse raamistikku. Tuua näiteid ressursimajandusega seonduvatest uutest tehnoloogiatest ja inimkesksetest lahendustest arvestades muuhulgas ressursside piiratust ja vastanduvaid huvisid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab Eesti keskkonda ja ühiskonda, siinseid juhtumeid ja ressursside majandamist ning kliimapoliitika elluviimist ja arendamist; 3) orienteerub ressursimajanduse teemas teaduskriitiliselt ja oskab võrdlevalt arutleda seosepaaride põhjus-tagajärg, probleem-lahendus, ressursivaru-defitsiit, leevendamine-kohanemine, looduslik-tehiskeskkond jms üle; 3) mõistab loodusressursside majandamist nii globaalselt kui Eestis ning kohalikul tasandil ja juurdleb ressursikasutuse üle uutes kliimaneutraalsuse eesmärkides; 4) suudab arutleda komplekssetes süsteemides terviklike lahenduste elluviimise võimalusi eesmärgiga tagada pikaajaline kestlikkus."}