{"KURSUSE_NIMI": "Digipädevuste alused", "KURSUSE_KOOD": "SVPC.00.052", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 78, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kaasaegse ühiskonna digitaalse kirjaoskuse põhialused ja digipädevuste põhimõtted vastavalt viiele alagrupile rahvusvahelisest raamistikust DigComp. Erinevate digitaalsete töövahendite tutvustamine infohalduse, kommunikatsiooni, sisuloome, turvalisuse ja probleemilahenduste jaoks. Organisatsioonide juhtimises ja põhiprotsessides kasutatavate digilahenduste ülevaade.Objectives/eesmärkid:  Omandada baastasemel digipädevused vastavalt rahvusvahelisele raamistikule DigComp ning saada ülevaade organisatsiooni digitaliseerumise protsessidest ja digijuhi tegevustest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab 21 digipädevuse (5 grupi, DigComp) sisu, mõistab enda digipädevuste õpivajadusi, otsib enda oskustele vajalikke õppematerjale või abi ning planeerib edasist õpet digipädevuste valdkonnas; 2) oskab leida ja valida usaldusväärset infot ning seda (erinevates formaatides - pilt, muusika, video, tekst, veebilehed) kasutada ja salvestada - info haldamine; 3) oskab infot jagada, suhelda järgides netiketti,  teha koostööd, olla aktiivne/kaasatud ühiskonnaelu tegevustes ja juhib enda digitaalset identiteeti - suhtlemine digikeskkondades; 4) oskab luua erinevates formaatides lihtsamat sisu, teab intellektuaalse omandi põhimõtteid - sisuloome vahendid; 5) teab isikuandmete, seadmete, tervise ja keskkonna kaitsmise põhimõtteid - infoturvalisus laiemalt; 6) otsib tehnilistele probleemidele lahendusi kasutades selleks probleemilahenduse tehnikaid või tehnoloogiat - probleemilahendus; 7) mõistab tehisintellekti treenimise põhimõtteid; 8) oskab valida sobiva tehisintellekti abil töötava tarkvara. Sihtrühmad EPSÕ1, THSÕ1, SRSÕ1, DDSÕ1"}