{"KURSUSE_NIMI": "Heaolu ja terviseturism", "KURSUSE_KOOD": "SVPC.02.019", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 12, "seminar": 6, "independent_work": 0, "individual_work": 80, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Heaolu mõiste (welfare, wellbeing, wellness). Heaoluühiskond, -riik ja -majandus. Heaolu ja elukvaliteedi mõõtmise ja hindamise rahvusvahelised mudelid. Tervisekäsitlused. Tervikliku heaolu kontseptsioon. (the holistic wellness concept). Heaoludimensioonid ja -energia. Isikliku heaolu mõõtmine ja hindamine. Heaoluettevõtlus, -tooted ja -teenused. Terviseturismi käsitlused, areng ja tulevikusuundumused. Terviseturismi raamistik ja alavormid: Ravi-, spaa- ja heaoluturism. Terviseturistide rühmitamine, ootused, vajadused ja soovid. Terviseturismiasutused, -tooted, -teenused ja sihtkohad. Terviseturismi sihtkoha arendustegevuste planeerimine ja tegevuskava koostamine.Objectives/eesmärkid:  1. Õppija omandab arusaama ja põhiteadmised heaoluühiskonnast ja -majandusest, tunneb tervikliku heaolukontseptsiooni põhimõtteid ja oskab neid järgida isikliku heaolu ja ettevõtluse edendamisel.  2. Õppija tunneb terviseturismi vorme, -tooteid ja -teenuseid, mõistab terviseturistide ootusi, vajadusi ja soove ning oskab kasutada tervikliku heaolukontseptsiooni põhimõtteid terviseturismitoodete, -teenuste ja -sihtkohtade arendamisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) mõistab heaoluühiskonna ja -majanduse arengumõjureid ja avaldusvorme; 2) teab tervise ja heaolu mõiste käsitlusi (welfare, wellbeing, wellness); 3) tunneb tervikliku heaolukontseptsiooni (holistic wellness concept) põhimõtteid; 4) oskab kriitiliselt analüüsida isiklikku elustiili, heaolu mõjutegureid ja parendusvõimalusi; 5) oskab iseloomustada ning analüüsida heaolutooteid ja -teenuseid; 6) tunneb terviseturismi raamistikku ja alavorme; 7) oskab rühmitada terviseturiste ja kirjeldada nende ootusi, vajadusi, soove; 8) oskab kasutada tervikliku heaolukontseptsiooni põhimõtteid terviseturismitoodete, -teenuste ja -sihtkohtade arendamisel. Sihtrühm THSÕ1"}