{"KURSUSE_NIMI": "Sotsiaal- ja tervishoiupoliitika", "KURSUSE_KOOD": "SVPC.03.056", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 8, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Sotsiaalkindlustus, sotsiaalhoolekanne, sotsiaalne risk, sotsiaalne planeerimine.\nHeaoluriik, heaoluühiskond, kodanikuühiskond.\nÕiglus, võrdsus, efektiivsus.\nKonservatism/korporatism, liberalism, sotsiaaldemokraatia, ratsionalism.\nSotsiaalpoliitika (-kaitse) režiim, peamised sektorpoliitika režiimid (tööturupoliitika jms) EL-s.\nTervishoiu korraldus, seadusandlus.Objectives/eesmärkid:  1) Käsitleda süsteemis selliseid mõisteid, nagu \"hea Eesti ühiskond\", \"sotsiaalne probleem\", \"strateegiline\" ja \"kriitiline\" sekkumisvaldkond avaliku halduse kontekstis. 2) Anda ülevaade sotsiaalpoliitikast kui teooriast sotsioloogilisest, politoloogilistest, rahvastikuteaduse, majandusteaduse ja juhtimise (avaliku halduse) kontseptsioonidest, mis moodustavad sotsiaalpoliitika teoreetilise raamistiku. 3) Luua ettekujutus sotsiaalpoliitikast kui praktilisest tegevusvaldkonnast, milles ühiskonna erinevad subjektid toetavad ja/või kujundavad sotsiaalsete aktsioonide abiga gruppide (ja viimaste kaudu indiviidide) heaolu. 4) Konkreetsete rahvuslike näidete abil omada ülevaadet erinevatest poliitikarežiimide võimalustest, kulutõhusatest rahaliste siirete mehhanismidest, terviklikest sotsiaal- ja tervishoiuteenuste korraldamise süsteemidest, õpitud abitust vältivatest kogukondlikest teenusmudelitest.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) piiritleb sotsiaalpoliitika (SP) üldises inimtegevuse struktuuris, tunneb põhimõisteid ja tänapäevase sotsiaalpoliitika arengutähiseid; 2) seostab rahvuse üldise ühiskondliku ja majandusliku arengu valdkondlike (rahvastiku-, eluaseme-, tööhõive-, tervishoiu-, pensioni-,  haridus-, sissetulekute toetamise, hoolekande jms) poliitikate arengutega, korraldusega ja tänaste probleemidega; 3) eristab sotsiaalpoliitika režiime üldiselt ja valdkondlikult, nende ülesehituse loogikat, tugevusi ja nõrkusi ning mõju sotsiaaltöö ja tervishoiu korraldusele, teenuste korraldamise ja toetuste maksmise loogikale ning klientide võimalustele eelnevat mõjutada; 4) omab ülevaadet tervishoiu korraldusest, erinevatest korralduse mudelitest ning tunneb valdkonda reguleerivat seadusandlust ja regulatsioone Eestis. Sihtrühm ISI1"}