{"KURSUSE_NIMI": "Sotsiaalse ja tööalase rehabilitatsiooni korraldus", "KURSUSE_KOOD": "SVPC.03.009", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Sotsiaalkaitse õiguslikud alused"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine koosneb 4 moodulist:\n1. Sotsiaalse ja tööalase rehabilitatsiooni alused ja korraldus. \n1.1. Rehabilitatsiooni peamised eesmärgid ning rehabilitatsiooni kujunemine.\n1.2. Rehabilitatsioonivaldkonna arengud ja arengut mõjutanud ühiskondlikud protsessid. \n1.3. Rehabilitatsiooniteenuse õiguslikud alused Eestis (sotsiaalne ja tööalane rehabilitatsioon, eesmärgid, sihtgrupid, teenusele suunamine).\n1.4. Tööalase rehabilitatsiooni õiguslikud alused ja protsess (töövõime hindamine, tööalase rehabilitatsiooni eesmärgid, sihtgrupp, teenusele suunamine, tegevuskava koostamine ja tulemuste hindamine.\n\n2. Sotsiaalse rehabilitatsiooni protsess.\n2.1. Sotsiaalse rehabilitatsiooni õiguslikud alused ja protsess\nRehabilitatsioonivajaduse hindamine. Sotsiaalkindlustusametis,  sotsiaalse rehabilitatsiooni vajaduse hindamine teenuse osutaja tasandil.\n2.2. Sotsiaalse rehabilitatsiooni eesmärgistamine, teenuste osutamine, protsessi koordineerimine, barjääride ületamine. \n2.3. Lastele rehabilitatsiooniplaani koostamine.  \n\n3. Tööalase rehabilitatsiooni protsess.\n3.1. Toetatud tööle rakendamise metoodika (definitsioon, põhitunnused).\n3.1.1. Toetatud töölerakendumise etapid (kutseprofiili koostamine, hindamis- ja nõustamisvahendid.)\n3.2. Karjäärinõustamise põhimõtted.\n3.3. Erinevad töötamise teenused.\n\n4. Rehabilitatsiooniprogrammid, abivahendid ja sotsiaalse rehabilitatsiooniteenuse  kvaliteedi põhimõtted.\n4.1.1. Rehabilitatsiooni programmi üldalused, programmi sihtrühm ja eesmärgid.\n4.1.2. Programmi ettevalmistamine, hindamine ja planeerimine, sekkumine, tulemuste hindamine, programmi lõpetamine, pikaajalise tagasiside planeerimine.\n4.1.3. Programmide kinnitamise protsess Sotsiaalkindlustusametis.\n4.2. Abivahendite regulatsioon.Objectives/eesmärkid:  1. Arendada üliõpilaste teadmiseid rehabilitatsiooni erinevatest käsitlusest, peamistest põhimõtetest ning rahvusvahelistest rehabilitatsioonivaldkonda mõjutavatest raamdokumentidest. 2. Õppida tundma sotsiaalse- ja tööalase rehabilitatsiooni teenuse osutamise õiguslikke aluseid ja korraldust. 3. Arendada üliõpilaste praktilisi oskuseid sotsiaalse- ja tööalase rehabilitatsiooni teenuse osutamiseks ja rehabilitatsiooniprotsessi koordineerimiseks. 4. Arendada üliõpilaste teadmiseid rehabilitatsiooniprogrammide väljatöötamisest ja osutamisest ning toetatud töölerakendamise metoodika kasutamisest tööalases rehabilitatsioonis. 5. Tõsta teadlikkust sotsiaalteenuste kvaliteedi arendamisega seotud küsimustest, abivahendi vajaduse hindamisest ning peamistest põhimõtetest abivahendite vajaduse hindamisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab rehabilitatsiooni arengulugu ja erinevaid käsitlusi; 2) teab rehabilitatsiooniasutuste töö korraldamise aluseid Eestis; 3) teab sotsiaalse  ja tööalase rehabilitatsiooni sihtgruppe ja teenuse korralduse aluseid; 4) oskab rakendada toetatud tööle rakendamise metoodikat; 5) teab rehabilitatsiooniprogrammide osutamise aluseid; 6) on kursis abivahendi taotlemise protsessiga; 7) teab rehabilitatsiooniteenuse kvaliteedi põhimõtteid."}