{"KURSUSE_NIMI": "Loovkirjutamine ettevõtluses", "KURSUSE_KOOD": "SVPC.01.079", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 20, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Sõnadel on võime haarata tähelepanu, mõjutada ja panna inimesi tegutsema. See on täpselt see, mida vajame selleks, et luua kliendiga tõeliselt põhjapanev ja sügav side. Sõnade abil saame luua paeluvaid lugusid, mis mõjuvad ja mõjutavad, aidates brändil eristuda ning pannes tarbija meiega samal sagedusel kaasa võnkuma. Seda eriti tänases kiirust armastavas maailmas, kus infomüra on suur ning inimeste tähelepanu lühem kui kunagi varem. Loovkirjutamine võimaldab jutustada oma brändi loo kaasahaaraval ja ainulaadsel viisil.Objectives/eesmärkid:  Anda läbi teooria ja praktika ülevaade loovkirjutamise võimalustest ettevõtluse kontekstis - oma brändi loo jutustamine kirjalikes kanalites (sotsiaalmeedia, uudiskirjad, blogi, artiklid jms), selge ja sihtrühma arvestav kommunikatsioon ning tehisintellekti ja teiste abivahendite kasutamine tekstide loomisel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) mõistab loovkirjutamise osatähtsust ettevõtte/brändi loo jutustamisel; 2) tunneb loovkirjutamise protsessi etappe ning teab, kuidas ületada hirme või blokke; 3) oskab kasutada loovkirjutamise meetodeid oma ettevõtte/brändiga seotud kirjalike kanalite (sotsiaalmeedia, uudiskirjad, blogi, artiklid jms) sisu järjepideval loomisel; 4) oskab läbi kirjalike kanalite edastada selget ja sihtrühma arvestavat sõnumit, sh e-kirjad; 5) oskab tekstide loomisel kasutada sõnastikke, tehisintellekti jt tänapäevaseid abivahendeid, aga ära tunda ka nendest lähtuvaid ohte; 6) teab ja oskab vältida tüüpilisi stiili-, loogika ja õigekirjavigu; 7) tekstide tellijana oskab püstitada tekstiloojale selgelt sõnastatud tööülesannet ja teha vahet hästi ning halvasti koostatud tekstil. Sihtrühm PBE2"}