{"KURSUSE_NIMI": "Ressursimajanduse teemaprojekt", "KURSUSE_KOOD": "SVPC.00.075", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Rühmade moodustamine, teema valik, ulatuse määratlus ja hüpoteesipüstitus.\nAndmete ja metoodika väljatöötamine.\nTaustauuringute ja seonduvate poliitikate ülevaade.\nJuhtumanalüüside läbiviimine, vaheseminaride arutelud.\nSidusrühmade seisukohtade kogumine, analüüs ja arutelud. \nOtsustusprotsessi hindamine ja läbimine.\nRiskihindamine ja täiendavate asjaolude arvestamine.\nTulemuste vormistamine ja peer-review.\nTulemuste esitlemine ja tagasisidestamine.Objectives/eesmärkid:  Kursusel koostatakse rühmatööna kolmeses spetsialiseerumises kliimamajanduse, biomajanduse või sinimajanduse projekt aktuaalsetel ressursikasutuse ja  -konflikti teemadel. Projektiuuringus käsitletakse mitmeid ruumilisi, maa- ja ressursikasutuse, sotsiaalmajanduslikke ja tehnoloogilisi teemasid ja asjaolusid, mis puudutab piirkondlike arengukavade ja kohaliku arendusprojektide elluviimist ühiskonna ja majanduse üleminekutes kestlikule arengurajale. Teemaprojekt arendab  analüütilisi ja praktilisi oskusi erinevates vaatenurkades ning ainekäsitluses erialaüleselt, tehakse külastusi, välitöid ja osaletakse külalisseminaridel.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) oskab koostada projektiuuringule kontseptsiooni, hüpoteesid, andmed ja metoodika ning rakendada läbivalt kvaliteetset projektijuhtimist; 2) oskab seostada loodusressursside kasutusega erinevaid valdkonnapoliitikaid, viia läbi sidusrühmade ja SWOT-analüüsi; 3) oskab rakendada keskkonnahindamise ja teisi analüüsimeetodeid, tasakaalustada pluss- ja miinus-asjaolusid, koostada optimeerimis jne analüüsimudeleid ning lahendusstsenaariume; 4) valdab haldusprotsesse, ametlike lubade andmise korda ja asjaajamist; 5) oskab tõlgendada õiguslikke ja majanduslikke asjaolusid teemaprojekti kohalike olude suhtes; 6) oskab dokumenteerida, väljendada tulemusi aruandes ja teistes esitlusvormides kirjalikult (vormingud, infograafika) ja suuliselt (ettekanded), täpselt ja tõhusalt väljendada projekti tulemusi."}