{"KURSUSE_NIMI": "Sotsiaaltöö mitmekultuurilises kogukonnas", "KURSUSE_KOOD": "SVPC.00.019", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Globaliseerumine ja selle mõju sotsiaaltööle. Kultuuriline mitmekesisus kui väljakutse sotsiaaltööle. Mitmekultuurilisuse definitsioon ja selle ideoloogia areng. Sotsiaalse õigluse mõiste globaalses maailmas. Multikultuurilise sotsiaaltöö põhimõtted. Kultuuriline kompetentsus kui professionaalsuse tunnus. Kultuuriliselt mitmekesise kogukonnaga töötamist soodustavad uskumused ja hoiakud. Eetika. Praktiline töö mitmekultuurse grupiga, kogukonnaga, selleks vajalikud teadmised, oskused. Üksikisiku vajadused uues kultuuriruumis, riskirühmade diskrimineerimine rassi, rahvuse, usu ja seksuaalse sättumuse alusel. Eesti ja Euroopa migratsiooni- ja sotsiaalpoliitika ning riiklikud integratsiooniprogrammid. Ametkondade ja riikide vaheline koostöö pagulaste, varjupaigataotlejate, vähemusrahvuste jt vähemuste ja riskirühmade abistamiseks.Objectives/eesmärkid:  Anda osalejatele teadmisi ja oskusi kultuuriliselt mitmekesise kogukonnaga töötamiseks.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) mõistab globaliseerumise mõju inimeste igapäevaelule ning riskirühmade toimetulekule; 2) mõistab kultuuri mõju sotsiaaltööle; 3) teab, mida tähendab mitmekultuurses kogukondades ja gruppides; 4) teab, mis on sotsiaalne õiglus, selle erinevaid käsitlusi poliitikas ja rakendamist ebavõrdsuse uurimisel; 5) mõistab eetikaga seotud väljakutseid; 6) orienteerub Eesti ja EL migratsioonipoliitikas, integratsiooniprogrammides ja -strateegiates; 7) oskab analüüsida mitmekultuurse kogukonna peamisi väljakutseid ja lahendusi; 8) oskab analüüsida diskrimineerimisega seotud probleeme ja võimalikke lahendusi; 9) oskab kasutada peamisi meetodeid mitmekultuurse grupi, kogukonna ja üksikisikutega töötamiseks; 10) leiab lahendusi seadusandluses lahendamaks sotsiaalseid probleeme situatsioonides, kus on tegemist erineva kultuurilise taustaga osapooltega."}