{"KURSUSE_NIMI": "Disain ja innovatsioon", "KURSUSE_KOOD": "SVPC.01.040", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Disainmõtlemine ja teenusedisain"], "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Disaini rakendused ühiskonnas ja ettevõttes. Disaini liigid ja ajalooline areng. Disaineri töö olemus ja rollid. Disaini protsess, projektid ja disaineri oskused. Disainile omane mõtteviis (design thinking). Disain juhtimise kontekstis. Disainijuhtimine suur- ja väikeettevõttes. Finantsid ja väärtuse mõõtmine disainis. Disaini suhe brändiloomesse ja innovatsiooni. Disainijuhtimine ja innovatsioon: organisatsiooni strateegilisel, taktikalisel ja operatiivsel tasandil. Disainiaudit. Disainiteenuse sisse ostmine ja lähteülesande koostamine. Koostöö korraldamine teenuse/tootearenduse meeskonnas. Disainiprojekti juhtimine ja hindamine. Kasutajakeskne lähenemine. Disainiuuring. Prototüpeerimine. Koostöö kasutajaga (co-creation, open innovation) jt meetodid. Universaaldisain.Objectives/eesmärkid:  Aine eesmärgiks on anda teadmised disainiprotsessist ja selle juhtimisest ning disaini kasutamisest innovatsioonis ja innovatsiooni rollist disainile.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija:  1) teab disainivaldkonna terminoloogiat, disaini tüüpe ja koostöö põhimõtteid disaineritega; 2) teab disaini rolli organisatsiooni strateegia kujundamisel ja konkurentsieelise loomisel; 3) teab disainijuhtimise olemust ning disainipõhise innovatsiooni protsessi; 4) teab disainijuhtimise põhimõtteid, meetodeid ja disaini rakenduspõhimõtteid organisatsiooni strateegilisel, taktikalisel ja operatiivsel tasandil; 5) oskab koostada disainiprojekti lähteülesannet (design brief); 6) oskab koostada ettevõtte disainikasutuse auditit; 7) oskab hinnata disainiprojekti tulemusi ja tulemuslikkust. Sihtrühm DDSÕ1"}