{"KURSUSE_NIMI": "Sissejuhatus sotsiaalpoliitikasse", "KURSUSE_KOOD": "SVPC.00.018", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine läbimisega taotletakse, et õppija saab ülevaate sotsiaalpoliitika aluspõhimõtetest, kujunemisest ning erinevatest poliitilistest huvidest, mis on teoreetiliste lähenemiste ja suundumuste aluseks. Kursuse jooksul omandatakse teadmised sotsiaalkaitse korraldamise põhiküsimuste,  erinevate poliitika valdkondade, samuti protsesside ja kontseptsioonide kohta. Õpitakse tundma sotsiaalprobleemide lahendusteid erinevates maades sõltuvalt kultuurilistest, poliitilistest, sotsiaalsetest ja majanduslikest tingimustest ning töötatakse teaduskirjanduse ja andmebaasidega. Kursuse läbimisel oskab õppija analüüsida erinevaid sotsiaalprobleeme ja poliitika valdkondi ning rahvusvahelisi sotsiaalpoliitilisi perspektiive, samuti tõlgendada, esitada ja esitleda sotsiaalpoliitilisi andmeid nii kirjalikult kui suuliselt ning kasutada asjakohast sõnavara ja teabeallikaid. Kursus lõpeb eksamiga.Objectives/eesmärkid:  Õppeaine läbimisega taotletakse, et õppija saab ülevaate sotsiaalpoliitika aluspõhimõtetest, kujunemisest, ning erinevatest poliitilistest huvidest, mis on erinevate teoreetiliste lähenemiste ja suundumuste aluseks. Kursuse jooksul omandatakse teadmised sotsiaalkaitse korraldamise põhiküsimuste, erinevate poliitika valdkondade  ja kontseptsioonide kohta. Õpitakse tundma sotsiaalprobleemide lahendusteid erinevates maades sõltuvalt kultuurilistest, poliitilistest, sotsiaalsetest ja majanduslikest tingimustest ning töötatakse teaduskirjanduse ja andmebaasidega.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab sotsiaalpoliitika aluspõhimõtteid, kujunemist ning erinevaid poliitilisi huvisid; 2) teab sotsiaalkaitse korraldamise põhiküsimusi, mudeleid ja vorme, erinevaid poliitikavaldkondi;  3) teab erinevaid protsesse ja kontseptsioone; 4) analüüsib sotsiaalprobleeme  erinevates maades sõltuvalt kultuurilistest, poliitilistest, sotsiaalsetest ja majanduslikest tingimustest. Sihtrühm SRSÕ1"}