{"KURSUSE_NIMI": "Protsessi- ja projektijuhtimine", "KURSUSE_KOOD": "SVPC.01.027", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 8, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Protsessipõhise juhtimise olemus ja seosed üldjuhtimisega; ajalugu ja trendid. Põhimõisted ja -kontseptsioonid. Protsesside tuvastamine, modelleerimine ja analüüs, riskide tuvastamine. Protsesside elutsüklid, protsessiparenduse kontseptsioonid, meetodid. Äri- ja kliendinõuded, protsessieesmärkide ja -näitajate määratlemine. Protsesside ümberkujundamine ja ümberkujundatud protsesside rakendamine. Projektijuhtimise põhikontseptsioonid ja -mõisted ning koolkonnad. Individuaalsed ja organisatsioonilised kompetentsid projektijuhtimises, nende võimalikud rakendused protsessijuhtimises.    \nProjektijuhtimise protsessid ja meetodid ning rahvusvahelised standardid. Traditsiooniline, agiilne ja hübriidne projektijuhtimine. Küpsusmudelid projektijuhtimises ja protsessijuhtimises, nende seosed. Projektide ja programmide keskkonnad ja elutsüklid, seos äriplaaniga. Programmi-juhtimise põhimõtted. Projektiportfellide ja projektiorganisatsioonide kujundamine ning juhtimine. Projekti- ja protsessipõhise juhtimise rakendamine ja arendamine, P(P)MO-d. Organisatsiooni arhitektuur. Protsessimuudatus kui projekt, lähteülesande ja tegevuskava koostamine).Objectives/eesmärkid:  Õppija omandab põhiteadmised protsesside, projektide, programmide ja projektiportfellide juhtimisest; mõistab protsessi- ja projektipõhise lähenemise olemust ning rakendusvõimalusi organisatsioonides.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab (äri)protsesside ning projektide, programmide ja projektiportfellide juhtimise põhikontseptsioone ja nende rakendusvõimalusi, sh eripära väiksemates organisatsioonides; 2) teab levinuimaid protsessi- ja projektipõhise juhtimise metoodikaid ning standardeid ning pädevus- ja küpsusmudeleid; 3) oskab identifitseerida, kaardistada ja modelleerida lihtsamaid äriprotsesse; 4) oskab analüüsida äriprotsesse, tuvastada parendusvajadusi ja -võimalusi ning kavandada äriprotsesside (ümber)kujundamist; 5) oskab määratleda ja esialgselt kavandada lihtsamaid projekte (programme); 6) oskab kasutada kaasaegset protsessi- ja projektijuhtimise erialast sõnavara eesti ja inglise keeles. Sihtrühm EPSÕ1"}