{"KURSUSE_NIMI": "Turismimajanduse alused", "KURSUSE_KOOD": "SVPC.02.021", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 10, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Turismi-, hotelli- ning toitlustusvaldkonna mõisted, areng ning seosed teiste majandusharudega. Turismivormid, -liigid ja komponendid. Eesti ja rahvusvahelised turismiorganisatsioonid ja nende tegevusvaldkonnad. Eesti turismiseadus. Eesti majutusturg ja majutusettevõtete liigid. Toitlustusettevõtted ja nende liigid. Majutus- ja toitlustusettevõtte ülesehitus ja töökorraldus. Reisijate ja turistide liigitamine. Külastuseesmärgid, külastajate motiivid, vajadused ja ootused. Turismitooted ning -teenused (reisi-, transpordi-, majutus-, toitlustusteenused, huviväärsused). Turismiteenuste nõudlus ja pakkumine. Turismimajanduse mõjutegurid ning suundumused.Objectives/eesmärkid:  Õppeaine läbimisel õppija omandab tervikliku ülevaate turismimajanduse, toitlustus- ja majutussektorist ning nende seostest erinevate majandusharudega ja oskab analüüsida valdkonna tegevusnäitajaid, hetkeolukorda, suundumusi ning mõjutegureid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: 1) teab valdkonnapõhiseid mõisteid, turismi-, toitlustus- ja hotellimajanduse komponente, liike ning neid majandusharusid reguleerivaid dokumente ja õigusakte; 2) kirjeldab erinevate sihtrühmade reisimotiive, ootusi ja vajadusi; 3) omab ülevaadet olulisematest Eesti ja maailma turismiorganisatsioonidest ning nende tegevustest; 4) mõistab turismimajandust mõjutavaid tegureid ja valdkonna seoseid teiste majandusharudega; 5)  tunneb majutus- ja toitlustusettevõtete teenuseid ja leiab arendamisvõimalusi; 6) esitab nii kirjalikult kui suuliselt valdkonna uurimistööde tulemusi ja tõlgendab kogutud andmeid. Sihtrühm THSÕ1"}