{"KURSUSE_NIMI": "Eksperimentaalpsühholoogia", "KURSUSE_KOOD": "SVPH.00.045", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Uurimismeetodid psühholoogias", "Psüühika põhifunktsioonid"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 26, "colloquium": 0, "web_learning": 0, "independent_work": 114, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Õppeaine annab üldised teadmised ja oskused psühholoogiliste eksperimentide korraldamiseks. \nAine keskmes on rühmatööna eksperimentaalse uurimuse läbi viimine ja sellest aruande koostamine.\nAines käsitletakse uurimisküsimuste ja hüpoteeside püstitamist, eksperimendiplaane ja nende valikut, muutujate valikut ja määratlemist, valimi koostamist, eksperimentaalsete uuringute eetikat, valiidsuse ja reliaabluse tagamist, andmete kogumist ja analüüsimist, tulemuste tõlgendamist, uuringu aruande koostamist. Tutvutakse uuringute näidetega erinevatest psühholoogia valdkondadest ja arendatakse kriitilise analüüsi oskuseid.Objectives/eesmärkid:  Arendada psühholoogia valdkonnas eri tüüpi eksperimentaalsete uurimuste korrektse planeerimise ja läbiviimise ning kriitilise hindamise oskusi.Learning outcomes/õpiväljund:  Aine edukalt läbinud üliõpilane on omandanud üldised teadmised psühholoogiliste eksperimentide korraldamisest ja oskab kavandada ning läbi viia lihtsamaid eksperimentaalseid uurimusi kõigis etappides, sh: - tõstatada uurimusküsimusi, püstitada ja operatsionaliseerida hüpoteese; - valida ja kohandada sobivat meetodit;  - kriitiliselt hinnata uurimuse reliaabluse ja valiidsuse eri aspekte ning kavandada samme nende tõstmiseks/tagamiseks; - koguda ja struktureerida andmeid; - kasutada kirjeldavat statistikat ja lihtsamaid järeldava statistika võtteid; - tõlgendada eksperimentaalsete uurimuste tulemusi; - koostada põhjalikku aruannet (artikli formaadis) tehtud uurimistööst."}