{"KURSUSE_NIMI": "Laste mälu ja õppimine igapäevasündmuste kontekstis", "KURSUSE_KOOD": "SVPH.00.010", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": [], "SOOVITUSLIKUD_EELDUSAINED": ["Arengupsühholoogia", "Psüühika põhifunktsioonid", "Kognitiivne psühholoogia"], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 72, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus keskendub laste õppimisele, mis toimub mitteformaalses kontekstis (muuseumikülastused, ühekordsed sündmused, arutelud kodus jms.). Kursuse käigus tutvutakse uurimustega, mis keskenduvad vestlustele lastega selliste sündmuste ajal ja pärast sündmuste toimumist. Need uurimused näitavad, kuidas täiskasvanud aitavad lastel sündmusi mõista ja mäletada ning nii omandada uusi teadmisi ja oskuseid. Kursus võib huvi pakkuda erineva taustaga tudengitele, sest keskendub üldistele mehhanismidele, mis igapäevasündmuste ajal laste mäletamist ja õppimist toetavad. Kursus on kasulik kõikidele, kes plaanivad lastega töötada, sest puudutab ka küsimusi, kuidas õppimist ja mäletamist mitteformaalses keskkonnas soodustada ja millised teised asjaolud (nt. olemasolevad teadmised, lapse sugu jne.) laste kogemust ning seeläbi ka õppimist ja mäletamist võivad mõjutada.Objectives/eesmärkid:  Antud kursus keskendub laste igapäevastele kogemustele mitteformaalsetes õpikeskkondades ning nende olulisusele laste arengus. Kursuse eesmärk on näidata, kuidas ja miks mõjutavad igapäevaste kogemuste erinevad aspektid ja laste ning perekondade individuaalsed erinevused laste õppimist ja mäletamist sellistes kontekstides.Learning outcomes/õpiväljund:  Kursuse läbinud tudengid: 1) Teavad, kuidas on õppimine mitteformaalses kontekstis seotud mälu arengu ja õppimis-/arenguteooriatega; 2) Teavad, millised on mitteformaalsed õpikeskkonnad ja milliseid meetodeid seal uurimuste läbiviimiseks kasutatakse; 3) Tunnevad üldiseid mehhanisme ja individuaalseid faktoreid, mis mõjutavad laste õppimist ja mäletamist mitteformaalses kontekstis."}