{"KURSUSE_NIMI": "Jätkusuutlik toitumine ja psühholoogiline heaolu: Rahvusvaheline koostöö", "KURSUSE_KOOD": "SVPH.00.104", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 12, "seminar": 8, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Interdistsiplinaarne kursus annab eri riikidest pärit üliõpilastele võimaluse teha koostööd psühholoogia, toitumise ja jätkusuutlikkuse kokkupuutepunktides. Kursus keskendub tervislike, hooajaliste, kohalike ja jätkusuutlike toiduvalikute tähtsusele ning annab üliõpilastele teaduspõhised meetodid nende väärtuste propageerimiseks erinevatele sihtrühmadele. \n\nInteraktiivse veebipõhise õppimise, kohapealsete töötubade ja lõplike koostööprojektide kaudu arendavad õpilased rahvusvahelist meeskonnatööd, tervisekasvatust, suhtlemis- ja esitlusoskusi. Uuenduslikke tervise edendamise strateegiaid ühiselt luues õpivad üliõpilased integreerima oma teadmisi toitumise ja psühholoogia valdkonnas, et mõjutada käitumise muutmist ja heaolu.Objectives/eesmärkid:  Kursuse eesmärk on omandada oskusi ja teadmisi toitumisalase tervisedenduse sekkumiste planeerimiseks ja läbiviimiseks. Kursusel õpivad TÜ üliõpilased koos Leuveni Rakenduskõrgkooli dietoloogia ja Navarra Ülikooli üliõpilastega läbi erinevate tegevuste tervislike ja jätkusuutlike toiduvalikute edendamist laiematele sihtrühmadele.Learning outcomes/õpiväljund:  Kursuse läbinu on võimeline: - mõistma toitumise mõju psühholoogilisele heaolule ja jätkusuutlike toiduvalikute tähtsust, - tegema koostööd erineva kultuurilise ja akadeemilise taustaga kolleegidega, et töötada välja tervist edendavaid strateegiaid, - rakendama teaduslikke teadmisi, et luua erinevatele sihtrühmadele huvitavaid ja tõenduspõhiseid materjale, - arendama meeskonnatöö, ühisloomise ja rahvusvahelise suhtlemise oskusi, - kasutama tõhusalt tehnoloogilisi vahendeid koostööõppeks, uurimistööks ja esitlusteks, - hindama jätkusuutlike toiduvalikute edendamise probleeme ja lahendusi nii toitumisalasest kui ka psühholoogilisest vaatenurgast."}