{"KURSUSE_NIMI": "Sissejuhatus psühhofüsioloogia rakendustesse", "KURSUSE_KOOD": "SVPH.00.058", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Psüühika põhifunktsioonid"], "SOOVITUSLIKUD_EELDUSAINED": [], "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab mitmete psühhofüsioloogiliste mõõdikute (sh EEG, EKG, EMG ja silmaliigutuste) praktilise mõõtmiskogemuse ja sissejuhatavad teadmised nende mõõdikute tööpõhimõtetest. Kursusel osalejad loovad füsioloogiliste signaalide mõõtmistega kombineeritavaid programme ja eksperimente. Eksperimentide loomiseks kasutatakse PsychoPy vabavaralist tarkvara ja füsioloogiliste signaalide (va silmaliigutused) mõõtmiseks spetsiaalselt selle kursuse tarbeks soetatud ja avatuse põhimõttel loodud OpenBCI mõõteseadmeid. Silmaliigutuste mõõtmiseks kasutatakse tuntud silmaandurite tootja (Tobii) poolt laiemale tarbijale suunatud andureid (Tobii Eye Tracker 5). Kursusel osaleja saab baasteadmised nende vahendite rakendamise põhimõtetest ja oskab leida usaldusväärset infot tulevaste ideede teostamiseks ning omandatud oskuste laiendamiseks.Objectives/eesmärkid:  Kursus annab mitmete psühhofüsioloogiliste mõõdikute (sh aju elektrilise aktiivsuse, südame-, lihasaktiivsuse ja silmaliigutuste) praktilise mõõtmiskogemuse ja sissejuhatavad teadmised nende mõõdikute tööpõhimõtetest. Kursusel luuakse lihtsamaid füsioloogiliste signaalide mõõtmistega kombineeritavaid programme ja eksperimente.Learning outcomes/õpiväljund:  Kursuse edukas lõpetaja: o\tOmab alusteadmisi põhiliste psühhofüsioloogiliste signaalide mõõtmise põhimõtetest ning oskab leida usaldusväärseid allikaid saadud teadmiste süvendamiseks tulevikus o\tOmab mitmete psühhofüsioloogiliste signaalide (sh EEG, EMG, EKG ja silmaliigutused) mõõtmise praktilist kogemust o\tNimetab kursusel kasutatud füsioloogiliste mõõdikute põhilisi rakendusi nii laboris kui laborist väljaspool o\tHoomab kursusel kasutatud signaalide tõlgendamise konteksti ja testib praktikas nende signaalide kvaliteeti mõjutavaid tegureid o\tTunneb peamisi PsychoPy funktsioone ja loob iseseisvalt psühholoogiliste katsete juhtfaile ning hangib infot selle käigus tekkinud probleemide lahendamiseks o\tÕpib hindama ja rakendab katse ülesseadmise seisukohalt kriitilisemaid katseseadmete riistvaralisi piiranguid ning valdab sellega seonduvat põhilist terminoloogiat  o\tOn tutvunud kursusel kasutatud signaalidel põhinevate aju-arvuti liidestega ja arutleb nende vahendite rakendatavuse hetkeseisu üle"}