{"KURSUSE_NIMI": "Praktika", "KURSUSE_KOOD": "SVPH.00.056", "EAP": 6, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "independent_work": 48, "individual_work": 0, "internship": 100}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Töö üliõpilase poolt välja pakutud asutustes ja organisatsioonides (ametid, ettevõtted jt) psühholoogia-alase haridusega töötaja juhendamisel. Praktika käigus toimub tutvumine praktikakoha töövaldkondade ja -ülesannetega. Praktika lõpeb kirjaliku praktikaaruande esitamisega ja aruande kaitsmisega. Praktikaaruanne sisaldab ülevaadet praktikakoha töövaldkondadest ja -ülesannetest ning analüüsib neid praktikandi püstitatud eesmärgi ja tulevikuoskuste kontekstis.\nNB! Iga üliõpilane vastutab praktikakoha lõpliku leidmise eest ise. Praktika alguses tutvustatakse võimalikke partnereid, kellega varasemalt on koostööd tehtud.Objectives/eesmärkid:  Praktika eesmärgiks on saada praktilise töö analüüsi kogemusi, rakendades omandatud teoreetilisi teadmisi konkreetsete probleemide analüüsimisel ja lahendamisel. Praktika käigus seotakse teoreetilised teadmised ja praktilised oskused eesmärgiga arendada eriala-üleseid e nn ülekantavaid oskusi (vaatlemine, ajajuhtimine, meeskonnatöö, suhtlemisoskus jms), tulevikuoskusi (vaata ka http://www.iftf.org/futureworkskills/ ) ning kinnistada ja süvendada psühholoogia-alaste teadmiste rakendamist igapäevaelu keskkonnas.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: - teab, millised on  reaalses töökeskkonnas tegutsemisele esitatavad nõuded; - oskab leida näiteid psühholoogia teooriates käsitletu ilmnemisest reaalses töökeskkonnas;  - analüüsib saadud kogemusi ja  praktilisi tulemusi ning seostab neid teoreetiliste lähtekohtadega antud probleemvaldkonnas; - rakendab süstemaatiliselt vaatlusmeetodit, - planeerib oma aega; - on omandanud oma tegevuse eesmärgistamise ning aru andmise oskuse; - on omandanud meeskonnatöö kogemusi; - viib läbi eneseanalüüsi."}