{"KURSUSE_NIMI": "Kognitiivsete protsesside arengu mõistmine ja arvestamine töös lapsega", "KURSUSE_KOOD": "SVPH.00.083", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 20, "colloquium": 0, "web_learning": 0, "independent_work": 110, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel käsitletakse erinevaid kognitiivse arengu ja sellega seotud psüühiliste protsesside arengu seaduspärasusi. Teemadest käsitletakse täidesaatvate funktsioonide, kõne ja mõistete arengut. Lisaks käsitletakse metakognitsiooni arengut, mis puudutab kõiki eelnimetatud valdkondi. Kursus sobib kõikidele, kes töötavad lastega või puutuvad kokku laste arengu hindamisega. Kursuse raames tutvuvad õppijad teemakohase kirjandusega autoriteetsetelt autoritelt, arutavad teemaga seonduvaid sisulisi ja praktilisi küsimusi ning peegeldavad oma arusaama käsitletud teemadest iseseisvates töödes.Objectives/eesmärkid:  Aine eesmärk on anda ülevaade üldistest seaduspärasustest ja ealistest muutustest kognitiivsetes protsessides. Aine raames tutvustatakse täidesaatvaid funktsioone ning nende arengut, arutletakse selle üle, kuidas need seostuvad lapse igapäevase toimetulekuga. Lisaks antakse ülevaade kõne arengust (sh puudutatakse kakskeelsete laste kõne arengut) ning mõtlemise ja mälu arengust. Aine annab hea alusteadmise nii tulevasele koolipsühholoogile kui ka kliinilistele psühholoogidele ning nõustajatele, kes edaspidises töös lastega tegelevad või laste hindamisega kokku puutuvad. Samuti sobib ülevaatekursus tudengitele, kes on ennekõike huvitatud teadustööst laste valimil.Learning outcomes/õpiväljund:  - tunneb täidesaatvate funktsioonide, kõne, mälu, teadmiste ja kognitiivse kontrolli arengu seaduspärasusi   - oskab kirjeldada vanuse ja kogemusega seotud arengulisi muutusi täidesaatvates funktsioonides, kõne, mälu ja mõtlemise arengus (sh muutused mõistetes ja metakognitsioonis)   - teab, kuidas igapäevastes tegevustes arvestada ealiste eripäradega ja toetada laste täidesaatvate funktsioonide, teadmiste ja kõne arengut"}