{"KURSUSE_NIMI": "Sotsiaalpsühholoogia", "KURSUSE_KOOD": "SVPH.00.030", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 36, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 116, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus tugineb Myersi ja Twenge õpikule Social Psychology pakkudes põhjalikku ülevaadet sotsiaalpsühholoogia olulisematest teemadest ja rakendustest. Kursuse eesmärk on uurida, kuidas sotsiaalne mõjutamine kujundab inimeste mõtteid, tundeid ja käitumist, aidates mõista ühiskondlikke ja isiklikke protsesse mitmel tasandil. Õppetöö keskendub sellele, kuidas inimesed tajuvad ja tõlgendavad sotsiaalset reaalsust ning millist rolli mängivad sotsiaalsed normid ja grupid meie igapäevaelus.\n\nKursuse teemade hulka kuulub sotsiaalne tunnetus, mis käsitleb viise, kuidas inimesed töötlevad ja salvestavad sotsiaalset teavet, sealhulgas stereotüüpe ja heuristikaid. Samuti uuritakse sotsiaalset mõjutamist, keskendudes võimu ja konformismi mõjudele ning grupimõtlemise rollile otsuste tegemisel. Suurt rõhku pannakse suhtumiste ja nende muutumise teooriatele, sealhulgas veenmise mehhanismidele ja kognitiivsele dissonantsile.\n\nLisaks käsitletakse eelarvamuste ja diskrimineerimise allikaid, uurides, kuidas sotsiaalsed normid ja stereotüübid kujundavad inimeste vaateid ja kuidas nende mõju vähendada. Kursus hõlmab ka inimestevaheliste suhete psühholoogiat, pöörates tähelepanu armastusele, altruismile ja agressioonile, ning uurib grupiprotsesse, sealhulgas koostööd ja konflikte.\n\nÕppetöö keskendub sotsiaalpsühholoogia praktilistele rakendustele, rõhutades selle olulisust erinevates valdkondades, nagu tervis, haridus ja õigussüsteem. Läbi teaduspõhise lähenemise saavad üliõpilased väärtuslikud teadmised ja oskused, mis aitavad mõista ja lahendada kaasaegseid ühiskondlikke väljakutseid. Objectives/eesmärkid:  Sotsiaalpsühholoogia kursuse õpetamise põhiväärtused:  VABADUS (võimalus õppida siis kui selleks teie arvates on kõige parem aeg),  VÕRDSUS (kuigi teie taustad võivad erineda, on kõigil võrdsed võimalused omandada see aine heal rahvusvahelisel tasemel),  ISESEISVUS (igaühel on sisemine motivatsioon otsustada, kui palju ja mida ta õpib), KOHUSETUNNE (mina edastan teadmised täpselt ja õigeaegselt, teie võtate need vastu. Vastan alati teie kirjadele ning olen teie jaoks olemas).  See kursus annab põhiteadmised sotsiaalsetest protsessidest ja käitumisest, aidates mõista, kuidas sotsiaalne keskkond mõjutab inimeste mõtteid, emotsioone ja tegevusi. Kursus arendab kriitilist mõtlemist sotsiaalsete nähtuste ja teooriate suhtes, näitab, kuidas sotsiaalpsühholoogia teadmisi rakendada erinevates valdkondades, ning õpetab uurimismeetodeid ja andmeanalüüsi oskusi. Samuti süvendab kursus arusaamist sotsiaalsetest probleemidest ja nende lahendustest ning suurendab teadlikkust kultuurilise ja isikliku mitmekesisuse mõjudest. Kursuse põhiõpik, mille alusel õpetatakse sarnaseid kursusi paljudes maailma ülikoolides, tagab rahvusvahelise tasemega hariduse.Learning outcomes/õpiväljund:  Oleme oma olemuselt sotsiaalsed olendid. See kursus annab osalejatele teadusliku lähenemisviisi, kuidas võib inimesi mõjutada ja kuidas meid ümbritsevad inimesed meie mõtteid, tundeid ja käitumist omakorda mõjutavad. Peamised eesmärgid on järgmised: 1) Tuvastada ja mõista sotsiaalpsühholoogia valdkonna peamisi teooriaid, põhimõtteid ja uurimistulemusi. 2) Määratleda sotsiaalpsühholoogilistes uuringutes kasutatavad põhilised teaduslikud meetodid. 3) Rakendada sotsiaalpsühholoogiliste teooriate ja põhimõtete rakendamist reaalses elus nii iseenda kui ka laiemas sotsiaalses kontekstis. 4) Oskab hinnata kriitiliselt sotsiaalpsühholoogilisi teooriaid ja uuringuid. 5) Kirjutab selgelt ja loogiliselt, olles võimeline selgitama oma seisukohti mitmesugustes sotsiaalpsühholoogia küsimustes."}