{"KURSUSE_NIMI": "Psühholoogia roll digitoodete loomises", "KURSUSE_KOOD": "SVPH.00.059", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "KOHUSTUSLIKUD_EELDUSAINED": ["Psüühika põhifunktsioonid"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 22, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kaasaegne psühholoog peaks olema kursis lisaks inimestevahelise interaktsiooni mõistmisele ja juhtimisele ka inimese ja tehissüsteemide interaktsiooniga. Viimast valdkonda käsitleb praktilisel tasandil kasutajakogemuse (UX) disain. Kasutajakogemuse disainer kujundab tehnoloogia ja inimese vahelist suhtlust, luues näiteks mobiili- ja veebirakendusi, isesõitvate autode ja robotite kasutajaliideseid, aga ka e-teenuseid ja interaktiivseid platvorme. Antud kursusel läbitakse nii teooriaõppes kui ka praktiliste harjutuste kaudu kasutajakogemuse disaini põhietapid.\nDigitehnoloogia ettevõtted ootavad oma kollektiividesse psühholoogia vallas väljaõppe saanud info- ja kommunikatsioonitehnoloogia (IKT) teadmistega spetsialiste, kelle tegevusvaldkonnad ulatuksid digitoodete arendamisest toetava töökeskkonna kujundamiseni. Toimuvate loengute seerias räägivad lisaks ettevõtete esindajad sellest, mida konkreetsed digiettevõtted teevad, millised võimalused ja probleemid neil tekivad ning kuidas need seostuvad psühholoogiaga. Samuti antakse ülevaade, milliseid rolle psühholoogid nende ettevõttes juba täna täidavad ja milliseid digipädevusi nad selle jaoks omavad või omandama peaksid.Objectives/eesmärkid:  Anda tulevastele lõpetajatele (1) ettekujutus, millised on võimalused digitehnoloogia tööturul psühholoogia-alaste teadmistega spetsialistide rakendamisel ning lisaks (2) esmased oskused inimese ja tehissüsteemide interaktsiooni juhtimisel läbi kasutajakogemuse disaini.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: - On kursis kaasaegse inimese ja masina vahelise interaktsiooni käsitlusega.\n- Omab ülevaadet erinevatest kasutajaliideste tüüpidest.\n- Oskab hinnata kasutajaliidese kognitiivset koormust.\n- Suudab teostada elementaarset kasutajakogemuse disainiprotsessi, jõudes kasutaja vajaduste kaardistamisest ja andmete süstematiseerimisest prototüübi disainimise ja testimise ning projekti üleandmiseni.\n- Mõistab, et kasutajakogemuse disain on ülekantav ka väljaspoole digivaldkonda ning suudab tuua vastavaid näiteid.\n- Teab, kuidas on kujundatud eduka digiettevõtte sisekultuur ja oskab sellega meeskonnas töötades arvestada.\n- Tunneb erinevate töökorralduste eripärasid ning oskab vajadusel kontakttööd kaugtööks ümber korraldada.\n- Teab põhilisi eetilisi riske uute tehnoloogiliste lahenduste disainimises ning oskab neid digitoodete arendusprotsessis arvesse võtta."}