{"KURSUSE_NIMI": "Inimese psühholoogilised ressursid ja nende arendamine (psühholoog-nõustaja)", "KURSUSE_KOOD": "SVPH.00.089", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 4, "practice": 4, "seminar": 16, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus „Inimese psühholoogilised ressursid ja nende arendamine” tutvustab magistriõppe psühholoogiatudengitele psühholoogilisi ressursse ja nende arendamise võimalusi. Keskendudes positiivse psühholoogia ja psühholoogilise kapitali kontseptsioonidele, uuritakse enesekontrolli, kompetentsust, optimismi, sotsiaalsust ja lootusrikkust kui vaimse heaolu olulisi alustalasid. Kursus hõlmab praktilisi meetodeid enesehinnangu, sisekõne, teadveloleku, resilientsuse ja eneseregulatsiooni tugevdamiseks.\nTudengid omandavad oskusi, kuidas rakendada muuhulgas mängulisust, empaatiat ja tähenduse loomist nii isiklikus arengus kui ka nõustamispraktikas. Läbi kogemusliku õppimise õpitakse ära tundma ja kasutama psühholoogilisi ressursse toimetulekuks ja vaimse heaolu edendamiseks, pakkudes klientidele teaduspõhiseid ja tõhusaid lahendusi.Objectives/eesmärkid:  Kursus tutvustab inimese psühholoogilisi ressursse, nende arendamise võimalusi ning praktilisi meetodeid, mida magistriõppe psühholoogiatudengid saavad rakendada nii isiklikus arengus kui ka nõustamispraktikas. Kursus toetab tudengite oskust kasutada ressursipõhist lähenemist nii enda kui klientide vaimse heaolu ja toimetuleku edendamiseks.Learning outcomes/õpiväljund:  * Tunneb harjutusi, mis pikaajalisel praktiseerimisel tagavad tõhusa eneseregulatsiooni, on võimeline neid iseseisvalt läbi viima ja ka teisele õpetama. * Oskab kirjeldada inimese psühholoogiliste ressursse ja nende tähtsust. * Tunneb tõenduspõhiseid meetodeid psühholoogiliste ressursside hindamiseks ja arendamiseks. * Oskab rakendada praktikas erinevaid harjutusi ja nippe klientide probleemide leevendamiseks ja ka isiklikuks arenguks. * Oskab analüüsida eetilisi ja praktilisi aspekte, mis on seotud ressursside arendamisega nõustamises. * Kujundab teadlikkust enda ressurssidest ja nende kasutamisest professionaalses rollis Kursusel osalemine eeldab isikliku vastutuse võtmist oma piiride ja heaolu eest; iseenda ja kaastudengite heatahtlikku ja lugupidavat kohtlemist; ning valmisolekut kursusekaaslaste ees sõna võtma ning harjutusi läbi viima ja ka tesiste harjutuste ajal katseisikuks olema."}