{"KURSUSE_NIMI": "Mitmekultuurilisus, õpi- ja tööränne karjääri kujundamise kontekstis", "KURSUSE_KOOD": "SVPH.00.066", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 40, "seminar": 20, "independent_work": 44, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus annab õppijatele teadmisi inimeste toetamisest õpi- ja töörände teemadel ning  mitmekultuurilisusest, sh tööst erineva kultuuritaustaga kliendiga. Kursusel õpitakse kuidas pakkuda tuge rahvusvahelise õpi- ja töörände teemal ning kuidas võimestada inimesi rahvusvahelisel tasandil.\n\nKursus koosneb neljast võrdsest moodulist:\n1.\tMitmekultuurilisus ja rahvusvaheline ränne (26 ak/h), sh  2 seminari (6 ak/h)\n2.\tKarjäärinõustamine ja õpiränne (26 ak/h), sh 1 seminar (4 ak/h) \n3.\tKarjäärinõustamine ja tööränne (26 ak/h) sh 1 seminar (4 ak/h) \n4.\tKultuuridevaheline kompetents ja erineva kultuuritaustaga inimeste nõustamine (26 ak/h), sh 1 seminar (6 ak/h)Objectives/eesmärkid:  Kaasaegsetele teooriatele ja uuringutele tuginev kursus annab võimaluse mõtestada inimeste õpirännet, töörändega seotud küsimusi ja mitmekultuurilisust laiemalt ning saada teadmisi tööks inimestega, kes soovivad minna õppima või töötama välismaale ning kes on tulnud Eestisse välismaalt ja soovivad karjäärialast nõustamist.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: - teab õpi- ja töörände põhimõisteid ja olemust; - mõistab õpi- ja töörände tähtsust ning selle potentsiaali karjääri kujundamisel; - teab erinevaid rahvusvahelise rände võimalusi ja allikaid; - oskab toetada indiviide õpi- ja töörändega seotud küsimustes, sh motiveerida, ette valmistada, toetada kogu protsessi jooksul; - mõistab, mis on mitmekultuurilisus, saab aru erinevate kultuuride eripäradest ja väärtuste mitmekesisusest ning oskab erineva kultuuri taustaga kliente nõustada Eestis õppimisega ja töötamisega seotud küsimustes. Kursus on võimalik läbida täielikult iseseisva õppena. \nSoovi korral on võimalus osaleda ka avaseminaril 5. september, kell 12.00-15.45, Euroopa Elamuskeskuses Tallinnas ja lõpuseminaril 14. jaanuaril kell 12.00-16.15Tallinnas."}