{"KURSUSE_NIMI": "Magistrieksam", "KURSUSE_KOOD": "SVSV.00.005", "EAP": 1, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 14, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aine on jagatud osasooritusteks läbi nelja semestri. \n\nI semester Magistrieksam 1.osa (6 EAP) \nMuutuste teoreetiliste käsitluste tutvustamine, mudeldav mõtlemine\nAvalik esinemine ja selle vastuvõtu analüüs\nKoosloome ja  fassilitaatori oskused\nArengupartnerlus ja töövarjuks olek\nArenguvestlus\n\nII semester Magistrieksam 2.osa (3 EAP)\nRakenduslik teaduskirjanduse ülevaade valitud ühiskondliku probleemi  kontekstis. Kirjalik tekst ja esitlus.\n\nIII semester Magistrieksam 4.osa (2EAP)\nKoosloomeprojekt: kavandamine, läbiviimine ja analüüs.\n\nIV semester Magistrieksam 3.osa (3 EAP) \nAnalüütilise arvamusartikli või audovisouaalse loo publitseerimine.\nPublitseerimisstrateegia. Loo plaan. Suhtlemine toimetusega ja avaldamine. Tagasiside analüüs.\n\nIV semester Magistrieksami 5.osa (1 EAP)\nProfessionaalne eneseanalüüs. \nArenguvestlus,\nKirjalik ja suuline kombineeritud lõpphindamine. Objectives/eesmärkid:  Magistrieksami eesmärk on arendada õppijate oskusi: a)  interdistsiplinaarsetes ainetes omandatavaid teadmisi omavahel lõimida ning rakendada tööalaste eesmärkide saavutamiseks; b) erialase teaduskirjanduse ülevaate koostamiseks; c) ühiskondliku probleemi ning lahendusvõimaluste avalikuks  kommunikatsiooniks; d) koosloome meetodi rakendamiseks; e) akadeemiliseks enesejuhtimiseks; f) omavaheliseks koostööks.Learning outcomes/õpiväljund:  Eksami sooritanud üliõpilane oskab:  seada professionaalseid arengueesmärke, analüüsida oma arenguvajadusi ja -võimalusi; pidada õpipäevikut ja olla kaastudengile arengupartneriks;  kasutada sotsiaalteoreetilist mudeldavat mõtlemist; koostada teaduskirjanduse ülevaadet rakenduslikul eesmärgil; publitseerida analüütilist arvamusartiklit või audiovisuaalset teksti (kanali ja stiili valik, loo kavandamine, suhtlus toimetusega, tagasiside kogumine ja analüüs);  rakendada koosloome meetodit (kavandamine, läbiviimine, tulemuste analüüs). Magistrieksami 5 osa eesmärk on....."}