{"KURSUSE_NIMI": "Tehisintellekt ja sotsiaalne õiglus: mängustatud eriseminar", "KURSUSE_KOOD": "SVUH.00.287", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 70, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursus keskendub tehisintellekti kasutamise võimaluste ja probleemide analüüsile avalikus sektoris, rõhuasetusega konkreetse valdkonna ja asutuse näitele. Õppeprotsessis uuritakse tehisintellekti rakendamise sotsiaalse õigluse aspekte ning hinnatakse selle mõju. Kursuse raames viiakse läbi mängustatud eriseminar, mis võimaldab osalejatel praktiliselt rakendada omandatud teadmisi ja arendada analüüsioskusi. Kursuse lõpetajad mõistavad tehisintellekti rakendamise keerukust ja oskavad kriitiliselt hinnata selle mõju ühiskonnale.Objectives/eesmärkid:  Aine eesmärgiks on anda ülevaade tehisintellekti kasutamise võimalustest ja probleemidest avalikus sektoris, keskendudes konkreetse valdkonna ja asutuse näitele. Aine käigus analüüsitakse konkreetse juhtumi näitel, kas ja kuidas mõjutab tehisintellekti rakendamine sotsiaalset õiglust.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: - teab tehisintellekti kasutamise põhimõtteid ja võimalusi avalikus sektoris konkreetse valdkonna ja organisatsiooni näitel; - oskab tuvastada ja analüüsida tehisintellekti kasutamisega seotud probleemkohti ja riske  konkreetse valdkonna ja organisatsiooni näitel; - mõistab tehisintellekti mõju sotsiaalsele õiglusele konkreetse valdkonna ja organisatsiooni näitel; - oskab kriitiliselt hinnata tehisintellekti rakendamise sotsiaalseid ja eetilisi aspekte  konkreetse valdkonna ja organisatsiooni näitel. Ainesse on osalema oodatud kõigi ÜTI magistritõppekavade üliõpilased. Õpe toimub eesti ja inglise keeles. Mängus osalemine eeldab inglise keele oskust."}