{"KURSUSE_NIMI": "Nõustamise ja grupitöö oskused", "KURSUSE_KOOD": "SVUH.00.180", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 58, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Loengukursus toimub interaktiivõppe vormis. Õppetöös kasutatakse grupiharjutusi, ühisarutelusid, teoorialoenguid, iseseisvat tööd kirjandusega. Loengukursuse formaat eeldab aktiivset osalemist loengutes, kuna oskuste omandamine on võimalik üksnes läbi praktiliste tegevuste.\nKursuse eesmärk on esiteks, omandada teadmised nõustamise põhimõtetest, etappidest, toimevõimekuse arengust ja omandada esmased oskused nõustamisprotsessi läbiviimiseks sotsiaalvaldkonnas klienditöös; teiseks omandada teadmised grupi kujunemise dünaamikast, grupijuhi ja grupiliikmete tegevusest grupis, eestvedamise aspektidest, grupikohtumiste planeerimisest ja samuti esmased oskused grupi eestvedamisest.Objectives/eesmärkid:  Kursuse eesmärk on esiteks, omandada teadmised nõustamise põhimõtetest, etappidest, toimevõimekuse arengust ja omandada esmased oskused nõustamisprotsessi läbiviimiseks sotsiaalvaldkonnas klienditöös; teiseks omandada teadmised grupi kujunemise dünaamikast, grupijuhi ja grupiliikmete tegevusest grupis, eestvedamise aspektidest, grupikohtumiste planeerimisest ja samuti esmased oskused grupi eestvedamisest. \n\nLoengukursus toimub interaktiivõppe vormis. Õppetöös kasutatakse grupiharjutusi, ühisarutelusid, teoorialoenguid, iseseisvat tööd kirjandusega. Nõustamise ja grupitöö oskuste loengukursuse formaat eeldab aktiivset osalemist loengutes, kuna oskuste omandamine on võimalik üksnes läbi praktiliste tegevuste.Learning outcomes/õpiväljund:  Kursuse edukal läbimisel õppija\n1. teab nõustamise põhimõtteid;\n2. teab nõustamise rakendusvaldkondi;\n3. teab nõustamisprotsessi etappe;\n4. on teadlik nõustamise kui sekkumismeetodi piirangutest (sh eetilistest aspektidest);\n5. oskab määratleda ning analüüsida nõustamisprotsessi mõjutavaid tegureid;\n6. kasutab aktiivse kuulamise oskuseid;\n7. teab, kuidas toetada kliendi aktiivsust nõustamise üheksas etapis;\n8. mõistab eneserefleksiooni olulisust nõustamise töös;\n9..on omandanud teadmised grupi dünaamikast ja erinevate etappide eripäradest, grupi tunnustest igal etapil, liikmete käitumise eripäradest, juhi funktsioonidest;\n10. teab grupi läbiviimisega seotud aspekte (grupi suurus, grupikohtumiste kestus/vältus, grupisessioonide arv, grupi läbiviimise asukoht, avatud või suletud grupi eripärad, grupikohtumiste planeerimiseks ja läbiviimiseks vajalikud ressursid) ning oskab planeerida grupisessioonide kestust;\n11. teab, kuidas planeerida ja läbi viia eesmärgi saavutamiseks sobivad ja grupile kohased tegevused ning kasutada selleks erinevaid ressursse;\n12. tunneb grupijuhi funktsioone. Õppeprotsessis osalemist toetavad konsultatsioonid toimuvad loengu eel või järel või kokkuleppel õppejõuga."}