{"KURSUSE_NIMI": "Sissejuhatus kommunikatsiooni ja meediasse", "KURSUSE_KOOD": "SVUH.00.038", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 3, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 111, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Põhilised mõisted ja uurimisvaldkonnad: teabeväli, kommunikatsiooni protsessid ja elemendid, kommunikatsiooni mudelid, ajakirjaniku ja suhtekorraldaja roll, meedia sisu, reaalsuse konstrueerimine meedias, meedia tekstid, müüdid meedias, kollektiivsed identiteedid, meedia mõju, meedia ja võim, meediateooriad, meedia roll ühiskonnas, meedia ja poliitika, meedia ja turg, auditooriumiuuringud, uus meedia, meediatehnoloogiad ja ühiskond, meedia funktsioonid ja nende analüüs, meediaorganisatsioonid.Objectives/eesmärkid:  Üks tuntumaid kommunikatsioonimudeleid on Harold Lasswelli (1948) kommunikatsiooniahel: \"Kes teatab (sõnumi saatja), mida (sõnumi sisu), mil viisil (eelkõige kanal), kellele (auditoorium), millise mõjuga (efektid)\". Sellel kursusel püüame kõigile viiele mudeli osale veidi tähelepanu pöörata, et õppija oskaks edaspidi erinevates kommunikatsioonisituatsioonides neid komponente eristada ja analüüsida. \n\nEesmärgiks on anda tudengitele ülevaade meedia ja kommunikatsiooni valdkonna põhilisi kontseptsioone ja mõisteid, luua vundament, millele toetada järgnevad erialased teadmised ja oskused. Motiveeritud õppijal on kursuse lõpuks ülevaade meedia ja kommunikatsiooni valdkonna teoreetilistest ja empiirilistest uurimistraditsioonidest, põhimõistetest ja analüüsiviisidest.Learning outcomes/õpiväljund:  Kursuse läbinud õppija: \n\n- tunneb meedia ja kommunikatsiooni valdkonna teoreetilist ja empiirilist sõnavara ja põhilisi ideid\n- on tuttav meedia ja kommunikatsiooni peamiste teoreetikute ja empiirilise materjaliga\n- saab aru põhilistest kommunikatsiooniuuringute valdkonna probleemidest\n- teeb iseseisvalt ning teistega koos meedia ja kommunikatsiooni protsesse analüüsivaid töid\n- omab esimest kogemust intervjueerimisega\n- analüüsib kriitiliselt igapäevaseid meediakontakte - loeb ja analüüsib uudiseid, mõistab meedia ja meedia funktsioonide sotsiaalseid rolle, analüüsib reklaame\n- kirjutab esimese analüütilise uurimustöö\n- juhib oma ajakasutust ja peab kinni töö ajaraamidest NB! Haigestumise korral palun üliõpilasel teatada vastutavale õppejõule haigestumisest e-kirja teel esimesel võimalusel. Õppejõud otsustab osalemise võimaluse või osaluse asendamise."}