{"KURSUSE_NIMI": "Praktiline ajakirjandus II", "KURSUSE_KOOD": "SVUH.00.111", "EAP": 12, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "KOHUSTUSLIKUD_EELDUSAINED": ["Ajakirjanduse alused", "Kuulamistreening ja intervjueerimine", "Audiovisuaalne meedia avalikus ruumis kõrvalerialale", "Sissejuhatus audiomeediasse kõrvalerialale", "Praktiline ajakirjandus I"], "SOOVITUSLIKUD_EELDUSAINED": [], "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 32, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 260, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus toimub neljas osas, aga kahes jaotuses (praktiline ajakirjandus I ja II): \nesimene osa keskendub uudisele kirjutavas meediumis, teine osa uudisele audiomeediumis, kolmas uudisele audiovisuaalses meediumis ja neljas digimeedias. Mõtteliselt on iga osa 6 EAP vääriline.\n1) uudis kirjutavas meediumis: tudengid töötavad nädalas ühe täispäeva kui reaalne toimetus, otsides kajastamisväärseid sündmusi, tehes reporteritööd ning kirjutades sama päeva õhtuks valmis uudise.\n2) uudis audiomeediumis: tutvustatakse audiouudise tegemise põhimõisteid ja aluseid. Praktiliste tööde abil omandatakse ja kinnistatakse oskusi tekstuudise ja salvestatud uudismaterjali tegemiseks, samuti toimetamisoskusi.\n3) uudis audiovisuaalses meediumis: igal nädalal kahel õppepäeval toimuv kursus keskendub uudisväärtusliku sündmuse leidmisele ja selle vormistamisele audiovisuaalseks uudiseks. \n4) uudis digimeedias: kaasaegne ajakirjandus ja digimeedia. Digimeedia arengud ja üleminekud trükimeedialt digile. Trendid digimeedias. Kommunikatsiooniprotsessid ja -ahelad meediaorganisatsioonis. Sihtrühmad, trendid. Eri allikate kasutamine. erinevate meedialiikide ja sündmuste kajastamine. Erakorraliste sündmuste ja kriiside kajastuste õppetunnid ja nende ära kasutamine igapäevatöös. \n5) tehniliste vahendite kasutamine; toimub lõimituna terve kursuse jooksul. Produktsiooni ja postproduktsiooni võtete ja kasutatavate seadmete tundma- ja kasutamaõppimine konkreetsete õppeülesannete täitmiseks ning edaspidiseks rakkepädevuseks. \nErinevate osade täpsem kirjeldus on esitatud vastava osa aineprogrammis.Objectives/eesmärkid:  Anda tudengitele praktilised oskused reporteritööks kirjutavas meediumis (sh veebis), audiomeediumis ja audiovisuaalses meediums. Kursusel õpetatakse kuidas valmistada ette, koostada ja esitada avaldamiskõlblikku uudist.Learning outcomes/õpiväljund:  Kursuse edukalt läbinud tudeng: - oskab leida, raamistada ja fookustada uudist; - mõistab taustainformatsiooni kogumise olulisust ning oskab töötada erinevate allikatega; - oskab hinnata ja valida allikaid ning mõistab kasutada erinevaid intervjueerimisvõtteid; - oskab planeerida aega, mõistab tähtaegade olulisust ajakirjanduses ning oskab ajasurve all töötada; - oskab vormistada ja klassikalise kõva uudise konventsioonidele vastavat uudist ning seda faktiliselt ja keeleliselt toimetada."}