{"KURSUSE_NIMI": "Terapeutilised lähenemised heaolu edendamisel", "KURSUSE_KOOD": "SVUH.00.184", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 4, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 54, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Aines keskendutakse järgmistele teemadele:\n1.\tPõhilised mõisted: narratiivne maailm; lapsepõlve haavatavus, trauma, lapse areng, inimsuhete terapeutiline - tervendav mõju, tervenemine, identiteet, asendushooldus.\n2.\tLapse aju areng ja seda mõjutavad tegurid. Implitsiidse ja eksplitsiidse mälu ning narratiivse mälu arendamine ja elusündmuste mõtestamise harjutamine.\n4.\tElulootöö metoodika rakendamise võimalused perest eraldatud ja asendushooldusel olevate laste ja noorte identiteedi toetamisel.\na.\tTurvaliste suhete arendamine\nb.     Eneseteadlikkuse ja enesehinnangu arendamine\nc.\tOma elu raamatu koostamise toetamine\n5.\tNarratiiviteraapia tehnikate kasutamine probleemi lahendamisel\n6.\tTerapeutiline vanemlus; terapeutilised kogukonnad.\n7.\tMiljööteraapia: \na.\tPõhimõtted; \nb.\tRakendamisviisid; \nc.\tPraktiseerimineObjectives/eesmärkid:  Aine eesmärk on tutvustada üliõpilastele sotsiaaltöös kasutatavaid terapeutilisi lähenemisi aitamaks eelkõige traumakogemusega lapsi, noori ning nende vanemaid, hooldajaid ning nendega töötavaid spetsialiste (eelkõige lasteaia ja kooli õpetajaid). Teraapia mõistet kasutatakse kursusel selle sõna laias ja kitsas tähenduses. Teraapia laia tähenduse all on inimesuhete tervendav mõju. Aine raames käsitleme hulganisti meetmeid, mis aitavad lastel areneda ning seljatada traumaatiliste sündmuste negatiivseid tagajärgi. Terapeudilise ekkumise kitsas tähendus on psühholoogi ja psühhiaatri töö abivajava lapse ja perega. Aine selle osa täidab külalisõppejõud dr. Anne Daniel-Karlsen, kes tutvustab miljööteraapia põhimõteid ning juhendab praktikume.on kursusel käsitletud külalisõppejõu abiga, kes tutvustab miljööteraapia põhimõtteid. Üliõpilased saavad tutvuda mõistetega \"traumateadlik elulootöö\", \"terapeutiline vanemlus\", \"terapeutilised kogukonnad\", \"narratiiviteraapia tehnikad\" ning miljööteraapia.Learning outcomes/õpiväljund:  Kursust läbinud üliõpilane tunneb \n- trauma mõju lapse arengule\n- inimsuhete terapeutilist, st tervendavat mõju\n- kaasaegsed lähenemisi trauma kogemusega laste, noorte ja nende perede toetamisel;\n- miljööteraapia põhimõtteid\n- elulootöö metoodika põhimõtteid ja rakendamisviise\n- narratiiviteraapia põhimõtteid ja tehnikaid Ajakavas võivad tekida muudatused, millest informeeritakse üliõpilasi esimesel võimalusel."}