{"KURSUSE_NIMI": "Eesti ajakirjanduse ja kommunikatsiooni ajalugu", "KURSUSE_KOOD": "SVUH.00.208", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 20, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 136, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Eesti ajakirjanduse ja kommunikatsiooni ajalugu:\n- põhiperioodid eesti ajakirjanduse ajaloos ja historiograafia (põhiallikad);\n- Eesti ajakirjanduse algus ja rahvuslikud tegelased ajakirjanduse kujundajatena;\n- ajakirjanduse laienemine ja politiseerumine 19. sajandi lõpus ning tsensuur;\n- ajakirjandus sõjaeelses Eesti Vabariigis (1918-1940);\n- ajakirjandus Teise maailmasõja ajal ja paguluses;\n- nõukogude ajakirjandus\n- raadio- ja teleajakirjanduse areng;\n- ajakirjanduse arengud internetiajastul;\n- kommunikatsiooni arengud, sündmused ning eksperdid lähiajaloos.Objectives/eesmärkid:  Tutvustada eesti ajakirjanduse ja kommunikatsiooni ajalugu erinevatest aspektidest, anda ülevaade arengutest erinevatel perioodidel ning mõista olulisemaid muutusi ühiskonnas ning selle raames harjutada analüüsi- ja sünteesioskust.Learning outcomes/õpiväljund:  Õppeaine annab ülevaate massikommunikatsiooni kanalite, ajakirjanduslike meetodite ja konventsioonide ning kommunikatsiooni praktikate arenemisest ja muutumisest Eestis. Üliõpilane saab ettekujutuse eesti ajakirjanduse ja kommunikatsiooni ajaloost ning tunneb ära sarnased arengutendentsid tänapäeva meediamaastikul. Kursuse edukalt läbinud üliõpilane: - orienteerub Eesti ajakirjanduse ja kommunikatsiooni arenguloo seaduspärasustes; - oskab seostada tänapäevaseid nähtusi ajakirjanduses ja kommunikatsioonis nende ajaloolise taustaga; - suudab analüüsida nii totalitaarses kui demokraatlikus riigis toimuvat kommunikatsiooni; - tunneb oluliste ajakirjanike ja meediakanalite ning kommunikatsiooniekspertide ja -sündmuste rolli Eesti ühiskonnas; - teab ajakirjanduse tehnoloogia ja kommunikatsioonipraktikate üldist arengulugu; - suhtub ettevaatlikult lihtsustatud ajalookonstruktsioonidesse ja oskab iseseisvalt uurida ning kasutada ajalooallikaid."}