{"KURSUSE_NIMI": "Ajakirjanduse ja kommunikatsiooni eetika", "KURSUSE_KOOD": "SVUH.00.223", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 2, "seminar": 12, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Konfliktsed õigused ja vabadus kommunikatsiooni regulatsioonis. Ajakirjanduse- kommunikatsiooni- ja sõnavabadus. Normatiivsed regulatsiooni mehhanismid, nende toimimine ühtse süsteemina.\n\nMoraalse arutluse protsess. Professionaalne eetika ja eneseregulatsioon.\n\nAvaliku kommunikatsiooni regualtsioon: avalikkuse huvi, avaliku elu tegelane, avaliku elu tegelane piiratud ulatuses, haavatavad isikud; avalik ruum ja privaatsus; avalik teave, konfidentsiaalne teave ja isiklik teave.\n\nInimväärikuse ja privaatsusega seotud teemad: usuliste tunnete haavamine; vihkamise õhutamine; isikuandmete avaldamine; eraellu tungimine.\n\nAvalik teave:juurdepääs informatsioonile ja konfidentsiaalne informatsioon (riigisaladus, ärisaladus, isikuandmed).\n\nPetmine ja mõjutamine: eksitavad pealkirjad; eksperimendid; reklaam.Objectives/eesmärkid:  Kursuse üks eesmärk on anda ülevaade meedia eetilisest regulatsioonist. Teine eesmärk on õpetada praktilisi võtteid, kuidas potentsiaalset õiguste konflikti ära tunda, analüüsida ja võimalusel vältida.Learning outcomes/õpiväljund:  A.\tTeadmised\nÜliõpilane omandab algteadmised  sõnavabaduse teoreetilistest alustest, avalikku kommunikatsiooni reguleerivatest printsiipidest, professionaalsest eetikast ja ühiskonnas toimivatest kontrollisüsteemidest.\n\nB.\tErialased oskused ja pädevused \nÜliõpilane omandab oskuse leida ja kasutada erinevat tüüpi konfliktsete juhtumite puhul kommunikatsiooni valdkonnas kehtivaid eetilisi ja seaduslikke põhimõtteid. Oskab üldjoonetes ette näha võimalikku konflikti sõnavabaduse ja teiste õiguste ning printsiipide vahel.\n\nC.\tÜldpädevused. \nÜliõpilane arendab tekstianalüüsi meetodite rakendamist, erinevat tüüpi tekstidest arusaamist, allikakasutuse oskust ja kriitilist eneserefleksiooni oskust oma teadmiste ulatusest."}