{"KURSUSE_NIMI": "Andmekaitse", "KURSUSE_KOOD": "SVUH.00.193", "EAP": 4, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 6, "colloquium": 0, "web_learning": 0, "independent_work": 84, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Õppetöö koosneb iseseisvast õppest, ühest väiksema mahulisest praktilisest ülesandest ja ühest mahukamast probleemi analüüsi ülesandest. Lisaks toimub teemaseminarides väiksemaid praktilisi ülesandeid, mis õpitut kinnistavad.\nIseseisva õppe osakaal on suur. Kuna ühe semestri jooksul tuleb jõuda tasemest, kus üliõpilane mitte midagi ei tea, tasemeni, kus üliõpilane oskab iseseisvalt andmekaitse teemalistel aruteludel kaasa mõelda ja oma seisukohti põhjendada. Selleks tuleb õppeaines palju lugeda. Kohustuslik lugemismaterjal hõlmab kõrgkooliõpiku peatükke, Euroopa Liidu andmekaitseõiguse käsiraamatu peatükke Andmekaitse Inspektsiooni juhiseid, Euroopa Andmekaitse Nõukogu juhiseid ning akadeemilisi artikleid.\nPraktiline ülesanne on individuaalne või rühmas (sõltub osalejate arvust). Ülesande sisuks on hinnata mõne isikuandmete töötlemisel põhineva teenuse, millega üliõpilane ise sageli kokku puutub, kooskõla andmekaitse üldpõhimõtetega. \nMahukam analüütiline ülesanne on rühmatööna tehtav juhtumi analüüs, mis koosneb analüüsi kavast ja lõppanalüüsist. Juhtumi analüüsi käigus seostab üliõpilane kõik õppeaine jooksul omandatud teadmised enda valitud päriselulise näidisolukorraga, tuues välja andmekaitse alaseid probleeme ja pakkudes lahendusi.Objectives/eesmärkid:  Õppeaine eesmärk on tutvustada isikuandmete kaitsega seotud õiguslikke, eetilisi ja ühiskondlikke aspekte. Õppeaine on praktilise kallakuga: eesmärk on anda üliõpilasele minimaalsed vajalikud teadmised ja oskused selleks, et nii oma isiklikus eraelus kui ka tööalases tegevuses isikuandmete töötlemisega edukalt toime tulla. Lisaks aitab õppeaine seostada andmekaitse alaseid teadmisi ja oskusi üldiste ühiskondlike ja tehnoloogiliste väljakutsetega. \nÕppeaine läbimine annab üliõpilasele ülevaate andmekaitse valdkonnast vajalikul tasemel, et üliõpilane oleks teadlik isikuandmete töötlemisega seotud ohtudest, tunneks enda õiguseid ja oskaks arvestada teiste õigustega enda töös. Õppeaine on mõeldud üliõpilastele, kes andmekaitsest ei tea midagi või teavad väga vähe.Learning outcomes/õpiväljund:  Õppeaine läbinud üliõpilane: 1.\tteab andmekaitse põhimõisteid ja oskab neid vastavateemalises diskussioonis kasutada; 2.\tteab andmekaitse põhimõtteid ja oskab neid päriseluliste olukordadega seostada; 3.\tteab üldjoontes, kuidas on isikuandmete kasutamine Eestis ja Euroopa Liidus reguleeritud; 4.\tteab enda õiguseid oma isikuandmete suhtes ja oskab neid kasutada; 5.\ttunneb olulisemaid õigusakte ja juhendeid ning oskab iseseisvalt leida vastuseid lihtsamatele andmekaitset puudutavatele küsimustele; 6.\toskab märgata privaatsuse ja andmekaitse alaseid probleeme enda elus ja ühiskonnas; 7.\toskab iseseisvalt kujundada hinnanguid ühiskondlikel isikuandmete kaitset puudutavatel teemadel ja oskab neid argumenteeritult põhjendada."}