{"KURSUSE_NIMI": "Sissejuhatus audiovisuaalsesse meediasse", "KURSUSE_KOOD": "SVUH.00.225", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 24, "practice": 24, "seminar": 24, "colloquium": 0, "web_learning": 0, "independent_work": 83, "individual_work": 1, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse audiotekstidele keskenduval osal saab õppija ülevaate raadio kujunemisloost ning raadio rollist ühiskonnas; analüüsime erinevaid auditiivsete tekstide žanre, vorme ja formaate ning proovime neid koos ajakirjanike ja meediajuhtidega mõtestada. Kursuse praktilisemas osas saavad tudengid muu hulgas proovida tekstide toimetamist audiotekstideks ja nende salvestamist. Kursus käsitleb nüüdseid suundumusi audiovisuaalses meedias. Käsitlust leiab ringhääling kui majanduslikke erahuvisid teeniv ettevõtlusharu ja kui demokraatiat soodustav tegur, analüüsitakse kriise ja katseid määratleda avalikõigusliku ringhäälingu rolli nüüdses audiovisuaalses keskkonnas. Teleprogrammi vaadeldakse kui kanali identiteedi kandjat ning tutvustatakse programmi koostamise põhimõtted, analüüsitakse auditooriumi mõju teletööstusele, tehnoloogilisi muutusi televisioonis, digitaalset ja interaktiivset televisiooni.Kursus käsitleb televisiooni arengut võrdlevalt USA, Suurbritannia ja Eesti näitel, käsitleb televisiooni žanrilisest aspektist ning televisiooni esteetikat võrdluses teiste meediumidega (film, raadio, teater). Kursus tutvustab mõisteid žanr ja formaat ning annab ülevaate televisiooni põhižanridest (uudis, reportaaž, teledokumentaal, vestlus, teledraama).Objectives/eesmärkid:  Kursuse eesmärk on anda alusteadmised sisu loomiseks helipõhisele ja audiovisuaalsele meediale. Kursus annab alusteadmised raadioga seonduvatel teemadel makro-, meso- ja mikrotasemel. Kursus annab ülevaate filmi ja televisiooni kui kesksete audiovisuaalsete meediumide arengust ning rollist üldisel meediaväljal, eesmärgiga teada ja osata kasutada audiovisuaalsete meedialiikide võimalusi ja väljendusvahendeid avalikus kommunikatsioonis.Learning outcomes/õpiväljund:  Kursuse läbinud tudeng:\n* omab ülevaadet helipõhise ja audiovisuaalse meedia eripäradest ja võimalustest;\n* oskab märgata audiovisuaalse meedia makro-, meso ja mikrotasandi olulisi nüansse;\n* oskab kriitiliselt analüüsida helilise ja audiovisuaalse meedia sisu;\n* mõistab, kuidas kasutada kursusel omandatud teadmisi, et luua sisu helipõhisele ja audiovisuaalsele meediale;\n* on teadlik oma tugevustest ja nõrkustest eetritekstide loomisel;\n* tunneb audiovisuaalse meedia võimalusi avalikus kommunikatsioonis, teleajakirjanduse arenguetappe ja põhivorme ning nende seoseid ühiskonna arenguga. \nEeldusaine praktilise ajakirjanduse kursusele (SVUH.00.110 Praktiline ajakirjandus I; SVUH.00.111 Praktiline ajakirjandus II). Õppeaine asendab enne 2023/2024 õa õpinguid alustanud üliõpilastele aineid: \nSVUH.00.139 Sissejuhatus audiomeediasse 3 EAP ja SVUH.00.140 Audiomeedia avalikus ruumis 3 EAP.\n\nKõrvalerialana ajakirjandust või kommunikatsiooni 2022/2023 õa või varasema versiooni alusel õppivatele üliõpilastele asendab aineid:\nSVUH.00.108 Sissejuhatus audiomeediasse kõrvalerialale 2 EAP ja SVUH.00.109 Audiovisuaalne meedia avalikus ruumis kõrvalerialale 2 EAP."}