{"KURSUSE_NIMI": "Meediamajandus ja -ettevõtlus", "KURSUSE_KOOD": "SVUH.00.280", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 2, "practice": 0, "seminar": 14, "colloquium": 0, "web_learning": 0, "independent_work": 140, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursusel käsitletakse teemasid: \n1. Meediamajanduse lähtekohad ja baasmõisted, meediaorganisatsioonide toimimise majanduslikud alused: dualistliku turu põhimõtted; konkurents, oligopoolne seisund turul, toote diferentseerumine ja hinnakujundus; püsikulud ja muutuvkulud erinevat tüüpi meediaorganisatsioonides, tähelepanuturu kontseptsioon; \n2. Meediamajanduse transformatsioonist ühismeedia ja osaluskultuuri ajastul: uudisteturu muutumine ja uued ärimudelid, tööjõu maksumus, koosloome teooriad ja praktikad, nišiauditooriumite konstrueerimine;\n3. Meediapoliitika ja võimusuhted: kriitiline vaade globaliseeruvale meediaturule, internetihiidude rollile tänapäevasel info-ja kommunikatsiooniturul, otsingumootorite toimimisloogikale ning kasutajate loodud sisu ja n-ö nähtamatu tööjõu küsimusele;\n4. Blogid ja ühismeedia kui eneseturunduse kanalid: ajakirjanike eneseturundus, mikrokuulsuste ärilised praktikad ja eetika, blogiturundus ning oma ettevõtte nähtavuse kasvatamise võimalused ühismeedias.\n5. Meediaettevõtte loomine: äriplaani tegemine, majanduskeskkonna analüüs, eelarvestamine, riskide hindamine.Objectives/eesmärkid:  Tutvustada meediamajanduse põhimõisteid, avada tänapäevaseid poliitökonoomia teooriaid ning mõtestada tähelepanuturu väljakutseid ning võimalusi meedia- ja kommunikatsiooni ettevõtete jaoks, käsitleda eesti meediaturu eripära ja selle transformeerumist ühismeedia ajastul. Rakendada meediamajanduse alusteadmisi meediaettevõtluse harjutamisel.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane:   - omab ülevaadet meediamajanduse baasterminoloogiast ning oskab seda konkreetsetes analüüsides rakendada; - omab baasteadmisi tänapäevase tähelepanuturu võtmeteguritest ning mõistab meediapoliitika ja meediamajanduse toimemehhanismide seoseid; - oskab iseseisvalt leida asjakohaseid akadeemilisi allikaid ning neid kriitiliselt analüüsida. - on teinud läbi ettevõtte loomiseks vajalikud sammud, võttes arvesse meediaäri ühiskondlikku ja regulatiivset konteksti."}