{"KURSUSE_NIMI": "Audiovisuaalne meedia avalikus ruumis", "KURSUSE_KOOD": "SVUH.00.140", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 42, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb nüüdseid suundumusi audiovisuaalses meedias. Käsitlust leiab ringhääling kui majanduslikke erahuvisid teeniv ettevõtlusharu ja kui demokraatiat soodustav tegur, analüüsitakse kriise ja katseid määratleda avalikõigusliku ringhäälingu rolli nüüdses audiovisuaalses keskkonnas. Teleprogrammi vaadeldakse kui kanali identiteedi kandjat ning tutvustatakse programmi koostamise põhimõtted, analüüsitakse auditooriumi mõju teletööstusele, tehnoloogilisi muutusi televisioonis, digitaalset ja interaktiivset televisiooni. \nKursus käsitleb televisiooni arengut võrdlevalt USA, Suurbritannia ja Eesti näitel, käsitleb televisiooni žanrilisest aspektist ning televisiooni esteetikat võrdluses teiste meediumidega (film, raadio, teater).  Kursus  tutvustab mõisteid žanr ja formaat ning annab ülevaate televisiooni põhižanridest (uudis, reportaaž, teledokumentaal, vestlus, teledraama).\n\nKursuse detailsem kirjeldus koos eksaminõuetega on esitatud aineprogrammis.Objectives/eesmärkid:  Kursus annab ülevaate filmi ja televisiooni kui kesksete audiovisuaalsete meediumide arengust ning rollist üldisel meediaväljal, eesmärgiga teada ja osata kasutada audiovisuaalsete meedialiikide võimalusi ja väljendusvahendeid avalikus kommunikatsioonis.Learning outcomes/õpiväljund:  Õppeaine edukal läbimisel oskab üliõpilane kasutada omandatud teoreetilisi teadmisi audiovisuaalse meedia analüüsimisel, tunneb audiovisuaalse meedia võimalusi avalikus kommunikatsioonis, teleajakirjanduse arenguetappe ja põhivorme ning nende seoseid ühiskonna arenguga. Eeldusaine praktilise ajakirjanduse kursusele (SVUH.00.110 Praktiline ajakirjandus I; SVUH.00.111 Praktiline ajakirjandus II). Kesksed teemad:\n*Eesti aruteluruum.\nAruteluruumi luuakse erinevate meediumidega. Siia kuuluvad nii klassikalised, ajakirjandus ja ringhääling kui ka uuemad, ajakirjandusväljaannete veebikeskkonnad, sotsiaalmeediaplatvormid, erinevate kogukondade arutelukeskkonnad internetis. \n*Televisiooni üldised arenguetapid võrdlevalt (peamiselt) USA, Suurbritannia ja Eesti näitel. \n*Televisiooni esteetika võrdluses teiste meediumidega (film, raadio, teater).\n*Avalik-õigusliku televisiooni roll nüüdses audiovisuaalses keskkonnas.\n*Eratelevisioon kui majanduslikke erahuvisid teeniv ettevõtlusharu ja kui demokraatiat soodustav tegur.\n*Televisiooni žanrilised aspektid. Mõisted žanr ja formaat. Ülevaade televisiooni põhižanridest (uudis, reportaaž, teledokumentaal, vestlus, teledraama peamised liigid).\n*Teleprogramm kui ringhäälinguorganisatsiooni identiteedi kandja. Programmi koostamise põhimõtted avalikõiguslikus ja eraõiguslikus meedias.\n*Auditooriumi mõju teletööstusele.\n*Tehnoloogilised muutused telemeedias, digitaalne ja interaktiivne televisioon."}