{"KURSUSE_NIMI": "Meediapädevuste mänguline arendamine", "KURSUSE_KOOD": "SVUH.00.263", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 6, "practice": 6, "seminar": 10, "independent_work": 56, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursusel arendatakse laste ja noortega tegelevate spetsialistide (digi)meedia-alaseid oskuseid ja teadmisi, väärtuseid ja hoiakuid, mida seostatakse kaasaegses infokeskkonnas toimetuleku ja infovastupidavusega. Kursusel keskendume peamiselt lasteaialastele ja nooremale koolieale ning füüsilises ruumis toimuvatele mängudele.Objectives/eesmärkid:  Kursuse eesmärk on anda värske ning põhjalik ülevaade sellest, millised on laste tänased meediamaailmad, võimalused ja riskid, millega seal kokku puututakse. Kursusel antakse osalejatele põhilised oskused ja teadmised, mida on vaja selleks, et mõista ning juhendada lapsi ja noori (sotsiaal)meedia teemade baaspädevuste osas. Kursusel osalejad õpivad laste ja noorte meediakasutuse ning peamiste veebiriskide kohta nii akadeemilis-teoreetilises võtmes kui ka läbi praktiliste mänguliste lähenemiste.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: omab ülevaadet põhilistest väärtustest, hoiakutest, oskustest ja teadmistest, mida on vaja laste/noorte (sotsiaal)meediakasutuse arendamisel silmas pidada analüüsib ja märkab erinevate generatsioonide meediakasutuses ja tajutud normides sarnasusi ja erinevusi teab, millistest komponentidest koosnevad peamised digi-, meedia- ja infopädevuste ning veebimeediariskide teoreetilised raamistused omab esmast ülevaadet Eesti meediahariduse süsteemist harjutab ja analüüsib 4k-riskimudeli järgi valminud mänge ning näeb võimalusi olemasolevate/tuttavate mängustruktuuride kohandamiseks digi, meedia- ja infopädevuste arendamiseks oma (tulevases) töös katsetab praktiliselt vähemalt üht mängulist lähenemist ning reflekteerivad selle üle"}