{"KURSUSE_NIMI": "Andmepädevus", "KURSUSE_KOOD": "SVUH.00.059", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 26, "practice": 26, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 104, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tänapäeval võivad andmed olla väga erinevat formaati ja tüüpi, nii et tööst andmetega moodustab suurema osa mitte sisuline analüüs, vaid sellele eelnev tehniline töötlemine / andmete sobivasse vormi viimine. Seetõttu ei keskendu käesolev õppeaine (erinevalt ainekursusest Sissejuhatus kvantitatiivsetesse meetoditesse) korrastatud andmestike statistilisele analüüsile, vaid eri tüüpi andmete (sh tekstiandmed, ruumiandmed, ajaandmed, veebist/sotsiaalmeediast kogutud andmed) töötlemisele, uurimisele, analüüsiks ette valmistamisele. Seega annab käesolev õppeaine põhilised teadmised ja oskused, mis võimaldavad andmetega toime tulla päriselulistes olukordades, kus oluline informatsioon pole andmetest koheselt kättesaadav. Kursuse praktiline osa ehk andmete töötlemine ja analüüs viiakse läbi R-ga (ei eelda eelnevat kogemust R-i kasutamisega).\n\nIÜSH õppekaval läbitakse reeglina eelnevalt kursus Sissejuhatus kvantitatiivsetesse meetoditesse, aga see pole Andmepädevuse kursuse võtmiseks tingimata vajalik. Andmepädevuse ainekursus on soovituslik eeldusaine kursusele Kvantitatiivsed meetodid.Objectives/eesmärkid:  Ainekursuse eesmärk on anda osalejale  (1) ülevaade erinevat liiki andmete ja andmetüüpide eripäradest, (2) praktilisi oskusi ja teadmisi eri liiki andmestike tehniliseks töötlemiseks R-s (sh ümberstruktureerimiseks, liitmiseks, kaalumiseks), (3) praktilisi oskusi ja teadmisi eri liiki andmete esmaseks sisuliseks analüüsiks R-s, sh andmete visualiseerimiseks ja (4) praktilisi oskusi ja teadmisi andmete veebist kogumiseks.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane - teab erinevaid andmeliike ja orienteerub nende erinevustes,  - oskab erinevat liiki andmeid (arvulisi ja tekstiandmeid, ajaandmeid, ruumiandmeid, veebist kogutud andmeid) töödelda, analüüsiks ette valmistada ja nende esmast analüüsi teha - orienteerub erinevates diagrammitüüpides ja oskab R-s andmeid visualiseerida lähtuvalt andmete iseloomust, - oskab andmestikke vastavalt vajadusele ümber struktureerida pikk- ja laiformaati ja andmestikke ühendada, - teab põhilisi andmete kaalumise viise ja oskab andmeid kaaluda lähtuvalt uuringudisainist, - teab ja oskab kasutada veebist andmete kogumise põhilisi võimalusi, - on tutvunud põhiliste andmekaitse ja -eetika küsimustega, - orienteerub R-i andmetüüpides ja andmetöötluse loogikas ning oskab R-i kasutada eri liiki andmete töötlemiseks ja esmaseks analüüsiks."}