{"KURSUSE_NIMI": "Sotsiaalsed digipädevused", "KURSUSE_KOOD": "SVUH.00.178", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 17, "practice": 0, "seminar": 17, "colloquium": 0, "web_learning": 0, "independent_work": 122, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Siin kursusel tegeleme digikeskkondades edukalt hakkama saamise nö \"inimlike\" aspektidega - info vastuvõtu ja loomise, oma identiteedi ja maine kujundamise ning haldamisega veebiplatvormidel, nutiseadmete ja vaimse heaolu ning paljude muude seonduvate teemadega. Lisaks püüame näha mikrotasandist (inimene) kaugemale, mõtestades organisatsioonides, institutsioonides ja ühiskondades toimuvaid muutuseid, mille taga võib olulise tegurina näha info- ja kommunikatsioonivahendite tormilist arengut.Objectives/eesmärkid:  Kursuse eesmärk on anda oma õpingute alguses olevatele tudengitele ülevaade digipädevustest, mis on tihedamalt seotud sotsiaalsete oskuste ja teadmistega. Kursusel kohtuvad erinevad akadeemilised (sotsiaalteaduslikud) distsipliinid ning õppija saab esmase ülevaate ja edasised õppimissoovitused erinevate erialade ning valdkondade fookusteemadest ja käsitlusviisidest digipädevuste suures raamistuses.Learning outcomes/õpiväljund:  Pärast selle kursuse läbimist tudeng:  - teab erinevaid oskuseid ja teadmisi, mida loetakse digipädevuste suure üldteema alla - oskab leida ja kasutab olemasolevaid tööriistu ja õppevahendeid, mille abil on võimalik oma digipädevusi tõsta - tunneb ära erinevaid sotsiaalteaduslikke erialasid/distsipliine - otsib ja leiab usaldusväärseid akadeemilisi teaduspõhiseid allikaid - harjutab digiplatvormidel toimuvat professionaalset sisuloomet - kasutab valdkonnas kasutusel olevaid erialaseid mõisteid (nt infokorratus, disinformatsioon, andmestumine, narratiiv jne) - reflekteerib oma õpikogemust ning nutiseadmete ja digiplatvormide rolli ja funktsioone oma elus.  - töötab koos kaastudengitega ühise eesmärgi nimel, esitleb oma tööd teistele - kasutab õppetöös peamisi Tartu Ülikoolis kasutusel olevaid õppeplatvorme"}