{"KURSUSE_NIMI": "Kogukondade arendamise teooriad", "KURSUSE_KOOD": "SVUH.00.256", "EAP": 5, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "kevad", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate teoreetilistest kontseptsioonidest kogukondade arendamise valdkonnas ning kogukonna arendamise nüüdisaegsest praktikast. Kursusel analüüsitakse kogukondade arendamise erinevate lähtekohtade problemaatikat ja kogukondade arendamise erinevaid vorme. Lisaks eelnevale analüüsitakse kogukondade arendamise praktikaid ja võimalusi kogukondade toimimise toetamiseks.\nKogukondade kujunemist mõjutanud protsessid asetatakse majandusliku, kultuurilise, sotsiaalse ja looduskeskkona koosmõjust tulenevasse konteksti ning kasutatakse neid teadmisi potentsiaalsete arendamisvõimaluste leidmiseks. Praktilise ülesandena analüüsitakse lootustandvaid kogukondade arendamise näiteid Eestis ja välismaal, sh erinevate kogukondade spetsiifilist haavatavust ja sotsiaalset säilenõtkust kujundavaid tegureid, õpitakse eristama edutegureid ning neid kontekstispetsiifiliselt edasiarendavalt rakendama teistes kogukondades. Kõik see asetatakse Eesti konteksti ehk sotsio-kultuurilisse raamistikku.Objectives/eesmärkid:  Kursuse eesmärk on anda teadmised kogukondade arendamise teoreetilistest kontseptsioonidest ja strateegiatest, kogukondade kujunemist mõjutavatest protsessidest ning\nkogukondade arendamise praktikat kujundavatest teooriatest, väärtustest, dilemmadest ning infrastruktuurist.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: - tunneb kogukonna arendamise teoreetilisi kontseptsioone; - teab, millistele põhimõtetele ja kontseptsioonidele tugineb tänane kogukondade arendamise praktika; - teab, kuidas kujundada ja tasakaalustada protsesse kogukonna õiglasemaks ja kestlikuks toimimiseks; - analüüsib erinevaid kaasaegseid edukaid kogukonnatöö ja kogukonna arendamise praktikaid, oskab edutegurid ära tunda ja neid edasiarendavalt kontekstispetsiifiliselt rakendada; - märkab ja mõistab sotsiaalse positsiooni, haavatavuse, segregatsiooni ja polariseerumise aspekte kogukonnas; - rakendab kestlikkuse põhimõtteid kogukonna arendamisel."}