{"KURSUSE_NIMI": "Kogukonna arendamise alused", "KURSUSE_KOOD": "SVUH.00.196", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 8, "colloquium": 0, "web_learning": 0, "independent_work": 148, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate teoreetilistest lähenemistest kogukonnatöös ja kogukonna arendamises ning kogukonna arendamise nüüdisaegsest praktikast. Kursusel käsitletakse kogukonna mõistet (sh ka online kogukondi), tunnuseid ja erinevaid struktuure, õpetatakse praktilisi meetodeid kogukonna tasakaalustatud koostöö arendamiseks. Kogukondade kujunemiste mõjutanud protsessid asetatakse majandusliku, kultuurilise, sotsiaalse ja looduskeskkona koosmõjust tulenevasse konteksti ning kasutatakse neid teadmisi potentsiaalsete arendamisvõimaluste leidmiseks ja elluviimiseks. Praktilise ülesandena analüüsitakse lootustandvaid kogukonnatöö ja kogukonna arendamise näiteid Eestis ja välismaal, sh erinevate kogukondade spetsiifilist haavatavust ja sotsiaalset säilenõtkust kujundavate tegurite mõistmist, õpitakse eristama edutegureid ning kontekstispetsiifiliselt edasiarendavalt rakendama teistes kogukondades. Kõik see asetatakse Eesti konteksti spetsiifilistele sotsio-kultuurilisse raamistikku ja seostatakse pärimusteadmusega.Objectives/eesmärkid:  Kursuse eesmärk on anda teadmised nüüdisaegsetest kogukonnatöö ja kogukonna arendamise teooriatest ja meetoditest, kogukondade kujunemist mõjutanud protsessidest Eestis ning oskused kasutada neid teadmisi kogukondade sotsiaalse säilenõtkuse kujundamiseks.Learning outcomes/õpiväljund:  Aine läbinud üliõpilane: - tunneb kogukonna arendamise teoreetilisi käsitlusi ja nüüdisaegseid rakendamise põhimõtteid; - kujundab ja tasakaalustab protsesse kogukonna õiglasemaks ja kestlikuks toimimiseks; - analüüsib erinevaid kaasaegseid edukaid kogukonnatöö ja kogukonna arendamise praktikaid, oskab edutegurid ära tunda ja neid edasiarendavalt kontekstispetsiifiliselt rakendada; - märkab ja mõistab haavatavuse, segregatsiooni ja polariseerumise ilminguid ja piiranguid kogukonnas ning kujundab säilenõtkuse arendamise protsesse; - rakendab kestlikkuse põhimõtteid kogukonna arendamisel."}