{"KURSUSE_NIMI": "Heaolu ja selle mõõtmine", "KURSUSE_KOOD": "SVUH.00.179", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Ainekursusel antakse ülevaade heaolu mitmekülgsest käsitlusest, teooriatest ning erinevatest mõõtmise ja hindamise võimalustest nii indiviidi kui ühiskonna tasandil. Käsitletakse heaolu mõõtmist erinevates eludomeenides: töö, pere, tervis, eluase, keskkond jne. Õpitakse tundma heaolu mõõtmist erinevates elanikkonnarühmades, regioonide ja riikide lõikes. Käsitletakse heaolu, sh eludomeenipõhist heaolu, mõjutavaid tegureid ning heaolu tulemeid.Objectives/eesmärkid:  Anda ülevaade heaolu erinevatest käsitlustest, teooriatest ja interdistsiplinaarsest mõõtmisest; heaolu mõõtmisest erinevates eludomeenides, sh indikaatorite kasutamisest ja loomisest; heaolu mõõtmisest erinevates elanikkonnarühmades, regioonides ja riikides; heaolu, sh eludomeenipõhist heaolu, mõjutavatest teguritest ja selle tulemitestLearning outcomes/õpiväljund:  Ainekursuse läbinud üliõpilane: * Tunneb heaolu mitmekülgset käsitlust ning kaasuvaid mõisteid (õnnelikkus, elukvaliteet, rahulolu eluga). *Tunneb põhilisi heaolu, sh eludomeenipõhise heaolu teooriaid * Oskab välja tuua ja eristada heaolu mõõtmiseks kasutatavate indikaatorite tüüpe ning nende kasutusvõimalusi * Teab olulisimaid heaolu, sh eludomeenipõhise heaolu jaoks loodud indikaatoreid, nende kasutusvõimalusi ja loomisvõtteid. * Teab olulisimaid regionaalse ja riigiti võrreldavate ning erinevate elanikkonnarühmade heaolu mõõtvaid indikaatoreid, nende kasutusvõimalusi ja loomisvõtteid. * Tunneb heaolu, sh eludomeenipõhist heaolu, mõjutavaid tegureid  *Tunneb heaolu tulemeid Enamasti toimub reaalajas e-loeng (vt ajakava). Nendel kordadel kui reaalajas e-loengut pole (ajakavas: e-õpe), panevad õppejõud hiljemalt esmaspäevaks kella 12-ks loengumaterjalid (nt eelsalvestatud videoloeng, kirjalikud materjalid) Moodle'sse üles; pärast loengumaterjalide läbi töötamist on Moodle'is võimalik õppejõult küsimusi küsida. Iga loenguga käib kaasas ülesanne/harjutus/test (kirjeldus Moodle'is) - iga kord on maksimaalselt võimalik saada 3 punkti. Need ülesanded moodustavad 45% (võimalik saada max 3 x 15 = 45 punkti) kursuse lõpphindest. Nende tegemata jätmisel on keeruline kursust läbida. Tagasiside/punktid paneb õppejõud Moodle'sse. Eksam toimub samuti Moodle'is."}