{"KURSUSE_NIMI": "Kommunikatsioon ja selle juhtimine", "KURSUSE_KOOD": "SVUH.10.003", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 4, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse käigus antakse esmane ülevaade kommunikatsioonijuhtimise valdkonnast (töö erinevates organisatsioonides, sise- ja väliskommunikatsioon, koostöö teiste valdkondadega) ning õpetatakse rakendama kommunikatsioonijuhtimise tavapärasemaid võtteid (huvipoolte määratlemine, sotsiaalmeedia kasutamine, pressiteate kirjutamine, kommunikatsiooni planeerimine ja mõõtmine, eetika ja seadustega arvestamine)Objectives/eesmärkid:  Õppeaine eesmärk on anda neile ajakirjanduse ja kommunikatsioonijuhtimise ning muude erialade magistriõppe esimese aasta tudengitele, kes pole varem kommunikatsiooni õppinud: * esmane ülevaade kommunikatsioonijuhtimisest üldiselt * võimalus tundma õppida ja rakendada tavapärasemaid kommunikatsioonijuhtimise võtteidLearning outcomes/õpiväljund:  Õppeaine edukal läbimisel üliõpilane: * omab ülevaadet kommunikatsioonijuhtimise valdkonnast (töö erinevates organisatsioonides, sise- ja väliskommunikatsioon, koostöö teiste valdkondadega) * oskab rakendada kommunikatsioonijuhtimise tavapärasemaid võtteid (huvipoolte määratlemine, sotsiaalmeedia kasutamine, pressiteate kirjutamine, kommunikatsiooni planeerimine ja mõõtmine, eetika ja seadustega arvestamine) Õppeaastal, 2024/2025, toimub õppetöö täismahus veebiõppena, st auditoorseid kohtumisi ei ole. E-kohtumisteks kasutame Moodle keskkonnas olevat Zoomi rakendust. Kohtumised toimuvad otseüleakannetena, tudengid saavad esitada külalistele ja õppejõududele küsimusi ja osaleda omavahelistes aruteludes. Kohtumisi ei lindistata. Kõik õppematerjalid ja kodutöödega seonduv on saadaval Moodle keskkonnas, millega tudengid liidetakse esimese kohtumise ajaks. Vastutav õppejõud saadab tudengitele ka vastavasisulise kirja koos täpsemate juhistega."}