{"KURSUSE_NIMI": "Kogukonnast väljalangemise riskid ja ennetamine", "KURSUSE_KOOD": "SVUH.00.167", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 16, "practice": 0, "seminar": 16, "colloquium": 0, "web_learning": 0, "independent_work": 124, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Aine on interaktiivne, mis tähendab, et iga kohtumine koosneb lühikesest teoreetilisest sissejuhatusest, millele järgneb arutelu rühmades, vajadusel lahendatakse huvipakkuvaid elulisi juhtumeid. Õppijad võivad ise pakkuda juhtumid nende endi praktikast, mida lahendatakse üheskoos. Juhtumite lahendamisel tuleb kasutada olemasolevaid rahvusvahelisi ja Eesti teemakohased seadusandluse sätteid, poliitikaanalüüse ning olemasolevaid uuringutulemusi. See võimaldab õppijatel ühendada nende praktilisi kogemusi, teoreetilisi teadmisi ning avardada professionaalset kompetentsi. Aine raames on planeeriud kasutada erinevaid mängulisi meetmeid, mis võimaldavad õppijatel katsetada erinevaid rolle, nt seda, kuidas olla hüljatud laps, keda keegi ei kuula, alaelaine õigurikkuja, keda demoniseeritakse, ebapiisava teadmisega praktik, kes on ülekoormatud bürokraatlike ülesannetega jms.Objectives/eesmärkid:  Kursus annab ülevaate sotsiaalsetest protsessidest ja olukordadest, mis tekitavad riske teatud kogukonna liikmetele, rühmadele marginaliseeruda ning kogukonnast või ühiskonnast välja langeda. Nende protsesside mõtestamisel keskendume hälbekäitumise sotsioloogia teoreetilisele teadmisele (seletusteooriad). Ohtude ja riskide mõistmiseks ja ennetamise aluseks on sotsiaalpoliitilised analüüsid, nt Eestis hiljuti läbiviidavate reformide mõju analüüs, sh lastekaitsesüsteemi ja asendushoolduse reform (2016) alaealiste õigusrikkujate erikohtlemise reform (2018).  Samas on kavas aine raames keskenduda subjekti perspektiivile ehk analüüsida neid reaktsioone, mida ebapiisav lõimumine ja tõrjumine inimesel/grupil esile kutsub ning hinnata erinevaid sekkumisviise, mis marginaliseerumist ja kogukonnast välja langemist pigem toetavad ning võrdluseks tuua positiivseid ja kaasavaid sekkumisviise, nt taastav õigus, narratiivi teraapia ja lahenduskeskse lühiteraapia, mis aitavad marginaliseerumist peatada ning tugevdavad sidusa ühiskonna arengut.Learning outcomes/õpiväljund:  Kursuse raames tutvuvad magistrandid marginaliseerimisprotsessi seletavate teooriatega, mis käsitlevad indiviidi/gruppe/kogukondi sotsiaalsetes suhetes nende keskkondadega. Keskendutakse individuaalsete iseärasuste ja suhete koosmõjule inimese/grupi/kogukonna valikutes. See on vältimatu teadmine selleks, et mõista sotsiaalseid riske ja neid ennetada. Ühelt poolt peab hea praktik teadma, et ükski inimene ei sünni kurjategijana, selleks ta areneb suheldes oma kasvukeskkonnas olevate teiste inimeste ja institutsioonidega. Sellepärast on keskkonna riskide analüüs ennetamiseks ja sekkumiseks vajalik, et vältida üksikindiviidi süüdistamisele keskendumist. Kursuse lõpuks üliõpilane  -\ttunneb põhilisi hälbivat käitumist ja marginaliseerimist seletavaid teooriaid; -\ttunneb üldisi sotsiaalseid riske, mis võivad tekitada inimeste, rühmade ja kogukondade marginaliseerumist; -\toskab analüüsida ja hinnata neid riske, näeb tervikpildi; -\ttunneb kaasaja teaduspõhiseid sekkumis- ja ennetamisviise; -\tsuhtub sotsiaalsetesse riskidesse ning ennetusse professionaalselt ja vastutustundega; -\toskab vältida üksikinimese/grupi/kogukonna süüdistamist, teades, et süüdistamine vaid süvendab marginaliseerumise riske; -\ton oma professionaalses tegevuses eetiline. Ainekavas võivad toimuda muudatused ettenägemata põhjustel. Nendest informeeritakse õppijaid esimesel võimalusel."}