{"KURSUSE_NIMI": "Kogukonna arendamise kavandamine ja hindamine", "KURSUSE_KOOD": "SVUH.00.250", "EAP": 9, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 10, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 224, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Loengute, arutelude ja praktiliste ülesannete toel õpitakse tundma kogukondade arendamist kujundavaid regulatsioone ning otsitakse optimaalseimaid võimalusi  kogukonna arendamiseks olemasolevate poliitikameetmete ja haldusraamistiku tingimustes. Paralleelselt auditoorse tööga koostavad üliõpilased rühmatööna tegevusplaani ühe konkreetse kogukonna arendamiseks, mis sobitub olemasolevasse sotsiaalmajanduslikku, poliitilisse, õiguslikku ja kultuurilisse konteksti ning analüüsivad sellega kaasnevaid mõjusid. Kursus lõpeb koostatud tegevusplaani kaitsmisega.Objectives/eesmärkid:  Aine eesmärk on anda teoreetilised teadmised ja praktilised oskused kogukondade arendamisele suunatud tegevuste kavandamiseks ja hindamiseks, arvestades ümbritseva sotsiaalmajandusliku, poliitilise, õigusliku ja kultuurilise keskkonna võimalusi ja piiranguid ning  kaasnevaid sotsiaalseid mõjusid.Learning outcomes/õpiväljund:  Õppeaine läbinud õppija: - omab süsteemset ülevaadet kogukonna arendamisega seotud  õigusaktidest, arengudokumentidest ja poliitikameetmetest erinevatel valitsustasanditel; -\toskab kavandada kogukonna arendamise eesmärgist lähtuvaid  tegevusi ning seostada neid olemasolevate õiguslikest regulatsioonidest, arengusihtidest ja poliitikameetmetest tulenevate võimaluste ja piirangutega; -\tmõistab sotsiaalsete mõjude hindamise üldist loogikat, tunneb mõjude analüüsi  meetodeid ning oskab neid rakendada lihtsamate mõjuanalüüside teostamisel. VÕTA-ga ülekandmine on võimalik kui esitada midagi portfoolio-laadset - analüüs sellest, kuidas mõnes kogukonnaprojektis on asjatundlikult ära kasutatud erinevate regulatsioonide ja rahastusmehhanismide võimalusi ja piiranguid ja ning hinnatud nende mõjusid."}