{"KURSUSE_NIMI": "Erialaoskuste jätkukursus", "KURSUSE_KOOD": "SVUH.00.120", "EAP": 6, "KURSUSE_TYYP": "Praktika", "KURSUSE_KEELED": ["eesti keel"], "VOTA": false, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 0, "practice": 0, "seminar": 10, "colloquium": 0, "web_learning": 0, "independent_work": 146, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "pass", "KIRJELDUS": "Kursuse eesmärgiks on ajakirjanduse ja kommunikatsiooni erialaoskuste ja -teadmiste intensiivne edasi arendamine, mis toimub tihedas koostöös erialaorganisatsioonidega. Kursuse käigus sooritavad tudengid erinevates ajakirjanduse, meedia ja kommunikatsiooniga tegelevates organisatsioonides individuaalsele arengule keskendudes tööülesandeid, milles rakendatakse ja arendatakse edasi praktiliste erialaainete (Praktiline ajakirjandus I ja II, Praktiline kommunikatsioonitöö I ja II) raames omandatud oskuseid ja teadmisi. Tudeng peab kursusel osaledes olema valmis töötama väljaspool harjumuspärast õppekeskkonda.Objectives/eesmärkid:  Kursuse eesmärgiks on ajakirjanduse ja kommunikatsiooni erialaoskuste ja -teadmiste intensiivne edasi arendamine, mis toimub tihedas koostöös erialaorganisatsioonidega. Kursuse käigus sooritavad tudengid erinevates ajakirjanduse, meedia ja kommunikatsiooniga tegelevates organisatsioonides individuaalsele arengule keskendudes tööülesandeid, milles rakendatakse ja arendatakse edasi praktiliste erialaainete (Praktiline ajakirjandus I ja II, Praktiline kommunikatsioonitöö I ja II) raames omandatud oskuseid ja teadmisi. Tudeng peab kursusel osaledes olema valmis töötama väljaspool harjumuspärast õppekeskkonda, eelnevatel aastatel on tudengid loonud podcaste, kirjutanud popteaduslikke artikleid, õpetanud põhikoolis, korraldanud meediapädevuste nädala üritusi, teinud mentoritega koos tööd EPLis ja Pärnu Loovlinnakus, ning vedanud käima projekti Solaride.Learning outcomes/õpiväljund:  Tudeng: - arendab iseseisvalt edasi erialaseid teadmiseid ja oskusi - rakendab erialaseid teadmisi ja oskusi praktilises töös - analüüsib iseenda tegevust, tugevusi ja nõrkusi Möödunud projektid:\n\n2021/2022: 1). Pärnu Loovlinnaku kommunikatsiooniplaani ja visiooni välja töötamine (juh Murumaa-Mengel); 2). fotograafia erikursus (juh. Murumaa-Mengel)\n\n2020/2021: 1.) IREXi meediapädevuste projekti ekspertide intervjueerimine, õppe-podcastide loomine (juhendajad Maria Murumaa-Mengel, Maria Kristiina Prass). 2.) Teaduskommunikatsioon (Marju Himma-Kadakas; Martin Meitern). 3.) \"Praktiline ajakirjandus\" ja \"Digipädevused\" valikkursuste õpetamine Tartu Erakoolis (juhendaja Maria Murumaa-Mengel, Maria Kristiina Prass). 4.) Kommunikatsioonitudengite intensiivkursus Solaride projekti turundus- ja kommunikatsioonitiimis (juhendaja Kristel Leif ja Maria Murumaa-Mengel) 5.) Meediapädevuste nädala ürituste korraldamine (juhendaja Murumaa-Mengel).\n\n2019/2020: 1.) ajakirjandustudengite intensiivkursus EPL toimetuses (juhendaja Signe Ivask). 2.) Kommunikatsioonitudengite intensiivkursus Solaride projekti turundus- ja kommunikatsioonitiimis (juhendaja Kristel Leif, Maria Murumaa-Mengel)"}