{"KURSUSE_NIMI": "Uuema teoloogia ajalugu", "KURSUSE_KOOD": "USUS.02.085", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "kevad", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 32, "practice": 0, "seminar": 30, "colloquium": 0, "web_learning": 0, "independent_work": 94, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "19. sajand on protestantlikus teoloogias epohh, mil teoloogia jõuab n.ö päriselt uusaega kohale ning omandab püüdlustes mõtelda ja artikuleerida kristliku usu tõde ja relevantsust ajastu probleemi- ja tõeteadvuse horisondil enneolematult rikkaliku mitmekesisuse ja paljuse. Alguse saavad terve rida teoloogia paradigmasid, mille tundmine kergendab oluliselt kaasaegses teoloogilises diskursuses orienteerumist (seejuures sugugi mitte üksnes evangeelse teoloogia omas!), kuivõrd viimane on suurel määral mõistetav vaikimisi või avalikult toimuva kriitilise toetumisena või konstruktiivse vastandumisena 19. sajandil väljatöötatud põhjapanevatele programmidele. Epohhaalne tähendus kogu järgnevale teoloogiale on Friedrich Daniel Ernst Schleiermacheril (1768-1834), kelle subjektiivsusteoreetilisel teoloogiapõhjendusel asub seetõttu ka üks raskuspunkt.\tSamuti käsitleb kursus teoloogilise mõtte arengut 20. sajandil, võttes arvesse selle sotsiaal-poliitilist konteksti.Objectives/eesmärkid:  Anda ülevaade 19. ja 20. sajandi teoloogiast evangeelses (protestantlikus) perspektiivis, tutvustades olulisemaid isikuid, peamisi küsimuseasetusi ning mõjukaimaid kontseptsioone, mis mõjutavad teoloogilist diskussiooni 21. sajandi algul. Nõnda on kursus ühtlasi sissejuhatus tänapäeva süstemaatilise teoloogia põhiprobleemidesse.Learning outcomes/õpiväljund:  Kursuse läbinud üliõpilane: 1) omab ettekujutust väljakutsetest, mida uusaegse maailma väljakujunemine teoloogiale esitab;  2) orienteerub üldjoontes valgustusjärgse teoloogia peamistes katsetes mõtelda kristliku usu tõetaotlust; 3) tunneb lähemalt ühte 19. sajandil esitatud teoloogiaparadigma ning vastava teoloogilise diskussiooni käiku 20. sajandil, millel on teoloogia tänastes arengutes otsene roll"}