{"KURSUSE_NIMI": "Lähis-Ida kultuurilised ja religioossed juured", "KURSUSE_KOOD": "USUS.08.023", "EAP": 6, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel", "inglise keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 28, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 126, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Tänapäeva Lähis-Ida ühiskondi ja neis aset leidvaid sündmusi on võimatu mõista ilma tundmata religiooni mõju nende kujunemisele läbi ajaloo. Ainekursus \"Lähis-Ida kultuurilised ja religioossed juured\" vaatleb lähemalt Lähis-Ida ühiskondade peamisi ajaloolis-kultuurilisi aluseid (milleks on Kaanani, Araabia, Indo-Euroopa ja Põhja-Aafrika kultuur) ning religiooni osakaalu ja mõju neis. Kursuse käigus lähenetakse neile teemadele korraga temaatiliselt ja kronoloogiliselt, pakkudes sel moel tudengitele võimaluse näha Lähis-Ida ühiskondades aset leidnud muutusi kui ka kultuurilis-religioosset järjepidevust.Objectives/eesmärkid:  Ainekursuse \"Lähis-Ida kultuurilised ja religioossed juured\" peamine eesmärk on anda tudengitele ülevaade ulatuslikest ajaloolis-kultuurilistest ja religioossetest teguritest, mis on Lähis-Ida ühiskondade kujunemist, nende ülesehitust ja iseloomu antiikajast alates mõjutanud. Ühtlasi on kursuse eesmärgiks näidata ka seda, mil moel ja mil määral sõltuvad religioosne ning ilmalik võim kultuurikontekstist, kus need tekivad ning tutvustada neid ajaloolis-kultuurilisi kontekste lähemalt ka tudengitele. Laiahaardeline ajalooline ja geopoliitiline lähenemine teemale võimaldab mõista religiooni rolli ja dünaamikat tänapäevastes Lähis-Ida ühiskondades ning nende ajaloolis-kultuurilisi eripärsid.Learning outcomes/õpiväljund:  Tudeng *\ton tuttav Lähis-Idas esinevate peamiste kultuuripiirkondade ja religioonidega, *\tmõistab selgemalt religiooni rolli nii Lähis-Ida minevikus kui olevikus, *\tsuudab Lähis-Ida ühiskondades aset leidnud ja leidvate protsesside üle iseseisvalt, kriitiliselt ja reflektiivselt arutleda, *\tomab Lähis-Ida erinevate ühiskondade ja religioossete süsteemide analüüsimiseks vajalikku võrdlevat vaatenurka,  *\tsuudab oma teadmisi ja arusaama antud ainevaldkonnast sidusal ja selgel moel nii suuliselt kui ka kirjalikult edasi anda."}