{"KURSUSE_NIMI": "Loodus eesti usundites", "KURSUSE_KOOD": "USUS.03.115", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "päevaõpe", "TUNDIDE_JAOTUS": {"lecture": 30, "practice": 0, "seminar": 0, "colloquium": 0, "web_learning": 0, "independent_work": 48, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus annab ülevaate loodusega suhestumise erinevatest viisidest  Eesti usundites.  Muinasusundi keskkond oli loomulikul viisil looduslik, inimene sõltus sellest ning kogu usundiline maailm oli sellega seotud. Katoliiklikul perioodil säilis osa muinasusundi ainesest ja pühapaikade kohamälu. Osa neist kaeti kristliku tähendusega, osa säilitas endise tähenduse ja funktsiooni. 19. sajandil koos rahvusluse kujunemisega kujunes ka romantismist lähtunud loodust väärtustav osa rahvuslikus identiteedis mitmesugustes müüdilistes vormides. Nende baasil kujunesid 20. sajandil uuspaganlikud voolud. 21. sajandi alguses on aset leidnud pärimuslike looduslike pühapaikade taasväärtustamine ning kasutusele võtmine. On lisandunud ka isiklikud looduslikud pühapaigad ning jätkunud loodusega seotud usundiline müüdiloome.Objectives/eesmärkid:  Kursuse eesmärk on anda ülevaade loodusega seotud uskumustest ja praktikatest usundilises kontekstis Eestis alates muinasajast kuni tänapäevani.Learning outcomes/õpiväljund:  Üliõpilane tunneb erinevaid loodusega seotud usundilisi diskursusi, oskab kasutada erialast terminoloogiat ning analüüsida looduse  usundilisi diskursusi kultuurilise konstruktsioonina. Kuna auditoorne õppetöö algab kursesel \"Loodus eesti usundites\" alles 4. oktoobril, siis tuleb teil teha iseseisvat tööd kogu septembrikuu jooksul. Iseseisvaks tööks on videoloengute vaatamine ja kohustusliku kirjanduse lugemine, mille põhjal tuleb koostada endale konspekt. \n\nVaadates loenguid ja lugedes artikleid tuleb pöörates erilist tähelepanu loengupidaja ja autori(te) kasutatud mõistetele ja nende tähendusele ning mõttekäikudele.\n\nLoengud ja artiklid\nTõnno Jonuksi loeng UTTV-s 16.09.2015: https://www.uttv.ee/naita?id=22526\nMarju Kõivupuu loeng UTTV-s 25.11.2015: https://www.uttv.ee/naita?id=22986\nTõnno Jonuks, Martti Veldi, Ester Oras \"Looduslikud pühapaigad - uue ja vana piiril\" - Vikerkaar nr 7-8, 2014 https://www.academia.edu/8224617/Looduslikud_p%C3%BChapaigad_uue_ja_vana_piiril\nPikne Kama \"Eesti looduslike pühapaikade inventuurist ja kaitsest 2022. aastal\" - Mäetagused nr 83 https://dea.digar.ee/?a=is&oid=AKmaetagused202208&type=staticpdf\nLona Päll \"Kohapärimuse roll keskkonnakonflikti diskursuses: Paluküla hiiemäe juhtum\" - Mäetagused nr 83 https://dea.digar.ee/?a=is&oid=AKmaetagused202208&type=staticpdf"}