{"KURSUSE_NIMI": "Religioon ja poliitika", "KURSUSE_KOOD": "USUS.01.057", "EAP": 3, "KURSUSE_TYYP": "Tavaline aine", "KURSUSE_KEELED": ["eesti keel"], "VOTA": true, "SEMESTER": "sügis", "OPPETYYP": "sessioonõpe", "TUNDIDE_JAOTUS": {"lecture": 14, "practice": 0, "seminar": 2, "colloquium": 0, "web_learning": 0, "independent_work": 62, "individual_work": 0, "internship": 0}, "HINDAMISSKAALA": "grade", "KIRJELDUS": "Kursus käsitleb religiooni ja poliitika seoseid tänapäeva maailmas. Kursusel antakse ülevaade analüütilistest ja teoreetilistest lähenemistest religiooni ja poliitika akadeemilisel uurimisel. Vaadeldakse religiooni mõju poliitilistele muutustele tänapäeva maailmas ja ka vastupidi - religiooni kohandumist poliitiliste muutustega. Et ükski maailma suurreligioonidest pole homogeenne, vaid jaguneb erinevate poliitiliste hoiakutega koolkondadeks ja rühmitusteks, vaadeldakse religiooni ja poliitika suhteid nii olulisemates regioonides ja konfliktikolletes kui ka üksikute isikute ja rühmituste näitel.Objectives/eesmärkid:  - uurida religiooni, poliitika ja ühiskonna suhet kaasaegses maailmas  - tutvustada religiooni ja poliitika uurimisel kasutatavaid mõisteid, teooriaid ja lähenemisi  - võrrelda Ida- ja Lääne-Euroopa usulise poliitika kogemusi üldisemate religiooni ja poliitika arengutega maailma mitte-kristlikes kultuurides/tsivilisatsioonidesLearning outcomes/õpiväljund:  Kursuse edukalt läbinud üliõpilane: 1. tunneb peamisi kaasaegse sotsiaalteadusliku religiooni ja poliitika uurimisega seotud akadeemilisi debatte 2. oskab analüüsida religiooni ja poliitikaga seotud teemasid, valdkondi ja aspekte sotsiaalteaduslikust lähenemisest lähtudes ning tunneb keskseid mõisteid ja teooriaid, analüütilisi lähenemisi, tüpoloogiaid ja kategooriaid, mida kasutatakse võrdleva poliitika ja rahvusvaheliste suhete lähenemiste puhul 3. omab arusaamist peamistest (alateema)valdkondadest, kus religioon ja rahvuslik politiika ning religioon ja rahvusvaheline poliitika kokku puutuvad 4. omab arusaamist sellest, kuidas mõjutab religiooni ja poliitika suhteid kultuuriline, konfessionaalne, ajalooline, majanduslik ja poliitiline kontekst. 5. oskab tuvastada sarnasusi ja erinevusi viisides, kuidas erinevad usulised toimijad suhestuvad riigi ja kultuurkogukonna, poliitiliste protsesside ja avaliku poliitika tulemitega. 6. oskab iseseisvalt ja sotsiaalteadusliku lähenemise kohaselt religiooni ja poliitikat uurida 7. oskab religiooni ja poliitikaga seotud küsimuste ja probleemidega seotud arutelusid mõista ning neisse aruteludesse ka iseseisvalt panustada."}